{
  "avg_rating_per_demo": {
    "aged_18-29": 6.1,
    "aged_30-44": 5.5,
    "aged_45+": 5.3,
    "aged_under_18": 6.8,
    "females": 6.1,
    "females_aged_18-29": 6.2,
    "females_aged_30-44": 5.6,
    "females_aged_45+": 5.3,
    "females_under_18": 7.5,
    "imdb_staff": 5.8,
    "imdb_users": 5.9,
    "males": 5.8,
    "males_aged_18-29": 6.0,
    "males_aged_30-44": 5.5,
    "males_aged_45+": 5.3,
    "males_under_18": 6.6,
    "non-us_users": 5.8,
    "top_1000_voters": 4.7,
    "us_users": 5.8
  },
  "avg_screens": 913.3636363636364,
  "budget": 13000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 10,
    "month": 5,
    "year": 2013
  },
  "critic_review_count": 169,
  "duration": 93,
  "genres": [
    "comedy"
  ],
  "gross_income": 25675765,
  "max_screens": 2771,
  "mc_avg_user_score": 5.3,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 43,
  "mc_movie_name": "21 and Over",
  "mc_negative_rating_frequency": 29,
  "mc_positive_rating_frequency": 33,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "21 and Over remains enjoyable for what it is and all it cares to be, which is nothing any respectable movie critic should recommend, and I'm down with that."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Writer-directors Jon Lucas and Scott Moore find a nice balance between the over-the-top high jinks and an emotional core, which unexpectedly crystallizes relatively late in the movie."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "The bottom-line on this bottom-baring/bottom-branding farce is “Is it funny, on top of all the shocks?” And yes, it is. On a number of few occasions, all of them involving Jeff Chang."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "This paean to youthful irresponsibility applies the right crude and rude 'tude to its bulging sack of gags to have the desired effect on its target audience."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Promising crude straight-boy humor, but delivering sensitive buddy moments and tons of male nudity, this by-the-numbers gut-buster looks slick, moves fast and packs enough laughs to enliven spring-break receipts and earn its helmers more work."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Lucas and Moore aren’t savvy enough, or brave enough, to truly plumb the gallows humor embedded in their premise."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Certainty, then, is the watchword, and you can be certain of three things: There will be plenty of juvenile energy to power the vehicle; there will be a few mild chuckles en route; there will be no reason to remember the ride the instant it ends."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 42,
      "summary": "21 & Over seems particularly redundant, since a film already exists that’s exactly like \"The Hangover,\" only not as good: It was called \"The Hangover Part II.\" 21 & Over is so slavish in imitating its screenwriters’ big claim to fame that it even ends by teasing a sequel, to which the only sane response is a polite but firm, “Thank you, no.”"
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "Neither as subversively fun as last year’s megadestructive \"Project X,\" nor as creative as \"The Hangover\" (on which these codirectors broke through as screenwriters), this further installment in the millennials-acting-badly genre serves as a distinctly average placeholder."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "In the end, 21 and Over is more exhausting — and exhausted — than funny or wild."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "The movie rambles in a way that dilutes any possibility of edgy discomfort. Lucas and Moore have good control over the timing within the gags; it's the spaces between them that stretch out awkwardly. You can't hate 21 & Over, and you can't laugh at it. The most you can do is just pity it for not being as outrageous as it thinks it is."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "Among the ingredients “21” is missing: the infectiously random silliness of a Zach Galifianakis, the smug hunkiness of a Bradley Cooper, and any sort of Vegas-y gloss whatsoever."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "This is one of those 93-minute movies that seem about 88 minutes too long. Or not worth making in the first place."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "Despite its collegiate setting, 21 and Over is pretty much for people with an IQ of 21 and under."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "For a movie that tries to create and sustain a sensation of wild unpredictability, it's a huge failure. It's not shocking if we've all seen it a thousand times before. With 21 and Over, it's all been there, drank that."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "Yes, surely for them, the lucky few and probable many, 21 and Over will be the Best Movie Ever. For the rest of us, though, it’s something of a chore."
    },
    {
      "critic": "Nicole Herrington",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 20,
      "summary": "The movie’s humor — at the expense of Asians, Latinas and even Serbs — comes off just as tone deaf and random as Seth MacFarlane’s Oscar-night shenanigans."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 20,
      "summary": "How ironic (depressing? predictable?) that the week after we celebrate the best in movies, we are force-fed its very worst. 21 & Over is filmmaking by formula, and evidence of Hollywood’s assumption that appealing to viewers’ basest instincts will always pay off."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 12,
      "summary": "Just because your comedy is dumb doesn’t mean it’s funny."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 12,
      "summary": "By the dictates of the boys-will-be-boys party genre, 21 and Over is so tame that it barely manages to even be offensive."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "This is a movie that celebrates selfishness, stupidity and the mean-spirited insensitivity that goes along with it. We're better than this, America."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Fans of The Hangover and Superbad will be right at home here with this hilarious 'coming-of-age' Comedy that might be pretty similar to those other ones out there, but at the end of the day they are highly entertaining and nothing but fun to watch when you are with mates. The characters are likable and its a well-written storyline despite being a little on the predictable side. All up though an entertaining film that should appeal to the teens and as long as not taken seriously you'll enjoy it.",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "21 & over has only bad thing. It hasn't got many laughs as the trailer promises. Despite that, it's a good comedy with a really good concept (which reminded me a lot ''Hangover'') and a really good cast. It seems a little like a copy of The Hangover but it surely isn't so funny. You will enjoy it and I think if you like Old school, Superbad and Hangover you will like that movie. It's a comedy that will be similar to other comedies. **It is better than Project X** I rate it with 6,5/10",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Eh, it had it's moments. Though, the funny parts didn't balance the stupid parts out so well. Basically, the entire movie was parties and people getting drunk. Therefore, this movie deserves a 4/10.",
      "total_reactions": 1,
      "user": "NotAUsername"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 4,
      "user": "epicmorganguy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I don't even..my brain does not understand the immense stupidity and Idiocy in this movie. This will only appeal to the average 15  18 year old moron who thinks life is about partying and how taking responsibility is for losers. Please for the sake of keeping your IQ at a decent level, do not watch this!",
      "total_reactions": 7,
      "user": "JonnCommen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Much funnier than expected  and clearly better than a 34.  The taller kid does his best Vince Vaughn \"tribute\", and he's serviceable.  His more sincere counterpart is a decent straight.  Jeff Chang fills his role nicely and he's endearing enough for you to pull for him, especially during the extended getting-drunk sequence.  I appreciate his breakin' and his application of his drivers license to the various bouncers.  Jeff Chang's dad (the scientist from Lost) provides a very scary ongoing threat throughout the film.  Nicole looks a little long-in-the-tooth for a college student (which makes sense  she's 30), but she's appealing as the lead dick's girlfriend who befriends Jeff Chang in his time of need.  The Tower of Power sequence is engaging  and more than a little reminiscent of the comedy force Beerfest.  In my theater, there were about 20 guys, no girls, but they were all laughing fairly hard, if that's at all helpful.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "it's actually really funny, much better than project x, but nowhere near as good as superbad, but it's still wildly entertaining nonetheless, you should watch it",
      "total_reactions": 1,
      "user": "wearetheothers"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "In the United States, when a person turns 21, that time is usually land-marked with instances filled with excitement thanks to the upcoming adventures of maturing, independence, self-discovery and of course…you know what, all crap aside, its the day to just get stupid drunk and act a fool like its nobody’s business. Like anybody planning to sleep in a catharsis of vomit and food consumed from the afternoon, 21  Over is a raunchy, absurd, highly energetic and overly confident comedy that unapologetically assaults its audience members with inappropriateness from beginning to end.",
      "total_reactions": 3,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "\"While its not going to be an \"instant classic\" nor is up to par with Project X. But 21 & Over is not afraid to take some jokes to a new level, while the overall vibe is silly & pointless. This is a night that deep down we all dream of living at some point\" ..B+",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Mix \"The Hangover\" with \"Projet X\" and add some \"Superbad\" and you'll get this, nonsense comedy about becoming an adult, getting **** and causing mayhem!   We all laughed our heads off.",
      "total_reactions": 0,
      "user": "lordslayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Movie studios like burning off their comedies in March before the summer blockbusters hit so that they stand a chance, they also burn off bad films here too. Luckily enough 21 & Over isn't much like fellow party comedy Project X which was released last March and felt more like burn off than valid comedy. 21 & Over is about when Jeff Chang (Justin Chon) turns 21 and his old friends Miller and Casey (Miles Teller and Skylar Astin) come to take him out for a night on the town. However the trio soon find out a lot has changed between them and it may take some unexpected events to bring everyone back together. Right off the bat 21 hobbles itself by limiting the screen time of its funniest character. Jeff Chang is hilarious and is sadly not in the film as long as the other two leads. That doesn't mean that Miller and Casey aren't interesting but they do take some time to grow on you, especially Miller whose quite caustic at the beginning and will either entertain people or infuriate them. The fact is that by the end they are 3 very well rounded characters (some might say stereotypes) who can annoy at times but liven up a film that is more coincidence than plot. Their misadventures are tamer than that of Project X so they feel a lot more real and therefore are funnier and more entertaining and the crazy stuff that happens doesn't feel like its from another planet. The film is populated by some odd characters but they never feel ridiculous, even the LSD taking college professor seems oddly believable in the world director Jon Lucas has created. All these side characters provide some good laughs although the required love interest section of the film has nothing to it, if feels wrong and honestly the film didn't need the distraction and it ultimately ruins the ending of one of these characters story because he is forced to do the Hollywood thing and chase after the girl. The film at first suffers from some scripting problems as the film is trying to sound youthful but it doesn't quite ring true but after a while you get used to it, its just not the most expertly written dialogue and it isn't nearly as edgy as they think it is. However it is an enjoyable film because it doesn't take itself too seriously and even the ending where some lesson must be learnt it isn't forced upon you so much that it ruins the fun you had watching the film in the first place.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "21 & Over was absolutely hilarious. It's essentially a lower budget and more youthful version of The Hangover and it delivers with the same type of humor. The acting is adequate enough by the main stars and the events that happen during the night make you laugh from almost beginning to end. The film doesn't take long to get into the plot and you ride the wave until the credits roll. There are some moments that feel a bit too ridiculous but they don't take too much away from the viewing experience. Overall, it's worth checking out if you want a good laugh.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "21 & Over is the directorial debut from the writers of the Hangover trilogy, and it could have easily been called The Hangover Jr. It's Jeff Chang's 21st birthday and his High School friends show up to take him out. With a big interview in the morning, the boys are planning on taking it easy, but things don't quite turn out that way. I was expecting this film to be yet another chance to exploit the magic of the first Hangover film, but surprisingly it does not. The story has many similarities, but also a uniqueness about it. 21 & Over does manage to capture that amazing chemistry and magic that made the Hangover legendary. The whole time I was watching this film, I couldn't help but think, why didn't they put this kind of thought into the Hangover sequels? Don't get me wrong, I liked the sequels, but neither one of this is as good as this film was. Justin Chon, unfortunately only known from the Twilight series, stars in a role that was seemingly made for him. This guy was so freaking funny, that I had to be careful not to piss my pants, almost every time he opened his mouth. The other stand out is Project X's Miles Teller, and while he's much better looking than Alan, he does manage to capture that loveable extreme weirdness that Zack Galifinakis had. It's easy to look at 21 & Over and say it's going to be just like the Hangover, and you wouldn't be wrong. Parts of the film are eerily similar, but the youth factor and college atmosphere does give the film a life of it's own and trust me when I tell you, it was absolutely hysterical.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "The poorly filmed, hand-cam drunken escapes of my life would make a better movie than this could ever hope to be.  Yeah, some of the jokes are funny, but really it's the same movie you've seen before.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Rather typicall teen/highschool/party comedy story wise. A good 93 mins of entertainment. If don't set your expectations too high it's good fun but nothing more.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Watching other people getting drunk and having a good time, usually doesn't work for me, and is the case here. Too many \"wild party\" movies have hit the screen lately and the formula is getting more and more tired. Of course, Hollywood loves their formulas and here it seems simple raunchy behavior is all this movie could conjure up. Films that embark down the dark path of raunch must have wit and verve like the Hangover I and II, otherwise its just young people acting stupidly. If I wanted to see that I hang out with High Schoolers. Of course as there are very few options for movie at the moment, this is better than throwing your money away on the Oz disaster.",
      "total_reactions": 0,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I really hope that this movie doesn't do well. This movie caters to the lowest common denominator of moviegoers, with constant stupidity and epithets against Chinese, blacks, and Eskimos??? Who thought that this was a good idea? Because I would love to trap him or her in a jail cell for life!",
      "total_reactions": 0,
      "user": "Scamp4553"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This movie was absolutely hilarious, i would suggest this movie if you enjoyed the hangover and other such movies of that nature.  Funniest movie to come out this year so far, if your looking for a good narritive, its not for you; this is all about the laughs and fun of being 21.",
      "total_reactions": 0,
      "user": "dariusbthebest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "\"21 and Over\" could celebrate that miraculous moment when the final barrier to adulthood falls by the wayside, as the act of legally buying alcohol instantly goes from forbidden act to routine. However, the movie just uses the moment as a springboard to a cynical college-age \"Hangover\" redo with far fewer developed characters and even less inventive adventures. This is the directorial debut of Jon Lucas and Scott Moore, who wrote \"The Hangover (2009).\" \"21 & Over\" pretends to take chances even as it retraces the same sequences we've already seen in movies like--well--\"The Hangover.\" It's hard to completely hate \"21 & Over,\" but you cannot really laugh at it either. The most you can do is just pity it for not being as outrageous as it thinks it is.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "21 And Over is a movie based on desperate teens who want the law of drinking, smoking and taking drugs. And basically this film is also harmful to religion for Chinese people. 21 And Over deserves a zero.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Not my type of movie at all.  This is a film that should have been straight to dvd along with the American Pie movies.  If you like an unfunny movie where people just get wasted you will like this film.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "This is a fun movie for who just want to see crazy things happen.Even though the beginning was really annoying,it is a fun,crazy movie for when your bored.",
      "total_reactions": 0,
      "user": "ICEExMagic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "a really fun time but it copy's from so many other films its unbelievable  so that's why it gets that score.so go and see it with your mates.",
      "total_reactions": 0,
      "user": "cheekygobl1n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Dont understand the critics... this movie is just awesome! I mean they have a awesome time and also kind of massive problems but still joking about everything and thats my friends is how young people are likely amused! That doesnt mean they live like this or want to live like this! Everyone or nearly everyone knows that live doesnt work like this but guys its a ''Movie'' its not real and it doesnt make (atleast normal people) people think to live like this!",
      "total_reactions": 0,
      "user": "Mauli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "I was recently persuaded by my four male roommates to watch the comedy film “21 & Over”. The movie did not have any well known actors; the three lead roles were Miles Teller, Skylar Astin, and Justin Chon. The focus of the movie was on three high school best friends that meet up at their friend Jeff’s college campus to celebrate his 21st birthday. The setting of the film is present day on a college campus, mostly during the night of Jeff’s birthday.",
      "total_reactions": 0,
      "user": "cassidy233491"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The film is a stale comedy that's knows that it is dumb but it's wooden and un clever. The writer's of \"the hangover\" Scott Moore and Jon Lucas their directorial debut is filled with unfunny one-liners, at times it can be clever and it has it's moments, were is the comedic gold and charm that screenwriters Moore and Lucas use to have?  Since the guys who wrote the script  of \"the hangover\" made this movie and their returning to the party laugh out loud genre we think this will be funny. There is no cleverness from the hangover that is not  in this movie; sure Miles Teller and Skylar Astin are funny and trying but Moore and Lucas's script tries to create party movie cliche's and have  little empathy characters and  tries to be the next \"Project X\" (which was funnier than this!). So Miles Teller plays Miller, he is a lazy idiot who is good at having a good time, Skylar Astin plays Casey he is sophisticated and a nerd who does not like to party that much since highschool. They use to go to high school together  with a friend named Jeff Chang played by Justin Chong (Twilight), he turns twenty one and they take him out to get wasted and everything goes wrong. The humor is cheap and is funny time to time, terrible acting and it's script is not good; I did enjoy the humor and it's fun. Grade B-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "A forgettable comedy, mainly because it is nothing new, and not that funny. It is just another raunchy comedy that does not aspire to be much more than that.",
      "total_reactions": 0,
      "user": "ryanneevman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "Another movie attracting the American Pie era lovers... Which I am. Hangover comes to mind, and so does Superbad.  The audience who enjoys remembering 'that time' they got wasted with friends and make sassy/witty banter with their own groups of friends.",
      "total_reactions": 0,
      "user": "BeingNickDoh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "For all its raunchiness, The Hangover was distinguished as much by its unexpectedly elegant plotting as its cast’s chemistry and its famous setpieces. It was like an out-of-control frathouse that happened to reside in the loveliest building on campus. The Hangover’s myriad knock-offs retained its scatological enthusiasm while abandoning its underlying precision in favor of manic, random wackiness. That’s especially true of 21 & Over, though in its case, the rampant stealing from Todd Phillips’ surprise blockbuster is at least self-plagiarism, since it was written and directed by Hangover screenwriters Scott Moore and Jon Lucas.",
      "total_reactions": 0,
      "user": "TheFilmDoctor"
    }
  ],
  "metascore": 34,
  "name": "21 and Over",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 1,
    "month": 3,
    "year": 2013
  },
  "opening_weekend_income": 8754168,
  "opening_weekend_income_currency": "$",
  "rating": 5.9,
  "rating_count": 62802,
  "rating_freq": {
    "1": 1794,
    "10": 4178,
    "2": 1406,
    "3": 2607,
    "4": 4933,
    "5": 10644,
    "6": 16564,
    "7": 12296,
    "8": 5935,
    "9": 2445
  },
  "release_day": 1,
  "release_month": "March",
  "release_year": 2013,
  "user_review_count": 85,
  "votes_per_demo": {
    "aged_18-29": 32681,
    "aged_30-44": 15873,
    "aged_45+": 1890,
    "aged_under_18": 247,
    "females": 10059,
    "females_aged_18-29": 7048,
    "females_aged_30-44": 1918,
    "females_aged_45+": 225,
    "females_under_18": 86,
    "imdb_staff": 5,
    "imdb_users": 62802,
    "males": 43455,
    "males_aged_18-29": 25303,
    "males_aged_30-44": 13797,
    "males_aged_45+": 1627,
    "males_under_18": 161,
    "non-us_users": 30616,
    "top_1000_voters": 277,
    "us_users": 8543
  },
  "year": 2013
}