{
  "avg_rating_per_demo": {
    "aged_18-29": 7.1,
    "aged_30-44": 7.1,
    "aged_45+": 7.3,
    "aged_under_18": 7.3,
    "females": 7.2,
    "females_aged_18-29": 7.1,
    "females_aged_30-44": 7.2,
    "females_aged_45+": 7.5,
    "females_under_18": 7.0,
    "imdb_staff": 5.0,
    "imdb_users": 7.1,
    "males": 7.1,
    "males_aged_18-29": 7.2,
    "males_aged_30-44": 7.0,
    "males_aged_45+": 7.3,
    "males_under_18": 7.2,
    "non-us_users": 7.1,
    "top_1000_voters": 6.1,
    "us_users": 7.1
  },
  "avg_screens": 37.69230769230769,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 3,
    "year": 2013
  },
  "critic_review_count": 165,
  "duration": 105,
  "genres": [
    "drama",
    "music"
  ],
  "gross_income": 1561577,
  "max_screens": 100,
  "mc_avg_user_score": 7.7,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "A Late Quartet",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Walken was largely typecast in quirky roles as a result of playing the title character's brother in \"Annie Hall,\" so it's something of a delightful irony that 35 years later, Walken finds his most rewarding role leading a terrific ensemble in what amounts to one of the best Woody Allen movies that Allen wasn't involved in making."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "A Late Quartet does one of the most interesting things any film can do. It shows how skilled professionals work."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 83,
      "summary": "Despite too stately a pace at times, and some fairly predictable plot resolutions, the film succeeds thanks to empathetic performances (from Walken and especially Hoffman) and an evident affection for the music and musicians it depicts."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 83,
      "summary": "How many surprises and peaks can Walken possibly have left, after so many movies and memorable roles? Well, there's this one."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 83,
      "summary": "Leave it to Walken to upstage Beethoven."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "Yaron Zilberman's first feature has a solid structure, but as with a piece of music, the way it's played makes all the difference. His principal actors aren't great at faking their instrumental prowess, but they're perfectly in tune with each other, playing artists who've postponed life's decisions in the name of pursuing their craft."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "The leads make sweet music in an affecting four-piece that, if not note perfect, plays well to their individual strengths. A marked improvement overall on this year’s other Quartet."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The screenplay by Seth Grossman and Israeli-American director Yaron Zilberman is old-fashioned and melodramatic but stirring in its portrait of people struggling with individual egos to produce something nobler than themselves."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "For those willing to enter this world and pay attention, A Late Quartet provides distinct and uncommon satisfactions."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The title refers not only to particular music by Beethoven but also to the fictional string quartet of Yaron Zilberman's fussily genteel, overplotted Manhattan tale in which interpersonal stresses build to a crescendo when one of the foursome becomes ill."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Grace notes abound in A Late Quartet, a small, shining gem of a movie that works its way into your heart with insinuating potency of music."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "I was happy watching these actors, happy going behind the scenes of a sober classical music ensemble instead of another druggy rock group, happy hearing Beethoven for a couple of hours. The movie is haut-bourgeois to the bone, but so am I: Let's hear some chamber music and have a little laugh and a cry!"
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "It would be shortsighted to dismiss this deeply felt, musically savvy film, set in a refined cultural precinct of Manhattan, as sudsy melodrama."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "It's rare these days to see an old-fashioned, elegant chamber-piece movie about life and art - let alone one with Christopher Walken as, of all things, a steadying influence."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "It's something of a relief that little is actually resolved in A Late Quartet; Zilberman is at his best when leaving narrative threads hanging rather than trying to tie them together."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "A Late Quartet serves as an acting showcase, particularly for Walken and Hoffman, and makes for an interesting study in artistic ego."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "Centered around four outstanding performances, Yaron Zilberman's fiction-feature debut feels like the work of a filmmaker who knows and appreciates the art form under scrutiny, laying a credible foundation for a story that lays bare the often melodramatic passions of the artistic soul."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 67,
      "summary": "Zilberman's conceit is that these players, who mesh so beautifully in their music-making, are discordant in their personal lives. Those lives are constructed for maximum messiness, turning what might have been resonant drama into high-class soap opera."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "The performances are worth a look, especially since Christopher Walken so rarely gets to play a sane person."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Playing the cello is such a pleasant change of pace that he (Walken) eventually grows on you, scene by scene, proving for the first time since his role as Leonardo DiCaprio's troubled father 10 years ago in \"Catch Me If You Can,\" that he really can act. He - along with the rest of the elegant cast - keeps A Late Quartet in tune when it threatens to go flat."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Measured performances from the seasoned cast balance out a script that errs towards the melodramatic. Hours sweating over those instruments pay dividends too."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2012
      },
      "score": 60,
      "summary": "The sort of movie you should go see with someone you love. You should also hold their hand during the movie. And be thankful that that hand is there."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "Zilberman's minimalistic approach fits the idea of the film better than it fits the actual film. It leaves this melancholy mood piece with some beautiful moments, but unlike Beethoven's work, A Late Quartet ultimately feels unfinished."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "The four leads more often than not transcend the material's calculated moroseness; Ivanir is especially good as a man whose perfectionist facade masks a soul in perpetual turmoil."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "The film mines both the relationship issues and the Upper East Side neighborhoods of Woody Allen's best work, but could use an added dose of the Woodster's jokes to spruce up a self-serious scenario that hits the right notes about half the time."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "A Late Quartet overplays its bass line and loses sight of the melody, making for a movie that is heavy-handed and sluggish. It remains earthbound when it should soar."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Yes, A Late Quartet is disappointing. But it's also pretty bad."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Watching A Late Quartet feels more like sitting through a Classical Music 101 lecture than entertainment."
    },
    {
      "critic": "Nick McCarthy",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "A muted soap opera masquerading as erudite ensemble piece, Yaron Zilberman's A Late Quartet jettisons character plausibility in favor of pop psychology and leaden instrument analogies."
    },
    {
      "critic": "David Denby",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The scenes of the musicians rehearsing or talking about music, with the actors playing parts of Opus 131 themselves (the longer stretches are played by the Brentano Quartet), are fascinating and moving for anyone who loves this music; the rest of the movie is conventional."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The trio (Hoffman/Keener/Walken) give top shelf performances as we've always come to expect from them in A Late Quartet. But it's just too bad that they're in service of Yaron Zilberman's film, which takes the unique focus of a string quartet in Manhattan, and puts it in the middle of a standard and unsatisfying soap opera, that spins off into one subplot too many."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "This is a terrific film. It is well-written and directed by one of the screenwriters (Zilberman). The acting is superb, especially by Seymour and Walken. It is a story of relationships, starting with individual needs and desires and strengths and weaknesses, but all held together when they are one in a string quartet. It demonstrates the individuality of four people  who are then welded together to produce a great unit producing lovely music. The whole cannot function without the individuals, a microcosm of society in general. The story begins with the deterioration of Walken who is the glue that holds them all together, and then the unit falls further apart only to come together at the end in a great final scene. This film will not receive thenumber of viewers it should, which will be a great loss for those who do not see it, and a great film for those who do.",
      "total_reactions": 1,
      "user": "drchoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "One of the best of the year, with possible Oscar nods for Walken Hoffman, Keener and Poots. The story was varied and fascinating and it nicely gave time to each character's struggle. Exciting shots of NYC, great music, and nice work by the cast to make us believe they were really playing.",
      "total_reactions": 1,
      "user": "NoirAlley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "What a wonderful surprise. The performances in this film are so good it beggars belief that no member of the cast garnered any recognition, anywhere. Indeed the film has somehow gone right under the radar. It may be Christopher Walken's best performance in an age; it's so refreshing to see him break at last from lunatic typecasting and bring to life a sensitive musician blanketed in grief and confronting darkness. Hoffman is amazing, along with the whole cast. There are so many richly written scenes in this film, played out by such superb actors, that you can't help be swept up in the turmoil of their relationships. A real achievement.",
      "total_reactions": 1,
      "user": "jibbon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Last week it was loud rock and roll music on stage for an hour and 45 minutes in",
      "total_reactions": 1,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "A rare film, an ensemble cast (nearly every performance stood out in sharp relief) brings the life of a quartet fading into age, ill health, and the convoluted relationships that are the fabric, ruin, and making of people and the intense musical conversations that evolve over decades of making music together. There were standout performances by Philip Seymour Hoffman, Christopher Walken and Catherine Keener. This is a small film, yet with a richness that belies it's lack of an adequate advertising budget, and which stands out singularly against the tide of popcorn sequels and violent mush. This film ought to see several oscar nominations, but will likely be overlooked.. See it while you can, it is a dying breed of film, that focuses on quality of portrayal, character development, and an keen honesty that leaves you entertained, and like good poetry... with a razor sharp grasp of the intimate relationships that are the musical world of  quartets.",
      "total_reactions": 0,
      "user": "makrtik2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "The casts is universally solid, with Walker and Hoffman giving two great, empathetic performances. Enjoyable if a tad melodramatic and with plot that is too predictably resolved.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "As the film opens and the four members of the renown, Manhattan based Fugue string-quartet grace their humble audience and stage, they slowly bow",
      "total_reactions": 0,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "\"A Late Quartet\" 10 Scale Rating: 7.0 (Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    }
  ],
  "metascore": 67,
  "name": "A Late Quartet",
  "num_weekends": 13,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 2,
    "month": 11,
    "year": 2012
  },
  "opening_weekend_income": 75279,
  "opening_weekend_income_currency": "$",
  "rating": 7.1,
  "rating_count": 11604,
  "rating_freq": {
    "1": 104,
    "10": 705,
    "2": 53,
    "3": 88,
    "4": 180,
    "5": 576,
    "6": 1746,
    "7": 3817,
    "8": 3181,
    "9": 1154
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 76,
  "votes_per_demo": {
    "aged_18-29": 2444,
    "aged_30-44": 4556,
    "aged_45+": 2834,
    "aged_under_18": 10,
    "females": 2219,
    "females_aged_18-29": 569,
    "females_aged_30-44": 911,
    "females_aged_45+": 623,
    "females_under_18": 3,
    "imdb_staff": 3,
    "imdb_users": 11604,
    "males": 7874,
    "males_aged_18-29": 1843,
    "males_aged_30-44": 3566,
    "males_aged_45+": 2161,
    "males_under_18": 7,
    "non-us_users": 6262,
    "top_1000_voters": 174,
    "us_users": 2334
  },
  "year": 2012
}