{
  "avg_rating_per_demo": {
    "aged_18-29": 4.7,
    "aged_30-44": 4.6,
    "aged_45+": 4.8,
    "aged_under_18": 6.3,
    "females": 4.7,
    "females_aged_18-29": 4.8,
    "females_aged_30-44": 4.6,
    "females_aged_45+": 4.9,
    "females_under_18": 5.9,
    "imdb_staff": 6.7,
    "imdb_users": 4.7,
    "males": 4.6,
    "males_aged_18-29": 4.6,
    "males_aged_30-44": 4.6,
    "males_aged_45+": 4.8,
    "males_under_18": 6.4,
    "non-us_users": 4.6,
    "top_1000_voters": 4.6,
    "us_users": 4.7
  },
  "avg_screens": 2.0,
  "budget": 3000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 4,
    "year": 2012
  },
  "critic_review_count": 102,
  "duration": 90,
  "genres": [
    "horror",
    "thriller"
  ],
  "gross_income": 2034,
  "max_screens": 2,
  "mc_avg_user_score": 5.3,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "ATM",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 11,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Mr. Brooks capitalizes on antiseptic, fluorescent interiors, while the score, by David Buckley, nicely accents stress points."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "After memorably sealing Ryan Reynolds in a coffin in \"Buried,\" screenwriter Chris Sparling's attempts to make a two-ATM vestibule equally claustrophobic are less inspired."
    },
    {
      "critic": "Boyd van Hoeij",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Seems assembled from autopilot thriller material, with most of the dull dialogue devoted to plugging potential plot holes rather than anything resembling logic."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "As with so many films of this ilk, plot holes and inconsistencies abound, with audiences likely to express in loudly vocal fashion their opinions about what the characters should or shouldn't be doing."
    },
    {
      "critic": "Glenn Whipp",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Screenwriter Chris Sparling worked in confined spaces to far better effect before with the minimalist Ryan Reynolds thriller \"Buried.\" He must have used his best ideas there."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "While ATM does offer a few jolts, we're paired with bland characters and an underrealized premise."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Even by the most lenient of genre standards, the behavior of the characters in David Brooks's ATM is ludicrous enough to make anyone grind his or her teeth in frustration."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "If both good and evil characters don't behave in ways that make sense vis-à-vis their circumstances, any sense of terror quickly dissipates."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "Maybe DVDs of \"Buried\" and ATM will be sold in the same package someday. You could call it a trapped-in-a-box set."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "No, the indie horror movie ATM is not about a psychotic automated teller that charges the steepest of convenience fees - your life! - but it isn't much smarter than that premise, either."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is not that bad. It has suspense, action and a fairly good ending for that kind of thrillers. I was a bit disappointed that the killer was just a psychopath and he had no motivation of killing them but I guess the writers find it better that way... The cast is ok and the plot is really good and quite original actually. It is enjoyable and if you watch as a thriller it's good if you see it as a great picture it's not that good because there are many better thrillers than ATM but the film is still entertaining",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Despite obvious plot holes and frustrating dialogue, ATM is a solid horror that manages to deliver due to its suspenseful scenes and imagery. All around decent.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "For all of the negative reviews, let me just say that this is a very entertaining thriller, and it was interesting to see Josh Peck in a thriller, and the part he played was different, but he did well. The movie is somewhat scary because many people can relate to that type of situation, ATMs are scary places at night. I'm not gonna spoil anything but I will say that the reason it didn't get a 10 from me is the ending. It wasn't the best ending I have seen, but not the worst either. If you are looking for an entertains movie as a time waster, then this is the perfect movie for you,but if you are looking for a very logical movie with a big twist, then watch something else. I enjoyed it though, and I would probably enjoy a sequel.",
      "total_reactions": 4,
      "user": "Yoshinaruto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "ATM is very reminiscent of classic horror movies such as The Shining, Halloween, and Misery and seems to draw from modern successes such as The Strangers and The Collector. The film is simple, which clearly works to it's advantage. There is, thankfully, no nudity or vast amounts of unneeded gore or profanity either. It is clear and to the point, three victims trapped in extreme conditions by a mysterious killer.",
      "total_reactions": 2,
      "user": "danielscotth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"ATM\" 10 Scale Rating: 3.0 (Bad) ...",
      "total_reactions": 2,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "A well written horror-thriller. It is full of surprises along the way, and some great performances to keep you hooked. At times the editing is in-your-face and becomes a little too distracting, but only in the beginning. The concept does have a few flaws to it, but it knows that, and does its best to keep you engaged all the way to the end. I would recommend this film as it will surprise you, don't let the fact it didn't have a massive release put you off.",
      "total_reactions": 1,
      "user": "TruAlbino"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "ATM, cool idea, but bad development. The idea is good (but some strange), the beginnig is good, after we have some great and scare moments, but finally is like a boring movie. The cast is really good, but have some terrible moments.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "A concept with promise that falls apart in the end. The main flaw in \"ATM\" is that it's really about the villain, yet focuses the entire time on the heroes. Our main characters are boring cutouts, who only bring good acting to the table after a bland setup (helped along immensely by an implausibly ill-equipped friend), and after a stop in an ATM find themselves trapped by a mysterious man outside. The thought processes and decisions made early on come off as smart and reasonable enough, but the loosely-written conclusion is where any well-developed plot deflates. The implication in the ending is that the villain set everything up to frame this man, and this is something he does habitually, but how could he pull that off? There are so many loose ends left that, from the standpoint of law enforcement, would seem rather big question marks as to the certainty of our main character being the \"guilty\" one. How would they explain the busted-up door in the back, or the man he burned who was sitting in a lawn chair, or the sequence of events and murders, or the friggin' CAR driven into the ATM? And if this is something he does habitually, wouldn't the police catch on? Would they really believe that a string of very unusual ATM multiple murders would be a result of random individual psychopaths and not perhaps something simpler and more obvious? It just doesn't work - ATM is a cool idea written ultimately into the ground.",
      "total_reactions": 1,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is boring in the beginning.  Images don't really explain much, just made me confused.  Takes too long to get to the main plot.  Some predictable parts. Many loose ends. Ending suggests sequel maybe??  Bland characters, just explains that they are co-workers. Despite all that criticism.. I would highly recommend this movie to others.  Good late night movie.",
      "total_reactions": 1,
      "user": "SwaggerificBoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "ATM looked like it would be terrible yet entertaining, oh how wrong I was! The film had no fun moments what so ever! The characters and the actors were both really annoying and incredibly dumb. And the script was stupid and poorly written, leaving plot holes and other errors. The only joy I had watching this film was when the annoying characters got offed in hilarious yet stupid ways...and the short runtime.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "Terrible movie, not realistic and extremely stupid. Is more a parody than a movie. Remind me about Frozen.",
      "total_reactions": 0,
      "user": "filo8818"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "ATM, a horror/suspense film with average performances and above acceptable suspense has an ending that will make you wish their were a sequel.  Full Review coming soon.",
      "total_reactions": 0,
      "user": "kewlgeek555"
    }
  ],
  "metascore": 34,
  "name": "ATM",
  "num_weekends": 1,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 2034,
  "opening_weekend_income_currency": "$",
  "rating": 4.7,
  "rating_count": 19486,
  "rating_freq": {
    "1": 1906,
    "10": 878,
    "2": 1546,
    "3": 2123,
    "4": 3066,
    "5": 3904,
    "6": 3128,
    "7": 1785,
    "8": 853,
    "9": 297
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 177,
  "votes_per_demo": {
    "aged_18-29": 7033,
    "aged_30-44": 8004,
    "aged_45+": 1708,
    "aged_under_18": 45,
    "females": 3161,
    "females_aged_18-29": 1526,
    "females_aged_30-44": 1210,
    "females_aged_45+": 264,
    "females_under_18": 5,
    "imdb_staff": 3,
    "imdb_users": 19486,
    "males": 14122,
    "males_aged_18-29": 5442,
    "males_aged_30-44": 6717,
    "males_aged_45+": 1406,
    "males_under_18": 39,
    "non-us_users": 10060,
    "top_1000_voters": 233,
    "us_users": 3791
  },
  "year": 2012
}