{
  "avg_rating_per_demo": {
    "aged_18-29": 5.8,
    "aged_30-44": 5.1,
    "aged_45+": 5.3,
    "aged_under_18": 6.9,
    "females": 5.9,
    "females_aged_18-29": 6.0,
    "females_aged_30-44": 5.6,
    "females_aged_45+": 5.9,
    "females_under_18": 7.0,
    "imdb_staff": 6.2,
    "imdb_users": 5.6,
    "males": 5.1,
    "males_aged_18-29": 5.4,
    "males_aged_30-44": 4.8,
    "males_aged_45+": 5.1,
    "males_under_18": 6.3,
    "non-us_users": 5.4,
    "top_1000_voters": 4.6,
    "us_users": 5.5
  },
  "avg_screens": 814.6363636363636,
  "budget": 17000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 13,
    "month": 5,
    "year": 2011
  },
  "critic_review_count": 146,
  "duration": 86,
  "genres": [
    "drama",
    "fantasy",
    "romance"
  ],
  "gross_income": 27854896,
  "max_screens": 1959,
  "mc_avg_user_score": 5.5,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "Beastly",
  "mc_negative_rating_frequency": 29,
  "mc_positive_rating_frequency": 39,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "I liked this movie, maybe more than I should have, and would be happy to see anything this director wants to do next."
    },
    {
      "critic": "Howard Cohen",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "Beastly, for all its potential pitfalls, works better than it has any right to. Credit Barnz, who keeps his young characters contemporary in a world of text messaging and status updates and yet also gives them depth."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "Witty, warm, well-cast and often wickedly funny."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "This is the kind of cornball entertainment that rainy afternoons were made for. Throw in a cozy sofa too. Beastly will size down well on your television."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "The idea of transformation, that people can change and learn from their mistakes, growing to be better, makes Beastly not just sweetly romantic but also quietly hopeful."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 63,
      "summary": "There are moments of salty wit to its teen TV sensibility, and the story offers proof, once again, than there are few stories that can't be adapted to the theme of teenaged popularity politics."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 55,
      "summary": "Beastly manages to show you all the ways it might have worked by missing every available mark, sometimes by the gaping expanse between Alex Pettyfer's ears, sometimes only by the feline curl of Vanessa Hudgens' smile."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Funnier, sharper and sweeter than expected."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Hudgens' dimples threaten at times to overtake the narrative, but in the end, they're no match for Olsen's creepy-ass smirk, which, frankly, appears ready-made for Tim Burton's next outing."
    },
    {
      "critic": "Sandie Angulo Chen",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Getting teens to look past the superficial may be a noble goal, but when they're staring at the pretty but talentless Pettyfer, it's a hard lesson to take seriously."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "Beastly was made with tween girls in mind. It's the kind of love story a viewer can believe in when she is indiscriminating enough to ignore bad acting, bad writing, and mediocre filmmaking."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 40,
      "summary": "Tin-eared, corny attempt at fairy-tale interpretation."
    },
    {
      "critic": "Linda Holmes",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 40,
      "summary": "All good humor must come to an end, and a love story has to be able to fall back on tenderness and sweetness eventually. Unfortunately, every time Beastly reaches for either of those things, it's ... really bad."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 40,
      "summary": "There's less to Beastly than meets the eye - and what meets the eye is no great shakes, either."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 40,
      "summary": "A kiss may cure the monster, but not even campy performances from Mary-Kate Olsen and Neil Patrick Harris can save this ugly snarl of cliches."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 38,
      "summary": "The school freak, played by Mary-Kate Olsen, misses a chance to really have some fun as this story's wicked witch."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 38,
      "summary": "It's dogged by awkward dialogue, a ridiculous plot and lackluster performances, especially by the leads."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 38,
      "summary": "Beastly offers a thoroughly dopey reread of the \"Beauty and the Beast\" fairy tale."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 30,
      "summary": "Rarely do films from Hollywood emerge in such an inane manner. Its rote characters are inevitably in predictable situations with no subtext or subtlety to any of their predicaments."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 30,
      "summary": "Loosely adapted from Alex Flinn's young-adult novel, this \"Beauty and the Beast\" update is a pallid, formulaic teen romance that might have benefited from a little snark."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 25,
      "summary": "The characterization couldn't be more flagrant if the soundtrack creaked out an oldie by a certain ancient pop quintet: You're a candy girl."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 20,
      "summary": "Dull and perfunctory, the film's saving grace is MVP Neil Patrick Harris as Kyle's blind tutor, who has a witty aside for every woodenly expressed sentiment. You go, Doog!"
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 20,
      "summary": "There is one good thing you can say about Beastly: The title perfectly sums up what you'll see on screen."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 16,
      "summary": "Spectacularly poor judgment in everything from acting to costuming (Olsen's Harajuku-troll get-up is scarier than her curse) puts Beastly right on the cusp of the so-bad-it's-good Hall of Shame."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 16,
      "summary": "In every aspect, from story to tone to characterization to visual aesthetic, it's laughably perfunctory, as though everyone involved were too embarrassed to give it more than a half-ironic token effort."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 12,
      "summary": "More than lives up to its name with ultra-campy performances, high-glucose direction, laughable dialogue, cheesy effects and a back-lot simulation of a Manhattan street that wouldn't pass muster on an after-school special."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "It's a movie you want to like, but the dialogue is often weak and the story line had too many implausible moments. The performances by Lisa Gay Hamilton and Neil Patrick Harris were timely and engaging and also the freshest parts of the story. But, ultimately, you end up wishing the story for the two main characters Alex Pettyfer and Vanessa Hudgens was stronger and bolder and thus altogether different.",
      "total_reactions": 4,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "For some reason, it worked for me more than I thought it could.  Hudgens and NPH are standouts, but Krause is completely wasted, and a bit of a cliche. It seems like the movie could have been about 30 minutes longer, but they wind things up in summary fashion that's a bit unsatisfying. Would have also have like to see more from Olsen on her background, powers, & motivation.  Not bad.  (Disclaimer: my employer and the film's studio are subsidiaries of the same parent company.)",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "this movie is practically Beauty and The Beast. all records should go to that movie. This movie was a really cheesy, corny love story ripped off from beauty and the beast",
      "total_reactions": 1,
      "user": "taywah09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "The girlfriend watched this just recently, went into it with average expectations simply knowing she enjoyed the cast. I attempted to pry her away from it half way through but she was attached, couldn't take her eyes off it. In conclusion, she loved it and really enjoyed it and enjoyed the message of the film.",
      "total_reactions": 1,
      "user": "fryzee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "a well made film done for its target audience. musical score and soundtrack are amazing. a definite feel good movie for the young and even once young at hearts. highly recommended for the whole family to enjoy.",
      "total_reactions": 1,
      "user": "jrcven"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "i think that this is one of the best movies i have ever seen.  it says that love isn't always blind, that looks doesn't mean everything and that true love doesn't need good looks, money or fame. beastly is educative and incredibly romantic movie that says: even people who aren't beautiful can find love of their life.",
      "total_reactions": 1,
      "user": "M_aja"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This is  a nice movie ! the writting is goood and we have seen all good aspects of getting this up there. More over the acting was equally nice and we had to choose who acted better",
      "total_reactions": 6,
      "user": "dave021984"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Too bad the production did not hire a writer or an actor for this piece of garbage, otherwise it may have had potential.  The characters had the depth of a wading pool, and dialogue that was not up to par for a high school play.  However, if you thought the Justin Biber movie was \"OMGOMGOMG best movie ever\", you will probably like this.",
      "total_reactions": 5,
      "user": "Bart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "Liam Neeson in Sam Raimi's \"Darkman\", now that's a guy who needed to hide in dark places. A victim of sabotage, a lab explosion rendered Dr. Peyton Westlake completely unrecognizable. The renowned chemist looked as if he had contacted the flesh-eating virus. The moviegoer understood why he stopped circulating in public, shunning the daylight and only coming out at night. He was, by anybody's standards, beastly. On the other hand, Kyle Kingson(Alex Pettyfer), the uber a*shole who finds himself disfigured when he angers the wrong goth, has facial alterations that are conspicuously artful, highlighted by two proportional red slashes and a squiggly metallic branch running down his forehead. Since Kyle rules the school, he could probably pull this new look off, but true to his word, the Aryan prepster doesn't take kindly to idiosyncrasies, and exiles himself from a world, he believes, where only beautiful people matter. Courtesy of his image-obsessed father(Peter Krausse), Kyle takes up residence in a snazzy townhouse, complete with a black maid(Lisa Gay Hamilton) and a blind tutor(Neil Patrick Harris). It's good to be rich. Conversely, Dr. Westlake lived in an abandoned warehouse. When Kendra(Mary Kate Olsen) puts a spell on her tormentor, the objective is to put this alpha male in his proper place, but far from learning a lesson, Kyle serves his penance in relative luxury. Although \"Beastly\" is supposed to be a contemporized take on \"Beauty and the Beast\"(originally an eighteenth century fairy tale written by Gabrielle-Suzanne Barbot de Villeneuve), a beauty ill-serves the material, because this time around, it's less about the girl seeing the inner beauty of another living being, than the beast who needs to learn that \"beauty is only skin deep\". In a sense, and this is the fault of the casting, it does, and that's why \"Beastly\" doesn't make a lick of sense. Lindy(Vanessa Hudgens) is no Martha Dumptruck, the Westerberg High outcast in Michael Lehman's \"Heathers\", but she represents the film's idea of an outcast. Despite always being the prettiest girl in the room, Lindy says things like, \"What can I say. I'm substance over style,\" and \"Wow. Looks are really important to you,\" musings which sound galling from somebody so perfectly chiseled. This supposed dark horse is supposed to function as a contrast from the girls that the vanity-stricken pretty boy normally dates, and incredibly, that's exactly how \"Beastly\" utilizes Hudgens, treating her as an underdog in the Molly Ringwald tradition, the plain girl who is unrequitedly in love with the big man on campus. At a school dance, Lindy. the school treasurer(!), makes sure that each table has its own decorative candle, whereas Sloan(Dakota Johnson), the uber a*shole's girlfriend, basks in her own loveliness, breathing in the rarefied air of Kyle's company, a world where pretty girls rebuff corsages for being the wrong color. Wanting to be part of that world too, if only for a little while, Lindy convinces Kyle to pose for a picture with her, assuring the elitist snob that she's \"worthy\" of him. Meanwhile, the newly-elected Green committee president wears a confused look, as if he's baffled by his attraction to such a common girl, a girl of substance. After the transformation, Kyle spies on her, as she pounds the Manhattan pavement nightly looking for her alcoholic father. When Lindy eventually moves in with him(don't ask, the circumstances surrounding this development is hopelessly contrived), it's supposed to make for a touching love story: two lost and lonely souls, together at last, but the characters these two pin-up quality actors embody are an insult to the lost and lonely. Here's the better movie. If Kyle ended up with Kendra, like the athlete(Emilio Estevez) who finally sees the inner beauty of the \"basket case\"(Ally Sheedy) in John Hughes' \"The Breakfast Club\", with the exception that the witch wouldn't have to compromise(as Allison Reynolds did) and wipe off her dramatic makeup, then maybe you'd have a movie that meant something. \"Beastly\" carries with it the message that looks don't matter, but on closer inspection, the film telegraphs something quite the opposite. \"Beastly\" is as image-conscious as its raging megalomaniac of a hero.",
      "total_reactions": 5,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "i thought that it was realy good but mostly liked by teenage girls, adults just don't get it. its realy like your regular teenage love just.... beastly.",
      "total_reactions": 4,
      "user": "blue911"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "Let me just start off by saying who is beastly, The man or the woman? I rather see Russell Brand play the role of the beautiful women, he looks more like one. Anyways thank you directer for ruining the greatest childhood story of all time. I will never show my children this movie i would rather them watch the human centipede, they be less scared of women, and more of evil doctors. Things that are more entertaining than this movie: someone tripping and failing, a baby crying, watching a episode of Teen Mom 2 not 1 that season blew my mind, and finally watching Justin Beiber's hair grow back. Thank you and sorry for wasting 5 mins of your life but saved u from the 2 hours of Beastly.",
      "total_reactions": 4,
      "user": "CactusMan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "This movie did not do justice to the book!! Come on, turning the most good looking boy in school to a tattooed freak is supposed to teach him about \"looks is not everything\" There are people in New york city that walk the streets looking like that. Alex nor Vanessa, did justice to the characters. They were stiff and showed no real emotion. Everything was wrong in this movie. The only thing that was real, was the characters names.",
      "total_reactions": 2,
      "user": "trinimom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "i think that Beastly is one of the most unpredictable movies i have seen its about l love and learning a life lesson that looks are important but love and not being a jerk is for more important in life",
      "total_reactions": 2,
      "user": "kimmie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Would like to express the delight to founders of this film.",
      "total_reactions": 2,
      "user": "Daymona"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I think that Beastly is a really great movie, because is like a remake of the beauty and the beast, and have much pretty elements. I considere that Beastly is a classic.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "Awful performances, awful film making. As you can see it is quite awful not only that but it is selfish and should give you a bad vibe. It ruins the classic source materiel that it is based on. I give this movie 22%.",
      "total_reactions": 7,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "100% agree with Bart below. This movie was BAD. More spent on make up than on the lead's acting tuition. It only gets a 1 from me because my wife thought it \"wasn't SO terrible\".",
      "total_reactions": 2,
      "user": "Sphynk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "The characters are just too awkward with each other. Even as they grow closer they seem to get more awkward in their actions, words, and emotions towards each other. Oh, and the main character is a SUPER creeper. He snoops on her phone calls, text messages, computer, and follows her from a distance. It seemed as if he learned very little at all and pretty much forced the girl in the movie to be stuck with him out of his own selfishness...I really wanted to like the movie, but just couldnt.",
      "total_reactions": 0,
      "user": "harlthegr8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "I love when they remake a movie and make it better than the original but I didn't see that happen in Beastly.  I truly was looking forward to seeing the extraordinary movie that was shown in the trailer and it never matched up.  The acting was mediocre and the characters were forgettable.",
      "total_reactions": 0,
      "user": "EdwinLopez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Beastly is an incredibly funny movie.  Some scenes made me laugh so hard that I cried.  Unfortunately for the film though, itâ",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "its a good movie, and is a  film to watch in sunday wnhen there is nothing to do. Vanessa Huggens is acting good, Alex too, the movie can be better with the connected more to \"beauty and Beast\"",
      "total_reactions": 0,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "The acting was well done; Vanessa Hudgens was amazing at establishing the emotional connection to Alex. It had a good storyline and good morals/lessons behind the movie. Highly recommended for family bonding time, especially with teenage daughters. One bad thing about this was the \"tattoo\" marks on Alex weren't really convincing - they didn't make him seem like a BEAST, more like an overly tattooed weirdo.",
      "total_reactions": 0,
      "user": "SShao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "It is a nice movie, well-played and I loved the make-up. Easy to enjoy as long as you're not waiting for the \"film of the year\" and just want to have a good time.",
      "total_reactions": 0,
      "user": "zeynel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "It's not the worst movie i've ever seen, but the plot was predictable, the characters are just...I don't know- what's the point of them? Everything about this movie screams mediocre, but I fell asleep for 14 minutes in the middle of the movie. i never fall asleep during movies.",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This film is a typical romantic, fairy tale film for teenage girls, which meets their expectations perfectly. It can be agreed or disagreed that the choice of actors used In the film were slightly miss-judged, nevertheless, it doesn't effect the movie a great deal and can still be enjoyed. I think the film also contains a valuable moral, in which young girls can learn from and understand. Good things come to those who deserve it. The image of the beast In which Kyle turns into, is more modern than old fashioned like 'Beauty and The Beast' which allows the audience to relate to the situation more. As a teenage girl myself, I picked up on the stereotypical love story which will have a typical ending. However, the fact of the film not having a big twist/traumatic moment toward the end of the film as Kyle and Lindy fall in love, made the film so much better than any other typical love story as sometimes, the audience finds it stressful. People may refer to It as having a weak story line, but I believe It satisfies the target audience of young girls. As for the technical side of the film, Marcelo Zavros created the music for the film, which gave It that butterflies In the stomach kind of feeling. Zavros also created the music for the film 'Remember Me' which to those who have ever watched it, the music added the emotion and feeling to the film. For me, having such a great pianist and composer working on the film, gave me the Impression from the start that the movie was going to be professional, well-written and gives the message of the film perfectly. In my opinion, all these expectations were met.",
      "total_reactions": 0,
      "user": "pippaclare"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "No one had natural chemistry . Story was more shallow than the lead actor.  Empty and dead like most teenagers why this movie was made is anyone's guess .  Beast make up was not ugly enough.",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Beneath it all, however, is a movie with a good heart.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "This movie is so horrible that it becomes amazing. The only one who seemed to get the memo that it should be a comedy rather than the awful excuse for a romance film. I would recommend this for people who enjoy watching bad movies.",
      "total_reactions": 0,
      "user": "kt_003"
    }
  ],
  "metascore": 40,
  "name": "Beastly",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 3,
    "year": 2011
  },
  "opening_weekend_income": 9851102,
  "opening_weekend_income_currency": "$",
  "rating": 5.6,
  "rating_count": 66411,
  "rating_freq": {
    "1": 3468,
    "10": 7478,
    "2": 2579,
    "3": 3813,
    "4": 6350,
    "5": 10738,
    "6": 12463,
    "7": 9935,
    "8": 6424,
    "9": 3163
  },
  "release_day": 4,
  "release_month": "March",
  "release_year": 2011,
  "user_review_count": 129,
  "votes_per_demo": {
    "aged_18-29": 35542,
    "aged_30-44": 15955,
    "aged_45+": 2888,
    "aged_under_18": 379,
    "females": 33737,
    "females_aged_18-29": 23292,
    "females_aged_30-44": 7436,
    "females_aged_45+": 1065,
    "females_under_18": 318,
    "imdb_staff": 5,
    "imdb_users": 66411,
    "males": 22809,
    "males_aged_18-29": 11867,
    "males_aged_30-44": 8311,
    "males_aged_45+": 1778,
    "males_under_18": 58,
    "non-us_users": 31090,
    "top_1000_voters": 304,
    "us_users": 10599
  },
  "year": 2011
}