{
  "avg_rating_per_demo": {
    "aged_18-29": 6.9,
    "aged_30-44": 6.6,
    "aged_45+": 6.9,
    "aged_under_18": 7.0,
    "females": 6.8,
    "females_aged_18-29": 6.7,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 7.2,
    "females_under_18": 6.7,
    "imdb_staff": 6.6,
    "imdb_users": 6.8,
    "males": 6.8,
    "males_aged_18-29": 6.9,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.8,
    "males_under_18": 7.0,
    "non-us_users": 6.5,
    "top_1000_voters": 6.5,
    "us_users": 7.1
  },
  "avg_screens": 119.25,
  "budget": 5000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 9,
    "year": 2012
  },
  "critic_review_count": 230,
  "duration": 99,
  "genres": [
    "comedy",
    "crime",
    "drama"
  ],
  "gross_income": 9203192,
  "max_screens": 332,
  "mc_avg_user_score": 7.2,
  "mc_metascore": 75,
  "mc_mixed_rating_frequency": 28,
  "mc_movie_name": "Bernie",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 103,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 100,
      "summary": "You should have the opportunity to experience the movie the way I did, in complete ignorance, enjoying its every weird turn."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "Matthew McConaughey finally locates his perfect métier as the town's Fordian skeptic, a district attorney who smells a rat."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 91,
      "summary": "Slight but terrific.  The intertwining of the sharply tuned actors and the guileless (and often hilarious) townspeople is seamless, the tale is sometimes despairing but never heavy, and the blend of drama, comedy and music is brisk and fresh."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 91,
      "summary": "The innocence of the townspeople is weirdly uplifting. They love their Bernie so much that they seem even more blinkered than he is."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Gaudily vibrant, at times morbidly funny."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "This is writer-director Richard Linklater at his wry, whimsical best, and considering he was the filmmaker behind 1993's \"Dazed and Confused,\" that makes the movie something of a milestone."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 88,
      "summary": "Bernie could easily have gone horribly wrong. But Black and Linklater finesse this tricky material with as much virtuosity as Bernie brings to that broccoli."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 88,
      "summary": "Weirdly funny, inspiring film."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 88,
      "summary": "I had to forget what I knew about Black. He creates this character out of thin air, it's like nothing he's done before, and it proves that an actor can be a miraculous thing in the right role."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Jack Black gives the performance of his career in the title role of Bernie, under the pitch-perfect direction of his \"School of Rock'' director, Richard Linklater, who expertly crafts a black comedy with a deceptively sunny surface. It's the best movie I've seen all spring."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "It's a delectable slice of Southern Gothic humor, a side show of rednecks and Bubbas and Aunt Tooties."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 85,
      "summary": "The wonder of Black's performance here is its empathy and balance: inasmuch as he can disappear into any role, he dissolves into this one with no hint of mocking remove. It's a beautiful thing to see."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "Though the lightness of Bernie can get disconcerting at times, even cartoonish, Linklater approaches the story with a bemused curiosity that seems about right under the circumstances."
    },
    {
      "critic": "Andrew Pulver",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "Black's performance is a revelation: foregoing his usual repertoire of jiggling, tics and head-waggling craziness, Black ensures Tiede is a satirical creation of considerable substance. Really impressive."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 80,
      "summary": "The story provides great roles for Jack Black as the sunny title character, Shirley MacLaine as his dyspeptic victim, and Matthew McConaughey as the good-old-boy D.A. who prosecutes the crime. But some of the best performances come from real-life residents of Carthage as they share their recollections on camera."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Richard Linklater's Bernie is the rarest of rarities: a truly unexpected film. It might be classified as a black comedy, for it deals with the murder of an 81-year-old woman in a fashion that is not exactly tragic."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 78,
      "summary": "Jack Black redeems himself (for Gulliver's Travels, among other things) with a subtly quirky performance that's one of his personal best."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "The question of why the law must always be upheld, regardless of consequences, gives this light, amiable movie a surprising heft and weight. You don't want to see Bernie sent to prison - the world is a better place without that mean old shrew - but murder is murder, right?"
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "Propelled by a perfectly cast trio of stars whose eccentricities shine in singular character roles, Bernie is a charmer."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "Interspersing \"real\" people with professional actors, Linklater creates a vivid, gossipy Greek chorus that serves as a kind of collective unreliable narrator -- an altogether appropriate stance given the moral gray zone the sweetly confounding Bernie inhabits."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "As composite sketches go, it's a good one."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "No use trying to describe Bernie. It's a one-of-a-kind inspiration. You will never feel closer to a convicted killer."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 70,
      "summary": "On its own terms, Bernie is smoothly made and reasonably entertaining, Linklater doing his Austin-based best not to condescend to the locals - at least the East Carthage locals."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Where the movie is at its best is in the comically laconic, straight-to-the-camera remarks offered by Carthage's residents. (They're played by a mix of local actors and real townspeople doing partially scripted versions of themselves.)"
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "It's an odd movie - mild in tone and circumspect, yet darkly funny, and done in a hybrid form that I don't think has been used so thoroughly before."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Pitch-perfect performances by Shirley MacLaine and an unusually restrained Jack Black hold together this offbeat true-crime saga, but Linklater's keen eye for human eccentricity flowers most memorably on the periphery."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 63,
      "summary": "Black gets to play an actual character instead of a loudmouthed cartoon. The movie's bright and endearing and surprisingly lacking in a point. I wish I liked it better."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "If the crime element feels like little more than a red herring, it’s the characters that give the film its appeal."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Jack Black adds new depths to his slippery comic persona in Bernie, a movie that may not ultimately add up to much, but which is filled with wonderfully odd details of weird Americana."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "It was a stroke of genius, at least a miniature one, to cast Black in this role – he's made to play the affable teddy bear who could snap at any moment."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "More than the film that surrounds him, Jack Black is worth the price of admission in Bernie, an oddball May-December true life crime story that would have profited from being a whole lot darker and full-bodied than it is."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 58,
      "summary": "All those twangy, homespun observations interrupt and annotate the narrative until Black and MacLaine's scenes start to feel as trivial as reenactments on a true-crime TV show."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Instead of exploring something bigger, like the origins of Bernie's need for the company of elderly ladies (which Hollandsworth touched on in Texas Monthly; Tiede lost his mother at age 3 and his father at 15), Linklater limits the story and mood to black comedy."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Bernie is an interesting guy, but he doesn't make for very good company."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "A surprisingly shapeless true-crime farce which never creates a convincing context for the odd relationship between a pious East Texas mortician and his sugar mama."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "It was a pretty solid move that is helped greatly by the wonderful performance by Jack Black. The biggest problem I had was that there was really very little of the actual plot. The film largely oonsisted of numerous actors/actresses discussing things that Bernie does and what he is like, what his relationship is like with the female lead. That was a little disapointing because Black's performance was so good that it really should have been expanded on and he should have had more dialogue and better interaction with the female lead as well.",
      "total_reactions": 3,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Fantastic movie - I highly recommend you see this movie.  Jack Black is a great actor - he plays the true story of Bernie perfectly!  He is a wonderful singer, and he sings throughout the movie.  I am really glad I went to see this movie.",
      "total_reactions": 6,
      "user": "EFYevan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Director/writer Richard Linklater (\"Slacker,\" and \"Dazed and Confused\") just has a knack for making \"funny\" out of sheer quirkiness; \"Bernie\" is no exception. However, such an amalgam, in this instance, wears a conspicuous switchblade on the sleeve of its seemingly unimpeachable, happy-go-lucky, awe-shucks suit--comely yet fey--which makes the audience's support of its protagonist, notwithstanding the solemnly predetermined circumstances and resolution, all the more substantial; one can't help but feel his internal struggle to restrain himself from the impending provocation, and revert to a suit unsheathed from trepidation and worry. Hence, \"Bernie\" is as much a \"based-on-a-true-crime-story\" as it is an emotional exercise in one coming to grips with the life they \"needed\" to have, but weren't \"ready\" to try. As for the movie itself, a plot too unconventional to be anything other than...well...true, it is about real-life character and mortician, Bernie Tiede, (Jack Black) who moves to the small cornpone town of Cathage in East Texas, where he immediately becomes the figure of social graces, exuding an ironic level of comfort from residents dealing with the loss of a loved one; the town knows Bernie will be there to commiserate with, and more notoriously, a solid deal on their deceased one' s terrestrial humble abode. Needless to say, Bernie is a town favorite--respected, idolized, and considered valuable to the communal whole. Though, Bernie is something of a bachelor as well. With his high social status, and flintlike sense of self-worth from being of consequential usefulness by endless scores of people, Bernie decides it's time to enter into a relationship that is more quid pro quo--but is he ever wrong. He begins meeting/dating Marjorie Nugent (Shirley MacLaine), a sour-mouthed widow of cold embraces, who also happens to be the town's most affluent member. After runs of extravagance vacationing, and copious amounts of arguing, the film follows with Bernie on trial. It is from this point, that the offbeat, dark  dramedy really picks up, as Linklater's atypical movie becomes even more peculiar, albeit rewarding, assuming the form of a semi-mockumentary that includes interviews from actual local witnesses with a loose script who know the couple, as well as professional actors who \"claimed\" they knew the couple. Either way, it is know one else but the mere townspeople that are the most fascinating,--outright, vivid, profane, hilarious, and insightful--connecting audiences with a sense of realism that is as effective and contributing to the film's plot, as astonishing it is just to take in. So, is Jack Black not good as Bernie Tiede? Absolutely, he is. Black modulates the most careful restraint he has ever produced in a film thus far. Everything from his 1990's visage--comb-over and stache and his expandable gold watch--to his persnickety stride and fluttery hands, is greatly enjoyable to observe. However, after a while, though not readily, Black's adroitness shifts to self-enchantment, though he does look as if he is having a great time on-screen. Similarly, McConaughey, playing the town's district attorney, Danny Buck, flirts with his character's limits a bit too far, which looks like a constant tomfoolery of self-parody; while charmful and expectedly charismatic, his portrayal of Danny Buck can't be taken seriously. As for MacLaine's Marjorie, she does a commendable job, as she plays the nefariously querulous widow primly, although her character is considerably less enjoyable to side with; merciless and unfunny. But, one can't discredit her work because of who she plays; her various nuances make for an oxymoronic quality that is delightful to watch (her acting job) and equally vexatious to endure. Ultimately, \"Bernie\" hits its highest marks when its inner-story is digressed to ephemerally comedic, straight-to-the-camera remarks made by the townsfolk, that help give the audience an internal \"say\" in who was actually right and who was wrong. Further, while the townsfolk, particularly the real ones, do show bias in their \"opinions' regarding the matter, their comments help steer audiences in the right direction to deduce the situation's happenings. Although everyone seems to have an opinion, one of the film's underlying issues is that its director/writer, Linklater, too, doesn't know, and Black's Bernie is just as clueless. That is, the townsfolk are the only sources of knowing...at all; this then, adds to the degree and weight of their words. What emanates in \"Bernie,\" is an almost elegiac meditation, with some atypical laughs, of an underrated hero who just happened to meet the wrong person and the wrong place, without him every knowing such could ever happen. Black's Bernie, is a slowly-winding arrow that surges ahead much farther than aimed.",
      "total_reactions": 3,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "It is a film that works so well in so many areas it is outstanding. It works as a documentry, comedy, drama and comment of life in texas. Jack Black delivers a subtle funny and dramatic performance. It is a stunning achievement",
      "total_reactions": 3,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "\"Bernie\" is a laugh-out-loud black comedy based on a true story that's stranger than fiction. Jack Black deserves a Best Actor nomination for his portrayal of Bernie Tiede, an overly benevolent Christian philanthropist. His speech, mannerisms and lines are perfectly delivered and fit excellently, which can be credited in part to the superb writing and fantastic co-starts. The ridiculousness of the story, the fact that most of it is true, and the incredible quality of the acting, writing and directing make this film the best I have seen all year. A must-see flick that is enjoyable in every aspect.",
      "total_reactions": 4,
      "user": "Jman4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "This film was not dark enough for me. I found it biased toward the Bernie character as it skirted the issue of homosexuality and I did not believe at all his excuse for killing the 81 year old woman. The movie would have been more appealing if it had been slightly more detailed and graphic. I wanted to know more about the relationship not just skimming the surface. I did enjoy the approach of using the town people to tell the story but that make it more of a light comedy not a dark comedy. Still, it intrigued me enough to go home and search the internet for information on the murder. I side with the district attorney that Bernie is not such a harmless guy. Original but it could have been so much better.",
      "total_reactions": 2,
      "user": "JamesL"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "This is the worst and most boring movie I have ever seen. I would rather eat curry and watch desperate housewives for eight hours then sit through jack blacks worst movie he's ever created. No comedy at all and it sukz ballz!!!!!!!!!!! bALLZ!!",
      "total_reactions": 9,
      "user": "Bigboii32"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Jack Black was born to play Bernie Tiede, the town Funeral Director in Carthage, Texas.  He plays the guy who comes to town and steals all the old ladies hearts to perfection.  He sings pretty good also which he showcases many times throughout the film.  He befriends the town's most hated woman (played deliciously by Shirley MacClaine), then she takes complete control over him causing him to, well, you have to see it for yourself.  I haven't attended a film where the entire audience was involved and laughing like this in a long time.  Most of the theater clapped at the end and stayed for the entire end of the credits.  The interviews with all the town's inhabitants are hilarious.  Matthew McConaughey hams it up as the local D.A.  I really enjoyed this quirky, campy film.",
      "total_reactions": 3,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Jack Black deserves an Oscar nomination for his portrayal of Bernie Tiede, a small town funeral director who murdered his close elderly friend Marjorie Nugent. The film observes the odd relationship that builds between the two. Bernie is a well-liked and respected figure in Carthage, Texas. He's cheerful and kind, and seems to brighten everyone's day. As a part of his job he comforts widows in their times of grief and keeps in touch with them over the following months. This is how he meets Marjorie (Shirley McLaine), recent widow and local curmudgeon. She shows distaste for just about everyone, whose feelings are perhaps mutual. Bernie however wins her favor with genuine sweetness. The two grow close, much to others' befuddlement. The film utilizes a mockumentary approach surrounding this central narrative; the locals (who may or may not be actual Carthage residents) offer gossip and opinions on what occurred between Bernie and Marjorie. This approach works well, providing audiences with numerous authentic slices of life. Director Richard Linklater keeps the humor gentle, even when ranging into darker territory, while the dramatic counterpoints prove oddly touching. Though the performances highlight the film, the underlying tenderness is what drives it home. Unlike most recent comedies, this one contains a beating heart.",
      "total_reactions": 3,
      "user": "Myffubs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Jack Balck does a great job in an understated role that deserves awards-season attention, as the humor here is simple and derived from the characters in this hilarious, top-notch dark comedy.",
      "total_reactions": 3,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Bizarre, dramatic, hilarious and just overall great. All the actors, especially Jack Black, are unbelievably good. Definitely see this - you will not regret it.",
      "total_reactions": 4,
      "user": "ArnoldC41"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "â",
      "total_reactions": 2,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "Very boring movie.  Some amusing scenes but overall, very slow-paced and uninteresting.  Jack Black does do a great job portraying a character out of his usual routine but the movie offers very little to hold your attention and keep from dozing off.",
      "total_reactions": 3,
      "user": "Ireland914"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "This delightful film by Richard Linklater has been under the radar and it's a shame, because it's a hoot. It's a reality-based tale about a prissy assistant funeral director (Jack Black), who befriends a rich, mean old widow (Shirley Maclaine) and ends up killing her. The tale is told with some dialogue and lots of hilarious interviews with local residents (some of whom are real and some are actors). I'm not a Black fan, but there's none of his over-the-top antics in this quiet portrayal. Matthew McConaughey shows up in a non-glamourous role as the prosecutor. I doubt it'll be in town long because it's available on DVD 9/21/12, but it's lots of fun on any format. Stay thru the credits for additional soundbites.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "Long and boring. It was hard to get through the whole thing really. A few scattered funny parts, but not worth my time.    .",
      "total_reactions": 2,
      "user": "DMuhny"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Great true story, played well by the main characters (Jack Black and Shirley McLaine). The profiles of the characters would make a good study paper for psychology students.",
      "total_reactions": 2,
      "user": "mschoa"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Never say never is the old cry and I remember, after seeing â",
      "total_reactions": 3,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "As a convicted human being for life and an escaped Texan, this film told it all.  It captured a big slice of small town life - its prejudices, its judgments, its characters.  brilliant.",
      "total_reactions": 1,
      "user": "jellopappa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "I am not usually a big fan of Black",
      "total_reactions": 2,
      "user": "libbycritiques"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "Way overrated.  There are a couple of amusing moments, but it's just pointless overall.  It' drags the least important scenes on forever.  Jack Black is the movie's anchor and is funnier in the role than anyone else could probably be but the movie surrounding him is just so... boring.  It could have been hilarious, but is far from it.  Not recommended.",
      "total_reactions": 1,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "This film came as a surprise to me. A disappointing surprise. First of all the film is not a comedy and i expected much more for the director of School of Rock. The film is based on true events but the movie is still bad. I saw the good reviews and I thought that it would be funny as hell as Jack Black was on the cast. Jack Black impressed me with his magnificent performance. That's the best thing on that film ,despite the fact I watched that movie in order to laugh.This is certainly on of the worst films of 2012 and it looked more like a documentary or a reality -tv show. It did not seem like a movie. Thumbs up ONLY for Jack Black. 4/10 for that reason because only his performance is extraordinary.",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "that is one of the worst movies of all time. It was more of a documentary than a comedy movie. How can anyone call it a comedy movie?? There is no comedy element in this movie. I think critics of this movie are just as retarded as the makers of the movie. Bad bad movie. It sucks.",
      "total_reactions": 4,
      "user": "AliStark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "If you're in the right mood, you'll laugh your ass off in this movie.  I was in the right mood.  The constant cut-aways from the action to interview the townsfolk really make the film.  Brilliant casting. Black is great, as usual, but it's the people of this little Texas town that make it a film to remember.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "I guess Jack Black is going to be ignored at awards time in favor of guys like Afleck. But Black's performance here is amazing -- funny, sad, musical, bizarre, and he's playing a real person you get a glimpse of at the end of the film! The quasi-documentary approach here works well and is really enjoyable.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "A black comedy that is both surprisingly funny and charming. At times it is even heart-warming. It's almost baffling to even consider the movie being this enjoyable when it's plot is based on true events. However it is. Defying the darkness of the events it's based on and becoming a darkly funny, a great murder story, and smart satire.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Based loosely on a true story 'Bernie' is the story of Bernie Tiede, a much loved mortician (sorry, funeral director) in a small Texan town.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "I didn't know the story, and was surprised by the twist. An enjoyable and understated film full of great characters. Jack Black gives a superlative performance.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Who knew that Jack Black had that in him!? Playing the title character, Black is like nothing you've ever seen from him before. He's pitch perfect, as is -- and I can't believe I'm saying this -- Matthew McCan'tact. Just stunning performances by these men. I highly recommend this movie. If you like any of Christopher Guest's best work, I think you'll dig Bernie.",
      "total_reactions": 0,
      "user": "tallmanwriting"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This film stars J.Black, which is enough for me to watch any film, and I honestly think its his best performance to date. I first watched this movie on Netflix without much knowledge of its plot. This allowed me to truly enjoy the film, without any expectations.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "It's a sort of dark comedy with American realism and touching emotion thrown into the mix.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "I didn't find it all that funny, but I did find it charming, interesting and enjoyable. Jack Black gives a great performance and the movie just seems to flow whimsically in easy digestion even through its dark parts due to the documentary style that surprisingly works quite well.",
      "total_reactions": 0,
      "user": "everlastall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Jack Black's performance as Bernie makes us not only disregard his murder but feel inspired. Bernie is a unique piece of filmmaking that earns the rare achievement of being a successful black comedy.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Jack Black really transforms into the title character in 'Bernie', a darkly comic crime film by Richard Linklater that is his best film since 'Before Sunset'. Black is so admirably subtle and controlled in his performance that I wish he had dived into dramatic territory sooner. As far as supporting roles go, I am not usually a fan of Matthew McConaughey, but he won me over in what is probably his best performance to date as well and Shirley Maclaine is typically great as the cold-hearted **** of Carthage. Also, the semi-scripted roles of the townspeople playing themselves are very funny. Linklater so easily empathises us with Bernie that we begin to side with the townsfolk too and when the ending comes about, there is some melancholy to be felt. The shot near the end where the real-life Bernie meets with Jack Black to talk is also nicely affecting and Black's portrayal of him is by far the performance of the year so far for me. Great movie.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "A very solid film with good performances from the cast. The style was also quite impressive because of the way that the entire film was formatted like a TV documentary.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "It is amazing that this was a true story. Richard Linklater managed to sprinkle in some hilarious moments along with telling the true story of Bernie Tiede and how he murdered Marjorie Nugent. It does a great job presenting the moral conflict of this story and, well, I do not want to say too much. Jack Black did a phenomenal job in the lead role. I was incredibly impressed with his performance. I really enjoyed Shirley MacLaine's performance, but I have a soft spot for Matthew McConaughey. He really portrayed the hard nosed Texan District Attorney really well. At the end of the day, this one really reminded me of Gone Baby Gone but funny. The conflict is different, but it leaves you feeling the same way. Another touch that I enjoyed from this one was the documentary-esque way of telling the story. With all the interviews from locals about everybody, it was a nice addition that really re-enforced that this one was a real story.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Endlessly entertaining, it is hard not to love every single minute of this exceptional blend of semi-documentary style, dark comedy and tragic real-life events. Jack Black turns in probably his greatest performance, but the film really benefits from the citizens of Carthage,some of them played by real townspeople, who give hilarious insight into Bernie and his story.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "A really great little film. Jack Black is terrific; it's for sure the best performance of his career, but i don't think I was surprised by how great he truly was in this. He's one of the most underrated actors out there and this performance really shows that. It sort of reminded me of Phillip Seymour Hoffman in Capote. McConaughey's win streak continues...he's really been on fire the past few years. Good script, great movie!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "It's a calm, slow paced comedy, that has its bluntness and absurdity to thank for, otherwise it would be a ridiculous thriller. Black's subdued performance as the Tiede in an emotional roller coaster is far beyond what I thought his potential was. McConaughey and McClaine both work with comedic supporting roles. All the laughs in this film comes from the fact that this is a true story, which you'd never believe.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Bernie is a quirky, weird, off-kilter move with an overall sweetness. Jack Black plays Bernie up so that he is a very likable character, even for what goes on about halfway through the film. Linklater has created a sort of weird, cinematic fantasy that is very rare in film. I can't quite explain it.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "It's a good movie, but I can't for the life of me tell you why. Both the story and the production seem a little indecisive about how exactly they want to develop. There aren't any of the stereotypical cues that tell us when the film wants to be funny and when it's meant to be dark, but maybe that's the point. It's charming, overall, and Jack Black is surprisingly smooth in a fairly serious role that plays brilliantly off of Shirley McLaine's performance. Give it a shot - you probably won't love it, but it's too charming to hate.",
      "total_reactions": 0,
      "user": "Urraco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "Bernie is a film that lives and dies on Jack Black's blade. Those who want Black to be no more than a bumbling fat man, will find no enjoyment in this film for this is Black's attempt to be a little something more and kudos on his effort it is enjoyable to watch him. Linklater continues to push his attempts at being different and I happy to see him trying to work around the system as best he can. As for McConaughey this is the performance that brought a man's career back from the dead and it is always a pleasure to see an actor prove you wrong.",
      "total_reactions": 0,
      "user": "poewilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "While Bernie's script contains some dialogue that doesn't truly fit with the pleasant scenery of Carthage, TX, the film also contains a very genuine template and very earnest acting talent that is undeniable.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Bernie is a very funny movie if you're familiar with Texas culture. It provides some interesting social commentary with a unique twist from the documentary film-making style mixed with actor performances. I wouldn't recommend it as an incredible film, but it's definitely worth watching if the opportunity arises. Matthew Mcconaughey's performance was fairly dry, but Jack Black's singing was incredible.",
      "total_reactions": 0,
      "user": "Headroom"
    }
  ],
  "metascore": 75,
  "name": "Bernie",
  "num_weekends": 20,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 27,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 85805,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 47862,
  "rating_freq": {
    "1": 654,
    "10": 2178,
    "2": 478,
    "3": 763,
    "4": 1595,
    "5": 3912,
    "6": 9626,
    "7": 15761,
    "8": 9751,
    "9": 3144
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 137,
  "votes_per_demo": {
    "aged_18-29": 15043,
    "aged_30-44": 19646,
    "aged_45+": 6127,
    "aged_under_18": 90,
    "females": 6695,
    "females_aged_18-29": 2251,
    "females_aged_30-44": 2763,
    "females_aged_45+": 1323,
    "females_under_18": 11,
    "imdb_staff": 7,
    "imdb_users": 47862,
    "males": 35309,
    "males_aged_18-29": 12653,
    "males_aged_30-44": 16644,
    "males_aged_45+": 4705,
    "males_under_18": 78,
    "non-us_users": 20803,
    "top_1000_voters": 385,
    "us_users": 14688
  },
  "year": 2011
}