{
  "avg_rating_per_demo": {
    "aged_18-29": 7.3,
    "aged_30-44": 7.1,
    "aged_45+": 7.2,
    "aged_under_18": 8.2,
    "females": 7.6,
    "females_aged_18-29": 7.5,
    "females_aged_30-44": 7.5,
    "females_aged_45+": 7.8,
    "imdb_staff": 6.5,
    "imdb_users": 7.2,
    "males": 7.1,
    "males_aged_18-29": 7.2,
    "males_aged_30-44": 7.0,
    "males_aged_45+": 7.1,
    "males_under_18": 8.2,
    "non-us_users": 7.1,
    "top_1000_voters": 6.6,
    "us_users": 7.2
  },
  "avg_screens": 533.6875,
  "budget": 5000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 3,
    "month": 8,
    "year": 2012
  },
  "critic_review_count": 106,
  "duration": 78,
  "genres": [
    "documentary"
  ],
  "gross_income": 28965459,
  "max_screens": 1563,
  "mc_avg_user_score": 6.5,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Chimpanzee",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 14,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 100,
      "summary": "Chimpanzee lets everyone feel like a mini-Jane Goodall."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "An eye-opening primer in cross-species similarity. We learn that apes are violent and territorial but also that they are capable of creativity and tenderness."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Chimpanzee is so skillfully crafted, and the big-hearted outcome so endearing and entertaining, that any narrative liberties taken to aid in the telling of this prehensile tale are not only forgivable but welcome."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Kids should especially like this magnificent and heartwarming look at the life of young Oscar."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The stunning and mostly uncompromising visuals more than compensate for the frequent corny turns of phrase."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "In general, the more young people who see the film, the more who will be made aware of a fascinating, complicated near-relative whose numbers are dwindling rapidly."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "No amount of gorgeous jungle footage can make up for the fact that this Disney-produced documentary feels about as natural as an episode of \"The Hills,\" though with (slightly) more feral characters."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Inter-chimp and territorial fighting are facts of nature, but the extreme anthropomorphism of Chimpanzee makes what is natural feel bizarre."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Fothergill and Linfield capture plenty of humor and drama."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "It has plenty of charm and is filled with astonishingly intimate footage worth seeing on the big screen but is sketchy on details and dumbed down by cutsy, anthropomorphizing narration."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "It's unfortunate that the filmmakers juxtapose those striking visuals with a warlike anthropomorphizing element."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Blend sound with sight, though, and the package becomes more difficult to take."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "But nature is messy, and Chimpanzee doesn't shrink from that, to its credit. Fothergill and Linfield at least exercise discretion when their cameras capture disturbing turns of event."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "The astonishing footage of apes in their natural environment is made perfectly accessible and then nearly undone by a narration track that plays to the audience's basest desires for gag-inducing cuteness."
    },
    {
      "critic": "Benjamin Mercer",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Throughout, narrator Tim Allen shuttles between a jokey primer on chimp society and a basic play-by-play during the more action-packed scenes - the constant stream of explanation often detracts from the heart-of-the-jungle sights and sounds on display."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Visually stunning, almost impossibly intimate results. Unfortunately, this footage is welded to a creakily executed story and narrated by a schticky, frequently bellowing Tim Allen."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "\"Humanize\" might not seem the obvious verb for what happens in Chimpanzee, Disneynature's latest kiddie documentary. But it's dead on; this escape to the planet of the apes is anthropomorphic to a fault."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Some privileged nature footage from the African rain forest is dishonored by deeply silly narration in Chimpanzee."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2012
      },
      "score": 42,
      "summary": "It isn't easy to insult the intelligence of preschoolers, but Chimpanzee's insistence on turning the two gangs into the Sharks and the Jets does the job long before Allen lapses into his Home Improvement grunting."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "By film's end, you'll wish they tossed Allen in the rainforest and left him for the leopards to snack on."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "To experience Chimpanzee, the latest piece of gorgeously shot pablum from Disneynature, is to endure an orgy of cuteness pasted over some of the most asinine narration ever to ruin a wildlife movie."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "No one's asking for a somber account of simian life, but perhaps Buzz Lightyear could keep quiet for a bit and let the monkey business speak for itself."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "There was no need to edit it in overly slick ways that often make the story line seem contrived, accompanied by gag-laden narration that frequently made me want to gag."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Very enjoyable movie about a family of chimpanzees, especially their youngest scion, Oscar. The group searches for food, teaches the little guy the rules of the game, and fights off their enemies. In some respects, it's a lot like \"Bambi,\" only this is real footage and not a fictional story. A few moments may be scary to very young children. Most viewers will find it simple but heartwarming. A fun movie if you want to see something lighter and get away from explosions and aliens for a while.",
      "total_reactions": 1,
      "user": "Lokar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Awesome movie!!!!  Yes, there are things I can nitpick about and wish were done differently or explored more thoroughly, but the bottom line is that the movie was great for my family.... was enjoyed by my cynical 9 year old and my movie theater hating 8 year old and tolerated by my almost 4 year old.  The cinematography was fantastic and my hats off the the crew that made the magic happen.  This wasn't a documentary made for the doctoral student in animal behavior but a great family film that kept us captivated and taught us a thing or two along the way.",
      "total_reactions": 1,
      "user": "craig1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Very very adorable. I really like it. Good job Disney Nature!!",
      "total_reactions": 1,
      "user": "gex6"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Notwithstanding the brilliant cinematography--gracefully capturing the Ivory Coast's Tai Forest--as well as the real-time footage of the simians, themselves, \"Chimpanzee\" is a ultra-light-for-kids eco-doc that, although is believed to be real, and is real, doesn't quite feel real; it's dramatic scenery is accompanied with an even lower suspension of belief voice narration--by Tim Allen--which although corny, is nothing compared to the Disney script that attempts to loosely link the plot of \"The Lion King\" to a lecture on primatology. In other words, it feels overly contrived, thus managing to demean the marvelous footage in sight; some Bose headphones to block the sound, just might do the trick. But, if the jarringly tenuous and at times, mawkish narration or even the desperate recycling of Disney-movie-orphan-themes won't bother one from heading to the theater with the kids, the pathetic anthropomorphisms--with names of the likes of \"Oscar,\" and even \"Scar\"--might be enough to discourage viewers. Now, in premise, the humanized chimps seem like a reasonable means to entertain and tell a story to, the kids. But, where it goes wrong is when Disney, again, creates the dichotomy of \"good\" chimps versus \"bad\" chimps. To illustrate the distinction even further, everytime \"Scar\" is shown intervening, the music intensifies, leaving the viewer with a dark, ominous throbbing. This is simply misleading for the youngers, as they are fed the same sermon of ethnocentricism--us versus them--suspending their cognizance that \"Scar,\" too, has his \"own\" \"Oscar\" at home, yet it is such an omission of reality in which children are not informed. \"Chimpanzee,\" regardless of its tainted superficiality and resorts to threadbare Disney-themes, is still a wonderful visual spectacle that, in its visualization, contains a magical aura that emphasizes just how close our animal cousins are, and how short the cross-species bridge really is; from the familial bonds of our distant relatives, we are reminded of what life really should entail. Ultimately, though, the same underlying authenticity that was filmed during its production--sans Tim Allen, music, staging, names, etc.--is mainly lost through the over-exertion of string-pulling that makes everyone of \"Oscar\"'s astonishing triumphs all the less astonishing; it's an eye-opening primer, only beneficial for the eyes, that is too much Saturday-morning-cartoonish and not nearly enough \"Nat-Geo.\" To the unknowing chagrin of its viewers, the latter is far more constructive and worthwhile.",
      "total_reactions": 3,
      "user": "FDT44"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "It almost feels like a sin to give a Disney nature film, let alone on Chimpanzee's a 3 but it is ever so deserving. I'm sorry but this new edition into Disney nature films was just boring and the narration was annoying. Tim Allen was a terrible choice for this movie. For one i just kept thinking of Buzz Lightyear whenever he talked and two, omg was his script laughable at best. Did we need a full play by play of what \"Oscar\" is thinking or feeling whenever he eats or plays? No, not at all. I just wanted the scream at Tim Allen to tell him to shutup because never once do you get a chance to just enjoy the nature of the film. He just kept talking and talking and talking. It was beyond annoying. The other problem i had was the overall aspect of the film was extremely repetitive. The chimps eat at the nutgrove, then they play, then they get attacked by Scar and his \"gang/army\" then back to the nutgrove, then playing, then sleeping, oh then Scar attacks again. It was boring, annoying, and just awful all around. The only positive was the cinematography, even then some of the camera wwork was poor, it got shaky and VERY hard to follow what was happening if not for Tim Allens irritating narrating job. I have loved the Disney nature films, oceans being my favorite, but Chimpanzee just seems like overall a very weak effort by Disney. The 78 minute duration is quite on the short side as well. I didn't enjoy this in the slightest, but its too big of a sin to give it a 0 just because its Disney nature, so ill ive it a 3/10",
      "total_reactions": 4,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Chimpanzee, the new proyect of Disneynature, I need say that this documentary is great, but is not the better job of Disneynature, I think that the need more data, and do this documentary more interesting (yeah is interesting, but in some moments boring), because the chimpanzees are an amazing animals, the documentary is excellent, but need improve some aspects.",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "The movie was overly long, but one learns something about the specie, such as they're learning to do certain task, their communal life together (leadership, cooperation, family ties, etc.). Kids who are interested in animals will find it educational. A good family film.",
      "total_reactions": 0,
      "user": "mschoa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "This movie was very emotional and at some parts, a bit humorous. But a lot of the ending slow and boring. The baby chimpanzee in this movie is very cute and friendy, though. By the end of this movie, you'll feel a real connection with this baby chimp.",
      "total_reactions": 0,
      "user": "Sheldonc1981"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "The insipid narration very annoyingly and repeatedly tries to give the Chimpanzees human traits. Also, the footage, while breathtaking, seems to be manipulated to create melodrama and tell a story that may not have been filmed.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Es bonita la vida de una banda de Chimpance con una historia entretenida y dramatica, sin embargo en momentos llega a ser aburrida y demasiado, un buen intento",
      "total_reactions": 0,
      "user": "Jmsbpp"
    }
  ],
  "metascore": 57,
  "name": "Chimpanzee",
  "num_weekends": 16,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 10673748,
  "opening_weekend_income_currency": "$",
  "rating": 7.2,
  "rating_count": 5050,
  "rating_freq": {
    "1": 85,
    "10": 712,
    "2": 40,
    "3": 34,
    "4": 78,
    "5": 274,
    "6": 741,
    "7": 1479,
    "8": 1138,
    "9": 469
  },
  "release_day": 20,
  "release_month": "April",
  "release_year": 2012,
  "user_review_count": 27,
  "votes_per_demo": {
    "aged_18-29": 1396,
    "aged_30-44": 2108,
    "aged_45+": 751,
    "aged_under_18": 12,
    "females": 1031,
    "females_aged_18-29": 374,
    "females_aged_30-44": 407,
    "females_aged_45+": 177,
    "imdb_staff": 2,
    "imdb_users": 5050,
    "males": 3414,
    "males_aged_18-29": 1010,
    "males_aged_30-44": 1685,
    "males_aged_45+": 563,
    "males_under_18": 12,
    "non-us_users": 2233,
    "top_1000_voters": 102,
    "us_users": 1365
  },
  "year": 2012
}