{
  "avg_rating_per_demo": {
    "aged_18-29": 7.2,
    "aged_30-44": 6.9,
    "aged_45+": 6.7,
    "aged_under_18": 7.6,
    "females": 6.9,
    "females_aged_18-29": 7.1,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.7,
    "females_under_18": 7.7,
    "imdb_staff": 6.9,
    "imdb_users": 7.1,
    "males": 7.1,
    "males_aged_18-29": 7.2,
    "males_aged_30-44": 6.9,
    "males_aged_45+": 6.7,
    "males_under_18": 7.6,
    "non-us_users": 7.0,
    "top_1000_voters": 6.3,
    "us_users": 7.2
  },
  "avg_screens": 783.7647058823529,
  "budget": 12000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 1,
    "month": 6,
    "year": 2012
  },
  "critic_review_count": 415,
  "duration": 84,
  "genres": [
    "sci-fi",
    "thriller"
  ],
  "gross_income": 64572496,
  "max_screens": 2908,
  "mc_avg_user_score": 7.3,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 76,
  "mc_movie_name": "Chronicle",
  "mc_negative_rating_frequency": 42,
  "mc_positive_rating_frequency": 411,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 100,
      "summary": "If the characters weren't so well drawn, if the effects weren't so convincing, and if the upshot weren't so ghastly, the moral component wouldn't carry any weight. But Trank tells his tale with an emotional and visual crispness that gives the superhero genre its best crack at naturalism so far."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 91,
      "summary": "The most original and excitingly executed wow-factor-meets-handheld-video feature since \"Blair Witch\" itself. It's also a movie that rebuilds the power of special effects from the ground up."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 88,
      "summary": "Chronicle is full of smart writing that isn't too smart."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 88,
      "summary": "John Trank's Chronicle grows into an uncommonly entertaining movie that involves elements of a superhero origin story, a science-fic­tion fantasy and a drama about a disturbed teenager."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 83,
      "summary": "Chronicle is so clever about the absurd, and so much fun to watch, that I'm almost disappointed the ending doesn't leave room for a sequel."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 83,
      "summary": "Chronicle becomes what \"Hancock\" wanted to be - a dark superhero story with firm footing in the everyday. Perhaps now the found-footage gimmick has been fully exploited; let us never speak of it again."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 80,
      "summary": "First-time director Josh Trank, working from a taut script by Max \"Son of John\" Landis, indulges in some wild, witty spectacle, but he's equally adept with the tale's grimmer elements, especially when the introverted Andrew unleashes his inner Magneto and uses the city of Seattle as his tear-it-apart emotional playground."
    },
    {
      "critic": "Mark Dinning",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 80,
      "summary": "A stunning superhero/sci-fi that has appeared out of nowhere to demand your immediate attention."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 80,
      "summary": "This mind-and-fork-bending sci-fi saga comes from the freaky imaginations of director Josh Trank and screenwriter Max Landis, who've packed their feature debut with smartness."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 78,
      "summary": "Chronicle may go over the top with its climax, but for such a giddy film, it's remarkably down to earth."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Bolstered by the natural performances of a trio of little-known actors, the very watchable Chronicle keeps us captive throughout."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Despite a gimmicky premise, Chronicle fuels its action with characters you can laugh with, understand and even take to heart."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "The cast is comprised of unfamiliar faces, which enhances the pseudo-reality of the milieu. The principals - Dane DeHaan, Alex Russell, and Michael B. Jordan - are professional actors with credits (many on television) to their names. But they are not \"known\" stars and that allows them to be accepted with ease into these roles."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "By the time he's putting the entire metro area on notice -- having thrashed his father and all the local bullies -- Andrew has no camera and the metaphor has run away with the story entirely. The crazy thing is it almost works."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Unlike other mock documentaries, which unconvincingly pass themselves off as real, Chronicle cleverly embraces the format as shorthand for a new kind of naturalism, inviting audiences to suspend disbelief and join in the fantasy of being able to do anything with their minds."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Chronicle, with its found-footage storytelling and superpowered teens, at least playfully transcends its \"Cloverfield meets Heroes\" pitch."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "A clever twist on superpowers and hand-held filmmaking that stumbles before the ending."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Mr. DeHaan, whose vulnerability and physical awkwardness here can evoke the young Leonardo DiCaprio in \"What's Eating Gilbert Grape,\" is invaluable. Mr. Russell and Mr. Jordan are as likable as their characters, but it's Mr. DeHaan who pulls you uneasily in."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Indeed, to even call Josh Trank's film a superhero movie seems wrong: Rather, it's about what the average teenage boy might actually do with superpowers - and there is very little heroism or villainy on display here. Chronicle's very lack of scope is its strength."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "As pulp sci-fi this Fox release is pretty good, but it's also commendable for its sensitive depiction of adolescent behavior: even the bullying scenes avoid the caricature of most studio films."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Chronicle plays like an extended episode of \"The X-Files\" might; DeHaan in particular comes off like one of the series' more-memorable characters. That's a compliment. It isn't a great movie, but one could imagine -- and hope -- that it becomes a cult favorite, outlasting other films of its ilk."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Unfortunately, the film's climactic finale grows repetitive and goes on a little too long; once you've seen bodies flying and crashing through buildings once, you've seen it plenty."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Chronicle will never be mistaken for an artistic breakthrough, but it has a solid gimmick and pieces of it are brilliant."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Chronicle is an energetic hodgepodge that tweaks familiar conventions just enough to seem fresh. Forget the X-Men - these are iHeroes."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "A few more bucks (or a little more thought) for the script would have been a better investment than faking Seattle. The characters are introduced so quickly, and their personalities are so thin, that what happens to them has little weight."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "It's odd, how these high-concept films, knowing that the central gimmick has a way of wearing out its welcome, are all so short – a mere 84 minutes in this case. Why odd? Because short always ends up feeling so damn long. This is no exception. Quick to start and painfully slow to finish, Chronicle is the same old chronicle."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Simultaneously diverting and annoying."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Offers up little more than a tired morality play about the dangers of power, rehashing stale insights about the narcissism of the documentary impulse."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "A messy if initially intriguing take on sci-fi-underpinned high school angst for the vlogging age, Chronicle eventually grows repetitive and stale."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 38,
      "summary": "With great power comes the responsibility to make a decent movie, but the mysterious force running through Chronicle is the power to supersuck."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A great little superhero inspired film, one of the strengths of the film is how it surprisingly manages to do something interesting with the found footage motif. The film does a great job at making a complex, sympathetic villain, a sort of modern re-imagining of the Lex Luthor story.",
      "total_reactions": 2,
      "user": "Longbottom94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "While initially the combination of a whining lead character and the shaky cam was a massive turn off, as the film got into full swing I started to really appreciate it, to the point where I didn't even notice it anymore. The film has a superb use of effects, from the subtle to the downright ridiculous, everything has a hyper-realistic shine to it that really adds to the effect and overall feel of the movie. Very well paced and I really loved how the movie took a proper (though admittedly predictable) dark turn. Beautifully subtle while at the same time tastefully in your face, one of the best action movies of 2012 without a doubt and one to watch again.",
      "total_reactions": 1,
      "user": "fangaas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "I had high hopes for this movie, I avoided trailers and reviews on purpose to avoid finding out about any details. I was somewhat disappointed, it drags for most of it and when the details are necessary it speeds through with silliness. I guess there aren't many options for sci-fi being released these days so whatever, watch it if you have nothing better to do...",
      "total_reactions": 1,
      "user": "DrAwesom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "What a clever film......It's equal party funny and gritty and even a little unexpected.....",
      "total_reactions": 1,
      "user": "OllieWillie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Overall, this movie was original (although definitely very inspired by any number of different comic books), very creatively done, well-acted all around, and just plain fun.",
      "total_reactions": 1,
      "user": "OneVoice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "This is nothing short of every boyâ",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Chronicle was a fantastic movie and definitely deserves more than a 69%. Its camera angle was experimental and new (similar to Cloverfield) and I enjoyed it, although some people won't. During the first half of the movie I didn't really enjoy the camera angle, but by the second half I did. The acting was fantastic and the characters were interesting. However, the main character Andrew did many things that I didn't feel he would do according to his personality. The ending was bittersweet and the movie had many twists and turns so it wasn't predictable.  Overall I loved the movie and was really engrossed in the story.",
      "total_reactions": 1,
      "user": "jakomocha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "\"Chronicle\" (2012) tells the story of a adolescent, Andrew, who is",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Chronicle's portrayal of superheroes is dark, gritty and true to life. The found-footage theme does add an amount of realism, and adds a certain emotional impact to the characters that other found footage movies haven't done before. The films morality theme plays out nicely with clever writing and characters you can relate to, however, the pacing can be slow and only seems to pick up around a third of the film. Another issue is the CGI that does seem outdated but isn't bad enough to pull you out of the experience. Overall, Chronicle is a movie you can't miss, with a great story and amazing new actors, Chronicle is a true modern great.",
      "total_reactions": 1,
      "user": "themadcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "A fantastic film that starts with a fun and overall teenage theme before developing bit by bit into a suspenseful superhero epic that lasts in your memory. The combination of normal life with superhuman abilities was excellently pulled off, and the cast of young and mostly unheard of actors showcased their talents extremely well.",
      "total_reactions": 1,
      "user": "Thanial"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "A found footage movie that transcends its own genre. The premise of the story allows new things to be done with the handheld format the completely fit the movie and gives a more fluid viewing experience. But on top of that Chronicle is also interesting, thrilling and entertaining. Dane DeHann, Alex Russel and Michael B. Jordan do very great jobs, the special effects are great for the most part and the last 25 minutes is really intense and exciting. Chronicle is definitely my favorite found footage movie.",
      "total_reactions": 1,
      "user": "Jack97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "From movies like Jumper, Push, Next, Clockstoppers, and some other movies about people getting superpowers and using it for their own good, Josh Trank and Max Landis have pulled of the impossible. So what is it about this movie that i liked so damn much, well for one thing i loved the pacing and the timing in this movie, for a running time of 83 minutes, the movie doesn't waste your time and gets to the point very quickly and perfectly. Another thing is how realistic this movie is, with the camera work, it definitely worked out for this movie, and the characters were aware of it, which was a major plus in my book. I could say so much more, but what i will say is my regards to the director and writer for delivering one of the best movies of the year, and were only getting started.",
      "total_reactions": 9,
      "user": "SnafuFrank"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "It's been a while since I wrote reviews in metacritic, so I thought writing some would be good. Anyways, all could say of Josh Trank's \"Chronicle\" is that it's very original. He diminishes those first-person camera angle problems by switching viewpoints (from Andrew's camera to other cameras, iphones, and even from the news chopper) which is clever. The script is well written and although the movie's kinda short it has it's sense of intensity most 2 hour movies can't even show off.",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Its rare to find movies that actually portray what average people would do if they had super powers. Chronicle was a very good movie. where the special effects lacked, the story and characters shined.",
      "total_reactions": 6,
      "user": "phatman1211"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I usually don't like shaky cam movies and when I first saw the trailers for Chronicle, I wasn't exactly too keen on watching it. I finally sat down to watch it the other day and was amazed that I almost missed one of the greatest superhero movies ever made. All I can say is that if you're a comic book fan, go and watch this movie. Max Landis and Josh Trank really know their comics.",
      "total_reactions": 3,
      "user": "hcookie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Chronicle has what many lesser found footage films lack. The genre has a history of sacrificing character for style, of using hand-held filming to hide a lack of budget. This film has very strong performances from the three leads Dane DeHaan, Alex Russell and Michael B. Jordan (especially DeHaan) who all play interesting, well-developed characters that you enjoy spending time with, and the film's entertaining premise of the three highschool friends gaining superpowers after the discovery of a mysterious object provides some good laughs and fun spectacle, particularly in the scenes where the boys are learning to control their new gifts. The film also creatively gets round the chief weakness of the found footage genre - who's holding the camera? (the way they do this is a highlight which I won't spoil here). Like Cloverfield, Chronicle doesn't try to provide a concrete explanation for the odd goings on that we witness, but this mostly works for the film, and you should be able to fill in the gaps yourself (at least until an inevitable sequel surfaces which will doubtless expand on the film's universe). Disappointingly, the final act of Chronicle is pretty poor. The action becomes all-consuming and repetitive, the characters are reduced to conduits for the filmmakers to spend their remaining budget rather than anyone you can care about anymore, and the presence of one of the secondary characters is seemingly only to have someone else holding a camcorder. In other words, the film becomes just like all the films it has, up to the final act, been surpassing. Though the finale is an overblown, flaccid bore, the rest of Chronicle is a riot, and feels pleasingly original for a film that is part of a filmmaking craze that has long outstayed its welcome. Here's hoping the sequel builds on the considerable successes we find here, though without Josh Trank's sturdy direction (he's reportedly been headhunted to helm bigger superhero fare), it remains to be seen whether a second instalment will become too big and dumb.",
      "total_reactions": 3,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Not a big fan of the shaky camera like Paranormal Activity. I loved this movie because it has a very good story line, and his keeps you on the edge of your seat.",
      "total_reactions": 3,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Really cool film! The handheld shaky tone of the film worried me when watching it, it is usually annoying the have to deal with a whole film's worth of dodgy angles and motion sickness but this film does it so cleverly that makes it so enjoyable, overalls a really cool concept and well produced film!",
      "total_reactions": 3,
      "user": "Filmis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Finally! A superhero movie I don't laugh at. Chronicle shows, not akward or unfortunate nobodies who by some accident develop superpowers and decide \"I wanna dress funny and save complete strangers\". True, the three main characters do develop superpowers by literally stumbling into them, but they dont start playing superhero/supervillain until they absolutely have to; in fact, never once in the movie was the word \"superhero\" even used. When I first saw the trailer, I thought to myself \"Well, that's the movie, right there. No need to go see it. Boy, was I wrong. I won't reveal much about the plot or characters, but suffice it to say the trailer actually barely reveals anything at all. The acting has its ups and downs, and admittedly the movie could be a little better paced, but for the most part everything balances out. It's worth a look, for sure.",
      "total_reactions": 4,
      "user": "TheangryOne"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Definetly worth watching! Wasn't crazy about the ending so much but loved the plot and unique script. Was interested through out the entire movie and audience deemed to be as well.",
      "total_reactions": 4,
      "user": "ilikemovies88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "I don't write many reviews (for how many movies I see), however I have to say I was surprisingly impressed with this movie. The acting and special effects were above average, and the story had many interesting themes. You have to dig a little bit deeper in order to get the most out of this movie; but if you're familiar with any philosophy (particularly Schopenhauer), you'll probably find a lot to like here.",
      "total_reactions": 2,
      "user": "kings7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "What a movie to open the year with (the first new release I've seen this year)! It opens slowly, but builds into a truly fantastic climax that had me very excited throughout. The acting at times is very good and the story is actually quite emotional and can become hard to watch. When the characters get their powers and start to mess around with them is fun to watch as well. Now for the bad points of the film: Some of the dialogue is too cheesy and feels out of place (the ending in particular) and it takes a while to get interesting. From my experience the film splits opinions, upon reflecting on the film, I said the ending was very good, but my friends disagreed. Definitely go into this movie with an open mind, it helped me a lot.",
      "total_reactions": 2,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "This movie for once actually had an interesting story, easily followed up by a sequel, really interesting how they did the camera work, how it was done in the story as well as the technical aspect, and when the water moved away from his feet, WHOA that took some serious work to pull off.",
      "total_reactions": 2,
      "user": "hootis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Of the 3 main characters in the movie which one do they decide to kill off....the BLACK one! Way to follow the sterotype that the first guy to die is usually the black guy. The worse of it is that he was the best character in the movie by far and once you lose him, the interest fades greatly. Focusing too much on poor mans Leo Dicaprio whos tortured and depressed was a bad move. They're powers are cool and the special effects are well done just the storyline has you screaming, \"come on!!\" Could of easily been a lot better but still a decent flick.",
      "total_reactions": 2,
      "user": "SeanMcGunnigle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Chronicle is a much better movie than I was expecting. Hollywood has been coming with a ton of low budget \"found footage\" movies lately and, to be honest, most of them have been truly awful. This film is different though. It benefits from a steady hand from talented director Josh Trank and boasts a strong story with a surprising amount of depth from it's young writer Max Landis. This is definitely a small film that has it's budget constraints. It's a large scale concept that is occasionally held back by suspect special effects but for the most part they will definitely suitable. I thought this was a terrific, low budget sci-fi film that uses it's \"found footage\" style to it's advantage unlike most \"found footage\" films of recent.",
      "total_reactions": 2,
      "user": "Nolanite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Wow.... just wow. I had no idea what this movie was about going in. I thought it would be really cheesy but good worth at least a 4. Definitely a solid 9 and will leave you thinking about it way after the credits roll. Great and worth a watch!",
      "total_reactions": 2,
      "user": "snakeoil"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "When I first saw the trailer for this film it looked very exciting, an on-edge gritty film which I looked forward to watching. However, the documentary  style doesn't work with this sci-fi film as you seem to miss the action being constricted to a shoddy camera angle in which it is hard to make out what is going on. There is also a disappointing ending which feels like the whole build up of tension was for nothing.",
      "total_reactions": 11,
      "user": "BigTommy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "After discovering a mysterious \"rock\" in a hole, three guys become able to move things with their mind. This starts out cool and fun, but develops into the inevitable grand disaster. The effects are numerous and convincing, but the pacing is often slack. The movie is created from \"found\" footage (a la \"Cloverfield\" and \"Paranormal Activity\"), which creates a subjective and non-traditional narrative flow. You have to go with this flow to accept the story, but the real question is: is it worth the teenage angst and tedium for a lot of cool visuals?",
      "total_reactions": 5,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "I don't usually go to bad movies, but when I do, I remember why it's a waste of money. The 'hand-held' gimmick contributes nothing to this film, and it seems to have distracted the director from providing the kind of pacing expected in a movie with so much action. There were a number of times in this film when something was supposed to be a surprise, or exciting, and everyone in theater just laughed awkwardly. A disappointing treatment of a good idea.",
      "total_reactions": 9,
      "user": "leon_guillott"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "\"...film everything,\" that's the manifesto Andrew comes up with in his room. This idea comes to him well before the amateur filmmaker and his \"friends\" acquire their superhero abilities. It's not spectacle that he's after. Compared to other \"found films\", such as The Blair Witch Project and Cloverfield, Andrew's intent, in Chronicle, as the fllm's protagonist, differs strikingly from the investigative journalism-minded Heather(who leads the two young men to their doom in the Maryland woods), or Hudson, the videographer turned documentarian, at a friend's farewell party, when NYC comes under attack by a monster. Like Cloverfield, it's an inciting event that transforms Chronicle from a prosaic record of mundanity into an exercise in genre. Differing from Hudson, however, is the fact that Andrew starts off with an aesthetic, a narcissistic one which echoes the hyper-real self-art of Jonathan Caouette, the brainchild behind Tarnation, the 2003 doc which formalized navel-gazing and surpassed the voyeurism of Capturing the Friedmans. Andrew uses the camera like a salve, as does Caouette, and as does \"Heather\", who screams, \"It's all that I've got,\" after being told repeatedly by Josh to put down the camera. And thus the troubled teen points the lens fixedly at the physical abuse he suffers at the hands of an alcoholic father, and also to apply some objective distance between himself and his ailing mother, the latter parent recalling Renee from Tarnation, with the difference being that Caouete's mom suffered mentally. As Jonathan does, the introverted boy looks through his lens unflinchingly, not shying away from his mother's decay, bedridden on account of some unnamed disease. Uncannily, The Magnetic Fields song \"Strange Powers\" plays over the Tarnation soundtrack, bridging both Cloverfield(\"On a ferris wheel looking out on Coney Island,\" the place where the J.J. Abrams film ends, from a section that Hudson doesn't tape over, featuring Beth and her China-bound beau, just days before the invasion), and the strange powers accrued by Andrew and his cohorts from their contact with the monolithic object that they discover in the hole, itself possessing a magnetic field. The boys become telekinetic. In particular, Andrew, a modernization of Carrie White(Sissy Spacek), from the Brian DePalma shocker. At school, Andrew is a target for bullies, mean boys who think nothing of breaking the his camera. Are they a match for the mean girls who taunt Carrie? It's hard to say, due to the film's first-person perspective. What humiliating footage does Andrew leave out? The audience's knowledge is limited. When the camera is off, for all we know, Andrew is being pelted by condoms in the boys' locker room, therefore, the inter-textuality of the aforementioned films includes Carrie, too. Tarnation also chronicles Caouette's school life. We see that Caouette also brought his SUper-8 camera for the expressed purpose of taping stage rehearsals, a Blue Velvet remounting; a musical adaptation cut in the same vein as the infamous Stephen King-inspired Broadway fiasco. During this period, Caouette, the teen impresario, had an affinity for Carrie, as he and his collaborator would quote lines, according to the extra-diegetic titles. Most memorably, the admonition forewarned by Mrs. White, Carrie's fanatically religious mother, who warns, \"They're all going to laugh at you,\" just before her daughter leaves for the prom with Tommy Ross. Among the revelers, joining in the mass chorus of guffaws, is Miss Collins, the the shy girl's so-called mentor. Whereas Matt is nice to Andrew because they're cousins, the P.E. teacher befriends Carrie, purely out of a professional obligation that presupposes a teacher treats both the popular kids and the misfits with equal measures of kindness. If not for the blood ties, Andrews figures that Matt would be his adversary, prompting the documentarian to ask his relative, \"Do you even like me?\" Matt's answer: \"You're really hard to talk to,\" will have grave consequences for his best friend. It's the same conclusion, in regard to Miss White's true feelings toward her pupil, that Carrie arrives at too late. If only she could've hard the educator admit to the principal that she knew how those girls felt, since \"the whole thing,\" referring to Carrie's first period, \"made me want to take her and shake her too.\" At the prom, you realize that Miss White was once a mean girl too, regaling Carrie with the tale of her special night with the captain of the basketball team, a scenario that the girl couldn't possibly relate to. After Carrie gets doused with pig blood, the teacher's latent disdain for her underling comes out, and dies for it. The same fate that awaits Steve, as Andrew turns into the anti-Thor, striking his cousin's best friend with a lightning bolt in the night sky. Andrew is his own worst enemy, the Elephant(the 2003 Gus Van Sant film) in the room.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed this movie.  At first, the hand held camera bugged me but I got used to it and decided that was the right way to do this movie.  What was great about the movie was the exploration of the psychology of the 3 different teens (also the actors really seemed older than high schoolers).  All in all, much better than I was expecting.",
      "total_reactions": 3,
      "user": "Bama72"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Its a mix of lawnmower man ( obtains powers ) and cloverfield ( shot from camera ) but is a forgettable movie. It was entertaining how they played with their new powers but there is nothing new here that hasnt been done before.",
      "total_reactions": 3,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Its brilliant , its different , it no one ever thought before . Chronicle gives its viewers something totally different .  the way they put together the idea of making Superpowers look bad was super . I always wanted to see a movie with superpowers gone bad and Chronicle did it and they did amazing . Josh Trank's direction was super . He is a fine young director and I wish him luck . of the three players I like Alex Russell's character and him acting the best . the effects of the film was amazing . How the hell they did all those with so little budget ! Overall an awesome si-fi thriller movie Chronicle is . Waiting for the sequel .....",
      "total_reactions": 3,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "Don't waste your money going to this movie. The trailer had preety much 60% of the best parts shown. Overly dramatic, not enough humor at all. I would consider this movie to be more of a drama then a scifi, as a drama it is preety good, but not what I expected from the trailer. Camera work sucked too btw. If you see either project X or chronicle go see Project X.",
      "total_reactions": 3,
      "user": "iWatchTrailers"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "I can't believe I sat through this movie. About half way through I wanted everyone to die so it would end. Everything about this movie was thin. The characters were barely two dimensional and the plot was driven by cliches. The dialogue could have been written by 13 year old. Amateur night at the cliche house.",
      "total_reactions": 7,
      "user": "Isaacs18"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "With a cringe on my face and bag of lollies in hand, I prepared myself for another handy-cam filmed cliche teenage superhero film. Sigh. I was willing to give Chronicle a chance to be better than just another Paranormal Activity film, but it failed. The film starts out having you feel sorry for senior student Andrew (Dane DeHaan) as he sets his camera up to catch his abusive father in action. The story then begins to unfold as Andrew, his cousin Matt (Alex Russell) and their newly made friend, Steve (Micheal B Jordan), wander into the woods and down a hole in the ground. I know that in this bit I had hope for it as they show an organism within a glowing blue stone that reminded me of the 'black oil' from the X-Files, but they didn't further on this at all through the film. Obviously the boys gain supernatural telekinesis powers form this glowing stone. Things unwind and are quite boring as the boys powers strengthen, they learn to fly and become popular with the ladies. At this point I was so stressed about how un-entertaining the film was, but then it got a tiny bit better. Andrew, being the strongest of the group, takes his powers to the next level. Being edged on by the abuse form his father and slowly dying mother, he believes he is at the top of the food chain with his new found power. Although, just when you think they weren't going to add in the cliche of having 'super hero suits', it happens. I don't want to ruin the ending for you, but it does getting a little exciting but still a little overdone as the film winds down with a very anti climactic ending. It had the chance to change my view on hand-cam style films and bring something new to the table, but I think it was overdone even when Cloverfield was released.",
      "total_reactions": 8,
      "user": "zoezoezoe"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "If this is the state of high rated movies today we got a problem. Interesting concept, but so amateurishly handled. The hand held camera concept is getting really boring and so detracts from any tension build up. Characters are a joke. Fake high school kids played by adults - again. So it builds to a mildly thrilling climax, but again diluted by lack of tension. Long boring stretches of who cares. If they had dropped the hand held idea, had better actors, more engaging script, could have been cool. But all in all a waste of money.",
      "total_reactions": 4,
      "user": "movieboy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "To put it bluntly, Chronicle was the worst movie I have ever seen in cinema. I'm actually surprised to see the amount of positive reviews on metacritic. The character development was fairly well done, but the overall storyline was extremely poor. I don't want to reveal any spoilers, but it's really predictable anyway. You have the nerd, the jock and the star who all get telekinetic powers but never really use them for anything worthwhile. The flying was done quite well, although it felt like watching a tv series with slightly better sfx.",
      "total_reactions": 4,
      "user": "ZombiesTT"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Chronicle starts out with a high amount of promise, combining the visual style of Cloverfield and the plot of a buddy version of Carrie. As the story and characters develop, several different ideas and themes are thrown into the mix, but never really developed in any significant way. In the end all you are left with is a mish-mash of a film that never truly knew where it wanted to go or what it wanted to say. Despite being under 90 minutes, it seemed to last twice as long. Its a shame, because I felt the core idea of the film had a lot of potential, but completely lost in the second half.",
      "total_reactions": 4,
      "user": "Christlewiski"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Really bad movie!!!! And the fact that they were recording each other all the time was both boring and exasperating!!! great trailer but a  terrible movie!!!!!",
      "total_reactions": 4,
      "user": "seni09"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Starts out fun if you can handle the cheap jumping camera tricks.  By the middle of the movie it starts to go down hill as in Revenge of the Nerds.  The ending is totally predicatable.  Could have been better.  Made on cheap without any big budget so you can call it success for what it did at the Box Office.  For any movie to be good you need to think about it after you leave the theater.  Forgotten as soon as you walk out the door.  Just a good way to spend a rainy afternoon.  No one is going back to see it twice.",
      "total_reactions": 5,
      "user": "fantasy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Another one of those documentary style films where the filmed is a labor to watch. The film had so much potential and we were restricted to dull and constrained angles.",
      "total_reactions": 5,
      "user": "Golder"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Frustrating.  The found footage element is never justified and there's zero plot.  Time and time again, there are story points that don't make sense and are never addressed.  Found myself looking at my watch after 20 minutes.  Would not recommend to anyone who's looking for anything other than a minor distraction.  Really can't wrap my head around all the positive reviews on this one.",
      "total_reactions": 7,
      "user": "lclay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was awesome. The concept, at face value, might seem corny, or cliche. But this movie pulls it all off. It's spectacular, magical, and the characters make it so easy to suspend your beliefs and enthrall you in an exciting, scary, and deep world.",
      "total_reactions": 1,
      "user": "Rawrthas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "As boys grow, they dream of having superpowers.  And during the first part of the film you are taken on a ride on what it feels like to gain such powers and the possibilities it brings.  However, the second part is also a reminder that with great power comes great responsibility and even though the build up is great, the ending felt a bit short.  Regardless, this is the stuff great entertainment is made of.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "If you know Akira... you have a good idea about the story of the movie. It has a very weak start but it becomes better after about 20 minutes. What would you do if you suddenly had superpowers? this movie shows not what Peter Parker would have done but hat me and you would have done. The good: a compelling story, the actors performances, nice special effects.",
      "total_reactions": 1,
      "user": "solidgriever"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "You have to put up with the eye rolling teenage behavior that only Hollywood perceives teenagers to be, and of course the horrible moving camera, but it turns out to be an entertaining film.  The movie progressively gets better and better as it goes on so be patient.  I thought the special effects, for the most part, were great.  They could have made the teenagers a little more likable so that you cared more about the characters and their predicament, but for the most part they are annoying.  Still, I enjoyed it.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Just once I'd like to see what teenage girls do with a superpower.  Why is it always boys?  Especially, since we know they will only use it to impress girls... and ultimately kill each other.",
      "total_reactions": 1,
      "user": "hollyv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "definitively a guy movie. I enjoyed this thoroughly while my girlfriend gave it a \"meh\" at best. Starts out all fun and games but gets intense fast as one of the character's home life issues destabilizes him. its sad that we never find out what the thing was that gave them their powers but definitively leaves room for a sequel.",
      "total_reactions": 2,
      "user": "Systox"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Thought this was really good..obv, I gave it an 8. What I loved was that despite it being quite a mainstream movie, they were not afraid to make it a tragedy, which it is, in the true sense of the Ancient Greeks. From innocence to experience, was beautiful.",
      "total_reactions": 1,
      "user": "thecryonicwoman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The filmmakers of Chronicle did an excellent job at simulating the experiences of teenagers learning to use superhuman powers and just as much learning to deal with the consequences. The characters are invitingly friendly which I believe pulls the viewer in. You understand and feel what every character is going through and deeply empathize with them.",
      "total_reactions": 1,
      "user": "kitsoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "when i think about it, i can't think of a way to make the movie better than it already is. the camera gimmick becomes sort of annoying at the end of the film, but that's that. everything else is at it's best, even though it wasn't the kin of perfection that deserves a 10. the characters are well-rounded, the effects look good and there is a very clear message in the movie: if one were to obtain telekinetic power, his life would spin around.",
      "total_reactions": 1,
      "user": "bram29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Most Sci-fi films fail to impress because they over exaggerate, specifically in comic book movies where the hero is far too strong to have trouble fighting a bald guy in a white suit (Superman or Spiderman, take your pick). Chronicle despite its roots as a science fiction feature is remarkably blunt in its execution and hauntingly realistic both in its depiction of these teenagers exploration of their newfound powers or its depiction of domestic violence and grief, itâ",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Chronicle to me was a bit confusing, the plot seemed to act like a yo-yo one minute everything is slow and then suddenly everyone is high and the cameraman is having a spazm.",
      "total_reactions": 1,
      "user": "silentshade"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Really epic and has an excellent story with one of the best performances and epic action scenes. Could've been better without the shaky camera footage, but really good anyway.",
      "total_reactions": 2,
      "user": "ApocalypseGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "I can understand the \"found footage\" idea, but even though there's seemingly a camera recording every second of modern life, why the film felt like it needed to have the contrived character of the intellectual, video blog-poster in the story doesn't cut it. Yes, you can argue that she helped further develop one of the main characters that represented balance, but doing so while trying to stay within the rules of \"found footage\" and having her filming every moment including when she's answering the door at home to when she's being lifted in her VW Bug on top of the Space Needle is a terrible choice and appears absolutely forced.",
      "total_reactions": 2,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "CHRONICLE is basically the same idea as the movie H A N C O C K, but here it is way better executed. The characters act like normal people when things happen. The movie stays true to the title.",
      "total_reactions": 2,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "So... This movie was one of the worst movies I have ever seen. Might I add that I am around their age group and can definitely tell you that nobody my age acts remotely like the way they acted in the movie. The dialogue and acting was SOOOO terrible, and the whole carrying the camera around added nothing to the movie. His friends wouldn't just go back to being friends with the main character after he NEARLY KILLS SOMEONE.",
      "total_reactions": 1,
      "user": "Ripred49"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Very fun movie. Does some interesting things with the \"found footage\" genre. So far the best of its class in incorporating multiple camera angles. Also, a great example of the \"rise and fall\" story trope. Great movie, go see it.",
      "total_reactions": 1,
      "user": "CaptainFreud"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "\"From movies like Jumper, Push, Next, Clockstoppers, and some other movies about people getting superpowers and using it for their own good, Josh Trank and Max Landis have pulled of the impossible. So what is it about this movie that i liked so damn much, well for one thing i loved the pacing and the timing in this movie, for a running time of 83 minutes, the movie doesn't waste your time and gets to the point very quickly and perfectly. Another thing is how realistic this movie is, with the camera work, it definitely worked out for this movie, and the characters were aware of it, which was a major plus in my book. I could say so much more, but what i will say is my regards to the director and writer for delivering one of the best movies of the year, and were only getting started\"",
      "total_reactions": 1,
      "user": "bob13bob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "The movie is really limited by its use of \"found footage,\" which I hate as a genre.  It could have been much better if it had just been filmed like a normal movie.  That being said, this was a very well characterized film, especially the main character, Andrew.  I thought Dane DeHaan did a really good job of capturing the anger and depression of Andrew and making it feel very real.  The rest of the cast wasn't as good, and were often pretty stereotypical of high school kids.  My other complaint is that the flying looked really fake and could have been done better.  Overall though, DeHaan's performance makes this movie worth watching.",
      "total_reactions": 1,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Absolutely worth the price of admission. The filming really makes for a fresh take on the super hero genre and I actually laughed a good amount in it. The special effects aren't anything special but they weren't absolutely awful either. It's fairly unpredictable which is good and I really like how they got their powers, you don't know what the hell went on but it was a really cool scene. The only bad thing I have to say was that it was a little short. If only Andrew had known with great power comes great responsibility.",
      "total_reactions": 1,
      "user": "TTW107"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Chronicle is such an awesome movie, here's why. Chronicle is a found footage sci-fi film about three teenagers who get super powers, but one of the boys, Andrew (Dane DeHann) starts to abuse his powers and use them for bad. I enjoyed the living crap out of this film! It had great acting (that was believable), perfect dialogue & even pacing. My only problem is that the CGI doesn't look real, but it's found footage, so i'm no gonna **** about it. Go do yourself a favour and watch this movie. Worth your money.",
      "total_reactions": 1,
      "user": "KangaDude873MC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "The great thing about this movie is that it's kind of unique. The plot is maybe too predictable but in the end it was still worth the watch. I love how after you watch the movie, you'd want to go off having their incredible abilities. Reality strikes.",
      "total_reactions": 1,
      "user": "gayfield"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "A good story, good actors but completely destroyed by the attempt to skimp on the effects by trying to be arty with the view from a camera.  How can you show a fight from the point for view of a camera being held by one of the characters?...by switching to traffic cameras and helicopters o so thats an excuse for blurry picture, No.",
      "total_reactions": 2,
      "user": "finchy23041"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Chronicle is straight and fast forward, kind a found footage scenario, but there is no dull moment  in the whole process, everything is sharp , crisp and to the point. Acting is believable, looks strong, smartly directed.One scene, actually tow scenes took my breathe away 1. The whole Ariel ( three boys flying in the clouds)",
      "total_reactions": 1,
      "user": "rajtonic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "This is the score I wanted to give it.. I don't know why it didn't come up when I first wrote my review! And to show how good this movie is.. I bought it 2 days after watching it.",
      "total_reactions": 1,
      "user": "Machine2music"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Let me just start off by saying 'Chronicle' was unexpectedly better than I had thought. The trailer was compelling enough to make me see it in theaters (twice). But what I had mapped out in my head wasn't all that close to what unfolded. The smart and relatively fast directing from Josh Trank also keeps the audience's attention from start to finish. The 3 main characters were also very likeable, and played their parts very convincingly. Chronicle also found very smooth ways to make this movie different from the several other found footage movies. The many different cameras were supposed to be controlled by amatuers, so of course the footage has to be shaky right? Not at all says writer Max Landis, I'll show you how it's done. Bottom line, Chronicle was smart and very entertaining.",
      "total_reactions": 1,
      "user": "Fujiforker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Found footage style has been upgraded in to the a new level. Combined with antihero story, it fills 83 minute span with a fast pace and thrilling story.",
      "total_reactions": 1,
      "user": "Calciferus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Chronicle was an intense movie that you will never forget. The movie had a sore line with twists and turns around every corner, awesome scenes of action, and heroes of an unusual sort. Chronicle was also very thought provoking. From the moment you start watching, you will never want to stop watching until the credits. Can't wait for the sequel.",
      "total_reactions": 1,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "This is just a terrible movie, i was massively disappointed when i went to watch this film at the cinema.",
      "total_reactions": 1,
      "user": "Ryan495"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "this is by far the worst movie of 2012, oh wait i apologize, i wouldn't actually call it a movie,",
      "total_reactions": 2,
      "user": "ExKing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "It is just a group of teenage boys having nose periods all the bloody time. Not even funny or enjoyable.. I don't even need to go into detail, characters are bad, plot is bad, though i do like action movies, this is just horrible. I still can't believe that i sat through this whole movie.",
      "total_reactions": 1,
      "user": "yennachan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "This is a tough call. While the premise is interesting, and the story quite entertaining, something's just missing with \"Chronicle.\" It plays around with the whole superhero/villain theme, which is rather refreshing. It seems that in most sci-fi stories that involve sudden gains of power, the protagonist is always somehow good. \"Chronicle\" plays rather well with this notion, which is a new spin to the story  it's the Magneto of regular superhero films. Otherwise, the biggest setback of the film is it's rather poor character development. While we are made to feel sorry for the main protagonist, Andrew, the ways that we are made to feel that way are rather clichéd: no friends, bullied at school, abusive father, etc. His rage and his inner turmoil somehow is multiplied to the verge of bursting, without it quite making a lot of sense. The three main actors were pretty decent, especially Alex Russell who was the most engaging and believable of characters. The hand-held camera, and the very choice to do a camera perspective for the entire film, is a rather divisive choice as I have come to see in reviews, but I did not mind it all that much. The escalation of the story by the end somehow happened out of nowhere and escalated quite dramatically. A bit too much for my taste, with a rather anticlimactic ending. It was a nicely conceived idea and some great visuals can be seen in the film, but this falls into the mediocre bracket easily. 5/10",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Not being a fan of the \"found-footage\" genre, I was hesitant to see this film.  I'm glad I finally decided to watch it, though, because Chronicle, as it turns out, is so much more than just another shaky-cam flick with cheap thrills.  At it's core, Chronicle is a look into the isolation and loneliness felt by an awkward social outcast, and what happens when that outcast finally gains the power to turn the tables on his aggressors.  That power comes in the form of some very Akira-esque telekinetic abilities, which makes for some extremely kick-ass action later in the movie; action which looks even more impressive given the film's found-footage nature.  So what you end up with is something along the lines of Carrie meets Akira meets Cloverfield... a combination which may not sound very original, but, I promise, you've never seen it done this well.",
      "total_reactions": 0,
      "user": "emcoffey3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "A funny, and enjoyable movie. I like the creativity that has gone into this film.",
      "total_reactions": 0,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Chronicle mostly tells a unique superhero story using the powers to explore the dynamics between teenagers. Dane DeHaan nicely captures an emotionally unstable teenager and his friends work well off each other. The found footage doesn’t feel like a gimmick often serving as an extension of Andrew’s character. The film becomes a tad generic in the last third when the showdown between good and evil results in generic dialogue and a climax that Man of Steel would duplicate on steroids a year later. Nonetheless, even with a somewhat generic third act Chronicle is one of the more interesting takes on the superhero story with the realistic tone and the characters who get said powers.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "The majority of the action is seen from the point of view of the Andrew character and I found this quite limiting. Yes, there are sections where his cousin Matt takes over and Matt’s girlfriend Casey Letter (Ashley Hinshaw) also has some camera time, but I found it all a little one-dimensional. As far as performances go, well everyone did a pretty good job with Alex Russell just about standing out for me. Although I found the contrivances used to get this ‘found footage’ style film up on the screen a big distraction it did have a one good thing in its favour. I did like the special effects when things are kept up close and personal. As soon as it became much bigger as in the big fight scene at the end; I’m afraid it all got a little too ‘Transformers’ for me. Over all, I found little likeable about any of the characters; particularly Andrew (although he does have a fine name); and this was enough to put me off. After all, if you can’t identify with the characters then the filmmakers have lost half the battle. I was hoping for some great redemption towards the end but it never came.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "The first 45 minutes of the movie is about these three dorks learning their new powers, the first 45 minutes is boring and slow. The rest of the movie is a little bit better",
      "total_reactions": 0,
      "user": "phillyjeff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Chronicle is a good movie but not quite a great one. The handheld 'Cloverfield' style camera style works well for the most part, but it's sometimes replaced by standard camera shots... Which is confusing and doesn't make sense. The acting is solid and the effects are surprisingly well done. The climax is bound to impress. My one great complaint is that the hero of the movie has too little screen-time and seems like a one dimensional wooden plank, especially when compared to the villain. When all is said and done, Chronicle is definitely worth seeing if you're a superhero fan.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Shot using ‘Blair Witch’ style found footage Chronicle documents what happens when three friends find themselves endowed with telekinetic abilities. Being teenagers however they don’t all handle their new power so well and cracks soon began to appear in their friendship.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Chrinicle is a fun movie that feels novel and authentic. The films gimmick at first feels out of place but it does eventually feel like a good choice to dive into the life of these teenagers. However chronicle had it's faults. Alot of the dialogue near the end of the film was very cheesy and poorly acted. I also found the film's story to be cliched.  I found some of the cuts to be terribly executed and distracting in the film. Because of this many scenes felt oddly broken when they should have been one long take with no cut. Overall I found chronicle to be a fun but cliched novel and authentic idea, if that makes sense.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "The movie manages to take an interesting idea, and make it unbearably boring. The last fifteen minutes of the film are entertaining, but the hour leading up to it is excruciatingly poorly paced and written. The run time of the movie is just under an hour and a half, but it feels more like three. Who knew it was possible to take a great idea like â",
      "total_reactions": 0,
      "user": "Daniel_Campbell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Chronicle is a great movie showcased in 85 minutes, It may not have the best effects and a lot of people will find similarites to the anime film akira but chronicle is still one of the best movies of 2012 and hope to see more out of this director.",
      "total_reactions": 0,
      "user": "Rice303"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Chronicle is plenty of fun with great visual effects and performances, however I found myself disliking the character of Matt. We as the audience are supposed to care about this character but to me he came off as profoundly annoying and insufferable. But besides that one character, it's an enjoyable film.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Josh Trank wins his debut direction, this film is intriguing and innovative. One of the best films of 2012 so far and a new great style of superhero movie.",
      "total_reactions": 0,
      "user": "rydermusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Super hero genre mixed with found footage? After almost a decade topping the box office, the super hero genre was in danger of being stale.  While this year we have two huge movies of the genre, Chronicle came from out of nowhere, receiving a lot of critical acclaim. While it is 'fresh' in its approach, it is far from 'original' as Critics would like you to believe.  It follows the typical 'origin' story, how superheroes were made and how they are usually 'best friends' with the super villains, etc.  So watch this with lower expectations and you'll enjoy this more.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "*SIGH* Another 'found footage' film.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This movie breathes life into the found footage genre.  The three teens who get super powers brings a dark twist to superhero genre. (Although it technically shouldn't be called superhero film.)  This film has me guessing the whole way.  I thought this film was entirely original and I am excited that they are making a sequel.  If you haven't seen this yet, I extremely recommend it.",
      "total_reactions": 0,
      "user": "horacep3000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "A decent movie with good pacing and character development (despite what other critics say), the only real issue is the unnatural use of camera footage. It's unlikely that a woman free falling in mid-air is going to hold a camera at the same time to record all of the action. It's also unlikely that this same woman is going to answer her door with a camera in hand, or use it at every given opportunity. I feel that it could have worked even without the Cloverfield-style camera. With that being said, the acting, story and build up was all perfect.",
      "total_reactions": 0,
      "user": "mako_psy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Using just a video camera, High School outcast, Andrew, documents the events surrounding a recent discovery. In the woods, he and his friends discovered something unexplainable, something that gives them supernatural powers. What I loved about this film, is unlike, many many others, these kids didn't take these powers and become superheroes, instead they did what any real life teenager would do and use them for pranks, popularity, and various other things. Also unlike similar \"camcorder\" films, it wasn't jumpy or choppy and it was quite easy to follow. The first hour of this film was amazing, unfortunately it did go downhill at the end. The whole film was done in a realistic fashion, making science fiction seem possible, until the end, when all hell breaks loose and it honestly just destroyed the whole thing for me. It was such a strong start, but such an awful ending. Most of the cast were newcomers and were very good, the story was also very solid, but this film needs a much better ending if it wants to be considered a classic.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "A film in a film - a movie told through camera. Not the first time, and it seems to have become a bit of a trend, but this one makes a decent job of it. Only near the end the movie seems to lose its grasp a little, finding it hard to follow the original idea (it seem a bit forced).",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Can someone say Columbine! The director/writers understand how to capture real life teen psychology.  You witness the transformation of an abused teen who takes it out on the world. Don't abuse your power!",
      "total_reactions": 0,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Chronicle: The best movie I've seen so far this year. Well directed, well cast, with a great plot and extremely entertaining.",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A few issues with the special effects (it was painfully obvious that the whole \"flying\" attempt was done on wires) and the acting isn't that good but it was still a very enjoyable movie that is definently worth watching.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Chronicle is a fresh and original movie; in other words, we need more movies like it. Although it isn't too lengthy (around 80 minutes), Chronicle is an enjoyable and unforgettable film.",
      "total_reactions": 0,
      "user": "PrimalHunter70"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "An entertaining film with good action and a bit of drama. Chronicle provides a twist on typical superpower films, where the powers are used to stop a villain. The cast and their performances are the icing on the cake to an original plot.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Although the film style seems unnecessary, Chronicle's plot unravels quite well, giving its audience a perspective that normal people can relate to, as well as developing its protagonists and antagonists without coming off as predictable.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "The plot, humour and character development were great. I am a sucker for sci-fi etc but even my hater friends enjoyed. The ending was the only let down, quite hollow in my opinion.",
      "total_reactions": 0,
      "user": "stoppy4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Super cool, fun movie. I found the writing and acting to be particularly impressive considering the genre. Most notably, one character's relationship with an abusive parent is portrayed with tenderness and realism. The comedic moments are legitimately funny and the action sequences are quite thrilling. Strong recommend!",
      "total_reactions": 0,
      "user": "dullurd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Highly original, engrossing film that always has your full attention. Intense and ultimately tragic, the film smartly grapples with some important themes and succeeds largely on a foundation of realism, fine performances and a smart script. What is initially exciting soon becomes destructive as one of the three teenagers the audience is introduced to uses his new-found abilities as a means to vent his frustration at the world, refining them with practice as to assert his authority over those who have taunted him throughout his life. Fine performances from the young, not-so-eminent cast. A flourish in the careers of all involved are imminent. 7.8.",
      "total_reactions": 0,
      "user": "JacobDunstan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "A rare movie. It explored the developments of the characters from before they possessed their powers to the very end. It creates a great deal of conflict in the viewer in terms of who they should feel sympathy for and which characters they should hate. Thoroughly enjoyed the way the film was written, how it was put together, the characters, and the overall storyline. It didn't really follow any particular formula but everything in it flowed",
      "total_reactions": 0,
      "user": "sammiec001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "A really interesting film, I love chronicle, is like a sci-fi glee, but without the songs and all this things, Chronicle is really sorpresive, interesting, and awesome, like a next Jumper and I am number four.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Normal I hate the found footage camera angle but Chronicle uses it very well. The 3 guys touch an alien thing in the ground and get telekinesis which they later figure out how to use to fly, and they go round doing all they awesome stuff everyone has fantasized about doing if they had powers. Its good how the powers affect the characters in different ways but saying any more would spoil the story. Some of the effects are really bad but this movie is not meant to be taken seriously enough for it to matter, its just fun.",
      "total_reactions": 0,
      "user": "SwarleyStinson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Chronicle is an almost immaculate film that I, at first, had been wary of. I walked in the theater expecting another cheap \"found footage\" film. Instead, I found Chronicle had taken the \"found footage\" style and revamped it to suit the movie. It had a strong reason for the camera to be filming the whole movie (the personality of the protagonist) and it wasn't always an annoying first person view. Since the characters have special powers, the protagonist actually uses these powers to move the camera to show a third person view. Even in scenes where the camera is not present, the director used other cameras such as security tapes to show what was going on. The \"found footage\" style in this movie has been done very well with an original twist. The characters in the movie are also very well rounded. It is easy to say who they are without describing their physical appearance or role in the movie. The film also makes it clear that it is telling a story and it is not a generic good vs. evil film. It is about the consequences of a few teenagers developing special powers and there is no straight out villain. I found I was constantly switching which characters I was rooting for because of the twists and turns that the movie has. The special effects were fantastic, the story was an original spin on the whole \"with great power comes great responsibility\" theme, and the acting was great. There were only about one or two scenes that had wooden acting, but other than that, each actor was amazing at portraying his or her character. The film also has many side stories and each one of these side plots is interesting and compelling. The second half of the film is very dark and emotional and the main side plot intermingles with the overall main plot, creating an extremely engrossing story. The cinematography in the movie is astonishing, as well. The camerawork shows scenes in a very dramatic or entertaining way, depending on the mood of the scene. The one thing I have to say I didn't like about the film is the climax which I feel was unnecessary. Normally a good vs. evil movie will have a final battle- and this was not a good guy vs. bad guy film. It sort of took away from the feel of the rest of the movie, as it was not needed. It dragged on and was slightly boring until the final part of the climax. There were also one or two parts in the climax that seemed corny, and I think that it should have been taken out entirely and the end results could have come about in a different way. The one thing I like about the climax (besides the end of it) was how it started and I'm not going to say how it started so as to avoid revealing any spoilers. Overall, the film was original and amazing. It was a breath of fresh air from all of the remakes, prequels, and sequels going on right now and I'm definitely going to buy it on Blu-Ray. I'd recommend this film to ages fourteen and up, as it is very graphic and just as dark as The Dark Knight (No pun intended). I'd even recommend this movie to people who don't like the \"found footage\" style, which is I style that I absolutely despise. However, Chronicle pulled the \"found footage\" style off so well that I don't think any other movie can beat it in the years to come. The reason I give Chronicle an \"8\" is because I think the climax took too much away from this fantastic film.",
      "total_reactions": 0,
      "user": "Midge115"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Una pelÃ­cula realmente interesante, que cumple su objetivo, muy recomendada, para los amantes de los efectos especiales. un inicio algo fuera de lo comÃºn con un final inesperado que los dejara con ganas de mas.",
      "total_reactions": 0,
      "user": "fonsof"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Starts very slow and tbh I think it had all been done before. Use of cloverfield \"my video\" works really well for once and it probably is worth a watch on DVD but for me this had way too much hype.",
      "total_reactions": 0,
      "user": "MattJenki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was a very enjoyable experience for me. What really made it great was the fact that they can really show the intensity of having super powers, which brings out a huge range of emotions. The actors were really phenomenal and the action and humor was great as well. The actors kept the movie going for sure it was a good $15 to spend for sure.",
      "total_reactions": 0,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The plot line of this movie is quite interesting as it portrays what \"normal\" people might go through if they were to be gifted with super powers. The ending wasn't the best and the bounciness of the camera might make some people sea-sick other than that great movie!",
      "total_reactions": 0,
      "user": "jchamb2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "This movie was by no means a bad movie, but it was no where close to being a good one either. It has an amazing and insightful, yet realistic idea towards it's plot. However, it's good story was trashed by the mediocre acting, the odd camera angles (which is creative but just does not really flow well), and it's cliche script. This movie would work much better if the script was more thought out and the camera shooting was more sharp and smart. It was by no means a waste of money, however I would not watch this movie twice.",
      "total_reactions": 0,
      "user": "FrostAiden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "So far one of my favorite movies of 2012. The story helps gain a connection with the characters and the action gives you a solid blockbuster experience. No negative comments but it takes a while for the tension to build up, as with every movie",
      "total_reactions": 0,
      "user": "lilbradshaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "This is one of the best movies I've seen this year.  It is an original and exciting take on what would happen if some kids came across super powers.  I hope there is a sequel because I would definitely see it.  Check it out.",
      "total_reactions": 0,
      "user": "Sgaldo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "On the whole I was quite impressed.  Usually I find it difficult to tolerate the dark brooding moody teenager archtype, but the development of this particular character was quite well done.  The actual pacing of the film was good and kept interest while giving the detail it had to, though perhaps the main characters descent was a bit too quick.  The special effects were impressive, though I suspect the style of camera work helps to sidestep most major problems.  Overall I felt it was very artistic, the camera work, the type of scenes, the development and demonstration of their powers all meshed together in terms of style and complimented each other very well.  Its a very difficult task to make a movie of this genre, with these types of characters and using the camera work they did, and the fact of the matter is that if any of those elements were lacking the entire film would have collapsed.  But in Chronicle, it, frankly, all just worked, perhaps a bit heavy handed in the moody teen, but they certainly achieved the look they were going for.  Further the final battle was just beautiful, its climax especially was just fantastic.",
      "total_reactions": 0,
      "user": "Lutharo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "My viewing experience of Chronicle was incredibly mixed. In equal measures I enjoyed some parts and got bored of others. I loved the boys will be boys element of the groups discovery, using the powers for fun and stupidly testing the limits of their growing abilities. It seems exactly the sort of behaviour you would expect from teenage boys. As you would also expect, it isn't too long before someone goes too far when showing off and that person is Andrew (Dane DeHaan).",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Es una nueva forma de ver a un superheroe. La pelicula fue bastante buena, a pesar de su bajo presupuesto. Lo mejor que se puede señalar de la pelicula fue la manera como fue explicada la vida del personaje principal y cual fue la causa y motivo de sus acciones y caracter. El director si logro mejorar el escesivo movimiento de la camara y es mucho mas facil de ver que otros filmes de su genero.",
      "total_reactions": 0,
      "user": "ObbiePR18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Decent film. New unknown cast which was nice. good story and it was funny and light hearted before becoming serious. A bit too serious. That;s my down mark. it got a bit 'too' intense for me at the end.",
      "total_reactions": 0,
      "user": "orchid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Some poor CGI and acting but a great story and awesome found footage techniques. A group of young teens that face personal problems getting dumped with superpowers is never a good combination. Who will appreciate the power and who will turn?",
      "total_reactions": 0,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I liked this movie, because it is about superheroes and it doesn't include any capes or tight latex pants and  it also has a darker side than your average/normal \"super\" film. Add to these, a pretty authentic scenario and nice story-telling, and you've got a decent and enjoyable film.",
      "total_reactions": 0,
      "user": "AthanasiosT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was incredible! I honestly didn't think I'd like it, but it was completely enthralling and unexpected from beginning to end! I would definitely see it again.",
      "total_reactions": 0,
      "user": "johannahbrockie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "For his first feature, film Josh Trank impressed the hell out of me. The storyline from this site adequately covers the plot without spoiling too much and if you watch the trailer/preview, you will want to see; I can tell you now that trailer is not misleading. The fact that the cast does not include well known names did not stop the movie from making a mark, and the numbers back that up. If you can get passed the hand held camera work that was compulsory but thankfully not throughout, given one main character is chronicling, video journal style, a period in his life, you will discover a good movie. It has a take on characters with super powers that youâ",
      "total_reactions": 0,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Entertaining,Impressive and Engaging.It's better than what i expected.Very good use of camera and C.G.I effects Action-Fantasy and drama about a Teenager. This is one the best found footage movies ever. You can easily connect to the characters from the beginning because there are normal teenagers,it worked for me cuz i'm a teenager too.Performances from the younger cast and fast pacing direction overshadow many flaws. It's a new achievement in the piece of art and handheld cinema.I liked this movie so much. I hope,they'd make a sequel :)",
      "total_reactions": 0,
      "user": "moviebuff_420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "It's very innovative in scope, and the shaky camera deal works in its favor. An interesting look into social issues for the high-school aged. Worth a watch, and could use a sequel.",
      "total_reactions": 0,
      "user": "ndjn3979"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "There's some interesting things going on in this movie - ----SPOILERS AHEAD----",
      "total_reactions": 0,
      "user": "BrianKoontz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Chronicle is quite an interesting movie to say the least. Sure there a lots of movies out there where people obtain superhero powers but the one thing Chronicle has going for it (apart from a well written script) is the use of the found footage style of filming. The movie is show through the camera lens of a Matt. When he's invited by his cousin Andrew to a party to help him meet people, Matt along with Andrew and friend Steve discover  a cave where they find a large, glowing object. Perhaps due to the over exposition of radiation they begin to experience pain and nosebleeds, eventually collapsing on the floor. The next day they discover that they have telekinetic powers.",
      "total_reactions": 0,
      "user": "gam3r116"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "This film makes you wish you had the superpowers. Much appreciation for the found-footage format, visual effects and in addition the lessons you get to learn about self-control and the desire to be superior.",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Chronicle has to be, by far, the best found footage film I have ever seen. What is most amazing about it is how thoroughly Josh Trank is able to envelop us into this world even though it is his first feature. To mention another successful debut, Dane DeHaan delivers the best performance of the three young leads, who all do stellar work regardless, as the troubled Andrew. The actors all bring out their characters, each resembling the man we would like to be (Steve), the man we don't want to become (Andrew), and who we actually more closely resemble (Matt), a motif that plays out well in other films such as No Country For Old Men and Mystic River for example. And on the technical side, Chronicle also succeeds, with good visuals and very smart use of the found-footage style on a reported budget of only about $15 million. A sleeper hit well worth checking out.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "A realistic, powerful and well-acted film that captures the quintessence of ordinary people becoming extraordinary, whilst exposing the journey of sacrifice, loss and the descent to evil.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "A really unique and compelling superhero flick. Really adds a lot to the found footage genre. Also one of the most realistic superhero movies ever made, as it feels like this would be what would happen if teenagers got super powers. My only problem with the film is that it seems like director Josh Trank has trouble maintaining the found footage filming through some scenes, but ultimately I think that he pulls it off.",
      "total_reactions": 0,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Chronicle is an amazing, well-acted, emotionally affecting experience. Andrew is a great villain, mostly because you never really hate him; he's a scared kid who has to deal with an abusive father, deathly ill mother, and the unfeeling bullies of his school and neighborhood. When he uses his newfound powers to win the talent show, everyone loves him. The silent dork is now the most popular guy in town, everyone throws him a big celebration, and then it is all yanked away from him. That is like winning 500 grand in a lottery, only to have the money stolen before you can spend a cent. He starts to snap, dismembering an insect, ripping a bully's teeth out, crushing a car, and electrocuting his friend to death in a fit of rage. When he robs the gas station, it is a very conflicting scene, because he needs the money to save his mother, but there is a feeling of \"this is wrong, this is so wrong\" throughout the scene. The epic fight between Matt and Andrew is very well done, delivering cinematic shots via news feeds, security cameras, and cell phones as they are forced to pummel each other. The death at the end is a genuine tear-jerker, mostly because it looks so real. If this had been a \"normal\" movie, the death would have been in slow-motion and sweeping camera angles, but all of that is absent as Matt is forced to throw a statue's spear through Andrew's body, which hangs limp as the viewer sits stunned. It is truly an amazing film, and I hope to see a possible sequel.",
      "total_reactions": 0,
      "user": "Sben69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Wow.Wow.Wow.Wow.Wow.Wow. What a piece of...I don't even know what to say, it's simply incredible. I expected it to be a PA-styled superhero movie, but no! It is even way more and even way better than what I expected it to be. Extraordinary!",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "Chronicle is certainly an interesting film. With good acting from Dane DeHaan, Alex Russell, and Michael B. Jordan, Chronicle certainly delivers in that arena. It is also very well directed and makes good use of its found footage approach, which is actually used quite uniquely with many different cameras and people behind the camera being utilized, which allowed us to get a variety of perspectives. The first hour of this film is very good and incredibly engaging as this group of friends begins to learn what they can and cannot do with their newly discovered superpowers. However, that last half hour was horrendous and nearly ruined the entire film. Everything really hits the fan here and the film veers violently off-course, which is really too bad as it was really good beforehand. The film, instead of being a fun superhero kind of film, instead becomes a journey into the mind of the mind of a truly broken kid. This really hurt the overall tone of the film and disappointed me since it was just poorly handled and over-the-top. Overall, Chronicle when from being good to being nothing more than slightly above average.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "The movies uses the found footage aspect to its advantage, doing things that cant be done in a regular movie. Putting you in the first person point of view.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "A brilliant will made movie with a lot of heart and soul shoved into the project. The characters are likable and easy to relate 2. The film really does a great job and i very much recommend watching the film",
      "total_reactions": 0,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Dark, disturbing, taut, and more emotional than you would expect, \"Chronicle\" is an intense, well-written film that features non-stop action and leaves you thinking well after the credits have rolled.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "A great movie considering the budget must have been low. After the three main characters discover a tomb underground with a strange light, they awake with what seem supernatural powers. This movie is filmed from the perspective of a video camera, much like Cloverfield and the like. This movie was a great watch, has great action, OK dialogue and believable characters. A must for all comic book hero/supernatural lovers.",
      "total_reactions": 0,
      "user": "Samblix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "This was pretty good. I loved how they made it feel real. It`s like your really watching a documentary, about some kids who got powers. It gets pretty crazy once they get the powers but slowly. This movie has moments that will make you laugh, and moments that will have you in awe.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Inarguably one of the finest \"found footage\" movies in cinematic history, \"Chronicle\" solidly impresses without deadening brain activity.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "\"Chronicle\" is a genuine surprise - a film with a truly believable story that is 'chronicled' through the most convincing and least distracting hand-held camera style I've yet seen. The strength of the movie comes from the characters - these aren't the teens you see in many other movies. These kids act the way real kids do, and play with their powers the way real kids would. You don't question what they do, because it works completely with their characters, and through both the light and dark turns of the film, they consistently remain realistic teenagers. The story of how they acquire their powers is ingeniously left an open question, and how the final character's life will play out is also left open. You wonder how things go from here, and if indeed he'll ever find out what it was that gave them their telekinetic abilities. What sets this style of camera work above its peers is how it doesn't limit itself to one camera - it moves between all sorts of cameras, capturing the action from many angles, and especially in the last act this lends the film a unique and exciting pace and adrenaline. As far as what I call the \"underground superhero\" movies (films about superpowered people other than Marvel or DC characters), this is the best I've seen, and certainly worth checking out.",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "My first film of 2012 and I absolutely loved it! My only complaint is that I wish it could have been longer, but it certainly packs a powerful for a film that runs just short of 90 minutes.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A decent enough movie that plays with a really good idea. The\"self-filming\" concept was rather a brilliant one considering the subject that perhaps was a bit too ambitious. Even with powers and the best equipment available, the camerawork is just to good to be believable. But this is really a minor point. The narrative is just first class and the character utterly believable. This is precisely how teenagers would react when getting super powers. Overall: An absolutely brilliant film that suffers from being too good for itself (too many convenient camera shots, that are just to convenient to be believable.)",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2016
      },
      "score": 1,
      "text": "A terrible movie that's confused about itself. *******************************************************************************************************************************************************************************************************************************",
      "total_reactions": 0,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This movie was very unpredictable and even creepy at moments. The thing that I liked the most about it is that it's not formulaic or unoriginal like many modern horror/drama/thrillers these days. The story went so well with character development and how it built up and got more and more intense as it progressed. The ending makes you wonder............................. Sequel?",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Chronicle always was the closest to a live action Akira, but I won't compare this to that movie because this more like a superhero movie than it is that other film. Anyways this is a pretty entertaining movie with some level of depth to it than most other ones have. Of course like most action sci-fi movies there're some; if not many, problems. The positives include the story. The idea is pretty creative, and is done well. This idea is not that popular in cinema, but more in main steam media and anime of course. The characters are pretty hit and miss, the main one with the camera is the most interesting. Showing the effects of great powers have on such introverted person. His cousin however is really not that interesting, he's mainly just there to be the good side and be there to fight the camera guy in the end. The black; sorry I can't remember any of there names, is okay. He's just sort of there for comedy relief, and it's kind of shocking to see him die. Everyone else is really unimportant, the abusive father is done poorly and is not well developed. I can't even think of the other characters, that's not god sign. The idea of a camera being the point of view isn't all that new, but it's done okay here. The effects are neat or just interesting, from practical jokes to destroying the streets. Finally the reason how they got their powers makes no sense at all, it has that:\" we'll tell you next time\"; which I don't actually know if they're going make another one. The ending is somewhat weak, the part that the cousin had to kill the camera man is pretty good, but anything after that is not really impressive. He brings a camera to the place the always wanted to go; Himalayas, and leaves the camera there. I thought it was going to move or something. Well whatever, this was a fun movie.",
      "total_reactions": 0,
      "user": "Skullgirlsfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Chronicle, the newest addition to the found footage genre. I did like the movie, it had an interesting premise and believable characters. Not only was it enjoyable but it had somwhat heart  I did feel for every character on screen, and thats a hard thing to do in found footage movies. I did have some problems with the movies, such as the special effects, it was legit but at points it looked fake. But I still like the movie. Agian, if you dont like found footage films, dont watch this film.",
      "total_reactions": 0,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "I liked the originality of a film and the story was great. It is not a must-watch but the film in overall is a nice thing to do if you want to spend time with friends.  The ending was bad and that is one thing i didn't like from Chronicle",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "by far one of the best \"found footage\" films although they accomplish this via the camera being held by the characters telekinetic powers. really blurs the lines between protagonist and antagonist as you feel more and more sympathy for Andrew and the epic clash he has with his Cousin.",
      "total_reactions": 0,
      "user": "JBryant0619"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Summary",
      "total_reactions": 0,
      "user": "kev_i_n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "A fresh and exciting take at both the found footage and superhero origin stories. Chronicle is bolstered by strong performances, impressive special effects, and a profound story about life decisions and there sometimes cruel consequences.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Chronicle why do you make me do this?  I love psychic powers and the idea of regular people just messing around with it and encountering some type of threat would have worked beautifully.  I would have given it a 10.  But why did you have to be a handcam movie?  It makes no sense and by having one of the main characters bullied, is sad, until you realize it is because he carries a giant old camera to school to tape everything.  I'd want to punch him myself and I can't relate to how much of a weirdo he is.  I wanted to love this, but the choices of all the characters towards the end I couldn't back up and I was rooting for the wrong people.  Some scenes were great, but for the most part even with my bonus points it was just blah.",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "My favorite character in this film was the camera. Even though I normally dislike \"found footage\" style movies, the way they personified the camera was very unique and interesting. Shots become more meaningful and carry more depth when you realize how the camera is it's own person while being an extension of Andrew. I have never seen a movie where you see a camera's footage and then the camera itself from a third-person perspective. Obviously, the film style of character documentation comes with the cliche, \"Did you get that?\" and other such phrases, but I was pleasantly surprised at how much it added to the story. Even though it might be difficult, I would love to see more movies include the camera as a character.",
      "total_reactions": 0,
      "user": "sigmastorm7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "I was never into superhero movies before I watched Chronicle, but after this I had to watch every one I could get my hands on. It's just a fantastically well crafted movie, even more so because it doesn't act all idealistic about the characters. They're real teenagers who do stupid  for fun with their newfound powers, but it also violently shows how corrupted someone can be when given power, especially when they had less than none before. The three characters are superbly fleshed out and are all brilliant actors, the effects are also perfect, meeting the exact space between fake-looking and obvious-CGI. It's a convincing story that makes you give a  about the characters, and as a result you feel good when you watch them mess around with their powers. The flying scene is a good example, I was practically grinning watching it as the first-person view lets you experience it as the characters do. The final battle is also brilliant, and the perfect way for it to end. The last twenty seconds or so are a little odd but I can forgive the film for that. The film overall is thought provoking and an excellent study of what happens when irresponsible people are given the power of gods.",
      "total_reactions": 0,
      "user": "StarEater"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "In a vast landscape of cheesy, over-the-top superhero movies that lack a true heart and soul, Chronicle is a story packed with philosophical and emotional punch with amazing acting and a first-person \"camera\" perspective that fits the movie perfectly. The characters and their situations are so realistic and so easy to relate to, that it is hard not to sympathize even with the antagonist. My only complaint might be the long time it takes for the real theme of the movie to be easily seen, but since the movie is only 90 minutes anyway, the action in the meantime makes this complain a minor detail that can easily get lost in the otherwise brilliant movie.",
      "total_reactions": 0,
      "user": "XavierBlaq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "I consider this movie a rare gem, though I wasn't a fan of the shaky cam work. The acting from the young cast especially Dane Dehaan was fantastic and the story was very raw and very realistic at the same time. What if you as a human were given that kind of power? what choices would you make? The movie captures especially in Andrew's situation ones difficulty to keep that kind of power in check and end up using it for your own personal gain. I can't really say enough about this movie, I just really couldn't stand the shaky cam.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Watched Chronicle. A different superhero film. The production values were very disappointing and the camera work was very ordinary, shaky. Could have done in a conventional manner without experimenting with video styled camera takes. The film for its emotional connect towards Andrew's plight  and performance of the cast. Otherwise there is too many amateurish moments for the ordinary viewer to ignore easily. A solid 6 out of 10 and nothing to more. A good watch if you want to just waste your time.",
      "total_reactions": 0,
      "user": "movielove111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Highly entertaining and well acted, \"Chronicle\" succeeds with its found-footage storytelling and superpowered teens. Really recommend it to check it out.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Despite using the found footage technique that has been recycled over and over now Chronicle has managed to expand the super hero film genre. It is also a transformation film an does not follow the clichés that super hero films have been unable to avoid lately. This film does not beat around in the bush. It is quick and to the point. Unlike most found footage films Chronicle has a great cast with young actors that have some real potential. Josh Trank was so innovative with this film and it makes me interested to see what he will do in the Fantastic Four reboot.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "This movie makes me excited for Josh Trank`s future projects because his work is unique and surprisingly redeemable. Dane DeHaan delivered a stellar performance, which was much needed because of the distractingly poor CGI. I was not bothered by the \"found footage\" aspect at all, and believed that it helped me learn more about Andrew`s character as I could see the world from his perspective. Apart from a rushed conclusion, Chronicle was a nice surprise that is definitely worth checking out, especially if you are a fan of sci-fi and superhero movies.",
      "total_reactions": 0,
      "user": "lordmoo_23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "In recent years, I have become jaded about superhero movies, a genre I once enjoyed. A sameness and lack of energy permeates them, especially the origin stories. There's something perfunctory and unsatisfying about many of the big titles, leaving it to smaller, less ambitious features to fill the breach. Chronicle is relatively unheralded, but it arrives at a time when this breed of movie needs an injection of originality. Like 2010's Kick-Ass, it exists beneath the superhero umbrella but seems nothing like a Batman, Spider-Man, Superman, or X-Men.",
      "total_reactions": 0,
      "user": "CinemaSins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "I have to say that I wasn't expecting this at all. It's obviously because we've had so many Marvel superhero films the last ten years, but I was a little afraid this film would be dry, meaningless, and unable to differentiate itself from other superhero films. Fortunately, it isn't any of those things. In fact, this is barely a superhero film, and is really about the relationships between people. It's about the awkwardness of high school, the process of trying to gain acceptance before you accept or know yourself. It's about human will, as Matt explains early in the film, and that we all wish we could be greater than the sum of our parts. Sometimes we wish we could explode through a situation, instead of having to trudge through the mire and stink of unfriendly faces and dreadful expectations. The three friends are all unique characters. The auxiliary characters surrounding Andrew Detmer are all perfectly designed foils made to give Detmer a reason to break the laws of physics. Kudos to Max Landis for an outstanding screenplay. This film certainly relies on it, but is watchable because of its thoughtfulness and authenticity. If superhero films could be less like pornography and more like Death of a Salesman, they'd be worth watching over and over again. Chronicle provides a unique and heartfelt concept, enhanced and augmented by vibrant visuals and riveting action sequences, in an industry where authenticity is hard to find.",
      "total_reactions": 0,
      "user": "bds92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2016
      },
      "score": 5,
      "text": "I didn't get this movie.  Three teenagers (maybe that's the problem) get super powers and can't handle it.  Well heck, they're teenagers.  With that as the story line, there just wasn't anywhere to go.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Chronicle is a sometimes fun, slightly dark film about a boy and his camera.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "In recent years, I have become jaded about superhero movies, a genre I once enjoyed. A sameness and lack of energy permeates them, especially the origin stories. There's something perfunctory and unsatisfying about many of the big titles, leaving it to smaller, less ambitious features to fill the breach. Chronicle is relatively unheralded, but it arrives at a time when this breed of movie needs an injection of originality. Like 2010's Kick-Ass, it exists beneath the superhero umbrella but seems nothing like a Batman, Spider-Man, Superman, or X-Men.",
      "total_reactions": 0,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "Tras el inminente estreno del reboot de Los 4 Fantásticos, tocaba hacer un pequeño repaso a la filmografia del director Josh Trank, con su opera prima, que curiosamente es de superheroes. La trama nos situa en Seattle, 3 chavales se encuentran una especie de piedra, que al tocarla o por la radiación (nunca se sabe), adquieren poderes telequinéticos, ya está, esa es la premisa del film, una propuesta sencillita y directa. Que para que llamase la atención, el director pretende venderla como un \"Found-footage\" rollo la bruja de Blair...pero falla estrepitosamente.",
      "total_reactions": 0,
      "user": "AngusBarbudez"
    }
  ],
  "metascore": 69,
  "name": "Chronicle",
  "num_weekends": 17,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 3,
    "month": 2,
    "year": 2012
  },
  "opening_weekend_income": 22004098,
  "opening_weekend_income_currency": "$",
  "rating": 7.1,
  "rating_count": 210609,
  "rating_freq": {
    "1": 3411,
    "10": 15277,
    "2": 2099,
    "3": 3250,
    "4": 5859,
    "5": 13177,
    "6": 32477,
    "7": 63351,
    "8": 51891,
    "9": 19817
  },
  "release_day": 3,
  "release_month": "February",
  "release_year": 2012,
  "user_review_count": 475,
  "votes_per_demo": {
    "aged_18-29": 86162,
    "aged_30-44": 78142,
    "aged_45+": 13882,
    "aged_under_18": 620,
    "females": 24768,
    "females_aged_18-29": 13448,
    "females_aged_30-44": 8328,
    "females_aged_45+": 1637,
    "females_under_18": 113,
    "imdb_staff": 16,
    "imdb_users": 210609,
    "males": 159409,
    "males_aged_18-29": 71782,
    "males_aged_30-44": 68756,
    "males_aged_45+": 11972,
    "males_under_18": 504,
    "non-us_users": 108887,
    "top_1000_voters": 577,
    "us_users": 35889
  },
  "year": 2012
}