{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.3,
    "aged_45+": 6.1,
    "aged_under_18": 6.6,
    "females": 6.8,
    "females_aged_18-29": 6.9,
    "females_aged_30-44": 6.6,
    "females_aged_45+": 6.5,
    "females_under_18": 7.1,
    "imdb_staff": 6.8,
    "imdb_users": 6.5,
    "males": 6.4,
    "males_aged_18-29": 6.5,
    "males_aged_30-44": 6.2,
    "males_aged_45+": 6.1,
    "males_under_18": 6.5,
    "non-us_users": 6.4,
    "top_1000_voters": 5.6,
    "us_users": 6.5
  },
  "avg_screens": 1788.3529411764705,
  "budget": 78000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 3,
    "year": 2014
  },
  "critic_review_count": 173,
  "duration": 95,
  "genres": [
    "animation",
    "adventure",
    "comedy"
  ],
  "gross_income": 119793567,
  "max_screens": 4001,
  "mc_avg_user_score": 7.0,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 48,
  "mc_movie_name": "Cloudy with a Chance of Meatballs 2",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 77,
  "mc_pro_critic_reviews": [
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "Loveable - especially if you're as fond of a pun as we are - and extremely silly."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "It is the inventive design of the many creatures that feels so fresh. The detail is so rich, and so dense, that you wish some of the frames would freeze so you had more time for savoring."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Cloudy 2 is loud, weird and chaotic — just as kids like it."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Picks up where the first film left off, literally, and offers at least as many laughs (if not more for adults), retaining the goofy attitude. Cameron and Pearn throw a lot at the wall, just like their predecessors, and most of it sticks."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "The Cloudy with a Chance of Meatballs franchise takes its comic cues from The Muppets and Pee Wee's Playhouse, kids' shows that ripen as their audience matures."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "It's a tasty buffet of food gags, both visual and verbal. When they say \"We're toast,\" they really mean it."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Charming enough on its own not to feel like just reheated leftovers."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Unlike so many sequels, this fun-filled 3D adventure is sure to entertain younger kids but also charm the adults who will be accompanying them to the multiplexes."
    },
    {
      "critic": "Matt Patches",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 71,
      "summary": "The sequel quadruples the recipe, with gags on top of gags on top of gags in a way only animation could achieve. Like a foodie “Jurassic Park” conjured up by Tex Avery, “Cloudy 2″ is a sight to behold … as long as your brain hasn’t turned to mush by the halfway point."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "While it was often all over the place, it worked, because directors Phil Lord and Chris Miller ladled out the chaos with such charm."
    },
    {
      "critic": "Miriam Bale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "At times it felt as if this film might challenge Pixar’s decade-long reign, but that promise wanes. Instead, the movie is sometimes so strange, colorful and wildly cute that it may end up becoming a “Yellow Submarine” for a new generation."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "The film retains much of what worked about the first film, and it brings a similarly smart, patient, visually striking approach to the gags."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "It might not possess the robust charm of its 2009 predecessor, but Cloudy With a Chance of Meatballs 2 nevertheless gets an amusing boost from a genetically modified, marauding menagerie of Tacodiles, Watermelophants, Sasquashes and assorted other \"Foodimals\" that have overtaken the once-tranquil island of Swallow Falls."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "What Erica Rivinoja, John Francis Daley and Jonathan Goldstein’s script lacks in lingering nutritional value, it compensates for with amusing food puns. If nothing else, the pic’s zany tone and manic pace are good for a quick-hit sugar high."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 67,
      "summary": "It's the only chance for small children to drag parents to the movies until November, so knock yourself out, kiddies."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 63,
      "summary": "\"Cloudy 2\" is undeniably dense with ideas, images, and characters but slight on anything of thematic interest at all."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 63,
      "summary": "If you rely on films to keep your kids entertained and distracted for an hour and a half, Meatballs is a masterwork, a visual stunner that manages to break from animation's current 3-D rut."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Fortunately, the animators get stuck in: the foodscape Flint's party passes through is again wittily realised, each frame sprinkled with colourful hybrid creations, from \"flamangos\" to \"shrimpanzees\"."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "With a large supporting cast and rapid gag-rate, ingredients are generous. But with no real plot to bind them, the pile-up of chaotic chases, repeat-on you leek puns and noisy dust-ups gradually kills the appetite."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "For all its properly surreal mayhem, this flick isn’t quite as nimble or emotionally rounded as its predecessor."
    },
    {
      "critic": "Catherine Bray",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "At one point a character even ponders aloud that it’s probably best not to think too hard about how this ecology might work or whether it makes sense. Amen to that."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "It aims to entertain, to offer a few tame chuckles for parents and children to enjoy in a purely Saturday-morning way. And it accomplishes that."
    },
    {
      "critic": "Dave McGinn",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "Unfortunately, the film promises more fun and laughs than it delivers, and this meal tastes like too many that have gone before it."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "A humorous yet unfocused romp, so unwilling to settle on a single theme that hyperactivity medication should be handed out with the 3-D glasses."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s another brightly rendered effort, but, as the title indicates, a lot of the real creativity seems to have been used up the first time around."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "This sequel strenuously works to form a total inversion of the first movie's relationship with food."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "What a pity, then, that almost no imagination has been expended on the narrative."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s only when the sentient snacks are front and center that this middling sequel to the 2009 animated hit truly comes alive."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "For both kids and adults, CWCM2 is little more than a vague memory as soon as it’s over."
    },
    {
      "critic": "Sean O’Connell",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 37,
      "summary": "Kids will chuckle, for sure. But parents who were pleasantly surprised by the original film’s intelligence will miss Lord and Miller’s guiding hands, as what once felt so funny now leaves a stale taste."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 25,
      "summary": "Whelk, I hope the makers of Cloudy With a Chance of Meatballs earned a nice celery, but I’m afraid they made a hash of things. A hash seasoned with oy sauce."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Cloudy with a Chance of Meatballs 2 maybe is one of the most ridiculous and exaggerated ideas of this year, but... don't care, is an extremely funny sequel, with a cool animation, much funny moments, I could no ask for anything more, Cloudy with a Chance of Meatballs 2 is one of my favorite movies of this year!",
      "total_reactions": 3,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "While Cloudy with a Chance of Meatballs 2 might not deliver the same cross-generational appeal as the first film, it’s a worthy sequel that smartly iterates on the core storyline with a new and entertaining direction. The foodimals will keep members of the film’s kid-friendly demographic entertained and tongue-in-cheek social satire provide some decent chuckles for parents (as well as older fans of the prior installment). In general, Cloudy with a Chance of Meatballs 2 doesn’t taste quite as fresh as the original recipe but the film offers more than just re-heated leftovers  with another funny and entertaining adventure that justifies a second helping of Flint Lockwood and friends.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "what happened to the first \"cloudy with a chance of meatballs\" movie! This movie seems like its a clone of the original! The animations seems to be not as good! The story is forgettable, not as funny, seems like they did a sequel just for the money! :-(",
      "total_reactions": 1,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Cloudy with a Chance of Meatballs 2 suffers from the usual sequel problems; it is neither as smart, as funny, or as inventive as its predecessor, and its first act is incredibly mediocre; it is all style and no substance. As the film progresses, it slowly becomes a rather funny and entertaining, albeit predictable family film. The film is incredibly beautiful to look at, with bright colours and a nice 3D appearance, it will certainly please audiences. Overall, this sequel does suffer from sequel problems and has a mediocre first act, but it is made up for with beautiful animation and the film's gradual improvement.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "While not as intellegent as the previous movie, Cloudy with a Chance of Meatballs 2 is funnier with its food puns and more action-packed that channeled a Pixar movie.",
      "total_reactions": 1,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Being a fan of the first Cloudy, I was excited to check out the sequel.  While the original is better, mostly because it has more heart, there's lots to keep adults and kids entertained here.  It starts off a bit slow, giving a short review of what happened in the first film for those who didn't watch it (which was definitely thoughtful), but once the story unfolds it pulls the viewer in. It's not a spectacular story; the twists are pretty predictable, but it has a good flow and there are no dull moments. Sony did a fantastic job with the visuals  very colorful, vibrant, and the living food really come to life.  Humor was in good supply, and the food-related puns were actually quite clever.  My only real problems with the movie were the somewhat lacking story line and the protagonist Flint, who didn't seem nearly as endearing as I remember him from the first movie.  They made him too wacky and all over the place, and it's hard to imagine kids relating to him or remembering him as a character they'd like to emulate.  Still, Cloudy 2 will keep you entertained enough, and it's worth watching it at least once, especially if you craved more after watching the original.",
      "total_reactions": 1,
      "user": "HeatSeeker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Decent film, slightly above average, the film is full of food puns and is very light heated yet while the first film is full of greater messages and comes off as enjoyable for all ages Cloudy with a Chance of Meatballs 2 has been crafted to entertin younger chilren which for someone of my age is very slow and boring, it doesnt have that impact that over family films such as Frozen has over all views.",
      "total_reactions": 1,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "I love the first movie--it became my favorite animated movie of all time--and I found I really enjoyed this one, too!  Once again, the movie is just plain fun.  The animation looks fantastic, the food animals are creative and amusing, the voice acting is great and, like the first one, it's just hysterical.  While I didn't think it was as gut-busting as the first one, I still laughed a lot and I really want to add this to my \"repeat viewing\" list (come on, Blu-Ray release date...hurry up and get here!).  However, the one thing that I loved the most had to have been the background designs.  The way they created the landscapes into food-based locations was very creative and pretty cool to witness.  Overall, it's a decent and fun follow-up to a epic first film!",
      "total_reactions": 1,
      "user": "RevRon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Cloudy with a Chance  of Meatballs 2, was AMAZING!! If you liked the first one you will love this one too!! :D",
      "total_reactions": 5,
      "user": "NekoMewyChan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "i don't know why people didn't like if this is such a cute movie, i'm a  big fan of this and i really liked the first one and this one..hope we'll get a new one soon",
      "total_reactions": 2,
      "user": "andreslopez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "It's a \"good\", and funny film for the kids, but the jokes are really not that funny at all. The story went smooth through the first half of the film, but then it kind of just went down hill, from there. The first Cloudy, was funny, and  had a lot of creative  ideas pitch in there, however I felt like the squeal was to predicable, and the scenes just went too fast. I felt like they could've done better, with the music, and whatnot, but the kids well absolutely enjoy it. I'm ranking this a 6.9, or a D+",
      "total_reactions": 2,
      "user": "JohnnLee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "I understand that people find this film enjoyable. But as a followup to the first CWACOM, the sequel fails at every turn.",
      "total_reactions": 2,
      "user": "schleffer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I couldn't really think of a plot to add to the first movie and apparently neither could the writers. I absolutely loved the first movie so I was destined for disappointment. All of the story lines had been resolved and the world was safe again from food. Little did we know that Jurassic Park had been resurrected. Actually one of the best scenes recreates the first time in that original movie that we see the reanimated dinosaurs. Only this time they are animated and made of food. What a total ripoff! That is another movie series that should never have gone on. Of course in Hollywood if something works, then you need to keep doing it until you get it wrong. Flints relationships with his not really girlfriend deteriorates to the point of co-worker and the father son turns more into man and his dog. There are some fabulous scenes and humor as well but not enough meat on the bone even for our seven year old. After 20 minutes the kids were bored and the adults just wished it wouldn't degrade into potty humor. It did and that was unfortunately the only real laughs the rest of the way. The morals and lessons weren't too bad except they were just rehashed from the first movie and rather than expanded more like contracted. The funny food animals and especially their combined names were a bright spot in an overwhelmingly dull afternoon. Please do not make a number 3. We all know what happens to leftovers the second reheating.",
      "total_reactions": 3,
      "user": "Papason"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "To start off I love animated movies, those geared for children and adults.  I've been watching Pixar movies long before my children were born.  Understand my love of these types of movies before you read my critique.",
      "total_reactions": 5,
      "user": "bob516"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "While it's not as bad as some might expect, it's no where close to the first movie. Overall, did they really need to make a sequel, plus this movie is more for kids than teens or adults. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies.",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Positives: Witty and fun, this movie is full of both imagination and humor. The food puns will get you every time with their sharp and witty nature, and the story is simple enough for even the smallest of children to understand and enjoy. The CWACOM series has kept true to the style they had in the original, which is both fun and funny within every moment of the film.",
      "total_reactions": 2,
      "user": "RedRabble"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "What a disappointment! The first movie was fantastic, but this one was mediocre. Hardly funny and the animation was a bit iffy, not smooth. If it wasn't for my cineworld pass I would demand my money back!",
      "total_reactions": 1,
      "user": "pablo2008jedi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "Cloudy with a Chance of Meatballs 2 is one of those cashgrab sequels in that it was only made to make money and cash in the success of the first one and it clearly shows. The story is nothing special it is generic, cliché, rehashes the first one and rips off the plots of other animated films, and honestly feels like it was written in one draft made in one hour. I don’t care for the characters and any attempts at humor mostly fall flat. Even the animation isn’t that great, for reasons I cannot put my finger on the animation is painful to look at and some of the character models are painful to look at. That being said I can’t entirely bash this film as it is geared towards kid and as far as kids movies go its not awful I have seen far worse. There are films such as Planes were it was painful all the way through and I just wanted to stop watching. Then there are movies like The Wild were they makers were like **** it and then there is Foodfight, which makes me ask why. This movie will most certainly provide some joy for the kiddies but unfortunately that’s about it. Everyone else don’t feel obligated to watch this movie. Skip it and watch something better. There isn’t enough good in this movie to make it worth watching.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "A perfectly acceptable and harmless animated comedy. It will delight it's younger viewers with it's bright and colorful animation, adorable food critters, and tons of food puns. Older audiences won't be as entertained, but they can still appreciate the film for it's goofy quirks and for the fact that it will totally entrance their kids. So if you are looking for a something to watch on family movie night this is a good pick. It might not be as enjoyable for adults as it is for their kids the way a lot of Pixar and DreamWorks movies are, but they won't be completely irritated by it.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "The original film was a humorous and original masterpiece. This film on the other hand falls short in that regard.",
      "total_reactions": 0,
      "user": "InspectorJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "This year's animated films seem to have been somewhat below par so this sequel is refreshingly welcome even if it's not quite as good as the original. Story wise there isn't much to shout about it's just the good guys vs the bad. Visually, however, this is jaw droppingly amazing stuff. Beautiful colouring and some real imagination is on display here and this is enough to cement over the cracks of a screenplay that is at its best when batting out funny one liners. There are loads of jokes about the food characters on show. I particularly liked the 'leek on the boat  gag, and the one about cutting the cheese is proof positive that toons are no longer positioning themselves just for kids (Para Norman made that perfectly clear). The animal/food names are very inventive what with shrimpanzees, flamangos, tacodiles and melophants, and if  the humour at times is a bit corny (pun intended) it non the less raises a smile and is often very funny. Even the requisite cute character, a strawberry with the oh so original name of Berry!, is more tolerable than usual. Good fun.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "The title itself is not suitable for this sequel. I guess 'Jungle with a Vicious Foodimals' or something like that would have been fair to be called. Unlike the first part I just found this movie more kiddish. The last decade was the beginning of 3D animations, so it captivated large group of audience with awesome movies. But its time now people to understand animations too would have such low movies like this.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "The first one was not just a story about inventions and food - it was also about people, and had characters with content, that developed throughout the plot. The humor evolved naturally from their personalities.",
      "total_reactions": 0,
      "user": "SchnitzelPoof"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "The sequel for Cloudy With a Chance of Meatballs fails to deliver the same kind of rush the first one did. In that respect, it rings short in its message and doesn't provide as many laughs.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "After \"Cloudy with a Chance of Meatballs\" became a box-office success in 2009, Sony Pictures Animation jumped at the idea of making a sequel, as one would expect them to do. After the first film turned out to be a pretty inventive and fun film, I was pretty excited for this one. And while it doesn't hold a candle to the first film, \"Cloudy with a Chance of Meatballs 2\" is still a solid animated film. The animation is pretty good overall, the film itself is pretty funny, and the characters are not bad either. Sure, it can't help but feel like a little bit of a retread of the first film, but \"Cloudy with a Chance of Meatballs 2\" is still a good animated film that's fun for the whole family.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "The main course is better than the opener as Cloudy With a Chance of Meatballs 2 is filled with countless hilarious food puns and some very dazzling visuals despite its shaky start and predictability.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "The theme of this movie is the battle between science and nature (here embodied by living food) which leaves you thinking if the production of this film is part of Greenpeace.",
      "total_reactions": 0,
      "user": "JNOTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "I loved the first movie. It turned tired cliches into hilarity, gave Mr. T his first animated role since himself and was one heck of a lot of fun. While directors and writers Phil Lord and Chris Miller were busy on The LEGO Movie, Sony whipped up a sequel, hiring the writer of The Incredible Burt Wonderstone and the director of Open Season 2, and while the critics seem to like it quite a bit, I felt that Sony Pictures Animation disappointed me yet again.",
      "total_reactions": 0,
      "user": "Maximillion93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Of course the film is original and filled with amazing animation and vivid views, but that doesn't make up for the silly script and acting. Kids will enjoy the film, but the rest of just stand thee awkwardly which unlike the first film, didn't happen.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "cloudy with a chance of meatballs is a whole other world it does get cool at times but  i did not enjoy the sequel as i thought . the first one is much better",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "As good as the first movie.  The characters are all back and just as funny.  Apart from Mr T being replaced by Terry Crews this movie is Fantastic! I love it, my kids love it and so should you.",
      "total_reactions": 0,
      "user": "Batfinkskinner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "The main course is better than the opener as Cloudy With a Chance of Meatballs 2 is filled with countless hilarious food puns and some very dazzling visuals despite its shaky start and predictability.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "3/5★ Fantastic animation, creative world building and nonstop action aside, the film is not as clever as the prequel. I know its a kids movie, but kids movies today have to cross the high bar Pixar films have set. We have seen what is possible and wont settle for less.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Cloudy With A Chance Of Meatballs 2 is cute and dazzling movie but suffers with it's annoying characters some of them are underdeveloped and it's plot.But It still has potential to be good movie with it's silly animations and cute foods walking around helping the gang to stop the evil corporation.The Sequel isn't really better than the first movie but it's still a fun kid's movie that anyone,well not everyone can enjoy.",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": ". Cloudy with a Chance of Meatballs 2 dives in deeper in its appetizing-utopian realm, and it's a bit unnecessary at times, but it's still able to provide hilarity, colorful personalities and heartfelt vibes, that though it isn't as striking as its predecessor, it's still solid.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Bottom line: Cloudy with a Chance of Meatballs 2 is the best children’s movie I’ve seen in a long time; I'd highly recommend it to anyone and especially those with children.",
      "total_reactions": 0,
      "user": "GregePorter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Honestly I liked this movie better then the original. I mean Flint Lockwood trying to be his idol.But the thing that makes it better is the foodimals.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Well... I believe you can live up the first few minutes of not being starved by this movie. The comedy doesn't work here, but after a few minutes... it'll just be like the first movie all over again.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ],
  "metascore": 59,
  "name": "Cloudy with a Chance of Meatballs 2",
  "num_weekends": 17,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 27,
    "month": 9,
    "year": 2013
  },
  "opening_weekend_income": 34017930,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 67990,
  "rating_freq": {
    "1": 912,
    "10": 5218,
    "2": 735,
    "3": 1331,
    "4": 2987,
    "5": 7708,
    "6": 17358,
    "7": 18997,
    "8": 9286,
    "9": 3458
  },
  "release_day": 27,
  "release_month": "September",
  "release_year": 2013,
  "user_review_count": 86,
  "votes_per_demo": {
    "aged_18-29": 28622,
    "aged_30-44": 19599,
    "aged_45+": 3436,
    "aged_under_18": 670,
    "females": 13770,
    "females_aged_18-29": 8198,
    "females_aged_30-44": 3613,
    "females_aged_45+": 585,
    "females_under_18": 216,
    "imdb_staff": 7,
    "imdb_users": 67990,
    "males": 41925,
    "males_aged_18-29": 20138,
    "males_aged_30-44": 15760,
    "males_aged_45+": 2778,
    "males_under_18": 450,
    "non-us_users": 30761,
    "top_1000_voters": 352,
    "us_users": 9295
  },
  "year": 2013
}