{
  "avg_rating_per_demo": {
    "aged_18-29": 6.5,
    "aged_30-44": 6.3,
    "aged_45+": 6.4,
    "aged_under_18": 6.9,
    "females": 6.8,
    "females_aged_18-29": 7.0,
    "females_aged_30-44": 6.5,
    "females_aged_45+": 6.6,
    "females_under_18": 6.8,
    "imdb_staff": 6.4,
    "imdb_users": 6.4,
    "males": 6.3,
    "males_aged_18-29": 6.4,
    "males_aged_30-44": 6.2,
    "males_aged_45+": 6.4,
    "males_under_18": 7.0,
    "non-us_users": 6.3,
    "top_1000_voters": 5.8,
    "us_users": 6.3
  },
  "avg_screens": 1147.8,
  "budget": 40000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 28,
    "month": 10,
    "year": 2011
  },
  "critic_review_count": 199,
  "duration": 108,
  "genres": [
    "action",
    "crime",
    "drama"
  ],
  "gross_income": 36665854,
  "max_screens": 2614,
  "mc_avg_user_score": 5.5,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 60,
  "mc_movie_name": "Colombiana",
  "mc_negative_rating_frequency": 29,
  "mc_positive_rating_frequency": 40,
  "mc_pro_critic_reviews": [
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "All of that combines to make Colombiana into a scandalous blend of action, sex and violence. My apologies in advance for having so much fun."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "In catsuits, swimsuits, and skimpy underthings, Saldana is as potently elusive as a shadow can be."
    },
    {
      "critic": "Boyd van Hoeij",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "The Olivier Megaton-directed Colombiana may not be the brainiest of actioners, but one of the merits of producer Luc Besson's latest brainchild is that fanboys worldwide will come away with a scrap of horticultural knowledge as well as a pretty good time."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "Colombiana isn't the last word in action movies, but it's a fun ride. And so wrong."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "Zaldana is such a sultry and surprisingly heartfelt executioner that she often finds a way to make this by-the-numbers genre retread feel, if not fresh, then at least sporadically electric."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "Saldana is in top form for the acrobatics required in the role, and she makes the gritty determination of her character believable."
    },
    {
      "critic": "Michael Wilmington",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Saldana makes this watchable, James supplies a fitful plausibility, and director Olivier Megaton (a former graffiti artist) keeps things racing along, preposterously."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Zoe Saldana makes being an action hero look so easy in Colombiana, you have to wonder why more actresses don't try it."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "The jittery aesthetic is a bit grating - there's a three-cut minimum per roundhouse kick - but the spectacularly named Olivier Megaton (Transporter 3) still manages to deliver the action-film goods."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 58,
      "summary": "It uses a story about family as a vehicle for glorifying gangsterism. In other words, it's empty, amoral, and - in the style of other Besson productions - surprisingly easy to digest."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Possibly worth seeing if you are 13, as the hot Rihanna-looking chick shows sideboob."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "It's basically a blaxploitation movie stretched to meaninglessly international proportions that leans on tired Colombian stereotypes. But if Saldana's aiming to be some kind of new Pam Grier, she needs to save more than herself."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Colombiana is silly fun at first, but as her break-ins and escapes grow absurdly complex - and her motivations increasingly muddy - it turns into the same silly stuff we've seen before, a dish of revenge served not so much cold as reheated."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Colombiana, though, doesn't quite qualify as a chick flick. The filmmakers were surely thinking of the guys when they arranged for Saldana to play many of her scenes in a cat suit, a bikini or lingerie."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "The overall effect is distancing; there are some early comic moments that have you laughing along with the movie, but eventually the clashing tones and preposterousness just have you laughing."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "While most action films fall apart because they succumb to stupidity, Colombiana suffers most because it tries to be too smart."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "There are guilty pleasures to be had in this frenzied B starring Zoe Saldana (Avatar, Star Trek), who gives an acrobatic performance that makes the overcooked material watchable, if not entirely enjoyable."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "Luc Besson's Jumping Frog Action Factory looks mighty lame in Colombiana."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "A movie so addicted to the crack pipe of delirious cinematic badness that it has real potential as a camp classic."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "As straight exploitation, it's amusing, in fits and starts. It's just that Colombiana lacks the kinetic energy of \"The Transporter\" and the pathos of \"La Femme Nikita.\""
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "Colombiana is one long megayawn; I'd have garnered more titillating thrills rewatching freckle-faced Russkie sexbomb Natalya Rudakova strut her leggy, sassy stuff in Megaton and Besson's \"Transporter 3.\""
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 12,
      "summary": "Luc Besson keeps ralphing up scripts about beautiful lady killers, but that doesn't mean you have to keep seeing them. Case in point: Colombiana...[a] dull cable-TV-quality item."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "This movie look's like a pseudo spin off of \"The Loser's\". Where Zoe Saldana ; plays pretty much the exact same character , but without the lime light.Although the alluring figure of the actress coupled with gun's and explosions will make the opening week a bro- fest  i don't see this recycled  vengeance plot  , becoming a colt classic.I would much rather watch a \"The Loser's 2\" with Saldana playing a larger role then the first then a slightly different story starring her completely.",
      "total_reactions": 5,
      "user": "Frocious"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "It's cliched, cheesy, and at times a little boring, but for the most part, this movie is stylish and FUN - and that's what matters with a B-movie like this. If you're expecting high art, you won't find it here. But it's a good time with laughs and a good bit of innovative violence. It's great seeing some alumni from The Unit and Human Target in the mix - two great testosterone-fueled shows whose plugs were pulled before their respective times. Saldana does a perfectly respectable job in her role. Physically, she's spot on. She could have brought a bit more emotional range to the proceedings, but again, it's a B movie action flick.  Nailed it.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "The stupidity of this movie isn't what make it bad. The fact that it actually think its smart, is what makes this movie so dismal. Sitting through it was a difficult experience, not even Saldana's beauty and effort could save it. In fact it only makes it more difficult to watch as she's wasting talent on a movie that should have been made for tv. Colombiana is a cliched-ridden mess, with poor dialogue that would make the best of actors look horrible. The movie crumbles as the story progresses, and its surely one of the summer's loudest light-weights.",
      "total_reactions": 2,
      "user": "lahaine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "I wanted to like this movie.  Zoe Saldana is gorgeous and very capable in an action movie.  For some reason, though, she keeps picking lousy screenplays (like The Losers, which was also not good).  Columbiana is well shot and looks great.  The pacing is fine.  But this screenplay is so corny and full of insipid plot holes and logical leaps that is strains credulity.  The director is very adept in filming the action scenes and makes good use of the various locations.  But you can't get past the stupid script, unless you just don't care how stupid it is.  While one must be able to suspend disbelief to go with a number of movies, some movies just push that envelope so badly that it does not work.  Luc Besson's heavy handed mitts are clumsily all over this formulaic, corny and predictable story with cliche-ridden villains, which is a shame.  Zoe Saldana is almost worth the price of admission, but this would have been better if it were a female \"Bourne\" or her being the next Lara Croft.  As it is this is a pretty movie with a stunning star that is just terrible.",
      "total_reactions": 3,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Fantastic action movie, one of the most intense I have seen in a long time!  Zoe is super and plays a fine line between badass and vulnerable.  The critics give it low scores but then again I usually hate most of the trash they rate highly.",
      "total_reactions": 4,
      "user": "MasJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Restraint isn't a word that you'd normally associate with filmmaker Quentin Tarantino, especially in \"Kill Bill: Vol. 1\", the Grand Guignol revenge spectacle, starring Uma Thurman as The Bride, the be-all and end-all of female vigilantes, who keeps killing until there's nobody left to kill. Despite the high body count, the film does have a moral center as it pertains to children, unlike cross-generational films such as John Carpenter's \"Assault on Precinct 13\"(where during the infamous ice cream truck sequence, a little girl is graphically shot in the chest), and the recent \"Kick-Ass\", featuring Chloe Moretz, who as Hit Girl, similar to young Cataleya in \"Colombiana\", seems way too wise beyond her years, in regard to violence. In retrospect, Tarantino has his limits. Vernita, a.k.a. \"Copperhead\", allows her daughter Nikki to have a childhood(in \"Kill Bill: Vol. 2\", Bill turns out to be a surprisingly good parent, too), and in return, The Bride allows the girl to live, even though a double homicide would have been cleaner. Nikki acts like how a little girl should, when confronted with the sight of some strange woman removing a knife from her mother's chest. She does nothing. A recent slate of films(in addition to \"Kick-Ass\", there is also Joe Wright's \"Hanna\" and Jaume Collet-Serra's \"Orphan) makes it seem completely natural that a child should stab or shoot like a pro. Tarantino understands that Nikki is too young for murder; too unformed for vengeance, so she just stands there, shellshocked, as The Bride wipes the blood off from her blade. In \"Colombiana\", however, taking its cues from those aforementioned movies, in which kids commit violent acts with a disproportionate amount of competence, and more disturbingly, with steely resolve, Cataleya pins the hand of a drug lord's henchman to the table, and declares her intention \"to kill Don Luis,\" only moments after a hit squad orphans the girl, as if maiming a grown man, then escaping through an open window, and scaling down a building, followed by her outrunning a pack of angry Colombians through a shanty town, is par for the course, despite being nine. To put her exploits in perspective, Paul Kersey(Charles Bronson), perhaps, the most famous vigilante of them all, whose actions in the \"Death Wish\" movies inspired real-life copycats, is downright tentative in responding to the home invaders that destroys his family. The ease in which Cataleya handles a knife becomes a contextual indicator of violence in regard to its cultural evolution from being a man's business to mere kid's play, since Bronson's first weapon isn't a gun, but a sock filled with quarters, twenty dollars worth, which he acquires from the bank, in lieu of procuring a real weapon from an arms dealer. Ironically, it's the architect who possesses a childish armament, whereas Cataleya, upon arriving in the states, announces to her older brother that she wants to be a killer. The girl turns Bronson into Macaulay Culkin; when Paul is home alone, he swings the sock over his head. Emilio tries to deter Cataleya from her plan by shooting over a crowd to no avail. \"Colombiana\" avoids controversy by cutting to Cataleya all grown up, thereby averting the unsettling sight of a homicidal minor. As an adult, Cataleya is played by Zoe Saldana, and because of her skin color, the kneejerk response is to link her to blaxploitation stars such as Pam Grier and Tamara Dobson, since the film itself is being marketed as a sort of black \"Le Femme Nikita\". But where's the camp value? To put it in politically incorrect terms, Cataleya kills like a white woman, a female vigilante more akin to Camille Keaton in \"Day of the Women\", and especially, Christina Lindberg in \"Thriller: A Cruel Picture\"; women with sadism on their minds. For a heroin, the 1973 Bo Arne Vibenius cult classic had a heroin-addled farm girl(made mute by rape), who goes on a killing spree after escaping from a life of sex slavery. Although Madeline's vengeance is justified(she shoots her johns, both male and female), there's no condoning her deviation from the hit list when the one-eyed girl kills two cops, and the innocent motorists she runs off the highway. By the time Madeline gets to Tony, the purity of the girl's mission is all but compromised, due to the pleasure she derives from her use of torture on the pimp. It's the ruination of all vigilantes, the humanity that becomes mislaid as they hazard through their righteous quest, in which the wronged person becomes the very thing he/she hates, a cold-blooded killer. Instead of a horse, Cataleya uses sharks and dogs to do her pernicious bidding. This tag killer(an orchid) is not the little girl who watched her parents get murdered. She becomes an evil that both Emilio and the film itself doesn't seem to grasp. \"Colombiana\" is as desensitized to violence as Cataleya seems to be. It's left to the moviegoer to judge this serial murderer.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "A young Colombian girl watches crime lords kill her parents. When she grows up, she becomes Zoe Saldana, a stealth assassin who sets out to reek her revenge. The film spends most of the time watching her complete several elaborate murders. They're interesting, but not especially imaginative or thrilling. Saldana is sexy and strong, but the film is destined to fade into oblivion.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "Not the worst film I've seen in a while but a major disappointment. Ludicrous from a believability standpoint. (My big hang up with action flicks.) Not worth the $5 price of a matinee ticket. Wait for it to hit cable TV. Just make sure its on a movie channel cause its not worth sitting through commercials either.",
      "total_reactions": 1,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "There are only so many ways to tell a story of revenge and, I",
      "total_reactions": 1,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Aunque no me gustan las venganzas, tiene un sabor a Alias que te mantiene muy entretenido. La protagonista es muy bella, y el chico nos recuerda a Michael Vaughn. El símbolo de la orquídea también es remarcable para este movido thriller, y las muertes de los malosos bastante entretenidas.",
      "total_reactions": 1,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "From the director of '' Transporter 3 '' brought us '' Colombiana ''. Do I need to say more ? It's everything that you would expect. A cold blooded assassin, who kills people, who has an another identity, who does awesome spy stuff. She's like Jason Statham's dream wife. Yes, l am a fan of those action movies, but this is just boring and uninteresting. There's more action in the trailer then in the movie itself. I didn't see anything new in '' Colombiana '', beside the location. Witnessing her parents death, wanting revenge, I have all seen that before. It's so cliche that I became frustrated and I wanted to punch the director in the face. I felt bad for Zoe Saldana because I liked her in this role and she tried to make it work. The very few actions scenes were great do. I'm giving this movie a 4 out of 10, because Zoe is hot. It's like if all of the sudden action movies are getting boring (last week's '' Conan the Barbarian '' is a perfect example). I hope it won't happen again until December. '' Colombiana '' is not worth seeing.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Sexy and bad ass assassin.  Zoe Saldana deserve better than this. It was sucks, really, really sucks, nothing to do with it. I though it could be be great, the trailer looks great and my expectation is so high.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I actually enjoyed this film as a fun and action-filled diversion. To me, it was a little like a Salt (Angelina Jolie's film of this past year) plus. If you're looking for a plausible serious film pass this one by as you will be disappointed. However, if you want a fun romp, go for it! Looks like it , like Salt , has the potential for a followup.",
      "total_reactions": 0,
      "user": "acquiredtastes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "As an action genre film, Colombiana is just a bit above average.  Even though dialogue is one-dimensional and stunted and even though the plot is as predictable as the next cookie from the cookie cutter, the elaborate scenes of Zoe Saldana sneaking through ducts and hanging from ledges to assassinate her next target are really fun to watch. When Cataleya was nine years old, her gangster father and mother were gunned down by the evil Don Luis and his henchman Marco in her native Colombia.  Naturally, she spends the rest of her formative years learning the intense tradecraft of â",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Seriously. Kicks. A$$. Really. I don't understand what all the fuss is about - I walked into the theater expecting to see a poorly made, crappy movie where all the actors are uttering cheesy one-liners and doing unbelievably stupid stunts that did not add to the plot of the movie - this is what I was led to believe by all of the negative reviews. In fact, I almost did NOT see this movie in the theater at all. Boy, are all of the critics who posted horrible reviews of this movie WRONG, WRONG, WRONG. Columbiana, starring Zoe Saldana as the titular character, is a hotbed of action which steam-rolls through from beginning to end. Incredibly, the killing and other violent activities which form the basis of the movie do not bump the flick up from a PG-13 rating - how they did this, I will never know, because the movie is very, very violent. People talk about the lack of character development in this movie - that is just a big, steaming pile of horse manure. Here's why: As most of you must know by now, the main character and protagonist, Cataleya Restrepo (Amandla Stenberg & Zoe Saldana), is the daughter of a kingpin in the drug trade. When Fabio (Jesse Borrego), Cataleya's father, decides to leave the particular drug cartel he is associated with, the cartel's Don or father, named Don Luis (Beto Benites) orders Fabio and his entire family killed. Fabio discovers the kill-order, and attempts to flee with his wife Alicia (Cynthia Addai-Robinson) and daughter, 10 year old Cataleya - but they are too late. Unfortunately, the parents are killed in an off-screen standoff-cum gun-battle inside their home while Cataleya sits terrified at the kitchen table. She does not see her parents killed, but she knows what has happened. THIS IS ALL THE CHARACTER DEVELOPMENT THIS TYPE OF MOVIE NEEDS. The violent murders of Cataleya's parents creates a thirst for vengeance which will not be sated until all parties involved suffer a similar fate. This is the movie's moment of truth: It defines the way the story is treated from that moment forward. Critics have complained that the audience was not shown HOW Cataleya developed her childhood \"parkour\" or speedy obstacle navigation escape skills. That's just silly - first, the child of a drug kingpin in Bogota, Columbia would most likely be taught by her gun-wielding parents SOME type of self defense - which NEED NOT be part of the film's scope - second, any child who plays with other children knows how to run, jump and hide - and third, a terrified child is usually uniquely capable of eluding pursuers for a short period of time if given enough of a head-start. I have also read complaints regarding Cataleya's lack of a personality - that's ridiculous. She is simply a vengeful **** who does not lose focus - ever since escaping, her ultimate goal has been killing those responsible for murdering her family. We even get to see her interact lovingly with her uncle, Emilio Restrepo (Cliff Curtis), her grandmother, Mama (Ofelia Medina), her boyfriend, Danny Delanay (Michael Vartan), her adopted family, and her dogs. The movie is careful to show that while these parts of her personality are important to her, Cataleya cannot truly move forward with her emotional development until she has exacted her revenge. Critics of the movie have complained about silly little cosmetic touches like Zoe wearing a black leotard, Zoe dancing in front of the camera, and Zoe sucking a lollipop. REALLY? Are these the things that make a movie BAD? Get real. The most important aspect of the movie for me is that Cataleya is forced to see that her single-minded focus on vengeance directly causes the remaining members of her family to be murdered. She is also forced to see what she has become when she faces FBI agent Ross (Lennie James) and threatens the lives of his family in order to assure his cooperation. Once this happens, and once Cataleya finally kills the man who ordered her family murdered, she is able to move forward with her development - and her life. The story has a neat, tidy ending, perhaps leaving the audience with a feeling as anticlimactic as Columbiana herself must have felt. Do yourself a favor - do not listen to the critics - see this movie and judge for yourself. Columbiana is a legendary piece of action filmmaking.",
      "total_reactions": 0,
      "user": "ChipperX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "I gave this movie a three for implausible and overly unrealistic plot points. Without posting actual spoilers, I will say this: there were just too many things that relied too heavily on things happening in a very specific manner. She never had to resort to a Plan B, and there was never any danger of her being caught because she was just \"too good\". There wasn't much suspense in it for me.",
      "total_reactions": 0,
      "user": "MusicMovesMe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "This movie was poor. Led with poor acting, poor action sequences and a weak story. I only saw this movie because its what my gf chose and it was free because i work at the theater. I never cared to see this movie because of the annoying trailer where the father says \"never forget where you came from\" like 10 times. I saw it though and their wasnt anything to like. The fighting scenes looked fake and the main actress didnt even seem to be trained at all. The only thing that was good was the main actress had good looks, thats about all i can say, and the beginning scene where the little katayana (however you spell it) was running away was ridiculous because somehow her and the guys she was chased by all of a sudden became pros at parkour. Anyways this movie was ridiculously dumb, made no sense. 1/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Great action, crappy ending for the build up. The movie left way too many questions unanswered. 1.) How did she become such a bad ass assassin.? Her uncle sure as hell didn't teach her, although that's what we're lead to believe. But how can I guy that shoots into crowds and by a nearby school teach the art of intelligent killing, when he himself is reckless.",
      "total_reactions": 0,
      "user": "ElGalloNegro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I couldn't pick who's the sexiest female action character of all time because for once I fell in love with \"Le Femme Nikita,\" Natallie Portman in \"The Professional,\" or British-born sex symbol Lara Croft from \"Tomb Raider.\" But I personally like Luc Besson, making new ideas to make a movie that female leads are so much fun to kick some serious ass and maybe just maybe they could have their own movie together. \"Colombiana\" is so sexy, action-packed, \"Nikita\"-styled and pure 100% Besson all the time. I think Zoe Saldana could be the next Lara Croft or Leeloo from \"The Fifth Element.\" I hope the dreadful hurricane Irene in New York doesn't affect the box office because probably \"The Help\" could win again at #1. But \"Colombiana\" is a big winner.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Colombiana is totally piece of crap. I have literary found more then 20 big mistakes in the first half. Olivier Megaton's directing was so bad that I am worried that he will ruin TAKEN 2 . ZoÃ« had everything to made that role perfect but she was awful. Others did really really bad . The whole film was Serious Action film with Funny Mistakes . The Story was a bit lose but Olivier made it so bad that its really hard to imagine how he become a director .Sound mixing was good But the whole movie was childish , Foolish and Sucked damn big time.",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "Luc Besson is a well-known writer of several cult classics, and action films including Taken, The Transporter (all films), Unleashed, La Femme Nikita, The Big Blue and The Fifth Element. There",
      "total_reactions": 0,
      "user": "JeffHammer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Disons-le d'office, Colombiana n'est pas la plus mauvaise production de Besson. Mais quand on sait que ce film aurait pu Ãªtre une suite Ã  LÃ©on (et que Cataleya aurait Ã©tÃ© Mathilda), la dÃ©ception est grande. DÃ©jÃ  parce que question action, on n'est pas excessivement servi (Ã©tonnant de la part de Besson), au point que l'on ressent parfois de l'ennui. Et puis, le film s'offre quelques moments de sentimentalisme. Je ne suis pas contre, tant que ces instants soient crÃ©dibles. Ici, ils sont barbants. En clair, Colombiana n'est pas le film d'action que j'attendais, plutÃ´t mou du genou, excessivement invraisemblable question scÃ©nario (qui est dÃ©jÃ  bien lÃ©ger sur le papier) et qui, de toute Ã©vidence, n'arrive pas Ã  la cheville de LÃ©on...",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "After the film ended, I realized how she (Saldana) would be the perfect Lara Croft :)",
      "total_reactions": 0,
      "user": "ckim85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "This film was much better than what it's been given credit for, sure it had a few tiny moments of cheese, but the continuity was very good which usually makes these films fall completely apart and Zoe Saldana kicked ass in a believable way. Not to forget the great supporting cast as well. For a shoot 'em up, I was definitely entertained!",
      "total_reactions": 0,
      "user": "Vellyrocks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Fun action thriller with solid performances from Zoe Saldana and the young actress who plays her as a child, Amandla Stenberg. The audience I saw it with seemed to enjoy it a lot as well. Lots of cheering and applauding.",
      "total_reactions": 0,
      "user": "Dragonfly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "Skip-it - Zoe Saldana, the naked blue chick from Avatar, is an assassin seeking revenge for her murdered parents - if you are still interested in seeing that story play out you won't be disappointed by the over-the-top action.",
      "total_reactions": 0,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Colombiana is a fantastic comedy. That statement pretty much says it all. Unlike other low budget action films released in the last few years (Taken and Unknown are just some) it just doesn't work as a mindless action film. It doesn't work as a story about a woman seeking revenge on the cartel that killed her family. It just doesn't work and that's what makes it so unbearably funny. Well that and the cast, script and the fact that every set looks like it is made out of corrugated cardboard. Its a complete mess and lines like \"you're my brother in law, not my boss\" don't help its cause at all. The only redeeming feature is that it actually did make me laugh, I gained that little bit of amusement out of this film because it was so bad I chuckled.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "The storyline is predictable but Zoe Saldana makes this movie worth watching. She ranks high with other female assassins like Bridget Fonda in \"Point of No Return,\" Maggie Q in \"Naked Weapon\" and and Su Qi in \"So Close.\"",
      "total_reactions": 0,
      "user": "ezcam1944"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Colombiana la gran incomprendida de lo que llevamos de cine Â¿Buena o Mala?Â¿Entretenida o Aburrida? para empezar opino que la pelicula es mediocre tirando para buena lo que seria un 6, pero sin duda entretiene y mucho ya sea por ver a la bellisima Zoe Saldana o por las escenas de accion (estas muy escuetas y poco frecuentes). En defenitiva como pelicula en conjunto merece un 6 pero debido a que sabe entretener y tiene a Zoe como protagonista le hace ganar puntos.",
      "total_reactions": 0,
      "user": "XNextGamerX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Filled with a couple of plot holes, an overall weak story and a forced underdeveloped romance between our Colombiana an her guy, this movie's main achievement is its over the top creative ways of killing people.",
      "total_reactions": 0,
      "user": "eguerr03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Sometimes abandoning all logic can make an action movie a lot more fun than it would be if done completely straight -- the main problem with Colombiana is that it tries to do both. Unfortunately, this only serves to annoy an audience that should know better. 'The best of both worlds' seems to be Besson and Megaton's mantra for much of the production. They want a strong, capable female action hero, but they also want her to be vulnerable, moral and relatable; they want a thrilling action blockbuster, but they also want it to have emotional depth; they want silly over-the-top fight sequences, but they also want a believable story. It's this kind of indecision that eventually makes the movie just end up being weak as its ideas are spread too thin. Some cohesive and realised writing would lift this choppy, half-baked nonsense into either a kick-ass action-fest, or an artsy revenge thriller. Currently, Colombiana is neither.",
      "total_reactions": 0,
      "user": "Ven-Wede"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "Colombiana is an awful disappointment of a movie. I had high hopes for this Luc Besson movie and was expecting a Transporter-esque movie with a subbed-in female lead.",
      "total_reactions": 0,
      "user": "frontsquats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "I really wanted to like this film, in fact i was really excited too see this. That is until i got in the middle of the film and realized how bad it was. One actor ( Zoe Saldana)cant carry a whole movie filled bad supporting actors and little to no character devlopment whats so ever. This film really had potential to be the next Tomb Raider, but this movie just felt rushed more than anything. It will leave sracthing your head and wanting your time and money back.",
      "total_reactions": 0,
      "user": "Jbrizzy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I am IN-LOVE with this movie! This takes the plot of an intelligent, strong woman to the next level. I could endlessly watch this movie over and over again, as the setting, the characters, the actors, the big-idea, it's all brilliant.",
      "total_reactions": 0,
      "user": "Zonbi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "Columbiana is not much more than a collection of action movie cliches and predictable revenge movie scenes stitched together. It's been done before of course, but i was surprised at how darkly amoral everyone seems to be in this movie. Basically zoe saldana's drug dealing parents were killed by their drug dealing boss, so as a young girl she vows to kill him right back. But she doesn't do it right away, being only eight or nine years old. She escapes from her homeland and travels to america where she learns from her killer of a brother how to become an assasin, and spends the rest of her life killing bad guys for money in the hopes of drawing out her real target so she can kill him. Obviously we're supposed to side with Cataleya on her riteous quest for payback, but she's just not that likeable. Her revenge motivation seems like not much more than an excuse to waste people in interesting ways, or her double standard when it comes to morality. In one scene she weeps miserably over her lost parents, then in the next sentence, she threatens to kill the family of an FBI man one by one if he doesn't help her. Her brother and mentor isn't much better. In another scene, he preaches to a young Cataleya the importance of education after randomly murdering some passerby in front of her school.  Attempts are made to humanize Cataleya by showing she's in a relationship with Michael Vartan, a bland acessory who mostly communicates in mumbles of affection. He seems pathetically subservient, as if he's just happy to be hittin that. Later in the movie, when he finds out the love of his life has murdered dozens of people, he sheepishly asks when he can see her again. With a story and characters this weak its hard to enjoy the action when that starts heating up. You can point out the plot early on, and find no surprises. There's the loved ones that are going to be killed off at the end of the second act..there's the dedicated cop who will chase his prey through the whole movie but never quite make it..there's the smug kingpin who will get the most creative death..yeah, we've seen it all before.",
      "total_reactions": 0,
      "user": "smirky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "For me \"Colombiana\" is one of the best vengence thrillers ever made.I saw this when it opened in the US and i think it was absolutely great.Sure there were problems with the film,the script was ropey and the South American gangster stereotypes were a bit too obivious but you know what i what....who cares?.The direction was fantastic,the action/fight scenes were was great and most of all there was the absolutely gorgeous Zoe Saldana given free permission to seriously kick South American gangster backside.This film was my favourite film of 2011 and rightly so.",
      "total_reactions": 0,
      "user": "stephen37"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Colombian masterpiece but with some flaws, a funny movie, action and romance. I really liked the interpretation of zoe. is one of the few movies that deserve a sequel. definitely there to see this movie to hang out of action, romance and lots of fun.",
      "total_reactions": 0,
      "user": "Cadmielt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "I would contend that almost any story is a voyage - often a  mental one, if not always -  and not seldom expressed in a physical one, where the protagonists move from one place to the next as a mirror to their mental journey in which they travel from one state to the other. Just some movies I can name are  obvious ones like The Lord of the Rings or  Saving Private Ryan. There are less obvious ones like The Third man or the Edge of Tomorrow.  And there are even reversed ones like were the main characters are in one place in the way of others travelling.",
      "total_reactions": 0,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Columbiana had its action, adult themes, and plot, but it wasn't near the standard of a high-quality action movie. Overall, the movie was not bad at all, but definitely not my taste: Unnecessary killing of a tag-killer/assassin with moments of sensitivity and moments of just pure heartlessness isn't very deep at all, in fact, it's on the shallow side of a semi-mainstream action movie.",
      "total_reactions": 0,
      "user": "CheckGamesList"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Pretty good movie. Lots of action and kickassery. Zoe rocked this movie.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ],
  "metascore": 45,
  "name": "Colombiana",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 26,
    "month": 8,
    "year": 2011
  },
  "opening_weekend_income": 10408176,
  "opening_weekend_income_currency": "$",
  "rating": 6.4,
  "rating_count": 78745,
  "rating_freq": {
    "1": 1251,
    "10": 5168,
    "2": 963,
    "3": 1821,
    "4": 3758,
    "5": 8974,
    "6": 19830,
    "7": 21739,
    "8": 11255,
    "9": 3986
  },
  "release_day": 26,
  "release_month": "August",
  "release_year": 2011,
  "user_review_count": 205,
  "votes_per_demo": {
    "aged_18-29": 25837,
    "aged_30-44": 34427,
    "aged_45+": 8221,
    "aged_under_18": 80,
    "females": 11995,
    "females_aged_18-29": 5976,
    "females_aged_30-44": 4446,
    "females_aged_45+": 988,
    "females_under_18": 39,
    "imdb_staff": 9,
    "imdb_users": 78745,
    "males": 58222,
    "males_aged_18-29": 19592,
    "males_aged_30-44": 29586,
    "males_aged_45+": 7124,
    "males_under_18": 40,
    "non-us_users": 44847,
    "top_1000_voters": 439,
    "us_users": 11979
  },
  "year": 2011
}