{
  "avg_rating_per_demo": {
    "aged_18-29": 5.3,
    "aged_30-44": 5.1,
    "aged_45+": 5.2,
    "aged_under_18": 5.5,
    "females": 5.4,
    "females_aged_18-29": 5.5,
    "females_aged_30-44": 5.3,
    "females_aged_45+": 5.5,
    "females_under_18": 6.8,
    "imdb_staff": 4.0,
    "imdb_users": 5.2,
    "males": 5.1,
    "males_aged_18-29": 5.2,
    "males_aged_30-44": 5.0,
    "males_aged_45+": 5.2,
    "males_under_18": 5.3,
    "non-us_users": 5.1,
    "top_1000_voters": 4.9,
    "us_users": 5.3
  },
  "avg_screens": 1232.5714285714287,
  "budget": 90000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 30,
    "month": 9,
    "year": 2011
  },
  "critic_review_count": 314,
  "duration": 113,
  "genres": [
    "action",
    "adventure",
    "fantasy"
  ],
  "gross_income": 21270904,
  "max_screens": 3015,
  "mc_avg_user_score": 5.1,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Conan the Barbarian",
  "mc_negative_rating_frequency": 57,
  "mc_positive_rating_frequency": 58,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mark Holcomb",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "Squeamish types may balk, but the gory cruelty on display here is faithful to the source material and deeply thrilling."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "It has a certain commitment to its cause, and by that I mean it supplies the necessary flayings, slayings, beheadings and, um, a be-nose-ing, all of it dancing to the tune of those amusingly stilted He-Man declaratives - King James Bible cadences applied to comic-book visions. It knows it's a B movie, and gets on with it."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Brutal, bloody beyond belief, and has no socially redeeming value. So it is with a certain amount of guilt that I say it's kind of a wicked blast to watch, especially if you're in the mood for some righteous revenge."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "The film's secret weapon proves to be Freddy Krueger–fingernailed witch Marique, whom Rose McGowan plays with the kind of fuck-it-all brio - imagine a cross between Madeline Kahn in \"History of the World: Part I\" and Lady Gaga - that should garner her a Razzie and an Oscar."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Conan the Barbarian has its small, insipid pleasures, if you're in the mood."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Mr. Momoa has some awfully big biceps to fill. He rises to that task with a pumped physique made for ogling. Thankfully, he also shows glints of self-awareness that can make hypermasculine blowouts like these more watchable and were largely missing from Mr. Schwarzenegger's wide-eyed turn in the first \"Conan the Barbarian\" (1982)."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Rife with the oldest and simplest pleasures of 3-D movies: all sorts of objects fly at the camera, and the climactic battle takes place over a deep, dark chasm. At its best the movie suggests a funhouse at a state-of-the-art county fair; at its worst it's a fairly dumb celebration of brute violence."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "It's mostly noise and splurch and, as I mentioned, aaaaarrrrggggghhhhh!"
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "There's something and nothing for everyone in Conan the Barbarian 3D."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Take away much of the myth, most of the sorcery and all of the humor of the 1982 John Milius-Arnold Schwarzenegger version of the sword and sorcery epic \"Conan the Barbarian\" and you've got an idea what the new  \"Conan\" is like."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "The well-executed picture solves the biggest challenge facing those hoping to breathe new life -- however nasty, brutish and short -- into the 79-year-old franchise by finding an actor capable of filling Ah-nuld's shoes."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 45,
      "summary": "The movie's look is artificially grainy, and most of the scenes are encrusted with CGI - you'd have to chip it away with a chisel to get to anything human or interesting or even remotely fantastical."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "A gaudily ornamented medieval banquet table groaning with junk food and open entrails."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "The bigger problem is that the action literally bleeds together and there's no sense of pacing."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "The 2011 version of Conan the Barbarian looks cheap and feels rushed. The few good elements are dwarfed by a generic, nonsensical plot and shoddy storytelling."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "In today's cultural climate, any remake of Conan the Barbarian can only be considered (a) redundant or (b) a cruel case of rubbing salt in our cinematic wounds. Either way, it ain't a pretty sight – in fact, it's downright barbaric."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "Those nostrils do a lot of Momoa's acting, to be honest. As right as he is looks-wise, Momoa falls short in attitude."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "Conan the Barbarian lives by a pretty simple ethos: He lives, he loves, he slays. What he doesn't do, alas, is act."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "As for the movie itself, it's tolerable."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "A brutal, crude, witless high-tech CGI contrivance, in which no artificial technique has been overlooked, including 3-D."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 30,
      "summary": "The result is a somewhat functional blood feast for the exploitation crowd, but it's hardly a bead of sweat on the original's battered backside. Oh, and the score? Basil Poledouris' bombastic brass is still No. 1."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 30,
      "summary": "There's just not a lot to like here, with the exception of what may be one of the all-time best bad movie lines, one Conan utters to Tamara as a kind of personal credo: \"I live. I love. I slay. I am content.\""
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 30,
      "summary": "There is no purpose to the film other than random blood splattering amid scenes of bondage, primitive savagery and S&M; eroticism. The film is numbing and dumb with its hero indistinguishable from its villains."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "Morgan Freeman's voice is heard as the narrator, which is in itself the stuff of parody. Then we listen and get lost within two sentences, because the narration is so poorly written that Freeman himself probably didn't know what he was talking about."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "Momoa, a familiar face from \"Game of Thrones\" to \"Baywatch,\" has the muscles but not the imposing persona and barbaric presence that Conan requires."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "It shouldn't, in other words, be that hard to make a good Conan movie. John Milius did a half-decent job with \"Conan The Barbarian\" in 1982, but this new film of the same name feels like a half-hearted revamp of virtually any of the Conan rip-offs that clogged up video-store shelves in the '80s."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 25,
      "summary": "The re-whatevered Conan the Barbarian feels unexpectedly low-rent, even with its multi-million-dollar backdrops and ear-splitting, rumbling soundtrack and (presumably post-converted) 3D imagery."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 20,
      "summary": "With the most growling and grunting of any movie this summer - and that includes those apes perched atop the box office - Conan the Barbarian seems at times to have actually been made by barbarians."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 20,
      "summary": "There are swords and sorcery, pirates and monsters, taxed bodices and taxing mythology. In other words, there's the bare minimum necessary to summon this dismal movie into existence."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "I've been a fan of Conan for a while, having read Robert E Howard's original stories and the comic books that have followed. I thought the movie did a good job of capturing the spirit of Conan and while the plot may be formulaic I was still entertained the whole way through. The movie touches on all the staples one would find in Robert E Howard tales and I thought that Jason Momoa played a convincing Conan, able to portray his barbaric savagery and cunning. I enjoyed watching this movie very much and would love to see Jason Momoa return to the screen as Conan.",
      "total_reactions": 4,
      "user": "Xiphus200"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "i think the movies has a very good story and action and every friend of mine like the movie so its a greet movie and it deserves watching but i wish i watch it in 3D",
      "total_reactions": 2,
      "user": "aldoseri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "When you watch a film like Conan what do you truly expect? You need to judge Conan in the correct context, the context of a fantasy action film. From this perspective Conan is truly a brilliant film. I don't approach films like this expecting deep storylines and nobody should. Likewise I'd have thought modern viewers would be familiar with films having their own interpretations of original works. The original Conan would never have worked in film form, hence it NEEDS to be changed. Momoa is simply brilliant for the role set before him. I watched this film because I wanted to see fighting and fantasy and it delivered on those things 100%, I have a passing interest in Howards original works. It's about time movie magazines stopped reviewing action films if they can't review them from a fair perspective. Fantastic film, hope they make many many more.",
      "total_reactions": 1,
      "user": "Tresidentevil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "If you like gory fantasy movies with some of the best action scenes out there, then this is for you, truly fantastic and had me dying to see what would happen next, and the acting is fantastic, especially from the guy who played Conan, and the script is surprisingly well done, a fantastic movie that I would love to see sequels for, a must watch.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "I quite liked this film, more than I liked Captain America: The First Avenger that we watched a couple of days ago. It has gotten some rather disappointing ratings. I obviously disagree.",
      "total_reactions": 1,
      "user": "DarkJedi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "What a wonderful world they have set up, true to the work of Robert E Howard! I just feel like I want to dive deeper into it. I hope they come out with an extended edition. And let's hope they bring more of his fiction to the screen!",
      "total_reactions": 1,
      "user": "Gil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "The director could have gotten a little more out of Conan's dad but that little bit of weak acting aside this is the Conan we have been waiting for - appropriately harsh, cruel, and brutal.  Jason Momoa delivered where Arnold could not.  These so called critics ripping the movie apart are not fit to review comercials promoting crack to crack addicts and probabaly thought Avatar was a deep and intellectual work and not the cheap weak Rousseauian noble-savage space spin off it was.  I would go see this CONAN again - True Grit was the last movie I paid for twice.  Damn the critics - go see this movie.  It was a great time.",
      "total_reactions": 1,
      "user": "Vlahkmaak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Movies are all about what you expect going in.  I expected a lot of cool ***-kicking, and this movie did not let me down.  Conan is hardcore!!  I did not want some huge love story.  That would not have been true to the character.   There was a small love story element there, but at the end, ....I'm not going to give it away, but let's just say they do stay true to the character.  The critics are way to harsh on this movie.  The movie does have its flaws, some obvious, and they could have done more with Conan and the world he lives in, but overall, I went expecting to see a good summer action flick, and this is easily the best action movie that I saw all summer.  If you want ***-kicking and a tough guy lead, then you will likely think this is a good movie.",
      "total_reactions": 1,
      "user": "genericuser8888"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "to me one of the years best it does what  movie a should do entertain, yes the character development is bad and the acting is not all that good but it makes up for it by just being fun the action scenes are just awsome the special affects are good not the best but still good.but  in the end this movie is just bad ass  go and see it.",
      "total_reactions": 1,
      "user": "moviesRawsome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "I like Conan and I like Jason as him, but I think the script is just bad and full of action clichÃ©s. There is no charisma in the characters except Conan. You can have fun with the movie, but it is just because it is Conan. Please, next time pay a real scriptwriter and dont leave your nephew write it.",
      "total_reactions": 8,
      "user": "Follaringo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "They didn't necessarily get Conan wrong, but they didn't quite get it right.  It just didn't make you feel like you were seeing the guy you envisioned when reading Howard's Conan.  But I guess if you came into the movie never having read any of REH's evocative prose, then it doesn't make any difference.  Why does every filmmaker think he has to retell the origin story of the hero?  We never needed to see Indiana Jones' childhood to know that we were about to see another of his great adventures.  And just like John Williams nailed the score for Superman, Basil Poledouris nailed Conan's theme in the original movie.  It just isn't the same without it.  Jason does a passable job as Conan with as little as he was given to work with.  Just nothing new in the same old paternal vengeance motive.  There was never any Conan avenging his father/mother/fellow Cimmerians in any of Howard's work.  Just pure adventure.  Fight scenes were mostly well choreographed and with good blood and some gore thrown in.  And it wouldn't be a Hyborian Age movie without the topless women.  Thanks for that at least.  Did not hate this version of Conan, but wasn't all that pleased with it either.",
      "total_reactions": 5,
      "user": "BrahmaBull"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "The story and sets truly capture the spirit of Robert E. Howard original novelettes. I even think Jason Momoa did well as Conan, despite the script. Action scenes were great and truly engrossing. Besides most of Jason's lines, the dialogue was poor and amateur. If you're an action fan or a true Conan fan (not the crappy arnold movie from the 80s), don't let the professional reviews deter you from seeing this movie. You will be happy.",
      "total_reactions": 8,
      "user": "cyphus4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Critics are way too hard on this film, as if everything needs to be a pretentious art house film from the '60. It's an action film, one I found to be really enjoyable, with interesting foes and bloody visceral combat. Is it as quoteable as the 1982 version? No. Does it have the beautiful soundtrack from the 1982 version that makes it my favorite action movie of all time? No. What I do know is that it was a fun movie released in an age where everything needs to have a tacky political message to be \"recognized\"",
      "total_reactions": 4,
      "user": "TiberSeptim"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Ok. I'm a Conan fan, always have been. I read the terrible critic reviews for this film with a sense of dread as I had tried to keep an open mind and had hopes that the movie would defy expectations and be good. Undaunted, I went to the cinema (albeit with fairly low expectations), and donned my 3D glasses.",
      "total_reactions": 11,
      "user": "Canisrah"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I don't understand why it has such a low meta critic score, I'm was very happy with the movie. Sure it had a couple lines of dialogue that could have been better, but overall it was a fun action movie that captured the spirit of hyboria much better then the old Arnold movies.  I wonder if it would have got better ratings if they ended the movie half way through a story that tends to be the trend.. I'm happy they didn't and it was a self contained tale after establishing conans childhood.  I really hope they make more conan movies. I'm so sick of all the crappy super hero movies that rake in tons of money so they call them \"good movies\"",
      "total_reactions": 7,
      "user": "p1rate"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "I was so looking forward to this movie as a long time conan fan. Sadly this movie completely loses the feel of the original novels and has an incredibly weak story that really doesn't make a lot of sense. As a true fan of conan I found this garbage to be complete dissappointment, at best it is a weak Action movie with plenty of gore, it would probably rate a 5 but as they have further tarnished a great story I am only giving it a 3.",
      "total_reactions": 6,
      "user": "gromit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Let's start off by saying that I have been a Conan fan for many years. I have read the original Howard material as well as both retellings of his saga through the Savage Sword and Dark Horse Conan series of Comics. Dark Horse has done Conan proud. If you have not read the series do yourself a favor pick these compilations up.",
      "total_reactions": 3,
      "user": "toddacoco"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "A waste of a well cast movie.  The Milius/Arnie version was much better and for those of us who read the books, their version was truer to the books.  This new version is a lot of blood and not much more  with no story, which is a shame as if they had a good screenplay it could have been a lot of fun.  Also, why did they bother with 3D?  Save your money and netflix the original version which is 10X better.",
      "total_reactions": 4,
      "user": "Bart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "If you're a fan of the sword and sorcery fantasy genre (like me), this is a movie you definitely want to see.  It's the best fantasy film released since the Lord of the Rings, no contest.  Solid acting and good visuals.  Much more in line with Robert E. Howard's original pulp stories than the 1982 Arnie film.",
      "total_reactions": 4,
      "user": "KalrocVN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Conan the barbarian rocked some socks. There were some incredibly cliche and cheesy moments, and at first I recoiled in horror at these... however, they pulled it off and instead of hurting the movie the cheese aided it. The violence is grim, the characters are potent, the situation is howard-esque and, while a re-imagining of Conan to an extent, it is true to what conan is and is a great movie.",
      "total_reactions": 2,
      "user": "natespank"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "You must see this movie!!! It may not be Oscar worthy according to the \"professional critics\", but who cares?  It's great entertainment, exciting, and Momoa makes a great Conan.  I never listen to \"professional critics\".  If I think a movie looks good, I see it and make up my own mind.",
      "total_reactions": 2,
      "user": "dzires"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is closer to the REH version of Conan then the Ahnuld version from the 1980s.  The music isn't as good and the directing is fairly bad.  There are several scenes that jump without a smooth transition.  That being said it is better than the movie from the 80s.  The action is better.  The choreography and the athleticism of the primary actors is dramatically better than the crowd of bodybuilders populating the 1st movie.  Jason Mamoa can act circles around Arnold.  Ron Perlman does a fantastic job and the kid playing teen Conan steals the show.",
      "total_reactions": 2,
      "user": "ScottishFox"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "This is a movie made by fans of the Arnold original, for fans of the original-- It's a great adventure story filled with otherworldly locations and characters. True to the 80's \"classic,\" there are about 50 lines of dialogue in the entire movie, each delivered with the pith and candor of Mike Tyson's right hook, and if you can't raise your drink to that, I really don't know what to say. The sound and action is visceral and bloodlust-inducing; it really feels like you're right there jamming a chunk of sharpened metal into some hapless grunt's coronal suture, and the score is blessedly Godsmack-free. If you have any love of the original Conan: The Barbarian, you owe it to yourself to see this, but for the rest of you that can't seem to enjoy this, I truly, truly pity you.",
      "total_reactions": 2,
      "user": "Cacophony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "If you go into this film with the old Conan movie in mind, you will be disappointed. This is not as dark and gritty as the original. In stead this is a lusty and muscle filled average romp of sword play. Its not terrible, has its own charm. For some reason my wife mistook it for a comedy and laughed heartily at many of the more campy elements. This was fun, but just an average adventure flick, don't expect much and you won't be let down. Also, there are a number a nice topless scenes, so that's a bonus.",
      "total_reactions": 2,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "Utter nonsense. All the gore and blood tries to mask what a **** movie this is! And why do they keep showing us the names of the locations like we'll remember them? or know where they are?",
      "total_reactions": 3,
      "user": "Rienye"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Being a big Conan fan I was hyped to see this. But although the first 20 minutes were OK, after that it quickly degenerated into a succession of shaky camera action scenes that just left me numb after a while. After it was over I had to go home and watch the original Conan film just to cleanse the pallet.  Seriously.",
      "total_reactions": 3,
      "user": "ivanafter5"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "Watched the movie last night, mainly because I am a huge fan of Robert E Howard, but I also loved the first version with Arnold. I am sorry, but I couldn't believe how bad this version was. Not only did it not follow any of the original Robert Howard stories, but it was just a bad movie. And I love watching bad action adventure films. I typically can watch them over and over again. But this one - I couldn't even finish. No matter how big a fan you are on Conan, Arnold, Robert E Howard, or bad action adventure films - do not waste your time with this one.",
      "total_reactions": 3,
      "user": "Salesdad"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "Wow! Anyone who rated this above me is delusional. To my utmost disappointment, this movie fails on every mark. Primarily the writing, screenplay, and direction drive the rest of this film crew's hard work into the ground like an atom bomb. I am only taking a guess but I think the dialogue must only have taken up a fraction of the film's running time and what it used it did not use well at all.",
      "total_reactions": 4,
      "user": "MrDLandreth"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "The director of this movie forget one simple rule, if  Schwarzenegger played that role, no one can do it again, simple as that, no more comments.......",
      "total_reactions": 4,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "This remake is a big mistake. No one wants to see a remake of Conan the Barbarian. The Arnold Schwarzenegger classic was one of the best, but with a mediocre 3-D movie like this I would rather watch a rerun of Predator. It's boring, dull, and precisely the worst movie of summer 2011.",
      "total_reactions": 5,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "I wwas so pumped for this movie.  I gave all my guys that work for me the day off for us to go watch it at the movie tavern.  Well it was a total flop.  The script and director sucked.  Jasom Momoa can be Conan.  Everything was way to dark.  The dialog could of been so much better.  Heck, Jason can even act unlike Arnold back then.  They lacked the flair and cool characters of the original Conan's.",
      "total_reactions": 5,
      "user": "Koloski"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "I Live.  I Love.  I Slay.  I am Content!  Hilarious!  I'm giving the film a pass because it kept my attention the entire movie.  I didn't look at my watch wondering when it would end.  That doesn't mean it is not without some problems.  The dialog is clunky at times, It is overly gory for my taste, and the horrible wobbly hand held camera work during the fight scenes is frustrating.  However, the acting is pretty good throughout and the bad guys are fun, especially Rose McGowan playing Marique with her deadly sharp fingernails.  I also liked Ron Perlman as Conan's dad and wish they would have featured him more.  The movie also looks good, although the 3D was average.  I would have rated the movie a little higher if the fight scenes were filmed better, but since 70% of the movie consists of fight scenes it gets frustrating.  Still, not as bad as the critics are claiming.  Many critics are saying it is too dark and gory, yet those same critics loved the film 300 with its clunky dialogue and gory fight scenes.  Go figure.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "This movie gave me less than I expected. The most awesome parts were the action ones. It was very bloody, violent and exaggerated, you know, barbarian style. But I didn't really care of the rest. The story was not interesting. I don't understand how you could make this action movie so boring. So, it has the action that you would anticipated, but the story is unoriginal. It was predictable, and the chances are that you already saw those '' cliche '' scenes before. What i'm trying to say is, you will know when the girl (Rachel Nichols as Tamara) will get kidnap, when she will be saved, etc. You will probably recognise Stephen Lang (as Colonel Miles Quaritch, the villain from '' Avatar ''), which he plays Khalar Zym. I thought that Jason Momoa was great has Conan. '' Conan the Barbarian '' is huge disappointment and you will forget it in the next 20 minutes, it's that forgettable. I was really angry wasting my time watching this boring film. There's nothing worth seeing and there's nothing to get exited about.",
      "total_reactions": 2,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "This remake is ok, where as the original is horrible. Jason Momoa was a good choice to play Conan because he fits the part. The plot was ok at best, the action was pretty good and there was a lot of it. Its dramatic side is where this film stuck out.",
      "total_reactions": 1,
      "user": "Jcrank42210"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "It's not that the movie is all that bad, but lets face it... if it didn't try to be a reboot of the Conan franchise it wouldn't have drawn much flack as just a generic warrior movie, but to carry the Conan name on this a major fail. The story was there in the opening but just fell apart once Mamoa walks into the scene, he has none of the screen presence Arnie in the cult flicks that did the licence justice, all the CGi effects in the world can't save this Turkey from a roasting... much like the terrible remake of clash of the titans, sure looks better but it's a very hollow movie that relied on FX over content",
      "total_reactions": 1,
      "user": "HighwayUK"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Just like any remake, you can't help but compare each one with its predecessor. So is the case here. While good old Arnold S. has never had superb acting chops, he still has a commanding presence both physically and performance wise. Neither is the case for Momoa, who just happens to be another boring star that is easy on the eyes. All of his costars are just as forgettable, except for Ron Perlman, who does a fine job as Conan's father. Lang does a decent job as Zym, but even his performance seems lackluster. This one just didn't have the right shoe-fit and I wasn't driven to that wonderful tale of lore, vengeance, and bloody satisfaction that was so prevalent in the original film.",
      "total_reactions": 3,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Ok so first off im doing this movie justice by giving it a 4. This movie was really dumb, the acting was horrible, watched pretty much the entire film without the 3d glasses on, oh and jason mamoa is a terrible actor. The supposed to be cool lines by Conan were supposed, i mean come on, I live, i love, i slay, i am contempt? Omg so dumb. Ron Perlman is a kicka$$ actor but why does he keep signing up for these dumb medieval films? The beginning of this movie was terrible and boring. The only reason i gave this movie a 4 is because the action was actually pretty damn good, whoever was in charge of the action in this film did a really good job but everything else was stupid, story was decent though, but i saw this movie for free because i work at a Regal theater so i cant complain too much, but overall this movie is a dumb fun film. Should be on the scifi channel but too graphic for television, oh and it definitely is #2 in my book for most awkward sex scene, only behind 300. But im doing this movie justice and giving it a 4/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "If you liked the 1982 version of Conan the Barbarian, you will almost assuredly enjoy this one as well. It has everything you want in a Conan movie, copious amounts of violence, gore, and boobs. The opening scenes of Conan's childhood were fantastic. The movie does lose a bit of its momentum after that. But, over all it still a fun movie with enough of action and adventure to keep just about anyone entertained for the entire 112 minute run time.",
      "total_reactions": 1,
      "user": "4toMillions"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "With a dead script ,Powerless acting and Bad direction makes Conan the Barbarian Impossible to enjoy . Most of the dialogues seems so lame . It felt like a Tv movie with Great Visual Effect . Acting wasn't good at all . I thought Jason would do good as Conan but he was worst then AS . Rest of the cast was really really bad . Rachel's first impression was good but later she became so boring .Stephen Lang did really bad as the main antagonist but the worst of all was Rose . Its was a pain to watch her acting the whole time .Nispel's Direction was so bad that its not hard to find his mistakes at all.On the other hand the Visual Effects and the set was the only good thing that kept me through the end . Overall Conan the Barbarian was so disappointing and one of the worst sword and sorcery fantasy film ever.â",
      "total_reactions": 1,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "I have been a big fan of Howards Conan stories for decades now. I was really hoping the low ratings were driven by critics who just don't like the fantasy genre. Unfortunately my hopes were dashed. This is a pretty poorly made movie. The beginning was ok, recounting Conans childhood, but then it went downhill. The movie was very disjointed. It didn't flow smoothly from scene to scene. Plot was weak and the writing was weaker. Even a lot of the action scenes were a big disappointment, because the view was mostly close-ups and you couldn't really see what was going on half the time. So, to sum up, the bad writing and bad directing was not offset by good acting. CGI was cool though. Oh well.......",
      "total_reactions": 1,
      "user": "Kevcb"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "Skip-it - This Conan is just as bloody and violent as the original, but it is also just a cheesy, and without Arnold Schwarzenegger it's more like Limburger.",
      "total_reactions": 3,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "New Conan is not that well how i was expecting. The actors overplayed this one. The useless mystery mask was really useless such as the whole scenario. Very bad movie even its in 3D. Don't watch it, just don't.",
      "total_reactions": 1,
      "user": "DND"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "I have not seen the original film, but this was a complete mess! The acting was terrible throughout, the story was very disjointed and a lot of the violence seemed unnecessary. Having said that, the film is just watchable due to it being funnily bad. I probably won't recommend this film to anyone who doesn't understand the \"so bad it's good\" genre of films.",
      "total_reactions": 2,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "There was no reason to reboot this fantasy adventure classic, but here it is. Jason Momoa plays the sword-wielding savage who travels across mythical times to reek revenge for his father's murder. The key word here is brutalality: back-to-back vicious, bloody battlesâ",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Thanks to all of the negative reviews here I was pleasantly surprised by how much fun this movie was. I thought that the casting was spot on and that the narrative captured the essence Howard's world. I loved the into to young Conan and I thought that Pearlman was ideal for his father. I love the Howard stories, loved the comics, loved the old movies, but I definitely think that people's nostalgia for the old films has been the curse of this one. I couldn't help but appreciate how much practical movie making (real sets, stunts, etc) there was in place of CG. Sure some of the locales were computer generated, but I found that these were done very well and it didn't detract from the experience. This was a fun adventure that I hope people discover later as a cult film. My only gripe with the film is the use of Morgan Freeman as a narrator that drops out halfway through. If there is a narrator, then they should bookend the film, closing it out. Also, Morgan Freeman's voice was not a good choice.",
      "total_reactions": 0,
      "user": "Sandrick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Seen it 5 mins ago. And all i can say is... pure trash.  '' Barbarian, i dont like you anymore'' crappy lines like this everywhere. Actors are mostly **** Rose McGowan is ok. But the rest are stupid. Scenery is so fake and bad. Not even worth pirating this movie.",
      "total_reactions": 0,
      "user": "gasperk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "I'd love to know what happened behind the scenes.  There were obviously some people that 'got it' fighting against some folks who didn't.  I wish I could give this a 10 and 1 for a score, so I'm splitting the difference.  Some wonderful work by the cast, director and art folks...I think they did the best with the script they had.  Right rating, great casting, it missed though, but not by a lot.  Still worth watching, grab it when you can for at least one viewing.",
      "total_reactions": 0,
      "user": "SteamConvert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "This film is not art it is pure savagery. The film has little story just endless head chopping action.  I give the filmmakers this you are never bored throughout the whole film.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Conan: The Barbarian-poorly directed at times and a little to short in my opinion. Besides that, it was adventurous, and exciting. Pretty good, but did not live up to its full potential.",
      "total_reactions": 0,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "The good:",
      "total_reactions": 0,
      "user": "busyrob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "I must say I was pretty excited going into this movie. The trailers seemed really promising and seeing Jason Mamoa on Game of Thrones as a similar type character gave me hope that he could pull it off on the big screen. Unfortunately the movie falls flat. The characters never really developed genuine relationships with one another.  Conan's relationship with his love interest Tamara was forced and left me wondering why she even felt for him. From the first moment they met each other he had a misogynist and disgusting attitude towards her. The friendships and relationships went no where and left me not really caring about what happens to pretty much anyone. I must say Rose McGowan did pretty well as the twisted Marique though.",
      "total_reactions": 0,
      "user": "AD421"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "For me its not a really good movie,but also it's not a bad movie, but there is some problems like the actors aren't good, at the start of the movie when Conan kill the cannibals, he's not with egg in mouth",
      "total_reactions": 0,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "While it does provide a couple thrills, this film lacks some of the things that made the original Conan good. This film is thin plotted and there is not enough character development.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "It just felt like one long action sequence. And a boring one at that. There was virtually no tension throughout the whole film, mainly because we’re told how it would all end quite early on through a monk’s foretelling of the future. But even if this scene didn’t exist, it would still be devoid of tension, since none of the character’s are developed enough to care about. Also, the romance between Conan and whatever her name, felt like a forced cliché. Ultimately this film was quite disappointing. It had all the potential for a nice little reboot, something fresh and entertaining. But it ended up just feeling like a long string of tired clichés.",
      "total_reactions": 0,
      "user": "mako_psy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "I didn't think this movie was even remotely as bad as most people did. The acting wasn't good or anything but it wasn't terrible and I've seen a lot worst. The fight scenes were kinda cool and the story progressed well. I was hoping they would get rid of all that stupid mystical mumbo jumbo and corny sorcery crap but unfortunately they did not and that is really what hurt the movie the most in my opinion. It's essentially a way to tell the story with very lazy writing. Overall, I thought this was an entertaining action movie. There were some flaws like below average acting by the protagonist and the ridiculous magical stuff but I still thought it was a much better movie than the original.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "1) If you are a male",
      "total_reactions": 0,
      "user": "pitoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "One of the better action adventure movies. But as they all lack in plot so did this. It gains a decent score as it did not try to have any sidekicks. The setting were dark and gritty just like the novels",
      "total_reactions": 0,
      "user": "gamerzx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "It was interesting to watch, I can't deny that. What ruined it was the terrible implemented 3D. The film would have been a lot better off without it imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "This is one of the worst movies I have ever seen.  Hardly any plot, any substance, and worst of all it's one of those \"hey lets see how much **** and unnecessary violence with blood and guts galore (ripping peoples organs out and other morbid acts) we can shove into a single movie!\"  This movie is worse than anything directed by Michael Bay (and that's saying something).  I can't give it ANY merit because I absolutely can't STAND it.  This film has successfully sodomized Conan's legacy....if there was one to begin with.",
      "total_reactions": 0,
      "user": "TJD2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Horrible, horrible, horrible. Possibly one of the WORST movie plots in the history of film making and the acting is poor. Boring action scenes, gaaah. No thank you. AVOID.",
      "total_reactions": 0,
      "user": "Everlong"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The ill-conceived CONAN THE BARBARIAN remake is an absolute mess of a film that places bloody violence and over-budgeted effects over character and story. While it attempts to remain closer to the works of Robert E. Howard, it lacks the heart and epic qualities of Howard's writing. The casting is like a bad joke. Jason Momoa may look the part, but his over-confidence and exaggerated expressions come off as being silly instead of stern and powerful. There is no consistency whatsoever in the accents or dialects of the various groups of people that Conan encounters in his travels. The world of Hyboria is dramatically reduced as a result, especially considering how quickly Conan is able to travel from land to land in search of his betrayers. Most of the story and background are related by an unseen narrator, who quickly tries to piece things together for the audience in between the overblown action sequences. Zym is a bland and forgettable villain that would cower before James Earl Jones' Thulsa Doom. What is worse, the grand scheme that has taken him over 20 years of battling and searching to complete is spoiled in one brief and unsatisfying final conflict. This consists mostly of unbelievable feats and unnecessary computerization. The only entertainment comes from the absurd amount of bloodshed and heavy reliance on nude wenches. For mindless sword-fighting and mayhem, CONAN is a serviceable action flick, but in all other ways, it is utterly underwhelming. -Carl Manes",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "This would be the worst Conan movie ever made, if it weren't for Red Sonja. It's just not very barbaric or cool to have a Conan mumble all of his lines.",
      "total_reactions": 0,
      "user": "CaptainAwesomer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "This film is an odd mixed bag. The plot is stupid. The dialogue, for the most part, isn't great. And all the actors, except maybe Ron Perlman, lack charisma in their roles. The pacing of the film is off. On the other hand the film is visually striking, action packed, and the sword combat is really original. The fighting is pretty good, and the gore factor is appropriate for the subject matter. The Conan stories don't have complex plots. They are more straightforward adventure stories and that is one of the nicer things about them. The plot of this film is 50% re-hash of the Arnold Schwartzenegger Conan the Barbarian film with a bunch of new stuff thrown in from the books. The result is awkward. Either commit to the reboot, or show us something completely different! There is something magical about the Arnie film. Its self aware how ridiculous it is, but doesn't let that get in the way. And Arnie's charisma shines through it all. This film is not bad, but a completely forgettable flick by comparison.",
      "total_reactions": 0,
      "user": "Gamed2long"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "A serious downgrade from the enjoyable, yet cheesy flick with Arnold from 1982. Wooden acting, silly story, corny dialogue (bad corny), needles use of 3D and maybe the worst screenplay ever sink this remake/restart and created a huge box office bomb.",
      "total_reactions": 0,
      "user": "Jailhouse_McGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "I went into this movie having only seen bits and pieces of the old Arnold Schwarzenegger film from 1982. Those bits and pieces were enough to tell me that I should expect nothing more than a mindless action movie with a tiny bit of heart. I know Jason Momoa from HBO's Game of Thrones, so I figured it couldn't be too bad. Well, the 2011 remake of Conan the Barbarian is a film that tries desperately to be something it is not: more than just an action movie. Thanks to a dreadful script, it fails miserably.",
      "total_reactions": 0,
      "user": "kof-drop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "This Conan reboot is despicable, not because the performances are flat, and not even because of the sh*t imagery they call visuals, but because of the way it assumes its viewers are all morons. That has gotta be one of the seven deadly sins of movies.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I don't understand all the hate for this movie. I watched the originals and loved them. And I watched this and didn't love it any less. It's not the same as the original and it's not supposed to be. It's a reboot and not a remake.",
      "total_reactions": 0,
      "user": "Dafenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "I read everything about Conan and everything of R.E.Howard production. So let's start with the good things: Momoa fits the role well phisically. The rudeness and the violence is well portrayed. Also, Ron Perlman is a very good actor. Now let's go to the negative stuff.",
      "total_reactions": 0,
      "user": "BrownJenkin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "This movie is by no means as bad as people say. Also don't try to compare it to the orignal movie as it is much different. If you like cult movie and any movies like LOTR or shows like Vikings you will want to check it out. Don't ever listen to critics reviews as they have bashed a lot great movies based on dumb things they get way to nitpicky. Always go with your gut if you think you will like it then watch it.",
      "total_reactions": 0,
      "user": "BluntsRuS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "This movie is based on the comic books and an arnie's fantasy movie, this remake is cooler than the other ones. Conan is badass. It's about a man becomes the barbarian and fights evil with swords. 10/10",
      "total_reactions": 0,
      "user": "SanDiego"
    }
  ],
  "metascore": 36,
  "name": "Conan the Barbarian",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 19,
    "month": 8,
    "year": 2011
  },
  "opening_weekend_income": 10021215,
  "opening_weekend_income_currency": "$",
  "rating": 5.2,
  "rating_count": 84226,
  "rating_freq": {
    "1": 4508,
    "10": 4011,
    "2": 4001,
    "3": 6780,
    "4": 11598,
    "5": 18273,
    "6": 17833,
    "7": 10682,
    "8": 4767,
    "9": 1773
  },
  "release_day": 19,
  "release_month": "August",
  "release_year": 2011,
  "user_review_count": 323,
  "votes_per_demo": {
    "aged_18-29": 27382,
    "aged_30-44": 39344,
    "aged_45+": 7937,
    "aged_under_18": 64,
    "females": 8770,
    "females_aged_18-29": 3852,
    "females_aged_30-44": 3778,
    "females_aged_45+": 856,
    "females_under_18": 8,
    "imdb_staff": 5,
    "imdb_users": 84226,
    "males": 67177,
    "males_aged_18-29": 23293,
    "males_aged_30-44": 35126,
    "males_aged_45+": 6960,
    "males_under_18": 55,
    "non-us_users": 48790,
    "top_1000_voters": 488,
    "us_users": 12573
  },
  "year": 2011
}