{
  "avg_rating_per_demo": {
    "aged_18-29": 7.2,
    "aged_30-44": 6.6,
    "aged_45+": 7.1,
    "aged_under_18": 6.3,
    "females": 7.9,
    "females_aged_18-29": 7.9,
    "females_aged_30-44": 7.8,
    "females_aged_45+": 8.0,
    "females_under_18": 8.4,
    "imdb_staff": 7.0,
    "imdb_users": 7.0,
    "males": 6.7,
    "males_aged_18-29": 6.9,
    "males_aged_30-44": 6.4,
    "males_aged_45+": 6.8,
    "males_under_18": 6.0,
    "non-us_users": 6.1,
    "top_1000_voters": 5.2,
    "us_users": 7.3
  },
  "avg_screens": 637.3333333333334,
  "budget": 2000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 1,
    "year": 2012
  },
  "critic_review_count": 33,
  "duration": 129,
  "genres": [
    "drama"
  ],
  "gross_income": 34522221,
  "max_screens": 1214,
  "mc_avg_user_score": 7.6,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 9,
  "mc_movie_name": "Courageous",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 50,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Moviegoers devoted to faith-based fare will flock to megaplexes for Courageous, easily the most polished production so far from brothers Alex and Stephen Kendrick, the prolific and increasingly accomplished filmmaking pastors at the Sherwood Church of Albany, Ga."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Courageous reveals the duo's growing expertise as filmmakers with its skillful blending of moving drama, subtle comedy and several impressive action sequences, including a well-staged foot chase and a harrowing shootout between the cops and bad guys."
    },
    {
      "critic": "Paul Brunick",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "For now, though, Mr. Kendrick will have to settle for being a good enough filmmaker, content to preach to the choir."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "For all Kendrick's stolidity, he delivers a couple of wrenchingly tender scenes."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "How you like Courageous - an overtly Christian-targeted production about four police officers learning lessons about God and family - will likely mirror how you view church: It's either an overlong ordeal filled with talky sermonizing or an uplifting communion with your deity and values."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Even the logos for the companies involved in its making (Sherwood Films and Affirm Films) and distribution (TriStar Pictures) scream that this will be a message from on high."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Courageous, proves a particularly clunky, tunnel-visioned vehicle whose overbearing, overlong script nearly smothers the movie's quibble-free message."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "The message delivered isn't subtle, with Kendrick delivering toss-away lines that suggest he doesn't even tolerate \"the option\" of divorce. But the bigger message might be that the Kendricks haven't sold out, \"gone Hollywood\" or watered down their Baptist beliefs based on efforts to reach an audience beyond the faithful."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 33,
      "summary": "Courageous literally preaches to the converted, delivering ham-fisted messages of responsibility to the most receptive audience possible."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 30,
      "summary": "Borderline creepy, Courageous endlessly expounds on the importance of God in men's lives but fails to answer the more pressing question of why religious sagas such as this treat subtlety as a sin."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "If anyone is not totally touched by this movie, then you need exactly what this movie is teaching. This movie is powerful & eye opening. I notice some people bashing on the acting. But ya know, those people are missing the point this movie is trying to make. It's not suppose to be about the acting (although I thought they did a pretty darn good job). It's suppose to be about the message. God is the perfect father & although no human is perfect because God made us the way we are, it is still our responsibility to follow him & do as he asks. Try our best to be the best we can be. God gave his only son to die for OUR sins! That's amazing! Could you do that? You dont have to! Because Jesus took that for you! That is something none of us could ever completely fathom. You may call it \"Jesus freak\" or whatever your term for it may be, but I call it following my father who loves me unconditionally. And I plan to show my children that same devotion & to continue to follow my Lord & Savior. Thank you Lord for all the blessings you bestow on me & for sending your only son to die for MY sin. I can never fully repay you but I will spend my life trying nonetheless. I love you Lord. Amen.",
      "total_reactions": 3,
      "user": "TGR1989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "A fantastic movie, it's emotional, funny, sweet, and will keep you hooked until the very end, it's in my opinion a must see experience, and the only reason I'm not giving it a perfect 10 is because it ends way too soon, I wanted it to keep going on because I wanted to see how the characters kept living, honestly I found that I really cared about these characters and their lives, which is something few movies ever attain, they could have stretched two or three more hours and I wouldn't mind, I just wish it never had to end, but like all good things it has to end, a must watch.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This was a dynamic movie that spoke personally to me. The message was one that everyone should hear.I shed more tears than i ever have in any other movie. It seems to be that these film makers are the ones that are courageous. They are willing to address an issue that men and their families desperately need to hear.",
      "total_reactions": 2,
      "user": "tmann"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "So powerful and motivating!  I pray they keep making movies like this.  Proof you dont need violence or well known actors for a great movie!! My husband and I watched together and I cried the whole movie from the wreck on.  Really puts life into perspective and how blessed I am!",
      "total_reactions": 2,
      "user": "Seraphinos"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This film is a much needed breath of fresh air. Christian or not, the message to all the fathers out there is powerful. I read the reviews here and by some critics, and I cannot help but wonder if these same people would dare reproach a movie regarding Hebrew teachings and ways of life because there are hundreds of them out there. Oh my gosh! A movie with a Christian message, must be boring and contains a hidden agenda. This was a fine family movie , period!",
      "total_reactions": 2,
      "user": "gimpycanuck"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I watch a lot of movies and based on the content of this movie, I would say it is the best movie I have ever seen. Sure I have seen better action and special effects, but those things just entertain. This movie speaks the truth loud and clear in a society that prefers indifference to truth. This movie had me crying one minute and laughing hysterically the next! Bring extra napkins with you to this one. ;-)",
      "total_reactions": 1,
      "user": "Qadosh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This is the greatest movie I have seen in a long time!  If only the young fathers or any father would go and see it.  It is so unusual to be able to go and see a movie these days without every other word being a curse word.  I thought the acting was great.  It was sort of like everyday people in my eyes.  GREAT JOB!",
      "total_reactions": 1,
      "user": "cbeck"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Loved this movie.  I normally cannot cry during a movie as a tough guy.  I couldn't help it but one part, I had some tears.  One of the best movies I have seen.  Really challenged me to be a better dad to my kids.  Go see it, but be sure to know that you will laugh and you will probably cry.  Simply Amazing for me.",
      "total_reactions": 1,
      "user": "coolcat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Excellent movie for it's realistic situations and abilty to prod the raw nerve of fatherhood.  If every man lived the way described in this movie the world would be an awesome place.  Just because God and Jesus are referenced doesn't nullify the truth of what fatherhood should be.  If your dad believed in Jesus and also fulfilled his God-given role as a father for you, why would that be offensive?  Anyone who can't see the truth revealed due to their easily offended heart will hate this movie.  I'm not one of those and I loved every moment.  Bring extra Kleenex for your neighbor and prepare to see what being a father is supposed to look like.",
      "total_reactions": 1,
      "user": "firehawk343"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I am decidedly not a Christian.  And I very much believe in the message that this film delivers again and again about the importance of a father's role in society.  And how much it is costing our society when the men do not step up and do the needful.",
      "total_reactions": 1,
      "user": "rao000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Its provides a great message for families and it is very touching. It does suffer from being really slow but its heartwarming.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I already wrote a review..",
      "total_reactions": 1,
      "user": "dalekyarng"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "AWESOME movie.  What I liked was that it was serious, yet had laughable light hearted parts.  Javier made this movie.  Other than Facing the Giants, this is my favorite movie.  The only thing that I would have done different,  is not have the little girl die.  That downgraded the movie for me.  How about having her miraculously come back to life after dying.  That would have been better.  I am sick of people dying in movies.",
      "total_reactions": 1,
      "user": "jbitakis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Great movie! This movie is a christian movie however non Christians will still get wrapped into the story and maybe shed a few tears while they are at it.",
      "total_reactions": 4,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I read the reviewers comments and found them unrealistic and petty. Even stupid in a few cases.  This is a movie with no big names out of nowhere.  Our theater was busy so we chose this movie..... and glad we did.  If this doesn't make you think, like a few of the critics did not, then you are already a lost cause.",
      "total_reactions": 7,
      "user": "Mainer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "How refreshing to get a positive message from a movie?  This movie accurately describes how men are in the western world.  This movie gives hope and inspires how men/father's should resemble our heavenly father.",
      "total_reactions": 6,
      "user": "4robU"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Christian or not, to give this movie a bad review is just wrong. It was a great MOVIE. Did it have a christian theme? Yes. Was it an excellent story, with wonderful actors?? Also yes.",
      "total_reactions": 3,
      "user": "jc15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This was a wonderful movie.  It wasn't a movie you go to expecting great acting, but the message is strong.  It is the kind of movie that every father should go see.  If you leave the theater not feeling different about your parenting, then you probably need some kind of counseling.  I think this would do better if it had been released around Father's Day, but the studio would know better than me.",
      "total_reactions": 4,
      "user": "jkcanewton"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I wish i could have given this movie an eleven out of ten! I believe every dad should see this movie! and i mean even the non-christian dads too! There is one thing everyone has to agree on, christian or not, and that is that the bible, true or not, has good messages and that it teaches a lot of things that would make life better! No, you don't have to get on your knees after you see this movie and repent, but i do hope that anyone who sees this movie goes home and becomes a better dad! I will openly admit to being a christian, and because of that i love this movie that much more. I still hope that the movie has a family impact on you, however. You might deny the bible, but you can't deny the message.",
      "total_reactions": 2,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "it's definitely a great movie for everyone. it's an inspiration on dealing with reality of life. it has humor with all other emotions of daily living. keep it up Kendrick brothers!!!!",
      "total_reactions": 2,
      "user": "ccc7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "As a husband and a father of two boys, this film hits you right in the gut.  Yes, the acting is good but not great, but you should see this movie for the message and the content and not because of the acting.  This movie leaves you knowing that there is more to life than just working, doing the honey-do list, and \"being a dad\".  As they stated in the movie, \"anyone can have a baby, but it take courage to be a father\".  This movie is excellent, and I highly recommend it to all the husbands, fathers, and teen boys out there!",
      "total_reactions": 2,
      "user": "viper162"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Courageous, like many of the Kendrick brothers' previous works, is truly only for the converted (myself included in that group, that doesn't mean that I have to like any Christian film that rears its head). I can't help but to say that this movie did impress me, though. The filmmaking is quite impressive, considering its humble origins. The Kendrick brothers have proved that they have come a long way from Flywheel and proudly show off their more developed sound and production values (this is their first film to surpass the million-dollar-budget mark), but that doesn't compensate for most of the rest of the film. While it is an improvement in subtlety and nuance in comparison to Facing the Giants and Fireproof, that does not make it subtle; it is anything, but. The first twenty-so minutes are not bad, but once Adam and his cop pals start discussing religion, it gets weird. The film verges on being, unintentionally and with good intentions, overtly racist. They meant well, but they need a more observing eye in the editing room saying: \"Do you think we should have made every single bad-guy black, and the poor characters Mexican?\". I believe that this question of unintentional racism could just be over-scrutiny from me, but look over the film again and you might find many plays into stereotypes. Granted, this film succeeds at the actual filming and action a bit more so than I thought it would, I actually enjoyed some of the action when I took it out of the context of the film, but the action may serve two purposes: a metaphor for courage in the home and a ploy to pull in audiences. Once again, this is probably over-analyzing from me, but make note of it. Overall, the message is very powerful, but needs better delivery. Is there any other way to bring out a character's reaction to their daughters' death than through weeping only, I ask? Crying is just fine, but wasn't quite the reaction of depth I had hoped for. All-in-all, if you are a film critic, you will while despise Courageous, a Christian, you will praise it, and if both, you may feel conflicted. This film does need to be seen by the converted to keep the faith, but without any reach to the others, it may defeat the purpose of the message it could have conveyed so well, but I knew it wouldn't be able to.",
      "total_reactions": 3,
      "user": "D-Slice"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "The critics are out of touch with reality. This movie is one of the best movies to be released in the last 20 years. Go see it now!!!",
      "total_reactions": 4,
      "user": "killingspree"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "This was the most bloody awful film I have ever seen. If you have ever been stuck in a church pew when the preacher could not land the plane, you know the kind of pain I am speaking of. The story was predictable, technical mistakes were distracting, and they kept beating the same dead horse until I was ready to jump out of the window. Good thing there were no windows. Ned Flanders would have found this insufferable.  I kept waiting for a collection plate to be passed around. My exceptionally attractive date is all that kept me in my seat. Some day I will want my 2 hours back.",
      "total_reactions": 6,
      "user": "FreeStateMarc"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "Wow... That was painful. So painful infact that I had to create an account so I could tell you of my pain. It started off great ,really had my attention... Then 'screeeech'... movie took a u-turn. Crash and burned. I can overlook average acting if the storyline was good but it was all so corny and predictable with so many stereotypes.  The only feel good moment was when I turned it off. If only God could give my 2 hours back.",
      "total_reactions": 4,
      "user": "Eyesack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Sherwood Pictures' most accomplished film to date, but I found it to be an overly-dramatic bore fest that was 30 minutes too long, making its message less effective.",
      "total_reactions": 2,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "As a frequenter of movies I continue to ask myself one question \"What should I be feeling?\"  Many movies can deliver a great and enjoyable story, but what's lacking is the amount of emotion that the viewer feels.  Courageous is able to bring that feeling of joy, sadness, and relief to the viewer in spades.  Never have I been to a film that's made me want to cheer for the good guys and want to beat the crap out of the corrupt ones.  If there's one thing this movie does perfectly, it's evoke emotion.  Even in scenes that I had no reason try tear up for, I still did, the emotion is just that powerful.  As far as performances go, they're mostly solid, besides a few hiccupy lines I felt as if all the characters were believable enough and allowed for a more immersive experience.  The only problem I found with the film was the story, I felt as if some of the fathers didn't get enough screen time, I don't want to spoil anything for you, but some get waaay less time than the main dad.  This hurts the experience in a way that made it less of a 'band of brothers' ordeal in which they try to become better fathers, and more of a 'I'm a cop who has family troubles and am going to steal screen time from my other cop friends so that they can only tell their awesome stories in montages'.  But as far as the narrative goes it is one that is heavily Christian and heavy on fathering a child.  The introduction scene makes this very apparent, with a thrilling sequence that ties the viewer in and keeps them going for the whole film.  But the movie won't spend all of its time beating you over the head with emotion, suprisingly, there are some very funny moments, one in particular that takes place in a cop car.  This allows the viewer time to break up the tense and emotional atmosphere and adds more life to all the characters, allowing for more immersion, which is always a good thing.  Overall the movie feels very segregated into one section, will non Christians enjoy it?  I'm not sure, it depends on your religious preference, do I think this is one of the best father son movies of the year? Without a doubt.  If you're looking for a great film that will tug at your heart strings and evoke emotions you didn't know you had, you've found it, as far as Film of the Year goes, this is one my heavy hitters.",
      "total_reactions": 0,
      "user": "DrSpoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "@Novictim. Get off you high horse. Calling and entire age group imbecilic just serves to show how ignorant and imbecilic you are yourself. The movie was good and a fair reflection of how people use humour in real life in the face of overwhelming stress and insecurity. I liked it and if that makes me an imbecile so be it.",
      "total_reactions": 0,
      "user": "dave1987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "It's an absolutely brilliant movie that highlights the importance of the family unit in a society that continues to  attack it. Seeing this movie makes you more inspired to understand the bibles perspective on fatherhood. Our Heavenly Father gives us a massive blueprint that we can follow and I feel hugely challenged and motivated to love my family all the more.",
      "total_reactions": 0,
      "user": "Anarion25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Courageous isn't subtle about its message, and it isn't subtle about its religious ideals. But if nothing else, its an enjoyable crime film, and that's something critics shouldn't be negative about. If they're against the ideals the Kendrick brothers uphold, so be it. But they shouldn't hate the film merely because of that- these people are publicly standing up for what they believe in, and that in itself is laudable.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Well, I didn't like every thing about Courageous, but the problems with it mainly serve to highlight the fact that most directors just fill their movies with explosions and car wrecks. Why? because that's easy and people pay to see it. Courageous sets the bar much higher and still comes close to clearing it. That said, there are some major things about this movie I can't help take issue with. I appreciate that they are trying to restore the family and address the problems in society, but they're focus is in the wrong direction. They are blaming the wrong people. Check out my full review here: http://www.walkingtaco.com/courageous/",
      "total_reactions": 0,
      "user": "DoesKnoWillTalk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "First--Why so critical of the acting?--how do YOU look on a video in real life? Remember--so called \"pro\" acting is rehearsed over and over and the script is written for them and the special effects, cameras,  etc--there is NOTHING real about most hollywood movies--least of all the acting.  I think this acting represented what real people are really like more accurately than most hollywood movies do.",
      "total_reactions": 0,
      "user": "newcreation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "This film is long and preachy.  The scenes with the promise ring and contract ceremony are creepy.  Unless you are a far-right, fundamentalist Christian, this film will leave you a little unnerved and wanting your money back.  That being said, it was better than Fireproof, an earlier film produced by Sherwood.  Perhaps they will get it right in the next one if they hire an editor and a script writer.",
      "total_reactions": 0,
      "user": "jcakes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Believable performances and an excellent screenplay make this film an enjoyable piece of cinema. A great blend of action and drama put together to make a thumbs up.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "A very powerful movie showing the struggles parents face and what it takes to be the Courageous spiritual leader of your family....many of us fall short and all can do better starting today.  Don't miss this one/ ....rich in story lines and real life challenges.",
      "total_reactions": 0,
      "user": "Aviaman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "The Kendrick brothers are not afraid of telling the truth. That is why Courageous is such a good film. It is Honest. Also it has some of the best directing and overall production finesse ever for a budget under $ 4 million.",
      "total_reactions": 0,
      "user": "MidnightStudios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Despite violence, Christian fatherhood drama is uplifting.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 42,
  "name": "Courageous",
  "num_weekends": 15,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 30,
    "month": 9,
    "year": 2011
  },
  "opening_weekend_income": 9063147,
  "opening_weekend_income_currency": "$",
  "rating": 7.0,
  "rating_count": 15932,
  "rating_freq": {
    "1": 920,
    "10": 5746,
    "2": 285,
    "3": 327,
    "4": 459,
    "5": 653,
    "6": 1246,
    "7": 2090,
    "8": 2279,
    "9": 1927
  },
  "release_day": 30,
  "release_month": "September",
  "release_year": 2011,
  "user_review_count": 175,
  "votes_per_demo": {
    "aged_18-29": 4507,
    "aged_30-44": 5251,
    "aged_45+": 2837,
    "aged_under_18": 60,
    "females": 3918,
    "females_aged_18-29": 1488,
    "females_aged_30-44": 1335,
    "females_aged_45+": 801,
    "females_under_18": 13,
    "imdb_staff": 1,
    "imdb_users": 15932,
    "males": 9445,
    "males_aged_18-29": 2981,
    "males_aged_30-44": 3858,
    "males_aged_45+": 2003,
    "males_under_18": 47,
    "non-us_users": 3914,
    "top_1000_voters": 164,
    "us_users": 5682
  },
  "year": 2011
}