{
  "avg_rating_per_demo": {
    "aged_18-29": 7.4,
    "aged_30-44": 7.2,
    "aged_45+": 7.0,
    "aged_under_18": 8.0,
    "females": 7.4,
    "females_aged_18-29": 7.5,
    "females_aged_30-44": 7.2,
    "females_aged_45+": 7.2,
    "females_under_18": 9.0,
    "imdb_staff": 4.5,
    "imdb_users": 7.2,
    "males": 7.2,
    "males_aged_18-29": 7.4,
    "males_aged_30-44": 7.1,
    "males_aged_45+": 6.9,
    "males_under_18": 7.0,
    "non-us_users": 7.2,
    "top_1000_voters": 6.3,
    "us_users": 7.2
  },
  "avg_screens": 5.222222222222222,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 3,
    "year": 2014
  },
  "critic_review_count": 67,
  "duration": 82,
  "genres": [
    "documentary",
    "biography"
  ],
  "gross_income": 199274,
  "max_screens": 12,
  "mc_avg_user_score": 7.8,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "Cutie and the Boxer",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 19,
  "mc_pro_critic_reviews": [
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "For all of the eccentricities that come in any telling of an artist's life, Cutie and the Boxer's real magic is in so beautifully telling a familiar story of husbands and wives."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "Mr. Heinzerling is an artist too. The window he has opened onto the lives of his subjects is a powerful and beautiful visual artifact in its own right."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "Zachary Heinzerling's feature-length documentary gathers force slowly, but with such wisdom and calm mastery that I found myself stunned, toward the end, by the beautiful vastness of it all."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "As a documentary and a love story, Cutie and the Boxer is nothing short of breathtaking."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "Heinzerling's beautifully shot, painfully intimate look at the aging couple's struggle to survive amid personal and financial strain is both heartbreaking and intricately profound. This is a story about creative desire so strong it hurts."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 95,
      "summary": "The emotions the Shinoharas’ story inspire are all over the road. It is at times triumphant and warm, then sad and even enraging."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 90,
      "summary": "Although Cutie and the Boxer is one of the most unsentimental and unstinting portraits of marriage ever brought to the screen, there’s considerable hopefulness and love in it, and it illustrates the adage that whatever you can survive will ultimately make you stronger."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 90,
      "summary": "With an intimacy and empathy that's all the more powerful for its modesty, the film investigates the complicated feelings of resentment and affection between wife and husband."
    },
    {
      "critic": "James Greenberg",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 90,
      "summary": "Because Cutie and Boxer resists easy sentimentality, its view of life and love is all the more powerful."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 88,
      "summary": "This remarkable documentary argues that art can also be the glue that binds disparate souls."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 88,
      "summary": "It’s a wonder how Cutie and the Boxer, in less than an hour and a half, manages to say so much about love, life and art. Movies twice as long are often half as eloquent."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 88,
      "summary": "The friction between a couple of still-struggling artists sounds rather depressing, but in fact the film is often funny; it shows that love is present in even the couple’s harshest exchanges."
    },
    {
      "critic": "Simon Kinnear",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 80,
      "summary": "The simple approach teases fascinating parallels between art and marriage: essential to both, it seems, are a thick skin and an optimism verging on madness."
    },
    {
      "critic": "Phil Hoad",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 80,
      "summary": "Alternately rueful and whimsical documentary."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "The love the two have for each other, particularly she for him, is obvious and moving. So, too, is not just the desire to create, but the need to."
    },
    {
      "critic": "Alissa Simon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "Zachary Heinzerling's five-years-in-the-making portrait of Brooklyn-based artists Ushio and Noriko Shinohara is a warts-and-all portrait of love, sacrifice and the creative spirit."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "In this alternately whimsical and grim documentary, Zachary Heinzerling relates the couple’s down-and-out, inspiring saga, which slyly comments on the evolution and ironies of the past half century in contemporary art."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "This elegant movie never reduces or diminishes its subjects, and leaves us to ponder a remarkable truth - that Ushio and Noriko have an abiding love that four decades of frustration, resentment and rivalry have battered but not extinguished."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Funny, moving, honest, and occasionally inspiring, but as a portrait of a talent emerging from the shadow of a more public talent, the scale of the shadow is curiously omitted."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "Cutie And The Boxer chronicles a marriage that’s extraordinary in many ways, and ordinary in one—it’s a constant work in progress."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "Heinzerling allows us to read whatever we want into this picture. The endless struggle for money and professional recognition is either a curse or a raison d’être."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "Unfortunately, Cutie And The Boxer feels the need to contextualize — and possibly valorize — the Shinoharas as artists, which detracts from its portrayal of them as a couple."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s a touching film and a fascinating glimpse into one of those couples you can’t quite believe are still together."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Watching Ushio Shinohara and his wife Noriko make their art, we’re reminded of how much life is inside even the most abstract of pieces."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 58,
      "summary": "Their 40-year marriage seems like more of a trial than this overweening, lightly likable movie acknowledges."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Over the end credits, the Shinoharas, Ushio and Noriko, minor figures of New York's modern art scene, spar together with paint and gloves in a faux boxing match. While both are old, Noriko is a relatively spry chicken compared to her husband, twenty years his junior, and takes it easy on the octogenarian, in a fight that is more about abstract body painting than pugilism. Deceptively playful, the intended metaphor(that for a woman, marriage can be 15 rounds of emotion, and perhaps, physical violence) doesn't quite connect, because Ushio, best known for landing punches laced with acrylics on wall-sized canvases(think: Jake LaMotta as an action painter), fails to provide a catharsis that is satisfying for Noriko, because her husband(the inspiration behind Bullie in her comic book-inspired art) owes it to his wife to hit another sort of canvas, the kind that real boxers meet following a TKO. Cutie, Noriko's alter-ego, is ofter portrayed in the nude, mostly to convey her constant state of poverty, but such hyper-vulnerability hints at the possibility of spousal abuse and infidelities. Was Noriko a living canvas, a punching bag like LaMotta's wife, Vicky, from Martin Scorsese's Raging Bull? In Cutie and the Boxer, not only is the crowd-pleasing fisticuffs coded in black eyes and bloody noses, but also the name of the Shinohara's joint exhibit, Love is a Roar, a title suggested by Noriko that makes Ushio look visibly agitated, no doubt, due to the potential of a nebulous undercurrent that runs beneath the seemingly affectionate appellation. After all, bulls roar. Like the former middleweight champion, Ushio was an alcoholic, who would follow the same predictable downward trajectory of all celebrated men, finding themselves at a loss, after they see their brush with fame finally runs its course. In his halcyon days, Shinohara was a Factory regular, where in one clip, we see him palling around with the pop art impresario himself, Andy Warhol. But for Ushio, it really was fifteen minutes. His art never sold. Despite all the years living abroad in the US, the Shinoharas, longtime Brooklyn residents, are still expatriates at heart; their Japanese mindset  never quite fully subsumed by the cultural norms of the west, perhaps, best exemplified by the woman's adaptation of red snapper into sushi. Red snapper, the antithesis of bluefin tuna, is hardly the sort of fish that would make a cameo in the Jiro Dreams of Sushi. It's ghetto sushi; it functions as the chief metaphor for their destitute state. But out of compassion, Noriko allows the pitiful old man to \"save face\"(a Japanese tradition that allows the man to maintain his dignity), and lets \"Bullie\" remain fully-clothed. After all, their rundown apartment, by itself, is a damning testament to Ushio's flaccid shortcomings as a man and artist, without Noriko having to delve, on the record, into the old man's hidden transgressions during their decades-old coupling. She can afford to be generous. Once a shadow, a wisp of a thing, Noriko, whose comic book panels, now expanded into a narrative-driven mural, in A Star is Born-style, attracts more fanfare than her former mentor's retrograde offerings at the exhibition, correcting Ushio's assertion that \"the average one has to support the genius.\" In Scorsese's Life Lessons, we can see how Noriko, 19, newly arrived from Japan, could end up being impregnated by the much older Ushio, through the prism of the teacher/student dynamic in which Lionel Dobie, a famed modern abstract painter, uses Pauline, his muse, for sex. The short film buys into \"the cult of the great artist\", most chauvinistically in the scene where the unformed female underling, still hot after a fight, melts, eyes softening at the sight of her grizzled and wizened mentor, like a titan at his medium with brush in-tow, attacking the canvas with sweeping strokes. This sort of unconditional adoration and belief in a man's artistic prowess, one postulates, is how Noriko ended up in such an ugly man's bed. At her advanced age, however, some of this worship still survives, as when Alexandra Munroe, a Guggenheim curator, comes knocking on their tenement door in search of a particular \"boxing painting\", transforming Noriko, the artist, back into a sycophant. In Ha Jin's novel The Crazed, Weiya, a student painter, once attached to her older professor, says, \"I'll sell my paintings to support myself. Why should I continue to live under others' thumbs?\" Likewise, Noriko doesn't need Ushio anymore. And arguably, Lee Krasner's career was derailed somewhat by her husband Jackson Pollock. And yet a human being, even a strong woman, needs love for survival. Never mind if that love is flawed. Consider Virginia Woolf, Noriko's hero, who once said, \"Women need a room with a key and some money.\" Sure, Woolf had a locked door and the means to support herself, but she ended up at the bottom of a lake.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "A really interesting film -- reflecting on it, I'm impressed that it managed to raise so many issues about the intersection of art, marriage, sacrifice, parenthood and alcoholism. I enjoyed the various storytelling techniques that drew me into the lives of Noriko and Ushio -- whom I had never heard of before.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Odd movie but one that I couldn't stop watching.  A real portrait of what \"starving artists\" go through.  If you are interested in abstract art, or artists in general, you will appreciate this movie.  In the end though, the movie seemed to be more about Noriko and her relationship with Boxer (named for his paintings in which he wears boxing gloves with paint soaked foam to hit the canvas) and what she has gone through to support and stand by him.",
      "total_reactions": 0,
      "user": "Raygirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "The main characters aren't particularly interesting and the director mostly stays neutral, letting them tell their own story. The end result is a very dull documentary that probably won't change your perspective on marriage or art.",
      "total_reactions": 0,
      "user": "Bestpony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "It was the perfect title name. Cutie (Noriko) is an illustrator and her husband Bullie (Ushio) is 20 years older than her who is a craft maker live in New York city. Usually documentaries about successful people would consider as inspiration. But this movie features two Japanese born couples who are masterful in art and crafts and their unsuccessful career. A good opportunity for us, a lesson to learn from their mistakes in life. Simultaneously, their relationship inspires about how to share happiness as well to face the worst situations.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "I understand how vinyl lovers who write in Starbucks would be amazed by this but I didnt.",
      "total_reactions": 0,
      "user": "rebelmswar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "This is a great little independent film about struggling artists in a loft in New York, but also about a long lived relationship between Japanese-Americans that survives due to RESPECT FOR DIFFERENCES, not taking each other for granted, and value for humanity being three main themes for lasting love. Another film that got snubbed at the oscars, it should and WILL grow on the public over time, because it certainly is a lesser known but exquisite, multicultural gem that is a salient contrast to the American consumer-driven rat race !",
      "total_reactions": 0,
      "user": "pdw123"
    }
  ],
  "metascore": 83,
  "name": "Cutie and the Boxer",
  "num_weekends": 9,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 8,
    "year": 2013
  },
  "opening_weekend_income": 21098,
  "opening_weekend_income_currency": "$",
  "rating": 7.2,
  "rating_count": 3941,
  "rating_freq": {
    "1": 49,
    "10": 259,
    "2": 20,
    "3": 39,
    "4": 71,
    "5": 169,
    "6": 545,
    "7": 1129,
    "8": 1083,
    "9": 577
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 25,
  "votes_per_demo": {
    "aged_18-29": 1213,
    "aged_30-44": 1701,
    "aged_45+": 527,
    "aged_under_18": 4,
    "females": 913,
    "females_aged_18-29": 377,
    "females_aged_30-44": 378,
    "females_aged_45+": 128,
    "females_under_18": 2,
    "imdb_staff": 2,
    "imdb_users": 3941,
    "males": 2570,
    "males_aged_18-29": 818,
    "males_aged_30-44": 1292,
    "males_aged_45+": 386,
    "males_under_18": 2,
    "non-us_users": 1792,
    "top_1000_voters": 89,
    "us_users": 1238
  },
  "year": 2013
}