{
  "avg_rating_per_demo": {
    "aged_18-29": 5.8,
    "aged_30-44": 5.7,
    "aged_45+": 5.6,
    "aged_under_18": 8.0,
    "females": 5.4,
    "females_aged_18-29": 5.4,
    "females_aged_30-44": 5.3,
    "females_aged_45+": 5.4,
    "females_under_18": 7.5,
    "imdb_staff": 8.0,
    "imdb_users": 5.7,
    "males": 5.9,
    "males_aged_18-29": 6.2,
    "males_aged_30-44": 5.8,
    "males_aged_45+": 5.7,
    "males_under_18": 9.0,
    "non-us_users": 5.7,
    "top_1000_voters": 5.7,
    "us_users": 6.0
  },
  "avg_screens": 35.78947368421053,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 8,
    "year": 2012
  },
  "critic_review_count": 151,
  "duration": 99,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 1007535,
  "max_screens": 205,
  "mc_avg_user_score": 5.7,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "Damsels in Distress",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 91,
      "summary": "Even though I'm not sure I understand what Stillman was going for minute-to-minute, I was swept away by how original Damsels is, and how funny."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Damsels in Distress is deliberately and purposefully irrelevant; its irrelevance is its strength. It's zany-in-quotation-marks and also flat-out zany. I laughed until I cried, and you may too (if you don't find it pointless and teeth-grindingly irritating). Either way, Whit Stillman is back at last, bringing his peculiar brand of counterprogramming refreshment to our jaded age."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Damsels contains much that's familiar to fans of previous Stillman films such as 1990's \"Metropolitan\": looping jokes that build on one another, allusions to art and literature, characters who are proudly out of step with the times."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "Welcome Damsels in Distress, an exhilarating gift of a comedy about college, the female intellect, the limitless male ego, inventing a new dance, and suicide prevention."
    },
    {
      "critic": "Miriam Bale",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 88,
      "summary": "The clash of styles in Damsels in Distress is bewildering and then disarming."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "In its own superannuated preppy way, Stillman's comic universe is as singular as Woody Allen's."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Even were it not so delightful, Damsels in Distress, set at a fictional upper-crust college, would deserve a watch for its dialogue alone."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "If it's possible for a picture to be at once ideal and imperfect, then Damsels fits the bill."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Too many movies come to us as preordained cult objects - this is the real deal."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The performances are all terrific - Stillman gets his actors to latch onto his absurdist vibe, then gives them wonderfully rich dialogue to play with."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The film treats depression and despair and young love with just enough gravity so the movie doesn't float away completely."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Stillman writes his own dialogue, and is a master of clever double-reverse wit."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "This is a mannered comedy, more stylized and theatrical, almost surreal at times, and less accommodating to his trademark brand of razor-sharp dialogue."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Even if it did not have other charms, this peculiar, uneven campus comedy would be worth seeing for the delightful felicity of its dialogue."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "It all sounds absurd and simplistic, but I dare you to watch the joyful delirium of the big dance number, set to an old Fred Astaire tune called \"Things Are Looking Up,\" and not to feel an unexpected sense of rosiness. This movie may contain endorphins."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "The thing that Damsels and its damsels value above all else - outside of well-timed, well-phrased, slyly deployed witticisms (Stillman hasn't lost a step) - is sure to rankle mavericks on both sides of the aisle. Forget the economy - it's about conformity, stupid."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Stillman's comeback comedy Damsels in Distress is wobbly and borderline twee, but it deepens as it goes along and becomes rich."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Stillman proves he still knows how to write crackling, articulate dialogue for quirky preppie characters whom he loves laughing at as much as with."
    },
    {
      "critic": "Neil Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Highbrow campus-comedy from long-lost Whit Stillman is a flawed but frequently hilarious comeback."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "These are women who seemed raised on Louisa May Alcott and might have been aspirationally besotted with Jane Austen. But you sense tragedy looming. They're hurtling, inexorably, toward Tennessee Williams."
    },
    {
      "critic": "Matt Mueller",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "A mixed return for Stillman, Damsels is so whimsically out of step it's like a time-travel comedy without the time travel.  Fortunately, Gerwig and some dazzling dialogue save his blushes."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Just as precise and self-consciously precious as predicted. Which doesn't mean it hasn't got moments of charming wit buried under all its archness."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "How much you enjoy Damsels will depend on your tolerance for Stillman's particular brand of duct-taped Sperry Topsider whimsy. It's a comedy! It's a musical! It's a trip down memory lane to revisit the blissful confusion of our - or someone's - college years!"
    },
    {
      "critic": "Joseph Jon Lanthier ",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "While the scenario has all the smirking charm of Stillman's earlier movies, the sobering realities of off-campus life are never even alluded to, and the humor of insularity eventually becomes stifling."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 58,
      "summary": "Gerwig can't make her character come alive, though, and neither can Adam Brody as one of their neediest male cases. In the midst of the froufrou, lovely, stalklike Analeigh Tipton (Crazy, Stupid, Love) is delightful as a student who enjoys being normal and living in this century."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "Damsels in Distress is shockingly tone-deaf. Stillman is still capable of a few amusing quips, but his storytelling is sophomoric."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Stillman inserts chapter headings and written asides into the proceedings, but none of it helps explain what is before us. The authorial voice in Damsels in Distress lacks definition."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Welcome back, Whit Stillman -- with Damsels in Distress, the hipper-than-thou club is back in session."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "A movie sure to reward the filmmaker's most die-hard fans, while doing little to quiet critics who found his work self-conscious to the point of insufferability."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "These are hardly damsels, but the distress will be felt by audiences watching the collection of non sequiturs, twee remarks and tangential vignettes that is Damsels in Distress."
    },
    {
      "critic": "Sam Adams",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Stillman too often substitutes pith for insight, until even that is drowned out by the sound of him chortling into his sleeve."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "You can almost say it simulates an experience of brain injury in the audience: Nothing adheres, nothing connects. It's just nonstop cuteness, poses and emptiness - with nothing logically following from one moment to the next. It would be exaggerating to call it torture, and yet why split hairs?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "I'd put it in 4th of Stillman's four films.  There are 2 or 3 absolutely hilarious/absurd moments, but they certainly don't carry the rest of the film for me.  Style and verbal cadence can only take you so far without  a solid narrative foundation.  I eagerly anticipated this film but was sadly a touch bored by it all.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "Damsels in Distress is perhaps the most pretentious screenplay ever filmed.  I imagine there was a more comprehensible first draft and then writer/director Whit Stillman (The Last Days of Disco) pulled the thesaurus off the shelf and went to work.  These damsels come across more as ridiculous caricatures than actual flesh and blood characters; nobody could retain any sort of patience around people who talk nonsense the way these girls do.  Lily (Analeigh Tipton) arrives as a new transfer student to Seven Oaks University.  During orientation, a group of girls seemingly pick her out at random to join their group; perhaps it is because her name fits the floral naming scheme.  Violet (Greta Gerwig) is the leader of the bunch followed by her one-dimensional acolytes, Heather (Carrie MacLemore) and Rose (Megalyn Echikunwoke).  Violet talks incessantly about the goals of the group which include finding and improving boys who are not particularly good looking or intelligent and staffing the volunteer Suicide Prevention Center.  The answer as to why a somewhat normal Lily would so eagerly say yes to joining up with this gang and rooming with them is not forthcoming, but then again, there would be no film if she did not.",
      "total_reactions": 6,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "I usually like dry, tongue-in-cheek humor. But speaking inane, humorless absurdities with a straight face doesn't make them funny. Several critics have used the word \"twee\" to describe the film; but \"sophomoric,\" annoying,\" and \"of no recognizable entertainment value\" would seem more accurate descriptors to me. Miranda July is \"twee\"; this film was just completely disagreeable.",
      "total_reactions": 5,
      "user": "metamotivcritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "I found Damsels In Distress hilarious and one of the best comedies I've seen recently. The dialogue is razor sharp, the actresses are great, particularly Greta Gerwig's character. I admit there's probably one dead spot in the film, but it quickly picks up where it left off.",
      "total_reactions": 4,
      "user": "j30"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "Completely devoid of real human beings and relatable situations.  Lots of broad caricatures whose lives and relationships serve only as platform for highbrow one-liners.  Clever for no reason and absent of any heart.  Stillman is too busy making fun of his characters to ever allow you to empathize with them.  I am shocked that critics liked this.",
      "total_reactions": 2,
      "user": "jdicksteihn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Easily the weakest of Stillman's first four features, \"Damsels in Distress\" plays like an odd Ivy League reworking of the 1980s cult film, \"Heathers.\" The problem lies with the Violet character (played by Greta Gerwig). Violet is strange to the point of suggesting mental illness and without a strong access character to counterbalance her the audience is left with no one in which to identify. The closest we have to that character is Lily (Analeigh Tipton), the new girl in Violet's social circle, who sees her with fresh eyes. Meanwhile, the other ladies, Heather (yes, Heather) and Rose are woefully underdeveloped characters. They have no significant role in the plot, except perhaps serving as eye candy for campus frat boys (and the audience).",
      "total_reactions": 2,
      "user": "Indiefilmlover"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I had really high hopes for this film, but they were all crushed. To give you a better sense of how it made me felt, I literally looked over at my aunt who went to see the film with me, and said \"That was painful\". I understand some people who watch this film are faithful to the writer/director Whit Stillman, but after this, I will never watch any other films of his. What I thought was going to be a cute romantic comedy turned out to be a pretentious mess. Although I have much love for Analeigh Tipton, her part in the film served almost no purpose. Instead it followed Violet, Greta Gerwig, who is extremely unconvincing as the confident lead of a group of young girls. So much of the editing is long and drawn out. This film is filled with so many fade to black transitions that I began counting them. The film's soundtrack was absolutely horrid featuring the same music track in almost every scene. Also, this film was filled with so many cliches and horrible writing. I think one of these reviews says it best, \"I imagine there was a more comprehensible first draft and then writer/director Whit Stillman (The Last Days of Disco) pulled the thesaurus off the shelf and went to work.\" I also know that other people in the theater shared the same sentiment as by the time the film ended, the theatre was nearly half as filled as when I walked in. If you want to watch this film to feel good about your intelligence level and pretentiousness go right on ahead, but I won't drink the Kool-Aid and instead will say that \"Bio-Dome\" is far more entertaining than this film would ever be.",
      "total_reactions": 2,
      "user": "elleakaye"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "It is said that you should never hit a person when they are down and I am not sure if the same applies to a movie so I will be short. \"Dasmels in Distress\" will definitely be on my list of the year's worst films if not #1.",
      "total_reactions": 4,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "A particularly quirky comedy that has a beat every bit it's own, the most obvious comparison of style I could make is to that of Woody Allen's comedic flourishes, and a sharply written screenplay filled with quick, snappy social insights, that is almost the sole reason to watch. The other reason to watch lies in the inspired performances on display, particularly those of Greta Gerwig and Analeigh Tipton. They both shine here, Gerwig as the bright, passionate leader of the damsels, Tipton as the newest member of the group content with remaining ordinary. Most of the time, it's hard to really get a grasp on what exactly Stilman is saying here, sometimes I'm not sure he's even wanting to say anything at all and is content to just sit back and bask in the absurdity of it all, but the off-beat comic universe that he envelops you in is so secular and wholly original and the style so visually appealing that it's hard to at least not remain consistently interested in 'Damsels in Distress'.",
      "total_reactions": 1,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "On first viewing, I was slightly bored with this rendering of campus life as Stillman had already produced work on similar enough themes with far more wit. The closing dance number (\"Dress Rehearsal\")  was under-practiced and it is clear that our actors are actors, not dancers.",
      "total_reactions": 1,
      "user": "RUCB_Alum"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Clever and touching.  Greta Gerwig was brilliant as the elitist, vunerable, crazy Violet.  This one caught me completely by surprise.  I never used the word doofus in it's plural form before.  Good to know.",
      "total_reactions": 0,
      "user": "martinex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "This is a wonderful gem of a film. I can see why it's so polarising; you either embrace it or are enraged by it. It's all rather silly really, but oh so magical. Dialogue is whip smart and full of honesty, the performances are excellent, and some scenes are just wonderfully funny. Greta Gerwig is wonderful as always.",
      "total_reactions": 0,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "I don't have a lot to add to other bad reviews here.... but I will reiterate that this is a triumph of style over substance. I chuckled in places, but I didn't find it interesting enough to finish. The premise and place is so far removed from reality and so isolated into its own nattering world, you just realize it is not going anywhere new after a little while. But it is engaging enough to watch after that point. I can understand some might like it, but if your newest paramour says this is a great film, be a little worried.",
      "total_reactions": 0,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "This movie looks very much like it was forced on Stillman to get financing because it includes many elements from his '90s trilogy, and fans of Metropolitan etc. could be counted on to fill the seats. Or that was the plan. But to  me it was obvious that his heart wasn't in it. Instead of eccentric the characters now seem unhinged. Most of the time I couldn't even fathom their goals or motivations. Whoever put the wit in Whit Stillman has taken it back. There is none of the clever dialogue for which his earlier films are celebrated. And the (apparently earnest) attempt to make the \"Shambola\" a dance craze to help promote the film smells of desperation. In the event the movie flopped so, alas, I don't know where Stillman goes from here.",
      "total_reactions": 0,
      "user": "heliogabalus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "DAMSELS IN DISTRESS is a very unique film that takes the college comedy formula and turns it on its head.  Stillman does not go for the cliche storyline that so many films like this follow.  He deviates from that, but in doing so, he gives us one of the most original and witty films in recent memory.  So many lines are memorable in this film and I found myself smiling throughout.  Greta Gerwig is very charming as Violet who runs the suicide prevention center.  Violet earnestly believes that tap dancing is a cure for depression and tries to get a dance craze of her own started.  Her sincerity is fun to watch and the other characters deliver great one liners after the next.  I highly suggest you seek this film out, but don't expect some rehash of the genre.  It is a highly original film with a strong and funny voice that is worth repeat viewings.",
      "total_reactions": 0,
      "user": "Rick123"
    }
  ],
  "metascore": 67,
  "name": "Damsels in Distress",
  "num_weekends": 19,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 58589,
  "opening_weekend_income_currency": "$",
  "rating": 5.7,
  "rating_count": 7908,
  "rating_freq": {
    "1": 447,
    "10": 432,
    "2": 320,
    "3": 529,
    "4": 742,
    "5": 1209,
    "6": 1540,
    "7": 1395,
    "8": 917,
    "9": 377
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 55,
  "votes_per_demo": {
    "aged_18-29": 2460,
    "aged_30-44": 3337,
    "aged_45+": 1186,
    "aged_under_18": 3,
    "females": 2428,
    "females_aged_18-29": 1219,
    "females_aged_30-44": 948,
    "females_aged_45+": 197,
    "females_under_18": 2,
    "imdb_staff": 2,
    "imdb_users": 7908,
    "males": 4620,
    "males_aged_18-29": 1208,
    "males_aged_30-44": 2332,
    "males_aged_45+": 971,
    "males_under_18": 1,
    "non-us_users": 4373,
    "top_1000_voters": 193,
    "us_users": 1874
  },
  "year": 2011
}