{
  "avg_rating_per_demo": {
    "aged_18-29": 7.1,
    "aged_30-44": 6.9,
    "aged_45+": 7.1,
    "aged_under_18": 7.1,
    "females": 7.1,
    "females_aged_18-29": 7.1,
    "females_aged_30-44": 7.0,
    "females_aged_45+": 7.2,
    "females_under_18": 6.8,
    "imdb_staff": 8.0,
    "imdb_users": 7.0,
    "males": 7.0,
    "males_aged_18-29": 7.1,
    "males_aged_30-44": 6.9,
    "males_aged_45+": 7.0,
    "males_under_18": 7.2,
    "non-us_users": 7.0,
    "top_1000_voters": 6.3,
    "us_users": 7.0
  },
  "avg_screens": 231.71428571428572,
  "budget": 10000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 5,
    "year": 2015
  },
  "critic_review_count": 144,
  "duration": 106,
  "genres": [
    "comedy",
    "drama",
    "music"
  ],
  "gross_income": 5348317,
  "max_screens": 739,
  "mc_avg_user_score": 6.9,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "Danny Collins",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 31,
  "mc_pro_critic_reviews": [
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 88,
      "summary": "An appealing comedy with an unabashed streak of melodrama, sharp dialogue, and a superb ensemble cast, anchored by a lead performance by Al Pacino in lovable scamp mode."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "A Hugely, irresistibly enjoyable, with star chemistry to spare, genuine laughs and tears, and the bonus of apt Lennon songs on the soundtrack."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 80,
      "summary": "This movie is a narrow character piece that shows Pacino wrestling to reveal layers in a man who's worried he might actually be hollow. He and Fogelman string together dozens of small, perfect moments."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "Danny Collins isn't the most artistic or surprising movie, and Fogelman's appropriation of Lennon's music to explain what's obvious gets stale. But it does contain a wonderful performance by Pacino, when it was debatable if we'd ever say that again."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "By the way, Danny Collins is inspired by the true story of Steve Tilston, a British musician who received a 1971 letter from John Lennon some 30 years after it was written. The gist of the letter was about the same, but all the characters and circumstances are creations of the filmmaker."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Al Pacino sells the heck out of his performance as Danny Collins."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Pacino is irresistible. Whether strutting onstage or wrestling with his drug-fueled demons, he doesn't skimp on Danny's human limits. With nine Lennon tunes on the soundtrack and a new song for Danny to express his creative reinvention, this hilarious and heartfelt movie is an exuberant gift."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 70,
      "summary": "This is Mr. Fogelman’s directorial debut, and an auspicious one; it feels as if he’s long been accustomed to working with actors — with exceptional actors like those he has brought together here."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 68,
      "summary": "On the one hand, the story goes pretty much exactly where you think it will, but at the same time, Danny Collins generates its funniest and most dramatic moments precisely when the characters behave more like human beings and less like moving parts of what’s clearly intended to be a feel-good hit."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 67,
      "summary": "This is the kind of thing that should come effortlessly to Pacino, one of the all-time greats of American acting, but no longer does. In fact, this qualifies as his best and most easygoing film performance in a good decade."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "Comedy, pathos, and some schmaltzy couplets about the changing seasons follow forthwith."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "The lesson of this likable little movie is that it’s never too late to reclaim your integrity."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Danny Collins leaves absolutely nothing to chance. The cast is full of sharp little turns by Melissa Benoist — the girlfriend in “Whiplash” and a future Supergirl — and Josh Peck and Katarina Cas, the latter playing Danny’s bubblehead user of a fiancée."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Danny Collins, like its central character, has a good heart, and sometimes that’s enough."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "There's a delayed-secret hitch in the narrative that hijacks the movie, for better or worse. You don't have to believe any of it to enjoy a lot of it, however."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Like an uneven album, the movie has some harmonious, authentically lilting moments and other off-putting ones."
    },
    {
      "critic": "Elise Nakhnikian",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "The chemistry between Pacino and his cast mates gives this lightly amusing contrivance surprising emotional resonance."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 60,
      "summary": "Hits all the routine beats but is plenty entertaining, with Pacino rediscovering his enviable pizazz to headline a quality ensemble."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Pacino and his director don't get back to basics — given that Pacino plays the title character, an aging rock star who long ago sold out, that wouldn't make sense. But the actor brings such a charming attitude to the role that his performance feels far more genuine than the story itself."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Leave it to Al Pacino to find the good in the mediocre."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Al Pacino’s done so much Acting over the last 25 years (hoo-ah), it’s disquieting to see him digging deep again—often with subtlety—into a rich role with hidden depths."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Beneath the sitcom cutesiness and boldfaced sentimentality, the film manages to keep just enough reality coursing through to stay grounded."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 58,
      "summary": "The movie becomes, perhaps inadvertently, a celebration of selling out."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Pacino delivers his best work in a long time, but it’s contained within an utterly predictable redemption movie that only comes alive when Pacino plays one-on-one scenes with the other members of the cast."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Certainly watchable, but don’t go expecting much in the way of surprises."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Danny Collins is nothing to write home about, but it kept me entertained without too much guilt, and I didn’t wince. By today’s American movie standards, that’s becoming very high praise indeed."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Ostensibly exploring a monumental what-if in a musician's life — a late-career reckoning that aims to make up for lost time — the movie is itself a missed opportunity, especially given that it stars Al Pacino."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "What authenticity Mr. Cannavale and Ms. Bening bring to their roles is the sense of groundedness and integrity for one-note characters in a movie whose screenplay is little more than an efficiently executed outline."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "If there’s a real person beneath Danny’s over-the-top showbiz-lifer persona, Pacino never finds him. Pacino probably still has it in him to do measured, subtle performances, but this isn’t one of them. He’s more mannerism than man, even in some otherwise-relaxed scenes with Bening."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "The spectacle of a dissolute hedonist suddenly acquiring a heart and a conscience late in life is shamelessly, and shamefully, contrived in its emotional trajectory."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "What proves irritating throughout the movie is the sense that Fogelman has chosen the easiest, least interesting execution of a rich premise."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "I love being surprised by a movie and “Danny Collins” does just that and more.  I had expected Al Pacino, as a 75 year old rock star and song writer still doing sold out concerts, to do what has become his ‘hammy’ star turns since “Scent of a Woman” and , admittedly, I enjoy watching him at full wattage. The film starts with that sort of act but takes a turn when he meets the manager of a Hilton Hotel in New Jersey, Annette Bening, and their exchanges of quick flirting, followed by meeting his daughter-in-law, Jennifer Garner, his hyper active granddaughter Giselle Eisenberg and his estranged son Bobby Cannavale.",
      "total_reactions": 1,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Danny Collins is a good directorial debut by Dan Fogelman and is highlighted by a great performance from Al Pacino. Pacino is now known as one of the best actors of all time and this performance is not going to compare to some of his most notable roles but it will continue to impress fans and maybe introduce people to Pacino's past work. Danny Collins has a great plot and its inspired by a true story. There are also many good notable performances in the supporting cast like Bobby Cannavale who probably has his best performance ever. Then you have Jennifer Garner and the delightful and funny Christopher Plummer. Danny Collins is a clichéd film that will remind you of other redemption films but the performances are too strong and the story is too heartwarming to be ignored.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "danny collins may be slightly cliche but it's a really enjoyable movie that showcases the brilliant talents of Al Pacino, Christopher Plummer, Annette Bening and Bobby Cannavale. I really enjoyed the films looks at musicians constant internal crisis of whether success will mean compromise their art and the john Lennon heavy soundtrack is excellent. seriously worth at least one watch",
      "total_reactions": 1,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2015
      },
      "score": 1,
      "text": "Released for free on Amazon Prime, I gave this a go last night. This is one of those situations where I wonder if other reviewers and I watched the same film. The premise, intriguing, is wasted by turning it from what might have been an interesting transformation in someone who has wasted his considerable artistic potential for a successful sell out career in schlock and instead veers into a horribly cliched family drama. Pacino is never believable in this role as an aging rock star. He chews the scenery a bit and overacts, as he usually does these days, but never convinces that he is actually a musician. The few on stage moments are embarrassingly bad, albeit as they are intended to be but in way not intended. The few scenes in which he is writing songs at the piano never convince that this guy could ever sing, making Dylan and Cohen sound like Pavarotti. Plummer does a fine job as Danny's friend and manager, Benning's character makes no sense and while the family is adorable and the considerably able supporting cast does their best, they can't really make up for the hole in the middle of this film. Pacino is miscast as Danny Collins unless having someone look like an aging, over the top mafioso doing karaoke was the aim of the director. If making Yoko Ono a few bucks on the soundtrack was the intention, maybe this films score but, to me, Danny Collins is a muddle at best and the \"what if\" premise is wasted completely. The movie would have worked as well or as badly without it.",
      "total_reactions": 2,
      "user": "TBall"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "A very “iffy” script ultimately does this film in….. The cast (especially Al Pacino who is frequently charming-as-hell but has very little to work with) try in vain to breath life into the film’s not especially  interesting story. What they have to contend with is the ghost of some relentlessly tragic 1930s Bette Davis “soaper” that lurks just out of sight in almost every scene (Bette Davis is going blind/Danny Collin’s son has leukemia/brave Bette is the only one who knows The Secret and now it will die with her/estranged Pacino‘s little grand-daughter has ADHD and Hope’s only hope- her name  IS actually Hope- is to go to the VERY EXPENSIVE SCHOOL her that parents can‘t afford)…..enough already !…..…Another serious problem with the film is that  the director himself seems to participate in the Ga-Ga Celebrity Culture he is exploring; none of the film’s material is presented “tongue in cheek”, there is no subtext; almost everyone in this story is a bit of a starstruck hick-  including the director.",
      "total_reactions": 1,
      "user": "jhep"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "DANNY COLLINS may succeed with the occasional heartwarming moment and a good showing from Al Pacino as the titular musician and flawed patriarch; however, the film falls flat when its shoddy script and predictability are brought together.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Al Pacino is appealing as an aging rock star who decides to reset his life after he discovers he never got from John Lennon. Even though the situation's unique, not a lot about the story is original. Annette Bening provides a charming romantic flirtation and the granddaughter is delightful. It moves along with enuff pluck to occasionally amuse and gradually work its way into our hearts. One of the best things is the soundtrack, which is full of Lennon's wonderful songs. A sweetly charming addition to Pacino's resume.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Its a long time since we have seen Pacino give a \"real\" performance on screen, the last few years seeing him usually go way over the top, and its good to have him back. His portrayal of fading rock star Danny Collins is believable and touching, and his budding romance with a hotel manager is made very moving by having the excellent Annette Bening play opposite him. Throw in Christopher Plummer as his grumpy agent and you have three older Hollywood stalwarts showing the youngsters a thing or two. The only bum note is the song that supposedly made Danny famous - you won't buy it for a second!",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "A 40 year old letter and the road to redemption.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "High hopes for this one as always with Pacino, especially after the relatively good notice, but alas it's flat and predictable.  No surprises, nothing stands out, and the comedy is weak (much missed opportunity there), and we discover what we might have already expected… Al is not a good singer.",
      "total_reactions": 0,
      "user": "AxeT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "Loves all the characters in the movie.  And Al Pacino was superb.  The plot was nothing unsual, but the actors were wonderful.  I watched this movie with a Hennepin County library dvd.",
      "total_reactions": 0,
      "user": "kathytreece"
    }
  ],
  "metascore": 58,
  "name": "Danny Collins",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 3,
    "year": 2015
  },
  "opening_weekend_income": 73200,
  "opening_weekend_income_currency": "$",
  "rating": 7.0,
  "rating_count": 22916,
  "rating_freq": {
    "1": 180,
    "10": 1373,
    "2": 78,
    "3": 167,
    "4": 398,
    "5": 1168,
    "6": 3809,
    "7": 8249,
    "8": 5682,
    "9": 1812
  },
  "release_day": 10,
  "release_month": "April",
  "release_year": 2015,
  "user_review_count": 106,
  "votes_per_demo": {
    "aged_18-29": 6330,
    "aged_30-44": 8976,
    "aged_45+": 3329,
    "aged_under_18": 58,
    "females": 3423,
    "females_aged_18-29": 1214,
    "females_aged_30-44": 1379,
    "females_aged_45+": 611,
    "females_under_18": 18,
    "imdb_staff": 2,
    "imdb_users": 22916,
    "males": 16016,
    "males_aged_18-29": 5058,
    "males_aged_30-44": 7477,
    "males_aged_45+": 2661,
    "males_under_18": 40,
    "non-us_users": 12495,
    "top_1000_voters": 234,
    "us_users": 2600
  },
  "year": 2015
}