{
  "avg_rating_per_demo": {
    "aged_18-29": 4.9,
    "aged_30-44": 4.9,
    "aged_45+": 5.3,
    "aged_under_18": 5.3,
    "females": 5.5,
    "females_aged_18-29": 5.1,
    "females_aged_30-44": 5.5,
    "females_aged_45+": 6.0,
    "females_under_18": 5.5,
    "imdb_staff": 6.7,
    "imdb_users": 5.1,
    "males": 4.8,
    "males_aged_18-29": 4.6,
    "males_aged_30-44": 4.7,
    "males_aged_45+": 5.1,
    "males_under_18": 5.0,
    "non-us_users": 5.0,
    "top_1000_voters": 4.4,
    "us_users": 5.2
  },
  "avg_screens": 24.77777777777778,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 8,
    "year": 2012
  },
  "critic_review_count": 56,
  "duration": 103,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 793352,
  "max_screens": 64,
  "mc_avg_user_score": 6.8,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Darling Companion",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "You don't have to love dogs to enjoy Darling Companion, but it couldn't hurt."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "A pleasant little dawdle and yet another example, in these dog days for cinema, that dogs are a movie's best friend."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 63,
      "summary": "Darling Companion would be instantly forgettable if not for Keaton, who imbues Beth with a sorrow, warmth, wisdom, and rage that feel earned."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 63,
      "summary": "It's fun to watch Keaton and Kline together, bickering and (of course) bonding all over again."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Dog lovers will instantly warm to the handsome stray collie mix, but they may struggle to fully embrace the amiable but toothless adult story surrounding him."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Some summer movies are big, woofing mastiffs. (Think \"Battleship.\") Others are naughty, nipping lapdogs. (\"The Dictator.\") Here, what we get is a calm, quiet basset hound. And, for the most part, it's a good dog."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "This new movie is a trifle, a listless excursion into the luxurious problems of rich, white people."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "Dogs and the women who love them form the warm and gooey center of Darling Companion, Lawrence Kasdan's fitfully amusing comedy-drama."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "The tone is mild, the setting is peaceful to the point of sleepiness, and the stakes are incredibly low, even with the heart-tugging central presence of an adorable animal in danger."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "While it's not a disaster like Kasdan's last film, \"Dreamcatcher'' (2003), Darling Companion doesn't amount to much more than a fairly painless way for the AARP set to spend an hour and a half watching a movie with stars their own age."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "If you found \"Benji the Hunted\" unbearably intense or \"Marley & Me\" a bit too hard-edged, then Darling Companion may be the dog movie for you. On the other hand, if you like to watch cute pooches doing cute stuff on screen, you may be a little disappointed."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "It has a gentle if unenlightening message, namely that we should all take time off to reconnect - the soundtrack tends to the Bonnie Raitt but the movie seems to subliminally hum \"slow down, you move too fast\" - and Keaton and Kline have decent chemistry."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "There's too much people and not enough dog in Lawrence Kasdan's Darling Companion, and even if you prefer people to dogs, that's a serious problem."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie is not about the dog. It's about the people who find love, settle their differences, and get their priorities straight while searching for him. Still, when all is said and done, the dog is the only thing you care about in Darling Companion."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "If you can stay awake, you'll see a performance by ­Keaton that is radiant in its simplicity, all ditheriness shaken off. She's still ­peaking - ­someone give her a great role."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "While superbly acted, the dramedy plays out like a tepid \"Big Chill\" at best."
    },
    {
      "critic": "Lael Loewenstein",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "It meanders about as much as its eponymous pooch."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Lawrence Kasdan's comedy strikes a note of rib-nudging blah coyness that feels very 1987."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 42,
      "summary": "The whole thing has the feel of a fact-based dinner-table anecdote absurdly puffed up to feature length."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Like Freeway, the lovable stray dog at the center of this very teary comedy, Darling Companion has lost its way. Even the marquee ensemble anchored by Diane Keaton, Dianne Wiest, Kevin Kline and Richard Jenkins is not enough to rescue this motley mutt of a movie."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "The doggie in Darling Companion is a big, warm bundle of puppy love; his owners are lost forever in a big chill."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "The handsome pooch is also the only appealing aspect of the latest tale of privileged boomer pulse-taking from Lawrence Kasdan."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "The story's treacly all-souls-in-alignment outcome is never in doubt, but as Kasdan dogs go, this is light-years better than Dreamcatcher."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 38,
      "summary": "The film's filled with inconsequential scenes and supporting characters who add useless atmosphere or by-the-book diversity."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "The film sputters and stalls and winds up behaving like the worst sort of oldster – passing gas and pretending to be deep."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 30,
      "summary": "Jenkins is a fantastically adaptable talent. It helps that his character here is supposed to be innately likable (by everyone, evidently, but his girlfriend's family), since Jenkins is so likable as an actor. Good thing, because there is little else to like about Darling Companion."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 30,
      "summary": "Initially this struck me as something you'd take your grandmother to see, but by the end it seemed more like something your grandmother would take her grandmother to see."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 30,
      "summary": "The movie uses the mutt's disappearance as a frame on which to hang a well-worn package of fatally mild domestic disorder, then resolve it in what feels like real time. Let's just say that the dog gets the best lines."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 25,
      "summary": "It is depressing to reflect on the wealth of talent that conspired to make this inert and listless movie."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 20,
      "summary": "The folksy shenanigans are well-intentioned but frankly interminable, with Kline's wry efficiency the best relief from all the yowling and whining."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 12,
      "summary": "A lost-dog drama so insufferable it makes one wish its human characters would also run off and never return."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "At the end of Darling Companion, Beth is reunited with her dog, which would be a whole lot more touching had she not terminated her search for the mutt. For Beth, it's just gravy, getting Freeway back, since the film's title, as it turns out, alludes not to the dog she rescued alongside a busy interstate, but her husband, Joseph, who was more provider than partner, before the occasion of the animal's disappearance forces the busy professional to spend time with his neglected wife. While searching, the two can finally talk, hashing things out between the interruptions, which range from big horn sheep to the dislocated shoulder that Beth resets for her egotistical husband. Now that Beth has his attention again, Freeway is less in demand as a surrogate for the doctor's wife to pour her extraneous love on, evidenced by her boarding of the twin-engine plane after calling the search party off, leaving behind the dog to fend for himself in the Rockies. Earlier, when Joseph tells Beth that she has \"no sense of proportion,\" her indignant wife replies, \"Love is love. It doesn't matter if it's a dog,\" but apparently there is a difference, reminding the audience of her affluent lifestyle. Beth's capacity to love a mongrel, and not some purebred dog with a pedigree gave her depth, but when she abandons Freeway, her distinction of being a relatable person, compassionate and open-minded, which separated her from the others is gone, and we realize that this woman has the potential to be a snob, just like her husband, who disapproves of his sister's new beau, a working class stiff named Russell. Losing the dog turns out to be a blessing in disguise. Beth found her husband; she's no longer the lost person we meet at the outset. \"Would you be leaving if I was missing?\" asked the old Beth. This new Beth, loved again, by love that matters, now shares her husband's sense of proportion. She's a hypocrite, and this filmmaker, earlier in his career, would have called her out for it. This is not, however, Grand Canyon, the 1991 film in which a movie producer, Davis, vows not to make any more violent films after an attempt is made on his life. Once his gunshot wound heals, however, the L.A. phony goes back on the dogma he temporarily advocated. A century later, the filmmaker seems more leftist, saving Beth from Davis' fate as a satirical target, when by dumb luck, she spots Freeway from her airplane seat, and becomes an accidental hero by concocting a fake emergency to fool the pilots into landing. Despite a reunion straight out of Lassie Come Home, a violent animated sequence, in which Beth sees her domesticated pet engaged in the dog eat dog world of the wilderness, exposes a gap that the film doesn't quite cover up. Has Freeway turned feral? Unaware to the film, this nightmare could be a vision that Carmen, a self-described clairvoyant, passes along to Beth, suggesting in Freeway a temperament less on par with a collie than a bull terrier, the breed featured in Baxter, a 1989 French film, whose anthropomorphism is unusual for its anti-Disney idiosyncrasy of having an animal depict the baser side of man. Baxter kills, with premeditated cunning, to escape detection, first, pushing his owner down the stairs, a rebuke to the old lady's attempts to domesticate him. Later, he tries to stage an accident with a young couple's child. During the aforementioned animated sequence, Freeway is the hunted, but after a days-long stint in the woods, perhaps, he's the hunter, as well, a changed dog, belying the lack of physical wear-and-tear and noticeable trauma when Beth finds him. But things have changed since Freeway last saw her. How will the mutt react when he realizes that the doctor is Beth's real darling companion? Like Baxter, he's been replaced. In this case, by a big baby. The bull terrier's last owner, a Hitler-obsessed kid, comes to see the dog as a Jew, and kills him. Similarly, Beth, married to an alpha male, may see mongrels as inferior to pure breeds, now that she's regained her husband's respect. A commonality to both films, posits the owner, and not just the dog, as lost. Only Beth, however, is found. The rich always win. The film plays like the 1% version of Wendy and Lucy. Long before Lucy disappears from her post outside the grocery store, it's Wendy who gets lost, exemplified by a long-take in the opening minutes, where the young woman plays with her dog as they make their way through the woods. The Oregon wilderness seems incongruent to the Indiana plates on her car. \"I'm lost,\" reads her flier for Lucy, which is applicable to her situation, as well. Like the boy in Baxter, Wendy doesn't resemble her dog, she has become her, a stray. Wendy needs food and water, too. In the end, Lucy is found, but Wendy stays lost, leaving her darling companion behind, in a yard, owned by a kindly old man. Conversely, Beth has everything. Getting her dog back is just showing off.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "In his first movie since 2003, writer/director Lawrence Kasdan has created a mature tale of relationships and a dog. Diane Keaton rescues a lost dog and takes him home to husband Kevin Kline. Life is good until the dog gets lost on vacation, which calls into question their marriage. The solid cast does a nice job and the pacing never lags. You'd think that with a dog as the center conceit, it would certainly be sweet or touching, but it's just pleasant. There are a few mild laughs, but overall, it's unmemorable.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Excellent movie!! Watched it with my husband and really touched us! We also got 2 stray puppies which we rescued from the streets, and once, the small one got lost because of my husband and I told him \"if the dog doesn't appear, since it is your fault him getting lost, you have to leave the house!\" jajajaja Thanks God my baby appeared and its been almost 5 yrs from this ;) EVERYONE SHOULD SEE THIS MOVIE!! Shows a lot of values, lost these days....",
      "total_reactions": 0,
      "user": "skylar_rose29"
    }
  ],
  "metascore": 41,
  "name": "Darling Companion",
  "num_weekends": 18,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 39962,
  "opening_weekend_income_currency": "$",
  "rating": 5.1,
  "rating_count": 2644,
  "rating_freq": {
    "1": 193,
    "10": 169,
    "2": 127,
    "3": 195,
    "4": 351,
    "5": 581,
    "6": 512,
    "7": 307,
    "8": 140,
    "9": 69
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 25,
  "votes_per_demo": {
    "aged_18-29": 471,
    "aged_30-44": 972,
    "aged_45+": 853,
    "aged_under_18": 3,
    "females": 892,
    "females_aged_18-29": 232,
    "females_aged_30-44": 356,
    "females_aged_45+": 266,
    "females_under_18": 2,
    "imdb_staff": 3,
    "imdb_users": 2644,
    "males": 1455,
    "males_aged_18-29": 232,
    "males_aged_30-44": 606,
    "males_aged_45+": 571,
    "males_under_18": 1,
    "non-us_users": 1236,
    "top_1000_voters": 115,
    "us_users": 754
  },
  "year": 2012
}