{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.4,
    "aged_45+": 6.5,
    "aged_under_18": 7.1,
    "females": 6.6,
    "females_aged_18-29": 6.7,
    "females_aged_30-44": 6.5,
    "females_aged_45+": 6.5,
    "females_under_18": 7.7,
    "imdb_staff": 5.7,
    "imdb_users": 6.5,
    "males": 6.5,
    "males_aged_18-29": 6.6,
    "males_aged_30-44": 6.4,
    "males_aged_45+": 6.5,
    "males_under_18": 6.9,
    "non-us_users": 6.5,
    "top_1000_voters": 6.0,
    "us_users": 6.5
  },
  "avg_screens": 883.8333333333334,
  "budget": 30000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 12,
    "month": 4,
    "year": 2013
  },
  "critic_review_count": 221,
  "duration": 118,
  "genres": [
    "action",
    "crime",
    "drama"
  ],
  "gross_income": 10880926,
  "max_screens": 2188,
  "mc_avg_user_score": 8.8,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "Dead Man Down",
  "mc_negative_rating_frequency": 10,
  "mc_positive_rating_frequency": 213,
  "mc_pro_critic_reviews": [
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 83,
      "summary": "Oplev composes shots with grace and an understanding of where everything is geographically and how scenes relate to each other in the multi-threaded plot. Like everything else in Dead Man Down, his direction is beautiful and brutal at the same time. Whoever thought that this movie would be as entertaining as it is existential is either lying or psychic."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Lumpy title, lively movie. Dead Man Down proves to be a frisky gangster flick cum elaborate thriller cum off-beat romance. Yep, there’s a whole lot going on here, but this is one of those plot-heavy scripts that carries its weight with confidence – the intricate twists don’t cheat."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "The tone and pacing of Dead Man Down have a distinctly European flavor, which may explain why American viewers, used to having background and exposition pared down and cleanly delivered, may feel adrift at the outset."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "A pleasingly intricate double (or is it triple?) revenge plot anchored by excellent acting, with a terrific burst of action at the climax."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "With so many twists, the movie feels like it's trying too hard. Some moments are cleverly constructed; and others seem as if the filmmakers have left themselves no plausible escape."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Before it devolves into typical American-style action, there’s an intriguing, European-style complexity to Dead Man Down."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "More of a character-etched mood piece than a tautly calibrated caper, Dead Man Down benefits from potent visuals and a compelling international cast that also includes lead Colin Farrell, Terrence Howard and Isabelle Huppert."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 55,
      "summary": "J.H. Wyman's script is grim and fairly audacious, without anything so goofy as the silliest stuff in \"Dragon Tattoo.\" The story involves some Grand Guignol violence, but its wildest notion is that a suicide-mission plot might somehow yield a happy ending."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "More a dark fairy tale about vengeance than the action-packed crime thriller it purports to be, the film is at times exhilarating, bold, and beautiful — when it’s not busy being ludicrous, fragmented, and just plain stupid."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "As a gritty thriller, Dead Man Down doesn't stand out among its bullet-riddled brethren."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Dead Man Down, unfortunately, turns out to be too innocuous to qualify as either actually good or delectably bad."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Before this urban revenge melodrama falls apart in a clatter of plot absurdities and pretensions, it has its loopy charms."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 42,
      "summary": "Dead Man Down is actually mildly entertaining, without being particularly fun."
    },
    {
      "critic": "Trevor Johnston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "A way-too-leisurely thriller whose destination is fairly obvious from early on, but to which the talented cast apply themselves with effortful seriousness."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s clear this director sees carnage as nothing more than an opportunity for music-video production values."
    },
    {
      "critic": "Keith Phipps",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "A long, dull swim through narrative syrup interrupted occasionally by poorly choreographed acts of violence. It’s essential only for those wanting to hear Farrell try on a Hungarian accent."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "Rapace is all over the place with her performance — needy, then self-assured, enraged, then in love. The always feral Farrell seems as dismayed by her as the rest of us."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "The film has been directed in a murky, rhythmless fashion by Niels Arden Oplev."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 33,
      "summary": "Dead Man Down exerts an unconscionable level of effort for minimal reward: It aspires to exquisite world-weariness, but just ends up feeling exhausted by its frenzied yet fruitless exertions."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "It's all so much turgid brooding, dialogue underlined with import, and leaden symbolism involving Rapace's white and red dresses, none of which is salvaged by a typically understated Farrell performance."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "The action merely meanders when it should be hurtling forward, running in circles when one expects it to head toward a conclusion or some sense of resolution."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "Director Niels Arden Orpev was in charge of the original \"Girl with the Dragon Tattoo,\" starring Rapace, but fails to create a revenge thriller with anything like the same focus."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 20,
      "summary": "As Scandi directors go, Niels Arden Oplev couldn’t be hotter. After putting his stamp on “The Girl With the Dragon Tattoo,” the Dane has what appears to be his pick of projects. So why follow it up with such revenge-fantasy dreck as Dead Man Down, a derivative collection of brazen plot holes and latenight-cable cliches into which he drags “Dragon” star Noomi Rapace?"
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 12,
      "summary": "While a mob thriller can be as nasty as it likes, what it can’t be is silly."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "A strong character piece filled with developed and visually distinct characters in this police-less gangland. The romance is genuine and the acting is to a tea. Everyone succeeds in their prospective roles interestingly and with panache.",
      "total_reactions": 11,
      "user": "Lobster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This movie was done an injustice by critics, I found the movie highly emotional, dynamic and intelligent. I felt the scars on my face when Beatrice looked at them in the mirror and when she ran her fingers down her reconstructed face, I felt victor's pain when he mailed the picture squares and watched the home videos. The movie had a lot of plot twist and dramatic moments that were not predictable in the slightest. Great movie, would have gotten a 10 if not for the a few minor things.",
      "total_reactions": 6,
      "user": "Winged11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "This is one of the very few cases I strongly disagree with the critics. I can´t believe such a low rating as 39/100 for a film like this. It´s not the best and it´s not very original, but it´s still good. The worst part would be the done to death revenge story the male character is planning. But the rest are good things: great acting, both Colin Farrel and Noomi Rapace show commitment and deliver what we expect from them. Both have a really great career at this point. Noomi is particularly fascinating to watch in any role she takes. The thing I´ve seen people hating on the most is the pace, and I have to say I didn´t have a problem at all with it, perfect to me. At the end you also get big action scenes, so that should make action lovers happy too. Good film. One of the few cases it is better than what you expected.",
      "total_reactions": 1,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Director Oplov has done it again! Dead Man Down is unusually brilliant. The paced movie packs up a lot in its 2 hours but it keeps you hanging till the end. Terence Howard is the actor that nailed it in the film. And when this movie ends you don't want it to.",
      "total_reactions": 9,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Dragon Tattoo director falls over his own shoes while trying to create a good environment and character set up for this film. The Mood felt less revengey and more lets talk and then cause of action that people don't exactly want to see.",
      "total_reactions": 2,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "\"Any Movie that comes out of WWE Studios cant be good.\" That's usually my response when I see the WWE logo during a film trailer. This film however is nothing like any film that has come out of that studio. Dead Man Down is smart, WAY smarter than I thought it was going to be. I decided to take chance and catch the midnight premier of this film because of the Cast, I just had this feeling that Noomi Rapace wouldn't take an awful roll. I was right. The pace is fantastic, It's not a full throttle action film. The action is placed perfectly between good character development and pleasing dialog. Noomi Rapace is BRILLIANT. After seeing her in Prometheus and Dead Man Down, I can confidently say she's one of my favorite actresses. She captures emotion like no other. Something about her performances just captivate you. My one complaint would be that I wanted better, cleaner kill shots. The violence is kind of Teen Rated video game like, Not that it doesn't work, Like i said the action is just right, but the execution is a little off. Being an action film fan maybe I'm spoiled by such violence in the Expendables and Django. Bottom line, This movie is a hell of a lot smarter than the critics are saying it is. If you want a film that keeps you entertained in all the right ways, give it a shot! It may have you leaving thinking the same thing that was in my head:  That was a WWE Film?!\"",
      "total_reactions": 2,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Dead Man Down is the worst kind of film, one written hastily with so many side plots and themes that the central concept gets lost in translation so much that it takes literally a third of the film's run time before you find out that the films even about revenge. The film follows Victor (Colin Farrell), a local kingpins right hand man who is planning revenge against the men who killed his family. However when Beatrice (Noomi Rapace), his neighbour witnesses him murder someone in his apartment he is forced to do something for her that may mean his downfall or his salvation. There is no nice way to say it, this is a bad movie, it lacks believable characters, a decent draw and a reason to root for the central character, in fact for the first 30 minutes he just murders people with no justification behind it just because they have guns (because that's a reason to kill anyone in action films apparently). Now Colin Farrell isn't a bad actor, in fact he's quite a good one but he needs the right material and the script in Dead Man Down is just confusing. It's filled with nonsense twists that just make its two leads seem like schizophrenics as it supposedly builds to a tepid finale filled with fake emotions and ridiculously overworked messages that are so heavy-handed it just annoys you. It's filled with uninvolving resolutions and one of the dumbest final conversations in movie history. Rapace has to cope with the worst of it as her character flip flops around unsure on what she is doing, so much so that in one scene she is hitting on Victor and then suddenly she starts yelling at him for no reason, none whatsoever. It's not just a poor script though, its so poorly filmed and packaged it doesn't even qualify as an action film because those scenes are dull and unimpressive. It;s a poor picture unworthy of its two leads.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "The movie was okay, but I didn't really like the main character. Yeah, he wanted revenge and all, blah blah blah. I actually watched the movie for Noomi Rapace, and she did a pretty good job. Other than that, the plot was kind of blah. I'm giving this movie the score I did because I watched the movie all the way through.",
      "total_reactions": 1,
      "user": "Fullmetal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "A really average movie. This was the way I felt about the Euro-version of Girl with a Dragon Tattoo (same director as this movie). It wasn't terrible, but it never really broke out as fully entertaining. I guess it is better than sitting in a bus stop watching the dregs of humanity fall over themselves while trying to walk and breath at the same time. What is most striking in this film is that Colin Farrell didn't completely ruin it as is his usual impact films. Before anyone tells me they like Colin Farrell go watch Alexander...enough said. Here he was serviceable which for him is a darn near Oscar caliber tour de force of acting.",
      "total_reactions": 3,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The movie looks good and has some decent ideas for a story, but some poor dialogue and some scenes that made no sense makes this film mediocre.  My one big issue with the film is the supposed scaring on Noomi Rapace's face in which children run over just to throw food at her and scream monster.  Really! C",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "This is movie a boring confusing mess.Although the action scenes are cool and had some good moments,the movie is just boring and makes you confused with the plot.",
      "total_reactions": 1,
      "user": "ICEExMagic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Many new to this particular film.",
      "total_reactions": 1,
      "user": "Firebala"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "You know when a movie trailer looks one way, but the movie is a whole different thing? Bingo! Colin Farrell broods as he does so well, as a man who's plotting revenge on the gangsters who killed his wife and daughter. To drag down the plot, we suffer thru an awkward relationship with a damaged woman (Noomi Rapace). While there are three short spurts of action, there's more than 90 minutes of brooding character drama. Slow, gloomy dialogue. Long, lackluster encounters. It's really not worth suffering thru it just to see a truck drive into a house.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Farrell is solid and difficult to criticise as the dark avenger, while his lover and cohorts help push this badly paced story of revenge across the finish line with mixed success. The fact I don't think it wasted my time is probably the best merit I can pin on it, and it's shockingly good for a film that is endorsed, but not blatantly influenced, by WWE studios. I suggest you sit down and digest it with a smatter of salt.",
      "total_reactions": 0,
      "user": "RUST"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Despite all of its hate, its a pretty good movie. Oplov takes all the good actors that he has corralled around him and manages to insert mean & gritty action, along with its revenge plot. All of it clicked and worked to make a very enjoyable film. It wasn't the best, by any means, and certainly could have been better, but for what it was, it was exciting and fun.",
      "total_reactions": 0,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Colin Farrell certainly knows how to pick good projects as he's done so since 2009. I've enjoyed the last seven of his movies including this rather interesting gangster flick with the talented Noomi Rapace co- starring. There are two reasons for me seeing this Niels Arden Oplev film because he directed Noomi in the well known 'Girl With the Dragon Tattoo' then there is the fact that he's in production on a Stephen King film  'Under The Dome' and being a 'King' fan I was keen to see how it might be handled. The Dane is definitely one of the better directors out there and done a great job on 'Dead Man Down'. It certainly had a strong eastern European look and feel which made for a tight, gritty action laden thriller that had me enjoying every minute.",
      "total_reactions": 0,
      "user": "NavQ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Dead Man Down is Oplev demonstrating the same great cinematic sense he did with Millenium Series, and that revenge is never a straight line, it's a thorny bramble.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 39,
  "name": "Dead Man Down",
  "num_weekends": 6,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 3,
    "year": 2013
  },
  "opening_weekend_income": 5345250,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 55987,
  "rating_freq": {
    "1": 578,
    "10": 2882,
    "2": 408,
    "3": 865,
    "4": 2023,
    "5": 5738,
    "6": 15048,
    "7": 18341,
    "8": 7810,
    "9": 2294
  },
  "release_day": 8,
  "release_month": "March",
  "release_year": 2013,
  "user_review_count": 130,
  "votes_per_demo": {
    "aged_18-29": 17142,
    "aged_30-44": 24462,
    "aged_45+": 5779,
    "aged_under_18": 48,
    "females": 5825,
    "females_aged_18-29": 2272,
    "females_aged_30-44": 2501,
    "females_aged_45+": 648,
    "females_under_18": 10,
    "imdb_staff": 6,
    "imdb_users": 55987,
    "males": 43451,
    "males_aged_18-29": 14709,
    "males_aged_30-44": 21641,
    "males_aged_45+": 5019,
    "males_under_18": 38,
    "non-us_users": 31504,
    "top_1000_voters": 345,
    "us_users": 7404
  },
  "year": 2013
}