{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.3,
    "aged_45+": 6.5,
    "aged_under_18": 7.2,
    "females": 6.9,
    "females_aged_18-29": 6.9,
    "females_aged_30-44": 6.8,
    "females_aged_45+": 6.9,
    "females_under_18": 7.2,
    "imdb_staff": 8.5,
    "imdb_users": 6.5,
    "males": 6.2,
    "males_aged_18-29": 6.3,
    "males_aged_30-44": 6.1,
    "males_aged_45+": 6.4,
    "males_under_18": 7.2,
    "non-us_users": 6.3,
    "top_1000_voters": 5.6,
    "us_users": 6.8
  },
  "avg_screens": 7.5,
  "budget": 4000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 11,
    "year": 2011
  },
  "critic_review_count": 65,
  "duration": 90,
  "genres": [
    "comedy",
    "drama"
  ],
  "gross_income": 53630,
  "max_screens": 10,
  "mc_avg_user_score": 8.0,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Dirty Girl",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 20,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "A sweet 'n' sassy period comedy with a \"Juno\" sensibility and the soul of a \"Little Miss Sunshine,\" the hard-to-resist Dirty Girl announces the official arrival of Juno Temple."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 65,
      "summary": "Dirty Girl is harmless enough, and the early scenes, in which Danielle surveys poor Clarke with snobbish contempt, have a pleasing nastiness."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "For those not hip to its smug \"out is in\" mentality, Dirty Girl's redeeming feature is its cast. Temple is vixen enough to carry the part, but manages to project a real wit burning beneath the layers of makeup and dumb-blonde shtick her character affects around others."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Dirty Girl isn't. Sorry, but it's just faux grime, a thin layer of bad behaviour that wipes clean with a two-ply tissue to reveal the real movie beneath – all shiny sentimentality."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Watching this movie is like eating a hot fudge sundae and lasagna in alternating bites."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Dirty Girl is a bad movie with no insights that is broadly drawn and genuinely plagued by filthy dialogue. You don't laugh. You just wince, and wonder how the whole thing ever got financed."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Deep down, though, this movie by the first-time writer-director Abe Sylvia is desperate for approval. Starting out with a blast of profanity and sexual brazenness, it lands in a zone of earnest, sloppy weepiness."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "For a film that's supposed to be rooted in such a specific time and place, Sylvia isn't really concerned with details: Costumes, hair, and décor appear to be the work of \"That '70s Show\" interns; William H. Macy, as Danielle's Mormon soon-to-be stepdad, continuously muffs a Sooner State drawl."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "A standout in smaller parts in films like \"Kaboom\" and \"Atonement,\" this frizzy blond actor has the air of a star-in-training in search of the right opportunity. This isn't it, unfortunately, but Temple does turn what's essentially a magical-hussy role into something more grounded and human."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 38,
      "summary": "There's a girl, and she's prone to dirty acts, but that's just one patch of this arbitrarily stitched quilt of white-trash, Bible-Belt transgression, which flattens under the weight of a truckload of half-realized ambitions."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 30,
      "summary": "Writer-director Abe Sylvia slathers on the cartoonish characterization and neon-colored '80s pop - Benatar! Joan Jett! The Outfield! - for an easy-bake mood-setting, which is tedious enough. But his attempts at situational humor on the road - including a stripping scene for Dozier as coming-out metaphor - fall embarrassingly flat."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "Sorry, but if your sensibility is pure trashy camp, don't expect anyone not to laugh when you try to be earnest."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 16,
      "summary": "In many ways, the film is history repeating itself, as the same Weinstein brothers who famously dropped $10 million on \"Happy, Texas\" in 1999 have overpaid again for \"Happy, Texas 2.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I saw this movie last night at the ArcLight Hollywood, it was amazing! What a refreshing change from all the junk that is being released these days. I can hardly believe that critics don't like this. All I can think is that they are not comfortable with strong women and or gay males, what a shame in this day and age. The music is fantastic, I am going to buy the soundtrack. As one who was raised in the mid-west during the 80\"s the hairdo's and outfits were spot on! It was a walk down memory lane, I laughed through the entire movie as did the entire audience . If you are up for some great humor, I highly recommend this movie.",
      "total_reactions": 3,
      "user": "kneil1969"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "It's interesting to me that so many of the critic reviews are negative and the audience is so positive.  I saw the movie over the weekend and just loved it.  When you think of a coming to age movie this is rare.  This is about a sexually acting out girl meeting up with a gay kid....but this is not uncommon given that both can  be outcasts.  The support they gave each other; the freedom they got from each other; the strength to move forward was remarkable.  The movie is about the real fact that it \"can get better\" for those young folks that feel so different.  The critics missed the importance of this movie.  Make sure you see it....it will change your life if by chance you are the mother of one of these \"types\" of kids.  A really great movie",
      "total_reactions": 3,
      "user": "marymary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Of course most of the critics would hate it. Way to crass and common for the cerebral crowd. But I loved it's spirit and broad humor. The two main leads were fabulous, as was the soundtrack. Sure it was a little corny and stereotyped, but it wasn't aiming for an Oscar, just a lot of laughs and a few tears. Definitely worth a watch.",
      "total_reactions": 1,
      "user": "movieboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "A classic in the making.  I truly think this is a great movie.  This is one of those movies that critics will be declaring as great years from now, when they finally get it.  Many of the critics who are now trashing it for the most ridiculous of reasons will be retracting their former reviews.  Behind the humor, great soundtrack, and commercial - yet unique styling is a profound story.  The movie can go from ridiculous to hip to moving with stealth and ease.  All of the characters are fully realized and every performance is stunning right down to the little sister.",
      "total_reactions": 1,
      "user": "hevatin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This is an impossible review to write because this movie tries so hard to be ironically hipster retro but fails at that and more. I've tried to review the plot and the over the top cartoonish characters to no avail. Nothing I will write will encourage you that this movie has any redeeming values. This movie should honestly be rated at a 1. However there is a genuine warmth to Jeremy Dozier's overweight, quietly funny, decidedly gay teenage character looking for the impossibilities of love or fitting in or escaping his buffoonish father. Jeremy conveys the desire to flaunt his personality tempered by the realistic understanding of what happens if you do. Matching and exceeding his acting chops is Juno Temple. She transcends the writer's ideas of a teen looking for a father she doesn't know to escape a life she hates. She plays the slutish impulsive blonde teen to perfection as the movie opens up . You really just want to loathe her, but where a lesser actress would jump into scenes with whiplash she organically reveals herself as a full realistic character who is more than just an easy score.",
      "total_reactions": 1,
      "user": "understudyhero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Okay, high user score and low critic score.  So what gives?  The critics just have very bad taste. It really is that simple.   I am shocked that it got such poor critic ratings. This is a great movie, so much fun and very offbeat.  Screw the critics, see this movie!",
      "total_reactions": 1,
      "user": "meta4ia"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "I went to a sneak peak of this movie at the Castro Theater in San Francisco and had not heard anything about it, so had no expectations.  The movie is mediocre at best and after seeing the writer/director, Juno Temple, and a surprise appearance by Melissa Manchester at the Castro I wanted to like it more.  The likely mostly gay crowd at the Castro hootted, guffawed and hissed, but it all felt forced.  The comedy is way to broad and most of the characters are caricatures (the chubby gay boy, the hateful homophobic dad, the school bully).  I too was a chubby (closeted) gay teen in the early 80's right across the Red River in Texas, so should have been able to relate, but the connection just wasn't there.  Although some will find the flour-sack baby cloying, I didn't mind it and thought it could have worked in a better movie.  The two saving graces I found were the 80's songs, some of which were obvious and others more subtle, and Juno Temple.  There was one scene at the end between her and Tim McGraw that was truly beautiful and didn't fit in with the rest of the movie.  I was kind of blown away when she came out and I learned that she is actually British.  I went so far as to pull up IMDB after the show to see if I had sen her before (small parts in Atonement and Greenberg), but her work in this film, and especially that one scene, indicate the girl can act if she is given the right role.",
      "total_reactions": 3,
      "user": "rkellytex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I just saw this movie and i just loved it..! i love Juno Temple.. if you don't liked it.. your a fool..  This is about a sexually acting out girl meeting up with a gay male and that both can be outcasts... The support they gave each other; the freedom; the strength to move on... its amazing. i have gay male friend and this movie inspired him.  because he knows how hards it to come out and don't have support from some people and his own family. I believe in change and i think you can think about this and change your opinion about this movie. i know that maybe change people life! just maybe",
      "total_reactions": 0,
      "user": "aguselias09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Amazing film. Witty and funny all the way through as well as emotionally charged. I loved the whole thing and would recommend it to anyone. A************",
      "total_reactions": 0,
      "user": "MattJenki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "An interesting twist on your standard coming of age story, but that's all there is. I agree that many of the critic reviews seemed harsh. Did I enjoy this film? Yes, I did. It has some funny moments (not too many) and the character development, while cliched, is enjoyable to watch. I was not a big fan of the acting, not bad but nothing to write home about. Perhaps the worse element was the music. I love 80's music. I love New Wave. I didn't love the way this film seemingly used the same few 80's pop hits to repeatedly drive the point home the film took place in the 80's! Every time the sound cut out and and a rip-roaring 80's toon came on, I groaned. One little music montage would have been fine but this film goes way beyond that. Would I recommend this film? Not particularly. Unless someone said they had a passion for 80's music and coming of age stories.",
      "total_reactions": 0,
      "user": "EatToWatch"
    }
  ],
  "metascore": 37,
  "name": "Dirty Girl",
  "num_weekends": 4,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 7,
    "month": 10,
    "year": 2011
  },
  "opening_weekend_income": 17859,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 9228,
  "rating_freq": {
    "1": 254,
    "10": 1041,
    "2": 121,
    "3": 212,
    "4": 456,
    "5": 966,
    "6": 1904,
    "7": 2210,
    "8": 1388,
    "9": 676
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 40,
  "votes_per_demo": {
    "aged_18-29": 3740,
    "aged_30-44": 3228,
    "aged_45+": 1073,
    "aged_under_18": 19,
    "females": 3201,
    "females_aged_18-29": 1986,
    "females_aged_30-44": 886,
    "females_aged_45+": 185,
    "females_under_18": 14,
    "imdb_staff": 2,
    "imdb_users": 9228,
    "males": 5034,
    "males_aged_18-29": 1706,
    "males_aged_30-44": 2302,
    "males_aged_45+": 874,
    "males_under_18": 5,
    "non-us_users": 4417,
    "top_1000_voters": 143,
    "us_users": 2399
  },
  "year": 2010
}