{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.8,
    "aged_45+": 7.0,
    "aged_under_18": 6.8,
    "females": 7.4,
    "females_aged_18-29": 7.4,
    "females_aged_30-44": 7.3,
    "females_aged_45+": 7.7,
    "females_under_18": 7.4,
    "imdb_staff": 6.9,
    "imdb_users": 6.9,
    "males": 6.7,
    "males_aged_18-29": 6.7,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.8,
    "males_under_18": 6.3,
    "non-us_users": 6.8,
    "top_1000_voters": 6.0,
    "us_users": 7.0
  },
  "avg_screens": 1385.875,
  "budget": 37000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 1,
    "year": 2012
  },
  "critic_review_count": 130,
  "duration": 113,
  "genres": [
    "drama",
    "family"
  ],
  "gross_income": 72279690,
  "max_screens": 3515,
  "mc_avg_user_score": 6.8,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "Dolphin Tale",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 39,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 83,
      "summary": "Director Charles Martin Smith presents the kind of movie that gives squeaky-clean a good name."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "Cozi Zuehlsdorff winningly plays a young girl who works at the hospital. With her big smile and natural warmth, she is a charmer. Even better is Gamble, who gives a smart and sensitive performance without relying on any of the normal mannerisms that often afflict child actors."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Even with the conflict overkill, most of the small moments ring true. Dolphin Tale has more in common with \"The Swiss Family Robinson\" than most modern live-action family movies, where slapstick and cheap laughs feed short attention spans."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The story of healing and courage is told with a refreshing lack of cynicism, not surprising since it's from the same producers as the wonderful \"My Dog Skip.\""
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Even if Dolphin Tale hits every note square on the nose - or maybe because it does - watching it is surprisingly pleasurable."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Between the earnest boy, his playful mammal, the film from actor-turned-director Charles Martin Smith is a winning family entertainment."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The dolphin is, quite simply, remarkable, and the unstated message of resilience and adaptation ripples easily off the screen to the smallest viewers."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Learning of this story, I thought, aw, come on, give me a break. But it turns out the story is not only based on fact, but the actual dolphin involved, named Winter, stars in the movie as herself. Her new tail functions admirably."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The movie often seems too good to be true, but by the end I wanted a dolphin just like Winter for my own swimming pool."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Pitched awfully young, without a shred of the satire or subtlety that is generally found in films aimed at tweeners and above. That's not a bad thing; it just means accompanying grown-ups or older siblings will have to choke down a sizable dose of schmaltz with their fish milkshakes."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "It doesn't look particularly special - despite the visual potential of underwater scenes - but kids are going to eat this up."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "By the end of the movie, Winter has become a mascot for human disability, especially for children, and Dolphin Tale has enough depth and sensitivity to tap into emotion without feeling manipulative."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "This true story of a dolphin with a prosthetic tail has been precision engineered for full inspirational, heart-warming value."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Though garnished with some heavy dollops of cheese, Dolphin Tale is a surprisingly solid, earnest family picture."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 67,
      "summary": "Though the film meanders through some chum-heavy patches, this genuine crowd-pleaser from the producers of \"The Blind Side\" is a worthy new entrant into the boy-and-his-underdog film genre."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 67,
      "summary": "While the plot occasionally feels like \"Free Willy\" without the drama, it's a cute story if you don't mind temporarily trading in your cynicism for a bag of popcorn."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "A true story of animal rescue, and it even stars the sea creature to whom it happened. But it's the humans who do the cutesy tricks that make it a mixed blessing."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "It's not a perfect film, mind you. It's too long by a quarter, and actor-turned-director Charles Martin Smith (\"The Untouchables\") lets any sense of real structure slip away in the film's crowded third act."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "A reasonably uplifting kids movie if you don't think about it too much. I get paid to think about things too much, and effective as the movie is, it nevertheless left me slightly put off."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a whale of a tale, made more special by being predominantly true."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "The best of Dolphin Tale takes it easy. Led by Connick and Judd, plus the crucially empathetic Gamble and Zuehlsdorff, the cast includes Kris Kristofferson as the seafaring old salt of a grandpa. The acting has a nice, low-pressure vibe, in contrast to the film's high-pressure peril."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "No, this isn't how it really happened. But director Charles Martin Smith (\"Air Bud\") wrings plenty of heartfelt tears and a few laughs out of this fictionalized account."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "If its plotting can be slight, the film's restraint and earnestness help prevent it from ever tipping over into outright mawkishness, and its performances similarly avoid over-the-top histrionics."
    },
    {
      "critic": "Eve Barlow",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "A good shout if your kids like this sort of thing, otherwise best head to your local aquarium."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Most of the family films churned out today are so junky it's almost a shock to find one in which the animals never spout sassy one-liners, or show off their hilarious hip-hop moves."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "The parallel between the dolphin and the disabled tourists who flock to see it borders on treacle, but Gamble's rapport with his finned costar is so touching that the movie works anyway."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "The underwater scenes of Sawyer playing with the dolphin are gorgeous, a cinematic daydream of interspecies connection."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Call it Prosthetic Flipper, but the truly inspiring Dolphin Tale is perfect family entertainment."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 58,
      "summary": "Dolphin Tale is as casual as a pleasant afternoon nap and about as substantive."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "A potentially appealing story about a rescued disabled dolphin gets smothered with inspirational family values guff."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Dolphin Tale is inoffensive enough -- little kids will probably dig it -- and I'm not suggesting that family-friendly docudramas should tightly conform to real life. But when they do embellish, they should distill the story into something more compelling, rather than watering it down with pleasant-but-utterly-forgettable inspirational boilerplate."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Predictable fun. Fantastic for family audiences. Acting was good, dolphins interesting to see.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "If it wasn't based on a true story I would rate a zero. It's strictly for kids as the adults play to and through  the kids. Mr Connick should stick to music. He sleepwalks through his dialogue , and is just not believable. The kids  add some spice and Mr Freeman does his usual, but the pelican is the standout here. A hint of romance but never developed. Everybody gets together to save the tale / tail and we all smile at the end. So if you really have nothing to do one day and have small children, take the kids but don't expect much.",
      "total_reactions": 1,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "I believe that it is a very good movie.The plot is a little predictable because the commercials showed the dolphin swimming with its new tail and it is a true story so you could just look it up to spoil it. The plot being predicatable doesn't make it any less impactful. Any marine biologist would be thinking, \"ya, dolphins do love to play like that and  lot.\" The only reason I am not giving it a ten, is because you can't relate to the dolphin as much as if the same thing happened all around a human. The older cousin did lose control of his right leg, yes, but the story is about the dolphin. You can tell when the dolphin is sad, but you can't understand the life of a dolphin, so you don't understand 100% why losing its tail is more than just less swimming.",
      "total_reactions": 2,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "OK, its good for a young target audience who wants a classic formulaic movie.  Predictable, oh yes.  Almost every step of the way.  My six year old was engaged throughout.....and I did not find it offensive.  That's about it.",
      "total_reactions": 2,
      "user": "Audiowombat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "I am a huge fan of Harry Connick Jr., so I could not wait to see Dolphin Tale. It is a great feel good film that I recommend to everyone! There were so many hilarious moments and many of them provided by Winter, the dolphin, and Roofus, the pelican. And of course, all of the human actors were great too. I especially liked when Dr. Clay Haskett (Harry Connick Jr.) played the saxophone whenever he felt vulnerable. I hear Harry Connick Jr. is headed to On A Clear Day on Broadway next! Iâ",
      "total_reactions": 1,
      "user": "AndyC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I'm a huge Morgan Freeman fan so I guess I was a little bit bias giving this movie a 10, but it was worth it. The animation needs more polishing but the storyline especially the end part gave this movie that edge over free willy",
      "total_reactions": 1,
      "user": "kristoffer15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Inspired by an amazing true story, Dolphin Tale goes exactly how you think it will, but thatâ",
      "total_reactions": 1,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "I had high hopes for this film considering that it's a feel good movie. But it just didn't deliver. Just because a film is feel good doesn't mean that the film is good itself. When you rate a film never rate on the message it gives otherwise you'r just being bias. Try to look at what makes a film good like acting. Which was decent. The directing was decent as well. There was nothing special to this. The worst part of the movie was the plot build up. There was so many scenes that really weren't necessary. For instance, the scene when the kids fly the remote controlled helicopter wasn't necessary. I believe they put unnecessary scenes just to keep the kids interested. After all this is a kid movie. The writing was also decent. There wasn't any dialogue lines that caught my eye. Not even the story about the kids and the dolphins that Dr. Clay told interested me. The best part was that it's was a touching and heart warming true story. I would recommend this to people that want to take a break from good movies and appreciate a delighted story about a kid and his dolphin.",
      "total_reactions": 2,
      "user": "MetallicCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "First off, I would give this a 8.75 out of 10. This is a great family movie, that's for anyone. Performances are all right. Score s descent. The story is good, but predictable every second. Overall, Dolphin tale is a good, family movie for everyone. You and your family should go see.",
      "total_reactions": 1,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "This was a decent watch, not for cinematic reasons per se but for making the world a better place. I watched this with my son, Julian, and I was pleased with how they took the true story, including the actual dolphin from it, and, especially for kids, promoted environmentalism, caring for animals, etc.--really solid and important aspects that need to be, more than ever, emphasized in the youth of today.",
      "total_reactions": 1,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "An amazing story.....quite simply put. This film is sweet. The performances are decent and the subject matter is affecting. However, this film drags quite a bit and it really goes nowhere in the second act. If not for the touching conclusion, and the Westlife single \"Safe\" montage, this film would not have been perceived as well. Worth a rental price, and worth no more than a $10 personal copy.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "This movie has a good message for kids.Never give up.Live out side of the box.Love with all of your heart and make the most of every moment.Dolphin Tale is not all that predictable for the target audience it was made for.Very entertaining Kiddie food for the soul.",
      "total_reactions": 0,
      "user": "Stonecutter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "For a film that's supposed to be based off a true story, the whole film feels as fake as the many prosthetic tales made for the star of the film; a dolphin named Winter. The movie is about a young boy named Sawyer, who is very anti-social, and not doing very well in Summer school. One day, he finds a beached dolphin entangled in a rope and a crab trap. The boy immediately has feelings for the dolphin, and stops by the marine animals hospital everyday to check on the creature. It appears there is little hope for the dolphin to survive, do the dolphin's tale (or more specifically; lack of). Among many problems with this film, the biggest is the movie's lack of a reason to exist. The story has obviously been greatly fabricated from it's source, the acting is passible, the attempts at humor will only make kids laugh, and there are some parts that are so unbearably cheesy, even a child may feel skeptical. I myself, laughed only once during the film's entire duration; nearly two hours. The film is not exciting, and it's very slow and un-rewarding. It's not unwatchable, it's just very boring. There are countless cliches in this film, more than I'd like to count. Every soap opera idea in the book has been yanked out of the book and thrown into this movie. I imagine some kids might enjoy this film, as long as they don't have a short attention span, but any one else will be able to see through this cheese fest.",
      "total_reactions": 0,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "animal films are usually terrible, but 2011 has had a short stack of very good ones and this is one of them. the heart works well, the plot moves quickly enough to engage kids and patiently enough to keep their parents interested. the story is inspiring on multiple levels. overall a very good film.",
      "total_reactions": 0,
      "user": "allmovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "I was rather taken aback when I did some background reading subsequently after watching and discovered that the actual events were, in fact, a great deal different from what I saw in the movie.",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Its a good movie because it has the formula of an old classic film that delivered well.It is good for young audiences that will surely touch and inspire them and realized to be matured enough on helping others .the narrative is simple,well detailed ,the performance is decent but there is no a great impact on every scene that will mark to the mind of the viewers.",
      "total_reactions": 0,
      "user": "abcgbc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "First, let me say that I find these based on a true story animal movies to be annoying. I went into this movie with practically no expectation (mainly because I find Nathan Gamble, the lead kid extremely annoying) but I was pleasantly surprised. Yes, most of it is cliche and there were only 2 good performances, but families will enjoy it. Just don't expect it to be great.",
      "total_reactions": 0,
      "user": "christhebeast42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "A sappy family flick from first judgment, the entire package is surprisingly an inspiring tale with great performances, which is what the audiences really want to see more often.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Dr. Cameron McCarthy: \"Just because you're hurt doesn't mean you're broken\". Dolphin Tale is about a boy bonds with a dolphin who loses its tail after being caught in a crab trap. This movie was a harmless family flick with cute dolphins. People say that this is a copy and paste from free willy, but this is thing, I didn't like free willy at all, but I think this movie has a stronger message and it has better charterers. This is a harmless movie that little kids can enjoy and parents can find something good in this.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Dolphin Tale is a funny, charming, and a good-hearted family flick about courage, hope, and perseverance that will touch your heart and perhaps even inspire you. Rather than panders to kids like most PG-rated movies often do, it acknowledges their sense of imagination and patience and rewards them with a story that's both engaging and though-provoking.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "\"Dolphin Tale\" is an incredible adventure with pure environmental awareness about helping animals that need our help , and not cotaminar the world's oceans , but the rest incredible movie .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "It's an earnest, sweet film that relies on the extraordinary true story of Winter, the rescued dolphin, and little on manipulative Hollywood tricks.",
      "total_reactions": 0,
      "user": "gigiharris17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "It's an earnest, sweet film that relies on the extraordinary true story of Winter, the rescued dolphin, and little on manipulative Hollywood tricks.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "This was a great, beautiful movie. It definitely made me cry at times, and laugh at others. This really is an extraordinary film.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ],
  "metascore": 64,
  "name": "Dolphin Tale",
  "num_weekends": 16,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 23,
    "month": 9,
    "year": 2011
  },
  "opening_weekend_income": 19152401,
  "opening_weekend_income_currency": "$",
  "rating": 6.9,
  "rating_count": 18510,
  "rating_freq": {
    "1": 393,
    "10": 3218,
    "2": 171,
    "3": 247,
    "4": 514,
    "5": 1251,
    "6": 3249,
    "7": 4864,
    "8": 3010,
    "9": 1593
  },
  "release_day": 23,
  "release_month": "September",
  "release_year": 2011,
  "user_review_count": 89,
  "votes_per_demo": {
    "aged_18-29": 6049,
    "aged_30-44": 6410,
    "aged_45+": 2871,
    "aged_under_18": 109,
    "females": 6006,
    "females_aged_18-29": 2714,
    "females_aged_30-44": 2019,
    "females_aged_45+": 826,
    "females_under_18": 50,
    "imdb_staff": 5,
    "imdb_users": 18510,
    "males": 10052,
    "males_aged_18-29": 3273,
    "males_aged_30-44": 4325,
    "males_aged_45+": 2007,
    "males_under_18": 56,
    "non-us_users": 7175,
    "top_1000_voters": 226,
    "us_users": 5208
  },
  "year": 2011
}