{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.3,
    "aged_45+": 6.2,
    "aged_under_18": 6.5,
    "females": 6.9,
    "females_aged_18-29": 7.0,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.7,
    "females_under_18": 7.3,
    "imdb_staff": 5.9,
    "imdb_users": 6.5,
    "males": 6.3,
    "males_aged_18-29": 6.5,
    "males_aged_30-44": 6.2,
    "males_aged_45+": 6.1,
    "males_under_18": 6.3,
    "non-us_users": 6.4,
    "top_1000_voters": 5.6,
    "us_users": 6.3
  },
  "avg_screens": 1303.7,
  "budget": 70000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 7,
    "year": 2012
  },
  "critic_review_count": 238,
  "duration": 86,
  "genres": [
    "animation",
    "adventure",
    "comedy"
  ],
  "gross_income": 213949505,
  "max_screens": 3769,
  "mc_avg_user_score": 6.0,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 49,
  "mc_movie_name": "Dr. Seuss' The Lorax",
  "mc_negative_rating_frequency": 51,
  "mc_positive_rating_frequency": 108,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 83,
      "summary": "The movie is like a less original \"WALL•E,\" but it's still vibrant and touching."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "This is purely warm, wonderful, wise and hilarious family entertainment that is fantastic movie fun for everyone."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "There is no denying that the environmental message is heavy-handed."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Director Chris Renaud and his team have fun with these dithery, frenetic characters. The film is less special when it slows down and takes a breath of fresh air."
    },
    {
      "critic": "Jody Mitori",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "While the movie is funnier than the book, the drawback of this modernized version is that it loses the timeless quality of the story on the page."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Someone in Hollywood ought to speak for the trees, and The Lorax does it with verve and vibrancy."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "It's been animated by the same company that made \"Despicable Me,'' which is to say you don't know whether to watch The Lorax or lick it."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "The result is solidly entertaining - not quite as good as \"Horton Hears a Who\"  or \"How the Grinch Stole Christmas\" - but unquestionably better than \"The Cat in the Hat.\""
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "The Lorax is a modest gem, failing to significantly enhance its source material's ideas but still delivering a zany, rollicking, multi-character version of Seuss's environmental cautionary tale."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Armed with a splendid voice cast and a gorgeously-rendered 3D-CG landscape, Dr. Seuss' The Lorax entertains while delivering it's pro-environmental, anti-greed message wrapped in a bright package of primary colors that truly pop."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 67,
      "summary": "There is nice stuff found in The Lorax - Thneedville's artificial nature is inspired - and bad, like the original songs nobody will be humming when they leave the theater. But good intentions don't trump mediocre filmmaking. If that makes me a Grinch, so be it."
    },
    {
      "critic": "Stan Hall",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 67,
      "summary": "It's technically impressive but sluggish, with an uneasy mix of cute and gloom. It occasionally finds an effective balance -- mostly in the scenes that explicitly recall the book -- but inevitably lacks Seussian soul."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 67,
      "summary": "Although the movie's ecological message is dominant, it's not heavy-handed. Rather, the ecological warnings are tossed out with the same joie de vivre the Once-ler displays when tossing marshmallows to the bears."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "Lovely to look at and with some fun material not of Seuss' invention, but it's too hectoring, like reading an environmental textbook with jolly pictures."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "While softening Geisel's darker themes, they still meld a valuable message into catchy songs, bright images (nicely done in 3D) and funny characters."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Unfortunately, a new problem rears its head: It seems no young audience member can be trusted to enjoy a thoughtful story without a heroic, borderline-obnoxious surrogate (here, he's voiced by Zac Efron) zooming around on a scooter, bonking villainous heads and saving the day."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 58,
      "summary": "The handful of songs are catchy, and the whole film feels pleasantly airy. But this is a dark story with a heavy message, and it's been transformed into a harmless, pretty confection. In defanging it for comic effect, the filmmakers have done Seuss as much of a disrespectful disservice as if they'd laid on the fart gags."
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "So it's puffed up with lots of extraneous stuff – Super fun for the kids but for grown-ups? Just fluff."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "You know what? The whole thing is harmless."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "You couldn't accuse the film of practicing what it preaches: careful stewardship of a precious resource."
    },
    {
      "critic": "Jonathan Crocker",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "Fake plastic trees, fake plastic entertainment? The Lorax is immensely colourful, catchy and cheery. Then again, it's also gaudy, bland and recycled. You can do better."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Par for the course in blowout CGI adaptations, a great deal of detail and bustle is gained at the expense of charm - for all the miracles these armies of animators can achieve, they have yet to successfully reproduce a humble artist's line."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "This movie version adds a whole lot of other stuff, most of it not very good and not in keeping with the spirit of the Seuss original."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "The Lorax is so big, flashy and redundant that it courts precisely the kind of blind consumerism it's supposed to be condemning. It doesn't trust kids to sit still and pay attention for even a minute."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "A cautionary environmental tale with a thin veneer of entertainment on top. With its cotton-candy-colored palette of orange, pink and purple truffula trees, it looks like a bowl of fuzzy Froot Loops. But it goes down like an order of oatmeal. Sure, it's good for you. It's just not terribly good."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "The key to Seuss' tales, as with all good fables, is not only their cleverness but their surpassing elegance and simplicity, qualities that this busy, over-cluttered contraption of a movie seems entirely uninterested in replicating."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "Yikes! Chris Renaud and Kyle Balda direct strictly for short-attention spans on a fruit-loopy palette that made me want to puke. Had Dr. Seuss lived (he died in 1991), I'm confident he would have puked as well."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "The Lorax is awful, like chronic disease."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 20,
      "summary": "Dr. Seuss's The Lorax [sic] isn't Seussian in spirit. It's shrill and campy and stuffed with superfluous characters."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "summary": "The movie is a noisy, useless piece of junk, reverse-engineered into something resembling popular art in accordance with the reigning imperatives of marketing and brand extension."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 4,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "The Lorax is entertaining, visually beautiful, funny and very sweet. Yet it isn't as deep as we really want it to be. Still, overall it is solid family entertainment. I give this movie 88%.",
      "total_reactions": 20,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "The story of The Lorax by self-proclaimed author Dr. Seuss falls a little short this time. I walked into the theater with no expectations what so ever and I am happy for that because if I did I would've been majorly disappointed. I would suggest maybe renting it for a day because if I were you I would rather save $15 and watch it when it comes out to rent",
      "total_reactions": 2,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Another Dr. Suess adaption. I say this without enthusiasm or disappointment. Dr. Suess films are usually just mediocre, nothing to get excited over. However, they make a lot of money. Thus, we get the movie adaption of \"The Lorax.\" I won't lie, I've never read The Lorax, nor do I know anything about it, aside from it's environmental message. But I can tell this film really stretched the source material. Even with the extensive (and uninteresting) chase scene, even with the half-dozen of musical numbers (only one of which I really enjoyed), and even with the additional characters added, the film has a relatively modest running time. The Lorax isn't that good, unfortunately. It has strengths, but it also has a lot of weaknesses. For one, it seems The Lorax has no imagination for itself. At least half of the material of the film has been borrowed from other films. The \"adorable\" brown bears that wander around speaking in gibberish are obviously a rip off of the minions in Despicable Me. The prank that the Lorax plays on the Once-ler, by putting his bed in the river is a rip off from Parent Trap. And speaking of the \"bed-in-the-river\" prank, I must ask how it's physically possible for a bed, frame and all, to float in the water. There is nothing unique about the characters. We've seen them all in other movies. O' Hare is the generic, evil, power-hungry villain. Audrey is the generic, tom-boy, girl that the main character falls in love with. There are even characters in this movie that seem to appear in different forms. The Lorax just can't run by itself. It has to take ideas from elsewhere. The voice cast is average, but the voice of the main character, Ted, just doesn't work. He's supposed to sound like he's 10. Don't have Zac Efron voice him, get a little boy! But I digress. On the flipside, the animation is gorgeous. It can't match the detail of Rango or Tintin, but it makes up for it with vibrant colors that really bring the world of Dr. Suess to life. Also, the musical score by John Powell is very good, though it doesn't really break any new ground. And to be honest, I really didn't like the choir bits. And did I mention my feelings about the songs in the movies? Aside from the one at the beginning, they were all very uninspired, and usually dull. Some of the gags are quite good, but there were too many stale ones to make humor the strength of the film. There are also attempts of \"cuteness\" that over stays it's welcome. There are, however, some surprisingly touching moments, and there are times where you might just sit back and think for a moment (heaven forbid, you may actually think during a movie). There's certainly a curious amount of food for thought on display. The one thing I like most about the film, is also the film's main problem: The singing fish. There are three fish that looks like that of Cat and the Hat, that sing, not words, but notes. This is all performed in barbershop-quartet form, and is very amusing (there's one moment in particular when they hum the Mission Impossible theme). The reason this is the film's biggest problem, is because they're the best part. If the strongest thing about a movie is a recurring gag, you've got a problem. And that's the problem with The Lorax. It's not good enough to remember outside of a couple good gags. The rest is fluff. The target audience, however, (kids between 2 and 10) will love this film, I guarantee it. The auditorium I saw the movie in had not a single spare seat, and every kid in the room was laughing their heads off. I heard very few parents laugh. This isn't a bad movie. It's just a kid's movie, and it's somewhat painful to say that.",
      "total_reactions": 2,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "The overly-preachy attitude of The Lorax overshadows any actual storyline, leaving you with a good message but no entertainment. They didn't even try to hide the message they are trying to get across with a believable plot and cute characters, instead they created an excessively bland quest with annoying characters riddled with atrocious dialogue. The only good aspects of this butchering of a classic is the art and animation, which is superbly done. But it looks so nice I kind of feel bad for the 3D modelers and animators since the writers and directors destroyed their hard work. I can't even imagine a kid enjoying this, unless they really only do want bright colors, because The Lorax certainly succeeds in that field, a little too much I might add. The jokes aren't really jokes at all, they just consist of supposedly funny dialogue that in reality is just awkward and usually doesn't even make sense. I honestly think the writers of this movie either have never talked to an actual person before, or just plain don't care. When it's all said and done, we walk away from The Lorax with two things: The blatantly obvious message of saving the environment, and the fact that to make a lot of money, you really do only need to have nice graphics.",
      "total_reactions": 2,
      "user": "CaKeS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "As a movie considered strictly on its own merits, The Lorax is passable but unmemorable, except for its catchy music. The movie maintains a mostly very Seussian art style, much to its credit, which offers a better sense for the whimsy of the thing. As an adaptation, however, The Lorax is almost insulting, misinterpreting the original work's moral of \"overconsumption is bad and destroys the environment, which is also in itself bad\" into \"trees are awesome and corporations are evil\". One of the most important elements of any adaptation is the feel of the adaptation versus the feel of the original, and when your adaptation doesn't play fast and loose with the source material there's a need to adhere very closely with your feel, but this movie doesn't even try to succeed at that. It's a very cynical movie, with a cynical sense of humor that is admittedly quite funny when considered on its own merits, but feels mean in context, and with an almost sarcastically naive moral, and yet I feel like all of this was done as a means of playing it safe on the studio's part, which is ironic when you think about it because cynical approaches to childhood classics seem like they would be the opposite of safe. The movie feels like an underachieving teenager, deliberately withholding effort because it's easier to excuse a flop as \"I wasn't trying anyway\" than to face the possibility that someone might not like your best work. The movie's crippling fear of rejection causes it to lose the earnestness that could have served it so well as a Dr. Seuss adaptation, instead choosing to constantly act like it's too cool for itself. It's a rare thing when all of a movie's flaws proceed so cleanly from a single source, but this really is the wellspring that it all pours from: the Lorax was too afraid you wouldn't like it if it gave 100%, so it decided to only give something like 70%. If you want to see some great art design and hear some fun songs, by all means rent/borrow it, but if you actually want to get the story, read the book or watch the old half-hour cartoon special.",
      "total_reactions": 1,
      "user": "GodotIsW8ing4U"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "\"The Lorax\" from Illumination Studio doesn't really provide much, and just turns an old Dr. Suess book into an animated movie. While there is no depth and no care towards the book, it's okay. The characters in the movie did however anger me, as they added the main character Ted, who is just selfish due to the fact that he just does what he does to impress a girl. In the end, while he saves his town, Ted is truly just any other annoying kid who wants to flirt with a girl. The side romance is somewhat irritating, but bearable. The story with the Lorax is okay, but nothing great. The environmental messages barely get through, and after watching it, when I was watching television, I saw a commercial of Illuminations advertising the movie with a car and immediately gawked. While this will not affect the films score, I thought that was totally unnecessary considering that this film is trying to tell an environmental message. Nice going Illuminations.",
      "total_reactions": 1,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "I love The Lorax is a dr. seuss movie. Calvyn got blu ray of lorax we watched already, but I like Horton Hears a Who!, The Grinch and The Cat in the Hat.",
      "total_reactions": 1,
      "user": "lrbohnert"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "While a well-animated movie and modern interpretation of the Dr. Seuss classic, unfortunately it didn't impact me the way the book did when I was a kid.  The Lorax is my favorite Dr. Seuss book.  It always seemed like the most serious.  And when I saw the first animated interpretation of the book as a child, the story flat-out depressed me.  This one, not so much.  It wasn't a bad movie, but the Lorax him(it)self was not as prominent in this movie as I would have expected him to be.  There is a time during the movie where he is, but other than that 20 minute piece, he is almost an afterthought.  And because of that, the message wasn't as impactful.",
      "total_reactions": 4,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The Lorax doesn't hold up pretty well for me and my biggest issue is that the movie is reaching way too hard for the audience that we want to know about the environment. The story is closely to the book, but it has too many details that they want to focus even more. The characters are forgettable, but the two characters are not bad like Danny DeVito voice as The Lorax and Betty White voice as The Grandma. The animation looks nice and it's been colorful to the background. Between the animation and background, the songs are stupid, the characters are cutesy ways, and the story is like I said is too much.",
      "total_reactions": 4,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "The Lorax is a film that would have worked great as twenty-thirty minute cartoon but instead is forced into a half and hour flick. The added characters and story are not that interesting and are only there to stretch out the plot. Also, by doing this the film takes focus away from the real story. The film is further hurt by the replacement of rhyming with poor dialogue that sounds more modern than something from a Dr. Suess world. Plus, the songs in the film are lame and forgettable. If the film had focused on the story of the book and kept things in rhyme and closer to the actual story I would have liked it ok. However, the lack of focus on what made the book such a classic, pointless additions, and lame dialogue create a film whose only saving graces are its animation and the fact that this is meant for little kids. Unless, you’re an adult with little kids who want to see the film than I would say this is a definite skip. And if you have not read The Lorax to them yet than please do that before they see the movie because it is a messy adaptation of a Dr. Suess classic.",
      "total_reactions": 4,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "My least favorite animation of all time. Unfunny, mean and doesn't make any sense. The characters are annoying and cliched, the whole plot is one big positive message executed badly. I just hate \"Dr. Suess' The Lorax\" it is one of my least favorite movies of all time.",
      "total_reactions": 4,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This was the single biggest disappointment for a kids movie I have ever seen.  It carries a flagrantly political motive which I might have been able to tolerate if the movie itself had been any good.  lot's of eye candy to be sure, but the story is disjointed and so incredibly blatant in its political message that it was overwhelming.",
      "total_reactions": 6,
      "user": "RationalScott"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "CGI is a wonderful thing in cinema. If only \"the Lorax\" could do it justice. But with ludicrous songs, childish tones, and a jumbled plot, it's only justice is Danny DeVito's Lorax. Everything else is utter",
      "total_reactions": 3,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Its all just about what I expected, Except for a movie whos focus was the enviorment, I was suprised by,how one-sided it could be, telling us we should hate industry,all together like its evil, coupled with the fact it tries to hard to shove the message down our throat, its just more worth skipping this one",
      "total_reactions": 8,
      "user": "Dude45"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Flagrantly inferior to its literary predecessor, 'The Lorax' sends a skewed message to its viewers, one that is less timely and memorable, and more puffed with crass one-liners and subtle condescension; an utter denigration to one of the greatest children's authors to ever live. However, more maddening of all is the lack of regard and reverence to Geisel's words, mellifluously melodic syllables accompanied by sticking alliteration and rhythmic patterns; they are defecated on. Much to the viewer's chagrin, the film does not include a narration: how does a 'Seuss' adaptation not have a narration? Only in one instance are words from the book uttered, albeit words offensively disparaged. Early on in the film, Audrey (voiced by Swift), a character nowhere to be found in the book, quotes Geisel in regard to the truffula trees: \"The touch of their tufts was much softer than silk, and they had the sweet smell of fresh butterfly milk.\" This is relieving to hear and see. However, such memorable quote is replied by Ted (voiced by Efron) with \"Wow, what does that even mean?\" And, Audrey says, \"I know, right?\" So, what we have here is a character who was not even in the book, now in the film, belittling the very words which the film, itself, was shaped. This example, ultimately sums up the direction of the film; changing what wasn't already broken, and breaking it. Don't become too skeptical, 'Lorax' does contain rich, diaphanous colors that bring to life some of what Geisel's book intended to show through words, however, the film's attempts to put a new spin on things, especially by adding characters not found in the book, creates a blurred focus and disconnect, which results in a story that looks more like something you've seen before as opposed to the original, timeless literary version. Much of this is emanated by the title character, who voiced by DeVito, becomes too-well-overdone, and eventually becomes irksome and forced; he appears much more in the film than the book. I understand the film's casting of DeVito,\" again, to \"spin things up,\" however, his 'Lorax' character doesn't match the same prominence as the book, rather, DeVito comes across as too imperiously assuming; an unpleasant, discordant \"Jor-zey\" inflection that becomes old, very quickly. I can't imagine the filmmakers wanting that. As a whole, 'Lorax' is a propaganda filled, \"green-pushing\" adult-first animation film that looks impressive, but inevitably sends a twisted message to kids that \"it's great to help the environment, but only to further oneself in the process.\" Moreover, the film is, for the greater portion of an hour, 'Lorax' is partially fulfilling, mostly to do with the visuals, however, the most compelling sequence lies in the last 20-25 minutes, once the garrulous 'Lorax' and dainty animals are finally exited from view. Having said such, only ephemerally does the film endow the same sense of loss and somberness found in the book. Lastly, the underlying theme and parable of the film is not so hidden, as even the kids will, atleast minimally, capture what it's aiming to say. However, the guise with which it sticks with throughout (large smiles, balmy jokes, and fuzzy \"fluff\"), is more than enough to divert the kid's thought-provaction. In 3-D, though, the action doesn't quite match the subject material. For most adults, the slapstick won't fly very far; it's a \"T-I-M-B-E-R\" kind of spectacle; falling before your eyes.",
      "total_reactions": 14,
      "user": "FDT44"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Entertaining, charming, funny but not of the better adaptions of the Dr. Seuss books(though still better then crap like the Cat in the Hat).",
      "total_reactions": 13,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The 3D IMAX part was awesome ... kinda hard to mess that up (i think). I brought my son who will be 4 this summer he liked the visuals as well, but about half way through he fell asleep and I promise all of you, it was not b/c he was tired. Don't anyone dare go to see this w/o 3D, the IMAX you could probably take or leave.  But anyone who pays top dollar to watch that movie in 2d you will surely regret it!",
      "total_reactions": 8,
      "user": "brijmcn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "At one point the Lorax shouts \"You've got to stop! This is BAD!\" and I couldn't help but chuckle at the irony. This film is annoying, screechy, monkey-written and completely hollow... basically everything that Dr. Seuss WASN'T! Theodor Geisel would roll in his grave if he knew his life's work was being mutated into one horrendous movie project after another.  For shame!",
      "total_reactions": 4,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "While I enjoyed Danny Devito as the Lorax, and the animation was good, the movie as a hole was pretty terrible.  The makers decided they needed to add a completely new story line with Zac Efron and Taylor Swift trying to save the world from an evil businessman who sells clean air now that trees are not around to produce it.  Furthermore, the movie adds in a few gimmicky songs with poor lyrics and gives Ed Helms an electric guitar to make him look \"cool.\"  Kids may like this movie, but it is definitely not for adults.",
      "total_reactions": 4,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "First, just let me tell you that The Lorax is my favorite Doctor Suess book ever. Every time I read it, I cry. This movie is an absolute travesty. All of the characters are stupid and cliched, Danny Devito's Lorax voice wasn't actually very good, and the comedy of the movie is basically \"LOOK AT THAT BARBALOOT! IT IS FAT! HAHAHA!\" After seeing this movie with my daughters, I found my old copy of The Lorax and read it to them. They both agreed that the book was much better.",
      "total_reactions": 4,
      "user": "Whiskerbro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed the movie! the tress were beautiful i loved the story of the city and how it came o be. I most definitely loved the Lorax and his mustache all the forest animals the visuals were excellent and the ending made me tear up.. my Favorite character was the grandma!",
      "total_reactions": 2,
      "user": "reetu416"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This colorful enchanting movie is a wholesome family movie that everyone will enjoy. The Lorax, is a charming heartfelt movie based on Dr.Seuss's: The Lorax. If you like Cloudy with a Chance of Meatballs, Despicable Me, and Kung Fu Panda, Tangled, then you'll certainly enjoy The Lorax. This movie is colorful with bright colors, and has amazing animation. It's cute, funny, and will bring a smile to your eyes, and hopefully face. The story does fall short a little through building depth, but that is made up through the movies amazing animation and the warm atmosphere that the movie is set in. Overall, The Lorax is something to watch :)",
      "total_reactions": 2,
      "user": "Monstr92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "A mess! Not the worst animated film I've watched, but it's a bit harsh in the delivery of its message; it's also annoying at times. I probably liked the opening musical number way more than I should have though.",
      "total_reactions": 2,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "The Lorax is only slightly over a marginal adaptation of the book, as some of the magic and messages about wasting non-renewable resources that Dr. Seuss so neatly wrapped up in the book are lost in the film.",
      "total_reactions": 2,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "The Lorax is the kind of family-friendly film that young viewers will love no matter what. The animation is bright and colorful, the music is catchy and upbeat, and the all-star voice work is undeniably impressive. It's a great film to entertain the little ones. However, coming from the perspective of a lifelong Dr. Seuss fan, The Lorax is a bit of a disappointment when compared to the book it's inspired by.",
      "total_reactions": 2,
      "user": "homer4president"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I love the Dr Suess books, and the movies are good too, super fun and cute.",
      "total_reactions": 2,
      "user": "jelenabiebs31"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "A lot more charming than 2000's \"How the Grinch Stole Christmas!\" movie and actually works unlike 2003's \"The Cat in the Hat\" movie. It's not Despicable Me, but it's pretty much works for a non-Despicable Me installment.",
      "total_reactions": 2,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "A delightful animated feature with special appeal for tree lovers.",
      "total_reactions": 2,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "I love \"The Lorax.\" It's personally my most favorite of Dr. Seuss's book and the 30 minute animated film. But I was so angry that the film industries are gonna make a CG 1.5 hour remake. I'm not a fan of the Dr. Seuss ridiculous remakes. I will give credit with \"The Grinch\", it was okay but I hate the changes they made. Then they made \"The Cat in the Hat\" and \"Horton Hears a Who\" which I honestly didn't enjoy. So I gave this movie a chance, and....I really didn't like it. They completely SH*T on Dr. Seuss's legacy. When the credits said \"Based on the book of Dr. Seuss\" my reaction was \"NOT EVEN CLOSE!!!\" Only 15% of the film was based on the book/animated movie, the 85% is made-up just to make box office dollars. It was seriously hard for me to sit through the whole movie. Also, some scenes from the original were changed, that made me disappointed. Right when the movie ended, I went home and watched the original animated film on VHS just to forget the remake I just saw. However, I do like the animation it looked just like Dr. Seuss's artwork and Danny DeVito was pretty good as the Lorax, but the rest was a complete mess.",
      "total_reactions": 12,
      "user": "billruller"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "A good, wholesome family movie. It's very funny, has a sweet story, and teaches kids a lesson about protecting the environment. It's all backed by fantastic animation and voice acting. Older audiences might not enjoy it that much, but will appreciate it for not being mind-numbingly dull, and kids will love it.",
      "total_reactions": 5,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "Shrill, one-sided, and preachy, and only about 40 years too late - like in 2012 we never heard any of this before?  No subtlety at all (like maybe real world environmental issues?), but getting hit over the head with a 2 by 4.",
      "total_reactions": 3,
      "user": "KJJ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "\"The Lorax\", a movie that teaches the kids to be hippies. \"It's for the environment, man\". Yeah, I get it, Global Warming. Oh, and there's music too so does that make it better? No.",
      "total_reactions": 3,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "While 'The Lorax' certainly has its visuals going for it, I doubt that anyone over the age of eight won't find it a little too cutesy and dumbed down to be a fitting adaptation of the book. It was really my personal favorite Dr. Seuss work because it was quiet, solemn, impacting, and so morally simple that anyone of any age could receive the message just as strongly. However, the adaptation of 'The Lorax' betrays all of those traits and settles for being fluffy, silly, and unambitious. I understand that with any adaptation of such short material that there is padding needed to take up time in a feature length film, but what they used is just so maddeningly against the book. The filmmakers crammed most of the movie with bombastically stupid musical numbers that are unmemorable and cute little side characters that are meant to resemble a little side treat similar to the minions in Despicable Me. Certainly, a better adaptation was due here, and it wasn't given. It's really a shame.",
      "total_reactions": 3,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "An awesome film, the cast is wow, I remember that when IÂ´m young, my mother read me all the night this incredible book of Dr. Seuss, and the film is wow, funny, colorful, is really sorpresive. The Lorax is incredible.",
      "total_reactions": 7,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I honestly don't know what the angry reviews  are about.  I loved the movie and so did my 5 year old daughter.  I could have done without the musical numbers, but the entire book is almost recited line by line in the movie.  The acting was great, and for all the complaints about Taylor Swift, she played such a minor role I don't know what people were complaining for.  The movie stays true to the heart of the story, (which I have been reading every night to my daughter for the last month).  Good movie, great message.",
      "total_reactions": 7,
      "user": "werecar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "At first glance this movie almost looks too cartoony even for theaters, but the charm, cute characters, a handful of funny moments, colorful visual style, and a decent storyline make this a fun to watch animated film. It'll probably stir a lot of controversy because of its nature vs. business plot but its still fun. Don't expect a fantastic ending though.",
      "total_reactions": 4,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This movie included an amazing cute factor bringing a huge smile to my face. I love almost everything Dr.Seuss has made and I will continue to enjoy his lively fun stories.",
      "total_reactions": 13,
      "user": "conboydude"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The Lorax is wonderful! I dodged axes, laughed a lot and nearly cried at the end and so did my 8 year old daughter. I strongly suggest seeing this in 3D.",
      "total_reactions": 8,
      "user": "foxie1976"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "I was hoping the Lorax would be better than this, but it wasn't.  I really liked the animation, and the acting was good.  However, this is really the kind of movie you should only see if you have a kid with you.  The movie is very cliched, and the songs are utterly forgettable.  For the record, this movie is not a bad movie.  It's just not the movie it could have been.  I wanted to love this movie, but it unfortunately just like it.  This movie pales in comparison to Pixar if you ask me.",
      "total_reactions": 4,
      "user": "cub317"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "When a Classic book is made into a screenplay, my emphasis is not on the quality of the movie, but how well it delivers the book's original message. As a short children's book is stretched to a feature length movie, I expect a healthy amount of Hollywood to be added, and the movie of course did that. The movie is fun, with a message. In contrast I feel the book delivers a message in a fun way. Overall, I believe the movie carries the books message. The only reason I did not rate it higher is the way the movie initially uses testosterone, instead of genuine concern, as the main force to leave the status-quo.",
      "total_reactions": 3,
      "user": "justlookin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The Lorax is everything that is fun put into an hour and a half movie. The story is beautiful and it really opens your eyes to nature, the visuals were gorgeous, the voices were picked perfectly for the chracters. This movie truly shows what our future could result in being, maybe not to the point where we buy air in bottles obviously, but a majority of the story is pretty accurate. This movie was fun, sad and then happy. The Lorax himself was hilarious and Danny Devito was perfect for his voice. The songs were unnecessary but they were catchy and they added to the fun of the film. I had an absolute blast with this movie and im 19 years old. If you don't enjoy this movie then you must either be really uptight and wayy too serious about your movies, or you just can't have fun in your life. The Lorax is pure joy and a wonderful story. I for sure had a very good time while watching it. I wouldn't say its worthy of a 10/10 but it was at least worth a 8/10.",
      "total_reactions": 3,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Just saw it with my mom and my kids.  Three generations who love the book.   We all enjoyed the movie.  Yes, it is different from the book; to fill an hour and a half they had to add to the story.  The message is still there, the style is definitely Seuss, the 3-D really popped (for the price, it better), worth seeing on the big screen.",
      "total_reactions": 2,
      "user": "mystampstore"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I can not even begin to stress how important it is that this movie has come out at this particular time. Despite what seemed like extreme hyperbole in 1971 when the book was written, every single bad aspect depicted within the pages is being witnessed all over the world. And it's only when we stop closing our eyes to the truth everywhere, open them, and stop believing the lies told to us by greedy dirt bags, that we can begin to start making positive changes for our environment, when we need it the most. There are so many trees we need to plant, so many species we need to save, and we need to protect our own health to. Humans \"are\" a cause of Earth pollution, but we can also be a part of the cure for the Earth health solution. This isn't just a film for kids, it's a film for the family, and for everyone to see. Because clean air, a healthy environment, and trees, are the things that everyone truly does need. (Okay, those last two rhymes were truly unintentional, but I think I've made my point!) Take the time to see this movie, and become enlightened today!",
      "total_reactions": 4,
      "user": "4EverGreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I think The Lorax is movie that can be used to teach kids about our environment. One way to teach children to be more sensitive to plants and nature is to have them grow the most sensitive plant of all - the TickleMe Plant. Though itâ",
      "total_reactions": 1,
      "user": "kidsgardener"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "the lorax is a movie based on Dr. suess's book. i thought the movie was very touching and teaches kids to be environmentally friendly. the songs in the movie were all different like thneedville was a song that opened the movie and described the town with detail. how bad can i be was a song that told what the once-ler was doing with the trees and how he thought it would improve life. the son let it grow would have to be my favorite because all the people of thneedville rose up and gave trees a shot and fought the power. i thought the movie was beautiful in so many different ways i loved it and im sure that anyone who sees it will too.",
      "total_reactions": 1,
      "user": "rategirl"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Nice idea...but the execution could have been better.  It came across as a little choppy. Also, it seemed to preach a little bit and that lost some of its entertaining aspect.",
      "total_reactions": 3,
      "user": "gkbos1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Dr. Seuss' The Lorax (2012) Is A Large Big Huge Ultra Topest Super Duper Greatest Goodest Movie in the world. It So Great and Good, I Love This Movie, About Tress and Also I Love this Theme Song \"Let It Grow\" (Celebrate the World) by Ester Dean",
      "total_reactions": 2,
      "user": "RickzsRock3D4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "this film really shock t me. didn't expect it to be as good as it lookt like. but overall the actors were chosen well and the scripting was done well. there is always something in a film that has its flaws. the books are always going to be different that's just the way things are...not much to be changed there.but to a surprising effect besides the book it was really done quit well. i give this a 9 really loved it. good work on this one :)",
      "total_reactions": 1,
      "user": "RedMoon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "47 out of 100! Are you serious? This is a good entertaining movie. It is perfect for children and adults alike. My 9 year old daughter spontaneously announced what she thought the movie was about without being asked. This is a great movie about making a difference. This is not a movie you would rent. This is a movie you would BUY! Do so when it comes out. Will be in the collection as soon as possible. (pft! ... 47 out of 100!)",
      "total_reactions": 3,
      "user": "shimano6000"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "I honestly do not believe that this movie is as bad as it seems. If Theodore \"Seuss\" Geisel had been alive long enough to see this, I don't think he would have hated it. It's definitely not the worst Seuss adaption out there (that dishonor belongs to The Cat in the Hat). It's very cute and the spirit of the book is still there. Like the book, the movie version does present the book's message, which is clearly explained in Seuss' memorable quote \"Unless someone like you cares a whole awful lot, nothing's going to get better, it's not\". I was a little surprised that they gave The Once-ler a face, seeing as he isn't given one in the book or in the 1972 animated version, but I can see why the filmmakers would give him a face here (clearly an effort to make him more a more wide eyed and sympathetic young man with good intentions). I can also see why the filmmakers expanded the book's setting (making the small town that is only mentioned once in the book this gigantic cultural center that believes that a nature-less society is the only way to live). This movie is supposed to be 90 minutes long after all. One thing I really loved about this movie was the humor. Most humor found in family and kid flicks nowadays relates to the toilet. Toilet humor is NOT funny!! The humor in this movie mainly comes from in jokes, wordplay, and the genuinely funny lines that the characters say (or in the case of the humming fish, sing). This is one of those adaptions that I recommend going into with an open mind. You need to be aware that the setting and original characters from the book were indeed expanded, some new characters are introduced, and other elements were changed (every movie adaption has changes after all). If you want a 100% faithful telling of the story, no expansion, and no new characters, then this isn't the movie for you (in fact, I'd recommend the 1972 version if that's the case), but if you're like me, and you want an adaption that at least tells the story and has genuinely funny moments, then you'll like this movie fine. Is it a masterpiece, not really no. Does it try to be good, yes it does.  I'm an adult and I very much enjoyed this and I'm certain that all age groups can get something out of this movie. Take it for what it's worth.",
      "total_reactions": 3,
      "user": "lightening816"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "An amazing movie with charm to please kids, and a bit of mature humor to please adults. But don't worry, your kids won't understand it. The Lorax was an amazing family movie, and could possibly be one of the best movies of 2012. And it also had a good message. Why can't we all just be good for the environment. Think about your grandchildren, who will never see a polar bear, or a tiger. Anyway Five stars., it was a very good movie.",
      "total_reactions": 1,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "I'm not sure what movie everyone else was watching but my family and I absolutely love The Lorax!",
      "total_reactions": 1,
      "user": "Ozzymorph"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "I was surprised about how much I liked this one. I wasn't expecting a whole lot but it was very cute and entertaining. I loved everything about it except one thing , the singing. The songs threw me off a bit but I still love it despite that.  In a nutshell, it's a movie that will just Cute you out.",
      "total_reactions": 2,
      "user": "Luv67"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "esta película tiene un mensaje claro y en toda la película lo repiten ademas de eso tiene una banda sonora exquisita y aunque no es la mejor adaptación de los libros del dr seuss es tierna flexible película    excelente",
      "total_reactions": 2,
      "user": "diego9901"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Though there were a few thingsthatt bothered me, I overall loved this movie. The thing that bothered me most was probably all the emphasis that was put on the story that never happened in the book or the first adaption. Another thing was the fact that The Once-ler was a human. That would've been fine, but why was he the only wearing the gloves? In the book his entire family wore them. They could've stayed true to the book if they would've just noticed that detail. But it overall an entertaining, cute and moving film that made me watch it five times in theaters.",
      "total_reactions": 1,
      "user": "MrsBBaggins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "This is a great movie. If you hate The Lorax, you're silly as J Bieber. The storyline is good, and my favourite part is when the chase happened at the end trying to get the seed. The huge guy and a North Korean looking midget versus This kid (forgot his name) and grandma, etc. Also, why did they have to inspect the house? Why did they get out of control over a tree seed? And I almost cried a little when A HORDE of Lorax's \"people\" ran or walked away. Why did this idiot chop down all of the tree? Many \"why\" in this movie but still a good film. The plot was pretty good. The characters are okay despite how strange they are. I got a little \"mad\" when the two on the bedboat almost fell down. The Lorax is a VERY great movie and I would recommend anyone to watch it. I also thought that this 1 family showed who's boss when they took down this wall.",
      "total_reactions": 1,
      "user": "Beastprogamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "The flashback scenes with The Lorax get an 8 out of 10. But the parts in the present day (apart from the ones with the once-ler) are a 5 or 6. See, the problem is that Some of the present day scenes are occasionally a bit cheesey. I mean, how does Ted's Grandmother even know about the Once-ler and that he knows a lot about trees?  Would O' Hare really have let that kind of information go around for a free thinking citizen to pick up and investigate? But nonetheless, Danny DeVito is simply brilliant as the Lorax. He steals every scene he's in and you feel relieved whenever he comes on screen. Watch it for him, I advise.",
      "total_reactions": 1,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "The Lorax may have an interesting story-telling, with unforgettable characters and a good message to offer, but only for young viewers; so teen viewers or adults would consider this film as just one other of Dr. Seuss, but nothing special...",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "The Lorax it isn't worst then The Cat in the Hat, but it has some things they couldn't do in the movie. Like the songs are really generic and boring, the other characters like Ted, the granny or the villain they not much interesting, and the message they try to put is really wrong. But, ¿Is the movie 100% wrong? No. The animation is nice, some jokes are funny, the voices of The Lorax and The Once Lear are really good, the ending when the Lorax come back is kind cute and when is the movie for the book is good, but when it isn't of the book is generic, and almost all the movie is not for the main character, the Lorax. ¿Is the worst Illumination movie ever? Not exactly, although that position still has it Hop, but yes, is generic and sometimes boring. The kids probably will enjoy it, the adults i don't know.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "A very poor version of the lorax that doesn't do anything good relating to the original story. It's just a music video with decent animation though. You would be better with watching the original movie on dvd, or just read the original book.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "The Lorax is incredible film of the year. Dr. Seuss animated movies about Horton Hears a Who! starring Jim Carrey and Steve Carell. But now they're making the Dr. Seuss movie How the Grinch Stole Christmas will be come out November 2018.",
      "total_reactions": 0,
      "user": "ceb1031"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2017
      },
      "score": 9,
      "text": "Personally, I think The Lorax is a wonderful movie. It's good entertainment while showing the problems with what cutting down trees does to the environment. I know that Dr. Suess hated capitalism, and he obviously shows that through this movie. The animation is absolutely wonderful and pleasing to the eye.",
      "total_reactions": 0,
      "user": "ede"
    }
  ],
  "metascore": 46,
  "name": "Dr. Seuss' The Lorax",
  "num_weekends": 20,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 2,
    "month": 3,
    "year": 2012
  },
  "opening_weekend_income": 70217070,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 80825,
  "rating_freq": {
    "1": 1640,
    "10": 8131,
    "2": 1123,
    "3": 2072,
    "4": 4054,
    "5": 8949,
    "6": 17773,
    "7": 20108,
    "8": 11759,
    "9": 5216
  },
  "release_day": 2,
  "release_month": "March",
  "release_year": 2012,
  "user_review_count": 200,
  "votes_per_demo": {
    "aged_18-29": 34774,
    "aged_30-44": 25354,
    "aged_45+": 5028,
    "aged_under_18": 550,
    "females": 20734,
    "females_aged_18-29": 12365,
    "females_aged_30-44": 5799,
    "females_aged_45+": 982,
    "females_under_18": 183,
    "imdb_staff": 12,
    "imdb_users": 80825,
    "males": 47960,
    "males_aged_18-29": 22071,
    "males_aged_30-44": 19237,
    "males_aged_45+": 3963,
    "males_under_18": 363,
    "non-us_users": 35126,
    "top_1000_voters": 406,
    "us_users": 15707
  },
  "year": 2012
}