{
  "avg_rating_per_demo": {
    "aged_18-29": 6.2,
    "aged_30-44": 6.1,
    "aged_45+": 6.0,
    "aged_under_18": 6.3,
    "females": 5.9,
    "females_aged_18-29": 6.0,
    "females_aged_30-44": 5.9,
    "females_aged_45+": 6.3,
    "females_under_18": 5.9,
    "imdb_staff": 6.3,
    "imdb_users": 6.1,
    "males": 6.2,
    "males_aged_18-29": 6.3,
    "males_aged_30-44": 6.1,
    "males_aged_45+": 5.9,
    "males_under_18": 6.5,
    "non-us_users": 6.1,
    "top_1000_voters": 5.5,
    "us_users": 6.3
  },
  "avg_screens": 14.0,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 15,
    "month": 11,
    "year": 2013
  },
  "critic_review_count": 155,
  "duration": 90,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 342936,
  "max_screens": 33,
  "mc_avg_user_score": 6.2,
  "mc_metascore": 71,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "Drinking Buddies",
  "mc_negative_rating_frequency": 16,
  "mc_positive_rating_frequency": 45,
  "mc_pro_critic_reviews": [
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "Drinking Buddies, Joe Swanberg’s nimble, knowing and altogether excellent new film, refuses to dance to the usual tune."
    },
    {
      "critic": "Zachary Wigon",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "With dexterity and care, Swanberg illuminates our muddled perceptions of our own relationships. He fixates on the minutiae of hanging out, the stuff of little loves and lies, the feints and thrusts we make in sorting matters of head and heart."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 91,
      "summary": "Swanberg once again shows a capacity for capturing small moments that exist outside the direction of the plot. At the same time, the effective fragments of \"Drinking Buddies\" take his oeuvre in a new direction by accumulating into a reworking big picture."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 88,
      "summary": "It's a meandering film that prompts the viewer to anticipate characters' actions. Fortunately, they don't take predictable paths."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 88,
      "summary": "Writer-director-editor Swanberg should actually get first billing, as it’s his touch that makes Drinking Buddies something special."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 83,
      "summary": "The actors all blend terrifically, making this the film equivalent of great hang time."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 82,
      "summary": "In a film about how hard it is to know what you want, and then to express it, Swanberg gets to the heart of the matters of the heart with disarming doses of both charm and wisdom."
    },
    {
      "critic": "Stephen Kelly",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 80,
      "summary": "Best of all, though, is the uneasy ring of truth, which will definitely still be with you the morning after."
    },
    {
      "critic": "Catherine Bray",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "It can be very funny, but there’s a bittersweet streak underpinning even the lightest moments."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "What makes Drinking Buddies so compelling is that feeling that these are real people, behaving in real ways."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Swanberg achieves an occasionally heady aura of improvisational flirtatiousness mixed with a churning will-they-or-won't-they suspense."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Drinking Buddies is full of relatable dilemmas, guileless moments of kindness and character-based humor."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 78,
      "summary": "Much has been made of the fact that Swanberg has cast for the first time bona fide movie stars and not just his mumblecore pals: In fact, it's the making of the movie. If you're going to build an entire film on microexpressions, then a certain innate magnetism is required. Swanberg gets it in spades from his top-shelf cast."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Here’s a toast to the cast and crew: Drinking Buddies is a three-dimensional movie that doesn’t require beer goggles."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Drinking Buddies is further evidence that Wilde has more depth and ambition than mainstream Hollywood can currently handle, and it marks Swanberg as one of the subtler talents of his generation — a deceptively casual moralist whose films observe their characters without judging them yet whose conclusions are unmistakable."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Not much happens in Drinking Buddies, which, frankly, is refreshing."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "All the actors are strong, but Wilde is particularly good as the impetuous Kate, who doesn’t realize how incredibly selfish she has become. The actress’ great beauty could have been a distraction, but her performance is so complex and alive that she blends right into this world of ordinary, working-class people with modest aspirations who are trying to find happiness but often go about it in all the wrong ways."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "This is a special movie. For almost 20 minutes, Drinking Buddies does almost nothing to indicate where the story is going or whether there is even going to be a story. And yet everything onscreen is interesting, because of the truth of the emotion and the specificity of detail."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "In some ways, it feels like an indie meditation on the eternal “When Harry Met Sally” question: Can men and women be just friends? Here, though, the focus is on the small, often unsaid moments that define a friendship — and a murky attraction."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "The entire film unfolds in a recognizable register of ominous hesitation; the results are a bit schematic but nevertheless hit on something real."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "We knew Livingston, Kendrick and Johnson (“Safety Not Guaranteed”) would work in this setting. But Wilde adds to the growing repertoire she showed off in “Deadfall” and “Butter,” films no one saw but which revealed that she’s a lot more than a pretty face."
    },
    {
      "critic": "Cory Everett",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Credit Swanberg who served as both director and editor for making a film that feels loose without ever being ponderous or phony."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Less precise and cohesive than much of Joe Swanberg's recent work, as its small, improvisational skeleton struggles to meet the demands of the more ambitious story it's trying to tell."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "It's an intriguing and distinctive story, soberly told."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The best thing you can say about the movie is that you couldn’t accuse it of being a sellout — nor would you think it was a Joe Swanberg movie."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 55,
      "summary": "If Drinking Buddies is meant to be his ticket into mainstream comedy, it feels mumblecore-ishly vague and rambling in its construction, like \"Hannah Takes the Stairs\" without the raffish charm."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The skillful quartet at the center of Drinking Buddies reveals the weaknesses in the material."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "It deserves credit for avoiding the conventions of romantic comedies and defying audience expectations, but only to a degree. Instead of hitting the expected notes and beats, Drinking Buddies instead ambles sideways. It’s headed nowhere in particular, but at least the voyage is pleasant."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Flat as day-old beer."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Relative to the major brands, the intimate, handcrafted approach should yield more flavor. Instead, Drinking Buddies offers mostly froth."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "Watching Drinking Buddies is like being the designated driver for a most uninteresting bunch of drinkers."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "If your looking to absolutely waste and destroy 90 minutes of ur life please I urge u to watch \"drinking buddies.\"",
      "total_reactions": 4,
      "user": "Yossi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "I chose to watch this movie as other reviews described it as \"very funny\", and \"a refreshing change of pace\" However, I found it outright terrible.  It started out well enough, and for the first half, it seemed like at any point, the plot might pick up, and go somewhere.  However, that was not the case.  It slowly ambled along, and by the end, you didn't feel like anything had happened.  Also, it is important to note that there was nothing I found remotely funny, except perhaps the fact that a movie this bad was even bade in the first place.",
      "total_reactions": 3,
      "user": "ThoolooExpress"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "Drinking Buddies finds itself looking into relationships, drinking and a combination of the two. It does so without very much originality or purpose. No, thank you!",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "This movie has no story. Its very long and very boring. They drink beer and that about it. Don't waist your time watching this horrible movie. It look like if a college student made a movie about his friend drinking beer.",
      "total_reactions": 1,
      "user": "Yareking"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "'Drinking Buddies' is a lethargic look at what happens when platonic friends tip-toe the line between friendly and flirty; that they drink is merely a device in which we're given to understand their commonplace. While the plot is essentially aimless for the first three-quarters of the movie, the actors hold your attention by slowly and gently stroking the tension, which comes to a head when Johnson's Luke helps Wilde's Gate move between Chicago apartments. Ultimately, the stars of 'Drinking Buddies' give us some fun-enough characters to hang out with for 90 minutes. The true feelings and prerogatives of the main characters are reserved but for a few meaningful moments, of which many are apparent to the audience only. Despite (and perhaps because of) the creative control the actors were given in terms of improvised dialogue, there's a lot of people not saying what they're thinking in this movie. It's that frustrating passive aggression that makes this film feel as authentic and at times as too-close-to-home hitting of any of Swanberg's films to date.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "I think this movie has the most natural acting I've seen in a long time. It feels like everyday people talking to each other. I don't know if there was a script for this film, because it definitely felt like the cast were improvising. It doesn't matter, though, because their performances were interesting anyway. Especially Olivia Wilde and Jake Johnson.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "I had an inkling on how Drinking Buddies was going to end going in but being right didn't mean I didn't enjoy the overall experience because I did. In fact its a smart and well directed film with a fresh improvised style that makes the film performances shine so much that it ultimately didn't matter how the film ended, the ride was enough. The film follows best friends Kate (Olivia Wilde) and Luke (Jake Johnson) who work at a Chicago brewery together. When Kate and Luke introduce each other to their respective partners things start to change for these two friends even though they don't realize it is happening. Director Joe Swanberg, uses his unique filming and story telling techniques to bring new life to a story as old as time. While an unrequited love story is my Kryptonite, Drinking Buddies is the anti rom-com, rom-com as it isn't concerned with the trivial questions of who ends up with who, it's a tale of life  not just for Kate and Luke but everyone. It's a story of personality, how these people interact with each other, warts and all. Joined by Anna Kendrick as Luke's partner Jill and Ron Livingston as Kate's partner Chris. Kendrick turns in yet another stand out performance as a supposedly chilled out yet secretly neurotic girl seeking more from Luke, a man with a serious commitment phobia. Livingston is an unexpected touch but an excellent choice none the less. The real highlight though is Olivia Wilde who proves her worth after a slew of bad film appearances (Cowboys and Aliens,  Ultimately a film like this doesn't come along very often despite Swanberg's impressive film turnout over the last 9 years and we should embrace it for what it is, a heartfelt look at the frustrating nature of man and their ability to miss the simplest of things. While a little long it all comes down to your personal taste as the film is all about the little things, the small inconsequential moments that make up a persons life. If that's not your thing thats fine but if it is your going to love it.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "Drinking Buddies is far from a bad film and at its very best, it is a very good film. The acting is good and I love the minimalist nature of it. It all feels very natural and the relationships depicted felt very authentic, making the film all the much better. However, the film certainly lacked that \"it\" factor. It may not be bad, but it certainly was missing that special something that made it good and ultimately, lacked interest at many moments and felt very long for a 90 minute film, which is typically a bad thing. The story flowed well for the most part, though it did feel kind of rushed at times and I thought the story was told well for the most part. In addition, the direction was solid and got the job done. Thus, as a whole, Drinking Buddies is a very made, even if not overly entertaining film that provides just enough to get the job done.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Solid acting from the four leads, but it sagged in a few places. It was an interesting story, the writing was solid, but I wasn't thoroughly engaged throughout. But it was still enjoyable and unique, at least.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "This is a solid film based on the strong chemistry between the four leads.  Unfortunately I felt that there was just something missing when it came to getting a good feel for the characters. B-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "Drinking Buddies suffers from a plot too simplistic with characters that are beautifully portrayed but sadly, don't have much to do in this occasionally boring film that attempts to delve deeper into human emotions but only sometimes does it accomplish its goal.",
      "total_reactions": 0,
      "user": "CheapSeats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Drinking Buddies is one of the biggest sorprises of this year, the story could be familiar, but the development is really great (ok, sometimes falls into the known), the script is really smart, and the performances are wow, incredible, Anna Kendrick, Olivia Wilde, Jake M. Johnson and Ron Livingston do a good job. Great movie.",
      "total_reactions": 0,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Plot: Luke and Kate are co-workers at a Chicago brewery, where they spend their days drinking and flirting. They’re perfect for each other, except that they’re both in relationships. Luke is in the midst of marriage talks with his girlfriend of six years, Kate is playing it cool with her music producer boyfriend Chris. But you know what makes the line between “friends” and “more than friends” really blurry? Beer.  Drinking Buddies (2013)",
      "total_reactions": 0,
      "user": "movielandia1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "This is the worst movie I've seen during 2013.  The best part is when the male lead broke his hand.",
      "total_reactions": 0,
      "user": "olivialin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "The actors are all outstanding, and the film ends well. Unfortunately, much of what comes before is quite boring, and the improvisation actually begins to feel a bit tedious at times.",
      "total_reactions": 0,
      "user": "ambender"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Watch this on Sunday when you are extremely tired, so that when you fall asleep you have not wasted any of your time in this incredibly boring, pointless movie.",
      "total_reactions": 0,
      "user": "sailfish9229"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 1,
      "text": "Honestly, I just watched this movie because of Anna Kendrick. I thought this will make me feel giddy. BUT I realize, i wasted my money and my PRECIOUS time just to watched this BORING movie.",
      "total_reactions": 0,
      "user": "ixhuxhuyou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Small film about a brewery and it's workers, specifically two couples. The film is Marketed as something it isn't, mainstream.",
      "total_reactions": 0,
      "user": "clayscottbrown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "The film has great performances by a very talented cast - in particular, Olivia Wilde, Jake Johnson and Anna Kendrick turn in really good work, and the style of the film - apparently called 'mumblecore' - makes it feel like we are witnessing actual conversations between real people.",
      "total_reactions": 0,
      "user": "greebs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "I don't remember the last time I hated a film so much that it actually angered me. What an unbelievable waste of time and talent. Everything about this film is trite, worthless and just plain stupid. 4 white people (who have zero personality and no likable traits whatsoever) who work at a brewery (wow, such great escapism...) get drunk a lot (seriously how many friggin glasses of beer did they have to guzzle to get through filming this crap?) hook up, cheat on each other and eventually just swap spouses. How life changing. It's a typical story line we've definitely seen before and I couldn't find a single unique element that would make it worth watching. \"But there are so many positive reviews! Why is that?\" I'll tell you why: Olivia Wilde nude (Yeah, big whoop. She has no body whatsoever) The biggest problem I have with this film is that critics called it a Comedy. Really? Show me which part made you laugh because I didn't even count 1 attempt to be funny in the entire film. I'm not even joking. This was the most un-comedic comedy film I have ever seen. If your idea of 'comedy' is a really dull and depressing love triangle with zero jokes, then yeah this is pretty side-splitting. In all seriousness, F*** all the people involved in making this piece of sh**. I should have been weary as soon as I saw the title of the film, which is probably the most un-intriguing, underwhelming choice of words in the history of film. I gave this \"film\" a chance because I liked the cast. But the only drinking this movie made me want to do is drinking myself to death.",
      "total_reactions": 0,
      "user": "leelustig"
    }
  ],
  "metascore": 71,
  "name": "Drinking Buddies",
  "num_weekends": 8,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 23,
    "month": 8,
    "year": 2013
  },
  "opening_weekend_income": 19505,
  "opening_weekend_income_currency": "$",
  "rating": 6.1,
  "rating_count": 47804,
  "rating_freq": {
    "1": 1301,
    "10": 1604,
    "2": 1069,
    "3": 1688,
    "4": 3380,
    "5": 7070,
    "6": 12077,
    "7": 11895,
    "8": 5935,
    "9": 1785
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 107,
  "votes_per_demo": {
    "aged_18-29": 20623,
    "aged_30-44": 17124,
    "aged_45+": 2363,
    "aged_under_18": 37,
    "females": 11066,
    "females_aged_18-29": 6530,
    "females_aged_30-44": 3516,
    "females_aged_45+": 418,
    "females_under_18": 17,
    "imdb_staff": 9,
    "imdb_users": 47804,
    "males": 30353,
    "males_aged_18-29": 13823,
    "males_aged_30-44": 13350,
    "males_aged_45+": 1905,
    "males_under_18": 20,
    "non-us_users": 24248,
    "top_1000_voters": 252,
    "us_users": 8961
  },
  "year": 2013
}