{
  "avg_rating_per_demo": {
    "aged_18-29": 7.2,
    "aged_30-44": 7.0,
    "aged_45+": 7.0,
    "aged_under_18": 7.4,
    "females": 7.2,
    "females_aged_18-29": 7.3,
    "females_aged_30-44": 7.1,
    "females_aged_45+": 7.2,
    "females_under_18": 7.9,
    "imdb_staff": 7.1,
    "imdb_users": 7.1,
    "males": 7.0,
    "males_aged_18-29": 7.1,
    "males_aged_30-44": 7.0,
    "males_aged_45+": 7.0,
    "males_under_18": 7.3,
    "non-us_users": 7.0,
    "top_1000_voters": 6.4,
    "us_users": 7.0
  },
  "avg_screens": 1319.2857142857142,
  "budget": 55000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 11,
    "year": 2015
  },
  "critic_review_count": 368,
  "duration": 121,
  "genres": [
    "adventure",
    "biography",
    "drama"
  ],
  "gross_income": 43247140,
  "max_screens": 3009,
  "mc_avg_user_score": 7.0,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 79,
  "mc_movie_name": "Everest",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 207,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 89,
      "summary": "This is a movie you feel deeply in the pit of your stomach. Sometimes, it literally hurts to watch it."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 88,
      "summary": "The mountain, grim and unforgiving, remains the star."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2015
      },
      "score": 88,
      "summary": "This is what filmed spectacle used to look like — a  trip to a place or time most of us could never see."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 83,
      "summary": "It lacks the same constant surprises of last year's \"Gravity\" or the visual poetry of \"Mad Max: Fury Road,\" but Kormákur's movie nonetheless marks the rare fusion of effective craftsmanship with focused storytelling."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "It succeeds wonderfully, offering moviegoers a rare taste of rarified air -- and as compelling an argument as you can make for seeing a movie writ large on the oversized screen of an actual movie theater."
    },
    {
      "critic": "Jacob Hall",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "Like the mountain for which it’s named, Everest is rock solid. It’s big, it’s beautiful, it’s terrifying, and it’s merciless to both its characters and the audience."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "Kormákur creates such a convincing world – the craft of this film is astonishing – that you’re willing to forgive its less delicate touches in favour of its totally compelling depiction of what it must be like to ascend into a place that’s heaven one moment and hell the very next."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 80,
      "summary": "With its perilous central premise and gallery of individuals some of whom are destined not to make it, you could say Everest is a disaster movie in the old Hollywood sense of the term, but it doesn't feel like one. And that's a good thing."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "There is no tragic hero here; there is no overarching explanation, but a movie that offered either of those would seem pretty pat. Take it or leave, Everest is just there."
    },
    {
      "critic": "Katie Rife",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "Part IMAX nature documentary and part Hollywood disaster movie, it does an effective job of conveying what it’s like to climb the mountain, the hours and days spent acclimating on practice hikes, and the punishing physical effects that accompany each subsequent change of altitude."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "In this case, character development is neglected in favor of awe-inspiring views. There are times when we feel like we're on the mountain. Unfortunately, our companions - the men and women populating the screen - are never more than half-formed."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "Director Baltasar Kormákur (“2 Guns”) and his cast craft a lean narrative tone that humanizes the action without an excess of gloss."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "There have been plenty of mountaineering documentaries over the last few years, and Everest suffers in comparison to them simply by being a dramatization. As realistic as the effects are (and you can occasionally tell when a shot is green-screened), you're still aware on a gut level that Jason Clarke and Josh Brolin were not actually filmed at 29,000 feet above sea level."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "There's only one star in this movie: Everest. Kormákur couldn't shoot higher than base camp, around 14,000 feet, without sickening the actors. But a crew traveled to the top to get footage, while much of the climbing was shot in the Dolomites. No matter. You watch Everest and you believe."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2015
      },
      "score": 75,
      "summary": "Based on true events, filled with stunning visuals and featuring more than a half-dozen of our best actors delivering solid performances, Baltasar Kormakur’s Everest is a high-altitude roller coaster ride that will leave you drained."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 70,
      "summary": "Everest may disappoint those looking for a more awe-inspiring film with big vistas and jaw-dropping stunts and acts of surreal heroism. Unlike many mountain-disaster stories, this is the kind that makes you never want to look at a mountain again."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 70,
      "summary": "Kormakur doesn’t make the mistake of exalting his subjects as extraordinary individuals, or suggesting that they were obeying some sort of noble higher calling. Everest is blunt, businesslike and — as it begins its long march through the death zone — something of an achievement."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 67,
      "summary": "Director Baltasar Kormakur (2 Guns) essentially made a faux documentary with big stars and better lighting."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 67,
      "summary": "When the lights come up, you don’t want to feel like you’ve watched a ­better Cliffhanger. You want to understand the tragedy you’ve just watched. Yes, you want to be entertained, but you also want the icy, whipping wind of reality to sting."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 67,
      "summary": "Salvatore Totino's crisp 3D photography and Kormakur's way with a clear, fluid, thrilling action sequence show off the mountain in immensely impressive ways. But the humans involved get short shrift."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 63,
      "summary": "There’s a resemblance here to both the story and the movie adaptation of the story told in “The Perfect Storm.” The characters involved are making a good faith effort—but good faith efforts by humans can only go so far."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 63,
      "summary": "It feels less like an cautionary adventure movie or the classy Hollywood equivalent of a Reader's Digest \"Drama in Real Life\" and much more like a disaster epic."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 63,
      "summary": "Everest gets several things right, but it fails to find a way to make the average viewer relate to the people on the mountain."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 63,
      "summary": "A fairly good, extremely grueling movie as far as it goes — tracks the true-life fortunes of a battered group of climbers to the highest place on Earth. Yet somehow it doesn't go far enough."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "Though there is heroism as well as love here, because it involves the deaths of people we have come to care about, Everest is finally a sad story, though not always a dramatically involving one."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "Everest is a sprawling mess of a movie, one you feel like could have been great but instead roams all over the place and winds up being just pretty good."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "Everest is visually splendid, though it loses a few points for its murkiness in rendering its main characters as distinct individuals."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "A valiant effort that never quite scales the dizzy emotional heights required, running out of oxygen in the final act. Visually, though, it’s stunning."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "Spectacular and well-acted, this suffers from much the same problem as the situation it depicts — too many people on the mountain and too many threads to follow so that affecting individual stories get lost in the snow."
    },
    {
      "critic": "John Bleasdale",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "Ultimately, Everest is not concerned with the why, but with the how and it's grimly efficient at building up the drama, helped on by Clarke's wonderful character study, even if the film as a whole never quite reaches the dizzying heights of its subject."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "The hardship of the trek is vividly and stomach-lurchingly portrayed, particularly when the storm sets in, but it never makes the crucial leap from the screen into your bones."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 60,
      "summary": "This is one of those cases where fictionalizing a true event, or at least fusing two or three real people into one composite character, might have resulted in tighter storytelling."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2015
      },
      "score": 50,
      "summary": "Everest, in short, suffers from the same problem as Everest: overcrowding."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 50,
      "summary": "The feature film Everest provides soaring visuals, but it’s a distant second in terms of storytelling depth and narrative impact."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 50,
      "summary": "Though it assembles a first-rate cast in a story taken from reality, Everest feels icebound and strangely abstract, lacking the gravity of genuine tragedy or the swagger of first-rate adventure."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 50,
      "summary": "While it’s impossible not to be somewhat caught up in these climbers’ life-or-death struggle, Everest is oddly uninvolving — it depicts a horrific scenario in an underwhelming, distancing way."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2015
      },
      "score": 40,
      "summary": "Everest is a frustrating movie in many ways – despite some lurches and shocks, it doesn’t quite deliver the edge-of-your-seat thrills that many were hoping for, and all those moderately engaging characters mean that there is no centrally powerful character."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 30,
      "summary": "The director was Baltasar Kormákur, a gifted filmmaker from Iceland who shouldn’t be blamed for a case of industrial filmmaking gone wrong — the culprits in elaborate clunkers like this are usually the producers and the studios."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "On a technical scale, \"Everest\" is breathtaking and capable of offering visceral thrills enough to keep the attention of its audience. On a human level, however, this is a disappointingly underdeveloped affair that comes across as a squandered opportunity more than anything else. This particular story demands and deserves far more of an introspection into the tragedy of that fateful day in May 1996 that killed 12 people; the social issues that surround it; and the immense personal cost to those left behind. The film's screenplay offers little to none of this and the emotion it possesses can be sourced in the remarkable and committed performances of an accomplished ensemble - Josh Brolin, Jason Clarke, Jake Gyllenhaal, Keira Knightley and Emily Watson throw themselves into their respective roles one hundred percent, both physically and emotionally. The acting aside, I feel as though there was a lot more emotion below the surface, waiting to be discovered. It's unfortunate that the film doesn't take the chance to try and find it.",
      "total_reactions": 2,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Movies about attempts to scale the titular peak have been made before and probably better. This one's based on a real expedition that was plagued by harsh weather and other dooming circumstances. The first hour is spent setting up the characters as they prep for the big climb. The 2nd half takes the trek with methodical detail. Even though there are perilous moments, they seldom create much apprehension or drama. The cinematography offers incredible vistas and perilous perches that are even more dizzying in 3D. If you're into mountain adventures, there's enough here to like, but as cinema, it's less than gripping.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Decided to check this out this week since it's only playing in IMAX 3D for its first week and I thought it looked decent and intense. All I can say is man, what a disappointment! First off, the 3D felt so pointless and didn't invest me any further into the film. Hell, halfway through I pretty much lost interest and didn't really care anymore. Also, the cast felt wasted. For such a great ensemble, everyone's acting was surprisingly mediocre. The middle act felt cluttered and overstuffed with too much happening all at once that it was hard to keep track of all the characters and what was happening to them. And last but not least, the ending was depressing as hell with very little payoff. Yes I understand that these are facts and it was a true story, but that doesn't change the fact that it still put me in a downer mood as I left the theater. Overall, not as near intense as I would've liked and a waste of 3D, talent, and potential. Oh and did I mention that the ending's depressing?",
      "total_reactions": 1,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "I think the build up was very strong, and i enjoyed the film overall. However, i wanted it to end, and I hate that feeling. I think the s enes with the wives and family at the end did not flow well with the film. Amazing cinematography.",
      "total_reactions": 1,
      "user": "jrodfilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "What killed this movie for me the most was their attempt at \"docu-dramism\" where they tried too much to be almost a documentary rather than a dramatic film. Things are told but never felt. You know some things about the characters but you never get to know them. There is little time spent in establishing them as people.",
      "total_reactions": 1,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "I'm not generally a fan of epics or big-budget, commercial films, though I took a chance and went in to watch this one. It was a dissappointing experience. As I expected, having Robin Wright's, Keira Knightley's, Jake Gyllenhaal's big names on the promotional poster was a farse - they only have about 15 minutes of screentime combined. Initially, it was exciting to see blend between the director's beautiful, dramatic shots and the crisp cinematography. As the movie played out, it became clear the characters were severly underwritten. Josh Brolin, actually, was the only well-known actor who had a significant part. His character was the worst. Ultimately, the characters I least kind-of liked were the ones that survived. I know this is based on real events, but it felt melodramatic. Still, it's not any worse Alive, which I hated.",
      "total_reactions": 1,
      "user": "carlosgz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Everest's highlights is that it is so well filmed it makes you feel as if it is actually filmed on Mt Everest and it greatly depicts the actually events that happened in 1996 using there fantastic ensemble cast. However I found that the film was great lacking a sense of drama and some of the cast like Knightley seemed to sound more Australian than Kiwi. After watching the trailer I was expecting a more high intensity film which I didn't quite get when seeing the actual film. It is worth seeing but don't have your hopes too high.",
      "total_reactions": 1,
      "user": "WillCole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "\"Everest\" is full of uninteresting characters, a dull plot and it is more of a documentary than it is a movie. In the end, \"Everest\" has very little joy in it and never lives up to the hype.",
      "total_reactions": 1,
      "user": "Szen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "I think this subject is much too complicated to be properly explored in the feature film format. As such anyone familiar with the already widely reported events of that day will find the film superficial and unsatisfying.",
      "total_reactions": 1,
      "user": "mika577"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "This movie was overall a fairly good movie. The acting was relatively good, while the movie continued to give out solid suspense throughout it. Unfortunately, it could have done a better job at making the audience feel as if they were actually in the mountains than it did.",
      "total_reactions": 1,
      "user": "Movie_Stuff"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Stunning cinematography, gripping circumstances and a brilliant cast should make for an epic film. Unfortunately, whilst there are some good moments, this was an underwhelming experience. The pacing was poor, with a climax which fails to engage the audience emotionally, and you're left feeling as though you should have cared more about the real people who were a part of the journey. A mediocre film that's visually arresting but otherwise disappointing. 5.34/10",
      "total_reactions": 6,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "1996 - The deadliest year (19 fatalities) ever on Mount Everest during a trek, chronicled by writer Jon Krakaeur in \"Into Thin Air\". With 1 fatality for every four successful hikes to the summit, what does it take for one to dare into Mount Everest's \"death zone\". Man is it simple named that way? With low-oxygen and harsh and rapidly changing weather conditions, Director Baltasar Komakur provides us the ultimate experience and this is the closest most of us viewers are ever going to get to scaling the world's highest peak.",
      "total_reactions": 6,
      "user": "GangKutti"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "I might not have been ready for the kind of movie I just watched because this was a deeply emotional and visceral disaster film. I was expecting a little more of a mindless action thriller than the amount thematic depth that I actually got, and it was a very memorable and intense ride. Everest dramatizes the 1996 Everest disaster that lead to the deaths of eight people, and the movie involves two groups that get caught in a violent storm while climbing Mount Everest. It actually takes a while to get to the real meat of the story. Maybe 40 minutes pass before the storm is even referenced, but the movie gets so intense and emotional during the last half that it makes up for the slow pacing of the first half. Luckily, the slower first half allows us to get to know each character, their motives to climbing the mountain and each of their backstories. The second half is so much more effective because of this. One thing that bothered me about the film were these random lapses in time that were distracting at times. One moment it would maybe be 2:30 PM, and thirty seconds later, it'll be 5:00 PM. Some of the transitions just felt choppy, but it's not such a big deal that it takes away from the film. Everest is a movie that grabs you and takes your breath away for 2 hours, and it's one that you need to see in the theater.",
      "total_reactions": 3,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Everest was not a movie that I was really looking forward too, I was not really expecting much when I entered the theater. But boy am I glad that I went to see this movie, it looks beautiful, every single performance is amazing. I really cared for the characters and that is what the director does at the beginning of the movie, he makes you fall in love with the characters and then you get sad when they start to die. The top performers were probably Jake Gylenhaal, Josh Brolin, and Jason Clarke, those were the best but I think all of them did really good. I was fun to see Sam Worthington in a good roll. Every character in the film was amazing and every shot in the movie was amazing!",
      "total_reactions": 3,
      "user": "spencie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Glorious at its name, the film is not a blockbuster with intense actions or CGIs, thanks to its original source from a true story in 1996, it works well as an adventurous hiking drama. The beginning is pretty surprising as it does not drag much and straight progressing to Nepal, followed by preparation for the climb and then most of the second half turns into a terrifying experience struggling to survive. At certain parts, there's some flaws of jumping scenes due to editing and it's quite confusing to track who is who due to too many characters but the cast has delivered promising performances and the stunning cinematography has brought audiences the great scenery of the peaks. The journey ends in an inspiring way that even though hiking is challenging, the psychology to deal with death and to face the reality are the hardest in life.",
      "total_reactions": 4,
      "user": "michael1208"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Everest soars high to great heights, thanks to terrific performances, great and spectacular visual effects, and research to make history come back to life. It would have been better if the film was released on May 2016, 20 years after the disaster. Thanks to 3D VFX and groundbreaking, new generation computer generated imagery, it even makes the audience feel like mountain climbers crossing tough terrain to achieve the near impossible with powerful portrayal of love, loss, bravery and friendship through the viewers eyes.",
      "total_reactions": 4,
      "user": "toronto905"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Icelander Baltasar Kormákur, whose career starts with 101 REYKJAVIK (2000), is another European talent recruited by Hollywood, after two mediocre Mark Wahlberg’s star vehicles CONTRABAND (2012) and 2 GUNS (2013), his latest is an ambitious USA, UK and Iceland co-production retells the story of 1996 Mount Everest disaster, and it just opened this year’s Venice film festival, and now a 3D format arrives in the local multiplex.",
      "total_reactions": 2,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "I found it a fairly bland disaster film personally.",
      "total_reactions": 2,
      "user": "nascent"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Visually thrilling, but lacks substance. Actors are absolutely wasted, especially Robin Wright. The writing is very weak, but the directing is respectable. Jason Clarke is good as the leading man. Ultimately, it could have been so much more, and comes out as a disappointment.",
      "total_reactions": 2,
      "user": "NickLikesMovies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Major props go to Jason Clarke and Baltasar Kormakur for turning what could have been a superficial, high-octane cash grab into a truly meaningful, character-driven cautionary tale of survival and the limits of human exertion.",
      "total_reactions": 2,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "I found Everest to be a very powerful film. I agree that the characters could have used more development, particularly Scott Fischer (Jake Gyllenhaal), but I still experienced a roller coaster of emotions from seeing the tragedy unfold.",
      "total_reactions": 2,
      "user": "Nathonas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Having read Jon Krakauer’s riveting account of these events in his book, Into Thin Air, I was really looking forward to this movie.  But, after reading some of the User Reviews here on Metacritic, I had lowered expectations and almost didn't go see it.  That being said, Everest exceeded my expectations.",
      "total_reactions": 2,
      "user": "Axgrinder"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Longest movie I have seen from this year so far. \"Everest\" is the kind of films that makes you more stunned for its sheer of spectacle but less with substance, which is lacking in plotting in this movie's case. Loved the group's dynamic, though the dialogue was really clichéd at points, particularly when Rob was talking with his wife Jan over the phone. The whole \"I love you,  I miss you so much\" bit is a factor that has been driving me insane in almost every movie about survival. It doesn't help much the fact that these characters aren't developed enough, despite the film having enough runtime to do that, but instead, it ultimately focus on its undoubtedly impressive setting and the tension setup. Another thing that bogged the movie itself a little was the lack of narrative heft. Sure, the performances are great (kudos to Josh Brolin, Jason Clake and Jake Gyllenhaal who did an amazing job in this picture), however, as whole, there was not enough narrative terrain to make \"Everest\" reach the landmark of better movies, such as \"Saving Private Ryan\" or \"Life of Pi\". I'm gonna give, though, a fairly reasonable score due to the solid direction, exuberant cinematography and pretty visuals, but it's not a movie I would recommend, unless you're planning on see it in 3D.",
      "total_reactions": 2,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Nicely done, great cinematography. We actually feel cold while watching Everest. The cast is superb, especially Clarke, Brolin, Hawkes and Knightley. Gyllenhaal is amazing but his character lacks development so as the other ones. Despite the interesting and moving stories of the main roles, this movie is more of a documentary about the 1996 tragedy. The loyalty and details in the narrative sometimes make it looks like a BBC film or something. Script's attention to the fact itself also jeopardizes dialogues and characters a little bit. The final result is definitely entertaining and good but it lacks the cinematic language we expect while watching a film.",
      "total_reactions": 2,
      "user": "danipp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Never again will I look at a mountain the same way after seeing this movie.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "If your looking for a convenient plot then turn around and walk into Pan because this film is hard to watch at times. This film is defies film stereo types in what is probably the most depressing, grim and just straight up hard to watch movie to come out this year. The lead in this film is shared by both Jason Clark and Mount Everest itself. Jason Clark kills it as Rob Hall and shows no flaws in what might be an Oscar contending performance. Support was equally as impressive with people like Jake Gyllenhaal, Josh Brolin, Keira Knightley and Sam Worthington. Josh Brolin was easily the strongest of the supporting cast although like i said they were all very good. The only place this movie lacks is in developing the relationship between Rob Hall(Jason Clark) and his wife Jan Arnold (Keira Knightley). Now lets get to Mount Everest in the film because it is both the most beautiful and terrifying thing about this movie. They did a great job of outlining the dangers of this beast but also showing off its beauty. Overall a great film and a must watch.",
      "total_reactions": 2,
      "user": "KizerCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Right off the bat ‘Everest’ is visually impressive with a mix of sound stage work and real location shooting in the Italian Alps and parts of Everest itself, the combination provides impressive and foreboding panoramas plus tense and perilous sequences.",
      "total_reactions": 5,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Edge of seat stress for 2 hours. Great thriller, some clunky plot and character lines, but overall very good.",
      "total_reactions": 3,
      "user": "Fastpoose"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Documentary type movie. No great scenario or acting. It is a focus on mountains climbing, an adventurous deadly sport whose details are not known and whose technicalities are not explored. No actor took the camera, just the furious nature. Sometimes a feeling of boredom reigns at the first half and a sense of anxiety at the second half. A learning that is interesting to know more than a movie to enjoy.",
      "total_reactions": 3,
      "user": "Hfahmy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Heart stopping thrills, brilliant cinamtography, and a solid cast are the highlights of Everest. It certainly is a stomach churning, brain turning and cold as hell movie. Some scenes felt so real that I actually felt bad for Jason Clarke and Josh Brolin and CO, as they fall down a grazing mountain to their grisly deaths, but they don't. Everest is the true story of the first men to reach Mount Everest, and their survival in the deep zero cold. First of all, the acting is great, each character shows major emotion and strong feelings that makes their character feel more real. But, why a 7/10 then? Because Everest tired and tried but it felt open ended and unneeded. The writing is rushed, feels like drama class lines. Direction is bare minimum with actors winding about in some scenes. But, if you crave perilous entertainment, Everest is the pick for your week.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "If you have ever thought how cool it would be to climb Everest, you need to see this movie.  Based loosely (according to writer Jon Krakauer who was there and wrote about it) on an incident in May 1996.  There were too many people trying to climb the summit on the same day, ladders weren't in place and oxygen tanks were not full or where they were supposed to be.  And, on top of all that, an epic storm blew in and put everyone in extreme jeopardy.  The movie focuses on one group and their guide, New Zealander Rob Hall, and peripherally, another group, led by Jake Gyllenhaal's character.  The movie somehow makes you feel you are there, climbing, freezing, huffing and puffing, and exhausted right along with the climbers.  It all looked very real to me and I couldn't tell what was or wasn't the real Everest, Base Camp and higher up camp areas.  It all looked real to me.  Whether you know how it all ends or not, it is a real life thrill ride.  Suspenseful and riveting.",
      "total_reactions": 3,
      "user": "Acacia"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Everest was not ask good as I thought it would be, but I didn't walk out of the theatre mad about how bad it was. It takes a little time to pick up, but after that it gets better and better, and ends up at a 6/10.",
      "total_reactions": 3,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "This movie does with mountains and snow, what Gravity did for space. I don’t think I can ever look at Everest the same way again. Always thinking it’s just another mountain. The incredible imagery in this film really makes you feel so close to it. You can feel every part of its cold and dark frost on your face.",
      "total_reactions": 3,
      "user": "NathanDrake007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "One of best uses of IMAX 3D ever. Felt like I was there clinging to the cliffs. Had to put on my hoodie cuz I was freezing along with them. Very intense scenes to keep you involved.",
      "total_reactions": 3,
      "user": "shane7777w"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "SHORT REVIEW: I thought this film was okay, it wasn't quite as brilliant or big-scale like 'Gravity' (2013) was...but it was an intense, 3D experience. Plus, it will scare you from going mountain climbing.",
      "total_reactions": 4,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "\"Everest\"is the true story of the ill fated 1996 expedition by a group of amateur and professional climbers who sought to reach the top of this most difficult of all mountains to ascend. The film stars Jason Clark who portrays Rob Hall, the real life leader of the expedition. Mr. Clark is  ably abetted by Keira Knightley, John Hawkes, Jake Gyllenhaal, Robin Wright, Josh Brolin and Emily Watson. Written by William Nicholson and Simon Beaufoy, the movie was directed by Icelandic director Baltesar  Kormakur whose deft hand and skill help make this 121 minute film move at a very comfortable pace. Of course the real star of the film is Mt. Everest itself for it is the dominance of this natural edifice that controls and ultimately destroys so many who have challenged it. Chronicled in the best seller by Jon Krakauer  (\"Into Thin Air\")  the film plays more like a documentary and its realism is the essence as to why this film is so good. As stated by Mr. Clark's character in the film, these climbers are asked to exist at an altitude level equal to that which 747’s fly. A most amazing feat and one that tests the stamina and sensibilities of both the characters in the film and those in the audience watching it. I give the film an 8.0 with a suggestion that it be seen in 3D for the cinematography and views of the mountain are alone well worth the extra price of admission.",
      "total_reactions": 2,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Great acting performances, and the special effects are pretty amazing. Well worth seeing.  If you've got vertigo to the slightest degree, this one might be tough to stomach.  This film really has an all-star cast - and they're uniformly excellent.",
      "total_reactions": 1,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Everest is able to more than adequately balance the thrill and devastation on the mountain with the heartbreak of families thousands of miles away. Don’t be fooled by the ensemble cast, each member packs a punch.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Everest is an absolute thrill ride that needs to be experienced in IMAX 3D. Featuring solid acting and a decent emotional story, the real success of Everest comes with the incredible visuals and special effects. Honestly, I felt cold felt watching these guys try to climb Mt. Everest successfully. As a story, it may feel generic and the guys who are portrayed here do deserve a better film about their true story and their life as guides on Everest. However, this one does do a decent job telling their story and certainly treats its real life people with tremendous respect and grace. Just because the story takes a backseat to the visuals does not mean it is ignored. An obvious front runner for numerous technical Academy Awards, Everest is a visual wonder that pulls all out of the stops visually and emotionally as you watch their harrowing climb and tragic demise.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "I came to the theater not knowing anything about the original story and watching Everest was such an exciting, unpredictable, and emotional ride. It's not one of those movies that you would expect to have amazing writing because the idea of this movie is telling a simple true story and the only thing that would make this work is through the actors.",
      "total_reactions": 1,
      "user": "emperorpenguin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "That the delights of climbing Mount Everest would be fairly resistible to most people is ably demonstrated in Everest, a well written and exciting adventure yarn that may be just a tad overlong. Based on a true story about one particular expedition that, due to appalling weather conditions, resulted in the loss of lives and the shattering of others. From the beginning the film successfully draws us into the necessary preparation needed to undertake such a massive venture and the pace, though measured, keeps one constantly engaged. Once on the climb things become quite tense. Stunning visuals of the mountain from all sides are sure to give vertigo sufferers reason to look away even if it is these snow swept images that provide the film with its tension. The camera work is truly amazing. Ditto the stunning sound which realistically captures avalanches and swirling winds in all their horrific beauty.",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "It's sickly true nature to the story sticks with you. It clings with you for hours after leaving the cinema to what makes up for a film experience packed with adventure, fear and heart pumping thrills. A film worth watching if you can last through the first act with just boring and pretty tasteless dialogue. 2nd and 3rd act....pure masterpiece.",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "In 1996, dozens of people tried to get to the top of Mount Everest. Some succeeded, and some died trying. The gripping and realistic 'Everest' recounts, in dramatic fashion, this event.",
      "total_reactions": 1,
      "user": "Timbaros"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "A capably made action-adventure film featuring good special effects, beautiful cinematography, fine characterizations and some genuinely heart-tugging emotions. Despite these strengths, though, the sound quality (especially the dialogue) sometimes leaves much to be desired, and the film editing could have used a little more consistency. Overall, a nice outing to the cinema, even if it's not positively epic filmmaking.",
      "total_reactions": 1,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "I watched this movie with a friend tonight but we couldnt finish it. I was that boring! There was no story, no drama, and the conversations and dialogue was horrendous! My friend said that this is how itreally happened but I dont care for reality, I want a thrill.",
      "total_reactions": 8,
      "user": "silverado"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "It was really touching. Seeing what those climbers go through is really heart-wrenching. Though I feel like that there were too many unnecessary scenes. But I'm glad I saw this movie.",
      "total_reactions": 2,
      "user": "doncsoo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Everest is beautiful, well acted, and exciting, but reverts to clichés and lacks characters to care about. All movies based on a true story, about fighting the weather has the opportunity to be great. The premise lends itself to make an engrossing, emotionally gripping, and sometimes heart wrenching story. However Everest, lacks the character development necessary to be all of these things. The cinematography is stunning, and the actors are great, but a small piece is missing, and thus I feel the characters are cliches, that you struggle to feel for. To make an example, when I watch Casino, at the end when Joe Pesci's character dies, I get emotional, despite that the character is a murderer. I never felt truly emotional about the struggles of any of the characters in this film. Some characters die, and the way you know is you see a frozen corpse, there isn't an emotional moment for the character or the audience. In the end the film, I enjoyed the film, and it is beautiful, and does a lot of things well, but I can't help feeling they missed the mark.",
      "total_reactions": 1,
      "user": "tjman09"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "This movie intrigues my learning skills and especially me because I love to learn. It has great climax, outstanding acting, brilliant effects, and fun film techniques.",
      "total_reactions": 1,
      "user": "SuperJG123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Wow. Just wow! It's unusual that I cry after watching a film, so you can imagine what sort of a person I am.",
      "total_reactions": 1,
      "user": "LegoTardis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "The extraordinary realism this film presents is as remarkable as it is heartbreaking.  I love how the film does not become too dramatic and instead shows restraint and respect which works in its favor.",
      "total_reactions": 2,
      "user": "AriseAndBe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Power by amazing visual effects and a strong cast Everest not only bring out the hardships of climbing the iconic name, but it makes it suspenseful and thrilling to watch. Overall, director Baltasar Kormákur does a great job bringing a true story to the big screen.",
      "total_reactions": 2,
      "user": "geo333"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "One of the MOST BORING movies ive seen. The reason i rated this even 1 was because of the scenery. Otherwise the movie lacked everything, too stretched and too boring.",
      "total_reactions": 2,
      "user": "ahmedimran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "The first half of Everest isn't very good and the second half is only slightly better. Everest provides the epic scenery and great cinematography but fails at nearly everything else. The mountain is breathtaking and aw inspiring  to see, to bad you can't say the same about choppy editing, worthless characters and sappy moments.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "My best film of the year, beating Sicario, Spectre, Avengers 2, hell even Mad Max and Inside Out. Star Wars might beat it to the top spot, but I'm doubtful.",
      "total_reactions": 0,
      "user": "MagnesiumDew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "One of the most realistically approached adventure movie based on the real.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Everest is jarring and uneven, with the first half of the movie being an absolute avalanche and the second half a richly rewarding experience best experienced in IMAX 3D. Fortunately, the surprisingly emotional second half clouds the first.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "I wanted to love Everest so badly but in the end I wound up just liking it. There's a pretty big cast in this movie some of which have bigger roles than others, but its a very well performed film. Jason Clarke is without a doubt the star of the film and he probably gives the best performance. Josh Brolin was also very good. Then you have talent like Jake Gyllenhaal, Sam Worthington (who really impressed me) and Kiera Knightley. There is not a huge amount of development in the characters but Brolin and Clarke's characters do get a little which makes the second half of the film work a little better. The film goes through a pretty big shift after about a hour and gets emotional, but not as emotional as it could've been. Then the ending is a bit of a bummer if you are not aware of this story. I did not and the ending was just slightly disappointing.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Everest doesn't exactly live up to the huge hype that I had, but it's a really great film. The thing about the film that dragged the score down was the first 45 minutes. All the backstory and conversations didn't really seem necessary to be that long and it felt really boring. But when the part you come into Everest for comes rolling in, everything starts becoming spectacular. The acting was terrific and the sequences were really great. It was pretty intense at times and overall I enjoyed it. Eventually, at the end, I felt like I was really angry because of stupid character choices, but since it's based on a true story, you might as well tell the truph(concussion). I feel really sad about this film but the film is pretty darn good. Side-note: Jake Gyllenhaal was hilarious in this film and the main characters wife was pretty hot. (81/100)",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Everest was a dramatically exciting movie where the story of the tragedy of the 1996 Mount Everest was well focused , well told if a little interesting.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "It was not okay since my expectations were created high beforehand and the experience felt disappointed due to the expectations. I would not consider this movie to be a good movie to watch",
      "total_reactions": 0,
      "user": "rusenali"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "I applaud Working Title for breaking new ground and not sticking to the 'Into Thin Air' version of the 1996 Everest tragedy, which is maybe why this book is not in this film's Credits, something that has not gone unnoticed by some professional reviewers.",
      "total_reactions": 0,
      "user": "PeterMillican"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Great visuals that allow you to join the expedition team that endured such a tragedy without ever noticing the special effects or CGI. Wonderfully casted and acted, it's truly a film that keeps you trilled and caring for each individual character and is only topped by the final note that explains this was a true story...Tragic..but a great drama film!",
      "total_reactions": 0,
      "user": "obijuankenbi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "One of the few movies that made me a strong man's empathy and desire to help people. By the way, the plot is based on REAL events.",
      "total_reactions": 0,
      "user": "dima1550"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "It was a decent movie that had it's moments of thrills and fireworks, but there was a section where the stories felt too switched around and I think it was seeing all sides that was the mechanic for it.",
      "total_reactions": 0,
      "user": "gregoryfern85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Everest is directed Baltasar Kormákur and is written by William Nicholson and Simon Beaufoy. It stars Jason Clarke, Jake Gylenhaal, Keira Knightly, Josh Brolin, and Robin Wright along with a slew of about ten thousand other equally talented actors.",
      "total_reactions": 0,
      "user": "Sidd_Movie_Buff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "It tells the story of the 1996 Everest disaster enhanced with the full IMAX 3D experience, an experience with amazing effects as you feel like you are at Mount Everest, holding onto dear life and watch characters fallout one-by-one from mental panic, loss of oxygen and frostbites that kill movement from the dying bodies of our friends. The film got the audience up in their seats as they hope for their heroes to come back alive from such a tragedy despite knowing the inevitability, all done by great character development and good acting that is enough to give us some knowledge of who they are. Everest was a film I was able to walk out of with satisfactory and has kept me thinking about it for weeks.",
      "total_reactions": 0,
      "user": "Venom9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I read the book quite a few years ago.  While the movie tries to show you what it's like, the written word does a much better job.  I remember after the book came out and the families found out how their loved ones died, they sued.  Don't know how that turned out.  While the book explained the \"successful\" business side, the movie kinda glanced over it.  But the whole movie really hinges on why the guide took the last guy to the summit at 4 PM when 2 PM was the time limit.  Why didn't he turn him around?  Would the four fatalities not have happened if he had been with his group?  The book explained it's business; the more clients that reach the summit, the more clients they'll have next year.  At the end of the movie there is a photo of the members of the business and that's a lot of people to pay.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Ofcorse a very thrilling and mind pleasing movie for those who like real adventure. Packed performances and breath taking special effects, although what we hear is that they used least possible computer imagery and more real material to recreate the magical mountain. Movie however lacks the jargon part in dialogue, we see characters frost bitten but no one mentioned the phenomenon. Also many may be lost on the way to the summit and it would have helped if there was a summary of the main track and major milestones. The best part of the movie is the excitement created with the screenplay and how close it is to the actual events. On performances, Jason clark and Jake Gyllenhal are top notch, Emily watson is perfect in her role. Keira Knightly and Robin Right are reasonable both. Overall a different and exciting experience",
      "total_reactions": 0,
      "user": "Xan_Ryil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "An all around decent movie, Everest doesn't provide its audience with a \"wow\" moment. Remembering the various characters proved to be confusing, the most memorable being Jake Gyllenhaal. The mountain itself is a wonder to behold, but the movie leaves its viewers somewhat unsatisfied.",
      "total_reactions": 0,
      "user": "joesph13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Everest did not disappoint. Based on real life events the storyline continued to provide... it kept the viewer thinking. I found myself wondering \"what would that be like?\"... and I caught myself asking \"would I be able to accomplish that?\", etc.  ...Everest was compelling (a very we'll made movie) in many ways. It pulls at the heart and speaks to the soul.  You feel like you're on the journey... there's much emotion (much feeling). There's great reward and high cost ...it's a must see for anyone with adventure in his/her heart.",
      "total_reactions": 0,
      "user": "CaliColorado"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Everest is the disaster movie based on the original 1996 disaster. The film has great characters and great effects, and it also has great costume and make up, as it feels extremely realistic. It also a lot different to other disaster movies, as when characters die it is just silent and not all cliché and dramatic. Although this film isn't perfect, with it feeling a bit lifeless at times, as well as us not really being able to tell who's who. And at the end we were supposed to feel quite sad, but it didn't really make me feel sad. In the end Everest is an enjoyable movie and I recommend you watch it if you want to see something different.",
      "total_reactions": 0,
      "user": "Jarody"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Well, maybe I expected too much of Everest - the movie to be more showy, to have more action, more great picturesque views. But Everest turned out to be a tragedy with rather many dialogues. Usually I swallow tears in the end of such films, but this time I didn't, though felt drama from the very beginning. In general the movie is worth watching.",
      "total_reactions": 0,
      "user": "pfirsig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Everest had great visuals and acting having seen it in IMAX 3D, but didn't keep my attention for long, too much run-time spent off of the mountain.",
      "total_reactions": 0,
      "user": "DoughBoii"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "-Everest is a 2015 British-American biographical disaster survival drama film directed by Baltasar Kormákur and written by William Nicholson and Simon Beaufoy, starring an ensemble cast which features Jason Clarke, Josh Brolin, John Hawkes, Robin Wright, Michael Kelly, Sam Worthington, Keira Knightley, Emily Watson, and Jake Gyllenhaal. It is adapted from Beck Weathers' memoir Left for Dead: My Journey Home from Everest (2000).",
      "total_reactions": 0,
      "user": "horrorliefheb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "I am so surprised that why the cinematography was not nominated for Academy Awards. Of course, the beauty of the film was not only for this feature, but also the story goes on in a both smooth and interesting way. it was pleasing.",
      "total_reactions": 0,
      "user": "Farsheed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "Everest is an amazing movie with a talented director and cast it captures you and you feel like your actually venturing the mountain it has some slow action and exciting scene but that's not as good as the end it's a simple long movie with a lot of adventure and good acting",
      "total_reactions": 0,
      "user": "Lukedabadass267"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "This was beautifully made and well acted. Unfortunately I found myself not really caring about the protagonists, because they weren't really doing anything noble or virtuous in the first place.",
      "total_reactions": 0,
      "user": "Lerritsnow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "A bleak and honest portrait of a bitterly controversial tragedy, yet Everest is no witch hunt, rather a case study in the peculiar relationship between endurance and foolishness within the human spirit.",
      "total_reactions": 0,
      "user": "Benkoko11"
    }
  ],
  "metascore": 64,
  "name": "Everest",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 18,
    "month": 9,
    "year": 2015
  },
  "opening_weekend_income": 7222035,
  "opening_weekend_income_currency": "$",
  "rating": 7.1,
  "rating_count": 150313,
  "rating_freq": {
    "1": 965,
    "10": 8357,
    "2": 599,
    "3": 1016,
    "4": 2483,
    "5": 7773,
    "6": 24843,
    "7": 54649,
    "8": 37720,
    "9": 11908
  },
  "release_day": 25,
  "release_month": "September",
  "release_year": 2015,
  "user_review_count": 281,
  "votes_per_demo": {
    "aged_18-29": 53139,
    "aged_30-44": 49349,
    "aged_45+": 9990,
    "aged_under_18": 762,
    "females": 20383,
    "females_aged_18-29": 10304,
    "females_aged_30-44": 6865,
    "females_aged_45+": 1535,
    "females_under_18": 165,
    "imdb_staff": 9,
    "imdb_users": 150313,
    "males": 99514,
    "males_aged_18-29": 42291,
    "males_aged_30-44": 41736,
    "males_aged_45+": 8270,
    "males_under_18": 585,
    "non-us_users": 73438,
    "top_1000_voters": 405,
    "us_users": 13333
  },
  "year": 2015
}