{
  "avg_rating_per_demo": {
    "aged_18-29": 7.5,
    "aged_30-44": 7.1,
    "aged_45+": 6.9,
    "aged_under_18": 7.9,
    "females": 7.7,
    "females_aged_18-29": 7.8,
    "females_aged_30-44": 7.4,
    "females_aged_45+": 7.4,
    "females_under_18": 8.4,
    "imdb_staff": 6.6,
    "imdb_users": 7.3,
    "males": 7.3,
    "males_aged_18-29": 7.5,
    "males_aged_30-44": 7.0,
    "males_aged_45+": 6.8,
    "males_under_18": 7.8,
    "non-us_users": 7.2,
    "top_1000_voters": 6.3,
    "us_users": 7.3
  },
  "avg_screens": 1735.6923076923076,
  "budget": 125000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 5,
    "month": 8,
    "year": 2011
  },
  "critic_review_count": 346,
  "duration": 131,
  "genres": [
    "action",
    "crime",
    "thriller"
  ],
  "gross_income": 209805005,
  "max_screens": 3793,
  "mc_avg_user_score": 7.4,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 85,
  "mc_movie_name": "Fast Five",
  "mc_negative_rating_frequency": 36,
  "mc_positive_rating_frequency": 426,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 83,
      "summary": "Like a proper action sequel, it's bigger, louder, and sillier than its predecessors, but it's more streamlined, too, smartly dumping the tired underground racing angle in favor of a crisp, hugely satisfying \"Ocean's Eleven\"-style heist movie."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 83,
      "summary": "High-octane trash, but you will go \"Ohhhhhh!\""
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "The picture delivers the high-octane, testosteronic goods of a warm-weather smash, and maybe the first great film of the post-human era. It's just a shame that every theater showing this nonstop auto race, this animated car-toon, can't be a drive-in."
    },
    {
      "critic": "Michael Wilmington",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "Dwayne Johnson hops aboard as a stern U.S. agent hot on Diesel's trail, and the whole thing progresses to one of the looniest heists of all time. The result is the most exciting, visually jazzy, and absurd entry in the series."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "In a free-for-all like this, where the laws of gravity and dictates of narrative logic are left to eat dust, it doesn't matter when anything takes place or why."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "Features some of the most exhilarating action sequences the screen has seen in years."
    },
    {
      "critic": "Megan Lehmann",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "Big crashes, lithe women and roiling testosterone, not to mention the addition of The Rock as a fire-and-brimstone federal agent – there's plenty to pull in the (mostly) young male audience."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a movie for audiences who think exuberance in movies is more important than sense or logic and who can laugh at a movie and like it at the same time."
    },
    {
      "critic": "Sean OConnell",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "It delivers the most entertaining \"Fast and Furious\" adventure while also getting 2011's summer movie season off on the right lead foot."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Inventive action sequences, deft stunt work and breathtaking cinematography make for revved-up fun."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "What it all comes down to is a skillfully assembled 130 minutes at the movies, with actors capable of doing absurd things with straight faces, and action sequences that toy idly with the laws of physics."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "As is par for the course in a \"Fast and Furious'' movie, the only persuasive physical intimacy is between the men."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Blissfully, brainlessly satisfying."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "It's either genius or madness to put Diesel and Johnson in the same movie, or the same scene. They're both enormously appealing performers."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Fast Five is brawny dumb fun, nothing more but that's enough."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Five's few driving set pieces, all economically cut for spectacle over continuity, are pumped to near-Crank levels of absurdity, with Lin transforming his ragtag bunch of fugitives' superhuman knack for escaping certain death into a running joke."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Fast Five is a fantasy that in no way resembles real life; ordinary morality doesn't apply, and the audience knows that as well as the filmmakers do."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Gets lots of mileage from a combination of high spirits, scorn for the laws of physics, readily renewable energy and an emphasis on family values-not those of the nuclear family, but of hell-raising, drag-racing outlaws who genuinely care for one another."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "The sheer audacity of Fast Five is kind of breathtaking in a metal-twisting, death-defying, mission-implausible, B-movie-on-steroids kind of way. Not complaining, just saying."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 67,
      "summary": "It's great to see The Rock re-embracing the action genre, and when his clobbering match with Diesel finally happens, it's as outlandishly room-wrecking as I'd hoped."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Satisfies on a visual and visceral level while leaving the intellectual one cold and shriveled and starving."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Fast Five will push all your action buttons, and some you haven't thought of. So what if you hate yourself in the morning."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Absurdly long, absurdly over the top and absurdly absurd, Five Five - still manages to be more fun than any movie with its outrageous carbon footprint has any right to be."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "Tough on nuance, tough on the causes of nuance, this episode has the highest velocity and lowest IQ yet. See it on the biggest, loudest, dumbest screen you can find."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The 131-minute, car-racing film is adolescent guy date histrionics – screaming tires, snappy putdowns and, because we're in Rio, an occasional influx of bodies beautiful in Band-Aid bikinis."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Fast Five represents Yankee ingenuity of the brutally stupid kind."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "Fascinating, no? Of course, that's just one (obvious) reading of Fast Five. You could also say it's a kickass demolition derby – pure dumb summer fun – and often easy on the (hetero) eyes thanks to the inclusion of Brewster and Mendes."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "The Fast and the Furious movies haven't exactly gotten better as they've gone along."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "If you're wondering why this movie must stretch past two hours, it's because it takes that long to read every item in the cliché dictionary."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This is my favorite Fast & Furious movie. A lot of over the top action, funny lines, and an awesome performance by Dwayne \"The Rock\" Johnson. The villain in the movie doesn't really make you hate him enough that you want him to die now. But it still satisfies you when he gets shot and dies even though the execution was very quick and is quickly forgotten after he dies. After the heist, you feel the weight when the cast tries to open the vault. When they open the vault, you actually feel happy for them. I did. And I'm glad they showed how the group spent their lives after their the heist. It's a really good movie and really enjoyable.",
      "total_reactions": 1,
      "user": "Comasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "'Fast\" fans will be left aghast in this latest installment of the racing series as the stunts soar to even greater, insurmountable lengths; impervious to limitation and restraint. Just when you think the crew can't make their objective anymore difficult, they do, and execute with such foreseen efficiency, that the approaching quandary seems all the more likely. By the same token, 'Fast Five' is the facility to a much more enjoyable story-line and plot, going beyond life on the circuit. Even so, a few issues remain: \"tongue-and-cheek\" dialogue, predictability, troubles with continuity, and an overusage of moth-eaten expressions. Aside from subtle deficiencies, the film manages to sway the viewer away from such foibles, and instead, sublimate faced-paced visuals of daring brutes, tantalizing women, and enough tempo to make you wonder what just hit you. 'Fast' is geared up to thrill, and does just that, as entertainment wins the race against normalcy; making for far-fetched, fast, and furious fun.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Best in the series by far. Great additions to the collective cast of the series, great action set pieces, and an all around enjoyable ride. And stay through  the credits!",
      "total_reactions": 8,
      "user": "RJSmoove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Totally rocked (literally, The Rock).  Summer action has officially begun.  If you even slightly enjoyed the previous movies, this one proves the series is still going strong.  Vin is slightly chunkier and beefier but the rest of the cast looks just like they always did.  Tyrese along with Luda pumps up the hilarity and Dwayne is no bit player.  The Rock puts in a performance that is arguably one of his best in an action film.  The racing is slightly de-emphasized in favor of stunt driving, but it's all here:  cars, babes, tunes.  More guns and hand-to-hand combat than ever before to top it all off.  You don't necessarily need to know the history of the characters, but this movie keeps extending what fans are familiar with.  Add the \"heist\" twist and you've got yourself a winner.  Watch for the surprise ending!  My only question after all is said and done is:  how did the producers get permission to destroy Rio De Janeiro as much as they did?  Crazy destruction!!!  \"Fast\" is fun!!!",
      "total_reactions": 6,
      "user": "BrahmaBull"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "As several others have mentioned, you absolutely have to sit through the credits.  Quite a payoff at the end. This movie is the Oceans 11 of the Fast & The Furious franchise, but you have the benefit of knowing the cast of characters from the earlier films.  It's just a lot of fun.  Guns, fistfights, car chases, heists,  destruction, bad guys in power, revenge, robin hood - it's all here. And the wry smile from Dom (Vin Diesel) brings it all together.  I was a little surprised the critics were on board for this one, but I can see why they liked it for the most part.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I don't think anyone expected the fifth film of the series to be the best. Up to this point the only one I liked was the first one, but after seeing this one possibly the greatest car themed film ever. it's full of action, comedy, drama, babes, and way more. True it didn't have too much racing in it for a street racing film , but the use of street racing was one of the main reasons none of the films got good reviews, and because of the fact that the last chase scene is one that you'll never forget. I definetly recommend this film to all, whether your a fan of racing or not.",
      "total_reactions": 10,
      "user": "Manymade1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "If you walk in the theater simply expecting a fun movie to to put you in the middle of yet another experience of ridiculous driving, explosions, gunfire, and a few laughs along the way, you will be very pleased. Some fans may be disappointed to find that this latest installment of the series does not focus as much on street racing as the other movies may have, but the highly insane finale will be sure to leave everyone satisfied. Hint: Stay through the credits.",
      "total_reactions": 3,
      "user": "xandervee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I have been a fan of this series ever since the first movie came out in 2001. When I heard this movie was going to come out, I was very excited; especially since seeing the fourth so many times. After the movie, I said to my friend, \"That was one of the best movies I've seen in a while.\" I was completely serious too. From the giant gun fights and the fight between Vin Diesel and the Rock, to the high octane car chases, this movie has it all. I'm very excited to see the sixth movie that they are working on now. I hope it's as good as this was.",
      "total_reactions": 6,
      "user": "gamefriek"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "You need to let yourself go before you walk into this fun, action-packed film. It's filled with the usual - babes, fast cars, ridiculous stunts, and a list of story ClichÃ©s. Just don't expect a realistic film, because the director doesn't want you to. They don't take themselves seriously and that means this makes for one of the most fun experiences in a theater in recent memory. Go with a big, lively audience and a fun group of friends and you will have yourself a damn good time.",
      "total_reactions": 4,
      "user": "thesaxmaniac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "i am not going to as far as saying this movie deserves a perfect 10 but it gets a good 9 as a fan of the series since the first movie. what i really liked about this movie is the inspiring teamwork shown in Dom's crew they stay by each other no matter what and its them against the world i mean they have got a city full of corrupt working for the most powerful man in Rio and they all have an elite federal agent after them this is the kind of thing that builds up big suspense.",
      "total_reactions": 2,
      "user": "Andy92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Suspension of disbelief and overacting by The Rock aside, this more than any of the other movies was the most fun. Lots of unexpected comic relief, stunning action sequences, and I'm gonna say it, heart. I went in with low expectations and came out thoroughly entertained. Go see it and have a crazy good time rooting for our favorite bad guys! Oh, and make sure you sit through the credits for a \"Holy cow, no way!\" moment.",
      "total_reactions": 2,
      "user": "PleiadesPower"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Like most of its predecessors, FAST FIVE is indeed big, bold and brainless...but it works, as the concept swings away from car racing to a broader, more action viewer friendly OCEANS 11 meets CLEAR AND PRESENT DANGER meets the World Wrestling Federation hybrid.  It's too long, it's pretty cheesy and it defies all laws of physics - but put all that aside (which you should be doing anyway...because it's a FATS AND FURIOUS sequel) and there's a great deal of pre-summer, eye-rolling, fun to be had.  Far from a ten, I'm giving FIVE a seven.",
      "total_reactions": 2,
      "user": "MovieGuyBrian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Great film. pure escapism. Best of the series. never slow.  action packed adventure. Great locations and not bad acting for the best part. cant wait for the next one..........",
      "total_reactions": 2,
      "user": "Shiro_"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "BEST ONE OF THE SERIES.   it was a great action movie.   it was **** car bashing madness.   vin diesel and the rock gives the movie life.    good job fellas.   great improvement.    i finally liked a fast and the furious movie.",
      "total_reactions": 2,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Fast Five was a big improvement from the past few films in the Fast and Furious franchise. The actors although are goofs, were well used and the climax of the story was solid, entertaining, well edited and thrilling. The movies best parts were actually in the character development scenes which I'm glad to say had likable charm. The audience will need to turn their brain off which is generally something that annoys me but Fast Five did seem to get away with. Vin Diesel gives a poetic speech about the importance of family - then goes on a driving rampage that would kill 50 police officers. Fast Five was some fun and breaths some life into a declining series. Recommended for an action time.â",
      "total_reactions": 2,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Best in the series. Loved hauling the safe part. Was the most action ever. Also like seeing Dom with the FBI agent at end, was hoping for that. Looks like Lettie is still alive or maybe a start for another movie that was shown after end of movie. What do you think???  Dom and Bryan are great together, hope they do another series.",
      "total_reactions": 2,
      "user": "sleeknight"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "I only saw the first 15 minutes of the movie, and I do not really taste anything bad, I felt so uncomfortable to see Diesel is the worst actors I've seen, I lost myself in the scenes, went in one side and out of the other (literally). very disgusting",
      "total_reactions": 5,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "This is the worst movie I have ever watched.  What happened to the racing?  As absurd as the previous movies were this one crosses every line of absurdity.  Let me \"ruin\" the end for you ... a pair of dodge chargers manage to pull a multi-ton safe from a wall and drag it down the road at high speeds.  I had as low of expectations as possible for this movie, however the movie somehow went lower.",
      "total_reactions": 5,
      "user": "impudence"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "All air and no head, but a popcorn-muncher, a pleasing-enough hi-octane version of the o-so-repeated-to-death heist movie. It's amiable, got some decent-enough stunts, but the story isn't exactly going to test your mental agility, nor tantalise your thirst for more. It's okay. Big screen price-tag required? Nah, this is a straight-to-video bonanza!",
      "total_reactions": 5,
      "user": "Aragond"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "actually pretty bad movie, this series really did need a new turning point because the story was getting old and i'mm not sure this delivers. For a car movie not much actually involves cars and 90% of the movie is vin diesel and friends either complaining or figuring out to do with the rock occasionally put in to mix things up.",
      "total_reactions": 12,
      "user": "nbozinator"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Finally the Fast and the Furious has some creditability. Now I'm not saying I loved this movie, but I did enjoy the crap out of it, it's only flaws are some not so good acting and a weak plot, but overall, I really enjoyed myself watching this and wouldn't mind giving it a second viewing.",
      "total_reactions": 6,
      "user": "ZacharyMatson"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "In retrospect I'm not really sure why I expected anything at all from this movie. I guess it was the B+ from the A.V. Club. Stupid. Paul Walker is the least charismatic actor I've ever seen on the big screen. Vin Diesel seems to be caricaturing himself. The Rock, of course IS caricaturing himself, which yields the only mild entertainment of the movie apart form the fantastic train seen at the beginning. The rest of the movie is horribly scripted, pathetically acted, rote B-movie action with an A-movie budget. This movie makes me wish I could take back the \"2\" I just gave Hanna, which was also awful but provided far more entertaining minutes than Fast Five. A.V. Club: you owe me 2+ hours of my life back.",
      "total_reactions": 7,
      "user": "greyskies7"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "The worst movie of series..  They destroyed so much cars for nothing, no good chases, no story no nothing.. Seems like they are just milking out the franchise.. Sorry but a 1 from me",
      "total_reactions": 8,
      "user": "YogiBear"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "In chronicling the travails of the Brazilian underclass, \"Fast Five\" is no \"Pixote\", the Hector Babenco neo-realist classic about lost childhood, but at least it pays lip service to the poor, which is marginally better than an amoral filmmaker such as Michael Bay, whose infamous chase sequence involving Hummers laying waste to a Cuban hillside shantytown in \"Bad Boys 2\", makes almost no filmic reference to the impoverished people who reside there. The human collateral damage caused by the SUVs goes unacknowledged by both the driver(Will Smith) and the passenger(Martin Lawrence), because a third-world citizen isn't the equivalent of a first-world one. So even though the U.S. feds(led by Dwayne Johnson), in \"Fast Five\", chase Dominic Toretto and his friends through an honest-to-goodness favela, firing at will without any self-consciousness about nicking an innocent bystander, the exotic on-location set is not utilized merely as background for a standard Hollywood-style shootout. On the lam from the law, Vince, last seen in \"The Fast and the Furious\", has been hiding out in the Rio slums for the past ten years, and during the interim, he marries a Brazilian local and fathers a child with her. Likewise, since Canada is too easy, Dom, a recently escaped convict, joins his old childhood friend, along with ex-cop Brian O'Conner and Dom's sister Mia, who are also wanted for their part in the bus hijacking that frees the bald linchpin en route to a federal penitentiary. Despite the fact that all the Portuguese-speaking parts are assigned to crooked cops and criminals, the filmmaker does attempt to put a human face on the favela inhabitants. When Rosa allows the fairer Toretto to put little Nico to sleep, both the mother and child are signified as people through Mia's Americanism. By proxy, they're no longer just ordinary Brazilians. And then there's Elena, a neighborhood girl-turned-cop who, initially anyway, is seemingly the only honest law officer in all of Rio de Janerio. More interaction with the visiting fugitives would further distance the Rio locals from the same filmic life of faceless anonymity that confronts other third-world denizens whose respective countries serve as a backdrop for some crisis which often doesn't include them. While \"Fast Five\" has just enough cultural sensitivity to stave off comparisons with a Michael Bay production, it still, however, bears the unmistakable stench of American imperialism. (For instance, the scene where the ersatz \"Ocean's Eleven\"-like outfit brazenly race in police cars.) The filmmaker wants the moviegoer to care about Rosa, but not necessarily her countrymen. We never get to meet them. When Mia goes to an open market, her visit is cut short before she gets the chance to talk with a vendor, somebody other than Rosa who'd give the favela populace a collective identity. Thanks to Vince, the ambushing of Mia, orchestrated by Reyes(the unofficial \"governor\" of Rio), goes awry, so the quota on Brazilian kidnappings, at least one a day according to the Jason Kohn documentary \"Manda Bala(Send a Bullet)\", gets left to some other Portuguese goon and his henchmen. Contrary to Brazil's reputation as a glamorous tourist destination, the South American country with the seventh highest GDP is plagued by high crime rates, nefarious government officials, and a disproportionate amount of poor people. In \"Manda Bala\", a frog farmer, who was thought to be involved in a money-laundering scheme with then-Governor Jader Barbalho, tells the camera proudly that he chose the frogs, after his wife issued him an ultimatum which put the small businessman's aquaculture business in opposition with their marriage. The money was just too good. Love, both the brotherly and romantic kind, also takes a backseat in \"Fast Five\", as well, since Mia is allowed to go out alone, unescorted, without notice. Dominic and Brian are too busy mulling over their potential hundred-million dollar payday. This cast of characters were a whole lot more likable when they were rebels without a cause, mere small-time crooks who'd boost semi trucks at great risk for the incommensurate payoff of DVD players in the Rob Cohen original. By sequestering the thieves from the natives, the ugliness of their greed will go unnoticed by most moviegoers, who are conditioned to root for the good guys, or at the very least, the anti-heroes. Sure, they give Vince's widow a cut of the money, but that's a mere pittance in lieu of the innumerable poverty-stricken Brazilians who wallow in abject destitution. It's one thing to steal from Americans on domestic soil, but it's a whole other thing to steal from the people of a developing country. \"Fast Five\" is a film of its time. This updating of Steven Soderbergh's \"Ocean's Eleven\" very much captures the zeitgeist of the post-economic collapse. These criminals don't give a f*ck about who they steal from, as long as they get paid.",
      "total_reactions": 6,
      "user": "Shiira"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "I liked the first movie in this series, but was not very impressed with this one. Aside from the fact that most of what takes place in this movie is beyond any scope of reality, the acting was poor. On a positive note: the action was almost non-stop, so if that is all you like then you will love this movie.",
      "total_reactions": 3,
      "user": "Qadosh"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "Tough to say too much about this film.  On the positive, the stunts and special effects are top notch.  The story, screenplay, and acting are dumb.  But what should I expect, right?  I just think perhaps this genre of movie isn't for me.  I can't help thinking of Mike Judge's Idiocracy when imagining the people who REALLY enjoy a film like this.  ...and man has \"The Rock\" been juicing!  He looks like a character from Gears of War.",
      "total_reactions": 3,
      "user": "donnelbr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "\"Tho Not as Fast or Furious as its predecessors and completely implausible Fast Five is still a full - blown adrenalin pumping thrill ride. That holds you in the drivers seat till the Intense and Epic Final Act that will leave you breathless and shocked\" .. B+",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "This movie fits in well with the others in the series.  It is a well made action flick with great special effects that you will forget entirely in a couple of months.  The best part of the movie is the opening train sequence.  The cars pulling the safe at the end (not a spoiler since it is in the previews) will have you rolling your eyes in disbelief, but it is still exciting.  The Rock actually gives one of his best screen performances to date.  Not great but a fun movie.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "This is the worst Fast and Furious movie yet. There is almost no underground racing. Now the characters are on the run in a 3rd world country and decide to rob a bank. Some wrestler FBI guy is out to get them. This movie is filled with bad dialogue and poor acting. End of story. This resembles nothing of the first Fast and Furious movies.",
      "total_reactions": 2,
      "user": "Stealthgear"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Not at all what I expected.  The Rock, although I like him, was such an unnesiccary addition to the great series.  What was with this movie?  Everyone is a criminal now?  Rio De Janeiro? I didn't know they were known for cars.  Have you ever seen the streets?  It would be impossible to race there!  Not well thought out by the producers.  And the Vault seen dragging though the street at the end?  WHAT?  Two Peterbuilt trucks couldn't pull a vault through buildings and around corners let alone  two muscle cars!  The others in this series are admittedly \"over the top\" but this one takes the cake, then bakes another and takes that one too.  4/10",
      "total_reactions": 2,
      "user": "jdrandall38"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "First of all, to understand my wrath, you should know that this critic comes from a Rio de Janeiro citzen.",
      "total_reactions": 3,
      "user": "EhRaD"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "MetaCritic won't let me properly format the review, sorry about that:",
      "total_reactions": 4,
      "user": "CaptainJammo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "I learned 3 things in this movie.",
      "total_reactions": 3,
      "user": "Cokebadger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Fast Five is a brilliant film. It had the best story in the franchise, some of my favourite actors from the last films are in this one and the action & stunts in this film are great. The driving sequence in this film is just fantastic and the actors did probably their best performance ever in this film. I would give this film a full price.",
      "total_reactions": 1,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "I watched the first \"fast and furious\" movie, and I didn't like it. years pasted and they started making the \"fast and furious\" sequels! I figured, maybe... I am missing out! So I watched Fast five, wow! was I ever disappointed. Being a car guy myself, this movie is total cr*p. The were doing a 1/4 mile race and one of the characters down shifted? really?! The story is just terrible as well! I have no idea, how people can support this franchise!",
      "total_reactions": 1,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Finally! I know that this saga one day can have a good movie, and Fast Five is really amazing, ok, the first movie is better, but after a horrible second part, a good third, and regular fourth, is obviusly that this new film be a disaster, but is sorpresive. The story is good, have great elements. The performances of the cast are really amazing. The only thing that I don't understand is the character of Michelle Rodriguez, she not died in the last movie? Ok, the movie is really amazing. A great sorprise.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "â",
      "total_reactions": 1,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "After all the hype for this movie, i just felt it was okay. There was nothing special about the movie and the acting was sub-par. Dwayne \"The Rock\" Johnson especially did a bad job, with constant overacting. The story was also dumb because it was really predictable and it portrayed Rio of being just some entirely corrupt place which is not very true. Also, this movie made cops looks like idiots because they cant take down just a few street racers. Just not what I expected from this movie at all.",
      "total_reactions": 1,
      "user": "Tall_But_Short"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Seriously I don't like any Fast & Furious movies. There are too many Hollywood sequels, too long. Movies like Resident Evil, Transformers, Pirates of the Caribbean, Harry Potter. Just make at least 2 then finish.",
      "total_reactions": 9,
      "user": "ascoltami86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "ave been a fan of this series ever since the first movie came out in 2001. When I heard this movie was going to come out, I was very excited; especially since seeing the fourth so many times. After the movie, I said to my friend, \"That was one of the best movies I've seen in a while.\" I was completely serious too. From the giant gun fights and the fight between Vin Diesel and the Rock, â",
      "total_reactions": 0,
      "user": "darktyler"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "oh come on this movie was great, i took my girlfriend and she loved it, action packed and long becuase there is alot going on in this one, well worth it. let me think what else, oh the two regeton guys made me laugh  alot they should do more movies together.",
      "total_reactions": 0,
      "user": "mau1133"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Fast Five is both awesome and stupid at the same time while ripping off The Italian Job to an extent while also being some awesome that I don’t care.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "You know those lazy action script moments that piss you off so much they pull you out of the movie: guy with gun walks close enough to get it batted away, kingping says \"kill them\" as he leaves the room-good guys pick lock at last second, late twist negates everything that happened 10 minutes ago, etc etc? Well this movie has all of them and then some. They should make Tokyo Drift 2. At least that one was stupid fun.",
      "total_reactions": 0,
      "user": "supersigy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Things have changed in this 5th installment of the \"Fast & Furious\" series: the stars are more pumped, Dwayne Johnson is the antagonist and it's more about action than the cars. This time Van Diesel, Paul Walker and Jordana Brewster are on the run in Rio, where they decide to stage one big final robbery. The movie basically becomes a heist flick that's bookended by two elaborate, action-packed chases. Sure, there's lots of fast driving, but it's not about racing. Still, there's plenty of macho posturing and quick-cut fights to add that testosterone edge. NOTE: Stay thru the credits until you get a double cameo surprise.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "What do Fast 5 and Ocean's 11 have in common besides numbers in their title?  Watch this movie to find out.  I really enjoyed this movie.  I'm not exactly a big fan of the series, but all of the cheese and ridiculousness of this film kept me very entertained despite not knowing the character relationships from the previous films.",
      "total_reactions": 0,
      "user": "zero298"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "A good time if your a fan of the series or just like cheesy action movies with fast cars, the plot is surprisingly good, I wish it could have had a more intense feel, the plot really sets it up for one, but the goofy characters and cheesy lines keep it from reaching it, and speaking of cheesy dialog all of the Rock's lines were awful, some will literally caused you pain to hear, but the action is intense and hiss fight scene with Vin Diesel was pretty awesome, this is basically a movie created specifically for the fans, and includes characters from all the previous movies even Tokyo Drift, so it's a good movie with some extremely cheesy moments, and I don't see this changing your ming if you weren't already a fan, but there are worse movies out there, and if you want a action movie with fast cars for a weekend rental and have seen the others then this is for you.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Fast Five (or is that The Fast & the Furious 5? or Fast & Furious 5? Or Rio Heist... never mind) is a decent addition to the franchise which proves to be more fun than parts 2, 3 & 4. Dialing the action up to insane levels and adding in The Rock makes this a ton of stoopid fun.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Great action movie. If you enjoyed any of the others in the series you'll love this. For me its arguably the best yet. Story, action scenes, comedy and \"The Rock\" make this worth seeing. I really think the last action sequence is amongst the best car scenes I've seen in a very long time. So good to see real stunts and less CGI for a change. Its a bit hard to believe in places but thats not the point here. Simply leave your brain at the door sit back and enjoy the ride. I'm sure there is more to come from this series.",
      "total_reactions": 0,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Race Cars speeding along the street of Rio De Jainero, All Casts come together all at once, the rooftop chasing and ultimate gun-shooting, what more can you ask for? Here comes the fifth installment of THE FAST AND THE FURIOUS (2001) franchise, thiz is actually the bridging story between THE FAST AND THE FURIOUS: TOKYO DRIFT (2006) and is a direct connection to the ending scenes of FAST & FURIOUS (2009), when Dom (Vin Diesel) sentenced to 25 years in federal prison and Brian gang (Paul Walker) attempting to free him again. Justin Lin directs thiz sequel with identical pace and tone from previous movies. Just like the previous F & F movies, it is all about high-speed car racing, hot and sexy babes and some of cat and mouse criminal activities. Well, to tell you the truth, thiz time is more like a Heist movie than Car Race movie. We find very less of eye-catching Race Cars, the movie put aside many glamour factors, to do otherwise they step on the gas pedal to full throttle into pure Action. Frankly said, I did not know for sure, who were the real Fast Five in thiz movie. Certainly, the focus is still on two central characters, Dom and Brian. The rest is Dom sister, Mia (Jordana Brewster), the big-mouth Roman (Tyrese Gibson), the high-tech Tej (Chris Ludacris Bridges), the big-muscle Vince (Matt Schulze), the beautiful driver Gal (Gisele Harabo) and the charismatic Sung Kang (Han Lue) from TOKYO DRIFT. One thing for sure, there are more than five people. Thiz time they got a well-matched opponent, the ambitious Federal Agent Luke Hobbs played by Dwayne The Rock Johnson! Thiz seems to be a great selection. The Rock delivers a strong and believable tough guy performance, I am beginning to think thiz WWE sensation could be a great serious Actor as well. On the other hand, Vin Diesel performs one round of WWE wrestling scene with the The Rock, it is pretty entertaining to see two giant muscle brutally clash with each other in bare hand fight. It comes to my mind, if Vin Diesel will also be one hell of good wrestler in WWE ring? With all the hype and enthusiasm around, thiz is clearly not the last F & F movie to be made, they will be back to do their things again. Thiz implicit confirmation was exposed in one of Hobb famous lines, We will find em, we take em as a team and we bring em back. And above all else, we do not ever, ever let them get into cars (again).",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "By far, an improvement to the series with its epic scenes that range from the light heavyweight fight to an unbelievable heist. Fast Five leaves its predecessors in the dust with its new material.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Never watched the four movies before but it's loud and entertaining. Bad talks, intense and brainless action. Heist. Explosion. Crash. Fast Five is unstoppable ride for summer.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Less cars, more destroying Rio with a safe. So the acting is very bad and at one point they say \"This just turned from mission impossible to mission damn insane!\" But you must forgive for this as this is by far the best action movie there will all year and it is the best in the series by far. It even has that great heist movie feeling and and towards the end, The Rock (or Dwayne) by far has the best movie kill this year and there is a $1 million drag race. One word, AMAZING!",
      "total_reactions": 0,
      "user": "codfather96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "I thought this movie was a 6.5, but I'll give it a 7. It was enjoyable, but I won't ever watch it again unless I'm super bored. The races in the this movie were lame and there weren't enough. And although all the Dodge Chargers were cool, it was still cop car sedans. And how about at the end when Dom gets his Dodge and Brian gets his Skyline, they go to race and it doesn't even show it!? Come on! I'm hoping for another one in the series, simply so i can see that race!",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Es la mejor de la saga por mucho,llena de adrenalina y emociones no da chance a relajarse,un elenco maravilloso lleno de agrabables sorpresas,dejando un poco a un lado las carreras y centrandose mas en una historia,exelente ambientacion Brazil es magnifico.",
      "total_reactions": 0,
      "user": "gilbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Best entry in the series by far. After the successful reboot of the Fast & Furious franchise, Fast Five delivers all action, high-octane, adrenaline fuled ride and once again improves the series by soome distance. Continuing on from the fourth outing Brian (Paul Walker) and Mia (Jordana Brewster) manage to free Dom (Vin Diesel) whilst he is being transferred to prison. The manage to flee the country and end up in Rio however its not wrong before the authorities are on their case, in the face of Dwayne \"The Rock\" Johnson, who is challenged with finding Dom and his team and extraditing them back to America all the while Dom has actually planned a Heist with a large payday - namely Brazilian crimeloard Hernan Reyes' Â£100million (Joaquim de Almeida) in order for him, Brian and Mia to start a new life. Many familiar faces return from previous installments and be sure to stay for the credits as theres a shock instore beyond the actual movie which sets things up perfectly for the next sequel. Fast 5 won't win  any special awards but it will entertain the hell out of you. Some people might critisize the fact that they seemed to have moved the emphasis away from the street racing but its a bold move and one that they have got spot on imo! Now its all about the heist, eg Oceans but mixed up with great adrenaline filled action set pieces, explosive scenes throughout  many with The Rock who is awesome as Hobbs bringing his wrestling skills into effect in his bad ass, no nonsense approach resulting in an immensly entertaining movie from start to finish. Fast Five is bigger, badder and better. A hugely enjoyable ride in what is the best Fast film to date!",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Fast Five is definitely the best of the series and the most worthy to be called a sequel to the original. This movie has it all for the adrenaline junky: Fast cars, hot women, guns, and insane action sequences. If you didn't like this movie then your brain just isn't capable of suspending disbelief, go watch a documentary instead!",
      "total_reactions": 0,
      "user": "Lanhavoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Fast Five. Action packed thrill ride gun firing explosion blowing WOW of a film. You would think that after all the other four films that five would be pushing the sequel's too far. now i can see that, However \"Fast Five\" is by far the best one out of all of them. i guess because they have put much more money into this film, the budget was an estimated $125,000,000, the film was well advertised and people were more aware of this film coming to the cinema and there was a big \"hype\" about it coming out. I think the hype towards this film was the audience responding to all the characters from the previous films are now featured together as one \"big family\" and working together as a team to do this last job. This films got it all, comedy action thrill suspense, muscle and guns and girls in next to nothing washing beautiful cars, i mean seriously can anything top that? watch and see, yet another must see film and will rock your night at the cinema.",
      "total_reactions": 0,
      "user": "ReviewMedia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Somehow this series continues onwards without an real story to them and finally we get the latest one that actually has the best story, action and acting of the entire series.",
      "total_reactions": 0,
      "user": "HighwayUK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "An enjoyable action movie. Even if the plot leaves you with a feel of already-seen, it's well directed and acting and script do not make you bleed from eyes and ears.",
      "total_reactions": 0,
      "user": "Sylmawen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "The epic Hollywood action film with a great cast, jaw-dropping stunts, and a streamlined plot that gets to the point quickly and doesn't look back! Easily one of the best, if not THE best, of the entire F&F; franchise!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "I usually don't review movies but I had to for this one because it was so gooooood!  There were a couple scenes which were cheese and overacted but the rest of the flick was very fun to watch.  I really enjoyed it and felt for the characters.  It did a great job of weaving aspects from all 4 Fast movies together.  The audience at my theatre actually clapped a couple times - esp. towards the end.  This is an exciting movie.",
      "total_reactions": 0,
      "user": "Jefreestyles"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "The latest in the Fast and Furious franchise has recently hit the screens and what with the others being a good way to spend a few hours I was hoping for a similar type of movie from this one with plenty of great cars and car chases to boot.",
      "total_reactions": 0,
      "user": "FAbFilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Thoroughly enjoyable! great cast, by far the best in the series. The addition of Dwayne \"the rock\" Johnson definitely added to the entertainment value. Go watch it now, and don't let your inherited prejudice brought on by the less successful iterations keep you out of the theatres!",
      "total_reactions": 0,
      "user": "beaRaip"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "Best in the series by far. Great additions to the collective cast of the series, great action set pieces, and an all around enjoyable ride. And stay through the credits!   please check this out",
      "total_reactions": 0,
      "user": "QendrimOsmani"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Best one yet indeed. The way the scenes fit into the overall story are very well done. There were no boring moments for me - just a nice balance between action and dialogue - for an action movie. The character are also very good and the introduction Dwayne Johnson in the \"series\" gives it a boost. You should watch it as it is really entertainment. Not some random action movie.",
      "total_reactions": 0,
      "user": "Daedalus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Was exactly what was expected and I didn't mind that. It is ridiculously over the top at this point and features more of a super hero, insane driving sort of plot line. I find at this point the movies aren't as much about the cars and the customization as they are about the explosions, fight scenes and insane amounts of destruction. It also ended up making me laugh at a large amount of spots. Whether this is because the movie itself is so over the top that it is funny or that the movie itself was made to be rather funny, either way it was funny. Overall a good movie, exactly what I expected it to be.",
      "total_reactions": 0,
      "user": "maxxacre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "5th time's the charm, it seems!  All-star cast...seems like the first four movies were just a bunch of prequels to give backstory (or forestory) on all the characters.  They managed to deliver quite a bit of plot at the beginning without putting the viewers to sleep like in the 4th movie.  Much less emphasis on the racing culture....felt like a very balanced film as a result.  And come on...when you put The Rock against Vin Diesel, you're bound to have one of the muscle bulgingest, nostril flaringest action sequences this year!  The interactions between all of the characters are superb.  This movie did exactly what it was supposed to do and, despite the outlandishness of some of the action sequences, it's really hard to find anything wrong with this movie.",
      "total_reactions": 0,
      "user": "Moose_Nuts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "If you're like me and cannot those impossible and unrealistic things, this is not your movie. Although the acting was bearly mediocre, the constant action kept me following through the whole flick. The movie was overall decent mostly because of the special effects and beautiful women. Worth seeing once, but not worth buying.",
      "total_reactions": 0,
      "user": "SachaBaronCohen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Best film in the series. No question. The first one was always my favorite up until this film. Its a tight fast movie with everything you would expect from a Fast and Furious film. I cant wait until Fast Six",
      "total_reactions": 0,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "A+ for the bank safe scene.",
      "total_reactions": 0,
      "user": "gleenobly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "The most \"movie\" movie in the franchise to date, the film avoids a lot of the pitfalls associated with the genre while tripping over others in very obvious ways.  However, the group chemistry works very well in this film, and Justin Lin (between establishing shots of the giant Jesus statue) directs the hell out of the action set pieces.",
      "total_reactions": 0,
      "user": "Benjamin_Bayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Fast Five is so much fun ot watch. This movie is much more emotional and engaging since it is not about racing, it's about the characters trying to leave their dangerous lives with one last bang. The action scenes keeps the movie pumped up and help weave the story together. It never feels overdone or unnecessary but always makes sure to leave you with an OOOHHHH!!",
      "total_reactions": 0,
      "user": "garunimo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Basically fast cars, goofy characters that you know if you watched the series, great character interplay for a chase film, and awesome special effects, explosions, and a few good looking girls. It doesn't have much of a plot but be honest that is not why you are watching this movie, so who cares! Overall for a good fun thrill ride with narrow escapes and the most prepared crew for any circumstance it is worth the ticket price to see it in theaters.",
      "total_reactions": 0,
      "user": "Carnaged"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Okay let me start off by saying this FAST FIVE is no street racing film, it hardly has any racing at all in it. But this isn't a bad thing,you see the film kinda plays out like one of the OCEAN movies,they put a team together  to get money from a not so good person.Now the film has some amazing car chases and some intense fight scenes, my favorite being a very impressive train sequence.The cast is pretty good with most of the original cast in there with some new faces tossed in there, also returning from the Tokyo drift spin off and the 4th film is HUN, He plays a pretty big role in the film and hints to his role in Tokyo drift are in the movie.Now for some of the bad stuff,the movie isn't much outside of the Amazing car chases and stunts. The story doesn't end on a very good note and some parts don't make any sense at all. But if you are looking for a good time at the movies with some mates and wanna have a laugh and be amazed by awesome cars and hot babes FAST 5 is the movie for you.",
      "total_reactions": 0,
      "user": "CAGUYCA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "I'll be up front, I'm not a fan of the Fast series - I hadn't seen any of the others prior to this latest installment. But from my uninitiated perspective, I'd say that this hardly matters. OK, so there might be a few references for the die-hard fans of the series that passed me by, but that did not spoil my enjoyment of the film. It's loud, brash and incredibly fun. The highlight is undoubtedly the end chase through Rio - it's probably the greatest example of movie carnage you'll see this year. The Diesel vs. Rock fight is also pretty cool - it's like watching two slabs of prime steak tenderise each other. The film is also INCREDIBLY stupid...but in a good way. Go see it - just leave your brain at the door.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This movie rocked and seeing all of those great characters again was just awesome. I loved this movie alot. It's right up there with the first Fast movie. A very close second!!",
      "total_reactions": 0,
      "user": "ScottyLovins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Well done movie. ! That's all i can say.",
      "total_reactions": 0,
      "user": "zhayeeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "loved the movie, love all the 5 movies. only regret is that i dint get to see Vin Diesel and The Rock pounding their fists on each other's faces ! :P",
      "total_reactions": 0,
      "user": "prannoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I really enjoyed this movie. If your looking for an action-packed movie with ridiculous driving, explosions, gun fights, and some comic relief this the movie for you.  is a highly entertaining. There are some scenes that don't follow the proper parallel structure but if you can ignore that and \"the Rock's\" overacting this movie is a good one to see.",
      "total_reactions": 0,
      "user": "Princess_Peach"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Fast Five is definitely the best made of the fast films so far. I have always been a fan but I can completely understand now why the critics are giving it good reviews. Sadly I am one that will be begging for Fast Six now!",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "At one point in the series I really got bored of the same actions, over and over again. Not anymore. I went to see this at the cinema, and simply waited for what's to come for all 130 minutes in the movies. Very unexpected, but pleasantly surprised. Acting as always, not that great, even if Vin Diesel really captures the screen with his well known character. The appearance of Dwaine Johnson, really isn't as unwanted as expected, until the end. He represent a very competitive, sort to say, opponent. Another plus, would be reuniting of the former teams, from the previous movies. And now the ground breaker, the final chase. I don't really want to spoil anything, the main idea is see the movie and you'll find out for yourself how impressive and unique is in comparison to the previous ones, even though the first Fast and Furious(2001), was pretty good at that time. I consider the reason, now that movies are evolving on such accelerating passe, is the significant value they have financially. Some of them are much more improved, due the money fact. Fast Five is definitely one of them and a hell of a good movie I might add.",
      "total_reactions": 0,
      "user": "BeK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "As an Action film \"Fast Dive\" was good ! but as the forth sequel of the Fast franchise it was the worst ! Did they forgot that its a racing movie? we use to love this movie franchise because of this reason ! seems like they are throwing the best parts in each sequel ! There were no traditional race in this film !  i cant believe the cut the race part when Dom & O'cor went out for a car ! acting was good , Brazil was awesome ! soundtracks wasn't good at all (Compare to the fast 4 films) . the las Vault scene was good but not realistic ! Story : 1.22 [No race]",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Faire un Fast and Furious qui soit meilleur que le premier et qui enchante la presse Ã©tait une idÃ©e quasiment impensable. Et pourtant, ce cinquiÃ¨me opus rÃ©ussi ce pari haut la main de part des sÃ©quences d'action Ã©blouissantes, une mise en scÃ¨ne des plus Ã©nergiques, avec en prime des acteurs qui conviennent parfaitement Ã  leur rÃ´le (mÃªme Dwayne Johnson/The Rock qui ne brillait pas depuis Le Roi Scorpion). Il vrai que le scÃ©nario n'est pas toujours aussi original (et ce malgrÃ© bons nombres de nouveautÃ©s et de bons gags), les effets numÃ©riques bas de gamme (mÃªme si cela a Ã©tÃ© amÃ©liorÃ© par rapport Ã  l'opus prÃ©cÃ©dent) et que les voitures se font de plus en plus rares; mais tous ces dÃ©fauts ne peuvent que rester mineurs Ã  nos yeux devant un tel divertissement. Fast and Furious 4 prouvait que la saga en avait encore sous le capot, cette suite fait marcher la nitro Ã  plein rÃ©gime!",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "I had a lot of exceptions but as they say the bigger they are the bigger the disappointingness the was movie story and the movie is way to fast they think it was a great idea but well if u blink u might miss something literally i mean and there was a race one race which was disappointing and the ending is fake unbelievable now the actors were great as they are the rock i mean Dwayne Johnson was really believable character and the rest are the same as they are THE great thing about the movie was the sequences which was just outstanding and made all the bad go away the EXPLOSIONS ,THE CAR CHASES, THE CRASHES,AND THE SOUND WAS EPIC worth the watch fot the CAPS LOCK PORTIONS rest all are very bad i mean bad milk bad but it was a great watch in HIGH DEFINITION",
      "total_reactions": 0,
      "user": "mohya59"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "I'm not on the fan bus too much for this one. Being a huge fan of 1 and 4, I just didn't see much in the latest installment. It's a good action movie, but for a Fast & Furious film, it lacked. The best thing was having cast members from the other films in it. That worked. Glad they had Jordana Brewster in it more. Over all, it's a meh from me, but I am very excited for the 6th film.",
      "total_reactions": 0,
      "user": "driesy8888"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "i think the film was every good because Fast Five is definitely the best of the series and the most worthy to be called a sequel to the original. Fast cars, guns, and insane action sequences.Best in the series. Loved hauling the safe part. Was the most action ever. Also like seeing Dom with the FBI agent at end, was hoping for that. Looks like Lettie is still alive or maybe a start for another movie that was shown after end of movie.Also fast Five is definitely the best made of the fast films so far and i will be fan of fast five for ever.",
      "total_reactions": 0,
      "user": "ahmedmohammed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This was so much fun, I definitely agree to watching it again and again as there's so much action and really entertaining. its taken the best bits of the series and put it into one. sometimes you have to suspend belief in some of the set pieces but you cant help but go along with the ride. this is what summer is all about, pure entertainment, its the nearest thing to the original, I actually felt I was back in the that cinema way back in 2001 seeing it for the first time. Weather you got a train heist, the rock vs diesel punch up, or a downtown carnage finale its just awesome.",
      "total_reactions": 0,
      "user": "Imran24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "One world describes this movie: Awesome. I believe it is better than the original Fast and the Furious. The story had a good amount of cause/effect driven action that greatly related to the story. Characters were believeable. I can't wait for the next movie in the chain now...",
      "total_reactions": 0,
      "user": "Kawflin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "This is the best Fast in the series. The story brings the franchise to a better direction. The actors gave good performances and Dwayne Johnson helped make this Fast and Furious better.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This is the best action movie I have seen in the while. There was constant action and I cant wait for the next one to come out. Anybody who like action movie like Transformers should definitely see this.",
      "total_reactions": 0,
      "user": "arnyftw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "The best from the F&F; series yet.  All the relevant members from the previous movies are here, and the addition of Dwayne \"Rock\" Johnson, puts this cast head and shoulders above all the rest.  The action in this movie is nonstop, and is a first class adrenaline ride from beginning to end.  And the movie doesn't end with the credits, be sure and keep watching for a huge twist in the plot line to the franchise.",
      "total_reactions": 0,
      "user": "brykam51"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Who knew that  after four films, the fifth would wipe the floor with the rest?",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "I did enjoy the movie,but it could have been much more than it really was. There seem to be no plot whatsoever and some of the big name characters exaggerated the roles, or may be i simply expected more out of the series.",
      "total_reactions": 0,
      "user": "ansi322"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "its ridiculous, its insane, it has every cliche in the book, but god knows when the movie's over, you have one heck of a grin on your face. it is bonkers as heck. but anyone watching this movie will not care. people of course are going to hate it, but let them watch the awesome tinker tailor soilder spy instead, as this is not intended for them. this is intended for a night in with a few snacks and some friends just having one heck of a good time not worrying about the larger things in life. if the film did not have the ace action sequences, it would get a 3 for being bad all over. but it is made good by the craziness of the action sequences which add to the film. the plot is the pritt stick holding the sticks of dynamite together. no one really cares about the plot here. if they do, they should go and buy the aforementioned TTSS, because that is simply the better film for people who care about that. who cares? its fun, and though you will hate to love it, on a rainy day with some friends, there is little else better than this for shere mentalness. hate to love it, but love it you will",
      "total_reactions": 0,
      "user": "colorblindyoshi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Fast Five was awesome. It was essentially Fast and the Furious meets Oceans 11 except with more badasses. There wasn't as much car action as there was in the past movies (1 and 3 especially) but that really didn't hurt the movie much. Like the prior installment in the FF franchise, this one featured a really good story, impressive action, solid acting, and some unfortunately unrealistic aspects (like determining the identity of someone by using piss poor traffic cameras to read their eyes or face through a mask) that were the only real negatives of the film. Dwayne \"The Rock\" Johnson was a beast and a great addition to the series and the fight scene between him and Vin Diesel was epic. I wish they would've shown some of the car chases that they left out (Dom and Brian acquiring the Porsche for example) but I suppose they felt the movie was already too long. I also thought the brief cameo in the after-credits scene by two females from movies past was a cool touch but I truly do with they would've ended the story with this film instead of extending out the franchise. Regardless, it was definitely a good movie and most would really enjoy it.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Fast & Furious goes Ocean's 11.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Muscle men vs Muscle cars on steroids! Diesel and Rock are all you need to make action look Expendable. Rio is a brilliant backdrop to make the film an international success...Forget Brazilian Job 2...Fast 5 stole it.",
      "total_reactions": 0,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Fast Five is the first film in the series to drift from the traditional underground street racing films, and the result is an action-packed blockbuster culminating as an excellent heist film.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "First off,  this is a 9.5 out of 10.  Best fast&furious; movie yet.  Acting is good. Not Oscar winning performances, but everyone delivers. Score is good. Especially the sound of destruction throughout. Story is alot better. It's  a lot better then usually.  Action sequences are really good. There all so well made and created. Overall, this is a really good movie. If your skeptical then don't worry. This is a funny, action joyride for everyone.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "One of the best movies ever. Period. The best fighting scenes, gun shootouts, action packed scenes, romance and a bit of comedy, with a bunch of A-List actors we know and love. I would say this is one of the best if not the best in the series.",
      "total_reactions": 0,
      "user": "Playrules"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I really admired this fifth installment. With a new style and more intense action, the film takes quite a big step up from the previous films. It's not just the same old mindless car driving, instead we're approached with an energetic and exciting fun ride.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "AWESOME film! Justin Lin once again brought us a well directed and exciting, race thrilling story plot. One of the best action movies of 2011, wonderful stunts with amazing characters. Showing the best heist with the best characters for it. Knowing anything is possible when determined and a bit crazy enough.",
      "total_reactions": 0,
      "user": "DirectrC8LYN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Dom,Brian,Mia,Vince and more are trying to steel 100.000.000 $ from Hernan Reyes. But their way for greatness is blocked by  Luke Hobbs(Dwayne Johnson/The Rock). Luke is a cop an he always wanted to catch Toretto.",
      "total_reactions": 0,
      "user": "giannis19962012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "[7.1] It is very rare that a Fast and Furious movie is given, and where credit is needed, credit should be given. All of the crappy dialogue and the unnecessary, and what would usually be unfunny jokes are put in just the right places. The action is stellar, and the performances are surprisingly solid. This movie accepts its clichés and decides to work with them, and it works very well.",
      "total_reactions": 0,
      "user": "ncstatemike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "\"Running ain't freedom. You should know that.\" - Dom",
      "total_reactions": 0,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Sure the acting was horrible, but who went to see Fast Five for good acting?! F that nonsense. I wanted action and boy did they deliver. Hand down the greatest action film I have seen to date on the big screen. Mind was blown. Gorgeous special effects. I have no idea how they are going to top this, or even come close, but I cannot wait till fast 6!",
      "total_reactions": 0,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I prefer the actual Fast and Furious movies with racing but this one does get the job done. My favorite is \"Tokyo Drift\". Great cast, maybe not for this particular film, great acting, action sequence were awesome. watch for the action thats probably it. B-",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "The Fast and Furious series have been always considered average, (except for the second movie) but this one really redeems the series in a big way. It's a fun action thrill ride done right. There are many big changes that make this movie an actual success. Storyline, characters even the action. It definitely has more intense action than all of the movies combined, which makes the movie kick some serious butt. The characters have grown from mediocre actors to bringing out thier characters with feeling and emotion. This is how the series should have started in the first place. Overall, it's an intense action-packed joyride done right.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Its at times ridiculous, but 'Fast Five' is to undeniably fun, and action packed to not enjoy. In some ways its terrible, but in so many others it's some of the most fun your going to have at the cinema in years.",
      "total_reactions": 0,
      "user": "charlie_west"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I've seen the rest of the Fast and the Furious movies, and hoped this one was going to be just as good. And it was! In fact, i liked this one better than the original! It had great action, thrills, and was the same kind of story as the other ones. Of course, i have to comment on the undeveloped story, flat characters, and unrealistic parts of the movie. Of course, i knew i was going to have to suspend disbelief going in, but some of the sequences of action in this movie were too hard to overlook. They fall from a 1000 ft high bridge, plummeting into water, but of course, they are okay! Also, the plot and acting was iffy. This is a generic action thriller with lots of one-liners and car crashes. But that's all that we came for right? So that makes it a little bit better. If car chases, thrills, and kills are your criteria that you look for in movies, then definitely see this one. You won't be disappointed.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Very entertaining from start to finish, Fast Five delivers the fun it's predecessors lacked and expertly blends heist with a lot of high octane action and humor.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "the collective cast of the series gets my attention to the better goods.the action is expensive the intensity is \"spice of life\". the story is getting me somewhere like remind me of the early titles. i watch this 5 time more than by all the meanings.",
      "total_reactions": 0,
      "user": "Jrc126"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "For the fifth installment, Dom and Brian continue on another two hours or more doing ridiculous car stunts that they've been stereotyped for over the past decade. This time, you ought to give them credit. No one's ever refueled a rusty, old car with double the amount of gasoline.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "The Fast and the Furious is a great and effortlessly entertaining movie, i highly recommend it and the cast perform very well, I can't believe how bad the critic reviews are for this movie, because, nice cars, girls, money, street race, actor !",
      "total_reactions": 0,
      "user": "SnakeSLB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Very entertaining from start to finish, Fast Five delivers the fun it's predecessors lacked and expertly blends heist with a lot of high octane action and humor.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Yes, it is an ok film. At least began to grow notes in this series. I like the idea that reunites all the series and another thing. Vin Diesel and Paul Walker is best in these series.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "One of the worst films i've ever seen, probably the other users will dislike my review but, it is just my opinion.",
      "total_reactions": 0,
      "user": "PfenderStrat621"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Fast Five is the best in the franchise with fantastic action scenes and a greatly detailed heist that when executed is simply riveting and down right awesome.",
      "total_reactions": 0,
      "user": "DenisManu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "No words to say. This movie is very very very very very very amazing, I can watch this over and over again. Just amazin as I say. Rating this 10 / 10 !",
      "total_reactions": 0,
      "user": "XDavidX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "Possibly my favourite pick of the franchise. This film was absolutely stacked full of action driven at a reckless yet highly enjoyable pace. My emotions were swiveling left, right and centre. It also made the franchise more dynamic as it took an even bigger step away from the street racing theme (after the small step Fast & Furious 4 already made). As risky as the move was, I felt that both the incredible production married with the fantastic acting made this film a grandiose, action-packed stunner. Simply awesome.",
      "total_reactions": 0,
      "user": "Blanche"
    }
  ],
  "metascore": 67,
  "name": "Fast Five",
  "num_weekends": 13,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 22,
    "month": 4,
    "year": 2011
  },
  "opening_weekend_income": 5332096,
  "opening_weekend_income_currency": "£",
  "rating": 7.3,
  "rating_count": 294033,
  "rating_freq": {
    "1": 4264,
    "10": 47323,
    "2": 1815,
    "3": 3041,
    "4": 5730,
    "5": 13954,
    "6": 33796,
    "7": 74139,
    "8": 73824,
    "9": 36147
  },
  "release_day": 29,
  "release_month": "April",
  "release_year": 2011,
  "user_review_count": 369,
  "votes_per_demo": {
    "aged_18-29": 138597,
    "aged_30-44": 90528,
    "aged_45+": 12108,
    "aged_under_18": 1211,
    "females": 30752,
    "females_aged_18-29": 17544,
    "females_aged_30-44": 9659,
    "females_aged_45+": 1608,
    "females_under_18": 212,
    "imdb_staff": 19,
    "imdb_users": 294033,
    "males": 221385,
    "males_aged_18-29": 119887,
    "males_aged_30-44": 79775,
    "males_aged_45+": 10295,
    "males_under_18": 991,
    "non-us_users": 146073,
    "top_1000_voters": 598,
    "us_users": 40366
  },
  "year": 2011
}