{
  "avg_rating_per_demo": {
    "aged_18-29": 6.2,
    "aged_30-44": 5.4,
    "aged_45+": 5.5,
    "aged_under_18": 7.1,
    "females": 6.2,
    "females_aged_18-29": 6.4,
    "females_aged_30-44": 5.8,
    "females_aged_45+": 5.8,
    "females_under_18": 7.5,
    "imdb_staff": 4.7,
    "imdb_users": 5.9,
    "males": 5.5,
    "males_aged_18-29": 5.9,
    "males_aged_30-44": 5.2,
    "males_aged_45+": 5.4,
    "males_under_18": 6.5,
    "non-us_users": 5.7,
    "top_1000_voters": 4.8,
    "us_users": 5.7
  },
  "avg_screens": 1604.3636363636363,
  "budget": 24000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 1,
    "year": 2012
  },
  "critic_review_count": 157,
  "duration": 113,
  "genres": [
    "comedy",
    "drama",
    "music"
  ],
  "gross_income": 51780537,
  "max_screens": 3555,
  "mc_avg_user_score": 5.8,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 24,
  "mc_movie_name": "Footloose",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 91,
      "summary": "Stepping into sacred shoes once worn by Kevin Bacon, Wormald handily owns the role for a new audience. Same goes for a terrific Miles Teller (Rabbit Hole) in the sidekick role of Willard so memorably originated by the late Chris Penn."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 90,
      "summary": "Brewer, who spent most of his childhood in Memphis, is one of the few contemporary filmmakers I know of who can make movies about the South without sentimentalizing it, glorifying it or looking down on it."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 83,
      "summary": "Wormald won't make anyone forget Bacon, but he dances better, and without a stand-in. Hough's dance ability is well-known, but she also displays flashes of acting skill."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Footloose won me over early, with a sequence in which the hero gets all heavy metal while restoring his badass ... VW Bug."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "The new Footloose does everything it needs to do. It's a vibrant youth musical that will appeal to audiences who haven't seen the 1984 original. And it has enough charm and life to it to compete with the memory of the earlier version."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "It hardly needs to hang its head around the original, and it bolsters Brewer's standing as a talent of note."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Finally, along comes a remake – a darn faithful one, too – that's not a just a pointless rehash or mindless retread."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Brewer's Footloose has sex, swagger, and even an edge of danger, but in the end, he's hamstrung by the project's innate ridiculousness."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "Plotwise, though, Brewer's Footloose is anything but loose. In fact, it's rigidly loyal to the original, to the point of slavishness."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "Footloose never needed to be dragged into the 21st century, but Brewer has made it look and sound a little bit more like the real world."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "This remake does something less organically fun. It makes kids nostalgic for something they never experienced."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "As remakes go, Footloose is fine, serving up slightly fresher batches of cheese and corn. But why? Why?"
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "The result is that rare breed of big-studio pictures: A remake that makes sense."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "If the Footloose remake had its own signature dance, it'd be called the Push-Pull, as this hip-to-be-sorta-square movie, much like the small-town teens within it, has a mind for propelling itself toward a progressive future while continually being yanked back by cherished hallmarks of the past."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "Brewer gave the film a little Southern hip hop, and brought in real Southerners Quaid, Andie MacDowell and Ray McKinnon to further Southernize it."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "When the characters in Footloose are dancing and the music is blaring, the film comes alive. It has energy and personality. Would that the same could be said about the dramatic scenes, which are hamstrung by a combination of mediocre acting and atrocious dialogue."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Stays remarkably close to its predecessor in all the ways that count."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Oddly, Craig Brewer has softened the tone for his remake. But nearly everything else remains intact, and -- surprisingly -- that's just enough to win us over."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "This Footloose it's a pleasant reminder of the past for fans of the first one, and an agreeable-enough experience for everyone else."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Suffering through flatlining romantic and dramatic interludes isn't any less painful now than it was in '84, but when this musical occasionally kicks off its Sunday shoes, the dynamic memory-lane trip actually approaches - Kevin help us! - something resembling genuine fun."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Nothing in Footloose comes close, in this respect, to the best moments of Brewer's previous, vibrant if uneven films \"Hustle & Flow\" and \"Black Snake Moan,\" but this heartfelt retread of a notably thin popcorn property does come alive during an illicit dance-off."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "There have been far, far worse remakes out there. Harmless, feel-good fun."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "From start to finish, Brewer's remake exudes the look and style of its forebearers: semi-awkward dance choreography, clunky dialogue and an obedience to formula that borders on cliché. But somehow, it works."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "Paramount's Footloose reboot never quite cuts loose enough to distinguish itself from the original."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "This same premise holds for the remake, and it seems more pandering (and dated) than ever."
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "While dance sequences are not particularly well edited compared to the new breed of dance flick, Wormald and Hough are exciting hoofers to watch."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Silly as it was, the first movie had a more innocent and campy spirit than this calculated, if faithful, redo."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Footloose poses as a bold update, but it's shockingly out of step with the times."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Somehow Footloose never finds its rhythm. The maudlin scenes drag on, and the livelier moments pass by too quickly. It only works when it settles down and lets the characters (and the audience) hang out and have a little fun."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Footloose 2011 is harmless as far as it goes, but on the dance floor and off it never goes nearly far enough."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Brewer must have convinced himself that a schlocky old movie would speak eloquently to today's teens. About half of the time, he pulls it off."
    },
    {
      "critic": "Sam Worley",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie plays like a slightly degraded version of the original: the dialogue is a little lamer, the acting a little poorer."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The result is a film that feels hidebound. And nobody ever called a dance-driven movie \"hidebound.\""
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The new film may also serve a purpose by showcasing a dynamic and attractive new actor, Kenny Wormald but, otherwise, this is a by-the-numbers affair."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 38,
      "summary": "This new Footloose is a film without wit, humor or purpose."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "When you think of Footloose, you canâ",
      "total_reactions": 1,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "With such a weak, outdated story, I thought they might rely on more dancing.  But unfortunately no.  More music and more dancing would have been the only way to save this.",
      "total_reactions": 2,
      "user": "jdmarc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "\"No one was naked! You mistake yourself, uncle!\" Abigail pleads with Reverend Parris, Salem's spiritual leader, who claims to have seen a dress lying on the forest floor, and a girl, he deduces as being the dress' owner, running naked through the wooded area of his province. \"I saw it!\" the reverend, tells his niece, rising with anger, when she tries to dismiss the notion from her uncle's head, while Betty, the preacher's unconscious daughter, sleeps amidst the heated words that will dictate the ensuing trajectory of this theocratic hamlet. What did the preacher really see? Good or evil? We think, good. Alas, in Nicholas Hytner's adaptation of the Arthur Miller play \"The Crucible\", the disputed incriminating activity that Miller introduces through hearsay, by the author's own volition, now becomes dramatized; we see what Parris sees: the naked girl and the whole nine yards, including an animal sacrifice, in which Abigail the chicken-slayer smears fowl blood all over her face. We see witchcraft; we see cause for the reverend to be concerned about his parishioners' souls. In the 1952 stage production of \"The Crucible\", Miller allows the reader to give Abigail the benefit of the doubt. Her uncle, perhaps, overreacted, since the incident that lands Betty in bed takes place offstage. Even though the spell which Tituba conjures no longer involves the raising of the dead(in the 1997 film, the black slave merely cooks up a love potion), the ceremony still involves violence, and implied sex. Differing from the stage, and on the page, the moviegoer is less likely to fault the pious man for bringing in outside help. After all, the play loses its objectivity. With our very own eyes, we see witchcraft. From Parris' point-of-view, we would have to concur that something has to be done about this affront to his Puritanical values, a mindset that is driven by superstition, which makes allowances for the devil's existence in the physical world. Similarly, in this remake of Herbert Ross' \"Footloose\", the 1984 critically underrated sort-of musical(what Mickey Ward's sisters would dismiss as \"one of those MTV [films]\"), the movie needlessly tacks on the backstory, in this case, the four Bomont teens who die in a head-on collision after dancing their asses off at a party where loud music is present(and the decadent temptations that loud music encourages), hence the ban. For the same reasons as the sequence involving the witchery, unwisely exposed, in \"The Crucible\", the fatal crash, treated as myth in the original film, and as fabric that smothers Bomont into a cultural revival of the reactionary fifties, also, would be better left unfilmed, because the subsequent actions enforced by the town's spiritual leader seems less like a kneejerk reaction when you see for yourself, the source of the righteous man's horror. Reverend Moore seems less the fascist than a wrestler, this time around, yet as it turns out, John Lithgow's take on the preacher reveals the same truths about the dance Nazi, with the difference being, the original screenplay withholds the fact that he was a grieving parent(and Ariel, a grieving sibling) until later in the narrative. This preacher wants to ward off the devil, too. In both versions, Ren McCormack raises hell in this closed-off rural community by blasting \"Metal Health(Bang Your Head)\" from his car, the same Quiet Riot song used in \"The Wrestler\" to demonstrate how Randy \"The Ram\" Robinson lives in the past, just like this remake. The nostalgia in this \"Footloose\" is two-fold; it yearns for both the 80s and the 50s, since the original film recalled the ban on rock and roll, just thirty years prior in small-towns like Bomont. Now  sixty years has passed, making the estrangement even greater. How appropriate that the heavy metal classic should happen to be featured in another wrestling picture, wrestling the way that Barton Fink intended, in which the moral scribe pitches a story idea to the studio head about a man wrestling with his soul, a man just like Shaw, who tries to get his daughter's soul into a half-nelson. Julianne Hough plays Ariel with the same suicidal tendencies, but her predecessor, Lori Singer, not only plays chicken with a train, but makes like Zoe Bell in \"Death-Proof\", where she changes rides the hard way, as an emerging semi on a two-lane highway nearly turns daddy's little spitfire into roadkill. She's a wrestler too; she can't decide if life or death is more important. By changing Ren's hometown from Chicago to Boston(just 25 miles from Salem), \"Footloose\" brings \"The Crucible\" even closer to Bomont, in which the heavy metal stylings of Quiet Riot becomes analogous to Tituba's Barbados songs. The Salem girls pretend that they're in communion with the devil, and to a certain extent, it's what Ariel does too, pretending to be a hellraiser, by losing her virginity. By showing the accident, the ban starts to make more sense.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "The movie was very...so so with the dancing. In the beginning, there was way too much drinking, the language was bad a couple times, and the dancing was too sexy, and, as a breakdancer, their \"sexy dancing\" made me want the throw up. However, if they didn't drink, the language toned down to half, and the dancing was always like it was in the very last scene (which was absolutely amazing!!!), I would have given it a ten out of ten! Those three things were my only objections. The rest was great! I was glad to see a church in the movie. I don't believe the church and state should separate. Furthermore, like seen in this movie when trying to remove the ban on dancing publically, I believe that even though there is a \"seperation\", most good laws actually have christian/biblical morals. Dancing is a great way to show the world who you are, either a bad boy/girl (like the horrid dancers) or good and fun (like the breakdancers at the end).",
      "total_reactions": 1,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "I rarely find a reason to log on and give my opinion about movies.  But I was so bored and disappointed by this version of Footloose I had to.  I went with my wife, my nieces (11 & 12) and my 8 & 11 year old daughters.  I had high hopes.  I did not for one second think it would be better than the original which I felt was fun.  Well about 20 minutes in I thought I might fall asleep.  The same movie but with less dancing, more talking, bland acting and bad music.  They added all this rap and made the town dancers look too professional and the girls like Pole dancers.  The character of Ren did the same dance over and over and over again.  The movie was slow.  And too long.  And just not fun.",
      "total_reactions": 1,
      "user": "LeahAndNic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "Brutal movie, bad acting, horrible story, and lack luster dancing. The only thing keeping it from being a 0/10 is Julianne Hough's looks. Save your time, DO NOT BOTHER WATCHING!",
      "total_reactions": 1,
      "user": "Johnnydoedoe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "The new Wren is solid, but he's nowhere near as good as Kevin Bacon was.  You can say the same thing about every actor in this film.  Except Dennis Quaid, that is.   I love him, but he was the weak link in this movie.  John Lithgow's scenes were so critical to the success of the original - his disapproving words toward his daughter, his messages to his congregation, and his decision to allow (or not allow) the dance carried so much weight in the original.  Quaid's performance is like a damp cloth - did zero for me.  The biggest surprise for me is the new Willard - very different approach than Chris Penn's take, but it's fresh, fun, and interesting.  Think of this film as a tribute band - you go to see it to celebrate the greatness of the original - not to accept it as a substitute or an \"update\" in any way. In that respect, it did it's job (save for Quaid... sorry Dennis - I think I need to rent Breaking Away just to build you back up in my mind....)",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "Apparently, the producers wanted to appeal to the widest audience possible, while not alienating anyone, so they created a bland remake. It centers around  a cool guy who moves from Boston to a small Georgia town, where dancing and other fun things have been outlawed. In usual Hollywood style, not one of the high schoolers looks under 18, but their dramas are typical teen trash. Worst of all, the music spans from country to hip-hop, all of it unmemorable and uninspiring. Even the remixes of the original movieâ",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I was dragged to see this with my girlfriend. I did not know what I was getting into. I was impressed,(keep in mind I did not see the original movie) . The story line was unique and the dancing was mixed with old school and new school. Also the music was great. Good news is next the Girlfriend wants to watch one of her movies, there is one I like.",
      "total_reactions": 0,
      "user": "DrMovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "I went to go see this the other day with my gf for our 2 year anniversary (her choice) and ill admit i did enjoy it. Definitely not an oscar winner or any awards for that matter by any means, but i did enjoy it. Irts a fun energetic film with actually a few comedic lines thrown in. I never saw the original with Kevin Bacon so i dont know how to compare although my gf said it was nowheres near as good as the original but we enjoyed it. If your looking for a fun cheesy energetic film with some interesting dance moves to use up an hour and 40 min of your time then give it a watch, but if your looking for a deep story and top notch acting then maybe this isnt for you, 5.5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The script closely follows the original. However, I didn't enjoy the cast as much, and found the choreography lacking, which was a huge disappointment, given that Julianne Hough is such a terrific dancer. The best way that this movie could have separated itself from the original plot would have been to keep the dancing entirely current, instead of trying to mix the 80s style with a more current style...it just didn't work, partially because the male lead wasn't convincing enough to pull off both styles (and completely lacked charisma). The show would have been served much better with a male lead like Channing Tatum. On a positive note, I think that Julianne Hough and the actor who played Willard were very convincing in their roles.",
      "total_reactions": 0,
      "user": "Dobby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "With a nice script and the mixer of dancing with a bit fight-racing Footloose comes with a total entertainment. Amazing set on a Cowboy tone and a charming cast Footloose is never boring. Kenny Wormald did good but I thought he would do better. Julianne with her pretty face, charming smile and those amazing hip movement kept me going. She was amazing and she should have more dance screen time. Most of all the movie is not some lame dance movie. It had those action scenes with a bit drama.",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "Rent-it - It's basically the same Flashdance meets Rebel Without a Cause film from the 80s, but Miles Teller's charming learning-how-to-dance scene makes it worth renting -- if youâ",
      "total_reactions": 0,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "I wanted to avoid seeing Footloose because the trailer didn't seem very interesting to me, so of course I was dragged kicking and screaming to watch it by my wife.  I was expecting to hate it, but was surprised to find it have a fair amount of heart and soul with decent acting performances.  It is very \"average\" as far as films go, so don't expect to be \"wowed\".  I'm still puzzled as to why they felt the need to remake this script in the first place, because this 2011 version brings nothing new to the table...except more sex and sex appeal.    Wait until it comes out on DVD to see it, and even then try to use a coupon so you save some money.",
      "total_reactions": 0,
      "user": "CincinnatiDave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "One of the main issues with this version of Footloose is the believability of it.  The concept of banning dancing is far-fetched enough but at least in the original you believed Bomont was a small town and that these laws could have been enacted. The people and look of it all seemed legit.  This new version felt fake to me, everyone was too pretty, the dance moves all too choreographed. The town just didn't seem all that small to me and it was so modernized that it just didn't seem possible that the townspeople could have gotten away with passing these laws.   The other main issue is the lead.  Kevin Bacon's Ren was supposed to be a tough guy but he did have a good heart and ultimately was likeable. To me  Kenny Wormald is not likeable at all, in fact he comes off as an a-hole.  I never felt much warmth coming from him and to me that really sinks the movie.  Many of the scenes are taken from the original but given there own spin which leads to good and bad moments.  I also felt they wasted opportunities to use more music as well.  Certain scenes I was expecting some backround music and when that didn't havppen, it threw me off a bit. I understand that part of the problem is that you are comparing it to the original and how they filmed it, so it makes it difficult for the updated version not to be overshadowed.  Speaking of updates, there are some that work.   Ren's uncle is revamped in a good way and the actor playing Willard does a good job as Ren's best friend and comedic foil.  Its an entertaining movie but lacking in realness and in need of a little more originality",
      "total_reactions": 0,
      "user": "cousinrk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I joined metacritic to write this review. I loved this movie, and I don't typically like chick flicks. If you were expecting a classic, then you didn't see the original, and a remake is never going to be a classic if the original wasn't in the first place. This was a great tribute to the original footloose - it was fun, exciting and had great dancing and great music! Julianne was hot, Ren was even hotter, everyone loved Willard so I won't compliment him again, and Ren's uncle and aunt were my favorite. If you didn't like it then I'm guessing you identified a little too much with Chuck...either that or you don't know how to dance your *** off!! See it.",
      "total_reactions": 0,
      "user": "applesandstuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "This slightly modern take on the original is great for family audiences as well as adults.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "An interesting case in Footloose, I believe in other trama, but I found other, and is an incredible trama, I don't watch the original, and this new version is excellent, the dance scenes are fantastic, the music are fabulous, the performance of Kenny, Julianne and Dennis are fantastic. This Footloose is a new classic. I love it.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "this movie was very gory it was like war between jack and joey the 3rd the gunbattles were gorylicious i cant wait till i see it again so i can have more fun listening to shakespere in the backround!",
      "total_reactions": 0,
      "user": "thelonleytigerz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "A very worthy remake of a classic. Wormald, taking on an important and risky role, nails it. And Dennis Quaid, though I am not a fan, delivers the human aspect of the Reverend far better than Lithgow did.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I was surprised with this remake. The only median performance was Julianne. All others are well and Kenny is great. And the script was well adapted to the present day.",
      "total_reactions": 0,
      "user": "ReeAlvees"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Director Craig Brewer has Southernized the story...made it lighter on its feet.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 58,
  "name": "Footloose",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 10,
    "year": 2011
  },
  "opening_weekend_income": 15556113,
  "opening_weekend_income_currency": "$",
  "rating": 5.9,
  "rating_count": 38837,
  "rating_freq": {
    "1": 2183,
    "10": 4630,
    "2": 1047,
    "3": 1588,
    "4": 2868,
    "5": 5692,
    "6": 7889,
    "7": 6609,
    "8": 4154,
    "9": 2177
  },
  "release_day": 14,
  "release_month": "October",
  "release_year": 2011,
  "user_review_count": 128,
  "votes_per_demo": {
    "aged_18-29": 17463,
    "aged_30-44": 10820,
    "aged_45+": 3317,
    "aged_under_18": 178,
    "females": 16064,
    "females_aged_18-29": 10074,
    "females_aged_30-44": 4034,
    "females_aged_45+": 933,
    "females_under_18": 134,
    "imdb_staff": 8,
    "imdb_users": 38837,
    "males": 17054,
    "males_aged_18-29": 7222,
    "males_aged_30-44": 6665,
    "males_aged_45+": 2349,
    "males_under_18": 40,
    "non-us_users": 15712,
    "top_1000_voters": 285,
    "us_users": 9360
  },
  "year": 2011
}