{
  "avg_rating_per_demo": {
    "aged_18-29": 7.6,
    "aged_30-44": 7.3,
    "aged_45+": 7.0,
    "aged_under_18": 7.6,
    "females": 7.5,
    "females_aged_18-29": 7.6,
    "females_aged_30-44": 7.3,
    "females_aged_45+": 7.3,
    "females_under_18": 7.6,
    "imdb_staff": 8.0,
    "imdb_users": 7.4,
    "males": 7.4,
    "males_aged_18-29": 7.7,
    "males_aged_30-44": 7.3,
    "males_aged_45+": 7.0,
    "males_under_18": 7.6,
    "non-us_users": 7.4,
    "top_1000_voters": 6.3,
    "us_users": 7.5
  },
  "avg_screens": 69.5625,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 9,
    "year": 2013
  },
  "critic_review_count": 348,
  "duration": 86,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 4063238,
  "max_screens": 233,
  "mc_avg_user_score": 7.7,
  "mc_metascore": 82,
  "mc_mixed_rating_frequency": 23,
  "mc_movie_name": "Frances Ha",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 109,
  "mc_pro_critic_reviews": [
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "If films were gestures, this one would be a perfectly timed shrug, with the smile to match."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2013
      },
      "score": 100,
      "summary": "The writing is so musical, so attuned to human frailty and aspiration, that I defy anyone to watch the movie without smiling — with amusement one minute, rueful recognition the next, but probably always with some measure of simple, undiluted delight."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 100,
      "summary": "Effortless and effervescent, Frances Ha is a small miracle of a movie, honest and funny with an aim that's true."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 100,
      "summary": "With its swift, jaunty rhythms and sharp, off-kilter jokes, Frances Ha is frequently delightful. Ms. Gerwig and Mr. Baumbach are nonetheless defiant partisans in the revolt against the tyranny of likability in popular culture."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 91,
      "summary": "Above all, Frances Ha is a wry and moving portrait of friendship, highlighting the way that two people who know everything about each other can nevertheless grow apart as their needs change."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 91,
      "summary": "At times, Frances Ha strains from emphasizing the characters' snarkiness and disregarding plot. By routinely going nowhere, however, the movie eventually finds a distinctive voice that carries it through."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 90,
      "summary": "There is no particularly cathartic climax to Frances Ha. Instead there is a more realistic depiction of Frances’ growth. Like Gerwig’s performance, it’s natural, it’s realistic, perfectly believable."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 90,
      "summary": "The film is so engaging because it's so damn funny."
    },
    {
      "critic": "John Anderson",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 90,
      "summary": "Frances Ha also marks the rare instance in which an actress has the perfect role at the perfect time. Ms. Gerwig's work here is fragile, delicate, subject to bruising; something that could wither under too much attention. Perhaps Ms. Gerwig is the greatest actress alive. And maybe Frances Ha is just the ghost orchid of independent cinema."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 90,
      "summary": "Frances Ha is a patchwork of details that constitute a sort of dating manual—not one that tells you how to meet hot guys, but one that fortifies you against all the crap you have to deal with as a young person in love with a city that doesn't always love you back."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 90,
      "summary": "The director mixes moods with a playfulness that is both brazen and carefree and yet precisely modulated, yielding results that amplify the specific content of the screenplay.  This makes for a film that, however cheap it was to make, is incredibly rich to watch."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 89,
      "summary": "Funny and touching, Frances Ha may very well be the most eloquent take yet on a generation in flux – a cinematic talk-back to so many Atlantic articles, minus the scolding and the statistics, and uncharacteristically (for Baumbach) uncynical."
    },
    {
      "critic": "Mary Houlihan",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "Filled with witty dialogue and natural performances, Frances Ha marks a return to form for Baumbach."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "You may watch Frances Ha relating to little of it, or a lot of it, but this \"road movie with apartments,\" as the director (shooting here in velvety black-and-white, recalling Woody Allen's \"Manhattan\" in its texture) so aptly put it, is informed by a buoyant, resilient spirit."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "Baumbach, in his most compassionate film since The Squid and the Whale, catches Frances in the act of inventing herself. It's a glorious sight to see."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 85,
      "summary": "Running through the streets of New York for the sheer hell of it, Frances has the gift of joy to her very marrow. As for Greta Gerwig, I get the feeling she's just gearing up."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "Baumbach keeps everything dialed down to medium cool, with occasional flashes of exuberance like Frances dancing down a street to the beat of David Bowie's Modern Love."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "Gerwig, who previously starred in Baumbach's \"Greenberg,\" is charmingly awkward. And Sumner (Sting's daughter) is an ace with deadpan one-liners."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "Loose, limber and driven by a fierce energy and staccato/pause rhythm we haven't seen previously from this filmmaker, Noah Baumbach's sublime Frances Ha is a fresh and vivacious near-reinvention of the director/writer's comedic milieu."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Although the monochrome photography will invite comparisons with Manhattan, Frances Ha is closer in spirit to Godard than Woody Allen. Anchored by a charming performance from Greta Gerwig, it’s as light and breezy as a walk in Central Park, and just as refreshing."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Charming, poignant and often very funny, Baumbach and Gerwig’s latest collaboration is a joyous portrait of an unformed personality that should strike chords of recognition in all who watch it."
    },
    {
      "critic": "Catherine Shoard",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Gerwig's performance is full of depth and nuance; self-conscious without being mawkish, clever behind the kook."
    },
    {
      "critic": null,
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Baumbach pushes beyond sincerity in search of truth, drawing from such stylistic forebears as the French New Wave, Woody Allen and Andy Warhol's Factory films to capture a reality that has eluded him on his more polished dramedies."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Gerwig makes us want to believe that in a city where anything is possible, Francis Ha has the last laugh."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "It's visually appealing, but embodies the movie's (and Frances') problem: wanting to be taken seriously without putting in the real work required to prove you're actually serious."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Playful, effervescent comedy."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s a skimpy, overextended riff, but some of the seemingly tossed-off moments are lovely."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Baumbach seems mainly interested in capturing the whimsical rhythms of unformed post-college life, with money too scarce and roommates too ample — but he already did that, did it better and with more rueful feeling, in the much funnier “Kicking and Screaming,” the debut he made at 25 and one of the best films of the 1990s."
    },
    {
      "critic": "John Semley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Noah Baumbach's film feels like too perfect a portrait of quarter-life malady, down to the rushed redemptive endnotes and Greta Gerwig's idealized heroine."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Frances Ha turns melancholy and almost painful to watch in its last act as she and we see the dead end dead ahead. And the film doesn’t seem to earn the finale the two of them cooked up for us."
    },
    {
      "critic": "Godfrey Cheshire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "[Baumbach's] collaboration with Gerwig has a freshness that may or not owe something to first-blush romance but that renders this bittersweet comedy occasionally inspired, frequently charming and always watchable."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Daringly plotless and disconnected (“just like my life!” squeals the target audience), Noah Baumbach’s latest, a breeze, feels a lot less self-absorbed than usual, mainly for not having a neurotic at its core."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Frances Ha is an irritant when it lingers. When Baumbach’s touch is more glancing — when he cuts before the humiliation — it sings."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Frances Ha feels like a collaboration between two people in love, and not always in the best way. There are too many scenes in a row that make the same point."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Aiming for lightness but landing with a thud, Frances Ha is a well-meaning blunder. Director Noah Baumbach’s ode to Brooklyn twentysomething life is a flibbertigibbet fable that, like a self-absorbed flirt you meet at a party, grates on the nerves despite being easy on the eyes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Not only love, but sex, or rather, as Helen puts it, the \"whole package\", is what the art gallery curator wants from her coupling with Jessica, who insists on downplaying sex as being just one component\" in a \"loving and tender\" relationship. \"What we have is a friendship,\" she protests, \"best friends\", even, which for her incrementally straight partner, a journalist, is enough. How did Francois Truffaut tackle the same terrain of sexual politics, as portrayed in Kissing Jessica Stein? The narrator, in Jules and Jim, recalls how \"people called them Don Quixote and Sancho Panza,\" and that \"rumors circulated behind their backs about their unusual friendship.\" Although Jules puts the kibosh on Jim's pursuance of Catherine, whom we presume to be his lover par excellence, we later learn, after both men return from war, that their marriage is marked by celibacy. Sabine looks nothing like her father, Jim notes. Catherine's satiation, Jules admits, comes from other lovers. When he hands over Catherine without any hesitation or qualms, it's because the cuckolded husband apprizes his best friend's platonic love as being on par with his wife's feminine powers. Bi-curious Jessica, ultimately, doesn't covet women, and yet, bawls her eyes out over Helen's departure as if she did. Whereas Jessica, and Jessica alone would subscribe to the notion that \"Jules' and Jim's friendship had no equivalent in love,\" Frances and Sophie take delight \"in the smallest things\" and accept \"their differences with tenderness,\" a shared sensibility that transcends love of all persuasions. Manhattan settings both, essentially, Frances Ha picks up where Kissing Jessica Stein leaves off, but here, there is no analogue for Helen, since both Frances and Sophie are randy heterosexuals. \"The coffee people are right. We are like a lesbian couple that doesn't have sex anymore,\" Frances says, sharing both cigarette, and inside joke, in regard to the careening apogee of their avowed sexual orientation. Modern love, indeed. Only David Bowie can explain them. When Frances' laptop light goes out, like a lover, Sophie stops the aspiring dancer from adjourning to her own room, and like a lover who nags about a partner's annoying little habits, she softly chastises Frances over her bad decorum, regarding socks in bed. Socks are the only piece of clothing she removes, which may surprise the viewer, since all of New York can see the uninhibited pair carrying on like Don Quixote and Sancho Panza. Alas, so who is Jules? And who is Jim? The film, it would seem, casts the titular character as Jules. Akin to the scene where Jim gives Catherine to his closest confidant, Frances, in a bequeathing of sorts, suggests that Sophie hook up with Lev, a roommate(one of her \"two husbands\", a Jules and Jim reference), which would reunite the Vassar graduates, turning the Manhattan apartment into something resembling her counterpart's crowded Austrian chalet. But Sophie, like Jim, already has a partner, and this is where Frances Ha diverges from the Jules and Jim template, since Frances' bespectacled friend remains loyal to Patch, whereas the German can't choose between Catherine and his fiancee. Frances, ever the martyr, rebuffs Lev's advances, because, perhaps, thinking ahead, she sees him as the key to luring Sophie back into her life, even though the Sacramento native thinks he's \"magic\". Back home for Christmas with family and friends, this transplanted New Yorker, now signified by tract housing instead of skyscrapers, and churchgoers instead of artists, seems less like a persona than a person, and more like a woman than a man. In NYC, she adopts the masculine role by paying for Lev's dinner, and also, Benji draws attention to her \"weird man walk\", suggesting that Frances is in drag, albeit less visibly than Catherine, who with chapeau and painted mustache, passes herself of as a man, one sunny day in France among the boys. Arguably, the scene where Frances teeters along the river Seine, the same river where Catherine jumps into, is not the first direct steal from Jules and Jim. While Frances' mother pounds on the bathroom door, the daughter lies down in the tub, more or less, underwater, which abstractedly recalls Catherine's drowning, when she drives, with Jim riding shotgun, off the dock. Like the similarly-themed Superbad, porn-lovin' Seth declares, \"I don't know what I'm going to be into ten years from now,\" the same ambiguity imbues itself in this familial exchange: \"Frances, how much longer?\" asks mom. \"I'll be out in a second,\" responds her adult child, or, maybe give it ten years. From an objective distance, Jules and Jim lock eyes, and for emphasis, the mis-en-scene freezes. What do the eyes say? In Frances Ha, the filmmaker instead employs close-ups and a shot/countershot during the climactic staring, following Frances' first show as a choreographer. We can see. What are we seeing?",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "\"Frances Ha\" is like an episode of \"Girls\" in which the girls suddenly, thankfully, are not annoying nymphomaniacs. Greta Gerwig is endearing, with her difficulty facing life's realities (and her bad hair). But she can't make up for the fact that F's aimless missteps are not that entertaining. Also, the intense passion  between the two girlfriends -- continual mini traumas, constant I love yous -- just seemed odd & ridiculous. Really, really liked Noah B's other films, but found this one blah.",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "The movie is only 86 minutes long and yet after the combination of being bored to death and listening to one of the most irritating characters in movies this year, it felt like 186 minutes. The movie seemed to rely on the quirkiness of the main character, which faded very quickly.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "This is my second consecutive Noah B. movie starring Greta Gerwig which just fell flat for me.  Sure, it's somewhat real, it's clever, and urbane, but it's also very catty, nasty, and trendy.  I chuckled twice in the movie, but didn't fully laugh once.  I wanted to like it and laugh more, but  the movie didn't pull it out of me.",
      "total_reactions": 6,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Greta Gerwig co-wrote this with her hubby/director Noah Baumbach, which is pretty obvious. The character (and apparently the actor) are self-involved to the exclusion of good filmmaking. I'd call it a character study, but the character's not that deep. She 's a woman who is not successful at career, finances or friendships (with the exception of her best girlfriend). She ambles thru her aimless life, which starts out charmingly but gets tiresome and talkative before it's over. Maybe Baumbach thought shooting it in black and white would elevate it above basic twentysomething mumblecore, but it didn't work for me.",
      "total_reactions": 8,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "A big disappointment. I wanted to like it, but I couldn't. Frances is terribly self-absorbed and oblivious to the feelings of those around her. Up until the last five minutes, every chance she has to make a decision, she make a bad one.  That isn't realism to me; in real life we make a mixture of good decisions and bad ones. Only the ending, where she finally wakes up, saved the movie from being a complete disaster.",
      "total_reactions": 3,
      "user": "emkadv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "In a month of sequels (Star Trek 2, Hangover 3, Iron Man 3  you get the picture), it was nice to see something original on the screen without a number in its title.",
      "total_reactions": 3,
      "user": "greygoose"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "If you want to relive your 20's something screaming scenes that involve either yourself or watching your roomies, friends, lovers, ex-lovers, or maybe lovers about paying the rent...go ahead & enjoy...I did not. One of the very, very few movies that I have walk out on.",
      "total_reactions": 4,
      "user": "ddble"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "A sweet film about friendship and getting your life on track. Greta Gerwig gives a good performance. The directing is good, though the script could have used a little work.",
      "total_reactions": 2,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "This movie could have been a good story about an almost 30-year old trying to find herself. Or about how infantile this generation is. Could have. The potential is there. But it is not. With a notable exception of a few funny lines, it left me bored, looking at my watch and mentally scratching my head why on earth it got critic reviews so high...",
      "total_reactions": 2,
      "user": "netflic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "It was my personal favourite of the year. I just can't show how much I",
      "total_reactions": 2,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "I’ve been dying to see this for a while; and Noah Baumbach’s infectious ‘Frances Ha’, bubbles with pizzazz. This is a witty character study about Frances Frances Halladay (Greta Gerwig), a 27-year-old dancer who lives with her best friend Sophie. When Sophie decides to move out, leaving Frances low and dry, Frances is forced to figure out how to live her life. Not to take things too personally, but as 20-something year-old I can’t help but relate with some of the difficulties faced by the titular character and that struggle to get started on life. While this is clearly a Noah Baumbach film, I think equal credit should be given to star and co-scribe Greta Gerwig. Her contribution to the indie-film realm these past few years have been felt and her presence here couldn’t be any stronger. The shear level of wit, sincerity and (most of all) charisma that she brings to her character was truly something special; and should not be taken lightly. Drawing from the French New Wave and Woody Allen (mainly during the 70’s) Baumbach crafts a deliciously stylized film that tells the story in an utterly unique fashion. The black and white cinematography does so well at setting the bleak tones that comes with a quarter-life crises, and I could listen to the soundtrack all day long. Sometimes funny and sometimes heartbreaking; I’m really hoping this gem doesn't go unnoticed by year end. The film has such an appeal and deserves all the attention in the world.",
      "total_reactions": 2,
      "user": "Prodigy2013"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "This movie attempted to live completely by the quirky nature of its main character.  Unfortunately for me, she was quite unsuccessful as a person, in a career, and somewhat boring after the first two or three quirks.  I rank it as a movie that the critics give high points for an attempt to be different and uncommercial.  This movie did not ring my bell in any way.",
      "total_reactions": 2,
      "user": "keyelepro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Lovely movie, from the second half tough.",
      "total_reactions": 2,
      "user": "AlexaSanger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is witty, has great writing and a great cast  it successfully emulates Woody Allen  though misses much of Allen's irony, humor and charm.",
      "total_reactions": 2,
      "user": "windcall"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Everything was great except for the blubbering blundering francis (greta gerwig) who even though she had few funny moments in all she just kept on talking non stop a very bad influence for upcoming young adults.",
      "total_reactions": 4,
      "user": "warnert"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "Worst \"critically acclaimed\" film of the year.",
      "total_reactions": 4,
      "user": "StephBonn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Endearing and enjoyable and pleasing, one of the better of this genre (talk-y millennium   young woody allen)  which admittedly is not my favorite. Gerwig is also very strong in the role.",
      "total_reactions": 1,
      "user": "jonh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "While at first I had no idea what to expect from Frances Ha as it seems to have no semblance of a plot, a complete lack of meaning and a main character who jumps from one extreme to another. In the end though I was in awe of this unexpected little triumph. When Frances (Greta Gerwig) learns that her room mate and best friend Sophie (Mickey Sumner) is moving out she must scramble to get her life in order as everyone else seems to be getting their things together. However this proves more difficult for Frances as she is an interesting and lovable train wreck. Unlike director Noah Baumbach's previous film, the intolerably boring Greenberg, Frances Ha has a lead character who sure takes some getting used to with her indecipherable rants and her illogical sense of self, but isn't an insufferable presence who only gets more despicable. It's a film about self awareness and the ability to know your own self worth and therefore it has a wonderful yet lifelike conclusion anyone who watches will be happy with. While the first act is all over the place, its only to highlight Frances' hyperactive personality and her inability to be still and settle down. The film really comes into its own when Frances is forced to make plans because Frances in trouble is both hilarious and tragic making for a compelling watch. Gerwig is fantastic and understands the effervescent nature of Frances as if it was her. Something this film makes very easy to believe. Peppered with interesting side characters to round out Frances' surprisingly large friend circle (especially for someone as high maintenance as she is), the film is equal parts unusual comedy and sombre drama as we cling to the words coming out of this self destructive yet brilliant woman.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Frances Ha  is a hoot. It is funny and weird and short(which is a bonus). Lots of strange moments that are enjoyable to watch. It could have delved somewhat deeper, but for what it was it was good.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Frances Ha is a delightful study in character development and all the relationship struggles 20 something New Yorkers struggle with. Meaningful friendships is a common goal the individuals share with their ups and downs. Greta Gerwig shines throughout with an irresistible lightness that has her dancing sometimes aimlessly through the streets of NYC. We intently observe her trying to cope with her dance career and intimate partners and the inevitable disappointments as well as her moments of truthfulness and ecstasy.",
      "total_reactions": 3,
      "user": "VinceM"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "An easy and laid back movie, nothing complicated happends ever. No major plot twists (im not sure there's any plot). Im not sure what to write anymore, i liked the movie but i dont know why. The characters are adorable and its the perfect movie for a laid back evening.",
      "total_reactions": 2,
      "user": "Kattsylt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Noah Baumbach's latest is actually is best in years. Greta Gerwig is funny and sad sometimes at the same time  Francis a women struggling with her career and life in her late twenties. Gerwig  co-wrote the screenplay along with Bauback and is one of the best comedic screenplays in along time. I  have never been a big fan of Gerwing, but that has changed with this movie, Thanks for proving an adult comedy that is for adults",
      "total_reactions": 1,
      "user": "lismis7000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Frances is an \"apprentice\" dancer - which is hard to believe since she is very ungainly. Apart from \"dancing\" she never worked a real job in her life. Frances shares an apartment with BFF Sophie, in a sort of a \"celibate\" lesbian relationship (at least, from Frances' side).",
      "total_reactions": 2,
      "user": "dierregi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Great directing. This movie is complete. Their was No BS ending, Because their was No BS Beginning. Quite interesting Black & White Motion picture it complemented the movie. The Director of this film should direct MORE FILMS, Preferably in color to loosen up the dreamy vertigo feeling. (A good effect.)",
      "total_reactions": 3,
      "user": "itriphard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Not much to the movie but Greta Gerwig is irresistably adorable as a klutz, an apprentice dancer trying to find her way in life. She carries the whole movie on her shoulders and does a good job of keeping you entertained throughout...you can't help but fall in love with her.",
      "total_reactions": 1,
      "user": "MobyZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "My second film of the NYC indie director Noah Baumbach, after his much-acclaimed indie darkhorse THE SQUID AND THE WHALE (2005, 9/10), although his muse has shifted from Jennifer Jason Leigh to the new indie-hotshot Greta Gerwig now, who stars as the titular protagonist and is the co-writer of this film.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "To use black-and-white photography in film today is a gutsy move. Fortunately for Noah Baumbach it paid off--the lack of color allows focus on the character study at hand.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "This movie has such beauty and bitter, outstanding acting and flow. Its a relief to still find movies that portrait humans and real life dramas. Watch it! If you like it, be sure to check some Nouvelle Vague classics too.",
      "total_reactions": 0,
      "user": "VonSeux"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Frances Ha is a charming little comedy-drama from director Noah Baumbach that certainly is easy to identify with given the struggles of the main character. Though she is certainly flawed, she has a feeling of being entirely real and authentic. Great Gerwig is fantastic, as is the rest of the cast, but Gerwig soaks up the screen and kills it the entire time. Truly plotless, Franches Ha could certainly be seen as being a touch pretentious by some, but I enjoyed it very much. It never drags and always engages you and makes you feel invested in the life of this girl who is in a bit of a rough patch of her life. However, as I said, it could certainly be called pretentious and you would have a leg to stand on. Making her attend Vassar College does not help this cause. However, on the whole, Frances Ha is a cute little film that really sweeps you in and charms you the entire time. This is the first film I have seen from Baumbach and it certainly underscores that I need to watch more.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Certainly not a masterpiece, not even in its particularly niche subsubgenre, but I thought it was better than more than half the crap they released in the last two years. The black and white doesn't really fulfill the purpose and there's reason to believe it was chosen for budget rather than artistic value; anyway it's not annoying and Greta Gerwig's bulky, awkward character feels real notwithstanding the small plot holes (the mystery of how she can pay anything at all is left unveiled). Actually, I didn't find any of the characters to be very likeable, but I assume that's another take on recreating reality.",
      "total_reactions": 0,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "A terrific Indy film that shows the life of a woman in her mid 20's that lives a life going from place to place while trying to find her way in New York as a dancer. A-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Chronically a period of apartment instability of its title character FRANCES HA  her late 20s begin  relationships tail spin, Golden Globe nominee GRETA GERWIG is a sight to behold  you can barely take your eyes off her  will it be with Gravity & Blue Jasmine on the Oscar Best Actress list?  SEE NOW on NETFLICKS...  live streaming...",
      "total_reactions": 0,
      "user": "johnny_cubert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "The awkwardness of the characters, especially Frances, and the things they do is painful to watch.  But it is in these poignant moments that Noah Baumbach's ability to give his characters life.  He reveals the humanness of the characters replete with flaws and gaffes and missteps.  A beautiful film.",
      "total_reactions": 0,
      "user": "himeeg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "How have so many people enjoyed this movie? I thought it was poorly acted, predictable, then unbelievable all at once. I had no empathy whatsoever for Frances, who was annoying, if not depressing, to watch. There's no story here, really. So she ends up as a choreographer for a pretty embarrassingly bad dance scene at the end of the movie? Who cares? I wanted her to give up on her dream 20 minutes into the movie. What's the message here: we should all get sentimental over mediocrity? There were no depth to the characters, either. So surprised this came from Noah Baumbach!",
      "total_reactions": 0,
      "user": "ktschreib"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "Drama. Black & white. A ditsy dancer's flat-mate moves out and she has to struggle to rebuild her life. Failed to get into it and gave up after 20 mins.",
      "total_reactions": 0,
      "user": "shiftworker"
    }
  ],
  "metascore": 82,
  "name": "Frances Ha",
  "num_weekends": 16,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 5,
    "year": 2013
  },
  "opening_weekend_income": 137398,
  "opening_weekend_income_currency": "$",
  "rating": 7.4,
  "rating_count": 46954,
  "rating_freq": {
    "1": 480,
    "10": 3931,
    "2": 312,
    "3": 480,
    "4": 908,
    "5": 2057,
    "6": 5364,
    "7": 12420,
    "8": 14216,
    "9": 6786
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 142,
  "votes_per_demo": {
    "aged_18-29": 18605,
    "aged_30-44": 16557,
    "aged_45+": 4033,
    "aged_under_18": 88,
    "females": 12412,
    "females_aged_18-29": 6824,
    "females_aged_30-44": 4158,
    "females_aged_45+": 821,
    "females_under_18": 29,
    "imdb_staff": 14,
    "imdb_users": 46954,
    "males": 27794,
    "males_aged_18-29": 11519,
    "males_aged_30-44": 12117,
    "males_aged_45+": 3133,
    "males_under_18": 56,
    "non-us_users": 24937,
    "top_1000_voters": 322,
    "us_users": 8346
  },
  "year": 2012
}