{
  "avg_rating_per_demo": {
    "aged_18-29": 4.4,
    "aged_30-44": 4.2,
    "aged_45+": 4.5,
    "aged_under_18": 4.4,
    "females": 4.6,
    "females_aged_18-29": 4.7,
    "females_aged_30-44": 4.5,
    "females_aged_45+": 4.8,
    "females_under_18": 4.8,
    "imdb_staff": 4.7,
    "imdb_users": 4.3,
    "males": 4.3,
    "males_aged_18-29": 4.4,
    "males_aged_30-44": 4.2,
    "males_aged_45+": 4.5,
    "males_under_18": 4.4,
    "non-us_users": 4.3,
    "top_1000_voters": 4.2,
    "us_users": 4.3
  },
  "avg_screens": 1187.6363636363637,
  "budget": 57000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 5,
    "year": 2012
  },
  "critic_review_count": 287,
  "duration": 96,
  "genres": [
    "action",
    "fantasy",
    "thriller"
  ],
  "gross_income": 51774002,
  "max_screens": 3174,
  "mc_avg_user_score": 4.3,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 79,
  "mc_movie_name": "Ghost Rider: Spirit of Vengeance",
  "mc_negative_rating_frequency": 145,
  "mc_positive_rating_frequency": 80,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2017
      },
      "score": 63,
      "summary": "A goofy, gonzo thrill ride, “Vengeance” is a bad movie sequel so bad it’s good, a bad movie that’s almost a great bad movie."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "This doesn't lack for crazy charm, particularly when Nicolas Cage (in his go-for-broke Bad Lieutenant mode) and Ciaran Hinds (playing the devil) try to out-weird each other with broad, even cartoonish performances."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "The film, though, has some redeeming qualities, including the presence of Idris Elba as the obligatory good guy, who encourages Johnny to get Danny into the protective custody of a religious order."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Ghost Rider: Spirit of Vengeance offers Cage plenty of opportunities to tap his inner circus geek, to twitch, cackle and flail without shame, going full tilt batwing crazy. Not since he danced in a pagan bear suit in The Wicker Man has Cage appeared this unconcerned about what the audience will think."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "The smugness of the film grows wearying long before the end. Just because the people on and behind the camera are willing to acknowledge what we're watching is ridiculous crap doesn't really change the fact that, well, it is."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Spirit of Vengeance is so focused and, as a result, so impoverished that you actually feel bad for Cage. The actor tries to bring the weird (though at this point one wonders if he can even do anything else) but the film more often than not leaves him high and dry, saddling him with standard-issue action hero lines and boilerplate action set-pieces."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Cage-ophiles will find some delectable freakouts in Blaze's transformation - or near transformation - scenes. Otherwise, the committee-penned script combines yokel-friendly haw-haw irreverence (non-sequitur cutaways to the Rider pissing in a flamethrower pattern) and sweaty monologues about \"controlling the Rider\" (the character is basically a mean drunk's superhero)."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "So it's a half-certainty, half-shock that Ghost Rider: Spirit of Vengeance is both good and bad, a sequel that's hungry for thrills but bereft of the cohesiveness - and budget - to be a full meal."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "The picture is still much too rickety, slapdash and surprisingly dull to qualify as a good barrel-bottom pleasure."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "With his (Cage) over-the-top delivery and operatically intense facial expressions, there's no way anyone could accuse him of phoning this one in."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Alas, unlike the duo's Crank films - also about a hero on the verge of explosion - Spirit of Vengeance lacks a solid gimmick to unify their transgressive gambits."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "The first \"Ghost Rider\" film, directed by Mark Steven Johnson, was sort of a fizzy goof, the kind of movie where you don't expect much and then think, \"Hey, that was actually kind of fun.\" Spirit of Vengeance, though, is undone by increased expectations, as promising more only makes it feel they are somehow delivering less."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "A water-treading sequel offering just enough kooky color to keep less-discerning funnybook fans occupied, Ghost Rider: Spirit of Vengeance nudges its obscure hero's mythology forward a bit without seeming to care much how it gets there."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Like \"Ghost Rider: Low Voltage,\" this is a surprisingly underpowered excursion into Marvel's mad world by Neveldine and Taylor. More purgatory than hellfire."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 33,
      "summary": "The charismatic Idris Elba debuts in a key role as an alcoholic priest who recruits Cage's unique services. Yet instead of elevating the franchise, Ghost Rider: Spirit Of Vengeance ends up squandering even more potential."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 33,
      "summary": "Most of the movie's action-horror set pieces play like lame Gwar music video outtakes, and Cage's signature mix of irony and off-the-rails mugging only works when you can see the actor's face. In Ghost Rider form, his character is just a skeletal automaton with neither a tongue nor a cheek to put it in."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "This time out, the action is in 3-D, which amounts to a few shots of flaming motorcycle parts comin' at ya, but little else."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "For acting to be this bad in movie not directed by Michael Bay or George Lucas, it has to be intentional."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "The only part of this movie anyone's ever going to remember is the pair of scenes in which Ghost Rider pees flame."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 12,
      "summary": "To question where things went wrong feels somehow strange, as the project seems to have been ill-conceived from the very start."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "summary": "One look at the dreadful mess that is Ghost Rider: Spirit of Vengeance will turn your whisper into a primal Cage scream: MAKE THIS MOVIE STOP!"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "This movie was a serious disappointment.  While most of the action with the rider were pretty good, this film had a lot of \"WTF was the director smoking when he made this?\"  Several places there was either horrible overacting or underacting.  No of the characters are really likable, none of them have any depth and none of them are particularly memorable.  The plot was decent enough but it was horribly told.  This is not the same Johnny Blaze or Ghost Rider of the first film.  Johnny Blaze is extremely shallow and Ghost Rider is overpowered.  Enjoy the couple of laughs and the few truly good sequences with the rider in them and forget the rest.",
      "total_reactions": 1,
      "user": "drachehexe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Why are people giving this film a decent grade? The plot sucked, the acting sucked, the fights were terrible. The only decent thing about this film was the graphics. Ghost Rider has died to me thanks the recent films. The comics will never be the same to me again. And was it good for a movie for non-fans? Nope. It was pure crap. Only thing keeping me in the theater was half disbelief, a quarter because I had anticipated it for a long time (idiotically), and a quarter because of pride, afraid to show my wife my insecurities with a bad choice I made in film selection for a date... :P",
      "total_reactions": 1,
      "user": "Dufflad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "I walked in expecting a lot. Seeing the trailer expected. The story is ok. The characters in this part are not so into the act. It is just an average movie.",
      "total_reactions": 1,
      "user": "zmist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "This movie it's like... meh. The first one had many flaws but was still enjoyable, this is just stupid:",
      "total_reactions": 1,
      "user": "blacksand33"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Constrangedor, pior que seu antecessor da pena assistir esse desastre",
      "total_reactions": 1,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "\"Ghost Rider: Spirit of Vengeance\" 10 Scale Rating: 1.0 (Horrible) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The Rider gonna come out. And when he does, he will destroy whoever has got it coming. Yeahh, you rite! It destroys everything in its path! From now on, whenever you hear the words GHOST RIDER, the first thing that comes to your mind it will be a veryy baddd movie! They definitely do not have enough good basic material to build a reasonable movie in the first place, thiz is for the second time! The first GHOST RIDER in 2007 was one of the ugliest superhero movies ever made. Anyway, I have my respect for the Directors Mark Neveldine and Brian Taylor. Generally, I like their works especially the stylish camera angle and color structure. A little bit rough, energetic and sometimes comical, with fast moving scenes exactly like they had shown in CRANK (2006) and GAMER (2009). But that is certainly not enough. Thiz time, Johnny Blaze (Nicolas Cage), the alter-ego of Ghost Rider has to protect a child from the devil in human form upon the demand of a monk named Moreau (Idris Elba). The storyline is obviously weak in all aspects. They tell a simple story in long and boring 90+ minutes. Furthermore, the setting is told in Europe. Hello... where is the Europe? I do not see Europe! All I see is desert and rocky mountains in the middle of nowhere. After all, the Ghost Rider character is originally dark and mysterious. That atmosphere is clearly not shown here. They are using too much sick humor and too much clear blue sky, if you know what I mean. It crossed my mind, it could be totally different if they hire the Director who knows how to make a convincing shade of dark gothic like Tim Burton or Guillermo del Toro. The next thing is Nicolas Cage. I do not know what really happened to Cage, he is obviously trying to look cool with his cheesy one-liner dialogue. Moreover, in some scenes when Blaze struggled to hold back the devil inside him to come out, he creates a very strange and amusing expression. The rest of the Casts delivering B-Class performance such as: Idris Elba, Violante Placido, Johnny Whitworth, Christopher Lambert, even the child Fergus Riordan. the Devil once said to Johnny Blaze, You were the worst fricking deal I ever made. well, I have my complaint too, I just want my money back!",
      "total_reactions": 9,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Ladies and gentlemen, how could you possibly prefer the first ghost rider movie? it had NOTHING to do with the comics, it just tried to stitch elements from TWO DIFFERENT STORY ARCS onto a mediocre western story which also has nothing to do with the comics, the first film just falls apart the moment it tries to move forward, spirit of vengeance, however, actually gets it right, neveldine/taylor mostly focus on ONLY ONE STORY ARC, that of johnny blaze, and the new appearance is ACTUALLY CREEPY, the VFX are phenomenal, and the rider's bike is ACTUALLY THE BIKE HE HAS IN THE COMICS, not some cheesy... THING they gave us in the first film, not to mention they actually get the villain's appearance right this time, seriously, look it up, blackout actually looks like he does in the comics, i grew up on these comics, so did my brother, and this film has finally restored my faith that we, the devoted fans, can still be given the adaption that we deserve, and the sad thing is that most people on here overlook this...",
      "total_reactions": 14,
      "user": "mickelwick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "This movie was \"ok\", it had some scenes that were alright, but most of the movie was quite boring. I definitely would not go see a third one. Fool me once...",
      "total_reactions": 6,
      "user": "jchamb2010"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "HAHAHAHA WHAT THE F*CK. HOW DID THIS B-MOVIE END UP IN THE THEATERS? DID THE DIRECTOR FORGET TO SEND IT INTO THE DIRECT-TO-DVD PILE?! NEVER ON THIS PLANET SHOULD A FILM PACKED WITH **** QUALITY AND GREEDY ACTORS LIKE THIS BE MADE!!!!",
      "total_reactions": 16,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Honestly, the only thing I liked about this movie were the scenes where Ghost Rider actually came out in. Notice the key word, actually, since he didn't even make that many appearances in it. When he didn't come out, I was falling asleep in the theater, just waiting for Ghost Rider to come out to wake me back up. Im not one of the people who disliked the first film, I liked it, but I didn't like this one. The ending, I dont even consider it a spoiler since its so predictable, hell, even the final battle was boring as hell. This is the epic ending (I don't consider it spoilers since its this simple but if you think it does, don't read beyond this:    \"Did we do it?\" \"Hell Yes\". Ghost Rider rides. The end.",
      "total_reactions": 15,
      "user": "Inuyazeiah"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "There is no reason this movie should exist, no one asked for it and people want it to go away, you can very well tell Nickolas Cage is in it for the money, which is a shame.",
      "total_reactions": 15,
      "user": "julianreynaa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "First, the good things.  GRSOV is better than its predecessor.  This wasn't a sequel, it was a reboot.  And with David Goyer writing, it was expected to be better.  Graphically, GR looked much better.  He was much more of a character in this film.  Nic Cage's Johnny Blaze was much better. I loved that they skimmed over the origin.  It was very well done.  The action sequences were also top notch.  However, the bad is a mix of what is bad about film-making in general and the unmet expectations of comic book lovers for Marvel Knight characters in general.  Ghost Rider is a pseudo interesting character to begin with.  In theory, he should make a bad-ass film protagonist.  In reality, he's great in action and graphically, but even Goyer's writing skills can't make him that interesting. Like the abysmal attempts at getting a good Punisher on film, the reality is, the Marvel Knights characters will never make interesting films as long as the focus is on the violent part of their characters rather than what makes them dark in the first place.  So, in the long line of poor attempts, GRSOV ranks higher than Punisher: War Zone, Dolph Lundgren's Punisher and the original GR, but that's about it. I truly hope there isn't a third.",
      "total_reactions": 6,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Ghost Rider 2 is crap... What, you want more? Okay, let's see the good things first. It's not many so it wonâ",
      "total_reactions": 3,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "I honestly don't even know where to begin. After the brief snippet of footage that was screened at Comic Con 2011, I had a tremendous amount of faith in GHOST RIDER: SPIRIT OF VENGEANCE. I'm a huge fan of the work that Mark Neveldine and Brian Taylor did with the CRANK films, and I thought their unorthodox style would benefit the GHOST RIDER franchise and result in a sequel that far surpassed its predecessor. Yeah, not so much. This film is a colossal disaster from start to finish, featuring a script that seems unfinished, characters that are barely established, and one of the absolute worst performances in Nicolas Cage's career. After a stylish animation sequence that establishes the character's origin, we find Johnny Blaze living in the Balkans for reasons that are never quite explained (this will become a recurring theme for nearly every major plot point in the film). An alcoholic priest named Moreau (Idris Elba with an inconsistent French accent) shows up on his doorstep and offers to lift the Ghost Rider curse in exchange for Blaze rescuing a young boy named Danny (Fergus Riordan) from the same demonic entity that purchased Blaze's soul, an entity that is now called Roarke rather than Mephistopheles and is now played by Ciarin Hinds rather than Peter Fonda. Blaze jumps on his bike and takes off, showing up just as our incredibly boring and non-threatening bad guy Carrigan (Johnny Whitworth) catches up with Danny and his Gypsy mother (Violante Placido). The Ghost Rider emerges and begins to lay waste to Carrigan's henchmen, turning them into piles of ash and terrifying the bejesus out of everyone - except Carrigan, who takes him out with a grenade launcher and disappears with the kid. The rest of the film is essentially one drawn-out chase sequence, punctuated by conveniently placed dialogue scenes where our characters try (and fail) to explain exactly what the hell is going on, amounting to nothing more than speed bumps on the road to Blaze's next transformation into his flaming skeletal alter-ego. To level the playing field, Roarke grants Carrigan some demonic powers of his own, leaving him with pale skin, a bad hair-metal wig, and the EXACT SAME ABILITIES as the first film's (far more interesting) villain, resulting in confrontations that feel boring, recycle, and unimaginative - because they are. Cage's manic, frenzied portrayal of Blaze feels nothing like the character he created in the first film, resulting in plenty of absurd, laughable moments as he shifts the insanity into overdrive, particularly in an interrogation scene where the Ghost Rider is \"scraping at the DOOOOOOOR\"and Blaze is trying desperately to hold him back. This performance is certainly the highlight of the film - unfortunately, it's for all the wrong reasons. While the new design of the Ghost Rider looks fantastic, featuring a charred skull and a leather jacket that bubbles and melts from the heat, the character feels like something from a cartoon, head tilted quizzically to one side as he contemplates his victims or giggling to himself as he turns a piece of construction equipment into a flaming instrument of death. Oh, and he pisses fire, of course. I'll give Neveldine and Taylor all the credit in the world for the adventurous and innovative method of filmmaking they developed on the CRANK films, but this style doesn't work here. GHOST RIDER: SPIRIT OF VENGEANCE is poorly written, poorly edited, and poorly acted, and accomplishes nothing except to showcase that Neveldine and Taylor obviously have no idea what makes the character work. Make no mistake, this is the BATMAN AND ROBIN of the GHOST RIDER franchise, and everyone involved in this mess should be ashamed of themselves. www.nerdrep.com",
      "total_reactions": 8,
      "user": "brent_hankins"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "So. Just made an account to review this movie blah blah..I KNOW IM SO ORIGINAL. But this movie is so terrible that I have to warn you people. From the lackluster action sequences where all Ghost Rider has to do to defeat his foes is swing his chains to Nicholas Cage's simply loony acting this movie truly offers nothing to us. I am a huge superhero movie fan and slightly enjoyed Ghost Rider 1. DONT EXPECT THEM TO MENTION ANYTHING ABOUT THE PREVIOUS MOVIE. Except for the fact it's Nicholas Cage, there is no connection. THis movie's story is a consistent set of plotholes so gaping and awkward that the extreme nerd on you is going to cry blood.  Nothing after the credits. The visuals in this movie would be GREAT for a grad student's portfolio reel but the times they selected to use the over-the-top imagery are ill-fitting. Maybe it's because ghost-rider himself is a crappy hero to have a movie about but if this movie was a kitten I would not pet it.",
      "total_reactions": 13,
      "user": "JakMcKratos619"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "Where to begin.  With the horrible script?  The complete lack of connection with the comics?  The nauseating cinematography?  Unfortunately Ghost Rider Spirit of Vengeance fails on so many levels that it's hard to even call it a movie.   For example the very compelling \"look into my eyes\" from the first movie... totally missing from this one.  Instead we have the ghost rider, well, opening his mouth and moaning a lot... yeah seriously that's his thing.   The fight scenes and the \"actors\" lurch around like they were making dawn of the dead.  Hey Columbia, ever heard of choreography?",
      "total_reactions": 5,
      "user": "santiagodraco"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "There are several reasons why I think this film failed spectacularly. I don't think that a soft reboot should ever include the main actor from the film that is being rebooted. It creates inconsistencies in the minds of the viewer that wouldn't be there if the actor had been replaced.",
      "total_reactions": 5,
      "user": "verbose"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "what the hell did i just watch? this has to be the worst movie i have ever seen. its has the acting of a low budget porno and the action of a toke flick. i'm embarrassed wasting money to watch this film, i would rather have a nail stuck up my nose then watch this trash ever again.",
      "total_reactions": 5,
      "user": "Duskk8"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "I really don't know what to say exept don't go watch this movie unless your a brainless,  low IQ, action junky because this movie is laughable at best, the stupid gags and extremely mediocre fightig scenes, and a movie which drags itself to it's own long awaited ending. And reallY I've seen better camera work in my Video Production class than in this movie, this movie is an I'll conceived failed abortion, don't give these guys their money, DON'T GO WATCH IT!",
      "total_reactions": 5,
      "user": "GCMANINDAHOOD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "had high hopes from this one but part2 lets it down. part 1 was much better. Stroy misses the grip which part 1 had. The vfx are good (typical ghost rider style) but screenplay disappoints all.",
      "total_reactions": 5,
      "user": "seannn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "A really terrible, horrible, film, the first part be great, but this second, wow EPIC FAIL, the cast is terrible, what is the reason for Violante Placido and CiarÃ¡n Hinds work in this awful film?.",
      "total_reactions": 5,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "I don't know whether to laugh or cry watching Ghost Rider. Camera work is so sloppy, handheld camera movies are more steady than this. Dialogue is equally laughable, the forced humor makes me wanna cry, character development is an afterthought, the plot is so amazingly predictable. Remember the names Mark Neveldine and Brian Taylor, make a note to never watch any of their movies in the future. The only good scene was where we got a glimpse of the crazy Nic Cage that I love in an interrogation scene. Skip this drivel and go watch Chronicle.",
      "total_reactions": 12,
      "user": "MRedzuan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "This movie blows. Not much more that needs to be said. The acting was horrible and you could tell it was made by different people. Nothing matched the first one.",
      "total_reactions": 7,
      "user": "JTD"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "This movie has OK special effects, bad dialogue, bad acting, and a bad storyline. Spirit of Vengeance fails!",
      "total_reactions": 11,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "A severely misguided film with a terrible plot, terrible dialogue, flat characters, no development, and I'm all just a loud and mediocre mess that will literally bore you to death. Nicolas Cage's performance has never been worse. This movie was 50x as bad as the first which I believe was an ok film, but I honestly think the purpose of this movie was to make a quick buck.",
      "total_reactions": 6,
      "user": "EPIXMAN15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Terrible, DO NOT WATCH.",
      "total_reactions": 4,
      "user": "kris2fur"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "Le pari Ã©tait-il vraiment de faire oublier le premier? De le valoriser plutÃ´t! Parce que lÃ , descendre bien plus bas Ã©tait impensable, surtout avec un scÃ©nariste potable et des cinÃ©astes dÃ©gÃ©nÃ©rÃ©s. Malheureusement, le problÃ¨me provient plus de la rÃ©alisation qu'autre chose (bon, il y a quand mÃªme un scÃ©nario lamentable et des acteurs nullissimes). Et pour cause, les frangins responsables d'Hypertension nous livre un trip insuivable! Avec une mise en scÃ¨ne (plans, montage...) abaissant le film au niveau d'un tÃ©lÃ©film de sÃ©rie Z, le Ghost Rider n'est pas prÃªt d'entrer dans le coeur des fans de Marvel. Franchement, avec un travail soignÃ©, cette suite aurait pu Ãªtre l'Ã©gal d'un Blade ou mÃªme monter au niveau d'un Hellboy. A croire que les rÃ©alisateurs se sont enflammÃ©s Ã  vouloir Ã  tout prix travailler avec Cage sans pour autant amuser le spectateur... Croyez-moi, en moins de 1h40, le premier film est devenu un chef-d'oeuvre!",
      "total_reactions": 4,
      "user": "avatar16"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "Bloody piece of ****",
      "total_reactions": 4,
      "user": "XBOXWRM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "This movie has absolutely nothing to do with the actual comics, its an insult to the Ghost Rider story, sigh* this movie made sure The Ghost Rider franchise, is dead forever. How do we as comic book fans expect to see our favorite superheroes in a live action film, if movies like this, make sure that never happens.  Part 1 is 10x better than this, and it wasnt the best movie either.",
      "total_reactions": 2,
      "user": "cell989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "only one word can describe this film : ANOTHER CRAP !!!",
      "total_reactions": 2,
      "user": "optimus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "This whole movie is just a gimmick. Not even the 3D was good, now i don't have very sensitive eyes but when there was a contrast to darker colors to more colorful ones the edge of my eyes started to hurt. The movie itself was really bad too, a now typical movie for Nicholas Cage. What made it worst was that there were scenes that the writers tried to make funny but obviously failed. Hey at least this is better then Jack a Jill",
      "total_reactions": 2,
      "user": "McCully243"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Epic",
      "total_reactions": 2,
      "user": "emilypyre"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "There simply is no excuse as to how a film involving a fiery skeleton perched atop a zooming motorcycle, infalliably flagellating its victims at will with a diabolic chain could possibly be stodgy: enter \"Ghost Rider: Spirit of Vengeance.\" It's easier than one would think. However, it does enlighten: at last affirming Cage's increasingly outright indifference to acting, as well as the audience's mental and emotion hygiene; he simply doesn't care. Instead, we the viewer, are constrained to a seat in our very own self-inflicted hell, with what might end up being the longest 95 minutes without a single firing of a cerebral neuron; just a catatonic blah of lifelessness. How, so? \"I'll make it quick\" (something that should have been said in compensation for witnessing the utter agony). What we have here is a poorly written, excessively-stylized and unevenly produced CGI action-flick that resorts to its overdone flash, in an attempt to mask what can't be hidden: plot-hole-ridden filth of production value. The camerawork longs for your attention, but all the more does its hammy display of predictable and lily-livered characters fit the bill for targets of camp delight and mockery in years to come. Moreover, \"Ghost Rider: Spirit of Vengeance\" is a \"depressingly\" satisfying cult-classic-to-be that is far too fun to mock than to hate, and you won't be alone; Cage will be laughing with you all the way through, albeit inside. He knows he is starring in a C-movie, and he's damn proud of it too. Thumbs up to the money-raking, \"joke's on you,\" Nic Cage; he's done it again...",
      "total_reactions": 7,
      "user": "FDT44"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Ghost Rider: Spirit of Vengeance is crazy. One of the most visually interesting movies I've ever seen. I liked it. 10/10",
      "total_reactions": 26,
      "user": "momomesh-ch"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "This is so bad that its not even funny. Lame, poor script and dialogue, flawed logic, terrible acting from the cast, bad CCIs, super cliche. I dont even think there's anything positive from this film. hopefully they are not planning a trilogy.",
      "total_reactions": 7,
      "user": "Boozerx7"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "The first Ghost Rider was just okay, with awkward CGI, but it got the 'feel' right (to a certain extent). Spirit of Vengeance has better CGI, and that's the only thing I could think of about this sequel. It's always ironic that Nic Cage is a self confessed Ghost Rider fan, when he single handedly makes Ghost Rider less scarier than a chihuahua in a tutu. Pointless story, characters that I could care less, and the lamest version of the 'Devil' ever. Sh*t, Ray Wise makes for a much cooler Devil. And does Nic Cage has his own deal with the devil? To overact in every movie? Avoid and catch it on cable.",
      "total_reactions": 7,
      "user": "Shahalim"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is awsome.I saw it in the theaters and it was awsome.When I first saw it.it was Action paked.What I also like about this movie is its motion picture it's really well recorded.Other people dislike it but it doesn't make sense why they dislike it If itsmore Action then the word action",
      "total_reactions": 4,
      "user": "Awsome1"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "All those who gave below 5 rating are fools because this is a pure  desi kick-ass action and guys who is the hero our own GHOST RIDER. This film includes much more action the before so if you like ghost rider don't miss this one. Because action doesn't needs a story action creates story. So all the evil baddy living things hide away if you can otherwise fear is coming which will burn you into ashes (Fear is the vengeance of GHOST RIDER). \"Look into my eyes\".",
      "total_reactions": 15,
      "user": "ROCKBOND"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Much better than the first! I'm a huge fan of the character and an even bigger hater of the first Ghost Rider film. If you liked the first film then this one isn't for you. It's darker in tone and more visceral with the action. They take the character in a direction he should have gone from the beginning. It is a great action flick with plenty of eye candy special effects. With that being said it does have its flaws, it's just hard to do a movie with a guy that has a flaming head and not make it a little cheesy...It has some things that you will just find totally stupid, but that's OK because it has even more things that you will fine engaging and entertaining. Bottom line is Ghost Rider Spirit of Vengeance is a fun comic movie with Cage at his craziest that is sure to entertain you for 2 hours...Just don't go in looking for it to be The Godfather of comic book movies.",
      "total_reactions": 5,
      "user": "batlantern_87"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The Ghost Rider is one of my favorite heroes. Now not being biased I gave this movie a 9/10 because it had comedy, action, and a ok story line. I think this one is for the parents, not for the kids.",
      "total_reactions": 5,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This movie deserves a solid ten.  This is exactly what a Ghost Rider movie ought to be, dark, gritty and (no pun in tended) bare bones.  the acting was solid the story was engaging, the special effects and stunts were phenomenal.   Nicholas Cage is perfect as the formerly **** now alternately somber and manic Johnny Blaze.",
      "total_reactions": 6,
      "user": "MrDadelus"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is completely filled with awesome action adventure full off smashing action and the super cool but too hot hero the ghost rider and his stunning bike are the charm of the movie. Go for it!",
      "total_reactions": 8,
      "user": "NEEBOND"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I don't know what's the fuss about this film being bad. Sure, it's not perfect but it is crazy. Some scenes are really uber crazy. If you fancy Marvel Comics then you will love this movie. I give it 10/10 because I really adore movies that you can just lay back and enjoy the effects and visual part of the movie. Sure it doesn't send you any deep message but it does relax you (for me relax is enjoy). Hope this helps",
      "total_reactions": 2,
      "user": "Falling_Hammer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "I simply cannot phathium whow anyun can rute nicolacks cuge any luss then tun outta tun. DUNDUNDUNDUNDUNDUNDUNDUNDUNDUNDEUNDUNDUNDUNDUNDUNDUN.",
      "total_reactions": 2,
      "user": "Ben_Otter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This film is one reason why Nic Cage should be banished from Hollywood.  No offense, he was good in Face Off and just OK in the National Treasure films, but this film is utter garbage.  The first scene of the film was mediocre with Idris Elba battling some bad guys with some average effects.  The movie turns to crap the moment the Johnny Blaze enters the film.  From lame jokes to dumb facial expressions, Nick Cage gets the whole thing wrong.  I think that he just killed the Ghost Rider Franchise.  So sad that I wasted over 10 bucks to see this garbage.  If you thought the original was bad (which it was), then prepared to hit with something even worse.  Or should I say pissed on! (Yes, you must endure Nic Cage pissing fire.  LAME!)",
      "total_reactions": 1,
      "user": "horacep3000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "The first instalment of Ghost Rider was amazing. I really enjoyed that movie but the second instalment was just mediocre and I found myself getting bored half way through.",
      "total_reactions": 1,
      "user": "lucidanarchy"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Cool film, like it. 7/10",
      "total_reactions": 7,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "A lot of people think they know film. Or think films of great stature should be a certain way. Well they are wrong. This is one of the finest works of filmaking since Citizen Kane. I was entertained, thrilled and felt for the characters in a deep and suprising way. Not to mention the stunts and filmography of this film rank beyond most films of a similar nature. I look forward to seeing what both Nic Cage and the fine directors of this film and the equally splendid Crank have up their sleaves next. Bravo!",
      "total_reactions": 5,
      "user": "pistolthor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Neveldine/Taylor kick ass with this movie, i love crank, crank 2, even jonah hex, they have a crazy directional style that benifits anything they do.",
      "total_reactions": 1,
      "user": "oswaldferrera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "A few random thoughts about Ghost Rider: Spirit of Vengeance... A single viewing makes it obvious why Marvel Enterprises would move forward with the sequel to a feature whose box office performance was underwhelming. By making this film, they are reminding us what a bad comic book movie is really like, thereby elevating the relative quality of their recent stretch of mediocre efforts and lowering the bar for Marvel's big summer twosome: The Avengers and The Amazing Spider-Man. Also, I know Nic Cage is in financial distress and has to film pretty much every screenplay with which he is presented, but doesn't the law of averages demand that somewhere along the way, if only by accident, he would stumble upon a good movie?",
      "total_reactions": 1,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "I've seen worse, but even so... Ghost Rider Spirit of Vengeance was kind of.... lame.  I really can't describe it any other way.  It's nothing like the first movie.",
      "total_reactions": 0,
      "user": "DME"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Oh how I waited for this one how really bad it was. I'm a big fan of GR but this movie wasted all the potential. Pretty much everything except the CGI special effects was amateurish. The first one, while kinda childish was actually a lot better when compared to this.",
      "total_reactions": 0,
      "user": "webbiker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Big fan of the first Ghost Rider movie, so I was really looking forward to this one. The trailers made it look like an awesome, crazy, and over the top action movie with some hilarious moments, however the movie failed to deliver that. It seems to me like the people behind this movie couldn't decide what they wanted to do with this movie. It couldn't decide whether to be some super serious movie, or the zany over the top, humorous movie the trailers showed. When it's trying to be serious it ends up being super boring, and when it's trying to be over the top it's like the director didn't know how to make it happen so it falls flat, and because of this the action scenes are really boring. It's got some funny moments, some intentional most not, but that's mostly do Nicolas Cage's performance, although I think most of my laughs were at his poor performance rather than genuine humor in the script. Actually just about every performance in this was poor. There are so many things wrong with this movie that I couldn't fit them all into this review, but by far the worst flaw this movie has it that at times you can see hints of a great movie in there. You'll only see them for a second, but their there and that's what makes it so sad. Even sadder is that most of the movies hints of greatness are also in the trailer.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Ow What a pain ! They said everything in the movie was in fire , it was and so was my head ! I just cannot believe David S. Goyer the writer of The Dark Knight wrote this piece of **** !  Every thing in this movie sucks. Nick is my favorite actor . He still is but this was his worst movie. Idris Elba , CiarÃ¡n Hinds , Violante Placido all sucked and Christopher Lambert was the worst of all . Only Johnny Whitworth was a bit good . Every dialogues of this movie was dumb and ***** (cant ,just cant) . Neveldine/Taylor's direction were.....well i don't know what to say, even that little boy from the movie could be a better job ! effects were not good like the first film and the camera work was so disturbing .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "All I can say is that this is a horrible movie that made me appreciate the first film even more. I didnt read Ghost Rider too often, but I knew Blaze's origins and I knew they at least tried to get it as close as possible at the front of the first film. Of course, the first film had its issues, but they are small compared to the garbage that this brings to the table. This film is called Ghost Rider... but he is only in for about Fifteen minutes. Unlike the first film, the action scenes are slow, and have no tension to them once you see the Rider just standing there with a bad guy who he's grabbed by the collar for over a minute and a half while said bad guy's mates are standing there doing nothing but looking dumb. Another mistake I noticed was that not only did they make Ghost Rider get hurt by explosives, but they make him immune to them less than twenty minutes later in the best action scene in the film which is far too short to be satisfying. The pace of this film by the way is simply unbearable. The story is garbage, and the plot takes too long to go somewhere. We are stuck in a church for what feels like an eternity explaining origins of the Ghost Rider and how to rid one of the curse (which I wont spoil, so true fans can simply rent the film). The effects are a mixed bag. Some of the time they look cool, but at other times they just dont look right at all. And there are some things I dont like that they were unable to do due to the STUPID budget constraints put on the film (you cant make this with fifty mil, its that simple). Things like Blazes bike not transforming when he becomes the rider anymore, or how when he takes over other mechanical objects like a truck, the only thing that changes is that they light on fire. Whatever, in the end the movie just feels really unfinished, and I know the minds behind Crank 1 and 2 are capable of much better things. The best part for me was in the middle of the film when Ghost Rider just lays destruction upon everything he sees with a giant piece of construction equippment. I at least got that out of it.",
      "total_reactions": 0,
      "user": "Gtafan421"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "I am not sure how to react with this film, all I can say is though looking cool in some parts, it is very cheap and poorly filmed...and no viewer will understand what in the world is going on. This sequel is basically just Nicholas Cage flipping out and delivering horrible dialogue; but usually Nicholas Cage flipping out is entertaining, but now it is just downright weird. Ghost Rider: Spirit of Vengeance is a cheap sequel that is confusing and trashy and too strange to be fun or enjoyable...oh, and it is also a bad movie.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "One of the worst films in this segment, do not waste your time watching. The story is confusing and stupid and the acting is extremely poor, is one of those types of sequence made ​​just to get more money.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "It is mild fun. The first 15 minutes start off slow but as it progresses the action and story really begin to pick up. Its mostly different from the original but its worth watching as a rental.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "The film is a mix of stupidity, incompetence and worst acting. Nicolas Cage performance is horrible. Ghost Rider: Spirit of Vengeance is a b******t of the worst kind.",
      "total_reactions": 0,
      "user": "rydermusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "To be honest, I wasn't expecting much more than badly directed action sequences that makes a mockery of the character of Ghost Rider. In that sense, Spirit of Vengeance delivered.",
      "total_reactions": 0,
      "user": "TheDarkSoul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "I actually enjoyed the first film. Yes it was flawed and not that great, but it's an okay film to watch on a lazy afternoon when nothing else is on. So I went into this film with an open mind. Firstly, this is nothing like the first film. Everything is different, with the exception being Mr. Cage. It is very much a B-movie. Something you can imagine with lots of action, almost zero plot, and character development that seems to have gone up in smoke. It bears very little resemblence to the comic. It's a mash-up of Crank with a really bad B-action movie (think a recent Van Damm movie) and that it the best way to describe it. It's nothing more than a Meh film, that left me bored at the first half an hour and clock watching till the end. If it comes on telly, maybe check it out if nothing else is on. But I wouldn't go out of my way to view it. Simply Meh.",
      "total_reactions": 0,
      "user": "TruAlbino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Ghost Rider: Spirit of Vengeance gives a nice continuation to the first part but it has fallen into the mistake of trying to compete with the first part which was a 9/10, so overall its a good movie but there is no need to rush to watch it and its a one time movie. I shell give no more than 5/10 to it.",
      "total_reactions": 0,
      "user": "deamonhunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Ghost Rider: SOV tried to improve his predecessor adding more action, more humour and more crazy scenes, but I don't think that is the direction they have to go with. I didn't like neither the directors no Nic Cage in this film. The rest of the casting was great. David S. Goyer's script wasn't that great, I think he could have done it much better. The best part of the film were the scenes where Ghost Rider appeared. The ending was satisfying, though.",
      "total_reactions": 0,
      "user": "ftoons"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The accursed Ghost Rider is hired by a secret sect of religious monks in the hopes of rescuing a young boy from the devil's grasp in exchange for his soul, a battle that will rage across Eastern Europe as The Rider takes on the forces of Hell atop his fiery motorcycle! CRANK directors Mark Neveldine and Brian Taylorn attempt to inject the same high-energy aesthetic in to the GHOST RIDER reboot, with disastrous results. SPIRIT OF VENGEANCE comes off looking like an unscripted mess, almost as if it were shot as an amateur music video for some no-name rock group. Nicolas Cage is as awful as ever. Why even bother rebooting the series only to bring back the single worst element from the original film? SPIRIT OF VENGEANCE takes a darker approach to the material that falls more closely in line with the comics, sacrificing the kid-friendly attitude from before in lieu of the increased action and horror. Ghost Rider has received a major overhaul as well, his charred skull and blistering costume being the only welcomed changes to the character. When standing before his enemies or blazing down the highway on his hellish motorcycle, he is an awesome sight to see. The remaining effects are uneven at best, and take a dive during the ugly transformation sequences. With a pointless excuse for a plot is hard to ignore, GHOST RIDER: SPIRIT OF VENGEANCE offers little more than the occasional eye-candy.",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Ghost Rider is one of best marvel characters of all time, I enjoy the first film,but the Spirit of Vengeance wasn't i though it would be. With a weak script, unorganized cgi, an okay directing, and of course Nic Cage performance as Johnny Blaze/Ghost Rider once again was okay. The film look funny than a action film and therefore Ghost Rider need to be work on more.",
      "total_reactions": 0,
      "user": "kashmanthillet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "The visual effects were awesome, just as the trailers promised... however the movie seemed to drag on, it just didn't have the same humor and pacing as the film in the series.",
      "total_reactions": 0,
      "user": "LynnHardy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "1st movie was ok.SOV was nothing but a waste of time.Fell asleep after the popcorn was gone.Luckily only spent $2 apiece at the 2nd run movie theater.Don't waste your time.Like some movies if it didn't have some decent **** to look at nobody would be left in the theater.",
      "total_reactions": 0,
      "user": "jaalx6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "The film is moving in the same old pattern,blow up things and fight evil.Is not something special.You can clearly see how Nicolas Cage bored playning this character,it's a totally waste of money,despite the fact that visual effects is even more better than the first one and a fast paced direction from the creators of Crank and Gamer",
      "total_reactions": 0,
      "user": "Mr-K05"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Once you get past the first 10 minutes, the movie starts to pick up the pace and overall is fairly enjoyable. Though the plot is a bit iffy at times, there's nothing quite like Nicholas Cage turning into a molten skeleton biker just to pound the snot out of evil.",
      "total_reactions": 0,
      "user": "HrtBrk1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Where to start...Cage's gravely overacted performance is almost as bad as in 'Drive Anry'. Some scenes are so ridiculous it makes you squirm in your seat. I can't believe this is the same guy who did 'Lord of War' or 'Wild at Heart'. Maybe",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "I had low standards for this going in, but somehow I was still shocked by how horrible it was. Long, boring, and just plain terrible. I was also shocked at how bad Nicolas Cage was in this which, again, was surprising considering how poor his performances have been in the majority of his movies lately. I cannot believe someone, at some point in the process of making this movie didn't step in and point out how laughably bad this movie was.",
      "total_reactions": 0,
      "user": "Wise_guy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "My advice is that, really, don't be so stressed out or so eagerly and insanely dying to watch this disgusting piece of crap. I'm just going to say that it is one of the worst, and maybe THE worst, cinematic experience I 've had since the last Chipmunk movie. You'll leave the movie theater in such an unsuperable hate towards movies that will chase you to the end. Horrible movie, below 0.",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "This is the worst of the worst. An abomination. The movie is called \"Ghost Rider\" so maybe I wanted to see this Ghost Rider but the character itself is like a cameo, barely appearing in some of the scenes. If Nicholas Cage wasn't so damn crazy we could have a bad movie. But this, is one of the worst pieces of cinema ever created.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "I found no interest watching this movie. Such a waste of time. Rather I think, previous one wasn't so bad. They made some funny scenes in the movie which were really ridiculous and I couldn't stand those. In fact, the story is also not so interesting. I hope they will come back with something especial next time.",
      "total_reactions": 0,
      "user": "kinghridoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "This movie is so hilariously bad that it's actually an enjoyable watch.  If nothing else, watching Nicholas Cage urinate fire is worth the entrance fee alone.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "An obvious low budget attempt at a sequel for a movie that, well, wasn't so good but don't right it off just yet. Yeah, the story line is just utterly terrible, the acting laughable however when Ghost Rider actually makes an appearance you are reminded why you are watching this movie. The action is far and few between but generally satisfying. The CGI when it comes to Ghost Rider is fantastic, the flames flowing off of enemies he has vanquished, vehicles he is driving. Everything literally breathes fire upon his touch. It's a shame that most of the budget was clearly spent on making him look cool, that the movie ended up becoming an even bigger let down than original. For Marvel/Ghost Rider fans only.",
      "total_reactions": 0,
      "user": "Samblix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "I Found ghost rider spirit of vengeance mild fun, What I mean by mild is half the movie is decent the other half is worthless.Here are the good things Idria elba He was the best actor in the flick and the action,special effects and what not.Surprisly this film was written by David S. goyer or partially written.There are many plot holes which are also very familar holes.The story is cliche most of the time except for the worthless scenes put throughout the movie.Here's the thing about ghost rider he wasn't really that great of a character to start with in the comics he has a great look not gonna lie.And yes ghost rider was created by Marv Wolfman don't get me wrong he made blade also and did wonders ith the new teen titans and Crisis in Infinite Earths but ghost rider eeally isn't his crowning achievement.And if you want to know yes Nicolas Cage's acting was pretty bad.",
      "total_reactions": 0,
      "user": "sammyramone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "i love this movie, i don't care what anyone else says, i f**king love it, it's more faithful to the comics than the first one, so nobody here, userwise, who says that, has any real credibility",
      "total_reactions": 0,
      "user": "flubertubertube"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "F**king epic!!!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "mcmanusthebrave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Awesome",
      "total_reactions": 0,
      "user": "billylenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Nicholas cage is the mater of batsh*t insanity, boy is he a sight to watch in a packed theatre... also, i don't understand the low ratings, everyone in the theatre i was in enjoyed it greatly... ah, life is funny sometimes...",
      "total_reactions": 0,
      "user": "aliceanderson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Coolest movie, i've ever seen, screw everyone who doesn't like this",
      "total_reactions": 0,
      "user": "johnothantaylor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "watching this is an absolute blast, those who don't like this film probably haven't enjoyed some dumb fun in their lives, they really need to lighten up, i can't understand how they could criticize the special effects either, they are better than the first film by miles, i enjoy both of them because they're campy, simple action flicks, if you are the same, you probably will too (can't believe the rating either)",
      "total_reactions": 0,
      "user": "alliedcola"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Phenomenal movie, everyone that doesn't like it can kiss my arse, i loved it, my friends loved it, and everyone i've talked to loves it, how is this rating so damn low???",
      "total_reactions": 0,
      "user": "wearetheothers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Wow, people on here either love it or hate it, me, i just enjoyed it, it was rather fun in 3D, i haven't read the comics that this is apparently based on, so i can't say anything on, you know, that sort of stuff, but it was pretty cool to see a burning skeleton guy kill people with a bagger, if you feel the same way, you might get a kick out of it.",
      "total_reactions": 0,
      "user": "mickeyboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "A fun, stylish, well shot film, the action is infinitely better than the first film, and it's outlandishness makes it quite enjoyable to sit through, though it does drag, it is a great time to be had, 7/10",
      "total_reactions": 0,
      "user": "cweyland"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Great ridiculous fun, that's all it is, no more, no less, the boring parts do overstay their welcome, and the film doesn't really end, it stops, but problems aside, it is the epitome of an insane, chaotic popcorn flick.",
      "total_reactions": 0,
      "user": "fukdapolice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "epic film, i swear all the critics who reviewed this must have been lobotomized, they think that cinema should be realistic, logical, and humane, which defeats the purpose, as films serve as an escape from reality, why, unless they're based on true historical events, must they conform to the laws of reality, again, it defeats the purpose, just keep this in mind the next time you see someone hate a film because it's 'unrealistic' and if the whim takes you, SLAP THEM.",
      "total_reactions": 0,
      "user": "mattyabrams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Amazing!",
      "total_reactions": 0,
      "user": "carlthefunnyman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "A sequel that seems to be made ​​just to raise money.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "extrafizz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "An unbearable experience. You will literally want to rip your own eyeballs out before its over.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I love \"superhero\" movies, so it was good. I liked the actors, and action, but it was not that great overall.When it ended, It didn`t have me asking for more.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "THIS IS THE BEST SUPERHERO MOVIE EVER!!!!!!!! IT'S SO MUCH BETTER THAN THAT AVENGERS AND THE DARK KNIGHT RISES CRAP!!!!!!!! GREAT CHARACTERS,GREAT PERFORMANCES AND GREAT STORY. FINAL SCORE: 11/10",
      "total_reactions": 0,
      "user": "MW3ISCRAP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Honestly, I disagree with all the rating's this film is getting. The last Ghost Rider movie was boring, this one is twice as better! Although, the plot needed more focus, same with character development. However, the Ghost Rider himself was the star of the film! He's mean, crazy, and funny in a way. Should make another one, but as a reboot, 'cause Nicholas Cage could do better than this.",
      "total_reactions": 0,
      "user": "savagejoe444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "It suffers from the same blemishes that overwhelmed the first Ghost Rider, sloppy scripting, substandard special effects, and even though it's faster and more straight to the point than the first, it has hardly improved in any other department.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "It's so ridiculous! And it's great! I don't follow the comics, and I have a general dislike of Cage's acting, but I actually found him tolerable in this movie(the only other movie he's marginally ok in my eyes being \"Face Off\"). It's not a life changing, mold-breaking piece of cinema by any means, but it's still good fun. I had my doubts after the catastrophe the first movie was, but I'm glad I used my afternoon to give this version a go. Who knew insane flaming skeletons in a leather jacket could be so hot?",
      "total_reactions": 0,
      "user": "cmyk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "Ghost Rider: Spirit of Vengeance is the story of a man Johnny Blaze ( Nicolas Cage ), who made ​​a deal with the devil to save his father . It now lives the spirit of Ghost Rider . Johnny comes monk Moreau ( Idris Elba ) who invites him to save the boy Danny ( Fergus Riordan ) who is the son of the devil that haunts Carrigan (Johnny Whitworth) hired by the devil. The Devil plans to use the body of Danny for that would plunge the earth into darkness.",
      "total_reactions": 0,
      "user": "Mortimer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "This is, quite simply, the worst movie I have ever seen in a theater. No exaggeration, no hyperbole, this is literally the worst thing my eyes have ever been forced to watch in all its unholy non-glory. The writing is so unbelievably terrible, and the \"acting\" is even worse. First of all, Nic Cage is at his finest - and by finest, I mean he takes things way the hell over the top. Not emotionally, no, that would actually be kind of cool; he goes his usual over the top weirdness. To make matters worse, even when Cage is nowhere to be seen and it's the (surprisingly awesome) CGI, it gets even stranger and yet far, far lamer somehow. The highlights of Ghost Rider's evil-fighting spree include pissing fire and instead of giving people the penance stare he, I kid you not, just sort of picks them up by the throat and waggles his head back and forth in front of them for several seconds at a time. No pain, no soul-burning, no evil-slaying, he just kind of stares at them like he's trying to seduce them with his flaming eye sockets.",
      "total_reactions": 0,
      "user": "TheWolfSage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "Ghost Rider: Spirit of Vengeance is a terrible film. Direction is horrible, the script is terrible, and the story is basically pointless. Do not see this if you were a fan of the first, this movie just makes Ghost Rider look worse.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "For every Spiderman, you have your Howard The Duck. For every Guardians Of The Galaxy, you have the first Captain America (The old one!) And for every Iron Man... you get this badly done, very stupid, and very boring film. A mess, a true mess. With only one cool scene and more devils then ever, this is a very bad movie. Avoid. The. Spirit.",
      "total_reactions": 0,
      "user": "PipePanic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Huge Marvel fan here: I wouldn't recommend this movie to ANYONE. Not even to a Marvel fan. Probably not even to a Ghost Rider fan. Less of all to the general audience. It's really simple: this film sucks. It stinks, literally. I can't recall ever watching a worst superhero film ever. The only cool things are: the character design, and... no, that's it. Maybe some action, maybe. The cast is poor, but the worst is the direction. How can anyone think this is a good movie? Each to his own, but I've just one more thing to say: poor Ghost Rider.",
      "total_reactions": 0,
      "user": "UltimateBub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "After watching this movie for the first time, I was disappointed to see such a great comic book character wasted destroyed by a movie that doesn't feel the same like the the Ghost Rider movie in 2007. The story was stupid and lacked all understanding at all. I only cared for Ghost Rider himself, when Nicholas Cage wasn't Johnny Blaze and when he was Ghost Rider, he was off the chains crazy in a kick ass way.",
      "total_reactions": 0,
      "user": "Th3GreenHorne7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "\" Ghost Rider: Spirit of Vengeance \" was an extremely boring movie , about the script , photography, editing and raw Starring Nicolas Cage but could be worse than Fantastic Four of 2015?",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "As a B-grade horror/action hybrid, and the lowered expectations that come with that description, it's a very fun experience.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "A bit of a nerf from its previous installment. If you enjoyed Ghost Rider which I know most of you didn't, you'll probably either love this or hate it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Some good action scenes, wasn't as good as the first one, but still a good watch.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "This movie is a lot better than the first one. It had good special effects and the actors actually did an awesome job. The villain's appearance is actually correct in this one and not some cheap knockoff that they just wiped their rear ends with. His bike is also actually the exact same as in the first one and there were really good fight scenes also unlike the first one. I still wouldn't give this a 10/10 but it is definitely worthy of a 7.",
      "total_reactions": 0,
      "user": "Castiel_Angel"
    }
  ],
  "metascore": 33,
  "name": "Ghost Rider: Spirit of Vengeance",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 2,
    "year": 2012
  },
  "opening_weekend_income": 22115334,
  "opening_weekend_income_currency": "$",
  "rating": 4.3,
  "rating_count": 91106,
  "rating_freq": {
    "1": 10372,
    "10": 5660,
    "2": 8382,
    "3": 12041,
    "4": 15661,
    "5": 16427,
    "6": 11501,
    "7": 6424,
    "8": 3225,
    "9": 1413
  },
  "release_day": 17,
  "release_month": "February",
  "release_year": 2012,
  "user_review_count": 333,
  "votes_per_demo": {
    "aged_18-29": 37330,
    "aged_30-44": 31814,
    "aged_45+": 6601,
    "aged_under_18": 334,
    "females": 8149,
    "females_aged_18-29": 3884,
    "females_aged_30-44": 2959,
    "females_aged_45+": 831,
    "females_under_18": 27,
    "imdb_staff": 5,
    "imdb_users": 91106,
    "males": 70598,
    "males_aged_18-29": 33089,
    "males_aged_30-44": 28473,
    "males_aged_45+": 5669,
    "males_under_18": 303,
    "non-us_users": 45550,
    "top_1000_voters": 480,
    "us_users": 12257
  },
  "year": 2011
}