{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 46,
  "mc_movie_name": "Gnomeo and Juliet",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 51,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "This lively little film, a comic take on Shakespeare's tragedy, is really entertaining."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "This gently amusing, genuinely sweet animated film makes you smile from start to finish?"
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "Kids will fall in love with it as a movie treat full of heart, laughs and fantastic songs, and it could have crossover appeal as a Valentine date night treat thanks to all its pointy-hatted romance."
    },
    {
      "critic": "Sean O\\\\\\\\\\\\\\'Connell",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Any film that dares to cast the bat-chewing heavy-metal legend as a gentle, ceramic reindeer named Fawn is okay in my Bard book."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Stays too low to the ground to become an animated classic, but if there's a fairer midwinter's tale, wherefore art thou?"
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "It has its own bizarre charms and a breezy confidence that renders it the very definition of a simple pleasure."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "A welcome dose of honest silliness at a time when most family-oriented toons settle for smart-alecky."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "The voices are outstanding; the story demands British accents, and with such people as Caine and Smith providing them, so much the better."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 67,
      "summary": "Every movie about cuddly dwarf statues in an English garden should have music this big."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 65,
      "summary": "Theatrically inclined parents will also appreciate a passing reference to the Rosencrantz and Guildenstern Moving Co."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "The clever screenplay, co-written by director Kelly Asbury (who co-helmed \"Shrek 2\"), follows the DreamWorks template of combining pop culture references, sight gags and action for the kids, and more sophisticated humor for adults."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "If it's not an unerringly faithful adaptation of Shakespeare's play, it still manages enough wit and charm to come off."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "There is some fun to be found in this goofy riff on Shakespeare."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Totally crackers but it gets powered by pure invention and eccentricity alone."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 58,
      "summary": "Far too much of the film is devoted to eye-rolling pop-culture gags and long montages set to recycled Elton John songs."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Terra-cotta gnomes, the sort that decorate people's lawns, are the characters of this bizarre feature animation, which lampoons the British obsession with gardening and upholds a long tradition of cartoons pitched to tots and stoners."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's not really a Disney film. Rather, this is a product of Starz Animation. It's a key distinction, because -- well, because Starz Animation is no Disney, and it's certainly no Pixar. It proves that here."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie is nothing if not anxious to please. There's a big, diverse, celebrity voice cast – Maggie Smith, Hulk Hogan and Dolly Parton as well as Caine and Osbourne."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "A ceramic gnome by any other name is still a kitschy little figure."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a sorry spectacle, watching garden gnomes being robbed of their dignity."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The script feels workshopped to death yet still hits only a single broad note of irony-drenched whimsy, but the voice-work sparkles and the action-heavy animation clips along fluidly. There's charm in the backyard, but it's still of a garden variety."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The result is a knockoff cinematic ceramic."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie comes up short on inspiration despite a stellar voice cast that includes James McAvoy and Emily Blunt and a toe-tapping songbook by Elton John and Bernie Taupin."
    },
    {
      "critic": "Nick Schager",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "The movie's overall lack of imagination is the real tragedy."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "What a dud of a story! You know what it needs to dress it up? Garden gnomes."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "As weird as it sounds."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 20,
      "summary": "This is perhaps for Shakespeare completists only."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 11,
      "summary": "Novelty alone does not a good idea make, and in the case of Gnomeo and Juliet, it's rather a disturbing, even fetishy one."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "I was excited to Gnomeo and juilet I was expecting it to be funny.",
      "total_reactions": 3,
      "user": "ESS180"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This is a very silly movie. Silly as JB. A love story, about garden gnomes, SERIOUSLY?!?! The storyline was bad. The characters sucked. The dialogue was silly. Gnomeo and Julliet is a movie that everyone except Beliebers should avoid. Watch Shrek instead of this thing. I think it's an insult to call this a movie.",
      "total_reactions": 2,
      "user": "Mariofan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Awfully crappy. Silly as JB. Avoid!!!!! IT AT ALL COSTS!!! jdjdjdjjdjdndjdnndjdmdjdjdmdjdmdcjfjndnfdbdmdjdndndjdmndmdjdmdmdjdmdmdjdmdjdmdjdndmdjdmdmdndmdmdndndndndmd!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "Beastprogamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "They look like toys, but they're not. It must really burn this sorry lot, to come up short against their rivals, and yet the filmmaker doesn't go there. \"Gnomeo and Juliet\" never gets past its initial conceit. The film simply wants to goof on William Shakespeare. Too bad. The pathos goes unexplored. The gnomes are cute, distinguishable by sex, and their faces suggest a personality, but alas, the gnomes aren't kid-friendly. The parts don't move. They don't make a sound. Worst of all, they're ceramic. Nobody plays with lawn ornaments. (Can you just imagine the people at Pixar exploiting this fact!!!) Nobody loves them. It's a reality that the makers of \"Gnomeo and Juliet\" never acknowledge, preferring instead to infuse the mindset of the lawn ornament with a toy's logic, a toy's undying loyalty. The feuding gnomes, in actuality, have no surnames. As it's revealed in the opening shot, after the Andy Kaufman-esque prologue(similar in theme to his \"Great Gatsby\" bit), the Montagues and the Capulets are appellations that refer to the gnomes' human owners, next-door neighbors at odds who reside on Verona Drive. Even though the gnomes wear the tribal colors of their respective landowners, blue(Montagues) and red(Capulets) shouldn't signify anything because the gnomes, by all appearances, are not on a first-name basis with the people, the warring factions whose problems they appropriated as their own. To the actual Montagues and the actual Capulets, the auxiliary members of their families that occupy the gardens, are ciphers, so where does this loyalty come from, which inspires the gnomes to keep Gnomeo and Juliet from being together? Not once do we see, Montague or Capulet alike, performing some sort of ministration upon the gnomes to indicate that the lawn ornaments have value, akin to a toy. For instance, when Tybult shatters and is reduced to tiny pieces, due to a lawnmower racing accident, a savvier film would have shown who(person or thing) was responsible for the gnome's eventual restoration. More than likely, it's a lawn ornament who mends Tybult, but each group's allegiance to his namesake would lead you to believe that the glue belonged to a proper Capulet. If human hands put Tibult back together, you could understand better as to why the Red Hats and the Blue Hats can't mix. But as \"Gnomeo and Juliet\" makes clear, the film has no Andy(the boy from the \"Toy Story\" series\"), a human representative who interacts with inanimate objects, and loves them. Clearly, these lawn ornaments are forgotten, and left to their own devices. Their real grudge should be with the toys, who sleep in the house, on a shelf or a bed, instead of having to brave the elements: the rain, the sleet, the snow, and the neighborhood cats, the neighborhood dogs. Toys have value. Toys get fixed. In essence, \"Gnomeo and Juliet\" wants to be \"Lawn Ornament Story\", especially during the scene where the pink flamingo recounts the story of his pink flamingo mate, which contains the same \"Toy Story\" approach to loss, evoking the moment in the second film when Emily, Jessie the Cowgirl's owner, tosses the doll under the bed, and is forgotten. \"Gnomeo and Juliet\" is equally adult in its handling of abandonment issues. Tossed into a garden shed, the aftermath of a separation between the flamingo's owners(she took the other bird), Featherstone muses, \"Other people's hate destroyed my love\" but the moviegoer never gets a read on how the pink bird feels about their indifference, the casual cruelty which led to his imprisonment in that shack. In Lee Unkrich's '\"Toy Story 3\", Lots O'Huggin Bear couldn't survive without his human, so as a coping mechanism, he unleashes his anger upon Woody and Buzz Lightyear, and the rest of Andy's toys, because in the stuffed animal's state of bereftness, he despises the newly-arrived toys at the daycare for the same reason he despises himself: the bear needs his original owner, he needs love, whereas the gnomes need no human interaction, and yet, both sides are willing to fight in their honor. Prior to the final action set-piece, just like how Shakespeare wrote it, Benny breaks into the Montague household, and using the computer, orders the lawnmower that will give the \"blue hats\" an advantage over the \"red hats\". The Terra-firmanator, under his command, nearly kills the star-crossed lawn ornaments, and what for? Had Benny been successful, the old lady would have simply swept away the ceramic pieces into a dustpan, without ceremony. If the makers of \"Gnomeo and Juliet\" had Pixar's ambition, they would have made Juliet a toy.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "I went to this movie with my younger siblings expecting a disaster. It ended up being a (somewhat) entertaining hour and a half.  Some of the character development was lame, and some scenes dragged on.  The \"dance party\" at the end of the movie was atrocious.  However there were some surprisingly funny moments, and I loved the Shakepeare statue. Wasn't as bad as I thought, but I'd wait till Cars 2 for a really good animated movie.",
      "total_reactions": 1,
      "user": "ripperroo123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "This movie is totally forgettable. Sure, the kids will love it and the sound effects were really well done. Other then that, there's not much to say. Some moments were fun to watch, the rest was quite boring. The main reason why I really wanted to see '' Gnomeo and Juliet '' it's because of the ending. Of course, in the original story they both die, but I was curious to see how this new version will end (because it's for kids). I thought it was okay. But at least the children will enjoy it.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "I was  disappointed by this, and I usually like computer animation. It had un-engaging characters  and a boring plot.  This should have been a â",
      "total_reactions": 1,
      "user": "bikeman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I thought this movie was absolutely delightful, then again, I was not expecting a computer-animated retelling of Romeo and Juliet like other reviewers were. The characters were fun caricatures of those players we've grown to love and know very well from Shakespeare's original play, and even small characters had fully developed personalities. I found myself caring for the main protagonists' plights due to the careful, if not a little rushed, storytelling. The animation was gorgeous and delightful. Young ones will love it, and even though I am decidedly not in the target demographic, I was mesmerized by the vibrant and colorful graphics.",
      "total_reactions": 1,
      "user": "LosAngelic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "At first this movie looked like it was going to be alot of fun but then it got bad........REALLY BAD!! This is the only movie I have ever stopped watching in a very long time. I usually love these kinds of movies but this one wasn't even worth the $1 rental in my book!",
      "total_reactions": 1,
      "user": "scottysauce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "worst movie ever kid movies are awsome but now I think all kids movies you should watch are by disney.",
      "total_reactions": 1,
      "user": "mattisme76"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Forgettable and snooze worthy. Kids didn't like it much either. Very young kids might enjoy because of all the pretty colors--but that is what a kaleidoscope is for.",
      "total_reactions": 1,
      "user": "joelschnick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 1,
      "text": "They glued Capulet together at the end!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! FFS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 1,
      "user": "MaeWard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 1,
      "text": "One would never want even their worst enemy to endure the pain when watching this so called \"movie\" This could turn the biggest fan of Shakespeare into a hater with its awful adaptation from a beautiful and divine play. Only positive from the film was the great casting, unfortunately they picked the wrong movie to star in.",
      "total_reactions": 1,
      "user": "SophieW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "Because of nothing better out and my four year old wanting to go to the theater, the two of us saw Gnomeo and Juliet.  Now, I don't go to any of these animated movies with my daughter expecting anything other than something entertaining for her to watch.  Colorful characters? Check.  And....thats about all I got from it.  I have read Shakespeare's Romeo and Juliet three times because I am a true fan of the story, and I feel like this children's adaptation has completely butchered it to the point where it should not have been made at all.  But then again, it isn't about me, but my daughter who should enjoy it.  Its just that I can think of dozens of ways to have better spent that $25 dollars for her amusement.  I would avoid this movie if possible.",
      "total_reactions": 2,
      "user": "SeenNotScene"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "endearing and fun!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 3,
      "user": "moviefan11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Getting very tired of the people whining about this ruining Romeo and Juliet. Nothing is sacred any more and everything is viable to be poked fun at. Romeo and Juliet was believed to be written around 500 years ago. So stop complaining. All of that aside, this was a mediocre animated comedy film. It has excitement, love/romance, adventure, and plenty of comedy to go around, even for adults. This was made for kids. It's no Toy Story, but it's not so bad as to deserve anything below a 5. Take your kids to it and you won't be entirely bored.",
      "total_reactions": 1,
      "user": "BDeyo01"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "I'm a huge fan of Elton John, and I know he and his partner were heavily involved in the making of this movie, so I went to see it because the movie contains Elton's classic songs from the 70s plus a couple of new ones.  I really liked the new songs from Elton so I suppose I will have to purchase the soundtrack now.  The animation is excellent - very colorful and textural.  The story itself is, of course, predictable, as it is a retelling of Romeo and Juliet, but of course nobody dies tragically at the end since it is a children's film.  There are no big laughs, as with a Pixar film like Toy Story, but there are no boring or slow parts either.  I just found it fascinating to look at so it kept me entertained.  Overall not great, but certainly a good effort.  I hope to see more animation from Elton's Rocket Film group.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "My husband took me to see Gnomeo (Long story...), and we both found it to be really cute.  It is made for kids, so no traditional old-world language, but I recognized lots of lines from the play and really enjoyed how everything was woven together.  The animation and 3-D was gorgeous, and I loved the Elton John soundtrack (Pay attention to what song is playing during several scenes, they are chosen with care!).  The kids in the theater all seemed to enjoy the show, and the adults looked pretty relaxed and happy as well.",
      "total_reactions": 1,
      "user": "RoseMusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "Another harmless, fun, animated film. Nothing spectacular here, though the decorative backyard pieces are funny to watch in their interactions with each other! The inclusion of a few Elton John pieces are a highlight to the film's score!",
      "total_reactions": 2,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This was an amazing movie. It is a kid movie, what can you expect? Not every moment is going to be right out hilarious. Even adults enjoy the humor and the plot was very good. I was curious to see how the ending went and I was very pleased when the gnomes didn't die. I think the idea is very creative, who else would think to make a spoof-like movie about gnomes on ShakeSpears Romeo and Juliet. For a kid movie I really enjoyed it. It has bright, cute humor and the characters arn't perfect and are enjoyable. People are rating this bad because they think the animation is bad, well it's not. Also all the other animated kids movie: Toy Story 3, Cars 2, ect are lame in the plot. Cars 1 was ok but they're just going to run the whole idea of it right into the ground. Gnomeo and Juliet is filled with surprised and the plot doesn't falter nor is it run in the ground so people are bored. The humor wasn't always in words but in facial expressions and body language. If you actually watch the movie and tried to read into it it is a very enjoyable watch. I highly recommend it for kids 1-13. I think even the teenagers would enjoy all the humor and like the funny twist on Romeo and Juliet. I'm definitely not saying that adults won't enjoy this film because I can almost guarantee that all ages would enjoy this movie. I like how there is action and romance and comedy all mixed into one great retelling (sort of) Gnomeo and Juliet. If you saw this in the theaters with your children you would be entertained as well. I don't think this movie is down right hilarious every second but what movie is? If everything that happened was funny the whole film would be cheesy, boring, and pathetic. I like how this movie balances it out nicely so the humor doesn't let you down or get boring unlike probably a lot of other comedy's that have no meaning, no plot, and people made out of boredom. If you didn't like this adorable, sweet movie then fine, be a Grinch. You can be ugly and sour about this movie all you want and have extremely high standards when it comes to movies then fine but you don't have to put down negative comments. The whole world doesn't really care whether or not you yawned the whole way through it. I think if you don't like it you should not purposely go on a review site and dish about a movie you didn't like. This is definitely a movie thats worth seeing, just to see if you like it or not.",
      "total_reactions": 4,
      "user": "MovieCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Parts of Gnomeo & Juliet were certainly charming, but could that be related to its original source material? Elton John's soundtrack was first-rate; however, it ends there.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This iphone app was aweosme. I gave it to me kids and tehy wouldn't stop playing. Dunnow how it intstalled - came w/ chaep ripoof iphoon, stuk to bottom of bar tabl w/ gum, makes phon smell like hops. tasttyyy phon thx yeah.",
      "total_reactions": 2,
      "user": "B4byG3n1u5L0v3r"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "So Gnomeo and Juliet is a mixed bag. On one end the film as some good animation, some likeable characters, and does a nice job in some parts telling the story of Romeo and Juliet for kids. However, just when the film seems to getting heartfelt and doing a nice job with the whole message on prejudice it shoves a lot of pop songs, pop culture references, and adult jokes down your throat. If this film was just a bunch references and pop jokes I would be giving this film a 4 or 5 but because it does have some moments, more or less the same basic premise, and some of the adult jokes work it is getting a 6. I was not bored or groaning as much as I do in other kids films and this one kept my interest to an extent. If I had kids I would still show them this because there is nothing terrible or bad in here. As it is Gnomeo and Juliet is a nice adpation of the Shakespeare classic except for when it tries too hard to be hip and appeal to older kids and adults. But other than that it is a decent flick. Not going to recommend this one or dissuade you from seeing it but if you wind up watching it the film is not as bad as it could have been.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Let me just say that I absolutely hate Shakespeare and his works, including Romeo and Juliet. This movie however, was the anti- Romeo and Juliet, and that, for me, was a very good thing. Sure, there may have been a bit too many pop culture references (although I loved Hulk Hogan's Terrafirminator commercial, brother!). But in the end, I'm glad some guys decided to give William Shakespeare the finger by making this movie.",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "I don't tend to make a habit of going out to see children's animations but I'm pleased I did. I must admit that I was expecting to be bored within 10 minutes but this was no way the case. It is clear that the demographic for the film is a younger audience but it is also made in a way that enables it to be enjoyed by people outside of the demographic too. I for one enjoyed the film and didn't at all think it ruined the Romeo and Juliet story at all. Children of this age will not know the Romeo and Juliet story in as much detail as an older audience would. They'll be watching the film for the film not for an animated adaption of Romeo and Juliet.",
      "total_reactions": 0,
      "user": "JamesNWA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "An interesting twist on a classic love story with some laughs thrown in for good measure, but in the end it turned out too be pretty mediocre, but it was an ok movie just don't expect much.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "This was cute, funny and amusing.  The visual references to Baz Lurman's Romeo and Juliet were great for the accompanying adult.  My 6 year old kept up with the storyline without any difficulty.",
      "total_reactions": 0,
      "user": "Teatime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "This is arguably the worst movie that I have ever seen. I absolutely love kids movies but this one was so awful that I couldn't evenremotely enjoy it when I was high. They can refund my ticket but there is no way that I can get back that hour and a half or so of my life. Don't waste your time",
      "total_reactions": 0,
      "user": "kpeter32"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "A fun but forgettable twist on the classic Shakespeare story. It features a few groan worthy jokes and crow bars too many Elton John tunes into the narrative, but also features an unexpected heart, good voice acting, and beautiful animation.",
      "total_reactions": 0,
      "user": "nyc995"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Wow. I still can't believe I actually took time out of my schedule to see this movie. Well, I suppose I'd better get straight to the reviewing process, so here it goes. *ahem* This movie rivaled many of those straight to DVD children's releases you find in many bargain bins at most of your local retail stores, and that's not a compliment. This movie starts out slightly bearable, but not even fifteen minutes into this movie was I ready to accept the large amount of disappointment I was going to be bombarded with. You think that with the movie being titled \"Gnomeo and Juliet\" that there would be some hilarious puns and gags that would leave you in stitches throughout the entire movie, then again, maybe that was just me, because the experience I had with this movie was an all-out bummer; a total waste of time. The thing that hurts me the most is all of the wasted talent the movie constantly shoved in my face. Do yourself a favor: if you see this movie anywhere, do NOT buy, rent, or even touch this movie. It won't be worth your time or your children's time. Trust me.",
      "total_reactions": 0,
      "user": "Mahboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "gnomeo and juliet is amazing cartoon, first i thought it would be lame and boring, but it turned out just the opposite! movie is great, it has a happy ending, that's the most important thing, at least for me. although i was a bit disappointed because some parts of movie doesn't make sense at all.",
      "total_reactions": 0,
      "user": "M_aja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "it's a good movie.these kinds of movies should be fun and lively and there was a little romance as wel.so that's what has to be expected from this movie.",
      "total_reactions": 0,
      "user": "faraaz11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "For what it was, Gnomeo and Juliet was cute, somewhat delightful, and enjoyable with a nice soundtrack and cast, even if it was incredibly predictable and cliched.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Again, another animated film that is really predictable. Fortunately, this twist on a classic story is pretty good. The characters can be easily forgettable though.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Gnomeo And Juliet features talented voice work and great computer animation, with a few clever jokes and classic Elton John music but way too much inappropriate humor and a just self centered message and story. I gve this movie 52%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Let me introduce you to the piece of dog poo they call Gnomeo and Juliet. When I first saw this film, I had low expectations, and they didn't change a single bit. The humor is dry and weak, the stupid garden jokes were too awful and the movie felt like it was 4 seconds long. Long story short, DO NOT SEE THIS FILM!!!",
      "total_reactions": 0,
      "user": "dryyoshi7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Shakespeare's Romeo and Juliet, with garden gnomes? Sounds a little silly, but it's actually a lot of fun. The animation is good, as is the music by Elton John. Some of the voice work was a little bland, but I still had a fun time with this movie. A really cute little animated film!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "El tema alcanza ser sorpresivo, tierno y bonito pero se queda en la ridicules y homosexualidad que le pone disney a muchas peliculas..................",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "There are enough gleeful characters and diverting plot elements to pass as a friendly animated movie for the kids, but not enough substance or style to entertain the more demanding viewers.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "A simple Disney kid and family-friendly movie that doesn't even work in size or value, Gnomeo and Juliet seems forgettable after a couple of months of watching.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "\"Gnomeo & Juliet\" doesn't have a single original idea in its pointy, ceramic head.",
      "total_reactions": 0,
      "user": "lrbohnert"
    }
  ]
}