{
  "avg_rating_per_demo": {
    "aged_18-29": 5.8,
    "aged_30-44": 5.8,
    "aged_45+": 6.0,
    "aged_under_18": 5.3,
    "females": 5.5,
    "females_aged_18-29": 5.4,
    "females_aged_30-44": 5.4,
    "females_aged_45+": 5.8,
    "females_under_18": 6.1,
    "imdb_staff": 7.5,
    "imdb_users": 5.8,
    "males": 5.8,
    "males_aged_18-29": 5.8,
    "males_aged_30-44": 5.8,
    "males_aged_45+": 6.0,
    "males_under_18": 5.2,
    "non-us_users": 5.7,
    "top_1000_voters": 5.8,
    "us_users": 6.1
  },
  "avg_screens": 743.6666666666666,
  "budget": 23000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 3,
    "year": 2012
  },
  "critic_review_count": 394,
  "duration": 93,
  "genres": [
    "action",
    "thriller"
  ],
  "gross_income": 18934858,
  "max_screens": 2441,
  "mc_avg_user_score": 7.2,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 81,
  "mc_movie_name": "Haywire",
  "mc_negative_rating_frequency": 51,
  "mc_positive_rating_frequency": 216,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 91,
      "summary": "In truth, Haywire is simply a delivery system for ass-kickings, calibrated to the specific talents of Gina Carano, a former mixed-martial-arts star and American Gladiator whose fists (and feet) of fury can rattle skulls and cave in chests."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 88,
      "summary": "Haywire comes close to achieving Soderbergh's goal of creating \"a Pam Grier movie made by Alfred Hitchcock.\""
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 85,
      "summary": "That she makes it all look so effortless is part of the fun – as long as you're not unlucky enough to be the guy with his nut in the nutcracker."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 83,
      "summary": "It isn't perversely genre-busting like \"Drive.\" Instead, it feels like somebody turned down the volume on a hard rock album so as to hear the details better -- for which relief, much thanks."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2012
      },
      "score": 83,
      "summary": "Pummeling forward from its first diner-set fight scene to a sweeping final showdown on the beach, Haywire is a literal blast."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "This is a film built around its star, just as surely as any of its cheesier '80s forebears."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "Supremely economical, pulse-pounding and undeniably bewildering thriller, which plays like a blend of mid-'90s Hong Kong action flick and mid-'70s European crime drama. Arguably this movie amounts to less than the sum of its parts - but hot damn, those are some parts."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "There's no deeper meaning to Steven Soderbergh's thriller than what meets the eye, yet its lustrous surfaces offer great and guilt-free pleasure."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "Where faux-empowering \"The Girl With the Dragon Tattoo\" confines sexual power play to the old rape-revenge matrix, Haywire is a real war-of-the-sexes tournament, briskly paced with a tickling sense of black humor."
    },
    {
      "critic": "Simon Crook",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "A fresh, muscular payback movie shot through with Soderbergh's mischievous indie-spirit. Whether Gina Carano is the new Angelina or the new Cynthia Rothrock, only time will tell..."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "Paring down narrative and character concerns in favor of a breathtaking application of pure thriller technique, Soderbergh's latest picture is a lean, efficient exercise tossed off with his customary sangfroid and wickedly dry sense of humor."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Taut almost to the point of abstraction."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "One of the reasons Haywire is such a pleasure to watch is that its director, Steven Soderbergh, doesn't overplay the film's hear-me-roar subversions."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Beautiful in a girl-from-the-neighborhood sort of way, Carano inhabits Soderbergh's elaborate frame with wit, physicality and just a hint of ironic distance, the suggestion of someone who's not overawed by the opportunity or taking herself too seriously."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "A vigorous spy thriller that consistently beckons the viewer to catch up with its narrative twists and turns. Bordering on convoluted, it works best when in combat mode."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "The pleasure of this small, eccentric movie is the natural way Carano hurts people - by, say, walking partway up a wall and climbing onto a man's back, by sprinting toward the camera and flying into the human target standing in the foreground."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Disarmingly laid back for this kind of fare, with a jazzy musical score (courtesy of David Holmes) and a sleek, straight-ahead style, Haywire may not make much sense plotwise, but it's a rollicking 90 minutes."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "In terms of its title, Haywire doesn't quite go there; it's more \"Haywire-ish.\" But it's eccentric, and the on-screen violence is sharp and exciting - brutal without being either subhumanly sadistic or superhumanly ridiculous."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "A film like Haywire has no lasting significance, but it's a pleasure to see an A-list director taking the care to make a first-rate genre thriller."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "This is one of the director's mainstream efforts, although his penchant for the offbeat and oddly artistic has not been completely reined in. But there's plenty of unsparing, bone-crunching violence to dismiss the idea that Soderbergh is making an art film in disguise."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Soderbergh tends to get one big idea - a thesis idea - per film and stick with it even when a touch more flexibility would help. Here it's that non-kinetic camera, which he's so wedded to that parts of the film seem underenergized, like a cheap seventies or early eighties picture you'd catch at two in the morning on Cinemax's tenth most popular channel."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Haywire doesn't measure up to the best of the director's work - like, say, his Oscar-winning drug drama, \"Traffic.\" But watching Carano kick, spin, flip, choke, crack and crush the fiercest of foes - mostly men about twice her size - is thoroughly entertaining, highly amusing and frankly somewhat awe-inspiring."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "There's a good deal of pleasure to be had in the clockwork precision of her hand-to-hand combat, which Soderbergh often shoots in profile to showcase her wall-climbing backflips. The story surrounding it is comparably smooth, skilled, and mechanical, though a lot less memorable."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "In truth, the story isn't much. Just betrayal and revenge, basically. But a couple of things make Haywire a lot of fun to watch. One is the cast."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Streamlined, beautifully shot and casually thrilling, Haywire's superior action fun should hopefully draw audiences eager for R-rated, no-frills fare."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 70,
      "summary": "The script makes no attempt to assert its plausibility or realism; it is, instead, refreshingly frank about what it is, a simple, workable framework for the melees and mayhem."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 67,
      "summary": "Haywire cavorts around the world - Barcelona, Dublin, upstate New York, New Mexico - with Bourne-again energy and timeline shuffles, making only cursory attempts at plot coherence"
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "Serving as his own director of photography under the pseudonym Peter Andrews, Soderbergh picks his angles artfully and allows Carano to demonstrate her arsenal of acrobatic fighting tricks in extended, no-cheating single takes."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "Haywire, clean and no-fuss as it is, needs more action scenes to match Carano's game."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 58,
      "summary": "Soderbergh doesn't always match his pacing to Mallory's fury."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Haywire is a wannabe, or rather a wanna-B, and that B is for \"Bourne.\" As each imitator comes and (rapidly) goes, my appreciation for the best superspy franchise deepens. Even top directors - in this case Steven Soderbergh - can't figure out the trick."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Though Carano isn't without a certain glowering charisma, her flat line readings and apparent discomfort with dialogue-heavy exchanges make her seem like a refugee from a different, schlockier movie, the kind of low-budget, straight-to-video MMA rock-'em-sock-'em that might pop up on late-night basic cable and charm you with its rough-hewn amateurism and animal high spirits. As Haywire's long-seeming 92 minutes limped by, I found myself wishing I was watching that movie instead."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Once the talking stops and the action begins, her professionalism is very much in evidence and exciting to watch. And yet, somehow, it cannot quite relieve the tedium of a movie that is too cool even to pretend that there is anything worth fighting about."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Carano is her own best stuntwoman, but in the dialogue scenes she's all kick and no charisma. The MMA battler lacks the conviction she so forcefully displayed in the ring. She is not Haywire's heroine but its hostage."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "For all its kiss kiss, bang bang, Haywire ends up feeling as hollow as the points on Mallory Kane's 9mm ammo."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Steven Soderbergh has been telling interviewers that he's planning to take a sabbatical from filmmaking because he has lost his inspiration. His lack of interest is palpable in Haywire, a rote exercise in action filmmaking that is sleek and polished and instantly evaporates from memory."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "If anything, Haywire is most closely linked to last year's \"Contagion,\" a kindred effort in style, theme, and value-marring detachment."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "There's shockingly little thrill in watching Carano bounce off walls and pummel antagonists."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "Haywire makes no sense whatsoever, which should come as no surprise. It's the latest brainless exercise in self-indulgence from Steven Soderbergh, whose films rarely make any sense anyway."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "If you're a fan of boring conversation and terrible 70's detective movie music, look no further than Haywire.  This movie is mostly awkward conversation and terrible acting, with absolutely atrocious music playing throughout the whole thing.  The only time there is no music is during the 2 or 3 action scenes that break up the monotony of listening to bad dialogue.  How the director convinced so many A list actors to sign onto this disaster is amazing.  Did they look at the script?  Was there a script?  The positives to take away from this fim were the action scenes.  About as realistic as they get in a movie.  Gina Corano and her gigantic breasts also deserve some props.  She didn't look out of place and I would like to see what she can bring in future roles.  Since I only have about 4000 words of space left in this review, I won't bother listing the negatives to take away from this movie.",
      "total_reactions": 2,
      "user": "canadianrugby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "I was looking forward to this movie, being a big Steven Soderbergh fan (though admitting he's not always on top of his game).  But this was close to the bottom of the SS barrel.  It's all over the place and almost completely incoherent.  And the fight scenes are only so-so.  A real turkey.",
      "total_reactions": 1,
      "user": "billyweeds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "Gina Carano needs to stick to real fighting. Her acting was terrible and ruined an otherwise mediocre movie. Even the fake fighting in this movie was subpar. The whole movie was slow, cold and dead. Not only was I not sure what was happening for most of the movie, I did not care. I didn't care about any of the characters or the \"why\" of the attempt at a suspenseful story. Terrible movie all around, one of the year's worst.",
      "total_reactions": 1,
      "user": "Sevalley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Pleasant movie. The fights were incredible yet totally grounded in reality. The story is somewhat predictable but decent and serviceable. The soundtrack is excellent and really carries the film forward.",
      "total_reactions": 1,
      "user": "Xon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "It's really true a director can make so much different in a movie. Steven Soderbergh lift Haywire from the near grip of B-movie to a decent spy flick. One of the appeals in this movie is Gina Carano, an MMA fighter who admittedly doesn't have much acting prowess but possesses the strength and speed, better than most stunt women. Haywire tells a story of a secret operative betrayed by her contacts which precede her going hulk on them. Think of it as Bourne movie starring female version of Van Damme in Ocean's Eleven style.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "I was very interested to see this movie. A film with a real heroine, a",
      "total_reactions": 1,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "After about 15 minutes, I turned to the friend who I was with and said \"what is this movie about?\"  There was tons of action and a great cast, but the story wasn't there.  The whole movie seemed more like a vehicle to showcase Gina Carano's fighting skills, but frankly, I would have rather watched 15 minutes of MMA than 1.5 hours of this awful movie.  Skip it, or maybe watch it on TV during a snowstorm after you've watched everything on your DVR.",
      "total_reactions": 1,
      "user": "aphil02"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 2,
      "text": "Based on the professional reviews I was horrified to think I spent $ renting this film. NO acting, even from the big name actors. Seemed like everyone was reading their lines...for the first time!  The story was hard to follow, maybe because their wasn't much of one? Full on blows to the face without a drop of blood made the fighting seem fake, despite the grunting.  Maybe fans of martial arts will enjoy it but it seemed monotonous after a while.  And what is with that murky yellow cast to everything in the beginning? Didn't help.   I am a fan of the MI-5 series on Netfilx and thought this would be like it.  I was sooo wrong.",
      "total_reactions": 1,
      "user": "bensonbumpkin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "Lame attempt to be a Bourne movie, nothing more. Poor acting and most of the fight scenes are rubbish. In their rush to try and promote equal opportunities film makers often forget a simple fact, women can't trade blow for blow with a man. That isn't to say women can't be as good at fighting as men, of course they can. What it does mean is that simple facts about the physical differences can't be overlooked. Men are naturally stronger and have slightly thicker larger bones, and are able to take a bit more of a beating than a woman, that's not sexist, it's simple human physiology.",
      "total_reactions": 1,
      "user": "Chaseone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Soderbergh films always look great. The action sequences are so clean, it puts to shame many action movies of today. Carano isn't going to win an oscar for her performance but she kicks a lot of ass and did her own stunts, and that is what was required of her. Fassbender is great as always in a limited role.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Is Gina Carano a MMA fighter? Yes, and that is evident in this film. Is she an actress? No, something also evident (painfully  so) in this film. But she could have been forgiven if it where not for the fact that this whole film is dreadful. The main storyline appears to be have been built around the fact that Carano can beat the crap outta people  lets have her do a lot of that!  and a lot of running. Lets have lots of running sequences. Everything else is of secondary value. There is a very thin plot, which basically makes no sense. Don't waste your time on this...",
      "total_reactions": 1,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Some major flaws with this film. One Gina Carrano has very little acting ability. She's gorgeous and can handle the fight scenes, but otherwise her one word remarks do nothing for the film. Then the plot. It is so confusing. You have no clue what's going on for most of the film. Add to that a horrible score. The action scenes were laden with this 1970's exploitation music. It became so bad, most people in the audience laughed at the beginning of each chase sequence. Put it this way, I've never walked out of  theater. I left after an hour of this film. I couldn't take it anymore.",
      "total_reactions": 5,
      "user": "Sabbath73"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "The four of us who went together to see Haywire thoroughly enjoyed it. It's an action movie with a common, simplistic plot, but it stands out from the usual fare with its different approach to filming and sound. Gina Carano is terrific. The fact that she did her own stunts lent realism to the film, unlike so many action films that are so outlandishly over the top. Admittedly, it was confusing at first, but it came together as the movie progressed. A very entertaining action film which seemed a bit more grounded in reality than most.",
      "total_reactions": 6,
      "user": "Picatavi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Finally a woman who actually knows how to throw a punch instead of crappy fighters like Jolie. Corano is hot and able to kick most guys asses. I would like to see her do more.",
      "total_reactions": 7,
      "user": "PyschOutBaby"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "I mostly blame the marketing team of Haywire - they'd convinced me I was going to get something between Bourne and Nikita, and I didn't. I accept that's not what the film ever aimed to be, but because of the misleading trailers and publicity I can't help but feel a little duped. What Haywire actually is, is a pretty old-fashioned slow-burning spy movie with the occasional bone-crunching fight scene to savour. All due credit to Steven Soderbergh, the film is shot beautifully (particularly the Dublin sequence), has some nice stylistic touches, and the film as a whole isn't anywhere near as far up its own backside as some of his previous directorial efforts (Ocean's films I'm looking at you!). Gina Carano makes a decent, confident protagonist, and her mixed martial arts background makes the various scrapes that Mallory Kane gets into extremely creative, brutal and entertaining to watch. Michael Douglas also appears to relish his role as a high-ranking government agent, and his performance as an authority figure is very believable now that he's the spitting image of his dad. The rest of the cast I found a little underwhelming, with Ewan McGregor and Channing Tatum coasting, Antonio Banderas playing Antonio Banderas, and Michael Fassbender, though continuing to prove himself as a decent character actor, still slips back into his natural Irish lilt now and again. The actors' failings may have been overlooked had the script been decent, but Lem Dobbs' dialogue leaves a lot to be desired, and is probably the element that detracts most from the film as a whole. The pace of the film is extremely uneven too, and no matter how interesting Soderbergh makes his numerous long takes, you may find yourself pining for a few more all-out scraps. Maintaining a shot for the sake of tension only works up to a point, and after he pulled this trick for the third or fourth time I found my attention waning. I also found the conclusion to this story, which started so well, completely underwhelming. It may be good-looking, well-choreographed, and well-told up until the final act, but in the end, I found Haywire a little lifeless, and occasionally quite dull.",
      "total_reactions": 4,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Gina Carano's acting lowers the quality of the movie and other actors.  That grey sephia film they used throughout the movie made her acting worse.  The director used constant theme music In the background to make walking scenes seem more exciting.  Except for the first fight scene the movie's other action scenes were not up to par with today's movies. Check your brain at the door or save your movie. But I have to mention this old lady in the seat in front me was at the edge of her seat throughout the movie.",
      "total_reactions": 4,
      "user": "wmpa311"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "It's hard to see how this movie did so well with critics when Gina Carano and crew acted like they didn't care and had other things to really be doing. Soderbergh somehow finds it in himself to direct different camera shots of Carano running instead of develop her character a little more with less cheesy lines. The movie is in itself filmed like Ocean's Thirteen, which would be okay if it wasn't an action movie. Not exactly a great eye catcher for the beginning of 2012.",
      "total_reactions": 4,
      "user": "racketracer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I enjoyed the film for what it is - a vehicle to show off Carano's ass-kicking abilities - just like many movies (see: Jeff Speakman is \"The Perfect Weapon\") have done before.  I take issue with Lisa Schwarzbaum's \"calling foul\" upon seeing Channing Tatum beat up on Carano at the outset of the film.  So it's OK for movies to show women beaten, belittled, raped, and tortured - so long as they don't fight back??  How is this movie \"depressing\" for a pro-woman audience?  I loved seeing Mallory Kane beat the living hell out of the guys with a force and kinetic energy that you rarely see presented on screen - even from men.  It's the difference between how an object reacts when it by a 38 caliber round and a 44 cal round.  The 44 doesn't just penetrate - it knocks you down.  So does a full-bodied Carano kick.  Is the acting uniformly top shelf? Is there character development   Hell no.  Did I have fun with this movie?  Of course.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Underwhelming to say the least. Seems like Soderbergh didn't even bother to put an effort to the action scenes and just told Carano to beat the guy up with her MMA skills. At least it was short.",
      "total_reactions": 2,
      "user": "DeathSpank"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Yes, the story of a professional killer (ok, her mission was to rescue someone but deep down she's an assassin) who must get even with colleagues who have double crossed her/him is nothing new but this film just does this with brilliant flair. Gina Carano's performance, Steven Soderburgh's direction and David Holmes music all add up to a perfectly executed piece of entertainment. While completely different in so many ways, this film is equally ranked alongside 'The Artist' as my top films so far of 2012.",
      "total_reactions": 2,
      "user": "ProfLeGut"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Haywire is not just a great action film; its a great film as it acts as a callback to classic 60s spy thrillers while injecting a modern mentality thanks to some truly breath-taking fight scenes and car chases. Haywire is a strange amalgam of Tinker Tailor Soldier Spy and The Bourne Series as it portrays a woman who isnt afraid to throw down but can and will use her intelligence to get her out of a situation or solve a puzzle. The film follows Mallory, a freelance special ops agent as she is framed for something she didnt do and is forced to go on the run and figure out who set her up and why. The film opening scene sets the tone for the rest of the film with a tension and intelligence that is quite unique. The film revels in its brutality but it is never over the top with Haywire still feeling light on action in comparison to modern action films. Its the scenes where she is not engaging in fisticuffs that bring the film to life. Soderbergh manages to ratchet up the tension while maintaining the slick pace and feel of the film. There is a wonderful sense of paranoia running through the film that further emphasises the cold war mentality that Soderbergh is going for with everyone acting as a suspect in the overall conspiracy. The constant questioning of the men we are presented as they interact with Mallory provides for some really great scenes, especially the scenes she shares with Channing Tatum and Michael Fassbender. Carano brings not just physicality to the role (she did all her own stunts and is a trained mixed martial artist) but also sexuality as she toys with the people she meets. Her interaction (as mentioned above) with Tatum and Fassbender is particularly great as she has great chemistry with both of them and it provides a lightness to the scenes that was sorely needed. Gina Carano may not be an Oscar worthy actor but she is a dynamic lead and provides a great screen presence . The rest of the supporting cast work well too with Michael Douglas and Antonio Banderas providing some much needed gravitas. The only person who disappoints is Ewan Mcgregor who seems to rely a little too much on charm as he coasts through the movie. The chase scene in Dublin is some of the finest direction in an action film as it plays on not only Mallorys paranoia but also the viewers. The script isnt brilliant but if anything it does properly bring out Mallorys stoic nature while also showing off her intelligence and sexuality. Its a wonderful character to follow and its surprising (and welcome) to see such a character played by someone other than Angelina Jolie. Haywire is a wonderful film thanks to some ingenious direction by Steven Soderbergh, a great supporting cast and a multi-faceted lead in Gina Carano.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is so BAD that when it ended everyone in the room started complaining. The action is lame, the is no effect whatsoever and it looks like a 16 year old kid recorded it with a camcorder. This is the kind of movie that you want to hit yourself against the wall just because you wasted your time watching it. Just imagine the day when you were really really depressed, you still wouldn't want to watch this movie. There is a scene where the girl is inside the house and then she shows up with her face painted like Rambo - I was like are you kidding me, I have never done even a home video and I would never do that kind of mistake. There is no flow and the story is totally flawed -whoever comments positively about this movie seriously is short-minded or does not go to the theater much.",
      "total_reactions": 2,
      "user": "Ndelvalle12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "This film is utterly unsatisfying.",
      "total_reactions": 2,
      "user": "HDeezy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "The movie is SLOW, it made me struggle to stay awake only after a few minutes into. Scenes drag on for to long, and you ultimatly end up bored. Please note that my bad rating has nothing to do with the actors, I love all the actors, including Gina Carano. Im confused as how they managed to gather so much top a the line actors, for such a mediocre movie. There is alot of dialog, much of it is boring. What sucks the most is that its not Gina Carano's fault. Im hoping to see her in more movies. but Im staying away from European movies for a while. I only gave it the score I did, because it has because of the cast members. If not it would have been a 0.",
      "total_reactions": 2,
      "user": "Rickboy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "A fantastic movie the acting is great. A great action thriller with an end that is very odd and opens up for a sequel the movie in my mind will be the most undeasted movie of the year but Gina Carrono for her first big role was great the best person in the entire movie. I say see it or you'll be missing out on one of the best movies that know one will see so see it ****",
      "total_reactions": 5,
      "user": "Coolguy45"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Good filming for example in Dublin but the scenario and story is really not interesting. Not for the movie theater, better wait it is on TV. It seems obvious there will be a second to follow and get the answer of the first one.",
      "total_reactions": 8,
      "user": "JYT"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "So bad. Great actors not acting so that what's her name wouldn't look incompetent. Total waste of money. Don't bother with it. It's not worth the time or the drive. It's not even worth watching for free at home.",
      "total_reactions": 12,
      "user": "lbl"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Wow! I just don't get how people are judging movies. \"Underworld Awakening\" got what? a 40 something grade and it was an awesome! action packed butt-kicking movie, and in contrast Haywire gets a score like 67. How do i start with the bad news? It was boring at times, with corny music and not very good action scenes. Gina Carano and Channing Tatums acting is pretty horrible, and was I the only 1 that thought this story is a bad copy-cat of like 3 other movies in recent years. I just don't get it, how this got a 67. I honestly would give this a 30 out of a 100 on meta-critic. And that's only because I'm such a big fan of Ewan Mcgregor.",
      "total_reactions": 9,
      "user": "MixedNuts"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "You know there's something's wrong with an action-thriller when you don't really care who lives and who dies. This is not a bad film per se but a decent plot  might have helped.",
      "total_reactions": 3,
      "user": "olympians"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Basically everyone who gave this movie a bad review is brainwashed by Hollywood. Probably people who liked Mall Cop or something, and people who don't like seeing women kicking ass. If you want to leave the theatre satisfied and thinking \"Wow I just saw a really good movie\", go see it. It's a totally unconventional action movie, simply great. It feels 'realistic' in a human condition.",
      "total_reactions": 3,
      "user": "Soulshock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Brilliant. Regular action heads might be confused by Sonderburgh's arty approach. But there's always a hackneyed Van Damme B flick for them in the wings. Must admit I was a little confused by the plot twists and turns sometimes, but throughtly enjoyed it from beginning to its cool close. Talk about edge of the seat, tense action driven by a hip soundtrack. Super cast and had no problem with Gina Carano as a smart heroine rooting out corruption.",
      "total_reactions": 1,
      "user": "movieboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Saw the movie and wasn't expecting much due to the reviews on meta. But I have to say Gina Carano was great as the lead - the action was great, the stunts were as you would expect ---  really well done and realistic. She fit the role perfectly vs. an angela jolie type who looks breakable from one punch. It was a strong move to cast her in this role. All of us thought she has a big career infront of her. It's definitely a different type of action film, from look and feel, to plot structure vs.  traditional action films. The plot keeps you guessing for awhile as you try to put the pieces together. At the end you really have to start paying attention. A fun movie definitely better than a Mission Impossible to me and really refreshing to see some action like that.",
      "total_reactions": 1,
      "user": "morgansage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Although the film is flawed, I thought Gina Carano was terrific.  Unlike many female action stars she actually has a personality.  She smiles at times and comes across as human, instead of a killer machine.  The movie was WAY too complicated with that horrible technique of going back and forth to different time periods.  Ever since Pulp Fiction writers and directors can't seem to get enough of it, and it's getting annoying.  The only thing I liked about the film was Carano, and she made it just good enough to recommend.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "I LOVE a good ass-kicking movie.  It can even be a fairly bad movie from the story perspective, as long as the action is tight! Itâ",
      "total_reactions": 1,
      "user": "BadMovieLover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Well she certainly can fight, and despite being beaten to a pulp, often, she only has a few bruises to show. Unfortunately she's stuck in a silly movie that panders to adolescent fans. Nothing wrong there had this been a B movie director not Soderbergh of Michael Clayton and Syriana fame. This time he gets some famous buddies to take on cameos so he can showcase the fighting chops of his MMA champion. The dialogue is dull, the holes in the plot are truck size and it's all just an energy bunnette flic without even humor to redeem it.",
      "total_reactions": 0,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Saw it a week ago and cared so little I'm just getting around to reviewing it. Tired formula that still works for guys action flicks... when its done well.   But, (and this is an \"big butt\") unless your a butch feminist who wishes Dirty Harry were a woman... your not the target audience. A few big name actors with passable performances but none of it was compelling or convincing. Wait for the small screen.",
      "total_reactions": 0,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Just got home from seeing this movie.  It's a slow time for movies, and there wasn't much else out there worth seeing.  This got good reviews, so I though I'd try it.  The cinematography was excellent, the music and sound effects were terrific as well.  Sure, it was an effort to follow the actual story, but that made me pay attention.  If I wanted mind numbing dumb action I would have seen Underworld.  But overall, a pretty good movie for those of us who still have attention spans in this day and age.",
      "total_reactions": 0,
      "user": "pete409"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Haywire will not be remembered as Soderberg's best piece, but  watching Carano kick, choke, crack and crush men about twice her size in a rampant revenge story is thoroughly entertaining.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I have come across several of these films with a decent cast but I well know that this is no guarantee of a decent film. Yes, the fight scenes are pretty spectacular, but no more so than those in the",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "It's okay, but nothing impressive.  Steven Soderbergh can do better, and I'm disappointed that he didn't.  There was a good movie to be made here, but somehow Haywire fails to effectively connect the dots of its disjointed story.  It wasn't a waste of time, but I didn't feel like I was ever really drawn in to care about the main character (who is played by Gina Carano - she turns in a decent performance).  Simply put, Haywire is the espionage cousin to Ocean's 11 without the swagger and charm.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Gina Carano, a famous MMA fighter, has thrown her hat into the action star ring. Under Steven Soderbergh's direction, she got stuck in a lackluster plot of international intrigue. He's surrounded her by a strong cast (Ewan McGregor, Michael Fassbender, Channing Tatum, Michael Douglas) to help boost her adequate acting. Unfortunately, much of the movie's time is spent with low-key dialogue and uneventful chases. The infrequent fight scenes are well-staged, but not especially original or impressive. Soderberg's detached style doesn't blend well with this genre. As a result, there's too much mediocre activity and not enough action.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Very boring movie but it is still a little bit interested. I love seeing Gina kick some ass in this movie. This movie was very disappointed. A very slow pace action movie. I did fall asleep on it. The fighting scenes with Gina did wake me up. The plot in the story was decent and good directing. I wouldnt suggest this movie to any one.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Haywire is a fun action movie. The star studded cast and notable director give it a bit more kick than the usual fare. Still, despite the general quality of whats' on offer, the film doesn't escape it's own vapidity. Haywire is fun but it isn't meaningful in any way.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Maybe it's Soderbergh's taste in action than any typical action movie. Boring? Check. Lame dialogue and background music? Check. Kick-ass Carano? Check. Action? Double check.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Haywire has style, almost too much style.  Since it is a Steven Soderbergh film, a certain amount of gloss and creative camera shots are expected, but Haywire has more gloss and polish than average.  It also has in-your-face brutal violence.  There are relatively few firearms; the violence is one-on-one mortal combat to the death between somewhat evenly matched opponents, even though one of the fighters is a woman.  It",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Putting in mildly 'Haywire' is a major disappointment! All the marketing i.e advertising and basic hype indicated that we were going to get a female Bauer or Bond unfortunately we get no where near those bad asses! I was excited for this movie but it just never got going. People may criticize Angelina Jolie as a female action star but the woman knows her stuff and has the Hollywood, blockbuster appeal. Gina Carano  sadly doesn't. Yes, she is a fighter but an actress? And that's the main problem with the whole film. She lacks the conviction and chrisma as an actress. That aside, the plot seemed enticing. An ex-black ops soldier sets out to avenge those who betrayed her during a mission unraveling the conspiracy in the process. I was fooled! Actually, the film was sold on the premise of unfair and unmerited comparisons because where the likes of Bauer, Bond and Bourne all exceed in the genre this film fails. Apart from the brutal and at times barbaric fight sequences it's all meaningless. It's very lightweight in that department because it doesn't draw you in which I was surprised at given the nature of the cast. Ewan McGregor, Michael Fassbender, Channing Tatum, Antonio Banderas and Michael Douglas are all in the movie so you would have been forgiven for expecting a good movie. Ultimately I found Haywire to be a huge letdown and an opportunity gone begging, they had the star names in abundance to succeed however they delivered nothing more a mediocre movie at best, great shame!",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Before watching this I'd never heard of it nor the lead actress, so wasn't expecting much from it... and then I was totally blown away by the fight scene realism and a decent story to boot... One of the best female action movies I've seen in a very long time that didn't rely on stupid CGI and wires to pull off the choreography",
      "total_reactions": 0,
      "user": "HighwayUK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "I don't care who you are. Casting a fighter as the lead in an action film is always a bad idea. Casting Channing Tatum is usually a bad idea. Having Steven Soderbergh direct a action film is sometimes a bad idea. Put all three together and your doomed! Wait, it's certified fresh on Rotten Tomatoes! Let's just ignore that fact because this film just suck!",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "This came as a bit of a surprise to me as you almost never find a movie as good as this in January. I realize that critics clearly enjoyed this more then people which should say something. That this movie was marketed as something completely different then it truly was. I realize this is the case with all of the director's work. The same thing happened with Contagion and Magic Mike which I both liked very much. So if you ever plan on seeing this movie, don't believe what the trailer tells you. This is a very odd film. Yes it's an action film but it's different than what you're use to, which is why so many people disliked it. I can't explain it but it's just different and I'll admit, it did bother me too. The music does not fit the movie at all. I'm not sure what the director was trying to do here but 90% of the music was this weird 70's jazz music that you would find in a spy movie from that period. Whatever the case, it was annoying and sometimes took me out of the movie. These were really the only things that bothered me. I mean the director choose to shoot the movie in a variety of ways, some shots work, others don't, but it didn't bother me much. It might be off-putting to some of you though and that's one example in which I said earlier that this movie is different. It's not shot in a way your typical action movie is. So despite those problems I enjoyed everything else. The action is fantastic, it's very well choreographed. There's no music accompanying the action scenes which make them seem more realistic and thus, another example of how this is different from your typical action film. The story is nothing new, this is after all a revenge flick, but the director adds enough of his visual flair and fresh ideas to make this movie stand above your typical revenge flick. The cast is solid and for a first time performance Gina Carano was not bad. Was it a terrific performance? No, but she has potential. She would make a good Wonder Woman but that's just me. I hope she gets more roles because watching her kick ass was definitely worth the price of admission. The other person worth noting is Channing Tatum. This has been a good year for him in both in terms of box office and career. Now, I haven't seen The Vow and I don't have any intentions of seeing it anytime soon, but he has definitely reversed my opinion of him. With this, 21 Jump Street, and Magic Mike, I can't believe I'm saying this but, he can act. I hope now he decides to pick smart scripts and make smart choices because he has finally proven(it's been like what 6 years?) that he's got the chops. Overall, a nice surprise since normally January is considered a dumping ground as a majority of the films are Hollywood rejects. This is another great movie from a great director who has been having a good year himself with this, Magic Mike, and last year's Contagion, he's slowly becoming one of my favorite directors. Sure this movie is very different, the music doesn't fit it at all, there's no music during the fight scenes, and some of the shots work better than others. However, the action is nice choreographed a nice-shot, no shaky-cam, the cast gives solid performances and how could you not find Gina Carano kicking ass not exciting or hot?",
      "total_reactions": 0,
      "user": "Coco890"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "I can't understand how anyone enjoyed this movie. It was so slow, and dull. I am a huge MMA fan so I watched this because of Gina Carano. Boy was I disappointed. Glad I only rented it from red box for a dollar.",
      "total_reactions": 0,
      "user": "Veritas34"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "What do you get when you cross great Soderbergh cinematography with bad porn acting and script?",
      "total_reactions": 0,
      "user": "YossGold"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "This was a fascinating action film. It has more than its fair share of violence, which usually doesn't appeal to me, but the violence is so intrinsically linked to the plot that the movie just would not work without it. The heroine of the film is an ex-Marine who can put James Bond to shame. She's strong, beautiful, and fearless, and has catlike agility and intuition. The violent scenes are mostly her beating up all the men who try to betray her, subdue her, or hire contractors to kill her.  She always triumphs over them--she is invincible.  She ends up killing a couple of them, which is probably not necessary--women usually are a little more forgiving than that, although it should be noted that every character she kills was someone who tried to kill her first. From a purely feminist point of view, this movie is an important addition to the canon--no helpless females who have to count shrill, convincing screams as being an important part of their acting skills. (I've never screamed in my life, so why are actresses always screaming?) The character of Mallory Kane is played by newcomer Gina Carano, who in real life is a renowned expert at Muay Thai, the official sport of Thailand, a martial art that is basically a form of kickboxing. Muay Thai was Carano's primary claim to fame before her breakthrough role in Haywire. She is all muscle and guts--I don't think she needed a stunt woman to double for her in any scenes.  She makes Angelina Jolie look like a princess. The film also marks Michael Douglas's comeback after his illness. He looks better than ever in the role of Coblenz, the only disappointment being that we don't get to see enough of him. It's an easy and small role for him, but he was still extremely effective, as was Antonio Banderas, also onscreen too briefly, and Ewan McGregor, who plays a surprisingly ambiguous character despite his conservative, clean-cut exterior.",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "An enjoyable, if formulaic spy romp with some great fight scenes and a strong female lead. The shaky cam style works in the film's favor. Just don't expect too much from the plot.",
      "total_reactions": 0,
      "user": "mthrl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "To put it simply it's a B-movie. For the entire film the audience is unsure of particular motives and plot details until the end with the reveal from McGregor's character. It made the movie confusing, and the introduction of new characters cheesy. Like when another character makes a reference to a mysterious \"Paul,\" a character we haven't seen yet. I don't know, it just kind of comes off amateurish. Also the acting and writing were very average. Carano wasn't convincing and the others were just very average. And with the writing, what is with the sex? They mold this character into a sex symbol who kicks ass instead of creating a character much more original than that. The audience doesn't need sex, it needs interesting characters with justified motives. Overall like I said, it was just an average, b-movie, action movie.",
      "total_reactions": 0,
      "user": "ChuckPalantine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Soderbergh is good at directing great actors such as Michael Douglas and Ewan McGregor, but this film lacks entertainment. Haywire is one of the few movies to escape in January.",
      "total_reactions": 0,
      "user": "rydermusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "What does it take to make an action film? Well, apparently it's plenty, looking at the failure of this film despite its pedigree.  Gina Carano has the physicality but all her action scenes are shot in an anemic fashion. Critics call it 'less confusing', but to me it's boring. Soderbergh may be one of my favorite director, and yes this is a 'bold' experiment for him but he is no action director. If you want to see a 'similar film', see 'Salt'. It's far more exciting than this snoozer",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Hell has no fury like a woman scorned! Haywire is sweet eye-candy for MMA fighting fans. This female may be the next Bruce Lee for lady fans. She's in control and commands the screen when she battle's. If Gina Corano can turn men on with her sexy brawling style, then she may be around as long as Mila Jovovich and replace her. Women will love her defeating a man's world. Soderbergh direction copy Ocean 12 and Bourne",
      "total_reactions": 0,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "I liked Gina Carano in this film and she looked like she was actually kicking the crap out of everybody unlike other female action stars (Angelina Jolie). However, they tried to cram so much plot into a movie that lasted an hour and thirty minutes that it feels disjointed and messy. Also, the theatrical score was horrid and really distracted me throughout the film. It almost sounded like 1970's porn music.",
      "total_reactions": 0,
      "user": "MX312"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Soderbergh, perhaps in a misguided attempt to show that acting isn't so hard fails spectacularly with this lifeless film. The limp narrative, all too familiar elements of the genre, and acting limitations of the lead keep Haywire from thrilling at all. Carano deserves praise for her impressive stunt work in what seems like a direct rebuke of the camerawork and editing of the Bourne series. This was a sizable disappointment from one of the best directors today.",
      "total_reactions": 0,
      "user": "DTPatterson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "I am going to say this once it was ok but not worth paying for what so ever. The plot was simple and had a strong cast to make it great, but it never did. The fights felt amazingly lackluster, the music threw off the mood of the film almost as if it were an an 80's montage of action films and the editing was very poorly done. The movie progressed to nothing really. So no I would say wait on this one and rent it.",
      "total_reactions": 0,
      "user": "Viciouslight"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "â",
      "total_reactions": 0,
      "user": "chrisv39"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "The world of espionage has changed, it is now mostly ran by private contracting firms. Firms about liability clauses and the money that comes from ignoring due diligence. Along with that sort of money comes smarmy bosses like Kenneth (a resplendently despicable Ewan McGregor). Mallory Kane (Gina Carano) is tired of Kenneth, his lackeys and his poor work ethic. Trust is a valuable commodity in her field and trust, it seems, is in short supply. So she is getting out for good. Or so she thinks.",
      "total_reactions": 0,
      "user": "nevermindpopfil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "This film is only 90 mins so the 30 mins I watched were a whole 3rd of it and in that time nothing happened to draw me in. There is no real introduction, it just throws you into the story with more random cut-aways than family guy and no idea what the hell is going on. There's annoying cheesy 80s style background music most of the time and the fights are more 'wrestley' than actually punching or shooting each other, not that there seems to be many fights, just a lot of talking.",
      "total_reactions": 0,
      "user": "SwarleyStinson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "I really enjoyed Haywire. It may come across as your typical spy-movie, but everything works so well in the film, and it pulls it off. A good story with an excellent supporting cast make this an entertaining, intelligent movie. Sure, Channing Tatum and Gina Carano aren't the best on-screen couple in the history of Hollywood, but hey - give her a break! This was her first major acting job!! For not having the experience that someone like Ewan Mcgreggor has, I thought she did a fair acting job. And she makes up for her shortcomings by her kick-ass fighting scenes which should be reason enough to see this film. Honestly, If you are a looking for a smart and edgy Bourne-style thriller - this is your movie",
      "total_reactions": 0,
      "user": "muzicman17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "The only good thing about this movie is the music. Otherwise completely forgettable. The fights have been clearly adapted for Gina Carano and looked to me too much as a wrestling match. Which in itself would have not been bad if the said actress could actually act. The plot is boring and the motivation of the characters unclear.",
      "total_reactions": 0,
      "user": "Tara61"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "I liked it, loved that I believed the lead would kick my ass one handed (Carano does just fine, and better than some actors who get regular work), and Soderberg did some pretty good work with the camera.  Fight scenes feel like they hurt which is good for a fight movie.  However, the whole thing ends up just a little off, mostly because some sections that pop up occasionally (loud music drumming with no other sound) - the style gets in the way.  Can't fault them for trying some things, though, and if the trailer interests you, you'll probably enjoy this, at least a bit, and maybe more.",
      "total_reactions": 0,
      "user": "weddingsinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "If Soderbergh was going for a female Bourne type character, a Ted Lewis type thriller and a Louis Leterrier action genre, all the while keeping it Soderbergh, he succeeded. Gina Carano makes Angelina Jolie, Zoe Saldana and Jennifer Garner appear to be cartoon characters when it comes to fight scenes, and I like all three of them. She has the physique that makes her believable as a former special ops character; the parsimonious dialogue and superb fight choreography was a wise choice, Carano has not yet earned her chops as actor for her to get more than she had to speak here. If you're looking for a smart action thriller, a movie fix you need to satisfy from time to time, this movie should do the job. The movie starts and ends abruptly with one spoken word, the same word; that one word at the beginning takes one fight scene, a minute or so into the movie, no less striking than in the Bourne movies, to realise how well chosen it was. At the end, when the bad guy simply sees Carano and utters that word, you don't need to see another fight scene, you can imagine it vividly; that's the mark of a smart script and directing.",
      "total_reactions": 0,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Gina Carino really holds her own as the only female character, delivering a solid performance",
      "total_reactions": 0,
      "user": "amiee1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "This movie wont win any awards for being overly complicated. The plot is simple. The action, on the other hand, is where the movie excels. Gina Carano beats the hell out of anyone and everyone who challenges her in this movie. I have a new female crush--call me Gina. The part where she beats the hell out of Ewan McGregor in that sexy ass wet suit took the picture for me. The film starts out confusing, then slowly reveals whats going on. There is little to no background music, which gives the film a surreal feel to it. Also, in Soderbergh form, the film deals heavily in dialogue for some parts. Soderbergh is pretty good with that, because the dialogue feels natural. Overall, Haywire is a pretty good movie for people who like action. The action is different in the fact that it is raw and realistic. The fight between Michael Fassbender and Gina is actually realistic. In the special features of the DVD, they show them actually fighting and doing all of the stunts themselves. That adds to the realism.",
      "total_reactions": 0,
      "user": "Fullmetal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Steven Soderbergh's Haywire ends up being an exercise in genre, but a shameless and self-aware one, kind of like a less-violent (and not-as-good) Drive. Carano makes for a surprisingly good lead and even though she kind of pitters out in dialogue heavy scenes, she makes up with nuance when she's not talking and by dealing exhilarating fight scenes in spades. It is reminiscent of the Bourne movies in style (with Soderbergh credited as the director of photography under an alias) and has the same pulse-pounding pace. While certainly not an action classic, 'Haywire' is entertaining and stylish enough to divert us while not killing our brain cells.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "I'm quite surprised at the strong critical reception to this film, as on the whole it left quite a lot to be desired. Soderbergh certainly lends his extremely creative, quirky skill in appropriate ways (the action sequences are rather unconventional and very well shot), but it's abundantly clear that this movie was written solely around Carano's fighting skills, which is a blessing and a curse. Anyone who has followed her career knows that she is an extremely capable fighter, and she shows off her athletic dexterity admirably and believably in the film. She's a much more believable action star than, say, Angelina Jolie, and it's exciting to witness her antics with her numerous male adversaries in the film. However, given the bland, generic storyline (you've seen it a million times before) coupled with very poor writing and lack of true suspense, the film ends on a very dull note. Finally, and perhaps most importantly, is the fact that Carano is an absolutely terrible actress. She just had no idea what she was doing, and she lacked even the slightest emotional connection to her role. This really is too bad and the film would have gained a lot if she had been more prepared. If she wants to continue her film career she's going to have to invest a significant amount of time in some proper acting training, as her performance was about as animated as a cardboard box",
      "total_reactions": 0,
      "user": "blueforest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "I was really looking forward to this, there just aren't enough movies where a woman gets to run around kicking ass and always makes a refreshing change. The fact that this has a genuine cage fighter in 'Gina carano' should have made it even better. But, oh dear! Once again soderbergh can't help but express his art house tendencies, ok so the plot was thin, but done right the 'point blank' revenge thriller can still be entertaining, but soderbergh does his best to wring out any excitement or adventure, probably because he thinks it would make the film too cheesy, so we get slow, awkward scenes, that lack any atmosphere. The use of god awful jazz for the score throughout doesn't help. As for the acting, all things considered i would say carano can hold her head high, but for some reason she manages to drag the 'proper' actors down, this is without doubt ewan mcgregors worst performance. He's main scene in a room with carano has to be seen to be believed. Overall, a wasted opportunity.",
      "total_reactions": 0,
      "user": "Goodfella"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "The marketing behind Haywire is just embarrassing, and that's probably why the film was seen as a mixed bag by audiences. The trailer promised a kick a$$ action movie, yet what we got was totally different. Nothing interesting happens in this movie. It's all bark with very little bite. Some of the fighting sequences are ok to look at, but when they're over, it's back to the uninteresting story. One thing that I thought was weird was the film's attempt to be stylish at a point or 2. This is weird because it conflicts with how serious the rest of the movie takes itself, so some scenes just come off as unintentionally laughable. It's not a bad movie, but the marketing pretty much ruined it.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This is a thoroughly decent movie. Yes Ms. Carano is a little wooden in rare moments, but there is a good supporting cast. The music gives it a retro/throwback vibe, cinematography in some shots is beautiful and the action has a real earthy feel to it. The fact that the lead is a kick ass woman also does not hurt.",
      "total_reactions": 0,
      "user": "KeanosMagicHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "While its lead character may seem a little too plain, \"Haywire\" is still a reasonably entertaining thriller with some impressive set pieces and action.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I wanted to see this film because I was intrigued by how much audiences panned it (40% user rating on RT). After finally seeing it, I'm very shocked by its negative reception. I personally think there's a lot of fun to be had with this film, and Soderbergh's touch is evident throughout. The plot is a bit heavy at times, but the action, direction, cast, and acting are all solid. Gina Carano's lack of acting experience is apparent in many scenes, but she carries the film extremely well nonetheless. A solid, entertaining, thriller.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "A solid film from Steven Soderbergh.  He continues to pack his films with really good acting talent and with the addition of Gina Carano the action really works.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Nunca vir um filme tão podre como esse. Gina Carano está excelente é uma bela atriz nos dois sentidos kkkkkk,mas o filme é fraco,sem sentido,sem vida,sem coerência e sem empolgação. Michael Fassbender,Ewan Mcgregor E Michael Douglas também fazem um excelente trabalho mas o filme não funcionar",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Podre pra kralho................................... Gina Carano é super simpática,talentosa e muito gostosa.... Mas que filme sem sentido sem vida é um prato cheio para suícidio",
      "total_reactions": 0,
      "user": "Zanessa250QI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "Oh............... **** of movie ................. Tedious an boring made me want to commited a suicide... Sorry Gina carano but this movie doesn't work.",
      "total_reactions": 0,
      "user": "raciocinio"
    }
  ],
  "metascore": 67,
  "name": "Haywire",
  "num_weekends": 9,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 1,
    "year": 2012
  },
  "opening_weekend_income": 8425370,
  "opening_weekend_income_currency": "$",
  "rating": 5.8,
  "rating_count": 74032,
  "rating_freq": {
    "1": 3360,
    "10": 2450,
    "2": 2438,
    "3": 3786,
    "4": 6797,
    "5": 13118,
    "6": 18647,
    "7": 14908,
    "8": 6571,
    "9": 1957
  },
  "release_day": 20,
  "release_month": "January",
  "release_year": 2012,
  "user_review_count": 400,
  "votes_per_demo": {
    "aged_18-29": 19907,
    "aged_30-44": 35765,
    "aged_45+": 9466,
    "aged_under_18": 37,
    "females": 8817,
    "females_aged_18-29": 3260,
    "females_aged_30-44": 4051,
    "females_aged_45+": 1127,
    "females_under_18": 7,
    "imdb_staff": 10,
    "imdb_users": 74032,
    "males": 57813,
    "males_aged_18-29": 16462,
    "males_aged_30-44": 31264,
    "males_aged_45+": 8190,
    "males_under_18": 29,
    "non-us_users": 40747,
    "top_1000_voters": 468,
    "us_users": 15313
  },
  "year": 2011
}