{
  "avg_rating_per_demo": {
    "aged_18-29": 6.1,
    "aged_30-44": 5.9,
    "aged_45+": 6.0,
    "aged_under_18": 6.2,
    "females": 6.3,
    "females_aged_18-29": 6.4,
    "females_aged_30-44": 6.1,
    "females_aged_45+": 6.2,
    "females_under_18": 6.3,
    "imdb_staff": 5.7,
    "imdb_users": 6.0,
    "males": 6.0,
    "males_aged_18-29": 6.1,
    "males_aged_30-44": 5.9,
    "males_aged_45+": 5.9,
    "males_under_18": 6.2,
    "non-us_users": 5.9,
    "top_1000_voters": 5.6,
    "us_users": 6.2
  },
  "avg_screens": 1143.142857142857,
  "budget": 75000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 2,
    "year": 2012
  },
  "critic_review_count": 282,
  "duration": 110,
  "genres": [
    "action",
    "drama",
    "fantasy"
  ],
  "gross_income": 83503161,
  "max_screens": 3120,
  "mc_avg_user_score": 5.8,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 117,
  "mc_movie_name": "Immortals",
  "mc_negative_rating_frequency": 47,
  "mc_positive_rating_frequency": 108,
  "mc_pro_critic_reviews": [
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 88,
      "summary": "Dashing across the screen in all its bloody, gilded glory, the awesome and beautiful Immortals marks an all-win scenario."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "Spectacle and spectacular are often confused for one another in stories of epic adventure, but Immortals is the rare film where they are one and the same."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "The film is as faithful to Greek mythology as Thor is to tales of the Norse Gods, but it ultimately doesn't matter. Tarsem's goal is to give viewers an experience a little different from the norm and, to that end, he succeeds. The \"wow!\" factor is in full evidence."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "What saves Immortals as a moviegoing experience is the exuberant, kid-in-a-candy-store virtuosity of its director, former music-video wunderkind Tarsem Singh (The Cell)."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 67,
      "summary": "As mythic spectacles go, it beats \"Clash Of The Titans,\" particularly in the areas of intimidating villainy and actual Titan-clashing. Nonetheless, it isn't any smarter than its inspirations, just prettier."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 63,
      "summary": "Thrills are in short supply, but so are annoyances. This is a maintenance-free ride."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "It won't do anything to win over those not already partial to Tarsem's style, but it has more than enough blood, guts and glamour to satisfy – and Cavill looks like a superman."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "The filmmaker's work is infinitely more exhilarating when he's relieved of the need to be in any way serious. He should play dumb more often."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "Despite this new expansion in scale, Immortals lacks the inexorable forward momentum of its role model \"300,\" as well as that movie's audacious, gleeful fascism and oblivious, accidental homoeroticism."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "A popcorn movie has one goal, and that's to entertain. Immortals meets this criteria handily, and serves as a splendid spectacle besides."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "The pity is that Tarsem's intelligence doesn't connect his cinematic eye to his narrative mind. The director's visual gift is like a brilliant retina, detached."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "Given something as simple as Theseus's rousing prebattle speech, maximalist Singh is helpless, but when he gets whole armies in on the act, you've got something to behold."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "If it's violence ye seek, and violently confused storytelling, look ye no further."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "I realize that making Immortals immortal was way too much to ask, but frankly, just a shade more plausible, not to mention pleasurable, would have been nice."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "What undercuts sharper than Poseidon's trident is a script that sees its characters as cardboard, not flesh and blood. For a film meant to be spectacle over substance, it's not a fatal blow. But it is a mortal wound."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 40,
      "summary": "Immortals is not only entirely without humor, but is dominated by a lot of huffing and puffing, thunderous self-importance and windy Socratic quotations about the immortality and divinity of men's souls. You just have to roll your eyes after a while."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 40,
      "summary": "Navigating the film's mounting erotic bloodlust proves tedious, until the show-stopping final battle between gods and Titans in one chamber, Theseus and Hyperion in another, at which point logic melts away completely and the pic's raison d'etre emerges -- namely, to justify staging a fight scene for the ages."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 38,
      "summary": "The movie's self-importance is further inflated by the usual pseudo-Wagnerian score and occasional narration by John Hurt."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 38,
      "summary": "The Immortals is without doubt the best-looking awful movie you will ever see."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 38,
      "summary": "The film manages one grand \"300″ moment, Cavill rallying troops for battle, doing his best Gerard Butler. But the lack of humor, the confusing, stumbling story and limited color palette blunt the film's 3D slo-mo shots of heads exploding and torsos torn asunder by the sword."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 30,
      "summary": "The Greek myths, of course, will endure. The same cannot be said for Singh's silly, self-serious, instantly forgettable, and inaptly named Immortals."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 30,
      "summary": "This never rises above the level of a plodding sword-and-sandal adventure, peopled with chiseled young beauties and bored industry hacks. Singh is a talented and eccentric visual artist with no creative future in the movie business."
    },
    {
      "critic": "Paul Brunick",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 20,
      "summary": "Immortals is the latest disaster of post-conversion 3-D, a projected spectacle so dark it is literally hard to see. This is an ugly, burlap sack of a film, stitched with jagged seams and overstuffed with computer-generated chintz, gold-lamé leotards and fetishistic headgear."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Whoever doesnt know or ever read greek mythology this movie has some action elements to be liked.",
      "total_reactions": 2,
      "user": "Azatis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "Immortals is what can only be described as a mess. The acting is poor, the plot is thin, dull and poorly executed and the script is the worst I have ever encountered in a profesional film. Even the films one the redeeming feature - the action - is often flat and dull. There are only two good things in this film.  The first is the action scenes involving the gods which are exciting, dramatic, fast moving and satisfyingly gory but far far too brief. The second is the performance of Mickey Rourke as the evil king Hyperion who is easily the best actor in the whole debacle. The main con is the acting ability of all the other actors which makes a plank of wood look like Laurence Olivier. Theseus is played by the typical good looking guy who clearly feels that muscles are a fitting substitute for performance and John Hurt, who is a generally a very good actor, is woefully misused. It is difficult to point out a single actor who acted in any way which didn't seem forced and unreal. However, this may not be their fault as the characters are given the depth of a thimble of water by the script and I imagine it must be hard to work well with a script that is so badly written that it would embarrass a ten year old. Several times, throughout some of the \"profound\" speeches the characters gave I actually got goosebumps, not because it was such a poweful use of the English language but, because it was so cheesy that it made my skin crawl. This similarly applies to the sex scene which was so completely random and seemed shoe-horned into the film just because every film should have romance. This brings me to the plot which was so predictable that you didn't need to be Nostradamus to stay 3 steps ahead of it. It really does seem like like the creator picked up \"Ancient Greece for Pre-School\" at a book sale, scavenged some names from it and mushed them all together rather than having any clue about what they are famous for (Eg: Since when was Theseus a bastard? and wasn't Hyperion actually a Titan himself?) but lets just skip over my gripes as to how the film was unrelated to Greek mythology in almost every way as to most readers that will be rather boring. The final nail in the coffin was that the battle scenes, with the exception of those previously mentioned, seemed rather unoriginal, flat, and, dare I say it, boring. Never have I been less interested in the clash of two great armies. Similarly the pre battles speeches had none of the badass attitude or brevity of \"Tonight We Dine In Hell\" and none of the epic grandeur of the speeches in Lord Of The Rings', instead they just sort of fizzled out in banal nonsense. If I, sat safely in my cinema seat, thought that the supposedly rousing speech was terrible and that the person giving it had the charisma of plague victim then how can we be honestly expected to believe that it could inspire men to charge into almost certain death? Quite simply this film was terrible and I would honestly encourage you not to waste your money and if you really must watch it then buy it cheaply from a bargain bin.",
      "total_reactions": 2,
      "user": "Seraphiel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Sincerely, this movie is simply disgusting. Top contender for: most fake sunsets (really bad lighting of the sets), ridiculous and over the top costumes (mask of Minotaur?), silly story (why Perseus is in that story at all, if story resolution does not depend on him?), bad acting and zombie like titans (really, is that 28 Days Later?).",
      "total_reactions": 2,
      "user": "dj1982"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "With a budget of 75 million dollars, with a biceps ala Henry Cavill, the film has made somewhat good job, making profit of 200 million dollars.",
      "total_reactions": 2,
      "user": "alx93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Not a bad movie, but not good either. Full of cliche scenes and hillarious costumes, also the 3D effect wasn't the best (even commercials before the actual movie were way better). Let me just say that I had never fallen asleep (twice!) on an action movie before this one. Deffo worse than Clash of the Titans.",
      "total_reactions": 1,
      "user": "Rewo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "Had high expectations! Set myself up for disappointment. Never again will I get hopes up for another film because of this one. It spoiled my appetite. I'll remain neutral from now on...no matter how HYPED trailers look better than movie. Dry slow to a crawl direction and acting. Only one spectacular scene with Zeus fight",
      "total_reactions": 1,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "Let me begin by saying that I love \"300\", a film that has style, substance, plot, decent acting and engaging dialogue. Immortals has none of these. it is without a doubt the worst film that I have seen in many years. So bad that I have got off my lazy ass to sign up to this site to say just how bad it is...",
      "total_reactions": 1,
      "user": "Xorse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "This movie was recommended by a good friend, after having watched it i know that he was wrong. A movie without emotion and feelings. The story is one we've seen many times before, there's noting new and everything ends as you think it will. And the most important: a lot of things happen for no reason, like in most of the movies we see nowadays.",
      "total_reactions": 1,
      "user": "Shechu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "If you like this genre, you should enjoy this film.  It was too dark (literally and figuratively) for my taste and the spurting blood gets to be old very quickly.  It says a lot about a movie when you are relieved to see the credits roll.",
      "total_reactions": 1,
      "user": "DTDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "My opinion about this movie is very poor i mean  WTF ! Greek god who looks like an \"Power Ranger\" is this a parody or a serious movie ?? .... Greeks who know wrestle really ?? The movie  is just big amount of money putted in effects and fights and i they are not even putted in something new and creative they copy almost everything from \"300\" it's not a big deal but at least do it right they even fail in imitation off  the scenes.There is no creativity no new ideas they say \"Hey i saw that in movie lets put it in our movie and see whats happen\" but that's not the way. You will lossе interest in the movie with every minute you watch.The main character  as usual is a guy full with cheats like \"Infinity ammo\" \"Flash\" \"Extremely big stamina\" . The movie is disappointment for me and it's a waste of time they use a good trailer to attract viewers who will watch a movie full with lame ideas and poor plot that's my opinion .",
      "total_reactions": 1,
      "user": "SmileATT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "I get existential when a movie is THIS bad. why... why did the make this? why did I watch it? why are things the way they are and no one expects more? LOL a very bad movie bad acting bad story... just retarded. its like they took all their cues from those never ending resident evil movies",
      "total_reactions": 1,
      "user": "iplayandwatch"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Haha. What the **** Just simply, what the **** Don't get decieved by the posters ladies and gentlemen. Tarsem Singh's \"Immortals\" isn't exactly like \"300\", although it tries to be with it's rich visuals. It can never be like \"300\" because of the crappiest Greek God script I've seen in YEARS. What kind of ****ing story flushes down characters like **** and adds fight scenes every 5 seconds? Haha, the movie gave me a good laugh though.",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "One word : mediocre, the word says it all, this movie is bad from the beginning to the end, the characters are flat, the sex scene is completely useless, the gods looks like idiots with their golden suit, the story could have been interesting but is very poorly developed (all the hype around the Hyperion bow(something like that) is never exploited ), the fight of the gods against the titans is just ridiculous because they are only some sort of fast moving martial art practitioners and I expected them to have some sort of powers like Zeus shooting lightning bolts or Poseidon using water but no it doesn`t happen. Overall, this is just a bad movie, too much focused on blood scenes and not enough on the rest, it had potential but it`s only a ridiculously bad version of God of War.",
      "total_reactions": 5,
      "user": "stax345"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "A decent flick; nothing special at all. The acting was average. The story was a bit boring: what ruined it the most (for me at least) was the romance between the protagonist and one of the main characters. I find that it was unnecessary. In this day and age, however, romance is a must, so I can't remove points there. Plenty of action scenes as the trailer suggested, except that most of them were dull, save for the one right at the end. The characters were flat: they were all either passive or aggressive, so all of them were quite extreme. I found the main villain rather engaging, but that's up to you to decide. The acting wasn't too shabby. The ending.. wasn't too good. All in all, a pretty regular movie, as expected from Hollywood these days.",
      "total_reactions": 13,
      "user": "Cyph0n"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "It's obvious that the filmakers behind this film were far more interested in the visual effects and the set pieces because somewhere along the way they forgot that they actually needed to tell a story here. The visuals are striking: the scenery is quite beautiful, the action well choreographed, even the acting was solid but everything else (everything that mattered) is just awful. The characters have absolutely no depth and lack chemistry; Henry Cavill is just required to look heroic and handsome because his character is pretty much the same as Sam Worthington's Perseus from Clash of the Titans. Titans may have been a bad film but at the least the plot was coherent enough unlike Immortals where the filmakers decide that they (needlessly) have to have Poseidon send a giant wave in to help the heroes fend off about 6 soldiers when Theseus himself killed at least that single handedly earlier in the film. It's just misplaced and silly; much like an unneccessary love scene that just came out of nowhere. It's misjudged and doesnt make much sense. Nothing really to recommend here.",
      "total_reactions": 3,
      "user": "TheBear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "It was decent nothing to special about it boring at times but terrible story telling a few scenes of true exciting action but I think 300 was way better in content and script writing.",
      "total_reactions": 3,
      "user": "EPIXMAN15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "As a mythological movie, this is really one of the worst disaster that I have ever seen, the actors seem more sci-fi soldiers than ancient Greeks, and the story is inane and lame, and not based on the real greek mythology. The action scenes are not bad, but the overall feeling is more like seeing a (mediocre) videogame that a good movie.",
      "total_reactions": 3,
      "user": "neldot"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "This isn't so much a movie as a vehicle for sleek visuals. The plot was anemic and the characters laughably flat. Visually, it picks up where 300 left off, but adds in some epic (and beautiful) landscape shots to go with the truly visceral battle scenes. If you're looking for blood spatter in HD, this is your flick, but overall, the cardboard characters, imbecilic plot, and absurd;y self-important voices overs are just to bad to make this move enjoyable. This movie falls far below \"300,\" which at least had the good sense to let itself be fun.",
      "total_reactions": 11,
      "user": "SimpleSimon"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Well, i am disappointed. The only colourful person is Mickey Rourke, all other actors are just boring.",
      "total_reactions": 10,
      "user": "Sauerkraut"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "I'm giving this a ONE instead of a ZERO for the great casting for the gods and their costume designers, who did a terrific job making each one identifiable, and the set designers, who made the top of Mt. Olympus look breathtakingly serene. Too bad the god's actions and fighting scenes weren't godly enough.",
      "total_reactions": 5,
      "user": "petitorenji"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Mediocrity at its finest.  Let's call this the poor man's 300.  Nothing about this was exceptional at all.  It started pretty solid, but faded as it went along.  There wasn't a single stand-out moment in this film for me.  The acting was mediocre, the characters were all very one dimensional (I didn't care for any of the characters) and poorly developed characters like the monk (yes he is literally just called \"the monk\") serve quite literally no purpose in this film.  Even the action, the true focus of the film wasn't up to scratch.  Apart from the battle with the gods (which looked awesome, but wasn't enough of it), none of the battles caught my eye.  Infact, there was one point in the film where I fell asleep momentarily due to sheer boredom, which has only ever happened to me in one other film (funnily enough, it was Clash of the Titans).  Nothing about this film is great or even good.  Literally everything is either \"meh\" or just plain bad.  If you want to see the film and develop your own view of it then by all means be my guest because you may enjoy it, but I didn't.  One final word of advice: Do NOT waste your money on the 3D.  Go 2D or not at all.",
      "total_reactions": 7,
      "user": "Jorad"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "This story line was a little dull and the movie didn't have much depth, but the visuals, effect and gore were top notch. Gave me that 'God of War' impression.",
      "total_reactions": 11,
      "user": "ShankDizzle"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "A mortal movie... won't be remembered. Mediocre acting, mediocre story, a sex scene completely unnecessary, not so great special effects... and boring the first part.",
      "total_reactions": 10,
      "user": "vocecita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "A rather mundane way to waste a couple of hours. This film reeks of average content, average scripting and (mostly) average acting. That's not to say it's bad, it's not not good in any real way. Certainly the action scenes (which we all are watching it for, lets face it) can be quite good, but those that are are unfulfilling in their length. A great deal has been said about Immortals comparison to 300, well of that film it falls far short, but the lineage of this bastard son is notable in the attempt at the slow motion visceral combat scenes. Yet somehow director Singh has managed to take all the slickness and clarity out of these scenes. In the predictable final battle, after a rather lacklustre pep-talk by main character Theseus, the melee is so confusion and the colours so drab that its very difficult to see exactly what is going on and whose doing what. Not that you'd care much; the characters of this film are all pretty mundane and without intrigue, popping off a couple of cliched lines occasionally and then dying appropriately as the drama demands. You have Theseus, the main protagonist who has a rather worrying relationship with his mother and that's about all there is to distinguish him. He blathers a bit about faith and the lack of faith (a running theme), but it's so irrelevant to the overall plot you can pretty much disregard it. There's Phaedra, the virgin oracle who doesn't remain so very long (here the film is similar to 300 in its gratuitous and pointless sex scene, although not as funny as 300). Then there's, for me, the one true highlight of the film, the \"evil\" king Hyperion, played by Mickey Rourke. Rourke is by far the strongest character of the film and I actually found myself rooting for him more and more; he had a game plan, set morals and didn't seem like a piece of wet tissue paper like a lot of the other characters. I genuinely hoped he would win in the end (he didn't, this is Hollywood after all). Another stronger point is the battle sequences of the gods, which are fast and viceral, though too short to be really satisfying. Watching what one of them splatter bad guy head with a hammer in slow motion was pretty fun. But tragically that's about it, the greek gods, who are dressed in bizarre garish gold costumes something akin to a French perfum advert, are pretty anonymous - the only way to tell Poseidon appart from Zeus is that he's holding a trident. I'm sore pressed to say who the other two gods were, possibly Apollo? Maybe Helios? Perhaps Whocares, god of weak character development? Athena, who is actually named, seems a bit of bimbo and quite pathetic, rather than the strong willed, stubborn goddess of wisdom and war she's meant to be. But, like all other characters in this film, even the gods are just there as padding until their dramatic deaths (I did tick the \"spoiler\" box). Of course only a Titan (whom Hyperion is attempting to free to bring about a new world order or something....) can do it. I bet they're massive! I hear you cry. Well no, they're not titanic, ahem, they're more like the savages from the Decent and plastered in grey mud, then they die like Hollywood vampires by crumbling into dust, much like my interest at this point. All that isn't bad, it's just not good, it's weak but its palatable. It's average but its not terrible. What's really bad about the film is little irritating stupidities that make no sense whatsoever. It might just be me, but Phaedra drinking from pool of water in the least efficient way possible (holding her hand vertically so that no water is actually retained) and then dribbling water from her own lips into Theseus' was just ridiculous. The misuse of actors like John Hurt who had so much more potential. The random sea of oil that has no function to the plot whatsoever. The knife wound that Theseus receives in the end but doesn't stop him - at least Maximus in Gladiator had the good grace to die after such a wound. The village that is undefendable despite the fact that its only obvious entrance is a narrow corridor cut into the stone of the cliffs themselves - as we all know, small narrow corridors are totally undefensible unless manned by half naked Greeks... oh wait. These things and others just pander to ridiculous pointless features that are there as padding for an empty film with barely enough strength of character to stand up on its own. I suspect the lifetime of this film is slightly less than its title puports.",
      "total_reactions": 4,
      "user": "ravenscar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "Immortals is just another one of those, loud, noisy, thinly written, and overproduced movie that is just sloppily made and poorly acted. And also,  the  movie makes sev",
      "total_reactions": 5,
      "user": "kingasa2020"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Overall Movie: 3 Acting: 0 Storyline: 6  Notes: Special effects: 10 Wow, does this movie blow you away with it's epic special effects. In the mood for a good movie? NEVER WATCH THIS!!!!!!!!!!!!!!!!!!!!!! In the mood to have fun and ignore the bad acting and stupid storyline, and just enjoy the special effects? IMMORTALS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 5,
      "user": "oscarr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Apparently anyone who gives this film anything above a 5 or 6 hasn't ever seen a good movie let alone a great movie.  For every good thing this film does style wise it does something bad in every other area (sound, acting, direction,dialogue, etc).",
      "total_reactions": 3,
      "user": "drachehexe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "I was a bit let down by the story, which in my opinion is more or less cliche now, but the action sequences and CGI more than make up for it.  The 3D version, should you choose to see it, has good use of 3D.  Seeing some blood from a killed person fly at you is stunning.  I would have made one or two changes in the cast as well.  I won't say who, but I felt that at least one of the characters did not fit into his/her place as well as I would have had hoped.  If you like action, then this is worth a look, especially if you are a fan of movies like 300.",
      "total_reactions": 3,
      "user": "Zeph"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Immortals was decent enough but it had the potential to be so much better. Henry Cavill did well as Theseus but Mickey Rourke could've been more menacing as King Hyperion. I mean he (Hyperion) was definitely a demented psychopath but he seemed to be more thoughtful and measured than off his nut which seemed more warranted but hey, I didn't direct this. The slo-mo highly stylized scenes of ultra-violence were done well, human obliteration looked more authentic than ever, and this is one of the film's elements I think worked well. My biggest disappointment was with the gods, they were played simply by normal humans with little to no special effects augmentation. If I were director, at a minimum, the gods would've been an impressive 20-ft tall then it's just discretionary elements from there but that's not what they did. The film is fine as a rental for a few bucks, but it's not a keeper.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Its been about 8 months now since Zack Snyder \"Sucker Punch\"ed us with an awful PG-13 cut of what could have been a good film (the R-rated cut wasn't bad). And while Zack Snyder sold out on his fans, \"Conan\" was murdered by a bunch of miniscule children (Spy Kids 4) and civil rights rendezvous (The Help), Tarsem has the courage and audacity to make a movie that he wants to make, and it proves to be a near-rival to Zack Snyder's hit 2006 film \"300\", while utterly hacking \"Clash of the Titans\" in half. All I can say is, I'm pretty damn impressed. Its pretty much what the \"Clash of the Titans\" remake should have been.",
      "total_reactions": 13,
      "user": "Eric_Levengood"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Immortals will be remembered more for its slick, breathtaking visuals than its slow and at times, boring, storytelling. Director Tarsem Singh (The Fall, The Cell) has a distinct style that everyone recognizes, and it is perfect for a movie that deals with Greek mythology. This movie is definitely a sight to see and will be more appreciated if it is seen on the big screen. And you cannot help but think of movies like Clash of the Titans and 300 when you see the previews for Immortals and it is even more on your mind when you actually see the movie. Is it better than Clash of the Titans? You bet. But is it better than 300? Not a chance.",
      "total_reactions": 7,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This is definitely the best movie of all time.  It's a brutal combination on 1% excellence, and 99% PURE AWESOME.  The day before I went to see this movie, I thought I knew what awesome was, but I was so wrong.   This movie is more awesome than Zeus and Chuck Norris fighting to the death on a cloud of Ferraris, Nukes, and Bacon while the entire casts of 300, Sin City, Robocop 2 and Tuesdays with Morrie have their collective faces melted off from sheer exposure to awesomeness.",
      "total_reactions": 24,
      "user": "Sneezembop"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Beowulf tried to one-up 300, They FAILED! Clash of the Titans tried to one-up 300, THEY FAILED even worse. Do i even need to repeat myself for this one? The acting is mediocre, there is action but it doesn't help the story, which has a worse plot than that of the power rangers movie or Barney.",
      "total_reactions": 4,
      "user": "thatgerman"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "If you are looking for entertainment, then stop here because this movie is exhilarating fun!  Although this movie is being compared to 300, it is an entirely different story, but with all of the epicness!",
      "total_reactions": 11,
      "user": "nottooshabby"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "A good/average movie, but not that type of a movie that will remain in your memory a long time, having an expected end. The acting was good, average. The script was quite poor, but from a 3D movie you cannot expect a very good script; few or no shocking, or impressive, or well thoughtful scenes, but then again there was no sign that this movie will have an unexpected end. The accent was put on the special effects, which, in my opinion, have no quality without a really good story. This is my first (ever, anywhere) review of a movie, but I still want to write this: few good trailers, with no false message, are made nowadays, but the idea with clips from the movie is something every producer should start promoting. Of course, nobody will go to cinemas unless you have really good clips, clips you can only find in really good movies.",
      "total_reactions": 5,
      "user": "Uzara"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Are you looking for a well-told and engrossing story? If so, go somewhere else. Are you looking for awesome, gory action and eye-exploding special effects? If so, go see this. Now.",
      "total_reactions": 6,
      "user": "MrFused"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "very very good moovie.Maybe better than the 300.I found this moovie very good from the first to the last second.The most interesting moovie of the year after Harry Potter.",
      "total_reactions": 9,
      "user": "Mixalis"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I saw this movie on opening day. Went in with mixed feelings, hoping it would be good, expecting a big let down ( such as clash of the titans (2011), watchmen etc.). This movie was shockingly unique however. Visuals, and characters were excellent. Lots of action, but not like 300 when it takes over the story. The acting was also top notch. Henry Calvillo was excellent, so was Micky Rourke. If your into action movies, this is the movie to see right now. I can't remember the last action movie i saw in theatres that i didn't feel ripped off when it was over.",
      "total_reactions": 7,
      "user": "fishflex"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Visually the movie is stunning and the story very interesting. Mickey Rourke and Henry Cavill give very convincing performances. The Stephen Dorff role was a missed opportunity and could have been better cast. I would have liked to have seen more character development and there are a few plot holes.",
      "total_reactions": 6,
      "user": "moviefan4444"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Ok I watched this, and I had a good time.  Why?  Well...I'll be blunt...the murder ratio was up to par.  There is a lot of horrifying murder in this picture, and that's a good thing.  I wasn't trying to watch 'Steel Magnolias', feel me?  This movie had excessive splattery gore that just made my day. Legendary Pictures alrerady has a well-defined artistic look, and I respect that heaps. The villain (Mickey **** Rourke) is so dope in this, I wanted to cry.  He does pure, but disaffected, evil so well, it makes me just wanna get hammered with him somewhere.  He's the ****  The only thing that seemed out of place was the last scene, with a Bieber moptop and some Kanye West self-indulgent montagÃ© ****  That was just dumb as hell...because it was pointless.  You guys already made a good movie.  Pouring **** on it isn't gonna help. See? Anyway, that was a misstep, but I still really liked it, & it's a good time........if you like murder. :}  I do.",
      "total_reactions": 5,
      "user": "drm"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "This movie was epic. When i saw the trailer i thought it would be really stupid but i was definitely wrong. The acting was definitely not the best, but the action definitely was. Amazing and epic action scenes. My mind was blown. I loved this movie. If you liked 300 then definitely see this, but if not unless you like really well choreographed action, then this movie isnt for you. This movie requires a certain taste, but if you have that taste then you must see this. You wont be disappointed. 8/10",
      "total_reactions": 4,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I loved this movie. Not because it was without flaws. I'm a huge fan of the Hellenics. I do agree with many of the criticisms however. This movie doesn't explore the rich fantasy side of Greek mythology. But in a lot of ways, it's very faithful to Greek myths in terms of structure. To make the most out of the movie, it does help to know about some informational aspects because the film does a poor job at elaborating. There were details that were left to be inferred, like the values of burying the dead, the values of immortality, and the bull torture device (historically real). Those were all true to the Hellenic Greeks. Narratively, there were \"plot holes\". It's common in myths to not explain everything. Sometimes things just happen. I'm not saying the that story doesn't make sense, but there are moments that lack clear transition. Like classic Greek myths, the movie has superficial story telling. There isn't much if any character exploration or engagement. However, the classical themes of tragedy, heroism, fate, faith, and immortality are there. I accept these \"faults\" in terms of the format of myths. Myths don't have deep characterization or heavy drama. They are told quite directly. Although it may seem empty in regards to modern story telling, the story is faithful to the classic Greek hero tradition. There were some mildly questionable acting. Cavill thankfully gave a solid performance. I was worried especially since he's lined up to be the next Superman. I understood everything Rourke was saying, but I can understand if his mumbling gets annoying. I interpreted it to reveal how his character felt forsaken. His rage was masking his bitterness and depression. All of his actions were essentially trying to wave the finger at the gods for letting him down. The ladies in the movie were generally stoic, but life was tougher then and the story only allowed one emotional scene for Pinto's character. The direction by Tarsem was quite spectacular. It's already widely agreed that the movie is visually amazing. The action is just as amazing and definitely pays off in the end. It's not all slo-mo or over stylized. Tarsem made human fights intense and in real-time which contrasted to the power of the Gods who were shot in slo-mo and had stunning, acrobatic movement. The sound effects were dramatically phenomenal. They gave real dimension to the visuals. Speaking of the visuals, they weren't all eye candy. The slow, panning close-ups of the labyrinth's walls really gave off the dizzying confusion of being in a maze. In fact, there were several very visceral scenes where you're made to feel exactly what was happening. Your ears ring; your eyes get blurry. The most interesting aspect of Immortals for me was the blend of realism and mythology. It plays on how myths may have been conceived. The movie is told visually as myth, within a reality, within a myth. I'll explain. Theseus's world is meant to be real, and in his world there are myths of gods who some doubt exists. Theseus' own story becomes a myth depicted on a statue at the end. The movie itself is a myth and that's why it's theatrically stylized. This interesting approach puts a new spin on the interpretation of gods. The gods and titans are presumably the same race of super beings. They have the same helmets and abilities. As the movie mentions, \"history is decided by the victors\", therefore the self-dubbed Gods are considered good. It's a little jab on the one-sidedness of myths/stories. I enjoyed the interpretation of youthful gods. They weren't necessarily magical beings. They were very human, which is how they are suppose to be. Even if the story seems uninteresting at times, I think the action and style more than makes up for it. If you're a fan of classic heroes, superheroes, amazing style, gritty action, or looking at hot people, I think you will find the movie enjoyable. If you're a fan of Hellenic Greek culture, even better. This movie isn't an adaptation. It's a modern myth that takes all its cues from Hellenic stories. It's not an intricate movie story-wise, but there is good film-making going on. Tarsem's action and visuals provide plenty of entertainment to a fresh interpretation of Greek stories.",
      "total_reactions": 3,
      "user": "anonymous-V"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "I would like to start off saying that I, as a fan of Zack Snyder, felt like this movie was going to be a knockoff of 300...and it was but in a good way. In many aspects I feel this movie has knocked 300 down a notch especially in the visuals. All of the fight scenes were insanely awesome and well done. Tarsem also utilized 3D better than most movies that support it. For the people that are fans of the art style and love blood and gore, this movie will not disappoint. The acting was okay. Mickey Rourke was the best of the crew and was a real ball buster. The story strayed from the written in stone mythology but its forgivable because the gods were insanely awesome. The last fight, which lasts roughly 20 mins, is the best bit of cinematography I've seen in a very long time and made me say **** YES!\" the whole time. Pretty much the bottom line is if you like violent gory fantasy war movies don't let the story and acting stray you away, its not bad enough to make you regret watching it despite what other reviews say. I would watch it at least 2 or 3 more times if I were given the chance.",
      "total_reactions": 4,
      "user": "Rynocirator"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "A totally awesome film! A must see if you're a fan of 300. From start to finish this film does not stop. Amazing action scenes, amazing score, and if you're a gamer you will appreciate the movie (Reminded me of God of War). Go see it... you will love it!",
      "total_reactions": 5,
      "user": "GameZoneXtreme"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is so **** awesome. Wait, you came to see this movie for a good story line? Think again, story was sub-par at best, but the action scenes, HOLY **** I was in awe the whole time people got obliterated. See this movie for it's action, you will NOT be disappointed.",
      "total_reactions": 4,
      "user": "zaxmazr"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is not great but pretty good.",
      "total_reactions": 4,
      "user": "Roko24BF3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Several holes in the script and fluctuating epic. good special effects that cover many gaps in the film. A film that ultimately makes you just say these words .. and then? very disappointed",
      "total_reactions": 2,
      "user": "IdolMaster"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Plain and simple, this movie is about its sound and visuals. If you go into it expecting anything more, you will be disappointed. Having said that, the story was in no way horrible. Passable at best I'd have to say. The characters were about the same as well, which as stated above, was to be expected. Definitely best if viewed in 3-D, as just about every scene has some eye candy. In conclusion, if you want to see a movie that will stimulate your mind or move you in any way, don't go see this. But if you go in to the theater wanting nothing more than for your eyes and ears to be wowed, this is definitely a movie for you.",
      "total_reactions": 3,
      "user": "bushidobob007"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I'm tired of people expecting all movies to be Oscar winners. What you see in the trailer is what you get; an enjoyable action movie. The acting wasn't the greatest but I enjoyed this movie as an action packed, popcorn flick. People need lighten.",
      "total_reactions": 3,
      "user": "Morlu"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Is it another 300? No.  Visually, the movie is stunning.  Acting and storyline? It's okay.  The action is good, and Mickey Rourke was an excellent antagonist.  The highlight of the movie as to be some of the stylized fight scenes that will undoubtedly be utilized in future action/martial arts films.",
      "total_reactions": 4,
      "user": "NerfHerder"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "The movie was pretty decent, and honestly this 6 is because of the well choreographed fight scenes and the cinematography, especially towards the end. The characters were boring, and the time spent advancing the thin plot felt like filler, because you really dont care about the characters, and dont even get me started on the costume design. Overall if u go to this movie expecting some great greek epic, you may be disappointed but if you want to see some awesome action scenes then go for it.",
      "total_reactions": 2,
      "user": "Cntomer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Mickey Rourke (nobody plays a better antagonist) is enigmatically brilliant as Hyperion and Henry Cavill puts in his best performance since \"The Tudors.\"",
      "total_reactions": 4,
      "user": "SammyWong"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "So happy to see Mickey Rourke having a resurgence and getting the big roles he deserves.  He should have won an Oscar for his role in The Wrestler but Hollywood politics got in the way and the award was instead given to Sean Penn because he is more \"politically correct\" by Tinseltown's twisted standards.",
      "total_reactions": 3,
      "user": "wendy0"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Sorry, but any movie with Mickey Rourke as the bad guy is worth the price of admission.  Just saw \"Angel Heart\" over Halloween and I forgot how awesome that film was.",
      "total_reactions": 3,
      "user": "cluetrain"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "I think I may have a soft spot for Greek mythology.  I don't know what it was, but when I left this movie, I had a huge smirk on my face.  This movie is awesome in all sorts of ways.  Right away the movie awes with it's visuals.  Tarsem is a very visual director and gives this movie an epicness that is missing in most movies.  The characters are as 2-dimesional as they come, but at least their the fun sort of 2-dimesional characters that you can root for.  Henry Cavill steels the show as Theseus and Mickey Rourke plays a great King Hyperion.  Cavill's ability to play the hero make me happy that he is going to be the next Superman.  Mickey Rourke plays Hyperion all sorts of ruthless and unyielding (and awesome).  The supporting cast did their job well, but saddly the script didn't them give too much attention, especially the priestess (the fact that I can't remember her name is proof enough).  As someone who loves Greek Myths up the wahzoo, I enjoyed the beginning of the movie and thought is a decent action movie with good visuals.  Then Ares came down and started doing things that turned this movie from a decent action flick with good visuals to an awesome action flick with good visuals.  Seeing the gods fight the titans at the end made me all sorts of wide eyed.  Saying the climax of this movie is amazing is an understatement.  The ending was kind of \"Bleh\" in my opinion and seemed like the movie was going for a sequel (let's hope not, sequels kill movies like these).  All and all, this is a great action movie that you can just watch with your friends and have a fun time.  This is what Clash of the Titans should have been but saddly wasn't.  People who are saying this movie lacks depth and have a boring script are missing the point.  Greek Myths aren't incredibly deep, so why should an adaptation of a Greek Myth be any different.  Just sit back and enjoy the gory awesomeness.",
      "total_reactions": 3,
      "user": "EvillivE"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The movies plot was a little satisfying but this movie will keep you on the edge of the seat. Best feature would have to be the special effects i give them kudos.",
      "total_reactions": 3,
      "user": "eddykingly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "I wanted to like this movie more than I did, the first half was engaging but the last half fell short for me, i agree with what a lot of ppl are saying about it but in the end I still liked 300 much better, theres not much in theaters right now so if your looking for something to do its worth it but if your tight on funds id save the money for a rental or download",
      "total_reactions": 1,
      "user": "singingbatman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "This movie had promise in the beginning. However, it quickly went downhill. I would call it extremely loosely based on mythology, as the gods are borderline pathetic. When it came down to the last fight in which they were finally \"intervening\", they were merely glorified warriors. This movie is also extremely patriarchal, the women are useless and only serve to bear sons - getting so tired of that. Te only positive is the main guy, I  solid performance as well as very good looking. In any case, hollywood has either been spewing worse and worse movies or it's maybe my standards that have gone up.",
      "total_reactions": 1,
      "user": "Soulshock"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "The story was slow and plodding.  The plot was supposed to be about keeping a magical bow out of the evil King Hyperion's hands (played by a mumbling Mickey Rourke), but the bow really didn't come into play much.  King Hyperion gets his hands on the bow and uses it once to break open a gate and that's it.  I also have an issue with poor audio and actors mumbling their words so that you couldn't understand them.  The acting ranged from mediocre to good.  I'm still giving the movie a pass because the visuals were great.  The 3D was slightly above average, but the computer drawn vistas looked superb.  The fight scenes were gory and exciting.  If you liked 300 you will probably like this one.",
      "total_reactions": 3,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "It's definitely cool looking, but sometimes that's just not good enough. The acting and the action scenes were both patchy, the plot was ridiculous to the point of unintentionally funny, the 3D was weirdly flat, and easily 2/3 of the scenes could have been cut without the movie losing anything. Though I had to add a point for Mickey Rourke, who was awesome.",
      "total_reactions": 1,
      "user": "d4rksh1n3s"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Like 300 with a magic bow and arrows...that doesn't get shot nearly enough...oh, and rabid Titans.  Note to self: if someone gives you a magic bow with unlimited ammo arrows? Hold it with both hands...",
      "total_reactions": 2,
      "user": "hollyv"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "If you're after a film that doesn't employ too much thinking and is enjoyable to watch (if you were a fan of the 300 style), I would recommend going to see this. The scenery, visuals, fight scenes were definitely up there with 300, perhaps a little more exaggerated, and gory. Would I buy it once it out? Probably not. But it'll certainly make my rental list to watch again!",
      "total_reactions": 4,
      "user": "mugslangley"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best films I've ever seen in my life. The story had: revenge, adventure, romance, a quest for immortality, AWESOME fight scenes, great amount of brutality and gore in the film, and finally, a sex scene that took the perfect amount of time to build up and finish. If you're a true movie buff, this is a movie to see.",
      "total_reactions": 4,
      "user": "Klumzy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "I really enjoyed this movie. Tarsem is one of my favorite directors and I feel he still delivered on a \"big budget\" movie. The 3D was unnecessary (as usual), but I think the visuals were still solid. The acting was decent for this type of action-centric movie, far better than 300 in my opinion. You just can't go wrong with Mickey Rourke and John Hurt. The story isn't the stand out here, but that's sort of predictable for this kind of movie. My expectations weren't high walking in, but I'm happy to say I was thoroughly entertained.",
      "total_reactions": 2,
      "user": "NaughtyProwler"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "i have to say this is my favorite movie of all time.  takes the action from 300 and raises the bar yet again for a action movie.  cant wait to see it again",
      "total_reactions": 4,
      "user": "kregstrong"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Gods and mortals tangle in this classic mythological tale told with sumptuous style and up-to-date action. Director Tarsem Singh is known for his lavish and inventive visual expression and he's applied his unique images to this stuffy story. Theseus (Henry Cavill) is a peasant who leads the mortals in battle against a bloodthirsty king (Mickey Rourke). The buff golden gods occasionally drop in from Olympus and their final scene kicks some cool CGI butt. The dialogue is stodgy and the drama slows the pace, but the violent action and the imaginative look make it fun to watch.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Entertaining fight scenes!  They were nicely filmed and interesting camera shots.  The movie looks great, and I found the 3D effects were well used except for the ocean scene.  As mentioned elsewhere, the romance in the movie was painful but helped tie things up at the end.  Good way to burn 2h of your life and 15$.",
      "total_reactions": 1,
      "user": "Rye631"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "It was a good movie!! Sure they could have done alot more with it but it wasnt horrible!!! Hopefully when They make the next one they will broaden their arises!!!!!:-)",
      "total_reactions": 4,
      "user": "Gamingking007"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "THIS MOVIE IS AWESOME! Seriously all bad critics have been written by a bunch of retards. Many said the romance between the oracle and the main character was unnecessary. First, ignore that. There is NO romance. One sex scene that lasts 10 sec and that's it. And who cares anyway? It's part of the myth! Secondly WTF I can't believe people complained about gods fighting in a fast moving martial art manner with no powers. That is just ridiculous to say!! There are GODS! OF COURSE WE WANT TO SEE THEM OWNING! People that wrote that are just a bunch of retards. Thirdly I liked the story. Nothing wrong with the story. There are TONS of action scenes and FOR ONCE WE GET TO SEE BLOOD! And We get to see GODS with weaknesses AND the main character doesn't just pick up the bow and start shooting at them. Yes, everything was designed in studio BUT IT WAS WELL DESIGNED! And NO armours are NO in plastic just because you see armors shinning doesn't necessarily mean it is fake. Everything was highlighted with 3D design tech like in 300. Seriously, this movie WAS GREAT! and I am not a big fan of this type but hey - I was wrong. Worth seeing it in 3D seriously!",
      "total_reactions": 3,
      "user": "premium_sauce"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Immortals may not be like 300 but its a pure entertainment for Action lovers . Its a amazing Fantasy-Action film . Henry did good as Theseus . The best thing in this film was the Gods Portrait and their fighting ! it was awesome and really good . The film had the darker tone which i love most . Story could have been better . And i would like to see more fight between Gods and The Titans . Soundtrack was good . but the worst thing was Mickey Rourke as King Hyperion . He seems to be overacting all the time and wasn't cool at all .Effect was good but there were little eye-glowing at some point .",
      "total_reactions": 2,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "There is something lacking with the story line. The choice of words for the spiels were contemporary sounding. If it wasn't for the good visual effects, fight scenes and costumes--this movie could have been so dull.",
      "total_reactions": 1,
      "user": "aozeta"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Visually stunning and a epic film of the 300 genre... Well performed and gory as hell! I was really suprised it was a 15 cert with so much blood, gore and violence! Well worth seeing.",
      "total_reactions": 2,
      "user": "karma_karl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "It does what it says on the tin, its an action movie, its a great watch and some great visuals, its never going to win an oscar, but it doesnt need to.",
      "total_reactions": 2,
      "user": "Foxxey86"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "The brutal and bloodthirsty King Hyperion (Mickey Rourke) and his murderous Heraklion army are rampaging across Greece in search of the long lost Bow of Epirus. With the invincible Bow, the king will be able to overthrow the Gods of Olympus and become the undisputed master of his world. With ruthless efficiency, Hyperion and his legions destroy everything in their wake, and it seems nothing will stop the evil king's mission. As village after village is obliterated, a stonemason named Theseus (Henry Cavill) vows to avenge the death of his mother in one of Hyperion's raids. When Theseus meets the Sybelline Oracle, Phaedra (Freida Pinto), her disturbing visions of the young man's future convince her that he is the key to stopping the destruction. With her help, Theseus assembles a small band of followers and embraces his destiny in a final desperate battle for the future of humanity.",
      "total_reactions": 2,
      "user": "allmovies"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "This film was good on a campy bad film level. The visuals were excellent and the fight scenes were well done.  On a campy bad film scale I would give this an 8 or 9.  On the scale where I rate actual films, I would give this a 3-4.  If you are looking for a ridiculously violent film with nice visuals, you will enjoy this.  If you are looking for a good storyline, well, keep looking.",
      "total_reactions": 2,
      "user": "turingmachine"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Worth your time if you enjoy 300 or Clash of the Titans. The acting was below average but the action scenes were incredible to watch. These movies need to feel epic in scale else it fails. Who watches these movies for story? It delivers in epic!",
      "total_reactions": 3,
      "user": "namDa65"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Tarsem singh continues with his beautiful visuals in his newest film immortals. Immortals is a film that is very formulaic but there is a certain intrigue that Tarsem puts into the film. Although there are good things there are also some bad things . At some puts characters that are major roles do not get enough screen time for us to really get to know them. Also some characters that you feel you should know show up in scenes and it just feels wrong. However the finale does not disapoint because of Tarsem's visuals but he does fail to create a great film because of his formulaic story and poor storytelling at times.",
      "total_reactions": 2,
      "user": "cabrita"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Good but not great. It's got a lot of things going on, and while not all of them work like they should, it can satisfy you if your a fan of movies like Clash of the Titans and 300. So if you like those movies you'll probably like this one, just don't expect greatness.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "The performances were all pretty good with Mickey Rourke standing out for me; he has such a great screen presence. A very violent film with plenty of claret on show, which will please all the splatter-fest fans. It",
      "total_reactions": 1,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Story, characterisation and acting all have their limitations, but Immortals has an amazing visual style and flair typical of a Tarsem film. Very theatrical.",
      "total_reactions": 1,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Immortals is really awesome, but that's about it. First things first  Immortals is not 300. True, it shares some producers and it’s a swords-and-sandals epic packed with tons of visual effects, but that does not mean it’s not its own creation entirely.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "loved this move, don't know what other people are watching when they put anything below 7, it is one of the better films I have seen and I watch a lot of movies, everyone should give this film a chance",
      "total_reactions": 2,
      "user": "masterjohnson1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Com uma super performance de Mickey Rourke como vilão,e Henry Cavill convence também como herói.",
      "total_reactions": 1,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Been there, done that. Cavill is boring, Pinto is nice to look at, and Rourke is the only half-way interesting character in the entire film. Visually the film is a success. There are some stunning shots and special effects here, but that's about it. The story has a lackluster, old-hat, hand-me-down feeling to it, and I couldn't help but compare this film to 300. Although 300 was more flashy and charismatic, I think Immortals could use a good dose of that mentality.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "It is a bad omen for a movie if its poster proudly proclaims, â",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "\"Immortals\" is a decent film with nice visual flair and extravaganza but a muddled and boring plot ruins the movie. The special effects, the action, and the CG sequences are all great and dazzling but the story is very boring. The actors give a good performance is the script is good but the plot just ruins the whole thing as it is very uninteresting. Overall, Immortals is a great movie to watch for and entertainment fix. You will see some great action but don't expect it to stay in your mind forever as it is not an amazing movie. Breakdown for \"Immortals\": Presentation: 5, Plot: 4, Acting: 6, Script: 5, Lasting Appeal: 4, Verdict: 4.8 out of 10 \"Average\".",
      "total_reactions": 0,
      "user": "Sachi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Skimming the user reviews, I noticed more consensus than usual with \"Immortals.\" Most reviewers seemed to agree that the film features stunning visuals with weak storytelling; what they disagreed about was the relative value of these qualities. Those handing out eights and nines tended to assert (or imply) that strong storytelling was unnecessary--possibly even detrimental--to an action film. Some claimed that criticizing the script was exposing shameful ignorance of what makes an action movie great: spectacle, gory spectacle, and really gory spectacle. Red-zone reviewers, on the other hand, claimed spectacle was enhanced by strong storytelling--or even, in some cases, dependent upon it. My rating identifies me as one of this latter group--though perhaps not as adamant as some. In part because I'm so charmed by the enthusiasm of green-zone reviewers (\"more awesome than Zeus and Chuck Norris fighting to the death on a cloud of Ferraris\"), I have genuinely tried to understand how good storytelling could be irrelevant to--or, more puzzling, could detract from--the visual and visceral thrills of a great action movie, but my own viewing experience seems to prove the opposite. I simply can't think of a single action film that I would call great--or even good--despite weak storytelling. Which brings me to the truly inexcusable fault in \"Immortals,\" which is that, in the character of Theseus, the filmmakers have strong storytelling already in hand. Through plays, poetry, and prose, modern filmmakers have inherited an array of fabulous stories about the gods, demigods, mortals, and other creatures of Greek mythology. Especially the great warrior-king!  So why don't they use them? This is not pedantry; it's genuine bafflement about why filmmakers would ignore rich, dramatic, coherent stories, all thousands of years beyond the reach of copyright, in favor of thin, sketchy, incoherent assemblages that, to add insult, they have to pay for. I'm waiting for someone with Tarsem Singh's visual genius to tackle, say, THE BACCHAE, using Euripides's script. THAT would be more awesome than Zeus, Chuck Norris, Bruce Lee, and Sol Invictus fighting after death--and after a feast of nectar, ambrosia, and soma in Valhalla--on a cloud of Lamborghinis and Aston Martins!",
      "total_reactions": 0,
      "user": "JennetP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "What could you expect of another Greek mythology hodpodge with heros, baddies and gods? well a lot of myths of course. Forget the limp story (do you really need screenwriters for this kind of film?) and cut to the high contrast slick sets and the battle mayhem. It's 300 with titans to spare.",
      "total_reactions": 0,
      "user": "Jluis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Acting is very disapointing, The script is incredibly corny and honestly is a little bit funny towards the end of the film because its that bad, Action scenes were good but lacked originality (think the slow-mo action scenes from 300). Their re-imagining of the gods didnt sit well for me at all. Overall, Its just another film trying to re-capture what 300 had and it fails to do so (FYI - it was produced by the producers of 300), Just another disapointing action film imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Very poor performances, this important detail was ignored by management. very messy sound track, a story that exhausted so worn that this, in itself, the story has no validity mythological as personification the characters in a very unwise, especially the Titans. good: photography and visual effects.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Was not epic nor was it worth watching again. It wanted to be 300 in the worst way, but it just never hit the mark. 300 had better actors, script and fight coordination.",
      "total_reactions": 0,
      "user": "phillyjeff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "Immortals has some fantastic visuals, with stylishly brutal Ancient Greek action that out-300s 300 (if that makes sense). It also has some striking and creative visual effects, particularly in the way the gods of Olympus transform from their mortal to divine forms. Henry Cavill and Mickey Rourke make a convincing action hero and entertaining hammy villain respectively, and John Hurt and Stephen Dorff's gravelly tones add a little interest to the film's less than inspiring dialogue. The film's story, however, is all over the place both in terms of pacing and original ideas - stop-start-stop-start, hit-miss-hit-miss, until it finally strikes the right balance in an entertaining final act. Frida Pinto is left with very little to do as the only feminine presence in a world fuelled by testosterone, and it's a little insulting to the viewer's intelligence to believe that a celibate oracle would abandon her vow of chastity for the first handsome man she meets. The costumes and CGI-extended sets are striking, but also a little jarring - a little like watching Ancient Greece via the Star Wars prequels. Like his previous feature The Fall, director Tarsem Singh demonstrates that he has some interesting ideas, and a good eye for colourful, unusual visuals, but is not as skilled at bringing the whole package together as a full, workable film. Immortals has a lot to like, but it's too flawed and incomplete to make any real mark.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "The main story is the worst part of this film. This includes the predictable character arc, the forced romance, and the spotty acting. Mickey Rourke makes his villain as interesting and memorable as the hats he wears. The whole movie looks great, but it's a turd covered in glitter.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "All style, but no substance. I really like Tarsem's visual vision for his films, but Immortals made absolutely no sense. The plot was jumbled, making the action awkward and ineffective. Disappointing.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "I'm going to compare this Immortals to 300, I can't help myself. The film was marketed as 'from the producers of 300' so they can't blame me. If you want to watch a Greek mythology based film loaded with impressive visuals and special effects then watch Zack Snyder's.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The plot is moderately exciting, even if weakling and with some incongruence. But the real reason for see Immortals is how the story is told: A framework moving with slow-motion effect, where the landscape is a still life and battles of the beautiful dances.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"Immortals\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 9,
      "text": "Achei esse filme muito massa. Atuação do Superman (Henry Cavill) ficou boa. As cenas de ação achei ótimas e também curtir a trama. Não achei a história detalhada, mas a trama e cada personagem achei muito bom mesmo.",
      "total_reactions": 0,
      "user": "LeoFenix"
    }
  ],
  "metascore": 46,
  "name": "Immortals",
  "num_weekends": 14,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 11,
    "month": 11,
    "year": 2011
  },
  "opening_weekend_income": 32206425,
  "opening_weekend_income_currency": "$",
  "rating": 6.0,
  "rating_count": 141480,
  "rating_freq": {
    "1": 4240,
    "10": 10357,
    "2": 3426,
    "3": 5895,
    "4": 10444,
    "5": 20694,
    "6": 32799,
    "7": 30163,
    "8": 16610,
    "9": 6852
  },
  "release_day": 11,
  "release_month": "November",
  "release_year": 2011,
  "user_review_count": 406,
  "votes_per_demo": {
    "aged_18-29": 56076,
    "aged_30-44": 57751,
    "aged_45+": 9859,
    "aged_under_18": 126,
    "females": 19262,
    "females_aged_18-29": 9577,
    "females_aged_30-44": 7551,
    "females_aged_45+": 1353,
    "females_under_18": 29,
    "imdb_staff": 6,
    "imdb_users": 141480,
    "males": 107214,
    "males_aged_18-29": 45935,
    "males_aged_30-44": 49417,
    "males_aged_45+": 8329,
    "males_under_18": 96,
    "non-us_users": 76980,
    "top_1000_voters": 510,
    "us_users": 21843
  },
  "year": 2011
}