{
  "avg_rating_per_demo": {
    "aged_18-29": 3.1,
    "aged_30-44": 2.7,
    "aged_45+": 3.0,
    "aged_under_18": 4.1,
    "females": 3.4,
    "females_aged_18-29": 3.8,
    "females_aged_30-44": 3.2,
    "females_aged_45+": 2.5,
    "imdb_staff": 2.0,
    "imdb_users": 2.9,
    "males": 2.8,
    "males_aged_18-29": 2.9,
    "males_aged_30-44": 2.7,
    "males_aged_45+": 3.0,
    "males_under_18": 4.1,
    "non-us_users": 3.0,
    "top_1000_voters": 2.6,
    "us_users": 2.5
  },
  "avg_screens": 275.0,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 22,
    "month": 3,
    "year": 2013
  },
  "critic_review_count": 20,
  "duration": 83,
  "genres": [
    "comedy"
  ],
  "gross_income": 156414,
  "max_screens": 275,
  "mc_avg_user_score": 2.7,
  "mc_metascore": 1,
  "mc_mixed_rating_frequency": 0,
  "mc_movie_name": "InAPPropriate Comedy",
  "mc_negative_rating_frequency": 58,
  "mc_positive_rating_frequency": 20,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 25,
      "summary": "There’s a phone app that could text a funnier script than this."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 12,
      "summary": "A more accurate title would be “Inept, Inadequate and Insipid Comedy.”"
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "summary": "Offering nary a single funny moment in its seemingly endless 84 minutes, the film...provides evidence that cinematic sketch comedy is clearly a lost art. The inevitable outtakes seen during the end credits seem to indicate that the actors, at least, were having fun. Too bad none of it managed to find its way onto the screen."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "summary": "An inept, brutally unfunny collection of sketches."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "summary": "Sometimes a movie is so awful that the word awful is not up to the task of conveying its awfulness. The awful InAPPropriate Comedy is such a movie. It is memorably awful. It is stunningly awful. It is so awful that we are fortunate that “awful” has an adverbial use that means “very” or “extremely.” This movie is awfully awful."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "I wish I never watched this film, ever, EVER. If you thought this was good, go sort out your iPad and destroy it with a sledgehammer. I can't think of ANY movie worse than this. NEVER watch this unless you are a X-Treme trash lover.",
      "total_reactions": 7,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "So many accounts with one review for this movie trying to pad it's score. Thats a pretty sad attempt to get people to watch your movie. How about you actually make a good one.",
      "total_reactions": 6,
      "user": "Brosman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "A clear contender for the Razzie Awards. I think Bio-Dome managed to out-preform this atomic assault of ass. 0 out of 10 anythings. In fact, I hope Metacritic comes up with a \"-1\" option just for this movie.",
      "total_reactions": 3,
      "user": "DoctorMedic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "This anthology of skits is one of those movies that is out to try and offend their audience…but the problem there is the fact they forgot to add jokes with the offensive material.  To put it bluntly, this film is pointless.  The skits are lazily written, the actors are terrible (not shocking when you see it has Rob Schneider, Michelle Rodriguez and Lindsay Lohan) and there isn’t anything funny about it.  Offensive and childish material is fine but when your material is hack, expired or just endless beaten to death like a dead horse that was already beaten to death BY a dead horse that was beaten to death, the offensive and childish material ends up being extremely grating and annoying rather than humorous and fun.",
      "total_reactions": 2,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is garbage, it is worse than Movie 43, it is just as bad as Bio-Dome, I mean wow this movie is one of the worst I've seen in my life, and what the hell is Adrien Brody doing here, this movie should be avoided completely, it is a 0 out of 10.",
      "total_reactions": 1,
      "user": "Leo9127"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "WORST MOVIE EVER MADE IN HOLLYWOOD HISTORY. Innapropriate comedy sucks. Why? Because of its awful cast and bad direction. I mean a story about A TABLET?!!!  I mean what was the director thinking before making garbage? And I think Movie Nation's Roger Moore is right- An app can text a better script than this stupid film. Please, film lovers out there please don't watch this film it will ruin you whole life to be a movie fantastic fan. And you can tell this movie is only playing in one theatre. PIECE OF CRAP.",
      "total_reactions": 13,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "WOW. A 1? A 1 out of 100 on this site? I've never heard of a movie so terrible, it deserved a 1 out of 100 in the history of Metacitic's 15-year-run. I wonder there's a new app called \"bad movies for dummies.\" There's a whole reason why this movie deserves to be in the Razzies next year. 1. The film not includes an Oscar winner, but a list of untalented actors like Lindsay Lohan (I called her \"The Driver's Manual of Alcoholics,\" man, she's worse than Amanda Bynes). 2. It's directed by the guy who did the SHAMWOW and Slap Chop infomercials who can't act. and 3. This is the absolute worst movie that ever made. Remember what happened to Movie 43? That movie sucked as bad as Colin Farrell's action movies. I know, the Rifftrax crew might do the trick to impersonate the Slap Chop guy, Mystery Science Theater 3000 style. Razzies, take notes and think that this is ultimate shabang for Worst Picture and Worst Ensemble Cast.",
      "total_reactions": 10,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Without out doubt, THE greatest 90 minutes of my life. I showed it too my disabled sister, she loved it! 10 out of 10. The acting is second to none, if it were released any earlier, definitely a contender for best picture.",
      "total_reactions": 4,
      "user": "BenfromSoliV1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "I saw this film back over the summer, taking a bit of a personal day off from the beach, due in part to a sunburn.  I got this heaping pile of crap off iTunes.  Yes, I paid to watch this.  Why; well, I'm just a stupid person I guess.",
      "total_reactions": 2,
      "user": "SimpleView45"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "garbage \"WORST MOVIE EVER MADE IN HOLLYWOOD HISTORY\" as people they called. it one of those movies that make me quit watching it. i don't care for actor i don't care for plot i don't of ANYTHING AT ALL .",
      "total_reactions": 2,
      "user": "Jrc126"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "why is this movie getting so many bad ratings, it is funny and inciteful. i think it is due to the \"Monkey See, Monkey Do\" factor in human nature (following the crowd). everyone is afraid to step out on a limb, be honest and admit that it is well done and very funny.",
      "total_reactions": 5,
      "user": "Bobbi"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Well, what can I say about this film? One word; Phenomenal. The trailer displayed a completely thrilling comedy and I wasn't disappointed after watching the whole film. Metacritic, please take a long, hard and sweaty look at yourselves because this film absolutely does NOT deserve a scoring of 1. You don't appreciate films!!!!!!",
      "total_reactions": 16,
      "user": "BigPoosha"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Despite it's abysmal scoring and it's fallacious reviews. As an experienced and honorable film reviewer/critic, The film 'InAPPropriate Comedy' is among a selective group of hilarious, educational and inspirational comedy films, it blends a variety of humor with drama, action and romance. I could not recommend the film any more, it is a MUST WATCH. Adrian Brody has produced a master piece. Do not be pessimistic about viewing the film because of the apocryphal reviews. An inspirational film that will be commemorated for generations to come. In one word; FANTASTIC",
      "total_reactions": 16,
      "user": "AlbertMyint97"
    },
    {
      "neg_reactions": 31,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Whoever suggests that this film is awful, needs to re-evaluate their film knowledge. The hilarious 'InAPPropriate Comedy' blends semi-reality humour with first class acting. It is a film I could watch over and over again, without tiring of the content whatsoever. If you plan on watching this film, pay no attention to the mediocre reviews or the disgraceful metacritic score this film has been given. A fantastic blend of comedy and action, quite simply the best film I have ever watched.",
      "total_reactions": 35,
      "user": "JoshuaLindsay97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Adrien Brody is GOD. He is everyone, everywhere, everything. Adrien Brody, Adrien Brody, Adrien Brody, Adrien Brody, Adrien Brody, Adrien Brody, Adrien Brody.",
      "total_reactions": 1,
      "user": "Betalink13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is complete garbage, i warn everyone to not watch this train wreck of a film. It is just straight up not funny and boring, racist. and offensive in almost every way. **** this movie",
      "total_reactions": 1,
      "user": "xdhollywood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "I could't believe that a movie could be this bad. I watched it because I saw the reviews and couldn't believe it. Well now I believe it. Please don't ever watch this!",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "I can write much things about InAPPropriate Comedy, but I will summarize in the next words: THE WORST MOVIE I'VE SEEN IN MY LIFE. It's a complete disaster.",
      "total_reactions": 0,
      "user": "NateNixon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "18 positive reviews? I hope you **** are just trolling. This is easily the worst movie of 2013 (worse than Grown Ups 2 & Movie 43) and one of the worst movies to ever play to an empty crowd at a theater. Don't waste your seconds watching this movie.",
      "total_reactions": 0,
      "user": "PyongyangMayor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "I hate this movie so much. This is an absolutely horrible movie with a non-funny cast and a stupid director. Like honestly who in the hell said \"you know what this is a great movie\". This movie is so bad with racist jokes stupid porn references and Lindsy Lohan probably doing drugs in her trailer. Do not watch this movie whatever you do. I feel bad for people who have watched it. I feel bad for the casts families that they have to be related with the people that were in this movie. Over all horrible movie do not watch it.",
      "total_reactions": 0,
      "user": "Malamar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "It's sad that there's only 10's and 0's around here. It means that you either love the movie so much or hate it. In this case, I hate it, but there's something preventing me to give this a 0. Also, here's another movie with an extremely rare 1 metascore. I've seen things funnier than this piece of APP. Get it? APP. Very original.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ],
  "metascore": 1,
  "name": "InAPPropriate Comedy",
  "num_weekends": 1,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 22,
    "month": 3,
    "year": 2013
  },
  "opening_weekend_income": 156414,
  "opening_weekend_income_currency": "$",
  "rating": 2.9,
  "rating_count": 3579,
  "rating_freq": {
    "1": 1555,
    "10": 380,
    "2": 446,
    "3": 324,
    "4": 224,
    "5": 210,
    "6": 169,
    "7": 122,
    "8": 90,
    "9": 59
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 49,
  "votes_per_demo": {
    "aged_18-29": 1284,
    "aged_30-44": 1320,
    "aged_45+": 357,
    "aged_under_18": 12,
    "females": 438,
    "females_aged_18-29": 234,
    "females_aged_30-44": 143,
    "females_aged_45+": 38,
    "imdb_staff": 1,
    "imdb_users": 3579,
    "males": 2653,
    "males_aged_18-29": 1040,
    "males_aged_30-44": 1162,
    "males_aged_45+": 312,
    "males_under_18": 12,
    "non-us_users": 1450,
    "top_1000_voters": 98,
    "us_users": 953
  },
  "year": 2013
}