{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.4,
    "aged_45+": 6.2,
    "aged_under_18": 7.2,
    "females": 6.4,
    "females_aged_18-29": 6.5,
    "females_aged_30-44": 6.2,
    "females_aged_45+": 6.6,
    "females_under_18": 5.6,
    "imdb_staff": 7.4,
    "imdb_users": 6.7,
    "males": 6.7,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.5,
    "males_aged_45+": 6.2,
    "males_under_18": 7.3,
    "non-us_users": 6.6,
    "top_1000_voters": 6.4,
    "us_users": 6.8
  },
  "avg_screens": 116.66666666666667,
  "budget": 20000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 2,
    "year": 2015
  },
  "critic_review_count": 412,
  "duration": 148,
  "genres": [
    "comedy",
    "crime",
    "drama"
  ],
  "gross_income": 8093318,
  "max_screens": 244,
  "mc_avg_user_score": 7.4,
  "mc_metascore": 81,
  "mc_mixed_rating_frequency": 56,
  "mc_movie_name": "Inherent Vice",
  "mc_negative_rating_frequency": 43,
  "mc_positive_rating_frequency": 243,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 100,
      "summary": "Inherent Vice unfolds so organically, so gracefully and with such humanistic grace notes that even at its most preposterous, viewers will find themselves nodding along, sharing the buzz the filmmaker has so skillfully created."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "Inherent Vice is a film about a stoner which itself seems stoned. This is just one small part of what makes it distinctive."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "Joaquin Phoenix and the terrific acting ensemble that joins him in this pot-infused '70s-era beach noir create such a good buzz you can almost get a contact high from watching."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "Mr. Phoenix’s note-perfect performance flows on the story’s currents of comedy that occasionally turn into rapids, as the funny ha-ha, funny strange back-and-forth abruptly gives way to Three Stooges slapstick."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "In its graceful superimpositions and its use of water to evoke a more idyllic time (particularly in a rainy flashback set to Neil Young), Inherent Vice is very much a companion piece to \"The Master.\""
    },
    {
      "critic": "Craig Williams",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2014
      },
      "score": 100,
      "summary": "A hilariously louche and ramshackle psychedelic noir, Inherent Vice is an audacious stylistic leap for Anderson, but his risks pay off beautifully. It's an amazing work, capturing the heady vibe of Thomas Pynchon's novel while stumbling into in the great cinematic lineage of California noir."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "The dangers of filmmakers trying to replicate a golden era rather than embrace the present are part and parcel of Inherent Vice, but the ramifications are political as well."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "This movie is so funny, so strange, so wonderfully charmingly deranged."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "Anderson’s seventh feature film is a groovy, richly funny stoner romp that has less in common with “The Big Lebowski” than with the strain of fatalistic, ’70s-era California noirs (“Chinatown,” “The Long Goodbye,” “Night Moves”) in which the question of “whodunit?” inevitably leads to an existential vanishing point."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "The film is stupendous: as antic as Boogie Nights and Punch-Drunk Love, but with The Master and There Will Be Blood’s uncanny feel for the swell and ebb of history."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 90,
      "summary": "Inherent Vice is like that; you’ll have to enjoy it for the pileup of exquisite images and hilarious episodes, and let go of the need to hold the whole thing in your head, or you won’t enjoy it at all."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 90,
      "summary": "Inherent Vice isn't the towering masterpiece that those who admired There Will Be Blood and The Master were probably hoping for, and thank God for that. It's loose and free, like a sketchbook, though there's also something somber and wistful about it — it feels like less of a psychedelic scramble than the novel it's based on."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 90,
      "summary": "It all serves a portrait of 1970 California that mixes absurdity with an air of looming cataclysm, a volatile formula that wouldn’t work without Phoenix’s performance."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 88,
      "summary": "The virtue of Inherent Vice is that we can stop chasing the tale and just enjoy the sunset of the ’60s dream."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 88,
      "summary": "After a while, you may suspect that things aren’t adding up. Later still, you begin to realize they may never add up."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 88,
      "summary": "For some of us, Anderson's LA lamentation is a siren song, and there's no more ardent and poetic chronicler of California mythology."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 83,
      "summary": "The problem with Inherent Vice, and what keeps it a step below \"The Master\" and \"There Will Be Blood\" and Anderson's best movies, is that all the Pynchon threads and dead ends come apart in the middle and aren't really pulled back together."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "Inherent Vice constantly teases at a complex meta commentary on the other movies it brings to mind, but never totally gets there."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "Big, wonderfully oddball, sometimes confounding and beautiful, Inherent Vice supplies good dosages of stoner giggles. But its doobage is potent and reflects some heavy ideas you’ll need to unpack and meditate on for a long while."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "If not quite on a par with PTA’s best, this is still a richly intoxicating brew of humour, violence and melancholy."
    },
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "Take it from us — ignorance is bliss. The less you try to figure out Anderson’s rambling, mesmerising mystery, the better. Just relax and let this beautiful, haunting, hilarious, chaotic, irritating and possibly profound tragicomedy wash over you. There is nothing else out there like it."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "Inherent Vice is an aggressively weird movie, which you should take not as a warning but as a compliment and an invitation to see it, to let its stoner vibes wash all over you."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "They’ve turned Thomas Pynchon’s work into a slapstick noir homage that doesn’t just reward but demands multiple viewings."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Inherent Vice is not only the first Pynchon movie; it could also, I suspect, turn out to be the last. Either way, it is the best and the most exasperating that we’ll ever have. It reaches out to his ineffable sadness, and almost gets there."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "Inherent Vice, Anderson's sexy, swirling latest (based on Thomas Pynchon's exquisite stoner mystery set at the dawn of the '70s), is a wondrously fragrant movie, emanating sweat, the stink of pot clouds and the press of hairy bodies. It's a film you sink into, like a haze on the road, even as it jerks you along with spikes of humor."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "Anderson has all manner of fun with the tale's whirling, blurring trajectory. His film is like a jubilant spin painting in which the characters have been scattered and splattered to the furthest reaches of the frame."
    },
    {
      "critic": "Josh Kupecki",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 78,
      "summary": "My advice? Relinquish yourself to this hazy tapestry, and let the film take over. Squares need not apply."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "At first glance, Inherent Vice might seem to be a detective story. Look a little closer, however, and it becomes clear that this is Paul Thomas Anderson's idea of a comedy. There's slapstick, lowbrow material, and enough strange characters and \"completely different\" moments to make Monty Python smile."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Director P.T. Anderson isn't generally a guy you go to if you're looking for answers. Questions are more his game, and that's as true here as it was in his far more serious pictures \"The Master\" and \"There Will Be Blood.\" He is a terrific stylist, though, and the scattershot pleasures he's peddling in Inherent Vice may well satisfy those who like style more than substance, or maybe who like their style with substances."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "A kind of companion piece to Altman’s “The Long Goodbye,” and it’s the sort of failure that only a director (Paul Thomas Anderson) of his talents could make – a movie about a stoner private eye (Joaquin Phoenix) in Los Angeles circa 1970 that seems to have been concocted in a stoned haze of its very own."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Inherent Vice is packed with shitfaced hilarity, soulful reveries, stylistic  ingenuity and smashing performances that keep playing back in your head. It may not demand repeat viewings, but it sure as hell rewards them. It's the work of a major talent."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "Inherent Vice’s spiraling, wordplay-happy script never quite resolves the difficulty of adapting this particularly confounding philosophical whodunit, but the film’s groovy sprawl is a fine place to hang out for 2½ hours, as long as, like Doc and his weed-toking cohort, you don’t mind spending a day in a pleasantly disoriented daze."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "A P.T. Anderson film is, by definition, an event, even if this one doesn’t measure up to such absurdist landmarks as Howard Hawks’s “The Big Sleep,” the Coen brothers’ “The Big Lebowski” and Robert Altman’s peerless “The Long Goodbye.”"
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 70,
      "summary": "Never quite transcending the sum of its agreeably disparate parts, IV is less groovy than gnarled and goofy, but in a studied way. Call it an acquired taste with a kinky savor."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "Like Pynchon’s novel, it’s a little insular, too cool for school. It’s drugged camp. Some of the plot points get lost in that ether — it’s actually less coherent than Pynchon, no small feat. It’s not shallow, though."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "Only fitfully does the film manage the kind of lift-off as that achieved by Pynchon's often riotous 2009 novel and, most disappointingly, it offers only a pale and narrow physical recreation of such a vibrant place and time."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Tonally askew (Altman-esque one minute, Austin Powers-esque the next), Inherent Vice is a sun-glared, neon-limned muddle of noir plotline and potheaded jokery that not only doesn't make sense, but actually seems to try hard not to."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Well-acted, intermittently compelling, often incoherent but always offbeat, Inherent Vice is a twisting story about twisted California stoners. Think of it as a film that's meant to be experienced, more than fully understood."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Anderson loses his way, failing to thin out the novel and its overload of characters, piling scene upon scene that neither amusingly complicates the plot, nor advances it. Phoenix, however, is never less than fun."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Anderson's film is something to be experienced, like a psychedelic drug trip where the journey trumps the destination. Unfortunately, his journey just didn't do it for me."
    },
    {
      "critic": "Dan Callahan",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "It's a lengthy burlesque on paranoia, on conspiracies both real and imagined, so dazed in its color schemes that Anderson clearly wants you to get stoned watching it. But the sense of being blissfully out-of-it, which can have its pleasures, soon drifts into another aspect of drug use: detachment."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "This is what makes Anderson's film so infuriating. It's so damned irresistible -- until it becomes so damned insufferable, getting lost in a marijuana fog of poorly explained plot developments and indecipherable twists. Still, it's hard to look away for fear of missing some other equally inspired flourish."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 38,
      "summary": "Inherent Vice, meandering even by Anderson’s standards, is easily the worst of his movies, a soporific 2½-hour endurance test."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Though I knew P. T. Anderson is an amazing director, I wasn't sure how successful he would be adapting Thomas Pynchon to the big screen. Mr. Anderson did not disappoint. He does a great job of capturing the stoned vibe, weirdness, and zaniness of the novel. There is a lot in the book that didn't make it into the movie, but it would have been next to impossible to jam all of the book's plot in there. I'm grateful that Mr. Anderson decided to adapt this novel because Mr. Pynchon's weirdness is definitely compatible with the director's style. The cinematography is wonderful. The pacing is just right for the source material: I felt hypnotized by the dialogue - I actually felt stoned after the movie was over. Joaquin Phoenix's portrayal of Doc Sportello is a comedic tour de force. Josh Brolin does an outstanding job and Katherine Waterston does a fine job as the femme fatale. The movie was hilarious and I thoroughly enjoyed it. Seeing as how I'm a  huge Thomas Pynchon fan, it was thrilling to see this masterful director and these virtuoso actors transform the offbeat novel into a thrilling, enjoyable film.",
      "total_reactions": 6,
      "user": "frankrog29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "The Rockford files on acid. The way the artists could shift gears from drama to slapstick, then back, impressive.",
      "total_reactions": 6,
      "user": "Busdrivermike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "If you'd have asked me to rate this the first time I saw it, it would've been around a 3 or a 4. It was very hard to keep up with the convoluted plot. I personally don't know who could've ever kept up with it! But then I gave it another viewing, just going with it (as many sites and reviewers have suggested), and I loved it! The atmosphere is wonderful and it feels like it came straight out of the 70s. I noticed a lot I never noticed before and some of the movie is just plain silly (in a good way; silly dialogue). I definitely recommend this movie, just enjoy it for the aesthetics and laughs rather than trying to remember everything that goes on and every named mentioned (or you won't enjoy it). Then again I haven't read the book either, but I'm intrigued to do so now. Also, I wouldn't compare this in any way to The Big Lebowski.. It's nothing like it. There's really nothing like this movie. It's definitely neat and original.",
      "total_reactions": 4,
      "user": "BrushedRed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Genuinely funny, trippy neo-noir sees stoner PI Phoenix trying to unravel a case while being out of it all of the time. Beautifully shot, first rate direction and strong performances across the board make this the best film making the rounds. Phoenix and Brolin are excellent.",
      "total_reactions": 3,
      "user": "manofthemoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "A great experience. Many chuckles; one intriguing character after another. Much unresolved, but that is so true to Pynchon. Best movie I've seen in years.",
      "total_reactions": 2,
      "user": "epatas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I love films like this for the most part and Inherent Vice is no exception to that. Perpetually in a drug induced haze, Detective Larry \"Doc\" Sportello, portrayed brilliantly by Joaquin Phoenix, stumbles around trying to solve a case he cannot quite wrap his head around. Hell, there may not even be a case. But, what is certain is that he has no idea what is going on and neither does the audience. Impossible to follow and impossible to wrap your head around, Inherent Vice is a film that gives you a bunch of different puzzle pieces from different puzzles and tells you to put them together. Yet, in spite of that, I loved it. Our confusion mirrors that of Doc and really makes the film and enjoyable watch. It also does not hurt that it has a stellar cast on top of Joaquin Phoenix, including Benecio del Toro, Josh Brolin, Reese Witherspoon, Katherine Waterston, Joanna Newsom, Michael K. Williams, and Martin Short. No one other than Phoenix has that much screen time, but what they are given, they knock out of the park. The direction and writing from Paul Thomas Anderson are stellar as always. The film also does a great job capturing the drug-induced era it is set in and is a beautiful snapshot of the less than nice areas of Los Angeles in the 1970's. If you are comfortable not knowing what the hell is going on, but are willing to still sit there and try to piece together this possibly unsolvable \"case\", Inherent Vice is the film for you. Though it may not make much sense, Inherent Vice is just a really enjoyable and really, really well made film that even if the \"plot\" does not do it for you, there should be enough here for you to appreciate.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Ten minutes in, I think this is a brilliant movie.  An hour later, I am frustrated by the choices the Director has made; an hour later I wonder why this story was told at all; it seems designed to annoy and frustrate the viewer...as much as I tried to appreciate \"The Master\", I now feel that the Director is way too focused on style over substance, and the storytelling of \"Boogie Nights\" is nowhere to be seen.  All the more frustrating because I wanted to love this film.",
      "total_reactions": 1,
      "user": "Johnrieber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "If The Big Lebowski had been a two-part episode of The Rockford Files, it would have been Inherent Vice. Except, it would have been a lot better than Inherent Vice.",
      "total_reactions": 1,
      "user": "tommyjonq"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "It's a sort of absurdist/stoner \"comedy\" which isn't that funny",
      "total_reactions": 6,
      "user": "dave89791"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Really like an 82-83. Not the best film of the year to be sure, and a great deal of people won't like it. I enjoyed it immensely, Joaquin Phoenix and Josh Brolin are fantastic, and I am always intrigued by PT Anderson's choices as a director, even if I don't agree with them. While I wouldn't count this as PT's best, I enjoyed it just as much as I did \"The Master,\" which was one of my favorite films that year. At year's end, the best films I've seen have been The Grand Budapest Hotel, Boyhood, the sadly under-rated Blue Ruin, Nightcrawler, Inherent Vice, and Whiplash. I am still very excited to see J.C. Chandor's \"A Most Violent Year\" as well. You might not enjoy Inherent Vice much (maybe not at all), but if you have enjoyed PT Anderson's films in the past, it will at least be an interesting experience. Not for everyone, but it's easily one of the most interesting films this year, and certainly one of the better.",
      "total_reactions": 9,
      "user": "WarriorFight"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "This is the perfect movie for insomniacs. Or people who actually LIKE Thomas Pynchon novels. Only two things will disturb your rest. Josh Brolin, in his relatively limited screen time, manages to inject actual energy into his role. It's worth staying awake to see him. And, of course, Katherine Waterston bares all, and that will surely wake you up. Personally, I was glad when I needed to leave the theater for a while and use the facilities. The folks selling popcorn and soda pop were more engaged than anyone on screen ('ceptin' Brolin, of course).",
      "total_reactions": 4,
      "user": "Pang"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Not for everyone, to be sure, but I loved it.",
      "total_reactions": 4,
      "user": "KoolAde9"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "I do believe everyone is entitled to their opinion, but how a single person was entertained by this film is beyond me.  PTA has some great work under his belt (There Will Be Blood, Punch Drunk Love, and Magnolia personal favs) and this is easily his worst and least entertaining piece to date.  Joaquin mumbles his lines, random characters babble nonsense, a scene ends with an obscene gesture, rinse and repeat.  There's no denying there are some great \"meandering\" films out there, nice camerawork and good actors will only take you so far with a screenplay like this.  This was a shrill experience and one of the worst art-house films I've seen in a while.",
      "total_reactions": 4,
      "user": "Elijah1990"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "Does the world need another cinematic stylist whose visual talent is exceeded by his capacity to bore audiences.  How about some storytelling basics?  I mistakenly bought into reviewers' claim that this was somehow a companion piece to Altman's \"Long Goodbye\" and, once again, found myself staring at my watch.  After this empty exercise and \"The Master,\" I am off PT Anderson for good.",
      "total_reactions": 3,
      "user": "Insomniacker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Inherent Vice is the most enjoyable, funny and gripping movies of the year. It symbolizes and homages Tarantino, Drugs and Comedy in a way nobody has ever seen before. Joaquin Pheonix gives us a splendid performance as Doc Sportello and Josh Brolin gives a good performance as well. The chemistry between the two is funny to watch and very well written as well. The cast of A listers also does a great job. The sheer enjoyment of watching a funny, relaxing 60's drug fulled drama is just... Perfect. Inherent Vice is a movie, you need to catch on the big screen with a soda and popcorn in your hands. Paul Thomas Anderson really knows what Cinema means.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "If Hunter S. Thompson and David Lynch got together and wrote/directed a comedy, Inherent Vice would be the likely result.  The movie is bizzaro.  Joaquin Phoenix plays hippie dope-head private investigator Doc Sportello, who is trying to solve the disappearance his ex-girlfriend (Katherine Waterston) and her new lover (Eric Roberts), a wealthy real estate developer.  The dialogue, at times, is difficult to hear/understand.   The plot is even more difficult to follow.  All you can do is inhale the psychedelic haze the permeates the movie, let go of reality and let things unfold.  Unfortunately, there isn’t quite enough substance to the story line to sustain the movie’s almost 2½ hour run time.  Joaquin Phoenix, as, always, gives a terrific performance.  The cast is deep (including Josh Brolin, Reese Witherspoon, Owen Wilson, Beneicio Del Toro, Maya Rudolph and Jena Malone).  Brolin is perfectly cast for his role, which is a send-up of the quintessential 1960’s LA police detective.  Martin Short is particularly funny in a brief stint as the immoral and drug abusing dentist Rudy Blatnoyd.  I found aspects of the movie fascinating, but overall, it came up short.  I recommend this movie only if you are looking for something irreverent and off-beat.",
      "total_reactions": 3,
      "user": "Axgrinder"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Joaquin Phoenix and Josh Brolin are good fun to watch. Almost sufficiently Pynchon-esque, references to Philip Lorca Decorcia, Tarantino and south-bay jackie Brown. Some Kubrick-like absurdity. I think the drug confusion could have been expressed better, wish Owen Wilson and his baggage had not been dropped in. I wonder if PT can make a film relying on caricatures a little less, Magnolia comes close. Perhaps 15 minutes could have cut out with no damage. All these comments are trifles; there is just so much more here than you get these days. The film is not for everyone. Not for a lot of people, actually. I had a great time.",
      "total_reactions": 17,
      "user": "CMC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "A thoroughly entertaining joy ride through the drug infused world of the stoner gumshoe protagonist, Doc Sportello.  It's like a zany complex doped up Raymond Chandler just let it all loose in early 1970's California.  I laughed throughout the film and felt the amazing contact high the film offers.  Can you follow the twists and turns of the plot?  Not without a lot more drugs you can't!  And who even really cares about the narrative anyway.  Expect to walk out of the film with a smile on your face and severe case of the munchies.  WARNING:  Don't watch this film if you have a stick up your but.  It will only make things worse for you.",
      "total_reactions": 5,
      "user": "JE61"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "From the director of the horrible film \"The Master\" comes another incoherent bore with a running time that's a joke. Inherent Vice is verging on painful to sit through because it really isn't very interesting. I hated this film.",
      "total_reactions": 5,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Phoenix with one of the all-time great comedic performances. It boggles my mind that more people can't enjoy fantastically bizarre films like this. It's f---ing hilarious!!! Comedy of the year, hands down.",
      "total_reactions": 5,
      "user": "MetawalkerAC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Another 'has been' director that should quit making movies.  Whoever gave him the money for this should be arrested and their assets frozen for all time.   Judging by the number of people with me in the theater who got up and left this will probably and hopefully be the last anderson film ever.   I love this guy, 'hard eight', 'boogie nights' and 'magnolia' were great films.  'magnolia' is hard to watch but it's at the top of my favorites.   Everything about the movie is genius.  But this movie looks like a bunch of bored, rich actors run amuck.   The movie is insulting and I'm not sure if that wasn't really the point.  To make a great movie you have to get about a 100 things right all at once.   This movie is 0 for 100.  It's not just that it's not funny or entertaining.  It's nothing.   Or, maybe I just wasn't stoned enough ....not sure if there is enough weed in cali to make up for it though.",
      "total_reactions": 5,
      "user": "thatguythere"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "INHERENT VICE is utter nonsense and unfortunately made me realize that except for MAGNOLIA, I don't really care for the films of Paul Thomas Anderson. There is no denying the talent of this masterful director but it's all so sophomoric--look Mom what I can do! INHERENT VICE is pointless with little depth beyond masterful direction, wonderful cinematography, and great production design. The film looks like the 70s but what's really the point? This is basically THE BIG SLEEP set in the 70s. Which means INHERENT VICE is essentially a remake of Robert Altman's THE LONG GOODBYE without the humor or disdain. An ambitious empty exercise.",
      "total_reactions": 7,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "No amount of weed could make this movie enjoyable. It's makes me wonder if PTA has ever smoked weed, and made this movie about what he think its like to be a stoner. Plain and simple, it sucks! No PANICAKU!",
      "total_reactions": 7,
      "user": "UCSD1978"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "This film is so wrong for so many reason. No plot. No characters. No sense. Its like a horrible hangover. I felt stoned.....in a bad way. I have such high hopes for this, but man. what disappointment I love P.T. Anderson but he really let me down.",
      "total_reactions": 7,
      "user": "kinoralph"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Everything you would love from PTA! The acting is amazing, and the way the film is directed is fantastic! Probably the best movie of the year! This turned out to be one of my favorite movies not just of today, but of all time!",
      "total_reactions": 9,
      "user": "PTAandKubrick"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "I went to see this film reluctantly due to the fact that the trailers made it look like a ridiculous pot smoking-infused version of American Hustle, which I loved, and didn't want to see \"ripped off\"!",
      "total_reactions": 9,
      "user": "olive4863"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "It's sort of a murder mystery. But there's no suspense. Oh and it's also sort of a buddy cop movie. But we don't actually care about anybody. Oh and it's also like, sort of a tragic romance. But there's no love in it.",
      "total_reactions": 13,
      "user": "sanserif"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "I haven't read the Thomas Pynchon novel, but if it's anything like the movie I wouldn't make it thru the first chapter. Set in the early 70s, this California noir revolves around private eye Doc Sportello (Joaquin Phoenix, who is fun to watch) as he talks and talks and talks in convoluted language about the confusing plot. The story is hard to follow and director Paul Thomas Anderson's oblique style and often-unblinking camera make it even more frustrating. Despite the sparse sprinkling of jokes and the stoner sensibility, the deadly pacing make this meandering mystery a tedious exercise in self-conscious cinema.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "The film making exhibited here is superb, and the acting is great from a stellar cast. However, the incoherence of the plot kind of sucks the life out of it. I am told that the source material is similar so I guess in that respect its just faithful the Pynchon novel. However, in this respect it is fairly typical of a lot of films these days, it seems very hard for someone to make a film with a clearly presented story, and it means that in the end the film ambles to an uncertain finish.",
      "total_reactions": 4,
      "user": "AtomicDog"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Not stupid or pretentious enough to even waste time seeing this.  If you're not onto this sham of a director and his complete lack of talent and story-telling ability, then you deserve what you get.  He's a writer who doesn't outline or have any respect whatsoever for the audience.  He is anti-audience, anti-Hitchcock, anti-structural coherence.  Self indulgent prima donna that never bothers with endings much less what leads up to one.  Yet it gets an 81 from critics on here just showing the very unreliable nature of this site's worthiness and worse just how pompous, out of touch, and just plain stupid most film critics are these days.  Boycott their reviews, write in demanding their firings, etc.  Anything to get the jackasses out.",
      "total_reactions": 4,
      "user": "AxeT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This reminded me of Tarantino storytelling meets the Big Lebowski, crossed with Fearing and Loathing in Las Vegas, I watched it (all 2 1/2 hours of it) and I'm not sure what the h*ll I just saw. Pheonix was dynamic in his leading role and the constant appearance of other actors in minor roles, made for a reason to stay awake. If nothing else you can sit back and try to figure out how all of the things that happen somehow tie together. Or when the movie is over, you can wonder-\"thats it?\"",
      "total_reactions": 2,
      "user": "geedup"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "This movie is hilarious!!! There are scenes that will leave you with so much laughter you will be embarrassed how much you are enjoying this movie. Wondering which plot devices are imagined and which are real is perhaps the best part of this story. It makes you never want to try drugs for any reason that is for sure!",
      "total_reactions": 2,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Being a fan of several of PTA's films, I absolutely loved this film despite not having read the book it's based on. It's definitely one of his lighter-feeling films compared to some of his previous works, such as Magnolia and There Will be Blood. The film had a lot to offer. It was surprisingly funny on several occasions and didn't take itself too seriously. The whole entire ensemble cast also manages to put on a grand show. Joaquin Phoenix made for a great and funny lead. Josh Brolin also had several funny moments. Overall, it's definitely another great addition to PTA's directorial filmography and one of the best films late 2014 had to offer!",
      "total_reactions": 2,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "Ridiculous exercise in tedium.  I can't imagine a more unappealing character  than the one Joacquin Phoenix plays, and plays badly.  There are a few funny moments in it, but for the most part it's false, pretentious, and ridiculous.  Seriously;  this is what allegedly smart, indie films have become?  This is now what passes for good cinema?  Phew.",
      "total_reactions": 2,
      "user": "5thStFreddie"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "After Einstein created the Theory of Relativity everything he did had credibility and huge value. Same with PTA after There Will Be Blood. This movie is delightfully entertaining, superbly acted and a literature lovers dream. If you feel within a fog the first time thru that is about how Doc Sportello feels.",
      "total_reactions": 7,
      "user": "Proteus"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "I suppose it's supposed to be a movie like the 70's noir classic Night Moves with Gene Hackman--but the plot is very hard to follow. This is because the main character is stoned throughout the movie--along with every other character. It was honestly a huge slog to get through. Maybe if I could have followed the plot, I would have enjoyed it more. Also, it's supposed to be a comedy? Maybe? It was a lot like being around actual stoned people at a party who think they are hilarious. They aren't--and neither was this movie. It is very well shot--and the costume and set design looks AMAZING. The music is also fantastic. I gave it a 3. Sorry--but I think it stinks.",
      "total_reactions": 10,
      "user": "Prosmooth"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "gimmicky, pseudo-hip nonsense from the usually great Paul Thomas Anderson. This film along with his last one, the Master, have both been dull and not a shadow on the great 'There Will be Blood.'",
      "total_reactions": 5,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "A largely disappointing stoner noir crime comedy that promises more laughs in its trailer than it actually delivers in the finished product. When the movie is on, it's hilarious, but those bits are so few and far between that it hardly seems worth it, especially since the narrative padding linking those moments is so uninteresting and convoluted that no one really cares. The film ultimately comes across like an attempted fusion of \"The Big Lebowski\" and \"American Hustle\" but doesn't come close to matching the quality of either of its predecessors.",
      "total_reactions": 5,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "This movie really plods along, making it very difficult to stay awake. The Art Direction was beautiful, the acting was terrific, but ultimately the story was incoherent.",
      "total_reactions": 11,
      "user": "Lancev"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "Tedious, pointless, a wast of time. Just can't believe how a great director who has made brilliant films like Boogie Nights, Magnolia and The Master could squander effort on something so meandering and facile.",
      "total_reactions": 3,
      "user": "movieboy"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "I've seen this movie twice, both because I'm a PT Anderson fan, and because on first viewing, I came out scratching my head, and I thought that I might be missing its merits.",
      "total_reactions": 10,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "PT Anderson seems to continually make well acted films which start out promisingly and then go absolutely nowhere.  It's almost his own genre, with the Coen brothers sometimes churning out similar fare when they feel bored.  I'm starting to think Boogie Nights was a fluke, because he totally nailed everything on that film and outdid the Altman and Cassavetes films he was emulating. Nowadays his movies just feel like an Altman movie that gets eaten by your VCR halfway though. When the tape clears you just see that it was taped over a german scat  porn, one where a director is trying really hard to take a dump on a reel of 70mm film. In the end the results are a lot less exciting than we could hope for.",
      "total_reactions": 11,
      "user": "SleepytimeTea"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "This is the worst crap i've seen in 33 years. I'd rather watch AVP2 10 times in a row than ever have to watch this again. It's boring, slow, not funny, confusing, and without a sense of direction, typical of Paul Anderson latest stuff. But the worse of it all is that it's crowed with A-List actors, and not one, except for Joaquin, can add up anything that's worthwhile. It's crap, crap, crap....",
      "total_reactions": 9,
      "user": "regalone"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "This is the worst possible kind of time-wasting DVD ... the cast & quirks are good enough that you can't watch while multitasking, yet the loose mumbling & vague plot are just not that interesting. Joaquin Phoenix wears the same expression on his mutton-chop mug throughout, that of a clueless Wolfman Jack. He's supposedly a private investigator, but he never seems to have a case (or means of support?) and never investigates anything except the fate & whereabouts of his ex-girlfriend. There are smatterings of \"L.A. Confidential\" -- minus the wrenching emotion -- and some droll & delightful turns by an excellent supporting cast. Honestly glad when this meandering thing was over, though.",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Inherent Vice tries really hard to be The Big Lebowski but lands quite a bit off mark, ending up somewhere close- it's an enjoyable film, all in all- but falling just short in every important way. The gags aren't as funny and the story is much harder to follow, to the point of being incoherent. Of course, this style of narration is meant to mimic the experience of a hallucinogenic experience, and I suppose it succeeds in doing this. If you're into psychedelia and dig what was going on in California in the 1970's, then you should enjoy this film. But , in the end, Joaquin Phoenix's \"Doc\" is no \"Dude.\"",
      "total_reactions": 1,
      "user": "gimmedatsammich"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "This movie sucked c**ks alright! Apart from Joaquim Phoenix brilliant performance - like he always do - this movie is a disaster. I can't remember watching such a long, dull and confusing movie since I don't know when, and it looks almost impossible it was made by the same guy who did the very good \" There will be Blood\". Safe to say I'll never touch a book written by Thomas Pynchon...",
      "total_reactions": 1,
      "user": "currer_bell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2015
      },
      "score": 1,
      "text": "What a horribly boring film. I could feel myself age minute by excruciating minute. I tried to bear with it, with its cameos by A/B-list celebs but Phoenix's character was uninteresting along with the grit of the early '70s in Calif. It smacks of a straight-to-tv movie they used to feed the public back then. Waste.of.time.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Possibly PTA's worst film, but...still a good film.  It is a bit long, and slow at times.  Maybe the director wanted to create the feeling of being high ?  I don't know.  Its also very hard to follow along as many key plot points are said in low tones or a whisper.  You need to be ready to pay attention but there is some humor and I love the 70's nostalgia, and the plot is all over the place.  (Keeps it interesting despite the slow pace at times.)",
      "total_reactions": 1,
      "user": "3ebfan511"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "I really disliked Joaquin Phoenix as an actor before this film. But he pulls it off. The roll he plays, a dumb dope fiend/clever private eye is basically a contradiction. But in his hands it just works. Its the little thing he does. Like crying a single tear as his weed is destroyed that really sells it.",
      "total_reactions": 1,
      "user": "Gamed2long"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Of course, with Paul Thomas Anderson directing and Joaquin Phoenix masterfully acting alongside Josh Brolin, this movie is a marvel.",
      "total_reactions": 1,
      "user": "Argeon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "In the world of PTA this may be my least favorite, but I still appreciated it.  The main flaw with the film is it has to many characters and at times you just can't follow.  Joaquin Phoenix and Josh Brolin really make this film go.  Bottom line I'm really interested in a second viewing.  B",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "What the hell did i just watch, a thriller? comedy? action movie? well i don't give a damn, got bored like a  huskey, and wasted 2 hours of my boring life. I don't even know how to explain what this movie is about, because i didn't understand s**t. Maybe i should've been stoned to enjoy it, but i doubt it.",
      "total_reactions": 1,
      "user": "zouz123"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Excuse my incoherent advice of this '70's pot- smoked smog- filled Los Angeles true detective flick.",
      "total_reactions": 4,
      "user": "hotfromcauldron"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "It is a half-comedy half-detective movie. And there is quite a lots of confusion. The characters whisper a lot throughout the movie which made me difficult to understand what they were talking. The flow of the movie is a bit slow. I saw a few people fell asleep in the cinema. Nonetheless, it is a not a bad movie.",
      "total_reactions": 1,
      "user": "yezo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "When I started watching the movie, it looked promising... but after the first half hour, my stomach started to turn and I realized I was watching a really, really bad movie.",
      "total_reactions": 3,
      "user": "mertz109"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Even it's a touch long, the pace and cadence of the action - especially the dialogue - is never boring and mostly very funny.  It's probably my favorite Joaquin Phoenix movie - and my favorite Josh Brolin film. Unfortunately (and it's really not a knock on this film), it's not close to my favorite PT Anderson film.  Punch Drunk Love, There Will Be Blood, Boogie Nights - those were massive achievements. This is more light, breezy entertainment.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Strange, incomprehensible and alluring. Mostly a character driven dialogue affair. The plot doesn't make much sense, which is exactly the point, but it kinda hurts the film at the same time since so much time is spent talking about it. What you get is nostalgia, and melancholy, and hilarity, great acting, witty dialogue and a solid soundtrack.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "Inherent Vice is a pretty hilarious movie about... Something. I'm not entirely sure what, but that might well be the point. It's like a patchwork of random moments flitting in and out of existence. Lay back, switch off and just let the film wash over you like a clambake haze and good times are a certainty.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "A truly extraordinary movie, a time-capsule of the social war between hippies and straights in the late 60s and early 70s. The dialog is incredible, sharp and quite often hilarious. Bits of craziness thrown in emphasise the free-spirits, and the anal establishment. The plot is incomprehensible mostly, just like living then. If you watch and remember carefully, the 80% of red-herrings eventually drift away, the avalanche of new information becomes a kind of fireworks festival of noise and colour. Joaquin Phoenix is almost a pinball bouncing around the plot and settings. Amazing performances throughout, almost surreal. A Triumph!",
      "total_reactions": 0,
      "user": "donelson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Before watching Paul Thomas Anderson's latest labour-of-love, I  am quite puzzled how come this film hovered under the radar almost entirely in the past Oscar season, since PTA is pretty much in his heyday both in his career path and artistic creativity after THERE WILL BE BLOOD (2007, 9/10) and THE MASTER (2012) , with only two minor Oscar nominations (Adapted Screenplay and Costume Design), its box office journey is also underperformed, a meagre $8 million after its domestic run.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "\"WTF is going on in this movie?\" this is the only thing that I kept thinking, its like the screenwriters were just as doped as the charecters portraid. It has good acting and filming, but I had no clue whatsoever",
      "total_reactions": 0,
      "user": "VonSeux"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "With \"Inherent Vice,\" we see yet another product of director Paul Thomas Anderson's ever-vivid post-There-Will-Be-Blood trot into the realm of the experimental narrative. Granted, the film is an adaptation of the eponymous novel from Thomas Pynchon, it still feels as though the notoriously elusive author specifically wrote this story with Anderson's eventual film in mind. It has a brow-furrower of a plot, some double-take-worthy moments of lunacy, and an utterly odd feel to it overall that should please PTA die hards. For me, though, it just didn't quite hit me as squarely in the chest as I was expecting and I'm not really sure I enjoyed the overall experience. And though I'm in no way off the PTA fandom express, I may be slightly inclined to worry for the man's health. Slightly.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "It's really sad that PT Anderson doesn't still feel comfortable with the director's tricks he used in his early films (the long opening sequence of Boogie Nights speaks for itself) or the visual imagery of Magnolia - but Inherent Vice is better than most this year: it's demanding, masterfully acted (Joaquin Phoenix and Josh Brolin are hilarious caricatures) and, with that 70s vibe flooding around, well shot. Sure, the number of characters and subplots make it difficult and really require the viewer to pay attention - just like Pynchon would have wanted.",
      "total_reactions": 0,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Epic  surreal movie, fun and rare with a perfectly",
      "total_reactions": 0,
      "user": "KarlTrol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Clever and complex script populated by very bizarre characters led up by Doc Sportello played very well by Joaquin Phoenix. All the supporting players are very good as well and it's directed with a certain hypnotic rhythm that tunes in well with the overall theme of hallucinogenic drug use that runs throughout. It's a very strange trip through 1970\"s California and not for everyone’s taste.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "While PTA has been in a somewhat slump (compared to his other films) recently, Inherent Vice is still fun to watch if you know what you getting into. The Performances, production design, and costumes are amazing, and the aesthetic really gives off the '70s vibe. However, the plot is disjointed, the cinematography is a bland, and the dialogue mainly consists of two characters talking about another character that is elsewhere. Overall, it is fun to watch if you are a PTA fan, or know what you are getting into.",
      "total_reactions": 0,
      "user": "dfelesina"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I'm still not really convinced I understand a lot of what happened in this movie--it's the kind of film where the problems all compound until you lose track of the threads, and wait patiently while they're (partly) disentangled.  It's definitely a movie that I want to see again, because I feel like I must have missed a lot of flags along the way.  It was a fun struggle to try to keep up with Joaquin Phoenix's drug-fuelled antics, as he followed one lead after another until the problem was so much bigger than I imagined at the outset.  The film also has an incredible sense of humour, and the antagonistic dynamic between Joaquin Phoenix and the police officer Bigfoot never gets old.  The costume design and setting was wonderfully organic.  It's a difficult movie to follow, but it's a rewarding trip.",
      "total_reactions": 0,
      "user": "heatherm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "A biting look at early 70's culture. The transition to adulthood for all those rebelious hippies. It's contrived, disjointed but, that's the point! That's how our main character feels in this scary, conspiracy laden new reality.",
      "total_reactions": 0,
      "user": "Dodenkyshen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "What a horribly made movie, as well boring.  After reading the critics' reviews, I was hoping for a really good movie, but it was so disappointing.  The sound was horrible and wish that today's movie would improve upon delivering clear dialogue.  There is no excuse, especially when one can pull up a 40's movie where the audio and sound is so much more crisp.  Today, the audio/sound is all left up to artistic interpretation of the movie, by whom, I do not know.  But, there was so much dialogue in this movie that was lost in the translation due to the poor audio.  Given that, the storyline was so shallow, boring, leaving one thinking that sooner or later something good/important was about to happen.   Oh well, so many other better movies made this year.   Last, the movie could very well done away with the monotonous female voice speaking throughout the movie, describing the emotions, whatever, of the movie.  Pathetic.  People around us, including my friend all were going to sleep in the movie theater, if that tells anyone anything.",
      "total_reactions": 0,
      "user": "OkinAZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "A movie with very good performance by actors specially by Joaquin Phoenix who play hipster i mean he is a hipster in real live that's just to easy for him . Production that will probably be liked by every stoner who watch it very funny and trippy movie. You can watch this movie over and over again and you will still laugh but be careful don't distract by the hot chicks in the movie because they are a lot and of course they smoke weed because it's 1970 .",
      "total_reactions": 0,
      "user": "SmileATT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "this is a good movie",
      "total_reactions": 0,
      "user": "heathereileenoq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Most enjoyable confusion - and a ripping yarn too, in a roundabout way. You really get a sense of late 60s/very early 70s LA, and it is phenomenally entertaining. We sat with silly big grins through the entire movie.",
      "total_reactions": 0,
      "user": "CEIW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Sortilège: \"Coming just in time for Christmas.\"",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "If you want to watch a mindless feel good than don't watch PT Anderson or read Thomas Pynchon. The title itself is difficult to understand (look at what the term actually means) and you'll understand a bit of what Thomas Pynchon is trying to say. Does the movie do the book justice? Hells ya. Would I watch this movie without reading the book? Hells no.",
      "total_reactions": 0,
      "user": "joeleah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I didn't expect to like Inherent Vice but now I'm in love with it. The cinematography and story-line are so organic that they feel familiar and homey.",
      "total_reactions": 0,
      "user": "pryorto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Much like any Paul Thomas Anderson film, this will grow on you. I've come to trust this director after having seen The Master and There Will Be Blood, (Punch-Drunk Love too). If he makes the film then I know there's something worth investigating here. I took my time with this film and watched it multiple times - letting it play even while I fall asleep sometimes. The comedy is rather strong and Brolin and Phoenix give stellar portrayals of their respective archetype. Brolin (brawny cop with a soft side, perhaps) gives off this hilarious anger that he lets loose occasionally, and Phoenix (peace and love private investigator) is very easy-going while peering at the information he gathers through a cloud of marijuana smoke. The one thing that will make his character tick though - Shasta Fay. This film, like anything PTA, must be watched more than once.",
      "total_reactions": 0,
      "user": "Zadaris2021"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Pretty good private eye movie featuring very talented cast, all brilliant in their depiction of hidden truths about society.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "I randomly chose this movie on HBO Go, and much to my delight, could not stop watching. Joaquin is nothing short of a genius, his facial expressions, physical reactions and acting are superb. The movie is mysteriously funny, off-kilter but Immensely relatable. I was drawn into a time and place brought about by superior acting, writing and directing. My hat is off to Anderson, despite some negative reviews, which by the way, are totally undeserving.",
      "total_reactions": 0,
      "user": "clayray5967"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "A book like Thomas Pynchon's \"Inherent Vice\", with its mix of zany characters, offbeat humor, and intelligently convoluted plot meant for serious readers, was made for Paul Thomas Anderson to adapt. It compliments his style in every way imaginable while he still manages to bring original vision and flair to the project. Try to follow me through the summary, if you can dig it.",
      "total_reactions": 0,
      "user": "GerardistheWay"
    }
  ],
  "metascore": 81,
  "name": "Inherent Vice",
  "num_weekends": 3,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 12,
    "month": 12,
    "year": 2014
  },
  "opening_weekend_income": 328184,
  "opening_weekend_income_currency": "$",
  "rating": 6.7,
  "rating_count": 67482,
  "rating_freq": {
    "1": 1865,
    "10": 4181,
    "2": 1285,
    "3": 2096,
    "4": 3599,
    "5": 6811,
    "6": 12344,
    "7": 16447,
    "8": 12903,
    "9": 5951
  },
  "release_day": 9,
  "release_month": "January",
  "release_year": 2015,
  "user_review_count": 247,
  "votes_per_demo": {
    "aged_18-29": 24834,
    "aged_30-44": 24202,
    "aged_45+": 6149,
    "aged_under_18": 179,
    "females": 7040,
    "females_aged_18-29": 3249,
    "females_aged_30-44": 2631,
    "females_aged_45+": 794,
    "females_under_18": 12,
    "imdb_staff": 10,
    "imdb_users": 67482,
    "males": 50089,
    "males_aged_18-29": 21269,
    "males_aged_30-44": 21212,
    "males_aged_45+": 5242,
    "males_under_18": 164,
    "non-us_users": 33788,
    "top_1000_voters": 439,
    "us_users": 12650
  },
  "year": 2014
}