{
  "avg_rating_per_demo": {
    "aged_18-29": 6.7,
    "aged_30-44": 6.4,
    "aged_45+": 6.2,
    "aged_under_18": 7.3,
    "females": 6.8,
    "females_aged_18-29": 6.9,
    "females_aged_30-44": 6.6,
    "females_aged_45+": 6.6,
    "females_under_18": 7.4,
    "imdb_staff": 6.6,
    "imdb_users": 6.6,
    "males": 6.5,
    "males_aged_18-29": 6.7,
    "males_aged_30-44": 6.3,
    "males_aged_45+": 6.1,
    "males_under_18": 7.2,
    "non-us_users": 6.5,
    "top_1000_voters": 5.7,
    "us_users": 6.5
  },
  "avg_screens": 1813.8181818181818,
  "budget": 5000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 13,
    "month": 12,
    "year": 2013
  },
  "critic_review_count": 321,
  "duration": 106,
  "genres": [
    "horror",
    "thriller"
  ],
  "gross_income": 83574831,
  "max_screens": 3155,
  "mc_avg_user_score": 6.7,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Insidious: Chapter 2",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 138,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "A modestly scaled and highly pleasurable sequel to Wan’s low-budget 2011 smash that should have genre fans begging for thirds."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Wan in particular is pacing today's movie horror by reverting to the past. There's a touch of Hammer Films in his haunted house atmospheres, and Roger Corman in his groaning comic relief from the dread."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "Insidious: Chapter 2 may be somewhat uneven, but at a certain point near the end, I realized I hadn’t taken any notes during the second half. For all its weirdness, the film had utterly transported me. Bring on Chapter 3."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "Though Wan is stepping away from horror, at least for now, to direct the next The Fast And The Furious sequel, the latest Insidious entry suggests he’s a long way from running out of new tricks, or at least finding infinite variations on old ones."
    },
    {
      "critic": "Sandy Cohen",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 63,
      "summary": "It offers a good dose of non-gory scares, tells a story of supernatural time travel that recalls elements of “Inception,” and pays homage to the genre Wan and Whannell love."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 63,
      "summary": "The sequel's not bad; it's not slovenly. Some of the jolts are effectively staged and filmed, and Wan is getting better and better at figuring out what to do with the camera, and maneuvering actors within a shot for maximum suspense, while letting his design collaborators do the rest. But Leigh Whannell's script is a bit of a jumble."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Wan remains a crafty enough director to draw your eye warily across the frame. You shouldn't feel so daft for flinching this time."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "The scares are mostly very scary indeed, and that means the film does its job."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 58,
      "summary": "The techniques of the movie, then, are sound. Wan still moves his camera and composes his shots with a patience that belies his dank Saw origins. But the cinematography isn’t as virtuosic this time around."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 57,
      "summary": "Backtracking dilutes the few simple jolts that actually work."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "A puzzle movie with too many unnecessary pieces and not enough essential ones, but it's superior to its predecessor in a few basic ways."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "Continuing directly from where 2010’s \"Insidious\" left off, Insidious: Chapter 2 follows the further misfortunes of the Lambert family with diminishing insidious rewards."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "If Insidious 2 exists solely because Insidious 1 made a ton of money, then at least credit Wan for making quality control a priority."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 42,
      "summary": "Its lack of both originality and any real memorable moments feels shameless and lazy. Adding insult, the movie ends on a cliffhanger, guaranteeing that Insidious: Chapter 3 will soon be coming to a theater near you."
    },
    {
      "critic": "Mark Samuels",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "\"Poltergeist\" goes \"Back To The Future\" with only passable results in a film whose activity is more par for the course than paranormal."
    },
    {
      "critic": "Matt Patches",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Even before Wilson goes full Jack Torrance and Barbara Hershey shows up to investigate an abandoned hospital Scooby-Doo-style, one could technically call this sequel a gorefest—thanks to the guts of every other horror movie being splattered across the screen."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Except where “The Conjuring” invigorated horror-movie tropes with inventive application and strong characters, Insidious only wallows in them."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "This busy-yet-dull sequel feels like Wan robotically flexing his manipulation of fright-film signposts, an exercise more silly than sinister."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Setting aside the movie’s tediously lame dialogue, self-conscious performances and frequently predicable scares, the narrative’s compulsively shifting chronology intermittently manages to engage, although it does little to obscure the distracting shortcomings of both plot and character development."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Comes upon a few quirky solutions and movie-ripoff scares before settling into a kind of coma."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 38,
      "summary": "It is now weighed down by a second half that's equal parts incoherent, tedious, and repetitive."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 37,
      "summary": "A bustling, overly busy mess."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 25,
      "summary": "At the start of Insidious 2, a young woman opens her mouth to speak and someone else’s voice comes out of her. Demonic possession? Nope, just some inexplicable dubbing to kick off this clunker of a horror sequel."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 25,
      "summary": "Insidious: Chapter 2 appears to be the sum of the unusable parts from James Wan's recent haunted house feature \"The Conjuring.\""
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 25,
      "summary": "A full realization of the very worst fears one could imagine when its director, James Wan, unexpectedly emerged from the torture-porn murk with its original, spiritedly directed predecessor."
    },
    {
      "critic": "Charlie Schmidlin",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 25,
      "summary": "Why, besides a stellar opening weekend, does this extended narrative exist?"
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 20,
      "summary": "Insidious Chapter 2 picks up where its predecessor left off-- in abject silliness."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 20,
      "summary": "A mess from start to finish — though, judging by the ending, this story won’t be over any time soon — Insidious: Chapter 2 is the kind of lazy, halfhearted product that gives scary movies a bad name."
    },
    {
      "critic": "Nigel Floyd",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 20,
      "summary": "For all but the most forgiving horror fans, this is a lazy, stupid and incoherent failure."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 11,
      "summary": "Insidious: Chapter 2 is perhaps an even more scattershot mess than its predecessor. Whannell's script is so rife with portentous backstory, third-act goofiness, and a denouement that practically screams \"Insidious 3: Same Old Shit,\" that the film as a whole is jarring, and not in a good way."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Honestly, I feel like they put a lot of thought into this story, they just weren't amazing at telling it. Some things happened so abruptly that I had to ask my fellow movie goers how they got from one place to the other. There are too many spirits to focus on, that look alike, and I don't know which spirit is possessing who, and who is actually dead in the further, and apparently you can time travel while in the further, and it was just sort of confusing. I feel like they made things up mid story just to make the story tie in and work. The acting on Rose Byrne's part was good, and for a lot of the part I thought Patrick Wilson was decent as a possessed guy... until the end it got kind of cheesy. I've seen this film twice now, and the first time I thought it was scary, the second time not so much, which just goes to show that a lot of the scares are because of the unexpected, rather than because of the unknown and wonder. The horror flicks that mess with your mind are the best kinds, like the Blair Witch Project, Paranormal Activity, etc. This was watchable, for a horror sequel it actually wasn't bad... the music volume has GOT to be lowered though. Good lord.",
      "total_reactions": 2,
      "user": "ROFLoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "This film was as good as the first. Horror films lately to me haven't been putting me on the edge of my seat. It seems that all horror comes down to nowadays  is around 2 scares out of it. Nothing felt original in this movie and more or less felt like a remake with scares from the first one. Even the order of events were the same, \"scares\", arguments, \"more scares\", arguments, get professionals, more and more \"scares\", into dream, and more \"scares\", end. And these scares we've seen way too many times in horror movies and it's time to grow up and think of something new. People around me and my friends were jumping out of their seats and I'm sitting leaning on my hand like \"Really?\" If you scare easily and are a novice to horror movies, I guess you'll get the experience more than I did. But if you're not scared from dark corners and jump scares, which was basically what this movie was like, then I suggest giving it a miss. People will disagree and say the build up in music tenses you. Sure for the first time it happened, not for the 10th time in a row. This feature felt as though it was getting shoved down my throat and I'm getting bored of it. This movie did have a few chuckle moments in it even though they were quite funny. I was honestly hoping it to be a good scare and not be able to sleep last night, but I slept absolutely no bother. Also, at the beginning it shows Elise when she was younger and they dubbed her voice in with the actress that plays her. It was a really lame part of the movie in my opinion. Although, the good things I can say about the movie was that the ending was good and the acting was very believing.",
      "total_reactions": 2,
      "user": "GnasherBurst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "Let me just start off by saying that I am not a fan of scary movies. Jump scare scenes freak the crap out of me, but I managed to make it through Chapter 2, without peeing myself. That's both a good and bad thing, clean boxers, but a sub-par movie. Not seeing the first installment, I can tell you that the movie made full sense to me, and others in the same scenario. The film managed to switch between present, past, and future, which made for a touch I usually don't see in movies, especially without a lot of plot.",
      "total_reactions": 2,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "One of the most lazy and unthoughtful films I have ever had the displeasure to see. Is it a horror film? A comedy? A family drama about redemption? I wish I knew. The film is constantly trying to fit all of the above categories into a film that is so conceited that it leaves you feeling disoriented and annoyed. The movie isn't fun; and it isn't scary either. All of the thrill and scares that the movie tries to bring in come from cheap scares that come from overly loud sounds and somewhat disturbing visuals. The plot makes no sense; even after seeing the first one when it came out, I was left wondering what I was watching. The characters are flat; it's almost as if the director and writer didn't even try to come up with something original. The climax to the film is a weird mixture between The Sixth Sense and The Shining that left me bored and slightly shocked that someone could be so unoriginal. Patrick Wilson plays the only redeemable character in the film, but James Wan's directing is so bad, that Mr. Wilson comes off as a second rate Jack Nicholson from The Shining... only without everything that made The Shining so good.",
      "total_reactions": 2,
      "user": "brandonprows"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "It doesn't live up to James Wan's previous works like The Conjuring or the first Insidious, but it still manages to provide a somewhat entertaining experience even though it does lack fear. The music and atmosphere are still creepy, but the film ends up relying too much on lame jump scares that failed to elicit any sort of reaction. The film also ends up being intentionally funny at times. All of these flaws really should have killed this sequel for me, but there's something about this film that did keep me thoroughly entertained throughout.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "There is something more frightening than any curse or apparition that resides in movies; it is the blight of terrible sequel, and Insidious: Chapter 2 is haunted by it. Audience would come and expect the same terror from the original, but sadly will only find inferior version of it, a formulaic possession horror flick with little charm and plenty of high pitch noises. To its credit, it does bring some good acting and direction. The script also works as a continuation, but perhaps because the mystery has dwindled; it only manages to be an average horror without the same chill its predecessor has.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "The original \"Insidious\" on its own terms works well enough, but its repetitive, unimaginative sequel clearly verifies that director James Wan is overextending in the name of continuing a franchise. \"Insidious: Chapter 2\" isn't a total disaster, but it is a disappointment when compared to the first installment, and Wan's most recent success with \"The Conjuring\" (2013). Despite some clever plotting, interweaving the film's second half with events from the original, it simply lacks tension and falls short on scares.",
      "total_reactions": 1,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "As a fan of the original, I have to say that this one was a let down. So much of this movie makes no sense and characters do a lot of stupid and nonsensical things where as nothing of the such was present in the original. It's also not nearly as scary as the first. The directing, the editing, the writing, everything seems vastly weaker in Chapter 2. I hate to be that guy who says \"It's a bad horror movie sequel to a masterpiece\" especially because I usually don't feel that way, but this time it is the case. Insidious 2 is not worth paying to see, or at the very least is only worth a one dollar rental. At the very least, you'd probably just be better off rewatching the original.",
      "total_reactions": 5,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "James Wan and Leigh Whannell's Insidious Chapter 2 fully delivers in terms of exploring the mysteries left behind in the previous installment, while also expanding on its intriguing mythology. However, the sequel also embraces the first film's quirkier, campier aspects, which makes for a few good laughs, but also some less-than-terrifying horror sequences. It's an excellent horror piece to swivel into the spiral of its previous film.",
      "total_reactions": 12,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "I like the first one a tad more, but this film is still a lot of fun.  I know James Wan is moving on from the horror genre, but I hope not for good the guys got a real talent with making films that mixes scares with a solid sense of humor. B+",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "If you are not a fan of the first movie, don't bother. This movie is extremely cheaply made and really formulaic and unexceptional.  Where I live in england they have a trailer showing the audience screaming at the shocks, to try and get you to go... a technique which works well... unless you look closely and realise the audience members screaming look like 12 year old girls.  Really not one at all for any adult over the age of 20 unless you are really really bored.",
      "total_reactions": 8,
      "user": "Rex_richards"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Considering this is a sequel and sequels are usually rubbish, James Wan does a brilliant job of taking us straight back into the action and exploring the universe he's created in even more depth. If you loved the first film I'd be very surprised if the second one doesn't hit home. Another visionary masterpiece from the best horror director around right now",
      "total_reactions": 6,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Liked the original but thought this film was just a recycling that was no where near as good. Incredibly boring, Not scary, and rather predictable. Would not recommend.",
      "total_reactions": 4,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "I really enjoyed this movie.  I was so scared I was shivering!  A nice continuation of the story.  I definitely recommend to anyone who enjoyed the first one.  I'm no movie critic but I can say I was very entertained.",
      "total_reactions": 4,
      "user": "Limings"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "When viewed as a continuation of the first installment, Insidious: Chapter 2 is seamless. There are jumps and gasps galore, a haunted hospital, the proverbial \"woman in white\" ghost, and an interesting subliminal message about domestic violence. What's not to love?",
      "total_reactions": 2,
      "user": "MB1097"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Especially for a sequel, Insidious 2 is really quite a success. I enjoyed it a lot, and so did the person I went with. The whole theater jumped at several points, myself included. Great job, James Wan.",
      "total_reactions": 2,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "What a disappointment. This is one of those films that focus more on storytelling than actually making it enjoyable. Unlike the first film, almost all scares were predictable, it wasn't creepy, it wasn't that suspenseful, and it had only ONE effective scare. I can't believe I wasted $16.00 to contribute to its box office money.",
      "total_reactions": 2,
      "user": "kewlgeek555"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "its nice chance to see another part from Insidious..as we rarely find good horror movie these days..some people don't like old lady but she is or he really scares me with that over makeup ..best of luck to part 2..we are waiting a lot",
      "total_reactions": 2,
      "user": "sam_cold"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It may not be better than the first one, but there are a few good scares. I enjoyed how it explains a few unanswered questions from the part one. Still better than a lot of current horror films",
      "total_reactions": 2,
      "user": "rat1788"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "This movie like the other one isn't scare at all, sometimes is ridiculous, the story just like the other one doesn't make sense  sometimes, it has the same mistakes than the other one, if you doesn't like the other one do not expect that one to be better...",
      "total_reactions": 2,
      "user": "victorhjkl"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Chapter 2 will surely be a greatest hit on this years scale.",
      "total_reactions": 4,
      "user": "Aedrone12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Insidious, Chapter 2 takes a lot of effort to enjoy this creepy, fun, and scary. Much like the first one, this sequel has some few good scares and other was weird backstories with complicated sets that are too silly, but it's a worth to enjoy!",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Insidious 2 may not be as memorable, good or as scary as its fantastic predecessor, but it certainly is an intense, funny and at times surprising thrill-ride filled with beautifully spooky set-pieces and fantastic sound-design. Though at times not feeling like an Insidious film, it is still a faithful sequel albeit not on par.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I just came back from the theatre and I cannot express enough the genius of James Wan and how he directed this film. It's weird at first because it seems to start slow. After 20 minutes I started asking myself whether I wanted to continue to sit through or get up and leave and wait for the bluray version, But, DON'T LEAVE! It starts connecting and leading the viewer to places you've been familiar with in the first Insidious. Scarier..... about the same. Eeery..... just as much as the first. More screams and bumps in the night..... Definitely! And, this one even has some comedy from the ghost hunters. So glad I watched this and will be buying it when out on bluray!",
      "total_reactions": 1,
      "user": "coreyg007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It may not be as good as \"The Conjuring\" or even the first \"Insidious\" movie, it is still a pleasure to have some good old fashion scares. Overall, a surprisingly good sequel. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "A less scary but a well pulled off sequel to one of the best horror movies of the decayed. A expansion in a rich story, excellent script and a all round out standing performance. Something not so easily pulled off in horror movie sequels. Worth your time and money can't wait for another!",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "I was hoping this would be better, and creepier then the first movie but sadly it wasn't barely anything was creepy and it relied too much on jump scares. But I do like how they explained what happened in the first movie, and the beginning of this one and I loved Patrick Wilson's acting it reminded me of Jack Nicklaus from the Shining.",
      "total_reactions": 1,
      "user": "jakethesnack"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Insidious: Chapter 2 wasn't as scary as The Conjuring and it's predecessor, but I still had a lot of fun watching the movie. It continues where the first movie left off and from then it's a ride of mystery, scares and some laughs. The movie wasn't really that scary like the first one but some scenes still gave me goosebumps and chills. When an intense or horrific scene is happening at the moment, a comedy part was involved and I found that a bit weird. It was a bit weird for me, because some of those scenes were really intense and adding a funny tone to it just doesn't really help. There were plot points that I found really interesting and those things kind of overshadowed the main genre of the movie, horror. It was really interesting that this movie was connected to it's predecessor but I still wanted scenes that would really convince me to leave the theatre. James Wan still did a good job with Insidious: Chapter 2, even though it didn't beat it's predecessor. I am going to give Insidious: Chapter 2  a 7/10.",
      "total_reactions": 1,
      "user": "jetstar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "This movie and the previous movie did a great job.It has a reasonable state of each events. Like director wan is focused on the flow of each events. He made it clarify and clear for the audience how it is happened, why is it happening, how it happened. Normally, we can see that the movie has many repetitions but that's because director wan wants us to understand each events. While I'm watching this chapter 2 I said to myself that \"Oh,so that's why\". As your fans, we are expecting an another chapter from this movie. In the end, we can see that there's another entity again, if you really deep understand the story you will feel that there is still something wrong and like it is not done, there is still something that we don't know. I don't know if anybody feel that. Overall my ratings would be 100% excellent movie.",
      "total_reactions": 2,
      "user": "christianl13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Insidious: Chapter 2, fue creada en una época donde las películas de terror son una verdadera porquería y no se toman en serio, es por esta misma razón y por muchas otras como por ejemplo, un buen argumento e interesantes giros de trama, momentos de suspenso que tortura la mente del espectador para esperar lo menos esperado y muchas escenas perturbadoras que producirán a los que no están acostumbrados a este tipo de películas, varios sustos incontrolables. Si se hubieran esforzado un poco más en la distribución y desarrollo de personajes, la película quedaría espléndida, pero, por ahora me gustó aún más que la primera parte, y algunas de sus escenas te perseguirán hasta lo más profundo de la noche cuando estés durmiendo.",
      "total_reactions": 1,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "A definite improvement over the first one. Even thought that was a good film. Contains a strong use of jumpy scenes with build up of tension. The was the film goes back and forth in time to make sense and fulfil un explained answer later on in the film seemed very clever and keeps the viewer engaged.",
      "total_reactions": 1,
      "user": "Extra_Official"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "James Wan shows us an amazing sequel!  Insisdious: chapter 2 was an excellent movie, full of scares and ghosts, I really enjoyed this film. It was better than the first one  more action  suspense and horror/humor :P",
      "total_reactions": 2,
      "user": "skadosmen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "obviously no where near as good as the first one but it wasn't that bad, the friend I was with, really enjoyed it, I wasn't so impressed. felt as though the writers were trying to fit so much in when it simply wasn't possible. don't make another",
      "total_reactions": 1,
      "user": "villagirl87"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "this is the most dumb thing that they could ever do make a another insidious . i thought the sequel what stepped up a a little bitt but it is not that fun . i hope they end insidous 3",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Insidious: Chapter 2 es una película con un argumento interesante que explora conceptos poco usados en el cine y los convierte en una buena película de terror.",
      "total_reactions": 1,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "First of all, I DARE YOU TO WATCH THIS FILM BY YOURSELF IN THE DARK!!! Survive that and your critique would be taken seriously. lol. Whoever said that this movie is a disappointment, cannot deny experiencing some flinch-in-fear moments, that they aren't proud of. lol. C'mon you've gotta admit that this film was pretty good, as far as scary movies go. I mean, if you search for the top scariest movies, you'll come across old \"not really scary anymore\" scary films with bad special effects.",
      "total_reactions": 1,
      "user": "jbravo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Insidious (1) had a unique premise mixed with some established horror scenarios.  For the most part atmosphere was great and the characters were well created, written and acted.  I didn't feel the film needed a sequel or sequels, but I watched Insidious Chapter 2 out of curiosity.",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "A satisfying horror sequel from the director of 'Saw'. As a second installment to 'Insidious', it went deeper into the behind story of a character of the movie. Yeah, the first one was told about a boy's special talent astral projection where he can travel to another world in his sleep. I considered that was the movie's advantage but comparing to this, they just implemented the same idea with neglecting the boy. In this movie it describes more about the father's perspective of the story without held back the much required secret for the twist at the end.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 2,
      "text": "After spending 105 minutes with this film, I can honestly say I have no idea what was achieved. Too dull and predictable to take seriously and guilty of plagiarising from not only the first instalment but every competent horror film made since Psycho. It's worst crime however is adversely affecting how we see the first film which was far superior. Yet, despite it's incompetence, Mr Wan has the audacity to end by setting up Chapter 3, we can only hope for a short book.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Well definitely entertaining, maybe in the wrong categories a few times. Acting is still good, creepy is somewhat still there in like the first half. The story is interesting, the directing is perfect. I don't know it just  didn't make me jump more then 2 times. Hell that's still 2 more times then The Conjuring and Paranormal Activity (1-2-3-4). See it with your friends or 3+ people for a good times, other then that, it's not the best.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "How rare is it that a sequel is better than the classic hit it's based on? Pretty rare, but Insidious 2 gets everything right and even enhances the original, which is just what a good sequel needs to do. It explains just about every single thing that's happened and why, which is a definite plus for this kind of stylistic movie. The secondary antagonist from movie 1 becomes the primary in this follow up, which isn't surprising, but watching it happen was freaking awesome. Not many movies can hold your interest like this one and its predecessor.",
      "total_reactions": 0,
      "user": "LXQUICKJUSTICE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Insidious Chapter 2 is a solid follow up to it's predecessor the 2010 low budget but highly successful film, Insidious. It might be not as good as the first one, but it was up to the creep level and style of the first, with low budget considered to other horror movies, James Wan shows us what he can do with such budget, he knows where to spend money, considering that he spent a little bit more on this film. Insidious Chapter 2 has that 90's vibe to it although it is original, with SOME ideas never used before, but still there is some cliched stuff and predictable jump scares, but what is funny that you know it is coming and you know what will scare you but you still jump. The acting is good, the tension is solid at times, the effects are really good, but at most  of the time it falls apart, and somehow it becomes dull and predictable. Is it better than recents (The Conjuring, You're Next)? NO. Is it worth checking it out in theaters? For the scare yes. Is it worth checking at all? if you are fan of the first one, if not I recommend The Conjuring, which is ten times better and scarier, it received an R rating for just being scary for God's Sake!",
      "total_reactions": 0,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Other than a few decent creepy moments, I wasn't the biggest fan of the first one but I found I enjoyed this one.  Although the film is one giant collection of unimaginative, cheap \"jump\" scares, this sequel is spooky as James Wan crafted a very creepy and unsettling atmosphere with the film.  This one also worked in the comedy element better than the previous one (last time I felt the comic relief was grating and out of place) and the story is very good...I especially enjoyed how creatively it connected the two films.  While it's not the best horror film out there, it still is far superior than most horror films released.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "Very stupid, tedious and generally nonsensical movie. Every screamer and \"scary moment\" are predictable and those make you rather laugh, than scare. I regret watching this and advise to avoid as plague.",
      "total_reactions": 0,
      "user": "dizzel679"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "I really hate to say it, but this movie was so disappointing. I expected the same, if not more of the same type of scares I got from Insidious. The acting was a bit turgid  most of the plot was sort of cheesy. The scare sequences are predictable and boring. However, I do admire the fact that it was made under a small budget and became so successful commercially. I also admire the fact that the crew shot the movie sort of like an homage to 1970's and 1980's horror films, camera wise. The music is also spine tingling. But other than that, it's just a disappointment. I'm sorry to be so harsh but it wasn't what I thought it would be. I felt like I was in the theatre like 4 hours because of how long and drawn out it was.",
      "total_reactions": 0,
      "user": "TheCriticKid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Never seeing the first installment, I was able to understand this second installment without watching the first.  This movie to me felt like a mixture of The Sixth Sense and The Others.  This installment goes into detail and explains what happened in the first chapter and why it was happening.  Throughout the movie you never loosen  up because there is always something that has you in suspense.  In my opinion the make up effects could have been more scarier.  It doesn't contain any gruesome killing, foul language, or nudity which I know some parents may want to know before letting their kids watch it.",
      "total_reactions": 0,
      "user": "Ocgem24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "I'm a really big fan of James Wan and the first Insidious. I thought it was one of the best horror films to come out in the past decade, so needless to say I had really high expectations for Chapter 2, but to be honest, I came out kind of disappointed. It wasn't a bad movie at all, it just wasn't anything special. And seeing this after The Conjuring (which took the first Insidious' place as my favorite scary flick of this decade or so), just made me feel very underwhelmed. It felt a lot more like a thriller than it did a horror movie. Theres wrong with that, but its not what I was expecting. The acting is just as good as it was in the first, but the actual film wasn't as suspenseful or scary as I was hoping. And cheap jump scares don't make a movie scary.",
      "total_reactions": 0,
      "user": "Tobehonest7323"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "Wan's second chapter to the 2010 horror hit film Insidious is disappointingly less scary, less intense, and loosely-scripted. The story here is confusing and incoherent -- you don't exactly know who is the real antagonist ghost here. A bad sequel but still acceptable.",
      "total_reactions": 0,
      "user": "TheCoolGuy99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "It lacks scares and falls short of the first movie but otherwise, Insidious: Chapter 2 delivers a solid narrative and good acting to compensate for it.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "This film was so much less than the first film, not as creepy an atmosphere, unnecessary comic relief that felt so campy and badly executed. The story was wrapped in a rather cool fashion but some things were still kind of unexplained, along with plot conveniences making a frustrating watch. It's still kind of enjoyable but far more like a typical jumpscare fest film. Missable.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "One of the best horror sequels, if not the best horror sequel ever and one of the main reasons for that is because unlike most horror sequels it is original and scary.",
      "total_reactions": 0,
      "user": "Daniel2651"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Insidious: Chapter 2 is a direct follow up to the first one. If you haven't seen the first I strongly recommend you see the first before you watch this one. Insidious 2 follows up directly after the end of the first movie. It starts with same tone the first one ended with so I was instantly intrigued by it. I am also a massive fan of the first one so my expectations were pretty high going in. I was not disappointed with this at all. This was a very similar style to the original and still had all the elements that made the first one so ground-breaking. For a horror movie, the story is incredibly interesting, something the first movie didn't quite have. It was directed by James Wan, who is now an established director, especially for horror with movies like The Conjuring, Saw and Insidious. James Wan is fantastic at building suspense and using it at the right times to scare the audience. The performances are great in the film as well, especially from Patrick Wilson . His performance in certain parts of the movie reminded me of Jack Nicholson in The Shining. Rose Byrne was also pretty decent but this was Patrick Wilson's movie. I also really liked the way James Wan films his scares and suspense scenes. His style is very unique and extremely effective. He uses a lot of make-up and practical effects rather than CGI which I enjoyed as well.",
      "total_reactions": 0,
      "user": "MOVIE_MONSTAH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "The trailer makes it look good with all the horrific parts, but once that trailer's over, you won't jump at any parts of the movie for you've already seen all of the jumpy parts in the trailer. In other words, it was boring.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "It's a good film but the scares are not quite there with this one.  It falls behind the first movie but only just.  If you like the first film and want more, you'll get exactly what it says on the tin.",
      "total_reactions": 0,
      "user": "Batfinkskinner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "It lacks scares and falls short of the first movie but otherwise, Insidious: Chapter 2 delivers a solid narrative and good acting to compensate for it.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "James Wan and Leigh Whannell's story picks up right at the end of the first film. puts you right back into the thrilling action, with the same atmosphere and feel, they both write more in depth on the same characters and how they stretch this Further aspect, I love it!!! Again the cinematographers and editors are amazing. Specs and Tucker are my new favourite characters... also like the back story on Parker Crane.",
      "total_reactions": 0,
      "user": "TrevorDevendorf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "This was a lot different than the first Insidious, but I liked it. The atmosphere was there as well as the creepy cinematography. The story was more interesting in the second chapter than the first; however, I felt the first chapter was scarier. This one does have its moments, though. i also really loved how it tied in with the first one. I wasn't expected that at all. Chapter 2 didn't wow me like Chapter 1 did, but I still enjoyed it,",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Summary: Insidious: Chapter 2 delivers a few decent scares in its first act, but unfortunately the rest of the film is a strangely awful comedy. 40/100 [C-]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Insidious: Chapter 2 illustrates that, regardless of his past success in the horror movie field, James Wan is not infallible when it comes to the genre. The second installment of what is likely to become a franchise is disappointing precisely because of Wan's recent track record. Insidious was two-thirds of a great movie and The Conjuring was three-thirds of one. Insidious: Chapter 2 is not only unnecessary but it commits the cardinal sin of devaluing its predecessor. Since this movie is presented not just as a sequel but as a continuation (at one point, it re-creates a scene from the first film from a different perspective), the first Insidious no longer stands alone. It is now weighed down by a second half that's equal parts incoherent, tedious, and repetitive.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Much more over the place than the first one, this sequel doesn't have a lot to offer than the exact same things as the first one, cheap jumpscares and clichés. There is some kind of frightening moments, but overall the movie doesn't work simply because it is not scary.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "My only issue with “Chapter 2” is the almost grandiose persona that seems to shadow the nature of this family’s tale. At times the context and explanatory content seems a bit forced and over-exaggerated even for a fictional film setting. Even in fantasy and fiction the story needs to carry a bit of believability and realism. You need to think that this could actually happen to someone (given that you believe in hauntings and a supernatural presence in the world). Yet at times “Insidious Chapter 2” comes off more like those stories that get bigger the longer they are shared among peers, like going to a “haunted cemetery” and a sound becomes a presence, becomes an attack and before long someone became possessed and so on…That is how much of “Insidious Chapter 2” came off to me personally.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "I should start by saying that I was not the hugest fan of Insidious to begin with although I did find it better than average and decent, just not great. The sequel however is the epitome of why most sequels do not work, Insidious 2 is just a mess. First strike is that this movie cannot stand on its own, viewing of the first Insidious is absolutely required if you are to understand the plot or care about any of the characters. Insidious 2 starts where the first left off only the characters are not familiar in the sense that this franchise is beloved or well known so that when we start here, even if you have seen the first, you just do not care about anyone in this film...child, women or otherwise. I think the creator is banking on fanboy success in that you are already familiar with all of the characters and thus interested in their progression. Even then, the characters here are wire thin as far as development goes...I will say that the actors portraying the young versions of the primary cast in flashback scenes were marvellous. It is obvious there is a lot of love here, as far as the making of, but it is too much to ask of the audience to be equally enthusiastic about this franchise as the creators are.",
      "total_reactions": 0,
      "user": "bobbytomorow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Not quite as scary as the first, but a much better film in my opinion. I loved the whole backstory with  Parker Crane/ Bride in Black and his mother. I was scared and intrigued at the same time",
      "total_reactions": 0,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "I'm a horror enthusiast who can find something to love even in the worst places, (looking at you The Town That Dreaded Sundown). I enjoyed The Conjuring and its sequel, Annabelle, but missed the first installment of the Insidious series. I decided to take the leap and just watch Chapter 2 with no prior engagement, and I sorely wish I hadn't. After blithely sitting through the first 45 minutes, I began to nod off. By the end of the movie I was more bored than I have been watching a movie in years. Films like this give the horror genre not just a bad name, but are an absolute mockery of everything good horror should be. A tragic, tragic failing.",
      "total_reactions": 0,
      "user": "Jarhead335"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Carrying on where the last one left off, horror maestro du jour James Wan (Saw, Dead Silence, The Conjuring) serves up a juicy, fright-filled spookfest with this follow-up to the 2011 hit.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Not only is this a great film that's scary, but Rose Byrne shines in it! It's a really good film, and Blumhouse and Wan make a great team in horror films, and never disappoint me ever. Well worth your time and money, and will always be a can't help myself but love movie",
      "total_reactions": 0,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Like its predecessor, Insidious remains very thrilling and creepy. This sequel is, in my opinion better than the first. It is very creepy and the thought of this movie sends shivers down my spine.",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "Like its predecessor, Insidious remains very thrilling and creepy. This sequel is, in my opinion better than the first. It is very creepy and the thought of this movie sends shivers down my spine.",
      "total_reactions": 0,
      "user": "Aaron_Wasserman"
    }
  ],
  "metascore": 40,
  "name": "Insidious: Chapter 2",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 13,
    "month": 9,
    "year": 2013
  },
  "opening_weekend_income": 40272103,
  "opening_weekend_income_currency": "$",
  "rating": 6.6,
  "rating_count": 116554,
  "rating_freq": {
    "1": 1697,
    "10": 10904,
    "2": 1356,
    "3": 2323,
    "4": 5100,
    "5": 11215,
    "6": 24212,
    "7": 31944,
    "8": 19722,
    "9": 8081
  },
  "release_day": 13,
  "release_month": "September",
  "release_year": 2013,
  "user_review_count": 273,
  "votes_per_demo": {
    "aged_18-29": 50328,
    "aged_30-44": 32995,
    "aged_45+": 5225,
    "aged_under_18": 710,
    "females": 20886,
    "females_aged_18-29": 12144,
    "females_aged_30-44": 5819,
    "females_aged_45+": 961,
    "females_under_18": 194,
    "imdb_staff": 7,
    "imdb_users": 116554,
    "males": 74701,
    "males_aged_18-29": 37737,
    "males_aged_30-44": 26773,
    "males_aged_45+": 4167,
    "males_under_18": 511,
    "non-us_users": 50415,
    "top_1000_voters": 409,
    "us_users": 16595
  },
  "year": 2013
}