{
  "avg_rating_per_demo": {
    "aged_18-29": 6.0,
    "aged_30-44": 5.8,
    "aged_45+": 6.0,
    "aged_under_18": 6.4,
    "females": 6.0,
    "females_aged_18-29": 6.1,
    "females_aged_30-44": 5.8,
    "females_aged_45+": 6.2,
    "females_under_18": 7.1,
    "imdb_staff": 6.8,
    "imdb_users": 5.9,
    "males": 5.9,
    "males_aged_18-29": 6.0,
    "males_aged_30-44": 5.8,
    "males_aged_45+": 5.9,
    "males_under_18": 6.2,
    "non-us_users": 5.9,
    "top_1000_voters": 5.4,
    "us_users": 5.8
  },
  "avg_screens": 1089.8333333333333,
  "budget": 12000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 27,
    "month": 9,
    "year": 2013
  },
  "critic_review_count": 207,
  "duration": 128,
  "genres": [
    "biography",
    "drama"
  ],
  "gross_income": 16117443,
  "max_screens": 2381,
  "mc_avg_user_score": 5.1,
  "mc_metascore": 44,
  "mc_mixed_rating_frequency": 69,
  "mc_movie_name": "Jobs",
  "mc_negative_rating_frequency": 54,
  "mc_positive_rating_frequency": 58,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Entertaining and smart, with a great, career 2.0 performance from Ashton Kutcher."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "The ironic thrust of the movie is that Jobs' humanity is there in that perfectionistic insanity. He pushes and pushes to make home computers more and more appealing, accessible, and user-friendly, and that's his great gift to the world."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "It’s a competently made, traditional biopic about a man who disdained those terms."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Jobs is a just-the-facts - and fiddling-with-the-facts - dramatization, forgoing any kind of deeper psychological exploration of the man and his motivations, his demons and dreams."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "It’s superficial, but that plays into the hands of the film’s star, Ashton Kutcher."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Kutcher finds compassion without going for anything so cheap as an explanation for Jobs's bad behavior; it's a wily, understated performance."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The problem is that the film gets too wrapped up in the myth to tell an effective behind-the-scenes tale."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "He was a charismatic leader and the greatest salesman the industry ever saw. He also was a very vocal spokesman for the graying counterculture -- crediting his high-tech success to Zen Buddhism, Dylan songs and acid trips."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "The filmmakers do fall into the trap of overly sentimentalizing a widely beloved public figure who represents an enormous cultural significance. At the same time, however, they keep the movie frequently engaging."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 58,
      "summary": "The movie is constantly at war with attempts to provide an honest portrayal, almost as if its subject were reaching beyond the grave to steer any negativity back in the direction of a hagiography."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 55,
      "summary": "So the principal point of controversy involved here is not Jobs himself, but Ashton Kutcher, who plays him. The actor's approach is to ape Jobs' speech and movements, which he does quite well. Whether mimicry qualifies as characterization is a question for Jobs' viewers to answer for themselves."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "\"Compelling\" is a word one could apply to Jobs - he was a magnetic figure - but it doesn't describe this movie. \"Average\" might even be a stretch, and that's something of an insult to the man whose story it tells."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Save for a few references of being abandoned by his birth parents and adopted later, the source of Jobs's jerky behavior never is revealed."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "If Jobs had been a producer on Jobs, he would have sent it back to the lab for a redesign."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "If one were to compare this film to one of Jobs’s own products, it would be more like the Cube than the iPod."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "At its best, it's a good picture, and at its worst, it's almost good."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Kutcher, whose acting chops haven’t been tested in all those pretty-boy lead roles, was a welcome surprise. His movie-star glow distracts, but there is a strong physical resemblance. Moreover, he’s got many of Jobs’ mannerisms down cold, from that T Rex–like walk to the fingers that fan the air and the yoga-style postures left over from his bohemian youth. It’s a good impression, but Jobs itself is all too impressionistic."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "One thing it doesn't do is offer a revealing look at the mercurial entrepreneur. The movie that bears his name settles on a blandly superficial treatment of a deeply complex man."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Jobs is a one-man show that needed to go for broke and doesn't. My guess is that Jobs would give it a swat."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Jobs works much better as a history of Apple than it does as a portrait of the genius who dreamed it up."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The dialogue comes straight out of \"The Benny Goodman Story.\" That look, someone says to a staring, pausing Kutcher, \"tells me you're on to something big.\" Nobody talks in this movie; everyone speechifies or take turns sloganing one another to death."
    },
    {
      "critic": "Kyle Ryan",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "For (nearly) every yin of Ashton Kutcher’s Steve Jobs flashing a moment of brilliance, there’s a yang of someone saying he’s changed or is his own worst enemy. The unwritten, but understood, full title of Joshua Michael Stern’s film is \"Jobs: Brilliant Asshole.\""
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "If it weren’t for his voice, Kutcher would have been the ideal choice to star in Jobs, a well-meant but ultimately unsurprising biopic."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Ultimately, Jobs is a prosaic but not unaffecting tribute to the virtues of defiance, nonconformity, artistry, beauty, craftsmanship, imagination and innovation, qualities it only intermittently reflects as a piece of filmmaking."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 42,
      "summary": "Jobs the movie isn't as fascinating as Jobs the man, much less the myth of entrepreneurial superiority he left behind."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "It fails to rise above the inherent limitations of the traditional Hollywood biopic and it's about as insanely great as a Mac \"low cost\" LC model – which was, to be fair, pretty cool."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "The film thankfully doesn’t offer some pop-psychology Rosebud to explain Jobs’s drive or near-sociopathic perfectionism, yet we walk away knowing nothing about what made this revolutionary tick."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s bloated, overwrought, and nakedly sentimental, a sappy and cliched celebration instead of a searching and incisive exploration."
    },
    {
      "critic": "Ed Gibbs",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "This is far from the bomb some would have envisaged, but neither is it the character illumination one would wish for. Jobs appears so consumed by his work here that little else mattered in his life. That may be true, but we're left none the wiser as to what made the man tick, beyond what we already know."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "Jobs amounts to, at best, a Cliffs Notes version of the man’s early life. If you want the real story, you’ll have to read Walter Isaacson’s fascinating 2011 biography, which would make a much better film than this one."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 37,
      "summary": "The film is so thick with Jobs’s career highlights and lowlights that there’s little room for insights."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "The Great Man theory of history that’s recycled in this movie is inevitably unsatisfying, but never more so when the figure at the center remains as opaque as Jobs does here."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "There was a time when the slack storytelling, stock characterizations and general by-the-numbers feeling of the film could be put into perspective by saying it seemed like a TV biopic. But even TV movies are done with more verve than this these days."
    },
    {
      "critic": "Sebastian Doggart",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "Where the film completely falls down is in director Joshua Michael Stern’s disastrous decision to cast Ashton Kutcher in the central role."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "summary": "Steered by a lead actor and director, Joshua Michael Stern, who are both way out of their respective leagues, Jobs is excruciating, failing to entertain and all but pissing on its subject's grave."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Joshua Michael Stern's \"Jobs\" is like an assembly line for the best moments in the career of Steve Jobs, but seriously lacking in depth, and without much significance. It is a truly unremarkable biopic of the \"master of innovation\" as you could possibly imagine. \"Jobs\" follows an overly safe, unimaginative course that clocks in at a tiresome 122 minutes. The storytelling is painfully straightforward, covering only the principal events of his professional trials and tribulations, and providing little else beyond what is already public knowledge.",
      "total_reactions": 8,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "The decade the film skips  when an ousted Jobs created his software company NeXT, which he eventually sold to Apple  seems like a lost chapter that could have illuminated it subject. How does such a driven man survive after being driven out? Instead, the film picks up in 1996, when Jobs inexplicably has a new wife and young son; his now college-age daughter snoozing on the living-room couch. He's lured back to Apple and transforms it into the most profitable company in the world. (That's not a spoiler, it's history  you can check it on your iPhone.) And that's the problem with \"Jobs.\" While it's interesting to see the history of Apple and how Jobs' singular determination was crucial to its success, the history of a company isn't as compelling as the history of a person, especially one as complex, innovative and influential as Steve Jobs.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "From all accounts, Steve Jobs was a brilliant innovator, but also a demanding, inconsiderate  This biopic starts with his free-spirit college days, spends lots of time creating the first computer in his parents' garage, then traces his rise and fall and rise at Apple. Ashton Kutcher, who is an on-screen charmer, is out of his league in this role, unable to plumb the characters' complexities. Even though the screenplay tries to show Jobs' good and bad sides, it's just a flat, yet absorbing history lacking in emotion, drama or excitement.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Boring movie, complete waste of my time. I wish there was more to it not just a history lesson that pretty much anyone knows or can read up on. Save your money and go see something else.",
      "total_reactions": 2,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The movie is quite entertaining and not bad overall but where it fails miserably is the decision to cast Aston Kutcher. Every moment that is suppose to be taken seriously, having feeling, or make a point comes across as cheesy. \"Jobs\" is certainly no \"Social Network\".",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "It ain't no \"Social Network\", it's a movie that lingers in some aspects. For starters I'll say that the acting is pretty good, especially Ashton Kutcher. I don't know how he did it, but he off Steve Jobs pretty good. But the big problem with this movie is that source material used is a bit of a mess. They exaggerate some factual source material, yet at the same time they don't show enough of other source material. Overall, it's a heart-less version of \"The Social Network\".  Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "\"How does somebody know what they want if they haven't even seen it.\" This one sentence really explained to me why Apple was created. JOBS, is the biography/film recreation of Steve Jobs' (Ashton Kutcher) life. Being founder of Apple, we follow him and Steve Wozniak (Josh Gad), as they create the company and watch it flourish. The film starts in 2001 (picture two) as Steve introduces the first iPod, and then it jumps back to mid 70's when the company first started. Starting the company in his parent’s garage with the other Steve, we follow him through his hard work in Apple. We could tell that Steve really was a jerk after starting his company, but we also saw how he cared about his good friends and about the association.",
      "total_reactions": 1,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Jobs is a boring movie. It feels like the low budget, made-for-tv version of The Social Network. I'm angry that I wasted money on it, and I'm upset at how bad it turned out to be considering how good the trailer looked.",
      "total_reactions": 6,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Just another piece of Apple advertising, it was so biased toward Jobs and his life that it was completely cringe worthy to say the least, it give no depth, is often too over-the-top, and at times just downright inaccurate, the movie feels like it's juggling reality and Hollywood, also, Bill Gates never existed according to the writers.",
      "total_reactions": 3,
      "user": "Dude45"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "I agree with SimpleMethod. Jobs really does come off as a straight to TV movie and try as he might, Ashton Kutcher was a god awful choice to play Steve Jobs.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Ashton kutcher did an amazing performance. The movie itself could be better directed. Yet it is still inspiring and amazing. Kutcher by far did the best performance of his career and showed that he has a great potential.",
      "total_reactions": 12,
      "user": "astrosogi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Great movie but once again another rushed ending. Kutcher did a very great job and this movie makes me sort of want to buy a mac or and iphone(NOT) but in all great movie you wont be disappointed.",
      "total_reactions": 4,
      "user": "mone06"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Pure entertainment. Critics have ruined it for me. The ending was good, although it could be much better if it  was with Jobs as an old man. I saw some directing mistakes, but Ashton Kutcher did an AMAZING performance!!!!! Excellent to him. A huge well done to the movie. Do not listen to the critics, and watch it!",
      "total_reactions": 1,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "jOBS Review",
      "total_reactions": 2,
      "user": "YeahYeahCool"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Ashton Kutcher may have the talent to play Steve Jobs, but the rest of the movie cuts out a few very important details of his life, while being monotonous in the process. But it is worth watching.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "JOBS really surprised me with how accurate it is. Scenes unfolded just like I imagined them after I read some books about Steve Jobs' life.",
      "total_reactions": 5,
      "user": "judtravis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I really don't see what the negative criticism surrounding this movie is all about; it was pretty good. Whether or not the movie is accurate in portraying Steve Jobs, I don't know. Did it gloss over some important things in Steve's life? Maybe. But I do know is that this is  a compelling drama film and Ashton Kutcher's performance was good. Liked seeing Steve Job's humble beginnings. I don't think the film is biased or \"just another piece of Apple advertising\"; on the contrary, it shows the positive and negative aspects of Steve's personality and life. I wish the film had covered more of his life, particularly leading up to his death.",
      "total_reactions": 1,
      "user": "andrewgarcia732"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "Ashton Kutcher is probably the worst thing in this movie, the only good thing he has in this film is the similar look he shares with Steve Jobs..but that's it",
      "total_reactions": 1,
      "user": "obijuankenbi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Jobs tells the story of Steve Jobs but that’s it. As a film that serves to show Steve Jobs (Ashton Kutcher) going from guy in garage building personal computers to guy in charge of Apple it works. I’m not quite familiar with the life of Steve Jobs but the story seemed to flow alright. Making a bio-pic may not have been the best course of action for the film as its story is stretched out. Rather than focus on a specific point in Jobs life (ex. working in his garage) the film shows a broad approach. On one end, this helps to show how far Jobs has come in certain areas going from nothing to a big celebrity but at the same time it means that none of these moments can be fleshed out a lot. The film is constantly jumping around causing jobs arc from jerk to megajerk to nice guy doesn’t get fleshed out properly. The film feels long and empty because it covers so much yet there is no substance or heart to allow me to connect to Jobs’ struggle. The film fails to flesh out Jobs as a character and at times it just feels like a cheap rip-off of The Social Network where a smart genius is a jerk pushing away people while climbing the ladder of success.  It feels like an Oscar wannabe at times with all the key moments guy struggling and lots of shouting clips that I’m guessing the filmmakers thought could be used when Ashton Kutcher got the nomination he never received. It’s a shame too considering how the filmmakers got a lot of actors that look like their real-life counter-parts, J.K. Simmons, and a relaxing guitar score; that isn’t enough to cut though the film needs substance and heart and this film lacks it. Hopefully the new Steve Jobs film with Micahel Fassbender will tell a more in-depth, substancial, and better take on the story.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Watch THE PIRATES OF SILICON VALLEY if you want a real, less romantic look at Mr Jobs.  That movie was far superior and more interesting, this was 2 hours of fanboy glory.  zzzz",
      "total_reactions": 0,
      "user": "cambria"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "i expected more from this film, specially since it runs over 2 hours..",
      "total_reactions": 0,
      "user": "lordslayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Ok so Jobs wasn't the disaster I expected but it certainly wasn't good either. It really didn't teach you much about \"Who is Steve Jobs?\" it was almost like it was in fast forward, it just showed a few events that occurred yet somehow it was dragged to over 2 hours. Ashton Kutcher was possibly the worst possible choice to play Steve Jobs, only thing he did well was Steve's walk which really isn't a big deal at all. It's not all his fault as to why this film was bad, the other reason is Joshua Michael Stern who has next to nothing under his belt director or writer wise. This movie was written horribly and Ashton Kutcher like I said before was the worst choice. Ben Affleck would've been a great choice in my opinion but I know Ben certainly wouldn't agree to be a part of this awful script. 3/10 although 2 is probably more deserving but I'll give it a charity point. Not a complete disaster (I've seen worse) but still pretty darn bad. Don't waste your time and definitely don't waste your hard earned cash.",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "Jobs is a monotonous and very biographic film. During two hours all what we see is the life of Steve Jobs, just as it was. He started working in the garage of his house with some friends fixing computers and ended founding his own company, from which he was fired and the rehired; to finally become a living celebrity. The problem of the movie is that it waste a story with so great potential, I mean the director could evaluate the reaction of the protagonist during the time without job, or when he lose all his friends, and even when he was successful. Although there are some things that are really good, for example how it manage to capture the legend that Jobs represent, also is the unbelievable acting of Ashton Kutcher, and the way it is use the camera; because at the beginning of the film we see the moment when the IPod was presented and Steve was at the summit of his career, the camera record from below, giving the character an unreachable figure. Just after that its shown when he was stuck starting the university, the camera is placed above, meaning that he is a person of no importance. The problem is that the movie is nothing more than a history class.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Jobs is a boring straightforward biopic that shows Steve Jobs at his highs and lows without any insight into anything. While these are real people, the characters themselves are underdeveloped. The script is lousy and cliché, and the director seemed to be making a TV movie at best.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "I'm a big fan of Steve Jobs because he was and he's my idol but this movie is not a good biographic movie! That's only a large target audience movie who don't answer to the real fans wait.",
      "total_reactions": 0,
      "user": "Frank197"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Not knowing anything about its subject I approached Jobs with minimal interest and found it to be a surprisingly compelling, if rather conventionally told, biopic about the recently deceased techno wiz. Based on its own merits Ashton Kutcher's performance is probably the best of an otherwise undistinguished career. However, at times and partly due to the screenplay, he is over emphatic in portraying Jobs as both unscrupulous and unlikeable, which he very possibly was. Under rated by the critics and despite a shaky start, the film does settle down to become very entertaining.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "This movie is nothing like The Social Network. I'm not saying that as a bad point or as a good point. I'm just starting my review with a common mistake. The Social Network was about two friends and how a big corporation ruined their friendship. Jobs is about the big corporation, not the people involved with it.  Ashton Kutcher was a decent actor in this movie. When it was announced that he was going to be play Steve Jobs, everybody lost their  But he's actually alright, nothing special, but not a bad performance. Pretty much everyone is nothing special. Ashton Kutcher is the only actor who I can name off the top of my head, who was in Jobs. Besides JK Simmons who has such a memorable face that I will always recognise him. You may think that the story of the movie was already prepared, but the writers had to pick some events in Steve Job's life which were interesting. They did not do it too well. I would have preferred to have seen more about the later life of Steve Jobs, than him sitting in an office shouting at people. The writers obviously noticed how good Ashton Kutcher looked as old Steve Jobs and decided to give him as little screen time as possible. Also it was not made clear what year's things were taking place in. I'm not an expert on Steve Jobs so I have no idea what year he was born in (probably in the 50's), after watching the movie about his company. I still don't know. One of the things I did like was the soundtrack. There was some of The Beatles some of The Rolling Stones (I think) and it really gave the movie a vintage feel. I'm guessing that's when a lot of it took place because I had no idea what year it was most of the time. To be honest Jobs did not teach me much about Steve Jobs at all. I can't remember what college he went to (even though it's in the second scene). I can't remember the name of his wife. Or whether she was even his wife?",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "The turtleneck definitely steals the show. Its accuracy is impecable, from its length to its color. This turtleneck is spot on. My only complain is that there are scenes with no turtleneck, like when Steve wakes up in the morning. Seems like a missed opportunity.",
      "total_reactions": 0,
      "user": "turo999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Jobs is an inspiring movie about working hard and dedication. Jobs accurately represents Steve Jobs as he was. This movie is slow at first but once it picks up, it never falls. It's so interesting to see how Steve Jobs and the rest of Apple can go from working in a garage, to becoming the worlds most valuable company.",
      "total_reactions": 0,
      "user": "TheRyanMcNeil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "All I learned from this interpretation was that Steve Jobs as absolutely brilliant but hated shoes and could really be a huge jerk  If you aren't interested in computers then this movie is very dry and lacks entertainment. All I could think about while watching the movie was that I forgot my iPod at my parents house It really did nothing for me. I can see a demographic of people really enjoying this movie, I certainly wasn't one of them.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "La historia esta bien relatada JObs es una pelicula de esas que,son difíciles de calificar gracias a que tienes sus bajas y sus altas además de ser una películas que trae varia polémica en la critica",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Jobs is a stunning movie that really presents the characters excellent, and it got a hell of a story! The first thing I got impressed in this movie is Ashton Kutcher, Josh Gad and Giles Matthey´s performance, they're playing their roles so good, not just by their appearance, but also the way they talks & how they express themselves, especially Ashton Kutcher, because he was born to play Steve Jobs!",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "\"Jobs\" was ambitious but it never really felt like a big budget biopic about Steve Jobs and, ultimately, felt like a made-for-TV story about the Apple guru.  I wasn't sold on Kutcher's performance and only saw him as Ashton the entire movie and not Steve.  Additionally, I felt they handled Jobs' growth as a person poorly as the movie jumped from point to point and any character development needed for the next scene was just conveniently there when the story arrived.  However, I really enjoyed Josh Gad as Wozniak, the soundtrack was great and I admire that they didn't sugarcoat the reality that Jobs had a reputation of being kind of a big meanie-head.  In the end, \"Jobs\" was a passable biopic about the man who created a company where people will wait in line for days to get a phone that is really no different from the previous one they waited in line for.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Jobs isn't the best biopic on Steve Job's life, but it isn't a dismal attempt. It lacks good narrative in the beginning, but by the middle parts you might even start to like it a little. Ashton Kutcher has his moments of great acting, but they are mostly overshadowed by his lack of emotional depth in the character.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Shallow movie. Ashton was ok, but not more. I missed aspects of his personal life, and of course about his illness and dead. The movie goes around his caracter and the imperium he create, but nothing new. All aspects well known about everybody. I was expectiting rhe wonderfoul Standford speech, but never happen.",
      "total_reactions": 0,
      "user": "Carowhelan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "What a mess, I did not think it was possible to create such an uninteresting story of such a dynamic individual. I bet David Fincher and Aaron Sorkin would have created a gem.",
      "total_reactions": 0,
      "user": "robertg993"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I really don't see what the negative criticism surrounding this movie is all about; it was pretty good. Whether or not the movie is accurate in portraying Steve Jobs, I don't know. Did it gloss over some important things in Steve's life? Maybe. But I do know is that this is a compelling drama film and Ashton Kutcher's performance was good. Liked seeing Steve Job's humble beginnings. I don't think the film is biased or \"just another piece of Apple advertising\"; on the contrary, it shows the positive and negative aspects of Steve's personality and life. I wish the film had covered more of his life, particularly leading up to his death.",
      "total_reactions": 0,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "It kind of drifts through the usual biopic doldrums and skims through elements of Steve Jobs's life that would have made for a more fully-rounded story, but for the most part, I found \"Jobs\" to be engaging, interesting and was pleasantly surprised by a great performance by Ashton Kutcher. It's a refreshing change from his usual roles and he does incredibly well in the role. It could have done with a bit less gloss and bit more substance - that's where it misses the mark most and that's not Ashton Kutcher's fault (I'm disappointed by how unfairly trashed he's been for this movie) - but it piqued my interest in its subject matter: a computer tycoon. And I hate computers.",
      "total_reactions": 0,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "Excellent movie! With Ashton Kutcher at his best, was so convincible as Steve Jobs that made me believe they revived the executive and put him on the screen.",
      "total_reactions": 0,
      "user": "mvoelcker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "The film does tackle very important points about Steve Jobs and his life, but in the end it really all comes down to the casting, particularly Ashton Kutcher's role as Steve. Which was the big mistake of the film.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "An okay film but not what I wanted to see, in any simple way of putting it's disappointing, only hope Steve Jobs gets a better quality film about him and not just the products he made.",
      "total_reactions": 0,
      "user": "MikeyStephens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Jobs was SO VERY INCREDIBLY boring. It was interesting, but that's not close to recommending the movie. Because this was a failure, Danny Boyle wants to make his own Steve Jobs biopic starring Leonardo DiCaprio.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "When the beginning of the movie, it looks like the story line just have nice work. But go more and more, the movie just like  run out of control so haphazardly.",
      "total_reactions": 0,
      "user": "wawan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Jobs\" 10 Scale Rating: 5.5 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A great movie about the life of Steve Jobs. Where its problems like pacing and an uneven narrative problems are seen, the solid acting and nostalgia make up for it. 8/10 (Great)",
      "total_reactions": 0,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "The movie was great and Ashton Kutcher playing the main character call all the attention. He was really into it. The direction was also good, maybe a little slow but anything you can't enjoy.",
      "total_reactions": 0,
      "user": "EnglishAsuncion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Kutcher bears a striking resemblance to Jobs and manages to embody him in full. It is an often emotional performance that could have very easily been turned into a characterization.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Jobs' too messy to have a movie like this. We got such a better Steve Jobs movie coming up a few years later in 2015. Like Hulk, we could be watching this seconds and seconds, minutes and minutes, hours and hours... even better.... years and years!",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ],
  "metascore": 44,
  "name": "Jobs",
  "num_weekends": 6,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 8,
    "year": 2013
  },
  "opening_weekend_income": 6713900,
  "opening_weekend_income_currency": "$",
  "rating": 5.9,
  "rating_count": 80405,
  "rating_freq": {
    "1": 3189,
    "10": 5412,
    "2": 1513,
    "3": 2744,
    "4": 5805,
    "5": 13328,
    "6": 21438,
    "7": 17012,
    "8": 7342,
    "9": 2622
  },
  "release_day": 16,
  "release_month": "August",
  "release_year": 2013,
  "user_review_count": 245,
  "votes_per_demo": {
    "aged_18-29": 30397,
    "aged_30-44": 27675,
    "aged_45+": 5406,
    "aged_under_18": 279,
    "females": 10510,
    "females_aged_18-29": 5236,
    "females_aged_30-44": 3553,
    "females_aged_45+": 814,
    "females_under_18": 49,
    "imdb_staff": 7,
    "imdb_users": 80405,
    "males": 57381,
    "males_aged_18-29": 24830,
    "males_aged_30-44": 23622,
    "males_aged_45+": 4473,
    "males_under_18": 225,
    "non-us_users": 39964,
    "top_1000_voters": 282,
    "us_users": 8703
  },
  "year": 2013
}