{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.4,
    "aged_45+": 6.3,
    "aged_under_18": 7.2,
    "females": 6.5,
    "females_aged_18-29": 6.6,
    "females_aged_30-44": 6.4,
    "females_aged_45+": 6.5,
    "females_under_18": 6.0,
    "imdb_staff": 6.8,
    "imdb_users": 6.4,
    "males": 6.4,
    "males_aged_18-29": 6.6,
    "males_aged_30-44": 6.4,
    "males_aged_45+": 6.3,
    "males_under_18": 7.2,
    "non-us_users": 6.3,
    "top_1000_voters": 5.7,
    "us_users": 6.6
  },
  "avg_screens": 10.1,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 5,
    "month": 4,
    "year": 2013
  },
  "critic_review_count": 303,
  "duration": 99,
  "genres": [
    "comedy",
    "horror",
    "sci-fi"
  ],
  "gross_income": 141307,
  "max_screens": 19,
  "mc_avg_user_score": 7.0,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "John Dies at the End",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 35,
  "mc_pro_critic_reviews": [
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "It lays waste to linear narration, thematic coherence, psychological plausibility and just about everything else you might expect to encounter. It zigs, zags and trips over its own feet and on its own home-brewed hallucinogens. It's a ridiculous, preposterous, sometimes maddening experience, but also kind of a blast."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "Is this an \"indie\" film with a deliberately messed-up chronology and an ambitious narrative you'll appreciate even more the second time through? Yes. Is this a deliberately trashy horror-comedy with a few decent jolts and several big laughs, best viewed with a gang of friends and a consciousness-altering agent of your choosing, parasitical or not? That too."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "A gleefully crummy buddy comedy that uses horror-movie conventions as catapults to hurl the audience down one \"whoa, dude!\" narrative wormhole after another."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "Give or take the titular disclosure, John Dies at the End is a thoroughly unpredictable horror-comedy -- and an immensely entertaining one, too."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "John Dies at the End is easily funnier than it is scary, and much like the drug at the center of the story, it offers one hell of a trip."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Some of the themes and the hallucinatory special effects are reminiscent of Cronenberg’s “Naked Lunch,” and there are cheeky allusions to “Dawn of the Dead” and even “Eyes Wide Shut,” but a viewer with an open mind might say that this midnight-style movie is more enjoyable than any of them."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "John Dies at the End isn't deep. But it is deeply amusing, in the sickest possible way."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "It's a mess, but its best moments are exhilarating, getting hopelessly lost in Pargin's surreal, completely disorienting world."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "Despite its astronomical body count, John Dies at the End never takes itself seriously, and neither should you."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "This loopy slacker horror farce is so intent on playing with your head — and time, and space, and paranoid conspiracy theories — that it doesn’t care about making sense. Which doesn’t stop the film from being a pretty good bad time."
    },
    {
      "critic": "Charlie Schmidlin",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Coscarelli knows how to exploit horror/sci-fi tropes and adeptly meld a practical effect with a well-timed gag. Many could depict a man's disembodied moustache with the right degree of farcicality, but few can imbue it with such an oddball credibility."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "Before it trips over its own overly complex plot, before the comic leads have exhausted their modestly amusing repertoires, this odd stoner/sci fi creature feature blows out of the gate and threatens - for about thirty minutes -  to blow your mind.  Then it doesn't."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "Coscarelli junkies won't be bothered by the film's herky-jerky rhythms. Go for the freaky fun of it, though a little soy sauce on the side sure wouldn't hurt."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Gonzo freakiness in such doses that cult status is practically ensured."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "This is really the kind of movie that was made to be watched in a haze after midnight, at which point it would all, no doubt, make perfect sense."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "Flaked with offbeat witticisms, cheese ball effects and fanboy splatter gore, the surreal John Dies at the End has the vibe of a shaggy dog story, which works both for and against it."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 55,
      "summary": "Once the colorful anecdotes sprawl out into an actual narrative, the film gets convoluted and loud, amplifying the weirdness without doing much to clarify it."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Another is how the film manages, in the absence of a coherent plot, to be so funny and engaging until, somewhere around the midpoint, it goes as flat as a stepped-on creepy-crawly."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Coscarelli's screenplay introduces an abundance of intriguing concepts but never goes very far with any of them. The characters are paper thin and the special effects are laughably bad."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "A supernatural action comedy that can never live up to its exciting opening scenes, Don Coscarelli's John Dies at the End mixes horror-tinged mayhem with smart-alec laughs but loses momentum early and gets bogged down in exposition."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "This is a fantasy grab bag in which nearly anything can happen."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "The whole movie is an inside joke, a shaggy-dog tale that asks us to pay close attention to its twists and turns, but never rewards us for doing so."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "Every single thing wrong with John Dies at the End might have been avoided had John died at the beginning, along with all the other characters, transforming an awful full-length movie into a harmless five-minute short."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "A supernatural horror-comedy that's frighteningly lacking in wit, John Dies at the End thinks it's \"Buffy the Vampire Slayer\" for dudes. But in its randomness, its vulgarity and its level of humor, it's more like the collected writings on the walls of a roadside men's room."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "The frantic, grotesque imagery ironically only highlights Don Coscarelli's inability to truly cut ties with the constraints of accepted storytelling."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "This frenetic horror-comedy from \"Bubba Ho Tep's\" Don Coscarelli is of the make-it-up-as-you-go-along school of storytelling."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "summary": "John Dies at the End is a product of a parallel universe where slacker flippancy never got old-and, oh, it is terrible."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Interesting premise but a huge let down.  There are a few moments that are kind of fun, but half the time you are like how is that happening and that and then that.  Things just get stupid and pointless.",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A quirky and unusual comedy/horror it's not anything special except it's really different. It should hit cult icon status. Oh BTW I never read the books. I did hear there were issues between the movie leaving a lot out. If your in the mood for something different and a comedy then this is for you. The spiders bit cracked me up.",
      "total_reactions": 1,
      "user": "kris2fur"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "I would describe this film as an entertaining ride of weirdness and oddball humor. It was made on a shoestring budget evident by the cheesy VFX and rather fake blood and gore stuff, but it adds to the charm (as it did for Evil Dead). Don't expect it to be as brilliant or profound as say Donnie Darko but be open to it and give it a fair chance and you'll get a fun 100 min experience!",
      "total_reactions": 1,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "A cautionary tale of the real secret of the universe, the title is not really a spoiler but more of a \"side effect\" of the film's supernatural narcotic called Soy Sauce, giving us a glimpse into a weird, exciting, and horrifying Earth where all that stands against ultimate destruction is David Wong and his friend John.",
      "total_reactions": 1,
      "user": "dm_punks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "It's all over the place. It has a dry deadpan delivery for dialogue and an over the top cartoony physical comedy for the real world plot stuff. It's a strange mix, one that does and doesn't work depending on the scene.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Cross \"Bill & Ted's Excellent Adventure\" with \"Men in Black\" and you have a rough idea of what to expect. Two slackers stumble upon a \"sauce\" that confers paranormal powers, but also invades the body with alien parasites. There's plenty of left field humor (although not often funny) and some moderately cool special EFX. The story starts out with a fun feel, but ends up confusing and dumb. Writer/director Don Coscarelli (Bubba Ho-Tep, Phantasm) loves the off-kilter, but isn't sufficiently imaginative to make his movies anything other than good-natured cult ramblings.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "I went into this move with high hopes. I love quirky. I like horror comedy. I like non-standard narration. I like Paul Giamatti. The problem was that this never added up to anything. It was a series of gaping plot holes strung together for no apparent reason.",
      "total_reactions": 0,
      "user": "Kissellian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I'm not sure if this is the best movie of 2012 that I've seen, but it's by far the most creative. Whether or not you like it, between the stunning visuals, strange supernatural themes, philosophical undertones and multi-layered storyline, it's definitely a movie you won't forget any time soon, and one you won't regret seeing. While I do admit the plot could've used some further explanation, one could argue that the ambiguity adds some kind of mystique to the situations presented here. I thought it was very enjoyable all-around, and in my opinion the great acting, great visuals, creative thought-provoking plot and unorthodox execution make John Dies at the End a must-see movie of 2012. (Even if the wide release was technically in 2013...)",
      "total_reactions": 0,
      "user": "Mab_987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "I might be really biased, I actually read and really liked the the book, but the first half of the movie was enjoyable. On the other hand, towards the end it just took a wrong turn. Felt like they rush the end. The cheap effects at the end didn't help either.",
      "total_reactions": 0,
      "user": "loki-sf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "This is the second time I was tricked and cheated. When I saw the movie 'John Tucker Must Die' I was in the same state as now where they deceived me by telling John will die but he never was gonna. So you know  now that John is not going to die. The title from both the movies are metaphorical, that's all. Okay, now we gonna talk about this movie. I must say this B movie impressed me a lot. Who are all these people, I really don't know anyone other than super cool Paul Giamatti. His addition to the story boosted the movie. In fact his role was a similar one to Rafe Spall in 'Life of Pi' and Christian Slater in 'Interview with the Vampire'.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "I personally enjoyed the movie, being a person who's never read the book. It's more intelligent than it makes itself out to be, it gets you thinking a bit, there are some enjoyable twists, and overall it's a cool movie. I would recommend it to a friend.",
      "total_reactions": 0,
      "user": "Siperfire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "A madcap romp with a thin veneer of philosophy, that  when imbibed with  liberal amounts of mind altering substances is both viscerally pleasing, and intellectually engaging.",
      "total_reactions": 0,
      "user": "TiberiusRex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "John Dies At The End is a quirky, funny and drug filled movie. The film revolves around a new drug, called Soy Sauce, which alters the way people interact with the world. The film does well at introducing you to the strange behaviors and possibilities allowed by this concept. First and foremost, this movie is not for those who dislike violence, nudity, and/or profanity. This movie takes advantage of all three in ways that while clever could be off-putting to some. The movie keeps a nice pace throughout, never boring the viewer, but does include a number of strange events that will put some viewers off by the strange and somewhat childish humor. For those who can look past what some would call vulgar humor, the movie is a well paced, funny film focused on friendship and the universe (odd pairing, I know--it'll all explain itself throughout the film). With that said, I was very disappointed at the ending, which dragged past the clear solution, and left me a bit confused. If the film had ended just a tad earlier, I would have been much more satisfied with the movie.",
      "total_reactions": 0,
      "user": "R4z3r"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "As it begins, John Dies At The End is a faithful adaptation of David Wong (Jason Pargin)'s incredible novel. The depiction of the trippy opening riddle, the house investigation sequence, and pretty much every other horrific and hilarious event for a long while onward is superb; the source material is one of my favorite books of all time, and I found myself giggling along as reality itself seemed to lose its mind on the screen. I was even okay with most of the expected changes, like the meat monster appearing in Shelly's basement and Dave meeting Robert North (Roger in the film) as he drives John home rather than much further on. There were... darker spots, but I'll get to them later.",
      "total_reactions": 0,
      "user": "SbenLives"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "This is a weird, wonderful film which will be either loved or hated.  It you like things such as Shaun of the Dead, Tucker and Dale vs Evil, or Todd and the Book of Pure Evil, you will love this one.  Filled with comedy, bizarre supernatural occurrences, and miscellaneous mischief, this film is very enjoyable.",
      "total_reactions": 0,
      "user": "himeeg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "You may or may not be familiar with the work of Jason Pargin already. If you've ever visited Cracked.com, then you may know him by his pseudonym, David Wong. Here, Pargin adapts his own book, written by his alter ego, of the same name, starring his pseudonym self.",
      "total_reactions": 0,
      "user": "choc_raisins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"John Dies at the End\" 10 Scale Rating: 5.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "John Dies at the End is one of those delightfully weird movies. Yes, it lacks here and there in various aspects (e.g. plot) but none of that detracts from the fun. While I found it to be a notch below classics such as Repo Man, still it is undeniably a good time.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    }
  ],
  "metascore": 53,
  "name": "John Dies at the End",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 25,
    "month": 1,
    "year": 2013
  },
  "opening_weekend_income": 12467,
  "opening_weekend_income_currency": "$",
  "rating": 6.4,
  "rating_count": 31068,
  "rating_freq": {
    "1": 793,
    "10": 2394,
    "2": 638,
    "3": 1002,
    "4": 1759,
    "5": 3298,
    "6": 6030,
    "7": 7676,
    "8": 5270,
    "9": 2208
  },
  "release_day": 25,
  "release_month": "January",
  "release_year": 2013,
  "user_review_count": 113,
  "votes_per_demo": {
    "aged_18-29": 8886,
    "aged_30-44": 14837,
    "aged_45+": 3307,
    "aged_under_18": 32,
    "females": 3343,
    "females_aged_18-29": 1382,
    "females_aged_30-44": 1480,
    "females_aged_45+": 340,
    "females_under_18": 1,
    "imdb_staff": 6,
    "imdb_users": 31068,
    "males": 24275,
    "males_aged_18-29": 7395,
    "males_aged_30-44": 13187,
    "males_aged_45+": 2900,
    "males_under_18": 31,
    "non-us_users": 15145,
    "top_1000_voters": 314,
    "us_users": 7986
  },
  "year": 2012
}