{
  "avg_rating_per_demo": {
    "aged_18-29": 5.8,
    "aged_30-44": 5.4,
    "aged_45+": 5.5,
    "aged_under_18": 5.7,
    "females": 6.2,
    "females_aged_18-29": 6.2,
    "females_aged_30-44": 6.1,
    "females_aged_45+": 6.2,
    "females_under_18": 6.2,
    "imdb_staff": 6.5,
    "imdb_users": 5.7,
    "males": 5.2,
    "males_aged_18-29": 5.4,
    "males_aged_30-44": 5.0,
    "males_aged_45+": 5.2,
    "males_under_18": 5.6,
    "non-us_users": 5.3,
    "top_1000_voters": 4.3,
    "us_users": 5.8
  },
  "avg_screens": 1078.857142857143,
  "budget": 6600000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 24,
    "month": 6,
    "year": 2011
  },
  "critic_review_count": 49,
  "duration": 112,
  "genres": [
    "comedy",
    "drama"
  ],
  "gross_income": 37295394,
  "max_screens": 2035,
  "mc_avg_user_score": 5.0,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Jumping the Broom",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 8,
  "mc_pro_critic_reviews": [
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 91,
      "summary": "You'll laugh - a lot - but you'll also shed tears of recognition at this funny, salty, strife-torn look at the agony and ecstasy of family."
    },
    {
      "critic": "Kevin Thomas",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "This endearing picture is proof that it is still possible for a major studio release to be fun, smart and heart-tugging and devoid of numbskull violence and equally numbing special effects."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "In style and structure, it mimics an old-style studio effort, a culture-clashing comedy of manners that's tinged with melodrama and filmed in a smart progression of medium shots."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "The film works because the screenwriters, Elizabeth Hunter and Arlene Gibbs, have a knack for juggling a dozen-plus major characters without succumbing to the obvious class-warfare gags every 90 seconds."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "The cast is large, well chosen and diverting. The ceremony is delightful."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "Perceptive, faith-based romantic comedy."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "This buoyant, multigenerational comedy that takes its title from the African American wedding ritual has other distinctions as well. It's relatively raunch-free, it has a sparkling cast that reunites \"Waiting to Exhale\" stars Angela Bassett and Loretta Devine as combative matriarchs, and it likes its characters well enough to forgive them their faults."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "These characters are so likeable, and so well-portrayed, that it's easy to go along with it all."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "Jumping the Broom also benefits from a great soundtrack (Al Green, Aretha, El DeBarge, Curtis Mayfield)."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "As wedding stories go, it's an improvement over the dreadful \"Something Borrowed,\" though it doesn't have anything terribly new to say."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a self-conscious, inherently absurd tale of a rich black family invaded by secrets, lies, working-class loudmouths, and one or two pairs of pants found down around the ankles."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "The funny moments outnumber the warm ones. There's a touch of religion and plenty of melodrama, especially in the contrivances of a cluttered and drawn out third act."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "Director Salim Akil has found actors skillful enough to enhance Elizabeth Hunter and Arlene Gibbs' conventional screenplay."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "Despite heavy-handed characterizations, Devine and Bassett make their stake in the union felt, and it's anything but superficial."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 58,
      "summary": "While Broom largely isn't a broad comedy, it still rarely goes for restraint in anything but tone."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Amid other wedding movies crowding screens these days, not to mention Perry's \"Madea's Big Happy Family,\" Jumping the Broom feels instantly familiar. And tired."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "It's the snobs against the slobs at a Martha's Vine yard wedding in Jumping the Broom. Mostly, it's a tie: Both sides are equally irritating."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Instead of being a wild mixture of tones, it has very little tone at all, and moments of dramatic or comic intensity erupt awkwardly and then fizzle out."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Smarter than expected, even if it's too ragged to truly resonate."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "The actors, particularly the icy Bassett and the fiery Devine, excel in their roles and drive home the film's multifaceted messages."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "A late-act crisis precipitated by scandalous maternity news is straight out of the Tyler Perry Academy of Plotting, and all the beseeching of the Lord sounds like little more than product placement."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 45,
      "summary": "Director Salim Akil deserves credit for keeping the film from falling apart completely. He sets a the brisk pace, and uses the picturesque oceanside setting to give the movie an inviting gloss even as the overstuffed narrative threatens to push viewers away."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "While Jumping the Broom showcases rarely depicted class issues within the black community, the film still relies on wince-inducing stereotypes to delineate them."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "A wedding comedy that grows increasingly unfunny with each passing minute."
    },
    {
      "critic": "John Anderson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "A broad African-Amerian family comedy that manages to avoid many of the more predictable cliches of the genre, yet also leaves out the warmth and, too often, the laughs."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "Thank goodness for Tasha Smith's character, Shonda. She supplies the only reliable laughs as Pam's fun-loving best friend."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "nothing new in this story and nothing exceptional either. too bad for Angela Bassett to waste her talent on this tired movie. full of contrived drama that has neither rhyme nor reason to exist within the parameter of the story. it's as if the writer is writing by checking off plot points one after another and making up crisis to bridge them together.",
      "total_reactions": 1,
      "user": "MadMonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "It's a fun movie with a big heart that gets much stronger toward the end. It's not quite as funny as I expected it would be, but Loretta Divine is terrific (as usual) and Mike Epps is solid as the funny uncle who can tell it like it is. The \"surprise\" family development in this film wasn't nearly as explosive as the surprise in the recent Madea's Big Happy Family, and therefore didn't have quite the same impact.  Overall, it's entirely worth seeing.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Analogous to the Talking Heads concert movie \"Stop Making Sense\", her's was a family of just white people in \"Rachel Getting Married\", but then God needed an angel(sorry, Nicole from John Cameron Mitchell's \"Rabbit Hole\"), and Carol, a black woman, replaced Abby as the household matriarch, when dad decided to get hitched again in the aftermath of Ethan's death, thanks to Kym, who drove her younger brother off a bridge while loaded. For better or for worse, the family wasn't so white anymore. With utmost delicacy, in \"Rachel's Getting Married\", there's definitely some channeling going on here, in which filmmaker Jonathan Demme returns to the Pantages Theater stage by employing the narrative construction from his 1984 music documentary as a sort of backstory for the similarly integration-themed movie. The Talking Heads were really cooking that December night back in '83. Standing on stage with bassist Tina Weymouth, during \"Heaven\", David Byrne sings \"Heaven is a place where nothing ever happens,\" which when transposed to \"Rachel Getting Married\", describes a double-edged happiness in that a life of uninterrupted domestic bliss becomes, perhaps, a life without challenges. \"Same as it ever was,\" nonetheless, Paul would have been content with being like a lot of Americans, who have no seconds acts, according to F. Scott Fitzgerald, but then Ethan died, so no longer did the \"water flowing underground\" go unnoticed. \"Thank You For Sending Me An Angel\" is seemingly sung in the voice of God, who, as it's stated in the Old Testament, created mankind in his own image, which is alluded to by a second-person lyric like \"you can walk, you can talk just like me.\" Correspondingly, Ethan had nothing but time to \"look around the world.\" Meanwhile, back on earth, integration came into his family's Connecticut home, as it did for the Talking Heads on their 1980 album \"Remain in Light\". As a monochromatic band, in \"Stop Making Sense\", the NYC musicians exhibit peerless musicianship and an engaging stage presence; as a multi-ethnic one, when Byrne & Weymouth(along with Chris Franz and Jerry Harrison) are joined by percussionist Steve Scales and backup singers Lynn Mabry & Edna Holt on \"Slippery People\", they become a better version of themselves. The same could be said about Rachel's family after Carol joins the fold. Paul, played by Bill Irwin, a noted performance artist, could be a virtual stand-in for Byrne, especially on \"This Must Be the Place(Naive Melody). Doing a little performance art himself, rock's renaissance man dances with a lamp on a stage that is decorated with the intention of being a house, akin to Paul and Carol's new home, where Rachel and Sidney, another interracial couple, are getting set for their nuptials, joined by a pan-cultural guest list whose easy camaraderie with each other is as natural as the on-stage interaction between Byrne's original lineup and their extended musical family. Sabrina's getting married in \"Jumping the Broom\", a class-conscious comedy about light and dark-skinned blacks that faintly echoes the 2009 Demme film in that both movies feature a slippery person who nearly derails the celebration with their own toxic brand of narcissism. Loretta Devine, playing a working class mother whose son is marrying an affluent woman she despises on principle alone, arrives at Martha's Vineyard by ferry and becomes flustered that nobody from the bride's family is there to greet her. They had sent a car and driver. Moreover, she's especially hurt by the no-show of her son, a potentially estranged son. Likewise, Kym wonders aloud where Rachel is, when dad picks his daughter up at the drug rehabilitation center. In both cases, the persecuted women go on to give scary speeches at their respective pre-wedding dinners. \"I'm Shiva the destroyer, your harbinger of doom this evening,\" goes Kym, using her turn, following round after round of warm speeches from well-wishers, to remind the variegated party guests that she's \"black\"(as in the black sheep of the family), whereas the postal worker addresses a segregated room, beginning with the platitude \"the meek shall inherit the earth,\" and in the process, points out that Mrs. Watson is black, despite the jaw-dropping revelation that her ancestors back in Jamaica had owned slaves. Further secrets are spilled. In order to exorcise her \"blackness\", Kim utilizes transference by questioning Abby's irrevocable decision to entrust a small child in the hands of a drug addict. Now the mother understands what it means to be \"black\". In \"Jumping the Broom\", Mrs. Taylor tells Sabrina that she's adopted. Her real father might be white, the result of an aunt's French fling. Upon discovering her true heritage, Sabrina complies to the slave tradition of \"jumping the broom\", an act made condescending, perhaps, born from white guilt. Pretend time is over. Her bourgeois ways start to make sense.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Nice cast.  Some very good performances.  Technical aspects were really above average.  The real plus here is seeing two black families portrayed as \"real\" families dealing with issues that are universal to all of us.  Well done.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "Skip-it - Two African-American families meet in Martha's Vineyard for a obnoxiously unfunny wedding and terrible two hours of film.",
      "total_reactions": 0,
      "user": "RyanPratt"
    }
  ],
  "metascore": 56,
  "name": "Jumping the Broom",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 5,
    "year": 2011
  },
  "opening_weekend_income": 15215487,
  "opening_weekend_income_currency": "$",
  "rating": 5.7,
  "rating_count": 8226,
  "rating_freq": {
    "1": 586,
    "10": 1065,
    "2": 228,
    "3": 336,
    "4": 696,
    "5": 1322,
    "6": 1559,
    "7": 1248,
    "8": 784,
    "9": 402
  },
  "release_day": 6,
  "release_month": "May",
  "release_year": 2011,
  "user_review_count": 60,
  "votes_per_demo": {
    "aged_18-29": 2804,
    "aged_30-44": 3002,
    "aged_45+": 1147,
    "aged_under_18": 13,
    "females": 3410,
    "females_aged_18-29": 1529,
    "females_aged_30-44": 1242,
    "females_aged_45+": 466,
    "females_under_18": 4,
    "imdb_staff": 2,
    "imdb_users": 8226,
    "males": 3797,
    "males_aged_18-29": 1253,
    "males_aged_30-44": 1727,
    "males_aged_45+": 667,
    "males_under_18": 9,
    "non-us_users": 2913,
    "top_1000_voters": 123,
    "us_users": 2717
  },
  "year": 2011
}