{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.2,
    "aged_45+": 5.4,
    "aged_under_18": 7.3,
    "females": 7.2,
    "females_aged_18-29": 7.4,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.6,
    "females_under_18": 6.5,
    "imdb_staff": 3.0,
    "imdb_users": 6.8,
    "males": 6.6,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.1,
    "males_aged_45+": 5.1,
    "males_under_18": 7.3,
    "non-us_users": 6.5,
    "top_1000_voters": 5.3,
    "us_users": 6.6
  },
  "avg_screens": 476.7142857142857,
  "budget": 2500000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 8,
    "year": 2013
  },
  "critic_review_count": 25,
  "duration": 75,
  "genres": [
    "documentary",
    "comedy"
  ],
  "gross_income": 32230907,
  "max_screens": 892,
  "mc_avg_user_score": 6.5,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Kevin Hart: Let Me Explain",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 91,
      "summary": "A welcome change of pace and a truly hilarious, heartfelt experience."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 83,
      "summary": "Unfortunately, Hart seems to have taken the whole ''leave the audience wanting more'' maxim a little too much to heart. The film clocks in at a hair over an hour. That might be enough for an HBO special, but it feels a little thin for a feature film."
    },
    {
      "critic": "Kyle Ryan",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "Let Me Explain finds Hart at the peak of his powers, so the film’s long coronation feels justified, if gaudy. Strip away the preamble and just give him a mic, and he’d earn it all the same."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "It’s a brief movie, and perhaps all that preamble is meant to justify the ticket price. The best advice is to walk in about 25 minutes after the lights go down. You’ll still get all the laughs, and you won’t have to hear about Hart’s YouTube hits."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "If you were to judge Let Me Explain purely on its performance portion, filmed at Madison Square Garden during Hart's 2012 tour, the film would merit a full extra star. But at 75 minutes, it feels too skimpy to rave over."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "It’s all in the name of comedy, and it mostly works, with a couple of exceptions, including an especially mean-spirited and somewhat violent tirade against a fan he met in an airport."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Diverting but not enough to expand Kevin Hart's fan base much."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Some of Hart’s set — including jokes about his security team and an inspired recounting of a disastrous trip to a dude ranch — is hilarious. And his profane outrage is often funny enough to sell the weaker writing."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Fans will love it; their main complaint may be that it ends too soon. Amateur psychologists in the audience, meanwhile, may be asking why such a successful guy seems so defensive."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The Kevin Hart brand is clearly doing well, but Let Me Explain doesn’t seem interested in providing anything more than a surface-level presentation of the product."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Once you get past an incredibly self-indulgent intro — an uncomfortably long mash-up of comedy sketch and road-trip-with-entourage doc that seems simultaneously apologetic and arrogant — you can enjoy approximately an hour of boisterously freewheeling and unabashedly raunchy funny stuff in Kevin Hart: Let Me Explain."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "The film is flat and lazy, and the audio mix is so low it sounds as if the audience is barely laughing. His cable comedy specials have better production values."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Intermittently funny. But the movie's first 20 minutes is devoted to tediously showing how his career has taken off around the world. That might be fine if this were a documentary, or if it were done more artfully, and with humor — since we go into the movie expecting a 75-minute laugh-fest."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Few comedians talk so much to get a laugh, and sometimes the strain shows... And the directors don’t do him any favors by the annoyingly frequent close-ups of audience members in convulsions of laughter."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "The hour of mike time isn't as strong as such previous dispatches as \"Seriously…Funny.\""
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "Wait for this to show up where it belongs — on cable."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "In Let Me Explain, you’re never NOT aware that you’re watching a gifted, rubber-faced/rubber voiced performer (his “Laugh at My Pain” concert film was a surprising hit in 2011) work too hard to make inferior material go over."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "All together, it is a wearying display of defensiveness from a man who – by any barometer, not just his own – is wildly successful."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I have always loved Kevin Hart and his comedy. I laughed really hard a couple of times, it felt like I was gonna die. The parts where he isn't doing his stand-up was kind of a bore to me. He is getting way more successful in his career as he should be and I think he is only gonna get bigger. Pick this up on dvd or wait for Netflix to watch this must-see stand-up concert.",
      "total_reactions": 2,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Be there to enjoy Hart's performance and the lovely shots but don't be there if you want everything perfect or clichéd. Good performances and heart melting awesomeness.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Truly showcases Hart's comedic talents in a familiar but nonetheless hilarious way. It does start a bit slow, but it surely progresses into one of the best performances he's done in his career.",
      "total_reactions": 1,
      "user": "Eon2323"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "I honestly thought I would leave the theatre with my stomach hurting and in tears from laughing so hard. The hype for the movie was great. Trailers, sneak peeks, etc. Yet the movie it self was not as funny as I expected. Im quite sure if you saw his comedy in person then that feeling would be a little different. Overall, its a great movie for an after dinner laugh or a night out with your friends. Don't let other critics reviews stir you away from seeing it, you just have to judge for yourself. Some are just comparing and contrasting to his last movie \"Laugh at my pain\".",
      "total_reactions": 1,
      "user": "igo_bytyes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Let me explain is just as good as his other other stand ups. He is getting that paper because he deserves it. Memorable jokes and straight up honesty. The funniest man on earth does it again. Prepare to laugh and  consider dat ending.",
      "total_reactions": 1,
      "user": "almox21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "The beginning was a bit slow but my god the rest was hilarious! Some people are going to say that it should have been on cable but I'm fine with it being in theaters when it's that funny,",
      "total_reactions": 2,
      "user": "buckeyes7549"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "Painful to watch. I have a serious issue with him thinking that his set on cheating on his wife was funny. It wasn't and it makes him look like a HUGE JERK. He starts off with it so the rest I spent the rest of his set angry that people like him exist, and literally did not laugh once. This whole video should be embarrassing for him. I loved his old stuff, but I can seriously say after watching this that I am no longer a fan. The only MILDLY redeemable part of the show was at the end when he was crying about being so grateful, and I say mildly because he SHOULD HAVE BEEN GRATEFUL ENOUGH TO THE MOTHER OF HIS CHILDREN TO NOT CHEAT. I have laughed at cheating jokes before, I am not a comedy prude but he straight up said he didn't regret it and he would do it again. None of the jokes are funny when people don't like the person you are portraying yourself as.",
      "total_reactions": 1,
      "user": "likacheetah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "After a short setup sketch and a montage of his sold out tour in Canada and Europe, comic Kevin Hart mounts the stage at Madison Square Garden to do his stand up. In his manic, high-energy style he covers personal relationships with lots of profanity. I've enjoyed his performances in movies and found him entertaining, but the audience around me laffed a lot more than I did. If you like Hart's material, you won't be let down.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "I'm a huge Kevin Hart fan and I'm happy to say that this is more of his excellent stand-up comedy. There's a little skit at the beginning where Hart addresses some of the talk going on about him, but the majority of the movie is hilarious stand-up comedy that ends on a rather sweet note where Hart shares his appreciation for his fans. If you're a fan of Kevin Hart then this is a must watch. If you've never watched his stand-up than there is no better time than the present. \"Let Me Explain\" will serve as both a nice introductory to newcomers, as well as a treat for the fans. In my opinion Kevin Hart delivers once again and further cements himself in my mind as one of the funniest men on the planet. I can't wait to see more from him in the future.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Kevin Hart is a funny guy and all and Let Me Explain was a funny and enjoyable show but this was just completely unnecessary for the big screen, too short. Should've just been put on Netflix or DVD.",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "I was very disappointed in Kevin Hart's most recent stand-up special. The first 20 minutes were not even comedy, they were just a poorly written parody of him at a party trying to \"explain\" himself to his friends. Then the next 30 minutes were just boring, especially for Kevin Hart's standards. By that time, you're checking the clock every five minutes anxious for the special to end. Finally, after that snooze fest, some great, classic Hart-humor kicks in. I'd say the last 30 minutes of the special were outstanding and make the special worth watching. That being said, the first 50 minutes hurt the experience and dragged down the rating. The laugh-to-bore ratio should be better than 3-to-5.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "This movie is the bomb.Best movie ever.Kevin hart is the best actor ever and this movie is soooooooo funny.Everything about this movie is awesome.I give this movie a 10/10",
      "total_reactions": 0,
      "user": "shadowguy654"
    }
  ],
  "metascore": 53,
  "name": "Kevin Hart: Let Me Explain",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 5,
    "month": 7,
    "year": 2013
  },
  "opening_weekend_income": 10030463,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 6606,
  "rating_freq": {
    "1": 292,
    "10": 1183,
    "2": 96,
    "3": 152,
    "4": 242,
    "5": 530,
    "6": 1118,
    "7": 1414,
    "8": 1063,
    "9": 516
  },
  "release_day": 3,
  "release_month": "July",
  "release_year": 2013,
  "user_review_count": 31,
  "votes_per_demo": {
    "aged_18-29": 2840,
    "aged_30-44": 1773,
    "aged_45+": 312,
    "aged_under_18": 36,
    "females": 1079,
    "females_aged_18-29": 537,
    "females_aged_30-44": 317,
    "females_aged_45+": 73,
    "females_under_18": 5,
    "imdb_staff": 1,
    "imdb_users": 6606,
    "males": 4349,
    "males_aged_18-29": 2263,
    "males_aged_30-44": 1444,
    "males_aged_45+": 235,
    "males_under_18": 31,
    "non-us_users": 1898,
    "top_1000_voters": 65,
    "us_users": 1929
  },
  "year": 2013
}