{
  "avg_rating_per_demo": {
    "aged_18-29": 6.8,
    "aged_30-44": 6.1,
    "aged_45+": 6.3,
    "aged_under_18": 7.7,
    "females": 7.0,
    "females_aged_18-29": 7.1,
    "females_aged_30-44": 6.5,
    "females_aged_45+": 6.9,
    "females_under_18": 7.8,
    "imdb_staff": 5.5,
    "imdb_users": 6.5,
    "males": 6.3,
    "males_aged_18-29": 6.5,
    "males_aged_30-44": 6.0,
    "males_aged_45+": 6.2,
    "males_under_18": 7.5,
    "non-us_users": 6.4,
    "top_1000_voters": 5.7,
    "us_users": 6.5
  },
  "avg_screens": 23.625,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 21,
    "month": 2,
    "year": 2014
  },
  "critic_review_count": 191,
  "duration": 104,
  "genres": [
    "biography",
    "drama",
    "romance"
  ],
  "gross_income": 1029949,
  "max_screens": 74,
  "mc_avg_user_score": 7.0,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "Kill Your Darlings",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 44,
  "mc_pro_critic_reviews": [
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "Mr. Krokidas deftly shows how the ambition to write is entangled with other impulses."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "In this tale of longing, loss and regret, it isn’t always possible to know who’s deluding oneself, or someone else. But then, it isn’t always possible to know that in real life either."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 87,
      "summary": "It transcends the usual biopic limitations to tell a specific story about some well-known people with larger, universal implications."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 80,
      "summary": "Sex, drugs, murder, radical verse and Radcliffe make persuasive bedfellows in Krokidas’ live-wire lit-pic. It gets busy, but fizzy direction and Rad’s rigour help to keep its pulse alive."
    },
    {
      "critic": "Damon Wise",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 80,
      "summary": "A vibrant, insightful film about writers and writing, featuring Daniel Radcliffe’s best post-Potter performance."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "They flail and they thrash, and Krokidas' film is just like them — as jazz-inflected and freewheeling as the Beat poetry these guys were about to unleash on the world."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "Brash, bristling, highly watchable film."
    },
    {
      "critic": "Damon Wise",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Though it begins as a murder-mystery, Kill Your Darlings may be best described as an intellectual moral maze, a story perfectly of its time and yet one that still resonates today."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 78,
      "summary": "The film’s love for its subjects is mirrored in their passionate frenzy for words, and language – spoken, written, body – in general. Above all, and what sets it apart from other cinematic takes on the Beatified, is how much fun it is. It may end in tears, but then, don’t all great love stories?"
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "At the center of the film lies a moral question, not a literary one: Should Ginsberg abandon the potentially visionary Carr when he turns out to be a liar, an exploiter and an emotional traitor? Should he, in fact, “kill his darling” when Carr commits a heinous act and asks Ginsberg to lie for him?"
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "Kill Your Darlings is more coming-of-age story than murder mystery, but its characters are so well drawn and complex the emotional weight carries a suspense all its own."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "Kill Your Darlings is a tale of inspiration, then, but also a tale of jealousy, obsession, homophobia, and homicide. It's a whirlwind. Even if it doesn't all hang together, it's worth the ride."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "That Ginsberg is played by Daniel Radcliffe might come as a shock, but the shock wears off as the movie rolls on and you realize you’re in very good hands."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Far more coherent than last year's aimless \"On the Road\" and more sharply focused than 2010's \"Howl,\" it centers on a youthful Ginsberg finding his nascent artistic voice."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "It's almost enough to make you wish that Kokidas and co-writer Austin Bunn had fictionalized the story. But then again, a beardless Ginsberg isn't really Ginsberg at all, which gives Radcliffe all the room to play around with the character that he needs. It might be best spell yet."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s much more lively than “On the Road,” last year’s snoozy adaptation of the Kerouac novel that presented fictionalized versions of some of the same characters."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Sex, lies, betrayal and murder set among the gods of the Beat Generation. That's Kill Your Darlings, a dark beauty of a film that gets inside your head and stays there."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 70,
      "summary": "You wouldn’t want Kill Your Darlings to be the only information you ever get about the Beats. But it’s a decent introduction for the uninitiated, and interesting enough to those who know the story."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "There’s a limber, freewheeling aspect to the storytelling that echoes the rule-breaking literary form of the Beat writers."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "Directed with an assured sense of style that pushes against the narrow confines of its admittedly fascinating story, John Krokidas’ first feature feels adventurous yet somewhat hemmed-in."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "The saving grace of Kill Your Darlings is its sordid romantic angle, a narrative thread that pulls the film away from wink-wink allusions and into more serious emotional territory."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "As for Ginsberg himself: Should we be more impressed that Radcliffe so confidently portrays an actual icon, or that he banishes all memories of the fictional one he’s portrayed before? Both accomplishments suggest that he’s got real talent, and a future that’s already taking him well past Harry Potter."
    },
    {
      "critic": "Sam Adams",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Unfortunately, Kill Your Darlings doesn’t know what to do with Radcliffe and DeHaan, good as they are; there’s little sense of how they fit into a larger framework, or what bearing, if any, it might have on its more famous subjects’ later output."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Unlike Walter Salles’s recent adaptation of On The Road, which embraced the Beat philosophy with a wide and credulous grin, Kill Your Darlings is inquisitive about the movement’s worth, and the genius of its characters is never assumed."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 58,
      "summary": "Director and co-writer John Krokidas doesn’t have a very fluent gift for period re-creation – everything seems stagy – and most of the actors, playing divas of various stripes, overact."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 58,
      "summary": "Well shot and well made, Kill Your Darlings is a very competently constructed effort on a whole, but there’s an emptiness and familiarity at its core that it cannot transcend."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Despite its general intelligence and worthy performances, Kill Your Darlings makes it difficult to see how the Beats ever caught on."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Kill Your Darlings wants to be a young man’s movie, but it’s all “cinema du papa,” as the French New Wave used to call it. The philosophical disconnect is downright cosmic."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Something is missing here, like a clear perspective."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Far too conventional underneath all the trappings, you wish it would howl."
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "An overmatched star and a scarcity of eccentricity sink this hip-lit origin story from director John Krokidas."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "Along the way, Krokidas' story becomes a touch schizophrenic, at times a coming-of-age story, a love story, a crime drama and a literary drama. It's hard to say which it functions as best, as none are given too much time to germinate before Krokidas moves on to the next."
    },
    {
      "critic": "Michael Atkinson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Kill Your Darlings is an undernourished and over-emphatic film."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "There’s a heart here, but with all the superficial noise, it’s hard to hear it beating."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "It adds nothing to our understanding of \"Howl,\" and the movie is exactly what the poem isn’t: ordinary."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "Kill Your Darlings presents a minor prelude to a major literary movement."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "When Alan Ginsberg (Daniel Radcliffe) was a freshman at Columbia University, he made three writer pals (Lucien Carr, William S. Burroughs & Jack Kerouac) who would be the foundation of the Beat revolution. This isn't just about their seminal relationships (and Ginsberg's sexual awakening), but about the lethal act that caused a major fissure in their lives. Radcliffe does an impressive job, but all of the performances and the spirited pacing keep this freewheeling story interesting. While it's not a great film, it's the best I've seen on this subject and a cursory, yet fascinating glimpse into some complex relationships.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "At the very least, Kill Your Darlings is a fairly ingenious idea for a movie. Taking a little-known murder case in the early lives of Ivy League undergrads Allen Ginsberg, William S. Burroughs, and Jack Kerouac and using it to frame a tale of creative, sexual, and social awakening, John Krokidas’s film has ideas and ambition to spare. What could have easily become a Muppet Babies for the Beat set turns out to be, at least at first, a touching look at the intermingling of adolescent and literary passion in a world on edge. Somewhere in its conception, though, lie the seeds of its (partial) downfall. The film follows young, talented Allen Ginsberg (Daniel Radcliffe), a frustrated teen from Paterson, New Jersey, as he enters his freshman year at Columbia. There, he becomes captivated by Lucien Carr (Dane DeHaan), a charismatic bon vivant who likes to get up on tables and recite Henry Miller’s Tropic of Cancer from memory at the top of his lungs. “Lu,” as he’s called, introduces Ginsberg to wealthy Harvard scion and nonstop drug-experimenter Burroughs (Ben Foster, introduced in a bathtub clutching a mask feeding him nitrous oxide), as well as hunky, talented senior Kerouac (Jack Huston). Together, the four of them begin to breathlessly explore the creation of a new creative movement, to be called the New Vision, which will rejuvenate American literature and tear down the stuffy, hidebound morality and culture all around them. The nation might think it’s fighting fascism abroad, but these guys are convinced the real fascists are here at home, hiding in the ironclad poetic rules of meter and rhyme, and in the sexual mores governing society. “Let’s make the patients come out and play,” they proclaim. “We need new words, new rhythms!” What’s that you ask? Oh, right, the murder. While all this is happening, there’s also an older gentleman by the name of David Kammerer (Michael C. Hall), who expresses a bit too much fondness for Lu. For all his sophistication, the man is clearly obsessed, pathetically, with this beautiful young boy. He also appears to have given Lu some of his bolder ideas, so the notion of said ideas now being shared with the likes of Ginsberg and Kerouac (all of whom Kammerer sees as potential romantic rivals) clearly drives him nuts. The film opens with Lu dropping Kammerer’s bleeding body into a river, so I’m not really spoiling anything when I say that the story builds up to the older man’s death. Is it a murder, or a blood sacrifice in the name of art? Is he the darling being killed, or is there something more symbolic going on here? The screenplay, written by Krokidas and Austin Bunn (and, full disclosure: I went to college with these guys), provokes a lot of questions about the nature of influence, of tradition and revival and death and rebirth. And, for a while, it juggles all of them fairly effectively, in part thanks to the uniformly excellent cast. As Ginsberg, Daniel Radcliffe has to do a lot of journeying: He’s our audience surrogate, but he also has to go from wide-eyed naïf to burgeoning visionary, hinting at the oddball, revolutionary figure he’d eventually become. It’s one of the film’s boldest ideas, actually, to take the perpetually alienating and uncompromising Ginsberg as our “in.” But it works: Watch his queasiness, the tremble in his face, as he opens his acceptance letter to Columbia. DeHaan, for his part, finally gets to smile in a movie  sort of  and you can see what it is that draws all these people to Lu. It’s a surprisingly tricky part  a person who in real life would likely be insufferable, the kind of entitled  who walks into a party, kisses the first girl he sees, and complains that she tastes “like imported sophistication and domestic cigarettes.” But the young actor lends him just enough torment; you sense genuine vulnerability lurking behind all that fey confidence. Krokidas is smart enough to let most of the film’s drama play out in close-ups and to get out of his actors’ way. But he also offers up stylized montages, perhaps in an effort to convey the artistic revolution being cooked up: Some scenes play out (briefly) in reverse; background action stops; the action slows down. But it’s a very old-fashioned version of “style” and “experimentation”  lacking the looseness, the hypnotic unpredictability of the Beats. Even a couple of utterly conventional contemporary pop songs rear their heads. (One of them, TV on the Radio’s “Wolf Like Me,” has already been overused in movies  including Joseph Kahn’s Detention, a film which, for all its flaws, is probably closer in experimental spirit to the Beats than anything in Kill Your Darlings.) Narratively, Kill Your Darlings can’t quite keep all its balls in the air, and by the end all these connections the film attempts to forge  between the murder, the war, gay sex, culture, etc.  begin to feel more like a thesis than a human drama. And the canned stylization does the subject no favors, either.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "I found this film inspirational and beautiful. Both Dane DeHaan and Daniel Radcliffe are excellent in their roles. The film would have been great if they had included a bit more from Ginsberg's poetry and the Beat generation's ideas. Instead the story concentrates on a certain murder. But all in all, it's still a good story.",
      "total_reactions": 1,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Occasionally I come across a movie that I don't like, but not because it's a bad film. Somethings are not for everyone, but I can still appreciate the terrific performances and unique storyline of Kill Your Darlings. This film follows the early lives, and some previously untold stories, of the 1940's Beat Generation. People like Allen Ginsberg, Jack Kerouac, & William S. Burroughs are featured prominently in this film, and show what some of America's greatest writers were like when they were mere college students. The story centers mainly around Lucien Carr (Dane DeHaan),  who was better than any of them, and could have also been one of the greats, if it wasn't for an event that changed his life forever. The story is a gripping drama, telling a true, untold story from the 1940's, so what's not to like? There was a lot of focus on Philosophy, Art, Poetry and Love. There are some people that really that stuff up, but it just really wasn't for me. DeHaan and Daniel Radcliffe were both terrific, but I'll always have a problem seeing Radcliffe playing anyone except for Harry Potter, and when Radcliffe was in a rather graphic sex scene, I admit I had to avert my eyes. The bottom line is that Kill Your Darlings isn't a bad film, but it's very philosophic and somewhat slow moving. I can see how some people are going to absolutely love it, but I just found it slow and a bit too artistic for my liking.",
      "total_reactions": 2,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Still not satisfied with Daniel Radcliffe performance. He has to come out from the character Harry Potter. He must lose his eye glass and try to give natural expressions. He has to learn a lot to be a great actor in this competitive cinema world or downfall is guaranteed.",
      "total_reactions": 2,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "A dazzling character piece centres around a brutal murder case which implicates several future literature big shots of the beat generation, Allen Ginsberg (Radcliffe) is the freshman of Columbia University, he encounters a fellow student Lucien Carr (DeHaan), who brings him into a world of unorthodoxy and defiance against the rules and conformism, and he also meets the young Jack Kerouac (Huston) and William Burroughs (Foster). But Lucien’s personal imbroglio with his fervent lover David Kammerer (C. Hall), a professor-turned-janitor, makes everything complicated, and eventually the real-life event changes their life path forever.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "It’s no surprise that some of the most effective works of the Beatnik generation were born in the scuzzy halls of jazz bars; soaked with whiskey induced grammar, intoxicated with muddled philosophies, their pages bathed in the permanent smell of tobacco. Much like the work of Lewis Carroll, drugs, alcohol, and culture were catalysts towards the ideology of destroying the old and building the new. The movement itself was a rousing feat with great cultural ramifications. The film itself is a work that sometimes trades in the grainy for flashy; rupturing not only the pattern that the authors were trying to break, but the whole tone of the film as well.",
      "total_reactions": 0,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "While Radcliffe’s performance is both fearless and emotional, I couldn’t help but notice that his chemistry with DeHaan was not as convincing as it could have been, mere admiration compared to lust. A terrific piece on the beat movement, otherwise.",
      "total_reactions": 0,
      "user": "heromoder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "the idea of theses two as friends only somehow daniel radcliff gets to use phony and he has killed no girl...no im just kidding but really green goblin wouldn't have been sexualizing those literature....but still in comparison to harry potter the green would have to had at least have broken out of This jail....to b honest something about gayness is probably refreshing to ugly people like myself....otherwise i give a 5",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "Daniel Radcliffe is one of his most mature and risky roles. The epoc sreenplay is interesting. Maybe not suitable for some tastes, however is a good choice in the name of curiosity.",
      "total_reactions": 0,
      "user": "alejandro970"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "Kill Your Darlings is a magnificent effort by first-time filmmaker John Krokidas.  The movie is based on a true story set in 1944 when a young Allen Ginsburg, Jack Kerouac, and William S. Burroughs all congregated together in New York City, and whose lives were forever changed when a mutual friend, Lucian Carr, killed an acquaintance of theirs.   The project attracted one of the most acclaimed independent film casts of all time, featuring Daniel Radcliffe, Dane DeHaan, Michael C. Hall, Jennifer Jason Leigh, Ben Foster, Elizabeth Olsen, Jack Huston, and David Cross.  The prevailing motif throughout the film focuses on the cyclical nature of art as well as life.  With this in mind, Krokidas lays out a non-traditional plot structure that begins at the end of this true tale, jumps back in time, and as the movie unfolds, eventually circles back on itself.  The final result is a showcase of great performances paired with an equally striking aesthetic.  Krokidas’ unique blend of camera movement, sound design, graphics, and occasional distortion of time is a rarity among small-budget productions helmed by a debut filmmaker, making this gem that much more impressive.",
      "total_reactions": 0,
      "user": "Metaflix"
    }
  ],
  "metascore": 65,
  "name": "Kill Your Darlings",
  "num_weekends": 8,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 18,
    "month": 10,
    "year": 2013
  },
  "opening_weekend_income": 53452,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 27617,
  "rating_freq": {
    "1": 624,
    "10": 2571,
    "2": 336,
    "3": 564,
    "4": 1150,
    "5": 2659,
    "6": 5816,
    "7": 7325,
    "8": 4615,
    "9": 1957
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 70,
  "votes_per_demo": {
    "aged_18-29": 13017,
    "aged_30-44": 6875,
    "aged_45+": 2161,
    "aged_under_18": 146,
    "females": 8800,
    "females_aged_18-29": 5981,
    "females_aged_30-44": 1806,
    "females_aged_45+": 415,
    "females_under_18": 98,
    "imdb_staff": 4,
    "imdb_users": 27617,
    "males": 14259,
    "males_aged_18-29": 6845,
    "males_aged_30-44": 4975,
    "males_aged_45+": 1702,
    "males_under_18": 46,
    "non-us_users": 13887,
    "top_1000_voters": 240,
    "us_users": 3740
  },
  "year": 2013
}