{
  "avg_rating_per_demo": {
    "aged_18-29": 7.9,
    "aged_30-44": 7.5,
    "aged_45+": 7.5,
    "aged_under_18": 8.4,
    "females": 7.8,
    "females_aged_18-29": 8.0,
    "females_aged_30-44": 7.6,
    "females_aged_45+": 7.5,
    "females_under_18": 8.7,
    "imdb_staff": 7.3,
    "imdb_users": 7.7,
    "males": 7.7,
    "males_aged_18-29": 7.9,
    "males_aged_30-44": 7.5,
    "males_aged_45+": 7.5,
    "males_under_18": 8.3,
    "non-us_users": 7.6,
    "top_1000_voters": 7.2,
    "us_users": 7.7
  },
  "avg_screens": 1447.4375,
  "budget": 81000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 26,
    "month": 6,
    "year": 2015
  },
  "critic_review_count": 422,
  "duration": 129,
  "genres": [
    "action",
    "adventure",
    "comedy"
  ],
  "gross_income": 128248205,
  "max_screens": 3282,
  "mc_avg_user_score": 8.1,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 123,
  "mc_movie_name": "Kingsman: The Secret Service",
  "mc_negative_rating_frequency": 102,
  "mc_positive_rating_frequency": 1173,
  "mc_pro_critic_reviews": [
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 91,
      "summary": "This is a case of all the elements lining up and pushing a potentially good film into the great category because of just how well executed it is."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 91,
      "summary": "Vaughn and his collaborators have taken a crude and disposable property and turned it into something more – a thoughtful, exciting, whip-smart spy adventure that doesn't let its smart-ass post-modernism overwhelm its playfulness or its heart."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 90,
      "summary": "Those more devoted to the genre can debate whether Matthew Vaughn's Kingsman is the best comic-book movie of the last few years. What's beyond argument, however, is that Vaughn has whipped up the most interesting one, the only to make ferocious, unsettling art out of the great contradiction of superheroic fantasy: jolly do-goodism and its brutalizing sadism."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 88,
      "summary": "Firth is brilliant. He’s playing a veteran super spy in a very violent but very silly movie, but even when Harry is explaining why there’s a dead stuffed dog in his bathroom, Firth gives a disciplined, serious performance."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "Injecting fun and fairground thrills back into the spy movie, Kingsman is a blast. Firth is sensational, Jackson rules and newcomer Egerton surprises. Mission accomplished for Matthew Vaughn."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Despite the presence of grandfatherly Michael Caine, Kingsman’s tone is about as far from the Christopher Nolan-style superhero film as you can get. Verisimilitude is frequently traded in for a rich laugh. The action scenes delight with shock humour."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Kingsman: The Secret Service is a startlingly enjoyable and well-made action film leavened by humor and slicked along by style, made by, for, and about people who’ve seen far too many Bond films."
    },
    {
      "critic": "Chris Hewitt (1)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Perhaps the riskiest mainstream movie in years, Vaughn’s love letter to spy movies may be uneven in places, but it’s ultra-violent, envelope-pushing, and fun enough to overcome the flaws."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Kingsman is as violently kinetic as anything Vaughn has made, a list including Kick-Ass (the good one) and Craig's U.S. breakthrough, Layer Cake. But Kingsman is also wildly uneven, often slowing its roll to stiff-upper-lip pacing necessary (or not) to create a new British secret agent movie mythology."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Fast-paced with a morbid sense of humor and copious pop culture references, Kingsman breezes along at a nice clip until it gets a little bogged down during its final third."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "A lively, dashing and amusing motion picture that smartly spoofs and slyly celebrates the James Bond spy-film franchise."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s also a movie that further establishes Vaughn as one of the edgier and more underrated genre voices of the moment, and that makes us wonder why Colin Firth hasn’t indulged in an action sideline all along."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Kingsman delivers on its promise of escapist fun, with a touch that alternates between Galahad’s old-school polish and Eggsy’s roguish charm. Like the rookie who knows that you have to make a few mistakes while following the master, the movie shrugs off its missteps with a wink and a smile that makes them easy to forgive."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Mashing up satire, subtle social commentary, clever gadgetry, keen wit and high-octane style, this spy saga — based on the comic book series The Secret Service — is bolstered by a terrific cast."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "OK, got it. It's a spy movie spoof, \"Austin Powers\" with more violence and less camp, a Bond parody that zeroes in on the Roger Moore era, when the sets and gadgets got bigger and the stories got dumber."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Kingsman is all over the place, sometimes to its detriment. But you won’t want to miss the surprises it delights in springing."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Speaking of young men, newcomer Taron Egerton, playing Harry’s protégé, delivers a star-making performance flush with the kind of charm and unexpected gravitas that no amount of flashy filmmaking can fake."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "Kingsman is full of elaborately orchestrated violence and acrobatic stunt work, shot in fast, sinewy, CGI-enhanced long takes that push and pull our perspective this way and that. It’s all very silly and not really meant to be taken seriously, but as the story gets more and more brutal, something strange happens: We start to care for these cartoonish characters and this absurd scenario."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "Directed by \"Kick-Ass\" action specialist Matthew Vaughn with slightly more vigor than necessary and a shade less restraint than needed, it's a bit too too to be \"brilliant,\" as the Brits say. But it's not half bad either."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "Director Matthew Vaughn strikes an energetic balance between cartoonish action and character-driven drama... The mix grows less seamless and the story loses oomph as it barrels toward its doomsday countdown, but the cast’s dash and humor never flag."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "While seriousness has overtaken the Bond franchise in recent years (hardly a bad thing, mind you), Kingsman runs no such risk. Vaughn welcomes details that might seem silly in another director’s hands, such as a bulletproof umbrella or tiny microchips that can make one’s head explode, presenting everything playfully enough that plausibility isn’t a factor."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "A live-action Hammacher Schlemmer catalog of pseudo-retro novelties, spiced up with self-aware asides and over-the-top violence — slick entertainment, provided the viewer turns off whatever part of their brain is responsible for recognizing and parsing subtext."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "The film never entirely figures out what it wants to do with the myth of the superspy, but at least it has fun along the way."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Never less than slick, precision-tooled multiplex entertainment, Kingsman hews close to the formula Vaughn and his co-writer Jane Goldman established in their superficially similar \"Kick-Ass\": hyperspeed action, pithy one-liners and grotesque ultraviolence."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "On many levels, Kingsman has the makings of a sure-fire hit. Yet, this is one spy story even the most dedicated addicts of the genre would do well to miss."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It sounds fun in theory, I guess, and there are some entertaining moments of rude irreverence here and there but the giddiness gets a bit tedious after a while."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Mr. Firth gives his all, and then some. He’s very funny, even touching, when the material allows him to be. Yet the production, directed by Matthew Vaughn (“Kick-Ass,” “X-Men: First Class”) from a screenplay he wrote with Jane Goldman, can’t contain its centrifugal force."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It tries to get by on charm, and like a lot of movies, and people who make that attempt, “Kingsman” does have charm — just not enough."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "As February comic book movies go, this works well enough to make you glad they didn’t cook up another “Ghost Rider.”"
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "This is pitiful stuff, and, like the violence, it eats away at the blitheness for which Kingsman strives, leaving an aftertaste of desperation that the Connery of “Goldfinger,” say, would not have dreamed of bequeathing. The sadness is that Firth, alone in the film, does raise the spectre of those days, radiating a lightly amused reserve amid the havoc."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The problem is that Mr. Vaughn has no interest in, or perhaps understanding of, violence as a cinematic tool. He doesn’t use violence; he squanders it."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Half amusing and half appalling, Matthew Vaughn’s shameless spy caper Kingsman: The Secret Service is ultimately done in by its own hypocrisy."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Yet for all Vaughn’s attention to stylized details, I noticed a number of obvious continuity errors throughout to which Vaughn seems blind."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Kingsman is like a high-speed collision between a Jaguar and a jaywalking soccer hooligan. It’s ridiculously out of balance, and when you’re stuck in the middle, it doesn’t seem so funny."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Silly, sadistic and finally a little galling, Kingsman: The Secret Service answers the question: What would Colin Firth have been like if he'd played James Bond?"
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Kingsman: The Secret Service borrows the tone, story, characters and humor of “Kick-Ass,” only this time in a 007 world instead of Batman’s. Nearly everything it does, it does poorly: This one is “Weak-Ass.”"
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Expensive, derivative and boring as mattress ticking masquerading as designer fabric."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "It's tructured in familiar, safe terms, plays for very low stakes, and appeals to no one so much as white, male teenagers with chips on their shoulders."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "The more calculated Vaughn’s films are to appeal to his surprisingly rabid fan-base, the more they seem custom-built to repel everyone else."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 12,
      "pos_reactions": 60,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Kingsman is the most lavishly violent, sleek and funny spy movie that I have ever seen. Colin Firth is brilliant and newcomer Taron Edgerton was great in the supporting as well. Samuel Jackson made the perfect villain. One of my favorite directors- Matthew Vaughn,  is at the top of his game. The fight scenes are perfectly choreographed, and the comic element is top notch. This is a movie that you will die to see again after walking out of the theater. Ignore the Fifty Shades that stop you from getting to the theatre, watch this movie.",
      "total_reactions": 72,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "What a disappointing movie experience this was - some great actors giving performances that can only be described as mediocre at best. This takes action movies back about 2 decades.... don't bother.",
      "total_reactions": 4,
      "user": "NRNSW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Fantastic, unexpected, jubilant and occasionally ridiculous fun. The performances are well executed yet a little odd, the dialogue is great and the storyline is absolutely compelling and thoroughly engaging. I wasn't sold until around twenty minutes in, when I found myself laughing with disbelief at the sheer joy with which the film treats the genre. Masterful choreography and cinematography mean the action sequeces are delightful, and whilst there are a few moments which fell flat, overall this is a really enjoyable experience and a lot of fun at the cinema. 8.02/10",
      "total_reactions": 3,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Although I enjoyed myself, I do think the film had some issues. The fast edited fight scenes go on way too long, it's really violent, and the film can't really decide if it's an all out comedy or drama. At times it has \"Airplane\" type of humor, like it's making fun of the spy genre, and other times heavy on the drama. At one point they even poke fun of product placement in movies with McDonalds, again showing the \"Airplane\" style of satirical humor.  Somehow it all worked for me mainly due to the spirited acting by everyone involved. Not really a film I would desire to see again but fun for an afternoon.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "If you expecting a realistic dark gritty spy movie, you will be disappointed. If you remember the late 1970s and 1980s James Bond movies, that is more like what you should expect. This is a popcorn flick and if you go in with that in mind, you should enjoy it.",
      "total_reactions": 2,
      "user": "kevtheobald"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Not bad overall. Unexpectedly lighthearted nature of the characters for the level of violence. Violence was over-the-top, fast-paced, almost cartoon style with everything sped up. I give it a 7 because the story was alright and the movie was fun to watch. Probably recommend a rent if you haven't seen it.",
      "total_reactions": 2,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "If and I mean   IF  you are into some \"What the F\" scenes every so often (the flooding barracks scene) and if you're into some imaginative fight scenes that occur every so often, rent this pic.   Otherwise, forget it.  I do have to admit---some of the best-filmed action sequences I've ever seen---too bad the best scene took place in a church, of all places, and the blood ran freely to the tune of    \"FREEBIRD\"????????    wow----kinda too much.    W",
      "total_reactions": 2,
      "user": "wadewilliams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Absolutely superb film, absolutely made up for the current run of staid and moronic Bond films and made me want to turn around and go back in for another viewing.",
      "total_reactions": 1,
      "user": "MB_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Enjoyable movie. Refreshing. Certainly better than all those James Bond movies. Violence is bit extreme in a couple of scenes, but it is toned down by lack of too much blood. Anyway, you cannot have the plot of the movie presented properly without the violence.",
      "total_reactions": 1,
      "user": "emirbud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I don't understand the meaning of the end of the movie, but the rest of the movie was highly entertaining. I loved seeing Colin Firth as an action hero as it's quite out of character for him.",
      "total_reactions": 1,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Alright be careful when you watch this movie. Stay away from having that 007/hardcore secret agent mindset and loosen up because there's plenty of comedy peppered in. I first want to say that Colin Firth was a good choice and I expect alot of good work from him. Also, it almost seems like a gimmick that Samuel Jackson was portrayed but he DID NOT disappoint guys.  I didn't really pay attention to the music this time but like I mentioned earlier don't expect the trademark 007 stuff.",
      "total_reactions": 1,
      "user": "acaiberry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "A juvenile version of James Bond. Could have been so much better if they had a sense of how far is too far. Oh well. I really was enjoying it at first but then they had to go for R rateing.",
      "total_reactions": 8,
      "user": "jackmor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "It's Fun, a little heavy handed in comedic delivery, but it's action sequences are cool and very well shot. If you want to see a movie where you walk out and think... that was a good use of time and $$$ just for some action fun, then this movie won't disappoint.",
      "total_reactions": 7,
      "user": "cazna"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Stylish in more ways than one. The film is a ton of fun while being just unconventional enough to feel refreshing. Based on the awful lineup of trailers shown preceding this film, I'd wager this is best I'll see in 2015 until Avengers 2.",
      "total_reactions": 11,
      "user": "Yen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "With Kingsman Matthew Vaughn does for the spy movie what he did for the superhero movie with Kick Ass. An over the top action film that will have you gasping and laughing in equal measure. Vaughn's masterstroke is casting Colin Firth as the hero spy and having him kick ass in a way that we have never seen before. There are amazing stand out sequences (the church, the pub, the Land Of Hope And Glory finale) but what makes the film work are the little touches and the clever references to spy films of the past. The one bum not is a final joke that seems woefully out of place, but up to that point the film got virtually everything right",
      "total_reactions": 10,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "A cross between Kick-Ass and Bond, which fans of the former will certainly enjoy, Kingsman maintains a great pace throughout with a number of excellent action sequences as well as a darkly humorous streak.",
      "total_reactions": 5,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "An uproariously funny spoof of James Bond films, filled with lots of big laughs and plenty of tongue-in-cheek humor. While this film may not be for the squeamish, those with an offbeat sense of humor will appreciate the raucous nature of its over-the-top spoofs, many of which are set to perfectly chosen rock classics. Rock on, dudes.",
      "total_reactions": 5,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "At first it is a fun twist and update to the Bond brand of spy genre.  But when the unexpected violent Tarantino church scene happens, the movie takes a sudden lurch into a completely different area altogether.  It tries to regain its light and fast paced momentum when the good guys decide a genocide of their own is the only option.  Suddenly we are in an Austin Powers movie with heads exploding into colorful fireworks and pretty clouds and musical anthems playing in the background.  The movie did not seem to know what genre it was in or how sensitive to be to death and gore.  This non commitment to a theme left the movie feeling somewhat schizophrenic.",
      "total_reactions": 5,
      "user": "Wheelhorse01"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I just loved it. Fast-paced, funny and extremely entertaining. Can't help but reading some of the critics's negative reviews and being: \"Like, what the f`? on which planet do they live on?\"",
      "total_reactions": 5,
      "user": "annikave"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "While some of the humor isn't for everyone I thought that the blend of spy film and comedy worked very well.  One could poke holes in the plot however the acting was quite spot on, reminded me of a modern Snatch based around a spy instead of boxing promoters. For any fans of witty and sometimes vulgar humor and casual action fans this is a must see.",
      "total_reactions": 4,
      "user": "ridemooses"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Awesome all out amazing fun, fast, smart, funny, everything an action movie should be. Critics clearly forgotten how to enjoy a film and not over think it.",
      "total_reactions": 4,
      "user": "Salmonpie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The plot might not be the most original plot of the year, with the promising street kid as the underdog and the twisted tech genius as the baddy, but it's a Matthew Vaughn movie. Quantity wise Vaughn's films might not be much - even though directing five movies in 10 years is impressive in my book - but the quality of his films speak for themselves.",
      "total_reactions": 4,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "okay i freaking loved this movie so much, i don't know why theres as much bad reviews as there is because it was so awesome okay. like literally, the action sequences were so well executed without shaky-cam, and for Taron and Sophie being an actors that are just starting out, I think they did amazing.  OKAY IT WAS AN AMAZING FREAKING MOVIE 10/10, WOULD RECOMMEND.",
      "total_reactions": 4,
      "user": "honolulux"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Matthew Vaughn is one of the best film makers I've ever seen. This movie is all that kick ass was and more. The soundtrack was great, the grotesque fighting was like something straight out of a comic book, and the comedy was hilarious. Matthew does fighting in a way that doesn't make it gross or distasteful. I believe that every one should see this movie right away and decided for yourself.",
      "total_reactions": 4,
      "user": "mordicai"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Vulgar, offensive, and the opposite of politically correct.",
      "total_reactions": 7,
      "user": "AmongstYou"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Dumb movie, I guess if you like something with no plot, stupid pathetic writing that a 10 year old could do better than watch this movie.",
      "total_reactions": 13,
      "user": "coustoe"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "What is wrong with these critics? The movie is fantastic. Firth kicks ass which I did not expect at all and the main villain played by Samuel L Jackson is genius. A comical, kick ass film that I would happily watch again and again and again.",
      "total_reactions": 13,
      "user": "hiphop97"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was not what I expected it to be. It was a total game changer!!! The funniest, ass-kicking, spy film ever made!!! You will NOT be disappointed!!!",
      "total_reactions": 9,
      "user": "JazzMan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I Can't not believe how You Can't not like this movie the movie is incredible. It's fun, it's violent, it's well written. What possibly do you need more? The movie is incredible from beginning to the end!!!!!!!!",
      "total_reactions": 6,
      "user": "Pedro10alves"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Reminded me a lot of Kill Bill.  If you're not into excessive extreme violence, don't watch this movie.  If you are, you'll love it.  The movie had a lot of good qualities, but it just sort of went to **** at the end, imo.  I'm not really into watching hundreds of people being massacred for fun, but that's just me.  I liked the plot and the characters, but I think the violence was too ridiculous and distasteful.  Also, the movie is super negative towards Americans...and Obama gets his head blown off, and that's supposed to be funny?",
      "total_reactions": 3,
      "user": "kristen58"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "\"Kingsman: The Secret Service\" sometimes wanders around too much with a excessive, light-hearted buoyancy that undermines the seriousness of the spy genre, but the choreography and action scenes does give the audience a decent worthwhile watch.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "Kingsman: The Secret Service is a loud, obnoxious, stupid, and over the top action film that fails to not just properly spoof the spy genre it tries to mock, but also fails to be a spy film at all. Firstly, the action sequences are well done, but are completely pointless and over the top (thanks to stupid CGI blood effects). In line with this, the plot as a whole was beyond dumb and unbelievable. Spy films, though often outlandish, deal with things that you could see actually happening. This one felt more like a science fiction film masquerading as a spy film, while not being completely either. In addition, the writing was incredibly weak. I have no problem with swearing, but it was used as a crutch throughout and overused. Finally, it was never funny. For a film trying to be a satire of spy films, it was never funny and the jokes fell flat every time. Oh and lest we forget the stupid ending with the reference to anal sex. The joke fell flat and I am not a huge fan of nudity, unless it makes sense. Here, it was sexed up for the hell of it, which to me, is the sign of a bad movie that needs to have sex scenes to make things interesting. The only positive I can think of, other than the well shot action scenes, was the acting. In particular, Samuel L. Jackson was great. However, on the whole, Kingsman: The Secret Service is a horrific film that baffles me how people enjoyed it. Stupid, stupid, stupid.",
      "total_reactions": 3,
      "user": "Spangle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It's not a movie to be taken seriously, but it is fun. It's also quite violent. It's a bit of a James Bond send-off, with even more over the top action, and occasionally funny gags. The sense of style imbued by Colin Firth and the movie's ubiquitous high fashion (the secret agents pose as high-end tailors) elevate it slightly from a typical popcorn movie.",
      "total_reactions": 3,
      "user": "ahnehnois"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "The negative reviews here take life and this movie too seriously.  This was a great tongue in cheek movie.  It was less graphic than kill bill and the \"gore\" was very clean gore.  Arm gets cut off no spraying blood.  It was a great have fun, sit back and enjoy the ride movie.  It isn't going to win an Oscar but quite frankly I never like those movies anyway.  So stop trying to make movies into political statements and enjoy.  I also thought the final scene was just funny.  Those people who said that they wouldn't take their kids to it should look at the rating.",
      "total_reactions": 3,
      "user": "wadecleveland"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Good Acting, great fight scenes. Me and my better half both enjoyed the story, the acting, and the flow of action. Would love to see this one go 3+ movies more in their franchise.",
      "total_reactions": 3,
      "user": "CarlosDanger69"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Director Matthew Vaughn continues his stylish and fun film making in the vein of Kick Ass.  There is not one bad performance here and to see Colin Firth out of his comfort zone was great.  This is just a real fun time at the movies.  A-",
      "total_reactions": 8,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Really dreadful. Kingsman shows some promise and Colin Firth does his best to prop up this movie. However, it all comes undone in the last 20 minutes. Some very crude humor about anal sex and the 3 minute exploding head sequence (feels much, much longer) were the low points. The trailer tries to make this film look cool and stylish, it is neither. The director can't seem to resist dumb special effects and one-note jokes. When you have Samuel L. Jackson, Michael Caine and Colin Firth, you should be able to do much better than this. Don't know if he was trying to be true to the graphic novel or just wanted to tick  some marketing check boxes. Just a huge waste of time and money. If you are looking for something to entertaining to watch, look elsewhere.",
      "total_reactions": 18,
      "user": "4DBookcase"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "If the director could have shown a little restraint and let the sublime humor carry the movie, this mess would have been a whole lot more memorable. Unfortunately, he succumbed to the lowest common denominator of viewers. For instance, he missed a great opportunity with all his big over-the-top mob fight scenes...how come we didn't go back to the pub and see the homeboys having a pint -- then pow -- the fight urge comes on out of nowhere. Instead of that stupid baby in the bathroom scene to manipulate emotions.",
      "total_reactions": 10,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Stylised to a fault, \"Kingsman\" is an incredible adventure that starts off a bit heavy-handed but soon becomes an effortlessly cool blend of pastiche, humour, action, intelligence, and heart - and one of the best comic movies of the last decade. Colin Firth and Taron Edgerton give excellent performances, especially Firth - this is a role where, cleverly, he both plays against type and entirely to his pre-existing strengths. The church scene involving his character is easily my favourite action movie sequence since the elevator scene in \"Drive\" and kept my jaw on the floor throughout.",
      "total_reactions": 10,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Kingsman is the most lavishly violent, sleek and funny spy movie that I have ever seen. Colin Firth is brilliant and newcomer Taron Edgerton was great in the supporting as well. Samuel Jackson made the perfect villain. One of my favorite directors- Matthew Vaughn, is at the top of his game.",
      "total_reactions": 5,
      "user": "joyal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Well-shot, well-edited, and well-acted, Kingsman: The Secret Service is the first great movie of 2015. It parodies classic spy movies like James Bond, yet shows its appreciation for them at the same time. Some scenes seem unnecessary (the church scene was something out of a Tarantino movie on steroids), but overall the movie works.",
      "total_reactions": 5,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "The Kingsman rates an easy 10.  It is the best movie to come out this year.  I could watch it over and over and not get bored.  The plot was great and the special effects were very different than anything I have seen.  I hope there are a sequels and some way to keep Colin Firth in the film.  He was \"too cool for school\".  Comparing this film to the Bond movies, makes Bond seem like he is still in the first grade.  This film is definitely post graduate level.",
      "total_reactions": 5,
      "user": "belindar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "It's one of the best action movie I've ever seen. It's violent, it's fast, spectacular and elaborate. If they are using cliche - they making fun of it. I don't know who was responsible for fight scenes, but he is a genius!!! Some humor not very good, but it's my problem(don't like British humor), but most part of jokes really good anyway. Colin Firth awesome in this movie, this role was perfect for him. And i want to repeat, this movie is AWESOME and should be supported by all of us. If you still think - go to the nearest theater and watch it for sure.",
      "total_reactions": 5,
      "user": "Zimber"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This is a GREAT movie, if you liked ZombieLand you will like this. It is a Spy/Action/Comedy. SPOILERS!!! The Head explosion part at the end is AWESOME and hilarious. The only thing i think they could have done differently is the whole church scene maybe should have made it explain more why that happened and how.",
      "total_reactions": 5,
      "user": "TheBushWookie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "The premise of this movie was great and I enjoyed it for the 1st hour.  After that, it was all downhill.  The movie is too long (2hr 9 min) and the fight scenes are interminable.  When my husband stuck his hand out and mimed fast-forward, I knew it wasn't my girlie sensitivities.  (He LOVES action/fight scenes.)  It could have been fun, campy, action romp, but they wasted a perfectly good idea.  I wouldn't recommend it to anyone, really.",
      "total_reactions": 5,
      "user": "doright"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This is a very fun and stylish ode to the old James Bond spy movies that isn't afraid to modernize those cheesy movies and bring them into the 21st century. Matthew Vaughn did a great job in keeping with the theme: Chessy villain with an over-the-top doomsday plot, a secret spy organization with ultra cool gadgets, and a wonderful cast of characters that brings it all together. While some of the stuff feels shoehorned in at times, they did a great job at presenting everything very well. Colin Firth does a great job in this movie, something I'm not accustomed to seeing him in, and his fight scene in the church later on in the movie is wonderfully done and the best part of the movie in my opinion.",
      "total_reactions": 7,
      "user": "Kenmei"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "A great plot and likable characters are muddied by an unnecessary amount of F-bombs and over the top violence.",
      "total_reactions": 7,
      "user": "TGDROX"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "I really enjoyed this movie. I readily believed a sequel was in order until the ending dashed any goodwill I had for this film.",
      "total_reactions": 18,
      "user": "migdol"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Matthew Vaughn never fails to disappoint. His take on how spy movies should go is probably the most fun I've had at a movie theatre in years! Great action, smart dialogue, and just over all mayhem. Go watch this movie... you won't regret it!",
      "total_reactions": 9,
      "user": "FragFilms"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Mediocre. Over hyped. Not really all that fun at all. Felt like a waist of time. A few good actions scenes but I honestly don't know why everyone is giving this film so much praise. Very slow start IMO. S. Jackson and Ninja chick with silver legs is the only good part of the movie. Main character is horrible and felt under cast. Would not suggest this. Maybe redbox it....",
      "total_reactions": 9,
      "user": "Dalifeblives"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Wonderful  sets, a picante script  , great CGI and a Fun Fun did i say FUN ride ,, give us more of Colin in this vane ...I love pastiche. As others have noted you will love this movie .",
      "total_reactions": 6,
      "user": "drew2u3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Upon first glance, Kingsman: The Secret Service looks like an outdated, outlandish attempt to reinvigorate the action spy genre that saw Pierce Brosnan fail miserable as his final appearance as the famous spy-agent James Bond in The World is Not Enough. Since 2005, thanks to the likes of Martin Campbell and Christopher Nolan, two directors that took two very different iconic action figures, Batman and James Bond, and injected a much needed, gritty, dark, reality-based foundation to these characters and their overall narratives, over-the-top action has long been expired. In the last decade, what has arisen, is a very dark and realistically twisted take on many action icons, both in the superhero genre and the action hero genre, that allows the cartoonish elements of these characters to fade, and the realistic to rise in popular and rewarding box office results.",
      "total_reactions": 4,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Kingsman was a damn fun romp of a movie with what one might call less then politically correct humor, it is popcorn movie for sure but it is a popcorn movie that you will want to watch over and over again. It has the R rating for a reason and it uses that rating to its full extent with enthralling action scenes that give me flashbacks to Matrix reloaded (in a good way). The acting was pretty good, Colin was awesome as the very slick super agent Harry Heart that acts as a sudo father figure for our main character Garry\"Eggsy\"Unwin who was portrayed by Taron Egerton, Tarons acting was pretty good and only gets better as the character evolves into the James Bond style character that all the commercials tries to sell you. The movie will keep you engaged as the fairly vanilla but still silly plot unfolds. I mentioned that the movie has quite a bit of less then politically correct humor, if you are really sensitive to that kind of humor then i suggest that you spare your money and don't go and watch this because you probably don`t like fun and you will probably not like this.",
      "total_reactions": 4,
      "user": "anti-fanboy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Super fun pastiche of a spy movie.",
      "total_reactions": 4,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Fantastical ultraviolent fun. Colin Firth is tremendous especially in the physical scenes. These are top class. The trailer doesn't do it justice.The weak points are Eggsy's accent which is difficult to understand and grates. He's the least likeable. Female characters aren't well developed and the underling social class message is trite. The cursing is dolloped on way too much.",
      "total_reactions": 4,
      "user": "JamesIrish68"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "this film is brilliant.  I would highly recommend it to people.  It’s an excellent popcorn blockbuster film that you don’t have to wait till the summer for, however it does have some interesting things to say on class structure without taking away from the escapeism.  While this film is humouring and in some cases parodying spy films I think it’s going to give the up-coming James Bond and Mission Impossible films a run for their money.",
      "total_reactions": 4,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "This snappy, somewhat satirical spin on the spy genre features Colin Firth as an elegant, but skilled agent of a secret international organization. He gets to be sophisticated, while kicking ass. He recruits a rough, but promising new kid (Taron Egerton) into the agency, just as the inevitable evil genius (Samuel L. Jackson with a lisp) threatens to save and ruin the world. In addition several flashy fights and some cool concepts, there's a spirited script that ramps up the fun. Through it all, director Matthew Vaughn keeps the attitude upbeat and the pacing brisk.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This was Kill Bill meets James Bond on steroids! I was shocked and impressed by Colin Firth action sequences because he's mainly in Oscar worthy type productions. It want be a hyped film except with cult audiences, due to the UK producing eccentric over the top action comedy, but still with class and Hollywood flavor. They always have Bond!",
      "total_reactions": 2,
      "user": "chughead"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Simply put: movie critics can suck my dong; this film is amazing. Best action film I've seen in fifteen years, easily. And probably one of the best spy films ever!",
      "total_reactions": 2,
      "user": "deekan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "It knows the audience - even makes jokes about typical Bond villain vs. Bond!",
      "total_reactions": 2,
      "user": "Bshop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Bumping this score up because once again Matthew Vaughn makes another great movie and the so called \"critics\" pretend they didn't like it to try and be hip. This is must see movie so go and do it",
      "total_reactions": 2,
      "user": "jirren"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Like Vaughn's last Mark-Millar-based film \"Kick-Ass,\" \"Kingsman: The Secret Service\" acts as a potently raucous and gleefully subversive commentary on the subgenre it inhabits, without coming off as a straight parody. Also - it's freaking hilarious and a helluva lot of fun.",
      "total_reactions": 2,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Pretty good cast. Lots of forced humor, though there are some truly funny bits here and there. Action is meh... I was not a fan of the fast-forwarding action parts, but the slow-mo action was nice and some of the fight choreography was sweet. For the most part the fights were a let down though. There's significant gore/dismemberment. Theres a sprinkling of parkour in here as well. Had difficulty a handful of times understanding what the bloody hell the actors were saying, but it was for the most part understandable. Some of the dry British humor and jokes went over my head (and most of the audiences, judging from the amount of laughter at some parts and complete lack of them in others where it was apparently supposed to be a funny scene).",
      "total_reactions": 2,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Kingsman is the perfect blend of action and comedy.  The film has a very engaging plot with plenty of action scenes to keep any viewer entertained.  There are also a lot of great laugh out loud moments and one-liners in this movie.  I did not go into the movie with high expectations, but I left very satisfied.  Kingsman is an absolute must watch!",
      "total_reactions": 2,
      "user": "CapnAwesome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is simply amazing, truly original, and  I can't think of anything else to say, I guess this isn't the typical commentary you usually see ;)",
      "total_reactions": 2,
      "user": "Goncalves"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "This film's occasionally cheap looking CGI, juvenile humour and preposterous situations are all easily forgiven by quick witted dialogue and pitch perfect performances.  Kingsmen revels in its self aware humour, paying homage to the spy movies of old without descending into pastiche.  Like a James Bond film written by a 10 year old boy, it is far more engaging and entertaining than it has any right to be!",
      "total_reactions": 2,
      "user": "MKUltraman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Less serious than James Bond, (mostly) more serious than Austin Powers. Fantastic as both of them, a refreshing and surprisingly good movie with likable characters.",
      "total_reactions": 2,
      "user": "veseo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "This movie was a  decent movie that made fun of the old spy movies cliques but in a teen age twist . The villain was unique and interesting and the gadgets were good",
      "total_reactions": 2,
      "user": "Lagamedog"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I had an absolute blast watching this film! It was funny, unique, and had a great cast. Colin Firth does a great job, as does Mark Strong and Michael Caine. Samuel L. Jackson made for a rather funny villain as well. Overall, the cast is great, the action is over-the-top and entertaining, and it's simply the most fun I've had with a film so far in 2015.",
      "total_reactions": 2,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Matthew Vaughn slams into the world of spy and espionage with Kingsman: The Secret Service, a marvelous 2 hour montage of high octane action, witty dialogue and gentlemen being gentlemen.",
      "total_reactions": 2,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Kingsman turned out to be one of the best well directed movie I've seen so far of this genre. Polishing the old way of British spy movies with li'l bit of comedy and mostly the surprising action with a fresh view. I went to the theater right away at the first show and I have to admit it worth it. Probably might become one of the classic iconic movie of all time of this genre.",
      "total_reactions": 2,
      "user": "thmiraj"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "The movie was good. I dint expect it to be a good one but i think it was fun to whats and would recommend it to ppl that want a easy to watch and somewhat action packed movie to watch.",
      "total_reactions": 2,
      "user": "Mertiin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is just fun from start to finish.",
      "total_reactions": 2,
      "user": "kevmclay82"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "I was shocked with how violent and vulgar Kingsman was after seeing the promo. The film has some great action scenes and you really felt for the characters. You could see that none of them were invincible throughout the movie. I really liked Colin Firth, I think he definitely the best character in the movie. Taron Egerton had a great breakout performance and I think we'll be seeing him in some blockbusters in the future. The one thing was I was a little disappointed by was Samuel L Jackson's performance as the villain. It was just kind of the same performance he always does only he was trying imitate Mike Tyson. Other than that I thought the movie was enjoyable and I hope we see another one.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This movie takes your typical action movie troupes and twists them in fun and exciting ways. Mathew Vaughn was a great choice for the director, because he's known for over the top, but very fun and stylish action and this movie is no exception. Colin Firth is fantastic in the role and he did a lot of his own stunts, which is something I never thought I'd see from him. The cast also includes newcomer Taron Edgerton, who gives a fantastic performance and I can't wait to see where his career goes from here. And of course, Samuel L. Jackson kills it in the role of Richmond Valentine, a villain who just screams campy, over the top James Bond villain. Overall, the movie is fantastic, and it manages to do a lot of things most action movies just can't get right, giving characters a purpose.",
      "total_reactions": 2,
      "user": "wnick2000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Director Matthew Vaughn rejuvenates the spy genre with the gleefully over the top Kingsman: The Secret Service, a comical adaptation of Mark Millar's graphic novel that never let's go of humour and still delivers fast paced thrills.",
      "total_reactions": 2,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I had an absolute blast.  Kingsman is witty, fun, explosive, loud, and unapologetic.  It definitely takes things too far in the best of ways.  It feels cheap, but it plays to that weakness and makes it an advantage.  I'm looking forward to the sequel.",
      "total_reactions": 2,
      "user": "jleven22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This comic adaptation is full of hyper-stylized action sequences, graphic violence and smart humors that thrill the audience to feel unstoppable for 130 minutes of mission insanity. Though with the predictable core story, it does surprise with some plot twists for the second half and director Matthew Vaughn manages to overcome the short with well constructed plot without any drags, exciting old school action cinematography, stylish commercials fun of Guinness and McDonald as well as great electronic mix of scores by Henry Jackman and Matthew Margeson. The performance of the cast is perhaps one of the major factor that the film is extremely entertaining, it gathers four Kingsmen - Colin Firth, Mark Strong, Michael Caine and Samuel L. Jackson, in which each of them represent the characters that they are not used to be in other recent films, while it is also undeniable that young potential actor Taron Egerton sparks in his character as Eggsy too. With a super villain, this young James Bond spy genre looks high standard, smart, exciting and definitely the only great film to opt for this Valentine Day.",
      "total_reactions": 2,
      "user": "michael1208"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This is essentially a fun, modernized, homage to the 60s bond films. However, do not confuse this with the old bond films it's far crazier than any bond film i've ever seen. All in all Samuel L. Jackson and Colin Firth are great. So if you've ever wondered what that would be like this is your film.",
      "total_reactions": 2,
      "user": "tjman09"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "This is not bad,it's good! The really enjoy the film with it's cool action and a funny spy movie.The film has some issues and plot holes but still love the film.It is enjoyable action spy movie with Violence on top of it.",
      "total_reactions": 2,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Kingsmen: The Secret Service is an action packed thrill ride full of exciting fight scenes, some great characters, and a very smart script. It's funny, brutal, and just a great watch.",
      "total_reactions": 2,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The movie is great! Although violent at some parts, it still was awesome! Colin Firth and Taron Egerton we're terrific. The movie appeals to me a lot, I definitely recommend it!",
      "total_reactions": 2,
      "user": "RelationReviewz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Highly entertaining and loads of fun, 'Kingsman' is truly a refreshing parody of spy films and certainly a refreshing movie within the genre itself. In the years of bad to mediocre (at best) parodies, 'Kingsman' offers all of the classical elements of the genre but also add something new to the classical elements. Filled with effects, a surprisingly high quality of acting (Firth, Jackson and Strong are absolutely brilliant) and a vast amount of comedy, 'Kingsman' is a new James Bond version that surpasses all of the parodies that have used spy movies as a basis.",
      "total_reactions": 2,
      "user": "Arthur_S_Poe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Once again critics are out of touch with the public they serve. This is a fantastic entertainment movie. Well crafted, great characters and a fun storyline. Yes it's not going to win Globes and Oscars but for pure fun, which is why we all go to the movies, this is spot on. Well worth the tickets price.",
      "total_reactions": 2,
      "user": "LexTalionis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "This was certainly fun time at the movies. While not a masterpiece by any means, the film delivered the thrills, the humor, and the witty dialogue I was expecting. It's a very silly film, and it acknowledges that, and it completely pays off in the end.",
      "total_reactions": 2,
      "user": "Eaterman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It's level of violence is ridiculous, but that's part of the charm of this fun, quirky spy movie. It's got some witty dialogue, some cool fight scenes, and some good acting performances, particularly by Colin Firth. It's a fun one for sure.",
      "total_reactions": 2,
      "user": "WittyUsername4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "When I saw the trailers for this movie, I didn't think much of it. Then I went to see it on a whim with some friends. I enjoyed it all the way through. I acknowledge that it has a few problems. But without nitpicking, and without worrying about the ending (No, I am not going to say what it is!) it's a pretty good movie. I wouldn't call it the best super spy movie of all time. But it's worth a watch.",
      "total_reactions": 2,
      "user": "AgrosBloodmane"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Lets get straight to the point; it is worth watching in the theaters. This was a fun twist with unexpected humor. Though, I personally would loved to have seen more of the training program because the film does make you wonder how did they learn to fight so well. The music score wont be a best selling cd and I doubt that this film will be winning any Oscars but lets face it, Oscars would not be the reason why we would choose to watch this movie. This is a lets have a good time at the movies movie. As long as you can get past Samuel Jackson speech impediment. So go and enjoy.",
      "total_reactions": 2,
      "user": "Fanreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is a fun movie that is unexpected, It is making fun of the 60s spy movies. The characters were also lovable and fleshed out. There were some iffy moments here and there, but the movie was amazing!",
      "total_reactions": 2,
      "user": "UniLlamPaca"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "So Fifty shades of F***ing Sh*t top this movie at the box office where 50 shades got everything wrong and there's nothing good about it, but Kingsman got a lot of good things to talk about so at the end of the day Kingsman win.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "I can use 1 word to describe this movie and that word is fun, which is the best praise you can give a movie. Sure it's violent and sure it's not the best spy movie out there, but you can tell it wasn't trying to be. All it was trying to do was please the audience. if you plan on watching a movie with sophistication then you might want to stay away from this film because from start to end this movie is a blood bath. In conclusion if your looking for something that isn't sophisticated but is just fun then this is the movie for you.",
      "total_reactions": 2,
      "user": "darkbloodshed13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Loved Colin Firth in this as well as Michael Caine too but I am so over Samuel L Jackson being all over the place in recent movies. He bogarts too much screen time when there are other younger and better actors who could have delivered the bad guy better in this film.",
      "total_reactions": 2,
      "user": "PatKat9000"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I went to this movie with low expectations but it didn't even live up to them.  I didn't mind that it was very violent but I did mind that the opening sequences were so ridiculous and predictable.  I can't speak for the latter sequences, because I walked out after twenty minutes to try to find something more entertaining.",
      "total_reactions": 13,
      "user": "markscarls"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "This movie starts out OK , however turns into a murder spree where you just wanna leave the theatre. The good guys turn into the bad guys and its all downhill from there , virtually no entertainment value whatsoever. Worst movie Ive seen in a long long time.",
      "total_reactions": 13,
      "user": "themaxx77"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This film is the most ridiculous rip-off of James Bond, Superman, Matrix, X-Men, even Star Trek,  I've ever seen.  Anyone who thought this was entertaining has no clue about quality writing, screenplay.   James Bond rip offs were most atrocious and poorly done (got to dress properly, 'act' like James Bond, order your drink like bond (shaken, not stirred).   As in Bond films, we are drawn through the showcasing of all the neat gadgets the hero will eventually use to do in the bad guys.  The hero's persona was borrowed from the teen angst of the impulsive, smart, rawly talented likes of James T Kirk as late adolescent, the Superman-as-folksy-farm kid.  Oh., but we need to have him prove out----we'll have him compete with other teen-young adult peers and 'win' the competition (see X-Men); and we need to throw in a strong heroine  who has to depend on the hero for self-confidence and courage (make her good looking but never have her evidence any special talent or skill; but the main characters can't all be guys, right?).   One of the worst rip-off films in the last 10 year; entertaining perhaps, if you have little movie-going history under your belt.   Even the humor was ripped off ('.....you'll have to excuse me while I go save the world').   Emotional emphasis by all of the charactersswas totally reliant on using the f-word in every major scene (truly, this got to be dreadfully dull after the first hour.)    We have to throw in the political issue of global warming as the impetus for the bad guy (who as we know, has limit-less wealth to do any evil he wants).   I'd give the movie '1/2 of a 'star' ; and I wish to heck I could get my movie ticket money back on this one.",
      "total_reactions": 13,
      "user": "rocketjsquirrel"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "The sexual ending was completely out of phase with the whole tone and spirit of the movie up to that point ....I'm not a prude but it was just gratuitously tawdry, brought a so-so action flick down to completely 'un-recommendable' ... I was uncomfortable for half the people and families in the audience.",
      "total_reactions": 11,
      "user": "holidanclub"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "It shows how a spy movie should be done. The actors stepped a little bit out of each of their stereotype characters. Marvel-style comic movie plus great foreshadowing in every detail plus James Bond = Kingsman. The critics are just being harsh because it is an action movie.",
      "total_reactions": 9,
      "user": "Mrandom"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is an \"over the top\" action spy movie. Even though it can get ridiculous at times with the spy tech (which isn't a bad thing), the movie is still able to play with more emotions other than just humor. The plot is well done with actors whom are able to carry it along with precision in the characters they play. If you enjoy any sort of action-based movie then this is a good choice for you.",
      "total_reactions": 9,
      "user": "DragonEffect4"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I unfortunately see a very low score around here,  which is unnecessary considering the movie being flawless in every single way! This action movie is not only one of the best spy movies we have had in years.. it's smart,  witty, even more so hilarious, stylish and perfect. I have had this much fun since the last bond movie. It's such a thrilling, funny and fun ride though a story that  has been acted out very well by every single actor/actress in this movie! See this movie! RIGHT NOW!",
      "total_reactions": 9,
      "user": "vinoy"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Initially the plot was a little weak, but I am a sucker for good guys win, bad guys lose movie. Most of the characters were well defined and well played, but the scene where the senseless killing of every single person including the good guy mentor, was sickening and I had to leave before the end. I was saddened to see children as young as about 9 years old at the movie with their parents as that scene was totally inappropriate and complete overkill.  I thought the ads portrayed the movie in a more lighthearted manner than it actually was. The R rating was for more than just language.",
      "total_reactions": 16,
      "user": "helplesshap"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "The movie out Bonded every James Bond movie ever made.  The plot for the villain was realistic and I could see the ruling elite in some cases signing onto it with no reservations.  His henchwoman with the blades were brilliant.  It just was a highly rewarding movie.  See it now if you haven't",
      "total_reactions": 7,
      "user": "garhent"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was so good. Some absolutely amazingly filmed scenes and the music was spot on. If you want to have a blast at the theaters this is the movie to see right now, highly recommend it.",
      "total_reactions": 7,
      "user": "jdog90000"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Like actor Mark Strong (Merlin in the film) says about Kingsman: The Secret Service, \"This [movie] will be to Bond what Kick-Ass is to superhero movies.\"  With great camerawork, intense yet fun action, and a cast that knocks it out of the park, this movie is a must watch! Samuel L Jackson is at his best in a very long time, making him a lovable villain that you can sympathize with when it comes to his reason for doing what he's doing in this movie.",
      "total_reactions": 7,
      "user": "GTTMWithRamon"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Incredible movie! very funny and over all good plot, loved the fighting scenes and especially the last scene good acting and an even better looking main character",
      "total_reactions": 7,
      "user": "xavier578"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Terrible movie, rude. Did I mention rude?  Ridiculous overkill, ridiculous lisp, ridiculous premise.  Wish I never saw it, or took my friends to see it.  Money back purchase???",
      "total_reactions": 7,
      "user": "drasm21"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I was most surprised to have liked the lead character.  He comes off like a total a-hole in the trailer, but he's supremely likable in the movie.  Also, it's probably one of the most violent \"fun\" action movies ever made.  More deaths, probably in history. But they do it in such a way that you're laughing and having fun with it.  Yes, it can get gory, but in a way you can deal with it.",
      "total_reactions": 12,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "While the movie was entertaining,  it deserves a 0, for it's overt anti christian propaganda.  If they did to blacks  or Jews what they do to christians in this movie,  it would be protested and shunned.",
      "total_reactions": 12,
      "user": "SevenThunders"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "In a word....appalling !   I want a refund and an apology  Unusually graphic violence, Continuously offensive language and brief nudity.    Judgmental stereotyping of religious people.",
      "total_reactions": 14,
      "user": "StvRamnd"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Amazing in every aspect! Beautiful actors, that British swagger and over the top visual effects that will blow your mind LOL! Enjoyed every second of it and can't wait to see it again!",
      "total_reactions": 3,
      "user": "Gamingking007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Violence necessary and part of the joke. They toned it down by not showing too much blood (realistically it should be flowing like a river) and viscera. Cheeky humor. Nice contrast between social classes. Snappy directing.",
      "total_reactions": 3,
      "user": "quentntarantado"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Obnoxiously violent. Newcomer Taron Edgerton shows some promise, but it is otherwise a blood-bath of a film. Not my taste at all, in the end. I can see the appeal to others, but not my favourite movie experience.",
      "total_reactions": 3,
      "user": "heromoder"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Kingsman:The Secret Service,is the latest and best comic book adaptation of the writer Mark Millar by the director of Kick-ass and X-men:First Class,Matthew Vaughn,it combines the best elements of his style and humor and the tropes of famous spy-thrillers ,to make a wildly entartaining piece of modern cinema,one that acts as a parody of the modern Bond flicks,while respecting everything that made the 60s,70s Bond movies so much fun.",
      "total_reactions": 3,
      "user": "andrewmakatsari"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Good, good, good. As a straight up action film, Kingsman is awesome. Add some humor, an interesting plot, and good acting, and these round off an excellent film. Sam Jackson's lisp is hilarious (especially between swearing), the church scene is spectacular, and the break dance fighting at the end is great. Sequel... seeequueeeellll!!!!!!",
      "total_reactions": 3,
      "user": "ozymandias79"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "I loved the setup, exposition, execution  and concept of this movie in many ways which is why I'm so disappointed with how Kingsman ended up going lowbrow so often.  What could have been a great start to an exciting new super-spy series is dragged down by tacky, sophomoric humor and gleeful violence that sometimes goes so absurdly off the rails that it overwhelms the excitement and the story. There were several times that my eyes rolled so far back that they practically fell out of my head.",
      "total_reactions": 3,
      "user": "DaveTheArtguy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "It is a shame when critics alter their review scores based on political or social bias. I can not fathom why anyone would pan this movie. While it may borrow elements from other sources in genre, at least it's from the best sources. The physicality of the Bourne movies, the political intrigue of 24, and the gadgets, outlandish villains and world ending schemes of the old Bond movies. It is funny, action packed, and full of pitch perfect performances. The audience I was in, which was largely made up of 40+ women who were only here because 50 shades was sold out, applauded twice at the end. Best spy movie I have seen since first Bourne movie. GO SEE IT!!",
      "total_reactions": 3,
      "user": "Shamus1969"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This was an awesome movie to see in the theater!  I thoroughly enjoyed the whole thing. I don't get the critic's general poor reviews but I have learned to ignore them awhile ago, they are likely paid off. Always trust user reviews over the critics.",
      "total_reactions": 3,
      "user": "mcb17"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Kingsman's story was gripping, heavy occasionally and very funny! Mark Hamill, Samuel Jackson and Michael Caine are in it and the rest of the cast are good too! It pays homage to traditional spy movies while not ripping from them entirely, for me this movie stands out as its own unique type of storytelling. How there are such negative reviews, baffles me, everything was enjoyable! The action, plot twists and humor are all fantastic!",
      "total_reactions": 3,
      "user": "IllusivemaN7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Some funny lines, some amazing stunts, all sorts of annoying holes in the plot.",
      "total_reactions": 3,
      "user": "Robogeek"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This is a great underdog action movie with a interesting storyline and great laughs in between. Go see it asap! Kingsman offers viewers an action packed movie that finally is not set in just one place. Yes, the movie travels from country to country. place to place faster than you know it, but it's a movie about spies get over it.",
      "total_reactions": 3,
      "user": "chefandre"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Have to give it a 10 to counterbalance this ****",
      "total_reactions": 3,
      "user": "MediumM"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "We had good time and the actors made this Movie jump off the screen. Special effects were sharp and effective.  The Kingsman made for great night out, Worth price and popcorn plus the Box of Dots. Will buy the Blu-Ray",
      "total_reactions": 3,
      "user": "RockWolf"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Funny, visually appealing and entertaining, I was willing to forgive a host of obvious directorial concessions to the intended 14-year-old chav boy audience until the gratuitous anal sex scene at the end ruined it – vulgar, unnecessary, and totally contradictory to the central message of what being a “Gentleman / Real Man” is all about.",
      "total_reactions": 3,
      "user": "Sunluvva"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Most likely one of the best movies of the year. It was excellent. The more you watch it the more you observe things that you were initially not aware of. I recommend it wholeheartedly, can't wait for the next one. It is anything but boring or predictable.",
      "total_reactions": 3,
      "user": "andra"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "I can not begin to describe how horrible this movie is. The premise is childish. The characters are stereotypical and annoying and the gratuitous violence is beyond disgusting. If you enjoy blood and guts every five minutes by all means knock yourself out. The previews of the movie bear no resemblance at all to what the movie is about other than the fact that it tries to be a cheeky homage to James Bond. Two thirds of the way through the movie I walked out. While waiting on my partner to finish watching it I looked up the ending on line. Glad i made the decision to leave. If you are a thirteen year old boy with anger issues will you love this movie. I would give more details but I might have a spoiler and I don't want anyone to miss the message of how infantile, disgusting and just plain bad this movie is.",
      "total_reactions": 10,
      "user": "MarkHipps"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Could have been really great - but pointlessly/unnecessarily graphic violence demeans it.",
      "total_reactions": 4,
      "user": "MichaelTatalias"
    },
    {
      "neg_reactions": 29,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Poor attempt at Starship Troopers-like humor, with some frightening and intentionally convoluted stereotypes on display. The four women in the film are either psychopaths or whores, the villain is a McDonald's-eating African-American coward strangely modeled on Russell Simmons, Colin Firth is a one-dimensional Brit in a suit, middle America is full of expendable bible thumpers, we are supposed to laugh when people's heads explode (don't mistake this for a children's movie: insanely gratuitous violence)...I spent the entire time trying to figure out if the joke was on me or if things really have gotten this bad. And for some reason, everyone wears Levi's?",
      "total_reactions": 38,
      "user": "cadover"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I hated this movie. It's not just a truly horrible film, it's so incredibly ultraviolent it's like the video game Grand Theft Auto with zombies, only worse. This was the most disgusting violence, gratuitous and glorified, truly over the top. The trailer for this movie is 100 % misleading. It makes it look like a James Bond movie but in reality it's more like a zombie movie. Horrible, horrible, horrible. I wish I could un-buy this movie ticket. I wish I could un-see this movie. It's truly the worst movie I've ever seen. ABSOLUTELY DISGUSTING!",
      "total_reactions": 24,
      "user": "scubeesnax"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "\"Kingsman : The Secret Service is not a perfect action movie or deliver something new , but for sure it delivers a lot of fun \"",
      "total_reactions": 5,
      "user": "FallsDownz"
    },
    {
      "neg_reactions": 29,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "This movie is whats wrong with Hollywood. They take a terribly pathetic teenager with a chip on his shoulder premise and try to spice it up with Sam Jackson and Mrs.Blade legs. If people keep buying tickets to see movies like this or the scary movies series, Abraham Lincoln vampire slayer, ect.. Hollywood is going to think its ok to keep making this trash, and are going to keep their standards low. Wonder why movies in the 90's were so much better than today (on average)? No one would have wasted their money on this so they didn't lower their standards",
      "total_reactions": 36,
      "user": "Neelyry"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Man!  I wanted this movie to be a good one.  Good plot, great actors, wa wa wa-horribly unnecessary violence and gore.  Disgusting.  Oh, and to top off the end, nasty and lude sexual script and more visual than you wanted---GROSS GROSS GROSS!  Too bad!",
      "total_reactions": 14,
      "user": "kms84"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Worst movie of all time, it was worst than a cartoon! its what you get when you combine a cartoon, GTA(violence) and COD(story)",
      "total_reactions": 14,
      "user": "kamhagh"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "Der Film ist brutal und das wird noch mit 80/90er Jahre Musik untermalt und mit buntem Feuerwerk gefeiert. Geschmackloser gehts wohl kaum noch. Oftmals vorgespult, weil es unnötig brutal ist.",
      "total_reactions": 16,
      "user": "Krugelix"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "This movie is stupid. The action is cartoony, blood, excessively violent, and over the top. Most of the characters in this film are clichés and the story is filled with tons of tropes and clichés that you’ve seen before but its so much bloody fun! Samuel L. Jackson is fun and over the top as the villain. The action is a blast to watch for all the reasons I just said and the humor is good providing some good laughs and clever satire. This is a film that I didn’t expect much out of and I’m glad I did because I was pleasantly surprised by how much fun it was. Every year that is that big dumb action movie that is a lot of fun last year it was Guardians of the Galaxy, the year before it was Pacific Rim, this year it is Kingsmen. We are in the dry season and dumping ground of film where nothing great comes out as I eagerly await the two or three good films that will come out in the summer while waiting for the last quarter when all the best films will likely come out. In such a time a fun film like Kingsmen is welcomed with upon arms. This probably won’t be on my Top 10 list this year but will definitely get an honorable mention because it was a fun movie with a lot of memorable scenes, jokes, and characters.",
      "total_reactions": 2,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "The trailers didn't inspire me much, but it had good word-of-mouth reviews so I went to see it and was pleasantly surprised. Its a cross between Kick Ass and James Bond and the styles are meshed perfectly, it doesn't take itself seriously at all, the acting is very well done, its funny and some of the scenes are over the top outrageous. The firework scene was my favourite and unlike anything I've seen in a movie before.",
      "total_reactions": 1,
      "user": "djnicey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "A perfect send up to the spy movies of the past, particularly the 007 ones. It takes inspiration from a time when spy movies were all about thrills and over-the-top villains with insane plans, rather than the more serious and believable plots and elements you'll find in spy movies today. The film is incredibly aware of this and approaches it with a sense of giddy self-awareness. It even goes as far as to have the characters have conversations about it. Yet, while the film clearly wears it inspiration on it's sleeve and has no problem pointing it out to you, it's also very much it's own thing. It takes the formula of old and reinvigorates it with it's own unique concepts: Hyper violence and a smart*ss sense of humor.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Some jerkoff \"professional\" reviewers have managed to bring down the critic score on this, but trust me, I don't even like comic book movies and I loved this. It's what the Triple A 100 billion dollar comic movies should strive to be.",
      "total_reactions": 3,
      "user": "jerkwheat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Kingsman is a sick movie that truly delivers. But it could have been even better.",
      "total_reactions": 1,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "one thing sadly missing from this film is a bit of uniqueness of Iggsy . I think it could have been more original with a troubled young lesbian. Some of the CGI needed more work on but this was more of a endeavor than other MARV films. With all the anal jokes Iggsy could've of been a deep in the closet gay young man maybe they could explore more of this subtext in next films . Overall well done",
      "total_reactions": 3,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "\"Kingsman: The Secret Service\" has exhilarating choreography and witty performances, but the movie plays it too safe, which is kind of disappointing. Still fun to watch though...",
      "total_reactions": 1,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Mildly entertaining. Was a bit long given the weakness of the premise of the movie. Lost a point for the stupidity of what the sim cards made people do.",
      "total_reactions": 1,
      "user": "mboner1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Kingsman: The Secret Service was definitely a fun movie, with elaborately cartoonish violence and fun stunts.  Samuel L. Jackson was absolutely amazing as the villain, and his rapport with Colin Firth was wonderful--their shared acknowledgement of spy movie tropes made for some great meta moments.  However, I found the plot wasn't quite compelling enough to keep me engaged for the long-ish runtime, especially since the ending is a bit drawn out.  It straddled the line of satire and sincerity in an interesting way, mocking and embracing the genre's tropes simultaneously.  It was a solid movie with a lot of amazing sequences, but for me it just didn't quite come together.  However, I should freely admit that spy movies are not my favourite genre, so there were probably references I missed out on.  Still, an enjoyable romp-y kind of movie with fun action and dialogue.",
      "total_reactions": 1,
      "user": "heatherm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "'Kingsman: The Secret Service' is the latest movie directed by Matthew Vaughn who made it big in the directing world with films such as; 'Layer Cake' (2004), 'Stardust' (2007), 'Kick-Ass' (2010) and his most popular 'X-Men: First Class' (2011). I think I heard that he was one of the many directors attached to the latest \"Star Wars\" movie at one point, but he decided to do this.",
      "total_reactions": 1,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Gratuitous pornography at the end.  Spoiled the movie for me.  I was totally enjoying it up until that point.  I wish movie makers would understand it was unnecessary and now I can't buy the movie.  Otherwise it was very fun.  If it didn't have that, I would've ignored the cussing, rated the movie highly and bought it.  It was OK for teenagers to cuss in it but adults should not.",
      "total_reactions": 1,
      "user": "DrD1983"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "You will find extreme over-the-top violence, hilarious moments, and upsetting deaths in  Kingsman: The Secret Service. This is one of the best spy movies ever made and even the villain is funny. Harry's death is sad. Overall, don't take kids under 13 to see this as the violence is pretty brutal(especially the church scene). The McDonalds scene is also pretty funny.",
      "total_reactions": 2,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is one of the best action/spy movies since Skyfall (but a lot more fun). The comedy behind the story is hilarious, and the action is over the top and wonderful. I loved the storyline, and it is a very visually appealing picture. I enjoyed this from start to finish, and it was still able throw some twists in to change it up. I would love to see a sequel sometime soon.",
      "total_reactions": 1,
      "user": "zachzwp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Matthew Vaughan's individual style of film-making is demonstrated with spectacular fashion in Kingsman: The Secret Service. The film perfectly combines an original mix of comedy, action, drama and the outright bizarre. The audience is drawn out of their seats in the prospect of marvellously ridiculous action sequences, whilst additionally brought back down to earth through realistically powerful themes. Whilst the films protagonists are developed with great quality, the film's antagonist, Samuel L. Jackson, steals the show with a brilliant portrayal of a power driven maniac. The combination of exciting action sequences, a thrilling narrative and brilliant character development, help to create one of the most fun films of 2015 so far.",
      "total_reactions": 1,
      "user": "PeterAlexander"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "I had just watched this movie a few months ago and it's actually very well executed and the cast was amazing, it had done a lot better with the humor and the action. I do indeed recommend this movie, its funny and they all did pretty well.",
      "total_reactions": 1,
      "user": "TheM3meMaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Kingsman: The Secret Service was a ton of fun. It was super violent, super stupid and super funny. Colin Firth was an absolute riot in this film! I hope this is the beginning of a new franchise because I'd certainly like to see more of the Kingsmen!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Quite enjoyed this. Very well paced film with lots of action, twists and turns in the plot and good characters. Good performance by Colin Firth though I thought Samuel Jackson was just being himself. I felt the film couldn't really decide what it wanted to be. Not a straight up spy film but not a spoof like Austin Powers. Fell inbetween. Good entertainment nonetheless.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "This movie could have appealed to a huge audience if it was PG-13 like the Marvel movies. Instead of respecting the classy Kingsman, it plays to the main character's teenage hooligan attitude and adds some vile stuff like derriere-themed ending (the movie should have been called 'The Assmen - Revenge of the Horny Hooligan'... oi!).  Michael Caine did what?(Right....) A Hip Hop Henchman, wow (Kingsman 2 vs The Evil Capitalist Theme Park CEO). Hillbillies, Margaret Thatcher zinger, just not necessary, not cheeky or funny, just slightly vile. Not a date movie, not a kid movie, not for adults, perfect for 17-23 males, hence the 10 stars from teenage males.",
      "total_reactions": 0,
      "user": "MetaVince"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "A weekend cinema-outing of this slick UK spy actioner which is a surprisingly excellent revamped Bond-esque espionage genre fare inundated with polished set pieces and beguiling plot twist albeit the whole movie is ground in the same old saving-the-world-from-a-supervillain mode.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "In a good year, maybe two films rate a 9 or 10 from me and this is one of them. This film was put together so well, cinematography, pacing, music, and of course, action. The lisp-y arch villain was played well by Samuel L. Jackson but I think he was still mis-cast. Someone like Terrence Stamp (\"General Zod\" in \"Superman II\") would've been more \"deliciously evil\". This and a few other quibbles like the small statured new Kingsmen keep it from a \"10\" rating. But the film was intense throughout, all the way through the faux-end with an awesome callback to the earlier bar scene brawl. Excellent, excellent experience.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "It's been awhile since I've done a review so I might as well go for the low hanging fruit for now. Kingsmen is a fantastic movie with great directing, a well rounded cast and awesome action scenes. The plot is your standard spy movie fair, with one or two twists thrown in for good measure. Matthew Vaughn's streak of really fun movies continues.",
      "total_reactions": 0,
      "user": "starscream97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "A complete blast from start to finish. Kingsman: The Secret Service is one of the most flat out entertaining action-comedies in recent years thanks to the cool characters, over-the-top yet awesome action sequences and the irresistible fun that's just non-stop. And the soundtrack just adds to the fun and bad-assery, look out for a particular church scene.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Matthew Vaughn's 'Kingsman: The Secret Service' is no doubt a 'well made' movie, not a great movie but a solid one. The over-the-top, R rated James bond style it's going for works brilliantly at times, but at other times, comes off cringeworthy and unnecessary.",
      "total_reactions": 0,
      "user": "HazzaGalla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "A modern take on old school spy movies that isn't afraid to make fun of itself. Kind of like Austin Powers meets Kill Bill.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Very entertaining movie with many twists and turns and a lot of funny stuff going on. One of the best things of the movie is the main young character, portrayed by a young actor that shows a pretty good range in just one film (the first I´ve seen from him). Apart from that, the film is nothing new in the sense of using so much comedy in an action film and not taking itself seriously. Slightly over rated by certain fan boy groups. It is the right film to have fun and they achieved what they were going for. But it does not deserve a higher rating than a 6 or a 7 (no masterpiece stuff if you know what I mean).",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Ok, this movie is something really special. I mean really special, the comedy is sleek and subtle, the action is incredibly shot and the characters are colourful and vivid which is perfect for what is essentially a teen version of bond spinoff. I cannot comprehend how much I love this movie. This is a really good movie to kind of just let it do its thing, you don't need to be as deep into the plot as a bond movie. I mean, there is a plot (could've been a bit more detailed) but the sequences is what you come for in an action comedy. Unbelievably good film.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "When I sat down and the opening credits came up over some obvious CGI'd locales, I was immediately bummed. I figured I was in for a generic by the numbers action flick when I had such hopes for the movie. Then a funny thing happened, the movie just as quickly became absurd. I mean you literally go from a poor recreation of a chopper shot over a CGI winter cabin to the ludicrously violent introduction of the main villains second in command. It never really stops, there's some generic story telling to be sure the \"Down on his luck achievement in the face of adversity under dog\" story is so commonplace it's banal at this point. But this movie is funny and unafraid to be fun. It could have seriously fallen apart but never did to the point that I didn't enjoy myself...except for the butt sex thing at the end. Didn't like that. Otherwise fantastic film Vaughn has an eye for filmmaking that really is unmatched currently in film. Those of you who enjoy this or XMen First Class should really check out Layer Cake.",
      "total_reactions": 0,
      "user": "Hughish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Now this was a fun movie to watch. Its a spy movie with lots of action and humor. Has some great actors in it. Story was good. If you like spy movies that don't take themselves too seriously its worth watching.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "great movie. characters are great, action scenes are well done, and humorous at times, but can be serious. overall there are few faults in this incredible movie.",
      "total_reactions": 0,
      "user": "boshi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This is a epic spy film, the same way Scream was a slasher film.",
      "total_reactions": 0,
      "user": "Avodeskorm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "Kings man the secret service is all it sets out to be a funny bloody British slang spoken action film with a great cast and performances and a story that's fun as well effective.",
      "total_reactions": 0,
      "user": "travellyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Kingsman: The Secret Service has to be one of my favourite films of 2015. Matthew Vaughn seems quite obsessed with this idea of making a modern day 60s film and I love it. The casting and direction are excellent. If I was to critique one thing and one things only it would be his over use of green screens and effects, such as people in a factory or going down an elevator.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Kingsman the Secret service was such a fun movie. Great action, storytelling, performances from actors and humor that makes for such a great movie watching experience. There isn't a lot i could say that was about about this film, the blood and gore was a little bit excessive for my taste but that is a minor point. Kingsman is a great spy movie that I highly recommend to anyone.",
      "total_reactions": 0,
      "user": "fusion_13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "It's certainly far from Vaughn's best work, however, Kingsman overcomes disappointingly unfunny gags with its sheer watchability and impeccably executed action.",
      "total_reactions": 0,
      "user": "El_Jacko"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "brilliant film not stop action and humor from start to finish well written well acted well played if you like your spy movies with a bit of humor but not to much to take away the seriousness this is for your",
      "total_reactions": 0,
      "user": "Fidiuss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It's a nice action-spy comedy movie, my friends and I did enjoy it, and so did the majority of the theater as I was listening to their comments while leaving. I did find the story a bit stupid and sometimes way too stupid, but, hey, it's good entertainment, and i wasn't expected to be enlightened or spiritually uplifted. Fight scenes are nice, but church scene and gun fight scene at the end were way too long and noisy. Above average movie overall compared to last year and beginning of 2015.",
      "total_reactions": 0,
      "user": "zouz123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Before I saw this film, I thought it was just going to be another British action film with an occasional familiar face. But I was pleasantly surprised that it wasn't so. The film has a very unique plot with emotional and comedic vibes that mix perfectly, along with loads of violence and controversial elements that make this film great! I definitely recommend this film.",
      "total_reactions": 0,
      "user": "c11beatz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "From the action scene in the trailer, I was pumped to see this movie. I went in hoping for an action packed, kick ass movie with great comedic moments. I was not remotely disappointed.",
      "total_reactions": 0,
      "user": "DirtyDave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I’ll be honest. I was expecting of a really  grounded spy movie which unfortunately, it isn’t. It was probably because I was expecting a compelling plot with a great back story or something. However, just because it’s not a grounded spy movie doesn’t mean I didn’t enjoy it. I loved it actually!",
      "total_reactions": 0,
      "user": "OpinionatedGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Fifty Shades can literally go and and shoot itself. \"Kingsman: The Secret Service\" is exciting, funny, and is the most action packed movie i've seen so far this year. Colin Firth is fantastic as \"Galahad\", a super suave spy who tries to help his fallen comrades son \"Eggsy\" played by  Taron Egerton from a life heading behind bars. All the other performances from the likes of Samuel Jackson, Michael Caine,  and Mark Strong are also great additions. Mathew Vaughn knows how to do comic book movies. ever since Kick-Ass came out I knew that he would be one of the better directors in Hollywood. I really don't want to spoil the movie in this review because it really is one to see in theaters... and the only movie worth seeing in theaters for the month or two to be honest.",
      "total_reactions": 0,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Tonally and thematically this film is more than a bit of a mess, but that doesn't keep it from being steadily entertaining. With its more hit than miss humor, hyper-stylized and choreographed violence and a solid performance by Colin Firth, it's got enough going for it to distract the viewer from its shortcomings.",
      "total_reactions": 0,
      "user": "adpirtle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Kingsman is a great tribute to the classic 007 and Spy movies of the 70s and 80s. It's full of the things you want and expect from a spy movie, Crazy Vilian played By Samuel Jackson with a bodyguard with swords for feet, Super Cool Gadgets, Great Action, Comedy....The list goes on. It's great to see a movie released in 2014 still have the charm of a classic film, Part of witch could be from the movie being based off a comic book as well. The action in this film is mapped out perfectly, With a great mix of plot and action that never feels out of balance. This film will also make you laugh with the main character always quick with a one liner to throw in. Kingsman surprised me I must admit tho, From previews etc I didn't have high hopes for the film but 30 minutes in my mind was changed..I loved this movie. If your a Fan of Old Spy movies or not you should still take some time to watch \"Kingsman: The Secret Service\" you will not regret it, Unless you don't like extreme violence then maybe skip this one",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Right up the middle between 007 and comic book superhero; first rate cast, fast, witty, funny, with some clever twists on the same old genre tropes.  The precise stylized action is winkingly over-the-top in a fun way but drags when the conventions of formula can't be totally kept down.",
      "total_reactions": 0,
      "user": "AxeT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2016
      },
      "score": 4,
      "text": "If it was not tongue in cheek funny and captivating with some fight scenes and locations, I'd give it less than 4/10, because there is no story and believability - there is just good dose of entertainment and senseless stimulation of your brain's pleasure center.",
      "total_reactions": 0,
      "user": "tadasbub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Recently bought the blu ray and rematched this and it's still my favorite movie of the year. If you love spy movies, action movies or movies in general you will love this movie. It has everything an action movie should have, a great soundtrack, no shakey cam, likable characters, and a great villain. Samuel L Jackson (95%of the movies that have come out in 30 years) does a great job as the villain, the lisp he has just makes his character better. The plot isn't the plot of the century or anything but it does make up with a spectacular church scene (if your easily offended then don't  watch this) If you haven't seen this by now watch this.",
      "total_reactions": 0,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Kingsman es de lejos, lo mejor que podrás ver dentro del genero de acción de este año (por el momento) es una perfecta e inteligente pelicula de acción que combina el espionaje de James Bond, la acción grotesca, bizarra, sangrienta y fantasiosa de Quentin Tarantino y con toques frescos de suspenso y comedia. Matthew Vaughn ya nos tiene acostumbrados a ver sus excelentes adaptaciones de cómic a cine (Kick Ass, X-Men First Class) Kingsman es una de esas, solo que con un estilo un poco diferente, pero fiel al cómic.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Great movie, better than the new James Bond movies! This movie has all what I missed in the latest 007 movies, great actors, action, fun, special effects and a interesting story.",
      "total_reactions": 0,
      "user": "andik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Imagine James Bond mixed with Kill Bill and you have Kingsman. I kind of loved this movie! Not only are the action scenes just incredibly fun and over the top, but it works as a parody of older spy movies. Finally we have Colin Firth who steals every scene he is in. If I can describe this movie in one word: Fun.",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Kingsman is an excellent film. One of the best espionage films I have seen. It, being a little of a parody of James Bond, has a really good story, beautiful shots, really unexpected twists, and it will make you laugh from the beginning to the end, also having really nice action scenes, really well directed and with a camera work really masterful. But really, the action scenes were really awesome, perfectly choreographed, and I just love the fact that here really is presented a combination of old school British spy films to modern day action espionage. The movie is unrealistic, predictable and ridiculous in some parts, but it is that in purpose, which makes it even a better film, really fun to watch and very entertaining. The acting is great, mainly by Samuel L. Jackson playing and excellent, original, eccentric, really cool and funny villain. The story is a little unoriginal, but it’s nothing to be concerned about.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "The Kingsman, a movie I really didn't expect to be THIS good, stars one of my all time favorite actors as the main Villain, Samuel L Jackson. I went in expecting a pretty good movie. What I got was one of the best movies I've seen in the last two years. The movie has extremely over the top gore, and an almost parody like feeling to James Bond movies. The humor is extremely solid, with almost every single joke getting a good laugh out of me. And unlike mindless action movies such as Furious 7, this movie had a pretty engaging plot. Everyone in the movie gave in excellent performance, and the musical score fit each scene just perfectly. Go see this movie if you haven't had the chance, and even if you still aren't sure, it's a for sure purchase on blueray.",
      "total_reactions": 0,
      "user": "JayLightBar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "an eccentric action-packed movie, with a pinch comedy, and a truly epic entertainment.",
      "total_reactions": 0,
      "user": "Alexlee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "The acting talent in this movie is out of this world. Sam Jackson, Colin Firth, Mark Strong and of course Michael Caine all knock it out of the park. The action scenes are exciting and fun, and unlike many other action movies you can actually follow the fighting (instead of it turning into a big blur of people tumbling around/shooting) because it was filmed so cleverly. It's very funny, with excellent visuals and great action. This is absolutely worth seeing in theaters.",
      "total_reactions": 0,
      "user": "Facts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This was a very fun movie. Action was fast; character motivation was grounded.",
      "total_reactions": 0,
      "user": "CarterDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Best action scene! Great film, very funny. Samuel was annoying a little at first but grew to find him very funny. Colin was also awesome.",
      "total_reactions": 0,
      "user": "Littlewolfie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This film knows how to have fun. Being one of the big movies coming out early 2015, this movie had to impress, and yes.... it did. With creative writing and an interesting plot, though a little predictable at times, will make you wear a smile on your face. The only issue is that is can be very violent at times, a little too much for my taste. But if you liked Kick-Ass and films like it, you will love this film.",
      "total_reactions": 0,
      "user": "PinPointReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "So, I saw this movie about a month ago and to be honest, I'm not sure what everyone sees in it! Everyone calls this movie 'fun' and 'an awesome spy movie' when all I saw was some confused writing and bland characters being thrown on film. And don't get me wrong I know it's supposed to be a parody of the old spy movies but it's seriously executed poorly. I mean, even from the first moment of the film you're confused when the bouncy bubbly letters of the title come in and you think to yourself \"What spy movie introduces itself with bouncy letters??\" This is just a taste of some of the confused writing that the film contains. Honestly there's not much more I can say about this movie without repeating myself but seriously I don't recommend this movie to anyone but I guess I'm wrong because whenever I bring this movie up to my friends they loved it so I guess I'm a minority here. To drive the point home, Samuel Jackson is the villain in this movie. Cool right? No, because they turn him into a backwards-hat-wearing teenage douchebag who spouts catchphrases and language that makes no sense in the movie. The only thing that saves this movie from a 1 or a 2 out of 10 is the action scenes that are fairly well choreographed and use slow-motion to actually show the action and it's pretty well done. Other than that though I didn't find anything worth seeing.",
      "total_reactions": 0,
      "user": "VirtualHarrison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Best Spy Action Film In 2015 so far. Credit to Samuel Jackson for becoming a very fasinating villain. Hope they can do a sequal for this flims. Fun to watch. Worth every penny.",
      "total_reactions": 0,
      "user": "wmkhairil1978"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "I love this film because it gets away from the gritty, overly serious films spy flicks have become and instead injects some fun back into the genre. Taron Egerton is a brilliant lead character surrounded by great supporting cast, such as Colin Firth, Mark Strong, Samuel L Jackson and Michael Caine. Amazing film.",
      "total_reactions": 0,
      "user": "chillerboot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "It's difficult for me to just dole out a 10 rating on any movie unless I'm awe-stricken.  This movie deserves a very reasonable 9 because it delivers what movies should and that is entertainment. Screenplay was well written and the acting was very good.  Well worth the time & money to go see",
      "total_reactions": 0,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "There is much to like about this movie.  In particular, Colin Firth.  This film goes to show what a versatile actor he truly is.  Love the gentleman kick-ass style.  And while the movie does have more than it's fair share of violence; the gore is not over-the-top.  It is best to keep in mind that this movie deals in extremes.  If you are easy offended, this one may not be for you.  However, if you can roll with the punches and see this for the dark comedy that it is, kick your heals up and enjoy.  It's a hell of a ride.",
      "total_reactions": 0,
      "user": "Peacox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "It is agent movie but not like the James Bond movie. It talks about the secret service in a slightly realistic manner. Agents will actually die and require replacement. And the new agent is needed to be trained. The villain is actually smart and logical but not ethical. The philosophy  behind the villain is not completely wrong which is a balance between heroes and villains which is good.",
      "total_reactions": 0,
      "user": "yezo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Kingsman does good everything it wants to do, it is funny when intended to be, and the action is really good,  the movie has great actors. I loved it.",
      "total_reactions": 0,
      "user": "carlosceeo1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "'Kingsman; The Secret Service' is a high octane,  blockbuster, wrapped in a thick layer of enthusiasm and solid production value.",
      "total_reactions": 0,
      "user": "Jack-Lloyd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This is one sweet ass action packed spy great movie of 2015.Taking inspiration right out of James Bond this movie succeeds in many levels.Acting is significant and the action scenes are dazzling.Everyone does such and amazing job at this movie and especially one scene in particular(those who have seen it will know what I'm talking about) it's so insane and bad-ass that makes your eyes want to pop out.Really good movie I recommend it to everyone who hasn't seen it yet,and I still fail to release why doesn't everybody love this.",
      "total_reactions": 0,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Kingsman might be one of the surprise hits of 2015. I didn't see that coming. I got a lot of fun when I watched it. Glad that there are going to be a sequel.",
      "total_reactions": 0,
      "user": "ZawMine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "This movie really surprised me! The previews made it seem like a hipster, frat boy, douche turned spy. Without spoiling anything, it couldn't be farther from the truth. However because of this, I did not see this movie until I saw it on HBOG. My expectations were low, but I found myself fully engulfed in the movie pretty early on. The plot is fun but the actions/violent scenes were even more fun! Not your average spy movie which is good, the humor is well placed but at times feels a bit too silly.",
      "total_reactions": 0,
      "user": "MagicBoxofDoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Great movie, great acting, great humor, great violence! I really liked how this movie was something else, something out of the ordinary, it has it's cliches, but it's funny and entertaining! Go and watch it, you'll love it!",
      "total_reactions": 0,
      "user": "Negatiw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "The Kingsmen: Secret service is a over the top action comedy with a amazing cast. Taron Egerton plays the street thug turned sophisticated gentlemen. To sum it up kick-ass meets Bond.",
      "total_reactions": 0,
      "user": "DANIELW45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This was such a fun movie to watch. I caught it in theatres and bought it on dvd  when it came out today.  It is a wonderful addition to my collection of Bond, Bourne, Mission Impossible films and it fills a gap those films never show.  This film does have it's campy and over the top moments, but all the actors, even the younger ones, do a phenomenal job in this flick.  I've always been a fan of Firth, Strong, Jackson and these 3 are just sooo great on screen (and there's also the added bonus of seeing Mark Hammill and Michael Caine, even if briefly) that their performances and action scenes alone make it worth spending money on.  This is a film I'd love to see get a sequel and I hope people will spend money to show support for the people who made this film possible.",
      "total_reactions": 0,
      "user": "Markham2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "For all of Kingsman's entertainment values, it's an infuriating watch. Ridden with snooty stereotypes, frustrating sequences and incoherent plot points, it's an absolute necessity to turn off all brain cells if you want to watch this muddled mess.",
      "total_reactions": 0,
      "user": "EdgarReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "I enjoyed the movie and it was well done. All the actors were appealing except Samuel L. Jackson who can't act to save his life. Can someone explain to me why they keep casting this low class ghetto embarrassment in all the big movies? He's so ugly it makes my eyes bleed every time I see his mis-shapen disgusting face. And he's supposed to be an IT genius in this movie on par with Bill Gates or Steve Jobs? Give me a break.",
      "total_reactions": 0,
      "user": "RickBell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "I thought this was most enjoyable, loved the action... very Kill Bill-ish.... just a few spots were a bit slow and the end bit was a little on the lame side, I felt the sexual favors bit took away from the movie and added nothing, should have left that bit out,  but overall... I thoroughly enjoyed it and will be buying the DVD (when the price comes down... :-)",
      "total_reactions": 0,
      "user": "HomerCidal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Good movie. Good Story. Cool Kills. All I like in one movie. I should gave 10 stars but i missed the beating up of the man how lives with his man. Hope an second movie will come soon. I will be ready to watch.",
      "total_reactions": 0,
      "user": "Kingsman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Very entertaining! Very funny! (I especially loved the church scene.) It's full of parody and action. Taron Egerton and Colin Firth were both good, the supporting cast as well.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "I don't have much to say except that I do not understand how this scores \"58\", in the critic's section. I love reading film criticism but sometimes, like over here, I do believe a majority of them are way off. This movie is an insanely fun \"return-to-bond\", a brilliant satire and it acknowledges itself to be both. It sets itself apart visually and stylistically, and indulges in on-point dark humour. There are also some really great performances here. Colin Firth seems to be a better Bond than half the real ones were, and Sam Jack's part seems effortless, as it is entertaining.",
      "total_reactions": 0,
      "user": "CrazyFilmLover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Kingsman: The Secret Service is an example of a movie that has exquisitely balanced the elements of comedy and action. We can't expect this to be a completely serious, violent and mature kind of spy movie, because it isn't. But nonetheless, it is generally fun and hooking. Definitely deserves a 9.",
      "total_reactions": 0,
      "user": "muzmuz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "One of the first 10 out of 10 ratings I've given for a movie in the past 5 or so years. An instant classic with hilarious writing, fantastic action scenes and great characters make Kingsman: The Secret Service overall, an incredibly fun and mesmerizing time.",
      "total_reactions": 0,
      "user": "kidcwithaperiod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "If I start complaining, there will be a lot of characters here... so I'm just going to say that this movie tries a lot to be like James Bond. Take U.N.C.L.E. for example, and you will see what makes it unique how Guy Ritchie shows you what makes a great movie - great. The villain was the brightest light in the movie and we really didn't care much about the side characters, did we?",
      "total_reactions": 0,
      "user": "ivancic24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "I am so glad I didn't listen to the reviews and watched the movie, looked entertaining so I watched it and loved it, it has a corny feel to it but it's part of the game. Very entertaining and funny. It def didn't disappoint",
      "total_reactions": 0,
      "user": "Bitash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "Although I enjoyed myself, I do think the film had some issues. The fast edited fight scenes go on way too long, it's really violent, and the film can't really decide if it's an all out comedy or drama. At times it has \"Airplane\" type of humour, like it's making fun of the spy genre, and other times heavy on the drama. At one point they even poke fun of product placement in movies with McDonalds, again showing the \"Airplane\" style of satirical humour. Somehow it all worked for me mainly due to the spirited acting by everyone involved. Not really a film I would desire to see again but fun for an afternoon.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Kingsman: The Secret Service is an example of how great I wanted it to be, but eventually ends up being the only great one in its own way. Users may love this one, but I think personally, this one should've been better.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "WHAT I LIKED: This movie pretty much defines fun. Fancy some fairly light-watching, whitty and action-packed entertainment? Well not much can beat 'The Kingsman.' It's developed and involved enough to keep you engaged, but it's got just the right amount of fun and self-awareness to make it this easy and fun to watch. A great cast bring everything to life, and great direction guides the story, and the incredibly bad-ass action, to an explosive finale. It's bloody good fun.",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Kingsman is a very awesome movie its violent its got charm, Colin Firth, Samuel Jackson and Michael Caine kill it Oh and also that girl with the hook legs and the fight scenes are really a work of art.",
      "total_reactions": 0,
      "user": "sjulti"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Now, I hate comic books and even more so films inspired by them. Yes, I mean you Marvel, DC etc. One of the few exceptions is this. There are many pluses, not least well know actors playing against type, notably Colin Firth ditching his diffident middle class Englishman persona for a super smooth but hard as nails secret agent. Mark Strong plays a good guy rather than his usual villainous roles. Secondly there is humour throughout, even during the southern redneck church scene. In a film full of surprises this is the shocker so much so I had to replay it just to make sure I hadn't imagined it.  Maybe the only downside is that the director chose to depict exploding heads as colourful fireworks rather than opting for a bit of a bloodbath but tis is a moot point.",
      "total_reactions": 0,
      "user": "Trenchfoot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Deutsche Review - Kritik",
      "total_reactions": 0,
      "user": "KayVen17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "A must view, simply amazing. If you're looking for a action packed movie this one is your choice, a pretty balanced film with action, violence and a lot of funny moments, also the cast it's pretty damn awesome, Colin Firth, Samuel L. Jackson, Michael Cane etc",
      "total_reactions": 0,
      "user": "TheFullMetalDoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Violent tongue-in-cheek romp with a lead teen character. Solid send-up of the stiff-upper-lip British Bond-like spy. Cheeky and jolly good fun. Faberoony fight sequences: never knew Colin Firth had it in him, though always suspected Jack Davenport was a dab hand at the old one-two. Hope there's a bit more for the girls to do next time round. I'm sure we're in for a sequel.",
      "total_reactions": 0,
      "user": "shiftworker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2016
      },
      "score": 10,
      "text": "Wow. My only word that comes to my big head. Its a delight to see 2010's Director of Kick Ass, Matthew Vaughn, make a strong comeback with this film. If this movie can make it on my all time favorite movie list as number 1, then you will probably like it as well as i did.",
      "total_reactions": 0,
      "user": "moneylincoln"
    }
  ],
  "metascore": 58,
  "name": "Kingsman: The Secret Service",
  "num_weekends": 16,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 13,
    "month": 2,
    "year": 2015
  },
  "opening_weekend_income": 42000000,
  "opening_weekend_income_currency": "$",
  "rating": 7.7,
  "rating_count": 427188,
  "rating_freq": {
    "1": 3817,
    "10": 59676,
    "2": 2007,
    "3": 3069,
    "4": 5447,
    "5": 12742,
    "6": 34507,
    "7": 89771,
    "8": 134467,
    "9": 81685
  },
  "release_day": 13,
  "release_month": "February",
  "release_year": 2015,
  "user_review_count": 764,
  "votes_per_demo": {
    "aged_18-29": 170129,
    "aged_30-44": 115208,
    "aged_45+": 24790,
    "aged_under_18": 3022,
    "females": 61558,
    "females_aged_18-29": 34833,
    "females_aged_30-44": 16741,
    "females_aged_45+": 4108,
    "females_under_18": 707,
    "imdb_staff": 41,
    "imdb_users": 427188,
    "males": 273483,
    "males_aged_18-29": 133409,
    "males_aged_30-44": 96805,
    "males_aged_45+": 20263,
    "males_under_18": 2284,
    "non-us_users": 185377,
    "top_1000_voters": 627,
    "us_users": 46145
  },
  "year": 2014
}