{
  "avg_rating_per_demo": {
    "aged_18-29": 6.8,
    "aged_30-44": 6.5,
    "aged_45+": 6.5,
    "aged_under_18": 7.1,
    "females": 6.8,
    "females_aged_18-29": 7.0,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.8,
    "females_under_18": 7.8,
    "imdb_staff": 6.1,
    "imdb_users": 6.6,
    "males": 6.6,
    "males_aged_18-29": 6.7,
    "males_aged_30-44": 6.4,
    "males_aged_45+": 6.5,
    "males_under_18": 6.9,
    "non-us_users": 6.6,
    "top_1000_voters": 5.8,
    "us_users": 6.5
  },
  "avg_screens": 1270.2857142857142,
  "budget": 28000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 2,
    "year": 2014
  },
  "critic_review_count": 224,
  "duration": 105,
  "genres": [
    "comedy"
  ],
  "gross_income": 63910583,
  "max_screens": 3237,
  "mc_avg_user_score": 6.9,
  "mc_metascore": 48,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Last Vegas",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 74,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Last Vegas is an entertaining movie with a lot of integrity, and it gives all of its actors - all heavyweights and Oscar winners - real moments to dig in and play something."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "There’s virtually nothing subtle or surprising about the story, and yet one can’t help but smile throughout watching five Academy Award-winning actors breezing their way through an obvious but lovely and funny adventure."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "As Last Vegas glides along, satisfying expectations while always aiming low, it makes peace with being inoffensively mediocre. Like Vegas itself, the story goes down easy, but its appeal is hard to remember once you leave it behind."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Although formulaic in design and programmed to meet its quota of laughs, the film makes a point of going beyond basic expectations into some legitimate aspects of mature friendships without getting soggy about it."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "Nostalgia counts a lot and needs to, with this sitcom-level material and Jon Turteltaub's uninspired direction."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "After a while, you truly start to see the formula gears churning, but given that, it helps to have an actress like Mary Steenburgen, who at 60 still possesses an amazing glow, as well as a snappier comic timing than ever."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "The picture begins vanishing from the memory the instant that its final credits roll, and its laid back attitude suggest it's fine with that."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Special kudos to Freeman, who kills it on the dance floor and later while drunk off\u001e his ass on vodka and Red Bull. You'll groan as much as howl at the jokes, but the veteran stars have a ball acting their age. Even when all else fails them, they're good company."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "It’s the actors, plus an exuberant Mary Steenburgen as quick-witted lounge singer Diana, who make the movie more than a middling copycat."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "A genial \"Hangover\" for the AARP set, Last Vegas is roughly what you'd expect, or fear, but a little better."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Last Vegas isn’t “out there” in a “Hangover” sense. It’s comical comfort food, with actors doing the sorts of things they’ve done for decades. But even if this is the safest Vegas romp of them all, this cast never lets us forget that we’re in very good hands."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "It certainly doesn’t hurt that Douglas, De Niro, Freeman, and Kline are just plain fun to watch together. As predictable and occasionally uncomfortable as Last Vegas can be, it’s an assured crowd-pleaser."
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 60,
      "summary": "While it’s as tacky and obvious as Sin City itself, this comedy is watchable thanks to a lively pace and spirited turns from Kline and Steenburgen. An unabashed old-timers’ fantasy."
    },
    {
      "critic": "John Patterson",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Last Vegas is a good-natured bimbo of a movie, it'll do just about anything to please you, though luckily that includes delivering the 20 big laughs you feel you're owed (unlike The Hangovers), and gently jerking a tear or two. You enjoy it in spite of yourself."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "The film’s hidden asset is the luminous Mary Steenburgen, funny and gorgeous as an empty-nest mom turned lounge chanteuse who beguiles the dudes with age-appropriate flirting and arch humor."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Rote ageist jokes abound (“Do you guys have drugs?” asks a bachelorette; “Does Lipitor count?” responds Kline), but they come with an inclusive, self-deprecating spirit that grows more endearing over the duration."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 58,
      "summary": "It’s still a bit early in the long careers of these actors, especially Kline, to be playing creaky codgers. It’s bad enough when Hollywood casts women over the age of 30 as grandmothers-in-waiting. Now we have to endure an onslaught of famous veteran actors complaining about their hips."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 58,
      "summary": "Yes, it's uneven, more jokes miss than hit, and it winds up taking easy dramatic shortcuts from the more interesting avenues that the script presents, but it's thanks to the lead quartet that the comedy is as engaging at it is."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "It has the sensibilities of a late-'80s/early-'90s forgettable big-screen sit com and probably won't find many interested viewers who aren't card-carrying AARP members."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "We know where it’s going, and it doesn’t take long to get there. There are some good jokes along the way, a few of them blandly off-color."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie is a preholiday trifle that’s mildly risqué and a lot sentimental."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The film at least achieves the level of mediocrity thanks to the professionalism of two slightly younger participants — Kline and Mary Steenburgen, who also have Oscars on their mantels but go well beyond phoning it in here."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Alas, this all-star ensemble comedy that trumpets (too loudly) that it's a \"Hangover\" on hemorrhoid cream musters enough laughs to be passable, if not memorable. And that's thanks to Morgan Freeman's showmanship."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "A smattering of funny gags and the nostalgia value of the cast — none of whom, curiously, have ever shared the screen before — keeps the whole thing more watchable than it has any right to be."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "If you approach Last Vegas expecting an emotionally engaging, in any way surprising, moviegoing experience, you will be disappointed. But if you want the equivalent of an old-fashioned television variety show — a Very Special Evening with Robert De Niro, Morgan Freeman, Michael Douglas and Kevin Kline — you might not have such a bad time."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Though coming off at times like Adam Sandler’s “Grown-ups,” only with Oscar winners, Last Vegas is a genial little comedy for the crowd it’s intended for."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s delightful to see these acting pros hamming it up in this movie. They look as though they’re having a blast. The same can’t be said for the audience."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "It’s the geriatric equivalent of a ramshackle teen sex comedy, only intermittently elevated by the caliber of the talent involved."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "Just call this movie \"The Hangover: AARP Strikes Back.\""
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "In trying to lift this lame schtick, De Niro, Douglas, Freeman and Kline are stand-up guys, but Last Vegas is a case of erectile dysfunction."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "It’s all predictable and, despite the best efforts of Turteltaub and screenwriter Dan Fogelman at something a little risky, it’s pretty lame."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "Somewhere between John Cassavetes’s “Husbands” (1970) and “The Hangover” (2009) you will find Last Vegas. Not necessarily a bad place to be, except the film unfortunately has the madcap hilarity of the former and the emotional intensity of the latter."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 16,
      "summary": "The high point of Last Vegas is also arguably the low point of Robert De Niro’s career."
    },
    {
      "critic": "Abhimanyu Das",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 12,
      "summary": "The film is depressing, sub-sitcom fodder that will dull whatever affection you may still harbor for these legendary actors."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "“Last Vegas” stars Michael Douglas, Robert De Niro, Morgan Freeman and Kevin Kline in what can best be described as a senior citizen’s “Hangover” where, as in that film,  lifelong friends also experience a bachelor party in Vegas. That, however, is where the likeness ends for “lifelong” in this film means men who have been friends for over 60 years and have gone through many of life’s trials and tribulations together. This movie is geared for and will be enjoyed most by older movie goers who can identify with Cholesterol and PSA numbers versus baseball statistics and who can understand that phone calls from friends you haven’t heard from in many years don' always bring happy news. Well directed by Jon Turteltaub with a screenplay by Dan Fogelman, Messrs. Douglas, De Niro, Freeman and Kline get a chance to display their comedic and dramatic talents while ably abetted by a sparkling and charming Mary Steenburgen, all while in the venue of Las Vegas and, more specifically, Binion's Hotel and the Aria Resort complex. Though the jokes may be old, they are delivered well and make for a relaxed and nice viewing experience. This is not a great film nor will it win many awards but it does give the audience an opportunity to sit back and enjoy the exploits of these senior citizens as they seek new goals, heal old wounds and cement quality relationships. I give the film a 7 and recommend it to all who believe that life doesn’t necessarily end but can, in fact, begin over 70.",
      "total_reactions": 3,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Pure fantasy for people who need to escape. This is a story of what happens when everything goes right in Vegas. It does not all have to make sense or be completely believable because it is all about having fun and solving a few issues in the process of having all that fun. That being said if you also want to have a great time in Vegas just see this movie. The real life stories usually don't end with you leaving the table with 120 grand, and you don't have to wait on your plane to arrive at the airport. Movie ticket much cheaper than real Vegas every time.",
      "total_reactions": 3,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "The cast are frivolously hilarious, while the story itself drags on like most comedy-dramas, into a very typical cheesy friendship story. But film has its moments, extremely funny moments, mostly contributed to the Oscar quartet. It is far from the hangover, but it's more mature and more meaningful. Cheesy, but in a good way.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Last Vegas might look a little incompetent and stupid at first glance, but give it a chance. There are truly hilarious moments (not just in the trailer), and a deep, relatable message about friendship and loyalty that went deeper on emotional levels than I thought it would. Also, it's funny to see these classic actors make fun of themselves like this. It's not every day you see Morgan Freeman drunk-dancing!",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "A movie for the ages, meaning over 50.  Funny movie that keeps a smile on your face throughout and quite few burst of loud laughter.  I enjoyed it very much.  The young might have difficulty in relating.",
      "total_reactions": 1,
      "user": "JoeMan4529"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Wasted talents for this movie. Predictable, bored, cliche, easy jokes. The names didn´t make any difference for the development of the movie. Everything solves really easy at the end.",
      "total_reactions": 1,
      "user": "Christian0205"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Michael Douglas is getting married, so his 3 childhood buddies (Robert De Niro, Morgan Freeman, Kevin Kline) travel to Vegas for the bachelor party. Those expecting the geriatric version of \"The Hangover\" will be disappointed…nothing remotely outrageous happens. Instead, there are basically 2 movies: Douglas & De Niro have a relationship drama, while Freeman & Kline provide the gentle humor. Almost all of the jokes rely on old age insults with lots of trite heartfelt hogwash to make it heartwarming. While it's fun to watch these stars poke fun at their age and there's energy in the filmmaking, this is a pretty tame comedy.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Word for word, line for line, conversation for conversation the dumbest, most cliched, most boring movie of the last 5 years. Not much more can be said.",
      "total_reactions": 2,
      "user": "Proteus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "The most surprising thing about \"Last Vegas\" was that I laughed a few times and enjoyed it. You know going in that with a story about 4 old men who were childhood friends back in Brooklyn are now in Las Vegas where one of them is marrying a girl  Lisa (Bre Blair) more than half his age what the jokes will be about and they are. There are the Viagra, prostate and genital jokes. There will be very busty women all over the place, a lot of leers and plenty of old men jokes. The men are in Las Vegas to throw a bachelor party for Billy (Michael Douglas) the Peter Pan of the group.",
      "total_reactions": 2,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Taken as a dramedy for older folks, though, Last Vegas at least offers that demo enough relatable situations and moments to make for passable entertainment. We'll never know what it would it have been like to have seen the De Niro of the Deer Hunter and Raging Bull era opposite the Douglas of his China Syndrome and Wall Street years, but at least we'll always remember that sequence in Last Vegas when a guy in a thong shakes his junk in Robert De Niro's face. That's got to count for something in cinematic history, right?",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Take \"The Bucket List\" meets \"The Hangover\" and you have your surprisingly entertaining movie. While the movie is kind of stale, it's actors Michael Douglas, Robert DeNero, Kevin Kline and especially Morgan Freeman that make this movie worth the while. It has an interesting story base for old people and really just tries to give the audience a good time. And that's what makes this movie work. I give it a B-.",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "\"Last Vegas\" is based on a concept done to death, but for some reason, I loved it. Kevin Kline played my favourite character in the film, and although a lot of the plot is over-the-top, I felt it worked.  There are some great \"lessons\" in the film, and although some of the plot just works out \"too perfectly\", I dug it.  I wish movies trying to be like \"The Hangover\" would copy this instead.",
      "total_reactions": 2,
      "user": "RJLilley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "The old folks jokes get old after awhile.  But the laughs supersede them and just for that, this film is worth the price of admission.  Hope there is a sequel somewhere down the line.",
      "total_reactions": 1,
      "user": "italiankaren"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "This is a fun movie. These guys have great chemistry. I've been describing it as your Grandparents version of The Hangover but it's a lot more than that. It's got a great message about friendship and all these actors are awesome. It's got a couple laughs but I think the target audience just isn't there and we could have done without it.",
      "total_reactions": 1,
      "user": "JC86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "It's a funny enough movie with four great stars bringing the entertainment. I do feel like the film's more emotional moments do fall flat, and the romance is entirely predictable, but I had fun with it. There are plenty of laugh worthy moments and it does well playing off of it's star's ages. It might not be laugh-out-loud hilarious, but it's entertaining enough to be worth a rental and it won't feel like a waste of time. There's also a sweet core to it, although it does feel sort of artificial. Overall I give it a 6.8/10-Okay.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "First question... why? Why did they have to do this?",
      "total_reactions": 0,
      "user": "Akadrud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "When you take the plots of two successful movie franchises, and blend them into one, often the results are mixed, but this time, thanks to an all-star cast, The Hangover meets Grumpy Old Men in Last Vegas, and the results are hilarious. Billy (Michael Douglas) is 70 years old and about to marry a college student. While he seems content with his new life, he desires one last vacation with his three best friends from the old neighborhood. Reluctantly putting aside old quarrels, the men meet in Las Vegas for Billy's bachelor party, and once things get going, these guys prove that they are anything but over the hill. It's hard to go wrong with a cast of Academy Award winners that have literally hundreds of films under their belts, but a film like Last Vegas really does come down to the writing. If it's not hilarious, in the eyes of the audience, the cast will seem as over the hill as their characters. Thankfully, that wasn't the case, as simply the chemistry between these guys leads to some hilarious moments, that I'd be willing to bet were completely unscripted. Each actor brings their own unique style and brand of humor to the part and when they finally come together in Las Vegas, this film takes off. It isn't an exaggeration to say that this is one of the funniest films I've seen all year. Just the guys reaction to the things associated with modern day Las Vegas, like the technology, thugs, rap music, and strippers is absolutely priceless. The ancient cast and a PG-13 rating turned a lot of people off to this film, but the cast is a complete throw back trapped in a modern party town, leading to some epic scenes. Last Vegas is an absolute comedy gem, that somehow fell under most peoples radars, but it is every bit as good as the Hangover was, and maybe even more so, thanks to the experience of the cast and their tremendous chemistry.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Last Vegas isn't funny and carries with it some very lazy comedy. After 20 min the old jokes get old and the movie becomes boring in it's second half. The cast was a complete waste of talent.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Seeing prominent actors being reduced to a clichéd plot line makes the movie somewhat underwhelming, but it ultimately is a decent film that manages to have some funny moments.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "This film was one of the best times I have had at the movies recently. I'm a 19 year old student filmmaker that's been studying film, analyzing it, making it, but through all of that I forgot what going to the movies is really about; having a good entertaining time. I believe movies should do several things; have a great story: this one's story was not AMAZING but the background the characters had with each other played a huge part in the film's story. A good film should have great messages; this one had some of the best messages I have seen in recent films, something that actually made me feel so much better and just all around happy; and the film should be entertaining. The jokes were laugh out loud funny (I won class clown and my father is a stand up comedian, it's not easy to make me laugh) but the humor in this movie was great. Although older audiences might get more from it, it made me so appreciative to have my whole life ahead of me, and know that I will never be too old to have a dumb good time with my buddies. The film also captured Vegas pretty well, maybe not every aspect, but enough to the point where it made you feel like you were there. I'm sick of critics only giving good scores to these long boring movies like Gravity, or Prisoners, because it's \"more intelligent\" or whatever. Screw that, I would take this film over films like that any day, because this is what going to the movies is about; laughs, cries, heartbreaks, in this case some awkward groaning and moaning sounds (I was the only non-grey haired person in the audience) but this film did it's job. The cast was hilarious together, I'd say this is one of the funniest films of the year, one of the funniest films about Vegas (yes, funnier than the Hangover) and a film for ALL ages.",
      "total_reactions": 0,
      "user": "ROFLoom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Recently I have seen some good movies based on a gang of old people. 'Stand Up Guys', 'Quartet', 'Song for Marion', 'The Best Exotic Marigold Hotel' et cetera the list goes on where aged people rule. It's nice to see old guys are still capable to handle the responsibility in the entertainment business. Those movies I saw were really awesome including this movie.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "Commercial film making at its lazy worst starring 4 has been leads who seem to have undertaken the enterprise purely to have a paid holiday. In truth they are probably having a lot more fun than any discerning audience member ever could from this farrago.  Morgan Freeman should have known better. Robert De Niro has just become a pathetic joke in the roles that he now plays. B actor Kevin Kline has ambitions to be included in the A list of actors, but instead finds himself in an E rated film, and Michael Douglas, after his brilliant turn as Liberace, sinks to his usual underwhelming level. Pity poor Mary Steenburgen saddled with a totally unconvincing role as a singer who can just drop everything to go aimlessly wandering around with this sad quartet.",
      "total_reactions": 0,
      "user": "oakridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Much anticipated, it could have been an excellent ensemble but just pays off just average and forgettable. It has a few good laughs and nice chemistry.",
      "total_reactions": 0,
      "user": "WalkingDead5640"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "I didn’t find “Last Vegas” to be absolutely horrible—far from it.  The jokes may be predictable and very formulaic but Douglas, De Niro, Freeman and Kline are all terrific together and really have a chemistry that works and makes them believable in their roles as old friends.  However, the story gets really corny towards the end and takes away from the little humor the film gives you at the beginning.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "To see this movie more than once  bad choice.",
      "total_reactions": 0,
      "user": "fuulve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Although the movie lacks many things a good comedy should be, our four musketeers make a satisfying appearance. Recommended for  anyone that enjoys old fashioned comedy movies",
      "total_reactions": 0,
      "user": "AnotherGamerFRA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Last Vegas is about a group of long-time childhood friends who meet in Vegas for a weekend because one of them is getting married. This film was great with cameos by LMFAO and 50 cent. Michael Douglas, Robert De Niro, Morgan Freeman, and Kevin Kline did a great job acting and it's hard to believe these 4 great actors have never worked with each other before and they should definatly work together again on future films.",
      "total_reactions": 0,
      "user": "Volbeat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is awful, a complete waste of talent. Douglas, DeNiro, Freeman and Kline are so much better than this puerile garbage. Totally predictable. Totally overdone plot (think of Hangover and so many other \"group of buddies go to Vegas\" type movies) and old jokes and scenarios. Why do they have to continually make movies that show old guys going through a mid-life crisis and lusting after young women? Us old guys are NOT all like this. Some of us a very happy with our lives and our wives. Avoid this movie like the plague.",
      "total_reactions": 0,
      "user": "noelmt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "its cool rembering what you did as a child back in the day i love this movie it is funny and great . it is just like  grown ups movie expect its about old people .",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Anybody who doesn't find this movie marginally short of excellent has no sense of humour whatever their age. I feel sorry for csw12 and more so for Proteus who must be sad and boring soles. Take my advice and see this movie, it is well worth the entrance money.",
      "total_reactions": 0,
      "user": "malc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Fantastic funny film - it's for more of an older audience, which is  why it has some low reviews, as the youngsters today .... Blah blah lol.   but I couldn't stop laughing - although my 22 yr old son watched it too and he was collapsed with some of the one liners.  It was brilliant - really was",
      "total_reactions": 0,
      "user": "Mindie777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "I wasn't expecting to enjoy this film because I thought I was a bit too young for it, but I was surprised. All four of the main characters were hilarious and they all worked so well off of each other. It seems like they like they know each other pretty well behind the camera. Last Vegas is just a great buddy comedy. It doesn't matter how old you are.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Some have said that this movie is nothing but a geriatric remake of The Hangover, but that just sort of cheapens the hangover. This is very pedestrian and while the performances of the actors are great, there isn’t much happening here. It’s not very edgy and kind of falls flat. One thing I do know, my mother, god rest her soul, would have loved this film.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 5,
      "text": "When an older man wants to marry a very young girl in Las Vegas, and invites his friends, all the same age as he is, things can get crazy, and they certainly do in 'Last Vegas'.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "The movie, yes, is like The Hangover of the old mans, but it's lighter and in a way more touching, but still fun. The production is simple, with a light and loose script, right music and correct cinematography. I think the director did not have to have had so much work with the cast, with a very strong quintet, each with his Academy Awards. Perhaps most surprising is Mary Steenburgen, great on the scene, but the leading quartet does not leave to be desired, even Morgan Freeman superior sense in several moments.",
      "total_reactions": 0,
      "user": "lucbevibrasil"
    }
  ],
  "metascore": 48,
  "name": "Last Vegas",
  "num_weekends": 14,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 1,
    "month": 11,
    "year": 2013
  },
  "opening_weekend_income": 16334566,
  "opening_weekend_income_currency": "$",
  "rating": 6.6,
  "rating_count": 110774,
  "rating_freq": {
    "1": 893,
    "10": 6906,
    "2": 816,
    "3": 1633,
    "4": 3756,
    "5": 10192,
    "6": 26090,
    "7": 36045,
    "8": 17875,
    "9": 6568
  },
  "release_day": 1,
  "release_month": "November",
  "release_year": 2013,
  "user_review_count": 175,
  "votes_per_demo": {
    "aged_18-29": 43396,
    "aged_30-44": 37072,
    "aged_45+": 8442,
    "aged_under_18": 329,
    "females": 17918,
    "females_aged_18-29": 8965,
    "females_aged_30-44": 5957,
    "females_aged_45+": 1504,
    "females_under_18": 82,
    "imdb_staff": 6,
    "imdb_users": 110774,
    "males": 76555,
    "males_aged_18-29": 34031,
    "males_aged_30-44": 30643,
    "males_aged_45+": 6801,
    "males_under_18": 242,
    "non-us_users": 58190,
    "top_1000_voters": 402,
    "us_users": 11115
  },
  "year": 2013
}