{
  "avg_rating_per_demo": {
    "aged_18-29": 5.7,
    "aged_30-44": 5.6,
    "aged_45+": 5.6,
    "aged_under_18": 5.6,
    "females": 5.7,
    "females_aged_18-29": 5.6,
    "females_aged_30-44": 5.7,
    "females_aged_45+": 5.8,
    "females_under_18": 7.6,
    "imdb_staff": 7.2,
    "imdb_users": 5.6,
    "males": 5.6,
    "males_aged_18-29": 5.7,
    "males_aged_30-44": 5.6,
    "males_aged_45+": 5.6,
    "males_under_18": 5.3,
    "non-us_users": 5.6,
    "top_1000_voters": 5.5,
    "us_users": 5.7
  },
  "avg_screens": 2216.75,
  "budget": 20000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 25,
    "month": 10,
    "year": 2013
  },
  "critic_review_count": 263,
  "duration": 107,
  "genres": [
    "action",
    "crime",
    "sci-fi"
  ],
  "gross_income": 7268659,
  "max_screens": 2538,
  "mc_avg_user_score": 6.0,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 65,
  "mc_movie_name": "Machete Kills",
  "mc_negative_rating_frequency": 37,
  "mc_positive_rating_frequency": 81,
  "mc_pro_critic_reviews": [
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 83,
      "summary": "Like its predecessor, Machete Kills is never less than busy with ridiculousness."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 83,
      "summary": "Machete Kills is gruesomely baroque trash staged with a kinetic freedom that is truly eye-popping, so you can forgive its lapses, like how it goes on a little too long. Rodriguez's only real sin as a filmmaker is that he wants to give you way too much of a crazy ultraviolent good time."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "You’re really going for Rodriguez’s retrohappy splatter: Intestines tangle in helicopter rotors, heads pop in spring-loaded decapitations, and there’s even a new fake trailer up top. Little is believable, and that’s exactly as it should be."
    },
    {
      "critic": "Josh Modell",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Machete Kills is gleefully ridiculous, one-upping the first movie’s jokes, blood, and even its massively heightened self-awareness. No matter how Rodriguez would like to pitch it, Machete Kills isn’t really an homage to exploitation movies as much as it’s a parody of them."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Kills tops the 2010 original by not giving a mierda about logic or character."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 64,
      "summary": "More focused and less preachy than its exploitation-riffing predecessor, the comparably shoddy Machete Kills nonetheless peters out in the homestretch (and, for some, surely sooner)."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The picture is assembled with energy and a smidgen of style, but it's tiresome and slight."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Those who love Robert Rodriguez's over-the-top Grindhouse-flavored spoofs will delight in this one but, ultimately, this is probably one Machete too many."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Machete Kills dulls more than anything. It's not that Robert Rodriguez's sequel lacks any of the camp or exploitative violence of the 2010 original. The mayhem has just become boring."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The harder everyone tries to wring laughs out of the next hail of bullets or the next ridiculous plot twist or the next comedic decapitation, the duller the edge of the humor."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Entertainingly gruesome in parts, and not without a certain anarchic wit, it’s the kind of movie you pause to watch when it’s on TV, but after half an hour, you’ll click over to something else."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Rodriguez does a fair job of keeping the zaniness coming: Vergara’s machine gun bra, Gibson delivering exposition in a “Star Wars” prop, bad guys offed by helicopter blades in dementedly creative ways. It’s enough that you’ll hope Rodriguez makes good on that new faux trailer — for “Machete Kills Again . . . in Space.”"
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "As much as Machete Kills is a reunion and continued revival, it also represents a sort of gentrification of the exploitation genre. It's probably time to move on and let a new generation of kids take a crack at making bad films."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Robert Rodriguez is like that friend who loves to tell jokes, but always goes on and on, well past the punch line. Remember how he beat the living daylights out of his “Spy Kids” franchise? That’s what he’s working toward with Machete."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The films that Robert Rodriguez emulates here are known for similar unexpected narrative turns, but the crucial value that he misses is their actual cheapness."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 45,
      "summary": "At times, to be blunt, he (Trejo) comes off like a silent film star who's accidentally lumbered onto the set of a bloody, violent, thoroughly ridiculous talkie: reluctant to speak, sometimes a little confused by his surroundings."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "The odd vivid shot reminds you of Rodriguez's dynamic visual imagination, but also what it's wasted on here: a project as indifferent as some of the trash that inspired it."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Perhaps because the joke’s already spent, this sequel has a pretty low bar to clear, and manages to be both utterly meritless and weirdly bearable."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Turns out there can be too much of a good thing.  Or a campy thing. Or a silly thing. Or a subtle-as-a-brick-in-the-face thing."
    },
    {
      "critic": "Matt Singer",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "As a focused spoof of exploitation tropes, Machete Kills is, frankly, terrible. But as a surreal stream of subconsciousness from a filmmaker who’s spent a lifetime watching bad movies, it’s an occasionally entertaining diversion."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "It works extremely well as a drunken, date-night midnighter or film-fest entry, all madcap bloodletting and surrealist non sequiturs."
    },
    {
      "critic": "Trevor Johnston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Sadly, much as we want to relish the shameless parade of cartoon violence, while indulging the equally shameless cavalcade of adolescent sexism, the soggy plotting and slack comic timing are downers."
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Like a meal made entirely of chillies, Machete Mk II is spicy to start with, then unpleasant, then numbing - before it all starts to repeat."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Violent, silly, embarrassing, clumsy, confusing, juvenile, occasionally offensive, occasionally a little bit fun."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "As violent as its predecessor yet noticeably duller and less outrageous, Machete Kills is dragged to the finish line entirely by its director’s madcap energy and an absurd cast of major stars in strange cameos."
    },
    {
      "critic": "Dave McGinn",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "It is all so intentionally ridiculous that it gets boring, and you just wait for the next big cornball revelation to momentarily jolt you awake, like Sofia Vergara strapping on her machine-gun bra, or Lady Gaga’s appearance as a hit woman. Machete kills, sure. Unfortunately, he overkills."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 37,
      "summary": "It’s exhausting.  It’s also not particularly funny or engaging."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "All too soon, Machete Kills collapses into a deranged, directionless splatter comedy that exhausts its bag of tricks, many of them recycled from this grindhouse auteur’s 2010 spoof."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "Machete Kills winds up a slightly camp, tinny parody of bad action movies, playing out with the same sense of tedium as a genuine bad action movie."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "The cinematic axiom of diminishing returns appears to be catching up with Robert Rodriguez’s Machete franchise in only the second installment, as the series’ engagingly lowbrow concept gets overwhelmed by episodic plotting and uninspired, rote performances."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "When a celebrity chef like Rodriguez is just going through the motions, we can smell that the grindhouse fad is way past its expiration date. It's time to put a fork in it."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 20,
      "summary": "The carnage (with its computer-­generated splatter) is meant to be campy fun, but it’s so offhand that there’s less suspense than in an Austin Powers movie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "\"Machete Kills\" is inferior to the first one, has no cohesive plot, and the best thing in this movie is Mel Gibson! But it works as it is, mediocre parody with some creative kills!",
      "total_reactions": 1,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "All of the ingredients of the original but somehow none of the result. An ill put together bore-fest you are better off re-watching the original which remains a classic.",
      "total_reactions": 1,
      "user": "lghulm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Cheesy visuals, dry humor, and predictable in every way describe this movie pretty well. Don't waste your time on this when there are much better comedies out there.",
      "total_reactions": 1,
      "user": "cadenparker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Let me start off by saying love love love the first Machete. I can watch it anytime... This one, not so much. Robert Rodriquez swung for the fences with this one and it missed. Some people will never ever say anything bad about the guy and some will genuinely like it, but to be honest.. it just didn't have that X factor the first Machete did. This time around Machete is more like a super hero. He is sent on a mission to Mexico by the President (excellent choice of casting Charlie Sheen, using his birth name of Carlos Esteves). But other than that, (and of course Danny Trejo and Michelle Rodriquez), the rest of the cast just didn't fit. The schizo Mexican revolutionary didn't fit, Cuba was completely out of place, wasn't really feeling Lady Gaga or Amber Heard (even though she is gorgeous) and the gorgeous Sophia Vegara was just a little too manic. But it really wasn't that.. the film just was kind of flat, even the action scenes weren't clicking. Maybe because they gave away too much in the previews. Maybe its because they made Machete inhuman.. All I know is that when I was in the theater, 3 people around me fell asleep and 4 people walked out a hour after the film started... AND it wasn't that many people in the theater. Gosh I wanted it to be so much better.. This is a rental, at best",
      "total_reactions": 1,
      "user": "morfil"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Danny Trejo is back as the grizzled tough guy, out to save the US from several crazed maniacs. Director Robert Rodriguez has returned to grindhouse territory with over-the-top violence, hot women and cheesy special effects. His script is too often talky and the dialogue isn't that clever. Some of the action is inventive, while a lot of it is just noisy. The star-chocked cast doesn't go far enough into camp (again, blame the writing).  When this movie is good, it's loads of fun, but it's not as outrageous or inspired as the genre demands. NOTE: Stay thru the credits for 2 outtakes.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Guns don’t kill. Machete Kills! Actually, the opening scene of this bizarre sequel to the even bizarre-er 2010 original Machete shows that guns do kill. They just don’t kill Machete (Danny Trejo), whom you’ll recall from the first film survived a shot to the head when the bullet was blocked by another bullet, already lodged in his skull. Machete Kills continues director/co-writer Robert Rodriguez’s penchant for outrageous plot developments performed by “what-the?” casting choices. Mel Gibson plays a villain straight out of a Bond film  Moonraker, to be precise. Charlie Sheen (listed in the credits by his birth name, Carlos Estevez) follows in his father’s footsteps as the U.S. President. And Lady Gaga is introduced as “whoever she wants to be.” Name your box-office poison. If Fatty Arbuckle were still around, he’d have a cameo for sure. Yet somehow, the results work. That’s probably because Rodriguez takes nothing seriously. The plot  which could fit on the back of a cereal box, but only the really sugary kind  involves a Mexican madman (Oscar nominee Demian Bichir) who wants the U.S. to clean up the corruption in his country, or he’ll fire a nuclear warhead at Washington. (Apparently he’s been reading Madman Tactics for Dummies.) President Sheen, or Estevez, or whatever, calls on Machete to help. “You know Mexico,” he tells the taciturn strongman. “Hell, you are Mexico.” Helping him will be a government agent played by Amber Heard. Her cover identity is beauty pageant winner Miss San Antonio, but has the operative gone too deep into character? In one scene she texts Machete: CU There!   More about the story I cannot reveal. It’s not that I’m against spoilers; I just wasn’t sure what was going on most of the time, although whatever it is, it’s as funny as a roadrunner cartoon and only about 2.5 times as violent. Machete faces off against La Camaleón, a shape-shifting assassin played by a bewildering array of actors (Cuba Gaga Banderas Jr., etc). He crosses paths with Desdemona (Sofia Vergara), whose 32F brassieres pack a 38-calibre punch. (You’ll never guess where she keeps her backup firepower.) He hooks up with former partner Luz (Michelle Rodriguez), who sports a sexy eye patch and has a feminist revolutionary poster on her wall that reads Shé. And he makes use of a road-tunnel under the U.S.-Mexican border, stolen directly from 2009’s Fast & Furious. The movie runs for 107 minutes but features a ticking-clock timeline that allows it to pack more into 24 hours than, well, 24. And it opens with a fake trailer for Machete Kills Again  In Space! At least, I think it’s a fake trailer. You may recall that the first Machete sprang from just such a bogus teaser, attached to 2007’s Grindhouse. So while Machete likes to say “Machete don’t” lines  Machete don’t smoke, tweet, joke, etc.  the one thing Machete seems destined to do is return.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "As a fan of the first Machete film I really liked this movie.  Great escapism over the top fun as well as a good parody of the grind house type films I saw as a teen in the 70's at local theaters both drive-in and otherwise.  My only complaint about this movie was the lack of gratuitous female nudity.  Hopefully Mr. Rodriguez will make up for this in the next installment \"Machete Kills Again... in space!\"  Looking forward to that one.  Ignore the negative reviews!  This is a fun, entertaining film; it doesn't take itself too seriously and nor should the viewer,  Watch it and enjoy!",
      "total_reactions": 4,
      "user": "papanez"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is good solid fun. If it is given a bad review it is because the person reviewing it has no sense of humor. Slap stick much like Austin Powers, only much funnier. I laughed from the beginning to the end.",
      "total_reactions": 4,
      "user": "AWatcher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "For a movie like this, it's all just based off of this joke. If you're into the joke, then you'll absolutely love this movie. But if you're not, then you'll completely hate \"Machete Kills\". Overall, while it's suppose to pull off this cheesy old look, it's still not that good of a movie. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "This sequel is so bad I questioned whether or not I even liked the first movie. I want to post spoilers to help you save money but I won't. Avoid this gigantic troll of a movie.",
      "total_reactions": 2,
      "user": "JC86"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Ever start laughing because the movie is so bad, well Machete Kills is that. Everything about the movie deserves a F, including the effort to try and make something even remotely interesting. The movie is a pile of garbage that happens to be one of the worst movies in a very long time.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "What an amazing movie. It's so freaking ridiculous, even more so than the original in all the right ways. The action is great, bloody and creative. The plot is so bonkers and unpredictable you'll always be wondering what will happen next, the casting is excellent and many of the many many maaaaaany characters are likeable and they have some epic lines. Machete Kills is the most fun I've had at the cinemas since Pacific Rim. If you and your friends want to have a good, absurd time, then this is the movie for you.",
      "total_reactions": 7,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "The film is very steep, it is saturated with militants 80 years, clean trash, which of course, is not like a movie worth seeing everyone!Excellent continuation of the first film, all the critics are going to hell!",
      "total_reactions": 5,
      "user": "kark"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Machete suffers from too many co-stars and drags on and on. It also ends abruptly. There are a few things I would of done differently in the editing room too. Enough hate though, this movie does have some good qualities. One of them is Charlie Sheen (Estevez!) as the president of the free world. Of course Machete is the front man for this ensemble of characters that keeps the movie flying along at a roadrunners pace. I liked the first one a lot!!!! This one was entertaining as grind-house cinema but not much more.",
      "total_reactions": 8,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "This was the worst movie I have ever seen in the theater in my entire life. And that is saying something. Whatever political or social themes this movie wanted to convey...it confused itself with the absurd to the point that there is nothing here to really watch. And I'm saying this as a fan of the first one which was a very sexy movie. The sequel is not sexy, has no nudity, and makes no sense. It tries (but fails) in any attempts at humor, has an uneven plot, and the action simply does not compare to the first one. Maybe some movies just shouldn't be done again. It seems like a third one might be in the works. They are milking this one dry, but when it all becomes about the money...quality is the true cost that is lost.",
      "total_reactions": 11,
      "user": "seymore23"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "It is a good film it made me laght i can't wait untill another one comes out it will be awsome all the actors they have in the film are well known all over the world and each and every one, It's so freaking ridiculous, even more so than the original in all the right ways. The action is great, bloody and creative. The plot is so bonkers and unpredictable you'll always be wondering what will happen next, the casting is excellent and many of the many many maaaaaany characters are likeable an",
      "total_reactions": 3,
      "user": "nematducku"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "THE most badass movie of 2013! I loved every minute of it! Basic plot is that Machete is now going after a nutjob who wants to nuke the world. Standard Grindhouse plot but oh does it set up for what could be THE BEST SEQUEL EVER!",
      "total_reactions": 6,
      "user": "LoneWanderer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "I had a lot of fun seeing Machete Kills at the theater. The action is over-the-top and I thought Mel Gibson gave a memorable performance as the villain. If they ever make the next movie that they tease in the intro and outro, I'll be there.",
      "total_reactions": 2,
      "user": "LBC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Bizzare settings and extreme violence, Machete Kills is good in it's all way. The movie may not be suitable for some viewers, though. Please think wisely before watching as it can be quite disturbing.",
      "total_reactions": 2,
      "user": "AnotherGamerFRA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "How can this man stand in front of this great selection of superstars? I mean looking at his face makes me just think \"where's my pimple pick? yack!\" but in the next moment all these models come and the peak of stupidity I  can only see watching Germany's Helge Schneider. It's a hard trial for my tolerance in irony, it's such a trash movie that I must look for the next hard drink to feel like a real MAN. Oh how ridiculous! Go away! Trejo! Does humour belong in sinkholes?",
      "total_reactions": 1,
      "user": "schlaui"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Very fun movie. Over the top action, characters and full of well known actors playing this ridiculous characters. If you liked the first movie you will like this one as well. Can't wait for Machete in space hahaha.",
      "total_reactions": 2,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "I'm unimpressed with a crazed killer flying around the world aimlessly. Sure, Danny Trejo embodies an exciting Machete--but there's no point to it. It's campy where a film shouldn't be. Even Lady Gaga's cameo is useless.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "Though not as strong as its predecessor, Machete Kills is an insane and frequently hilarious sequel that, though a bit bloated, makes for very fun viewing.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "While the first movie is an enjoying experience Machette Kills is just to much of all and feels like a parody and not like a hommage to the genre, like the first on was.",
      "total_reactions": 0,
      "user": "Caestus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Not as good as the original, but worth seeing if you liked the first one.  Notable for the jokes far more than the action sequences. Charlie Sheen is a hoot as the president.",
      "total_reactions": 0,
      "user": "jraz81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Película desagradável muito abaixo da primeira, certamente um dos piores filmes de 2013, um descaso de genialidade da produção e do diretor, fraco, ruim e mal feito.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "In my opinion this is a really unnecessary sequel with a huge cliffhanger to another unnecessary sequel. The first Machete had some noncence in it, but it actually had some story behind that. Machete Kills seems like nonsence for the sake of noncesnce and nothing more. There are some cool moments, but overall I didn't really like it.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "While there are a myriad of characters, explosions, celebrity cameos and violence this film is far too simple and dumb to be that interesting. Only the promise of a sequel set in space makes this worth a watch and even then as it seems less grindhouse and more spoof.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "While I wasn’t a fan of the first film, I kinda get why it resonated with certain audience members.  Dark comedies are fantastic (in my opinion) and Machete was just an unapologetic jumble of boobs, blood, guns and sheer ridiculousness.  However, the sequel fails to recapture that formula and, ultimately, ended up feeling like a parody or like someone was making fun of Robert Rodriguez and the first movie.  The jokes are terrible, the action is forgettable and the story is a sloppy excuse of a Grindhouse parody.  While some of the characters might have been intriguing or even awesome, Rodriguez wastes them and treats them like they are nothing more than filler to make the film get to a feature length.  The only saving grace is that Mel Gibson is incredible as the film’s bad guy.  Other than that, the film was just a sequel that didn’t need to be made…but that’s not shocking when you take into consideration that the film is a sequel to a movie that was created from a fake trailer.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "If you want a smart and artistic film this is not your movie, but if you want fun and violence, can be better than the most of Hollywood movies,",
      "total_reactions": 0,
      "user": "herreiere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "This is a good movie, the ending could have been better and the plot and story where all over the place but I still managed to enjoy the film, if you enjoyed the first one you will enjoy this",
      "total_reactions": 0,
      "user": "masterjohnson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "i love the danny trejo as machete . this is better then the first one i love trejo's violence it is more epic and rockness and more thrilling i can  wait for the thrid one",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "I really should have seen the first Machete before I saw this, because after I watched all of this, I didn't want  to watch any Robert Rodriguez movies at all (unless it was Sin City, Sin City is so badass).",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "Barely any good movie . When I saw the trailer I thought that this movie would be an interesting action movie but when I watched it i realized that I was terribly . First of all lets see uhm oh yeah the budget is only 20 million U.S",
      "total_reactions": 0,
      "user": "Dovran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "The whole Machete thing has always been a joke. When the fake trailer appeared in the Grindhouse, it was a funny one. Then it got out of hand. The first movie was pretty watchable, but the joke was starting to get overused, you can't make a good movie out of a single gag (or at least Rodriguez can't). This time, the sequel has come very close to the line that separates a crappy movie from a mediocre one. Utter senselessness, poor visual effects, cheesy acting and stupid forced dialogues just don't go unnoticed.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Machete Kills has way too many characters I don't care how well known the actors are who play them. It doesn't take very long for the movie to get out of hand. I thought the first film was alright, but I'm certainly not interested in watching the next one. These films are only going to get more stupid as they go.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Robert Rodriguez's imagination and sense of humor is at full speed which is what holds Machete Kills back from being good. He's usually good at making B movies that poke fun at themselves but here B, stands for bad. Machete Kills is over the top goofy throughout. Even a kooky Mel Gibson with a Mad Max tribute scene can't save it.",
      "total_reactions": 0,
      "user": "Jim222001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Although certainly entertaining Machete Kills is so ridiculous that it ends up not being a good movie. The deaths are fun the action is fun and luckily the film doesn't take itself seriously but simply not taking itself seriously doesn't make it good. Some of the characters are too irritating for too long and overshadow the action. But hey if you're looking to watch a film with a lot of cool gory deaths this movie is for you. If you're looking for anything else then not so much.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Isador Cortez, a.k.a. Machete, always had Danny Trejo’s face since his first cameo in Robert Rodriguez’s \"Spy Kids\" (2001), and has always been portrayed as an over-the-top caricature of the infallible action hero. His first sporadic appearances in different films were intended as Easter eggs and nod to the fans: the best known reference of all is the fake trailer included in \"Grindhouse\" (2007), by Tarantino and Rodriguez himself. It took Quentin’s genius (but most of all his reputation) to raise the funds for a project that had been their forbidden desire for a long time: a so called “b-movie”, a low-budget exploitation film as in fashion in the ‘70s. Rodriguez jumped at the chance to give depth and notoriety to Machete, laying the foundations for what would later become the 2010 feature “Machete”, a critical, public and box office success.",
      "total_reactions": 0,
      "user": "Devilmath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Let me start off by saying love love love the first Machete. I can watch it anytime... This one, not so much. Robert Rodriquez swung for the fences with this one and it missed. Some people will never ever say anything bad about the guy and some will genuinely like it, but to be honest.. it just didn't have that X factor the first Machete did. This time around Machete is more like a super hero. He is sent on a mission to Mexico by the President (excellent choice of casting Charlie Sheen, using his birth name of Carlos Esteves). But other than that, (and of course Danny Trejo and Michelle Rodriquez), the rest of the cast just didn't fit. The schizo Mexican revolutionary didn't fit, Cuba was completely out of place, wasn't really feeling Lady Gaga or Amber Heard (even though she is gorgeous) and the gorgeous Sophia Vegara was just a little too manic. But it really wasn't that.. the film just was kind of flat, even the action scenes weren't clicking. Maybe because they gave away too much in the previews. Maybe its because they made Machete inhuman.. All I know is that when I was in the theatre, 3 people around me fell asleep and 4 people walked out a hour after the film started... AND it wasn't that many people in the theatre. Gosh I wanted it to be so much better.. This is a rental, at best.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    }
  ],
  "metascore": 41,
  "name": "Machete Kills",
  "num_weekends": 4,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 11,
    "month": 10,
    "year": 2013
  },
  "opening_weekend_income": 3837183,
  "opening_weekend_income_currency": "$",
  "rating": 5.6,
  "rating_count": 61693,
  "rating_freq": {
    "1": 2928,
    "10": 3515,
    "2": 2138,
    "3": 3443,
    "4": 6228,
    "5": 11437,
    "6": 14380,
    "7": 10655,
    "8": 5112,
    "9": 1857
  },
  "release_day": 11,
  "release_month": "October",
  "release_year": 2013,
  "user_review_count": 164,
  "votes_per_demo": {
    "aged_18-29": 21481,
    "aged_30-44": 25204,
    "aged_45+": 4502,
    "aged_under_18": 106,
    "females": 4225,
    "females_aged_18-29": 2026,
    "females_aged_30-44": 1605,
    "females_aged_45+": 341,
    "females_under_18": 18,
    "imdb_staff": 4,
    "imdb_users": 61693,
    "males": 49139,
    "males_aged_18-29": 19256,
    "males_aged_30-44": 23292,
    "males_aged_45+": 4076,
    "males_under_18": 87,
    "non-us_users": 33735,
    "top_1000_voters": 425,
    "us_users": 8042
  },
  "year": 2013
}