{
  "avg_rating_per_demo": {
    "aged_18-29": 6.9,
    "aged_30-44": 6.4,
    "aged_45+": 6.8,
    "aged_under_18": 7.4,
    "females": 7.3,
    "females_aged_18-29": 7.3,
    "females_aged_30-44": 7.1,
    "females_aged_45+": 7.5,
    "females_under_18": 8.0,
    "imdb_staff": 6.7,
    "imdb_users": 6.8,
    "males": 6.5,
    "males_aged_18-29": 6.8,
    "males_aged_30-44": 6.3,
    "males_aged_45+": 6.6,
    "males_under_18": 7.2,
    "non-us_users": 6.5,
    "top_1000_voters": 5.7,
    "us_users": 6.7
  },
  "avg_screens": 853.8461538461538,
  "budget": 20000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 9,
    "month": 10,
    "year": 2015
  },
  "critic_review_count": 60,
  "duration": 111,
  "genres": [
    "adventure",
    "family"
  ],
  "gross_income": 42652003,
  "max_screens": 2870,
  "mc_avg_user_score": 6.1,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Max",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 21,
  "mc_pro_critic_reviews": [
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Max is a throwback of sorts - a movie about the relationship between a boy and his dog. Lassie springs to mind as the genre classic, but this has a closer kinship to Rin Tin Tin. Although its sensibilities are old-fashioned, the movie offers a modern look and feel."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "The handsome and appealing Max, by the way, is played by five dogs. For the record, he is a Belgian Malinois, a breed that in real life is often used in police and military work."
    },
    {
      "critic": "Katie Walsh",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 70,
      "summary": "Max is a big slice of patriotic, down-the-middle genre fare, but it manages to work — and jerk a few tears along the way."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 70,
      "summary": "This fine and welcome piece of family entertainment, directed by Boaz Yakin from a script he wrote with Sheldon Lettich, gets to a sweet spot by way of a smart premise, patriotic undertones and a coming-of-age story that’s downright stirring."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "Despite the overplaying, Max gets its job done, which is to celebrate the sacrifices of military dogs, while warming the cockles of your heart."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "In its last act, Max is reminiscent of Rin Tin Tin and Lassie serials, with a frosting of freshly minted multiculturalism."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "When the movie morphs from a story of mutual healing into a crime-fighting caper, it goes off track."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "The heart of Max is a boy learning about an always faithful dog, and as sentimental and manipulative as their bonding moments are, that’s what works."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2015
      },
      "score": 60,
      "summary": "The truly effective emotional arc is handed to the furry member of the cast."
    },
    {
      "critic": "Danny King",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "It's another modest, functional success from a director who used to work on the margins."
    },
    {
      "critic": "Molly Eichel",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "When the films sticks with heart-tugging soldier stuff, it's not bad. When it goes beyond that premise, it becomes so entirely outlandish that it's not enjoyable anymore."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Instead of building upon the welcome openness of that potentially healing father-son encounter, Max  stumbles through some iffy crime-thriller territory and ends up pushing its PG rating to its limit."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "As the intrepid kids and the fearless hound unravel a nefarious weapons-dealing scheme, Max finds its sweet spot, leaving behind its overwrought patriotic swagger and settling into the kind of story that would fill a decent hour of television."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "These promising themes aren’t given much more than surface treatment, making for a movie as conveniently tidy as some coming-home schmaltz on basic cable."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "It's the Walmart of feel-good family films: accessible, cheaply made, useful in a pinch and full of American flags."
    },
    {
      "critic": "John Hazelton",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Max is a genial if somewhat old-fashioned tale that’s too clunky to transcend its genre(s) but effective enough within its own limited emotional range."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 45,
      "summary": "None of these plot points are run through with any thoughtfulness or panache. Despite a great, unaffected performance by Wiggins — the only one among the cast — and the primal joy of seeing the dog actors sprinting, leaping and maybe even emoting, the film is sunk because the characters never transcend their seeming origins in a Disney Channel movie project."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2015
      },
      "score": 42,
      "summary": "It is dull and weird — weird in that way that it is pronounced we-ee-eird, the stretched vowel signaling a weirdness that is probably unconscious on the part of the filmmakers."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2015
      },
      "score": 40,
      "summary": "This is a busy, moderately entertaining slice of family-friendly fluff. It’s flatly directed and functionally acted."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "There’s a touching story here about a boy getting over his grief and narcissism by nursing a dog through its own set of traumas, but Max is far too gung-ho about playing up the pup’s heroism and self-sacrifice to give it much time to develop."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "The screenplay muddles its emotional core with a clunky cross between old-fashioned Hardy Boys mystery and a far-fetched weapons-trafficking subplot."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "It’s too bad the film doesn’t provide a better sense of what makes the Belgian Malinois so uniquely suited to the battlefield, or find a way to pay more than lip service to the deep bonds developed between military men and animals."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 38,
      "summary": "It hits its Red State beats so hard that its target audience likely won't notice they're being not only condescended to, but insulted outright."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2015
      },
      "score": 38,
      "summary": "Director Boaz Yakin (“Remember the Titans”) indulges in an awful lot of gunplay for a PG-rated family film, but sure knows how to stage a dirt-bike race. The Belgian malinoises who play Max way out-act the humans."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 20,
      "summary": "Dullness, as well as hoary preachiness, neuters the family-and-their-war-dog drama Max."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "The movie I think is a bit underrated because it had a lot more action and serious tones then a regular dog movie.Also the characters are lovable and your at the edge of your seat.",
      "total_reactions": 2,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "I thought Max is a great movie from the start. It's decent and it looks nice for a movie about a military dog. Despite the bad reviews this movie's getting, it's still as decent as ever.",
      "total_reactions": 2,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "It's predictable, it's cliched the film Max is powerful uplifting film that reinforce the cliches. No this not a Nicholas Sparks adaptation it does feel like that at times, but's its not which gives the film points. Writers Boaz Yakin, Sheldon Lettich make it look like if Nicholas Sparks wrote a story about a marine and his dog also a relationship between the marine's little brother and the dog. The film starts in Kandahar, where marine Kyle Wincott (Robbie Amell) and his dog Max  are looking for illegal weapons and explosives. Their are headed to a great start in the mission, Kyle skypes home and has a chat with his mom Pamela,  (Lauren Graham) and dad Ray (Thomas Haden Church). His little teenage brother, Justin (Josh Wiggins)  can't be bothered with because he's super addicted to his video games, he doesn't not want to converse long enough with Kyle. He also makes some money by pirating software and selling copies to the local gang leader. It's just a regular day in June, the Wincotts get visited by a military family. Kyle is dead and Max is suffering PTSD and is soon to be put down. The Wincotts agree to take care of Max, after Max shows some unmistakable affinity for Max. Max learns to be comfortable with his surroundings around people, Justin gains appreciation for his responsibility and starts to like Max.That starts to change when Kyle's friend Tyler (Luke Kleintank) shows up. The film's wants to go in it's careless direction and does not care if it's cliche'd or predictable. Some of the characters are so cardboard cut out, some of them actually have good character writing, the actors do a pretty good job despite what they have to deal with. Since the film is directed by Boaz Yakin who directed the best sport and drama film \"Remember The Titans\"  and produced by Karen Rosenfelt the producer of \"Marley & Me\" if those films combined in two one you get Max. It's a cornball movie but it's not that terrible, it's very powerful and you care for the characters, now the film has major problems besides the cliche'd story, my problem with the movie is Carmen's (Mia Xitlali) cousin Chuy played by Dejon LaQuake, his character was so annoying and was not funny, his purpose as the character was only to be comedic, but the film's funny way of showing his humor is by acting like a stereotypical Mexican. Grade B",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "It is predictable,only one time did something happen I didn't expect is when one of the characters who seems fine ends up being someone completely different,other then that it follows a set course.However the powerful  message seems to smooth out its edges and provide a strong core.No it isn't the next big blockbuster but I believe it achieved what it set out to do.To create a good uplifting movie for the family.",
      "total_reactions": 1,
      "user": "LordExarus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Not just a movie with an animal, but an animal war hero.  What could go wrong?  Well, Hollywood does have to make it fit their formula so they make one of the fellow soldiers a bad guy so we can root for Max to get him.  It was a great story with just the little brother trying to help Max readjust to civilian life, just like humans returning from war, and his relationship with the other youngsters in the neighborhood.  Guess Hollywood thought having a little edge to the movie would make it sell better.",
      "total_reactions": 1,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Max is an amazing, powerful family film that I would like to watch again. The dog was great, and the movie just had emotions. It had a powerful message and I felt like kids will also enjoy it.",
      "total_reactions": 6,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This is a great family movie and shows how in real life you face challenges and you should always be honest with your family regardless! Great story and Very enjoyable and Go Max!!",
      "total_reactions": 3,
      "user": "see_franka"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Max is one of those movies that leaves you wanting your time and money back. It is very disappointing, when I saw the trailer, Max looked like a cute, warm and sad film that I could enjoy with my family. Well, I took them last night for a get together, we loaded up on our snacks and popcorn. And then it started. In the hot, humid, sticky theatre, we watched an uncomfortable film and sat there wondering how we could have spent that 60 dollars and 2 hours of our lives. I asked my family about it, they said that the dog was the only good part about it. Wow, the movie is poorly written and directed, with horrible tear jerking moments. Max is really bad, like Aloha and San Andreas are more enjoyable. Ignore, please ignore.",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "If I had known this movie was about gun running to Mexico, with children and dogs being chased by bad men with guns, as a subplot to a Disney channel style movie I would not have taken my twin 10 year old daughters to see it.  It seemed to be a PG-13 movie awkwardly (and poorly) fit into PG movie.  Any attempt at a message or moral was completely lost on my children.",
      "total_reactions": 4,
      "user": "bob516"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "Neither your regular dog movie nor an inspiring theme yet worth it a watch.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "With its glorious PG rating, Max fails immensely to depict the real life story and tragedy of a dog and a family, thus turning out to be a ridiculously tame film populated with annoying characters and wooden acting.",
      "total_reactions": 1,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "Max is not as heartbreaking as a lot of animal films out there, I think the average person can get through this film without crying. Max promotes some good subject matter from the outset but the film is quickly changed into a fairly typical family feature film. I did enjoy this movie, but you are really not going to be floored by its story. I enjoyed the acting in the film Thomas Hayden Church and Josh Wiggins were both great in this movie and the Dog certainly did an outstanding job delivering some fairly entertaining stunts at points. I like the thought of incorporating the marines into the film but sadly Max is hardly a marine for long and it becomes another story of a boy and his dog. Then it takes away from the bond between the boy and his dog for a sometimes ridiculous crime story. I think there are certainly some things to be enjoyed about Max and it can be a good watch for a family but it really shouldn't turn any heads.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "Honestly, Max is a silly bore from start to finish. Even kids will find themselves asking when the movie ends. A waste of time and money. Max is a disgrace to film making itself.",
      "total_reactions": 1,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 4,
      "text": "Perhaps if there were more advertising as to what this movie is actually about, it would have been more enjoyable for me. Unfortunately, Max is a film that takes every single American family movie stereotype and blasts it into an unwatchable disaster. The film struggles to find what it wants to show as the plot and moves all over the place. None of the characters develop in any way worth mentioning. However if you have a kid who can only comprehend basic English and likes \"doggies\" then this movie is perfect for that child.",
      "total_reactions": 1,
      "user": "willm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Not even Max himself can save this movie.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "I had no idea what I was getting into when I started watching. The story sucked me right in - very beautifully done.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "I'm not going to praise this movie on its critical acclaims (of which there are few, lets be honest). It's a B-grade run of has-been actors with the exception of Jay Hernandez whose involvement may as well have been a cameo.",
      "total_reactions": 0,
      "user": "Yankee6X"
    }
  ],
  "metascore": 47,
  "name": "Max",
  "num_weekends": 13,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 26,
    "month": 6,
    "year": 2015
  },
  "opening_weekend_income": 12155254,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 20657,
  "rating_freq": {
    "1": 497,
    "10": 3507,
    "2": 228,
    "3": 384,
    "4": 747,
    "5": 1703,
    "6": 3476,
    "7": 5258,
    "8": 3282,
    "9": 1575
  },
  "release_day": 26,
  "release_month": "June",
  "release_year": 2015,
  "user_review_count": 89,
  "votes_per_demo": {
    "aged_18-29": 7064,
    "aged_30-44": 5823,
    "aged_45+": 2088,
    "aged_under_18": 187,
    "females": 4059,
    "females_aged_18-29": 1975,
    "females_aged_30-44": 1152,
    "females_aged_45+": 479,
    "females_under_18": 69,
    "imdb_staff": 3,
    "imdb_users": 20657,
    "males": 12148,
    "males_aged_18-29": 5023,
    "males_aged_30-44": 4610,
    "males_aged_45+": 1586,
    "males_under_18": 115,
    "non-us_users": 7812,
    "top_1000_voters": 170,
    "us_users": 3414
  },
  "year": 2015
}