{
  "avg_rating_per_demo": {
    "aged_18-29": 4.2,
    "aged_30-44": 4.5,
    "aged_45+": 4.5,
    "aged_under_18": 3.7,
    "females": 4.1,
    "females_aged_18-29": 4.1,
    "females_aged_30-44": 4.2,
    "females_aged_45+": 4.2,
    "females_under_18": 5.4,
    "imdb_staff": 2.6,
    "imdb_users": 4.3,
    "males": 4.4,
    "males_aged_18-29": 4.2,
    "males_aged_30-44": 4.5,
    "males_aged_45+": 4.5,
    "males_under_18": 3.3,
    "non-us_users": 4.4,
    "top_1000_voters": 3.9,
    "us_users": 4.1
  },
  "avg_screens": 708.4285714285714,
  "budget": 6000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 3,
    "year": 2013
  },
  "critic_review_count": 181,
  "duration": 94,
  "genres": [
    "comedy",
    "romance"
  ],
  "gross_income": 8828771,
  "max_screens": 2023,
  "mc_avg_user_score": 3.1,
  "mc_metascore": 18,
  "mc_mixed_rating_frequency": 43,
  "mc_movie_name": "Movie 43",
  "mc_negative_rating_frequency": 250,
  "mc_positive_rating_frequency": 83,
  "mc_pro_critic_reviews": [
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 88,
      "summary": "Movie 43 is a near masterpiece of tastelessness. The anthology of 12 short, interconnected skits elevates the art form of gross-out comedy to a new height."
    },
    {
      "critic": "Maane Khatchatourian",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 58,
      "summary": "At its best, Movie 43 resembles a risqué episode of Saturday Night Live - a comparison reinforced by the presence of both parody ads and Jason Sudeikis. At its worst? Let's just say that Hugh Jackman fans who want to remember the actor as Jean Valjean and not as a guy with a scrotum sprouting from his neck should make alternate plans this weekend."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "An oddity recommended for only the most fervent, undemanding comedy junkies."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Movie 43 is sketchy, in every sense. It's a collection of short comedy films in the manner of the 70s cult classic \"Kentucky Fried Movie,\" each with a separate director, in which many very famous actors have been persuaded to take part."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "It's the kind of thing you feel you should laugh at through a phlegmy, hacking cough-and it does get laughs, if inconsistently, predictable given the circumstances of production."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "The line between gross-out humor that's inspired and the kind that's witless is fine indeed, and Movie 43 obliterates it with poop and movie stars."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "About a third of the short films land a few laughs. But even the weakest material is lifted by the actors."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "In Movie 43's better-suited afterlife in the home-entertainment market, those sort of quandaries can be hashed out between bong rips and bags of Cheetos."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "How many directors does it take to screw in a star-studded piece of aggressive stupidity and call it a movie? An even dozen, and there is no punch line."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "The kindest thing to be said of Movie 43, a star-saturated collection of crude one-joke vignettes made with big-time directors, is that most of the participants seem to relish being naughty."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2013
      },
      "score": 20,
      "summary": "After watching Peter Farrelly’s Movie 43, I was immediately overcome with a sudden rush of emotion: not amusement, anger or even mild irritation, but a profound and faintly tragic sense of pity."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "As sick-making sketch comedies go, this stupefyingly bad one-somehow rife with A-list talent-must rank near the very bottom."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Just no."
    },
    {
      "critic": "Josh Winning",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "Quite why A-listers Kate Winslet, Hugh Jackman and Emma Stone (among others) aligned themselves with this excruciatingly moronic compilation of shorts is anybody's guess."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 16,
      "summary": "The sketches aren't united by a half-ignored framing device, so much as by an enduring fascination with bodily functions. Movie 43 is the most star-studded collection of jokes involving menstruation, flatulence, incest, bestiality, Snooki, and nutsacks ever assembled, but the stars don't elevate the material-they just descend to its level."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "An epically miserable viewing experience, go ahead and skip this one unless you’re seeking to answer the riddle of what happens when people don’t try at their jobs."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "An appalling misfire that tries and fails to evoke the anything-goes spirit of such '70s sketch-comedy concoctions as \"The Groove Tube\" and \"Kentucky Fried Movie.\""
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "It's rare to see a piece of sh** that actually looks and sounds like a piece of sh**. It's kind of exciting!"
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "Despite the filmmakers' desperate attempts to scandalize us, the only real shock is that a movie this disastrous ever managed to get made."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "There's camp-fun bad and interestingly horrible bad, and then there's just awful. Movie 43 is the \"Citizen Kane\" of awful."
    },
    {
      "critic": "Tina Hassannia",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "This is barely a movie at all, mostly due to its structural similarities to \"SNL\", but also because it acknowledges the fact that its own premises are inherently unfilmable."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "If you mashed-up the worst parts of the infamous \"Howard the Duck,'' \"Gigli,'' \"Ishtar'' and every other awful movie I've seen since I started reviewing professionally in 1981, it wouldn't begin to approach the sheer soul-sucking badness of the cringe-inducing Movie 43."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "Despite the dizzying array of talent involved both in front of and behind the camera, this godawful exercise is so painfully unfunny, so screamingly bad that it immediately qualifies as one of the worst films of all time."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Misleading trailer. I watched it primarily to see Stephen Merchant acting but I also thought it had some kind of story. There was a stupid back story with no real plot. The movie is basically a compilation of stupid, unfunny clips.  Movie 43 is possibly the worst movie I've ever seen. If you enjoy stupid movies like Epic Movie for example, this is for you. If not, don't waste your money!",
      "total_reactions": 20,
      "user": "Benmcm9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "DO NOT, UNDER ANY CIRCUMSTANCES, WATCH THIS PILE OF HORSES**T!",
      "total_reactions": 4,
      "user": "mickelwick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "I hope that Scary Movie 5 is paying attention right now because what are they thinking? A spoof movie filled with A-list actors and a slew of directors like my idol, James Gunn? Are they serious? I think Hollywood needs to put an end to the crappy spoof genre. Valentine's Day and New Year's Eve have some great cast (don't listen to the haters), but as a fan of the Scary Movie series this whole Movie 43 is not just beyond bad, it's one of the worst movies of the year. I saw the trailer and it was terrible, it just lasted for a half an hour. Hollywood loves crap! Fans can skip the movie and watch the Super Bowl.",
      "total_reactions": 3,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "This is definitely an interesting take on a film with all of the different \"stories\" throughout the film and with such a great cast the film really had potential; I was really looking forward to being more surprised. Unfortunately the film really tried to be funny but it was wasted on fart humor and low brow silliness. I'll be the first to admit I love random hilarity but this film just didn't deliver. You could tell the cast really tried but i'd say in this case the writers may as well have dunked the script in the toilet because that's exactly the type of \"humor\" this movie portrays. Potty humor and disappointment.",
      "total_reactions": 3,
      "user": "LTHFTW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "Wow. Just wow. This movie was horrible. I feel sick to my stomach even giving this movie a 2 out of 10, because I know that anyone in their right mind should never be forced to see this movie unless it is through some form of torture. I would give it a 0, but I would be lying if I said I didn't laugh at least twice during the movie. That is it. I laughed twice. This movie is garbage, stay far away.",
      "total_reactions": 2,
      "user": "TogetherLemon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "The truth of the matter is, many artists and performers have indeed sold their souls to the devil in order to achieve greatness    Movie 43 is what happens when the devil eventually collects.",
      "total_reactions": 2,
      "user": "Augustus75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "Don't even bother to watch Movie 43. It's the most stupidest comedy ever made in 2013's history. If you want to watch a boring, stupid net comedy movie you can watch sketches on youtube! But this film carries you in to waste you money on something you can watch free on youtube! The only \"meh\" sketch was at the end but this film is overall stupid. Avoid this movie while you still can. 0/10",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Watch the trailer. Those are all the funny parts in the movie.",
      "total_reactions": 2,
      "user": "Vorch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Movie 43 is more than stupid, it is moronic silly and dumb with no story but lots of wasted talents, it is disgusting and distasteful. Not one segment is remarkable or even enjoyable, they are all yuk, low and dirty with uninteresting stories that don't lead to anything nor are connected to each other.",
      "total_reactions": 2,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "So bad I thought I might have endless nightmares of this pitiful pointless movie. Am I allowed to call it a movie because it was more like a toilet bowl. These actors should be flushed.",
      "total_reactions": 2,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "I laughed more in the 2 minute trailer for Kick-Ass 2 than I did in 90 minutes of Movie 43. Every joke is about poo, wee, farts, sex, vomit, periods and even more farts. Thank god Christopher Mintz Plasse and Chloe Moretz were in their to provide about 3 laughs.",
      "total_reactions": 2,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "Is Movie 43 the worst film ever made? Probably, I know it's definitely the worst film I've ever seen so I wouldn't be surprised. Honestly, I couldn't even make it past the 1-hour mark before I had to stop watching, and I rarely get so tired of a movie that I have to stop. The movie essentially centers around Dennis Quaid's character trying to get his movie purchased from a studio, by any means necessary. Well this \"movie\" is less of a movie and more of a bunch of skits, horrible skits, that feature endless stupidity and minimal, if any, laughter. Honestly, I feel like they should've paid me to watch this movie and I watched it for free. I truly feel sorry for anyone who watched this in theaters. They should steal awards from any actor who appeared in this film. Just pathetic.",
      "total_reactions": 2,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "I really don't know what's more disturbing, the amount of good actors, and major stars, that agreed to star on this abomination of a movie, or what this movie considers funny, which is just gross, and I don't even want to describe it for your sake.",
      "total_reactions": 2,
      "user": "Leo9127"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "I don't feel like I watch the movie so much as I was assaulted by it. If I could find a way to have the police bring a film up on charges of battery I would. Alas, if Andy Warhol can call a painting of a soup can art, then yes Hollywood can call this a work of cinema. This film walks the excruciatingly thin line between gibberish and coherent communication. Honestly, if all of those A-List performers simply got naked and make barking sounds for two hours, that would have been more artful than this pile of nothing. Sadly, though, I am not a studio executive or film director, so I will sit here $10 poorer for having been victim to this criminal enterprise.",
      "total_reactions": 1,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "I didn't love it, but I laughed a lot, so I guess the movie served it's purpose. The opening sketch with Kate Winslet and Hugh Jackman was the best one in my opinion and set the tone for what to expect beautifully. It was a joy to watch some of the high calibre actors to use their talent for this",
      "total_reactions": 1,
      "user": "Wildthyme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "Just bad! With such amazing actors you would expect so much more. The film is pretty much a long sketch show but the plot for the reasoning of the sketches is badly thought out, stupid and badly acted. Each sketch has promising concepts and starts out relatively funny but then degenerates into unnecessary grossness which ultimately is unfunny. Granted there are some funny moments but would not recommend especially if you cringe easily or are squeamish.",
      "total_reactions": 1,
      "user": "Filmis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "I literally can't express to you how misleading this movie was. I have to give credit to the trailer creators because they are the only reason this film made any money. Go watch the trailer of the movie and then you have watched the best parts of the movie. It doesn't get any better it just drops off a cliff. I am a huge fan for immature, boundary pushing comedy but this just takes it too far. I'll spare you the details just promise the planet that you will avoid this movie at all costs!",
      "total_reactions": 1,
      "user": "HeavyLead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Why would these stars do this filth?  This film is trashy, unfunny, and if it wasn't for Texas Chainsaw this would be the worst film of 2013.  None of the skits are funny and this film should never be seen.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "This is a horribly made, stupid, uneven and beyond a WTF-fest. Every joke is completely immature and inane, completely relying on \"offensive\" jokes. It's one of the stupidest movies I've ever seen but I giggled once (I'll get into that later) but I felt like my IQ dropped 100 points afterwards. It's not necessarily due to the raunchy humor, (though that was a factor) but mostly how the entire film was witless and relied on childish jokes involving feces, bodily fluids, language and mild bestiality and incest. Some sketches were just horrendous and some were just awful. (Which one is worse? Exactly.) These are all DISGUSTING, crude, and void of any wit at all. I can laugh at crude; 21 Jump Street, Ted, and This is the End made me cry with laughter, but these are the worst things I have ever had to endure.",
      "total_reactions": 1,
      "user": "MattCipolla926"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "Just because it has a lot of famous stars it doesn't mean that it is a good film.",
      "total_reactions": 1,
      "user": "Lord0r"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Just pure  This movie has none redeemable quality to it: the actors are really bad (and I love almost all of them in other movies) and the story is god-awful and non-existent. I know this movie was made to make a horrible movie, they admit it in the movie itself. They just succeded too much.",
      "total_reactions": 1,
      "user": "KratosITALY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "I'm ashamed to admit I chuckled a few times, but largely, I just laughed at the fact that this was made. Someone out there thought this was a good idea and managed to get A-List actors involved. While it is horrible, it should be seen by anyone in the mood to watch something awful.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "I didn't originally know this was a movie told through sketches, but now that I do, I also know this movie is terrible. There are one or two funny sketches but the rest of the movie is a huge waste of time and an embarrassment.",
      "total_reactions": 1,
      "user": "MattG_123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "I am infertile because of this film. I'm ashamed to see people like Emma Stone, Kate Winslet and Hugh Jackman in this film. I made it about an hour and fifteen minutes into this film before finally surrendering. Upset because of this film.",
      "total_reactions": 1,
      "user": "MusiclyMade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "I am so suprised by how a movie with so many of my favorite actors could be so bad. I went into it knowing all the bad reviews and everyone hating it and it was still below my expectations! The only skit i liked in the entire movie was the Emma Stone and Kieran Culkin bit. The superhero one also had its moments but still not good.",
      "total_reactions": 1,
      "user": "Longo12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "Movie 43 seemed like an interesting film. It has all of these actors in it. Surely it must be good? Well, that depends on your sense of humour I guess; and your age as well. Movie 43 in a nutshell is full of immature jokes and scenarios that a 12 year old would find funny. I'll admit, I found some of it a little bit funny myself, and found the overall concept of the film interesting, trying to find 'Movie 43', but just end up watching one weird short scenario after the next.",
      "total_reactions": 1,
      "user": "Dalek"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "I enjoy sketch comedies.  I really do.  WKUK is one of my favorites shows of the past decade.  So, I went into Movie 43 with higher than average expectations; that was a bad idea.  The huge cast list of A-listers is probably the only reason the movie will sell well.  In WKUK, the humor is at times low-brow, but also had a consistently dark and sophisticated undertone, and was actually funny.  Here, the only humor derives from the idea that big names like these would involve themselves in garbage like this.  WKUK did better most to all of the premises to the sketches in this movie, and they do it with a cast of nobodies.  I laughed initially at the Hugh Jackman scene (already done better by WKUK, also with the period scene and basically every other scene in the movie), but that initial punchline was supposed to keep me laughing for 10 minutes?  Really?  That's the problem:  any hint of a punchline is either surrounded by truly awful and unfunny 7th grade humor, or is extrapolated to the point of taking back the laugh you may have had at the beginning of the scene.  Save your money, watch a season of WKUK and actually laugh.",
      "total_reactions": 7,
      "user": "yankeesniper57"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "DO NOT WASTE YOUR MONEY!!",
      "total_reactions": 5,
      "user": "rjb123"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "I know what you're thinking when you look at the bad reviews. \"All funny movies get bad reviews, even if they are hilarious\". This movie was honestly a disappointment. It's definitely is NOT worth you're money to see it in theaters, unless you have nothing else better to do. Don't get me wrong, it had its laugh-out-loud moments here and there, but nothing of what I expected. A lot of it was just stupid, and not in that stupid-funny way either. It was more stupid and dumb than funny. If you're up for it, go ahead and see it in theaters, but be prepared to feel like your money was wasted.",
      "total_reactions": 13,
      "user": "GatorZero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "it was an alright movie but do not take it serously it is bascially a bunch of short sketches pilled into one movie i will admit it was entertaining and it had some funny sketches i like the halle berry truth or dare and the leprechaun one 6/10",
      "total_reactions": 8,
      "user": "cool1707"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "It challenges for the worst thing I have ever seen.",
      "total_reactions": 9,
      "user": "sf49er"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Yet again -  America, that great land of comedy (not), tries to be funny but in the end only lands up being spectacularly stupid - as usual. Scrotums growing out of peoples neck? If that is the level that passes off as high comedy these days then perhaps Hollywood should close its doors to comedies all together since they don't have the wit of the French nor the dryness of the Brits and pushing this kind of crap out into international territories only end's up reinforcing the sterotype that the Americans are only good for guns and morons.",
      "total_reactions": 3,
      "user": "Stefarooh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "One of the worst movies I've ever seen.",
      "total_reactions": 5,
      "user": "mmmpepsi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "It's supposed to be a comedy, but it will make you angry. It shouldn't be compared to SNL, it shouldn't be compared to nothing. It makes you wonder how people can put such a piece of garbage into theaters.",
      "total_reactions": 2,
      "user": "CassioSanfelice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "The concept behind Movie 43, in which a crazy screenwriter pitches terrible movie ideas at an increasingly confused and agitated movie producer, is potentially a good one. Unfortunately the execution is almost universally awful.",
      "total_reactions": 2,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "The film is basically a dirty, raunchy episode of SNL.  Each sketch is one simple idea stretched to it's grossest capacity.  Many viewers will be unsatisfied with this, but rating the movie 0 is just absurd.  There's no way this film is as bad as 'Jack and Jill' or 'Biodome.'  The question of every comedy is not whether or not it's high brow - it's whether people laugh.  I saw this film in a small art/independent theatre and guess what - people laughed.  Intelligent people may be embarrassed that they laughed, but they did.",
      "total_reactions": 21,
      "user": "123jimbly"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "I give this an 8 not because this movie is one of the best movies of the year, but because this movie is something you would have never seen in your life unless you watch it. Yes, it slaps you in the face, as offensive as it is. It challenges your thoughts and opinions on different aspects of society. Of course it's mostly far fetched and exaggerated, but it is what it is. To most people it's just going to waste their time, but for those of you looking for something way beyond \"normal\", watch Movie 43, it will demonstrate the limitless capacity of human ideas.",
      "total_reactions": 21,
      "user": "VivaMexico4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Warning! If you watch it. It's very offensive and stereo type.But if you watch open minded, you will laugh.",
      "total_reactions": 4,
      "user": "Tvtrek"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Look this film is stupid. It's a stupid film, and obviously if you judge it by regular film standards then it's terrible. However, it is still hilarious. You have to go in with the right mindset, and only then can you enjoy it's gross humour. Even though at some points I was very much laughing so much I was falling on the floor, this film does have a lot more misses than hits. But worth watching if you are into that kind of humour, like Family Guy, Southpark, Jackass.",
      "total_reactions": 11,
      "user": "Miro11"
    },
    {
      "neg_reactions": 47,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Movie 43... what can I say? I have NO IDEA why this is getting such bad reviews. Obviously the reviewers didn't see who stars in it. Em, Wolverine?? He's in the Oscars for next week. Kate Winslet. She's in loads of good movies. Uma Thurman anyone?? She Killed Bill. TWICE!! Anyway, not only are all these amazing stars in it, they also have a good laugh at themselves. I don't see any reviewers doing that. It might be about poos, wees and spunk but who doesn't love that?? The mind boggles. See this amazing movie. See it twice. No, see it 43 times!! I can't wait to see it.",
      "total_reactions": 56,
      "user": "SHANKROID"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Movie 43 just offended the sensibilities of every fart smelling critic and Eddie Murphy loving user on the Interbutt.  The current movie goer just can't comprehend Hugh Jackman with a scrotum chin.  And Halle Berry making guacamole with her boobs is simply beyond the average mouth breather. A cartoon cat sobbing shamefully as he masturbates to his master with a hairbrush is just something the world isn't ready for.  But to those who loved Movie 43 I say: EXCELSIOR!",
      "total_reactions": 8,
      "user": "BlaqkSocity"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "The plot of the movie is painful, but the comedy and the cast are spectacular. The bad thing about the movie is that it is very short but it makes you spend a very good time. Movie recommended for adolescents.",
      "total_reactions": 9,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Mostly funny and can of predictable but the writing was amazing.",
      "total_reactions": 17,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "I think this film succeeds in what it wants to be, which is awful.  It's an ugly satire of the movie industry, and it's really not that far off.  For the audience, who has been abused like this countless times, it's a hard rub.  The irony isn't meant for the audience, it's meant to mock Hollywood studio execs and the crap they shovel out.  The audience still gets the raw deal.  Instead of watching ill-conceived crap, we are watching intentionally conceived crap.  I understand the intent of this movie, but it sorta backfired by abusing it's audience and instead of sending an FU to Hollywood comes off as an FU to the viewer.",
      "total_reactions": 1,
      "user": "czerro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "This wasn't necessarily a good film, and a lot of the jokes were hit  miss, but it was funny and certainly got laughs out of me and most of the audience I saw it with. A group of short stories thrown together with a list of our favourite actors playing the roles was a rather interesting concept; and it worked well in some of the skits and not so well in others. I personally found Halle Berry's the best, Gerard Butler's the worst. Overall it's funny but its obvious why it didn't please everyone.",
      "total_reactions": 2,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "movie 43 nos ofrece un banquete de celebridades haciendo bobadas graciosas  pero lo que termina acabando con esta película es que no ay una razón justificable para verla amenos de que te hallan  plantado en una cita y necesitas entretenerte",
      "total_reactions": 3,
      "user": "diego9901"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Movie 43; it might be the worst movie you'll ever see, or the best.",
      "total_reactions": 1,
      "user": "Giulio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Oh, yes, this is a horrible spectacle and movie. Tasteless to the max and random.",
      "total_reactions": 1,
      "user": "TG0211"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Movie 43 is a ridiculous anthology of 12 mini stories that present only stupidity. But that freaking stupidity makes you laugh a lot. Some stories were stupid and unfunny but some other are really funny and make you laugh out loud. It is not a quality comedy but it is something to spend the time and I criticise a comedy as a comedy, meaning how much i laughed etc. I laughed in that film in some parts and it has its moments. But there was no point of making that film and that's a minus. I didn't really understand why great actors were in that film like Hugh Jackman, Halle  Berry  and Richard Gere. I though they were humiliating theimselves. Despite those two things movie 43 will make you laugh a lot but you will regret watching it as it doesn't show anything spectacular or special.",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "How does this get such bad reviews? It's hilarious! And the fact that its filled with celebrities, how don't you like it? It's very inappropriate, but still...",
      "total_reactions": 1,
      "user": "BWETMatangi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "It's a movie to have fun with friends. It's funny, and I don't understand why critics say that it's very bad. It's good. My opinion: Do not listen to anyone and watch it!!!",
      "total_reactions": 1,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Vulgar, offensive, and disgusting humor is at the center of this comedy that features a large and talented cast of actors starring in various short sketches. I am more than a little ashamed to say that I found this hilarious. Watching these talented, big-named actors star in some of the weirdest, immature, and outrageous skits makes it even more enjoyable. It's gross-out humor at its finest, and if you've got a vulgar and immature sense of humor than you will love this. It's not smart, it's not appropriate, but it is very funny. Maybe I'm just immature and rude but this movie made me laugh-out-loud numerous times. So in my book it's a winner.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "I was laughing the whole time. It was good to see well known actors letting them selves show there funny side. most of them would never star in a comedy. good movie for laughs not for serious viewing. If your seriously reviewing this move of award winning roles then your nuts",
      "total_reactions": 1,
      "user": "funnies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "do you know the end scenes on the hangover movies, where Stu always makes something hilarious that you just cant stop laughing? be it the tooth scene, the face tattoo or the epic breast implants scene?",
      "total_reactions": 1,
      "user": "lordslayer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "I have no idea what any of the people who negatively reviewed the movie were expecting. Of course it's tasteless and vulgar. The previews told you that was the case.",
      "total_reactions": 1,
      "user": "brimokemp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "The movie is not as bad, as the critics are making it out to be. Its a serious a short comedy bits, and made into one movie. some of the stuff is funny!",
      "total_reactions": 1,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "he poor reviews are really annoying me. I'm all for \"everyone has the right to their own opinion\", but I do think people have been very unfair to this movie. It's actually a very funny watch, featuring very risqué performances from A-list actors and even Oscar-winners. Halle Berry is without a doubt the most shocking (and equally hilarious) cast member as she truly shines in her 'Truth or Dare' segment with Stephen Merchant. Emma Stone, Kate Winslet, Naomi Watts, Gerard Butler and Elizabeth Banks give incredibly funny performances, Butler in particular had me crying. The comedy is silly, but I've seen much, much worse. Movie 43 is silly within reason, it's not slapstick, it's just a funny and I wish people hadn't so quick to call it the worst movie ever made.",
      "total_reactions": 4,
      "user": "phensh23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Ok, most of the people and the critics don't know what they're saying! this movie was all around hilarious! I'm really getting sick and tired of people rewarding garbage over pure movie gold (the great gatsby, all those other boring and overrated movies) the only bad thing(s) about movie 43 is that the comedy sketches were a bit short and and watching the non-comedy bits was also a bit stail but a good offensive, comedy movie to watch",
      "total_reactions": 1,
      "user": "AGK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Insanely funny parody movie.  If you're one of the ever increasing number of Americans who are appalled or offended by everything - you'll hate it most likely.  If you can pull the stick out your ass and drop the pretense - you'll love it.",
      "total_reactions": 1,
      "user": "RecoveryRx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "Retarded comedy for retarded people...Good humor requires intelligence, the people who made this movie, and those who liked it have none.",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "I had zero hopes for this movie before viewing, based on the editor’s opening email to me, “Review Movie 43  apparently one of the worst films of all time. Go on, I dare you.” A dare is a dare of course! Even with my low hopes, my first text when I left the movie was “Well mum, I think I should quit uni and go into script writing if Movie 43 can get made!”.  Three people also walked out of the movie in the first 15 minutes. Movie 43 is a series of 13 short comedy skits framed around a washed up script-writer as he pitches his idea of a movie. Movie 43 is hated by nearly every film critic out there, rightly so, however if you are not easily offended, there are a few laughs. The opening scene of Davis (Hugh Jackman) and Beth (Kate Winslet) on a blind date is enough to satisfy anyone that they could be at a decent movie. When Davis removes his scarf though, to reveal testicles hanging from his chin, you do start to wonder where this movie is going! As it turns out, the movie is mostly downhill. As usual, Anna Faris and Emma Stone were very entertaining in their respective scenes, and an advertisement on how we shouldn’t abuse our day to day machines because it hurts the little children working inside them was funny, but still did not set the bar very high for an ensemble comedy. If there were not so many Hollywood stars, it is doubtful if it Movie 43 would have got general release, but the cast do give it some hope. So long as you are not easily offended, and can enjoy a movie that has no direct point or storyline, then this movie does have a few outrageously disturbing moments you have to see to believe, including discovering what the iBABE is! It does not deserve to be a box office hit though, so illegally stream it or wait until the $1 DVD rentals are out.",
      "total_reactions": 0,
      "user": "josieatcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "Movie 43 is a prime example of a movie that could have been pretty good, but missed that opportunity with plenty of unfunny and just stupid sketches. 2/10- Disaster-piece",
      "total_reactions": 0,
      "user": "Gravelord"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Not the worst movie ever, see Freddy Got Fingered.  However, not worth a single rating point.  Absolutely horrible.  If you pay to see this, even a penny, you will want your money back.",
      "total_reactions": 0,
      "user": "Zarchon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Movie 43 has to be one of the weirdest movies I have ever seen. The movie is made up of many mini comedies of which some are horrible beyond belief and some that are painfully funny. Its a movie that might never be made again for its good and bad",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Movie 43 had a few laughs here and there. Consequently this movie was just an overexposure of extremely disgusting skits. I expected more but what is their to expect in a movie that gives skit by skit like this.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "A movie so banal in it's writing, you would've thought the script was written by a group of 16 year old kids who still laugh at piss, puke, fart, crap and sex jokes. A 90 minute endless barrage of \"aristocrat jokes\" that play off as lame as the last. I wasn't offended, so much as I was insulted. Insulted to think that the Farelly brothers continue to \"push the envelope\" thinking their audience is said 16 year old kid who still laughs when people fart. There is a way to do low brow, and this isn't that way. \"Edgy\" is not created by doing something so off the wall and offensive, it's gotta be funny. Edgy is doing something different, so unique and \"thought provoking\", it's funny. If this movie was trying to be Patton Oswalt, it took a terrible left turn and ended up being a mix between Carrot Top and Dane Cook; telling a 90 minute long Aristocrat joke. *0 out of 5 stars*",
      "total_reactions": 0,
      "user": "joey-clemenza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "It is very crude, and wastes a lot of talents, I have never seen a movie with such a big cast such as Movie 43, it has some laughs, but overall it is very crude, offensive and not for kids to watch at all.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "\"Movie 43 is an utter terrible disgrace and lame excuse to call itself a \"feature film\" this film is so awful you should pay not to see it. All the acting talents are simply wasted on a film that should not have even made it to theaters in the first place.\"  F",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "It would be safe to assume that at least a third of segments in a compilation piece are usually good but Movie 43 defies expectations by providing one dull sequence after another with no stops and absolutely no laughs, its a shameless piece of garbage. Movie 43 isn't really about anything, its loads of little vignettes of comedy scenarios which get pushed to the absolute limits until they aren't funny at all. The film has a huge named cast and each segment has at least one huge name in it but it doesn't matter, it's just now A list actors working with dire material that there is no possible way to improve so they are just high paid actors annoying you by merely being in it. You don't care that its not their fault, you just hate watching this flaccid picture, this completely tone deaf, offensive, insulting and dull film. Movie 43 is directed by multiple people with real credits in actually good film but the direction in this film is awful, in every clip, its so badly constructed and framed that something must have gone wrong in the cinematography department. It's a film that despite its acting pedigree feels cheap, everything about it is cheap and the end result is one of disappointment and outright hatred thanks to some god awful comedy.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "If you think Hugh Jackman sporting a pair of testicles dangling from his chin is funny, I've got some great news for you. The marketing team must have had a hell of a time trying to sell \"Movie 43\" to the general public because it's a comedy that really isn't about anything. It's a series of skits strung together by a barely cohesive narrative. Of course, there have been many skit films before \"Movie 43,\" but this is the first film to be backed by a major studio and to have a litany of A-list actors, actresses, and filmmakers involved.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Movie 43 manages to be funny, but it fails, it doesn't know what it is about, it has no sense or any story, it is a waste of talents, it is silly, outrages and disgusting, nothing is good about it, it is over the top dirtiness and silliness, won't forget that one for a long time.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "After watching this, I had no idea what I just watched. The comedy in this \"movie\" was on par with the comedy as seen in \"Meet The Spartans\", \"Epic Movie\", and \"Date Movie\". It was chalked with d*ck and butt jokes, NONE of which landed. My brain wanted to tell me to like this movie because it had big stars in it, but the writing, direction, and everything else was just God awful. This movie was COMPLETE crap.",
      "total_reactions": 0,
      "user": "Boltfrowah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This has to be, without a doubt, the best dirty comedy movie I have seen.  Some scenes from Jackass 3d made me almost throw up...but this movie is about small skits about taking the awkward situations and turning them dirty.  Perfect for those that just want to relax and watch silly bathroom humor.  It's not for everyone, but people that can laugh at these situations will have a good time.  People complain for the sake of complaining... and this is one movie that is not suppose to be serious... it's to make people laugh.  Job well done.",
      "total_reactions": 0,
      "user": "adam99x"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Movie 43 may be the worst movie this year. It's a comedy that is not funny. Nobody in this movie stands out, it's just a bunch of sketches that don't even relate to one another. That is lazy, if you want to watch comedy sketches, go to YouTube. There was absolutely nothing good in this film. Don't watch it.",
      "total_reactions": 0,
      "user": "Adudewhoreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Its not good. This cinematic mosh pit of unfunny sketch humor that is built into a movie was a waste of money. The only reason I didn't give it a \"0\" rating is because there were a few parts where I did laugh, but other than that, its not good, at all. I only hope that all the stars in this movie aren't badly affected by this piece of s**t. Do better movies guys!",
      "total_reactions": 0,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "this movie is maybe the movie the most horrible i saw of my life .",
      "total_reactions": 0,
      "user": "killian13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "I love most of the cast, and that's what made it even worse. Reduced their reputation to dust.",
      "total_reactions": 0,
      "user": "dannyhodge09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Movie 43 manages to wrangle up some of the biggest names in Hollywood, while also managing to be one of the worst most profoundly idiotic disgusting \"movies\" to come along. A disgrace to the film making industry. It isn't even stupid funny.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "With a cast of over thirty talented actors, you'd think Movie 43 would have some ground to stand on. It doesn't. It crashes and burns, in about that order. It's also one of the worst moveis of 2013.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "The worst movie ever I have ever seen. All stories were totally awkward. i watched the movie because of Hugh Jackman and Kate Winslet but that part was terrible",
      "total_reactions": 0,
      "user": "JoniPak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "A total embarrassment of filmmaking. No sane person can actually find this funny or in the slightest enjoyable. No words can describe how pitiful this is. Pathetic.",
      "total_reactions": 0,
      "user": "ReviewCenter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I think it should be illegal in all countries to watch and rate comedies if you have no sense of humor or if you watch the trailer and don't like it. A review here said: \"I love immature comedy, but this takes it too far\". What are you talking about, immature comedy has no boundaries. If you get easily offended, don't watch comedies! In fact, don't even leave your house, because you might overhear a swear word outside!",
      "total_reactions": 0,
      "user": "paprik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "I mean its just plain bad, but I got a few laughs out of its over the top ridiculous scenarios.  I can't say much good about it though, its so bad...so bad...",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "Oh my God, so many talented cast members decided to waste their time in this sort of **** This is perhaps one of the dullest comedy film I have ever seen. To be honest, I enjoyed the trailer more than the actual movie itself.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "Unfunny garbage made by overrated overpaid hacks, for mouthbreating idiots with a sophomoric and pedestrian sense of humor. Nonstop dick/poop jokes for the masses. Offensive simply for the sake of offensive and appealing only to people who constantly congratulate themselves on not being PC. Unfortunately none of it is actually funny.",
      "total_reactions": 0,
      "user": "FiachSidhe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I give it a ten partly because everybody else is giving it undeservedly low ratings  for no other reason I think other than they are crowd followers. this movie is a series of sketches that are very funny and has huge stars in it, so the only thing I don't like about it are it's bad ratings",
      "total_reactions": 0,
      "user": "Bobbi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Hilarious throughout. Absolutely brilliant stuff from director Bob Odenkirk. Would highly recommend this film to anyone and everyone. Devastated that it wasn't nominated for an Oscar.",
      "total_reactions": 0,
      "user": "joelscully"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "i don't know how to write 150 character for this movie . the movie is really a waste of natural resources and time . actually this movie is \"One of the worst movies I've ever seen\" or even created",
      "total_reactions": 0,
      "user": "new_moon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "This is a funny funny movie. I avoided it like the plague with all the bad reviews but happened to catch it on TV so figured i would give it 10 minutes to see how bad it was. It wasnt. It was funny funny funny. The part with the Mum and Son and the sons' first awkward kiss. That is priceless.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "The very high quality cast makes this movie watchable. It is atrocious and full of cheap jokes that are beyond common sense of humor. It has it's funny moments and the 20min long credits show how **** up this actually was. I don't know what the producers thought when they wrote the script, I mean Hugh Jackman with a scrotum neck, really?",
      "total_reactions": 0,
      "user": "KMPR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "A couple of unfunny directors who have made a lot of awful comedy films come together to make one super-unfunny comedy film. That pretty much covers it.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "AWFUL FILM!!!!!! the performances in this movie were totally awful!!! WORST FILM OF 2013!!!! KEEP UR MONEY FOR A BETTER FILM THAN THIS ****",
      "total_reactions": 0,
      "user": "CiaranMcDaid12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "This movie wont make you laugh. It will make you cry.There's maybe 5 minutes worth of good stuff in the whole thing. I may never understand why there were so many big name stars in it.",
      "total_reactions": 0,
      "user": "Vonathan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "Pure rubbish which somehow managed to attract some of the world's biggest actors. It is just a series of unfunny segments; one after another of illogical sense of humour.",
      "total_reactions": 0,
      "user": "lutfirhamzam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "Now I heard that this was a vulgar movie with lots of dick jokes and such, and many people didn't like it, but I still thought \"Hey, I'm no aesthete, I can laugh at stupid jokes given they're well-made and don't cross the line\". Well, I wish I didn't do that.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "This is perhaps one of the dumbest movies I've ever seen but it is so dumb and stupid that it winds up being entertaining. There are those bad movies like After Earth where I am sitting there bored out of my mind, and then there are the ones where I am pretty engaged for the most part and this film was the latter. This is one of those films that is so bad it is entertaining. Some of the dumb sh*t in this movie is stupid and made me roll my eyes in digust but some of it made me laugh my head off. I feel bad for the celebrities in this film because some of the stuff they do is degrading and embarrasing but thankfully most of them have had better movies since this. Lastly, why was the Beezel skit in there it was dumb and pointless filler to get the film to the 1 hour and 30 minute mark. Now I am worried about. The Guardians of the Galaxy because that movie and the skit are done by the same guy. If you watch this movie you'll get some laughs but they wont' be for the right reasons. This is the worst films of 2013, at least based on what I've seen, but at least it left me laughing.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Not comedic at all. I didn't laugh at all. I didn't chuckle at all. All I did was watch in stupidity for picking Movie 43 as the movie for me to watch.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "What the **** **** is this? Oh my God, this is certainly the worst movie I've ever seen. This movie looks like a joke, but that dull unsightly boring joke that drunk idiots tell on bars. This movie is so **** that I think I am traumatized.",
      "total_reactions": 0,
      "user": "ryandiamandis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "The only thing that's worth of this junk of a film is the cast. Nothing else. This movie is a deep abysmal source of the nothingness that there exists in film-making.",
      "total_reactions": 0,
      "user": "joeyrios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "It's not a joke or something that's even remotely funny.All the skits,and I mean all of them are horrible.No humor whatsoever,just dumb sick jokes that idiots and people with Attention Deficit Disorder will enjoy.Easy to sum up nonetheless,Movie 43 is one of the worst movies ever made!",
      "total_reactions": 0,
      "user": "DenisManu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "Worse then Grown Ups 2, this is the worst comedy movies I have ever seen. It has maybe one laugh out load joke nd that's it. it's a total pile of ****",
      "total_reactions": 0,
      "user": "flametail23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "Terrible movie. Not funny at all. Don't know why, I didn't stop watching it half way through. Cannot believe all these good actors signed up to star in this horrible movie.",
      "total_reactions": 0,
      "user": "zia25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Let's face movie 43 was a huge waste of talent, lacking humor and originality, the film itself was an excuse to present big stars and place them all into one film. I have to admit there were a few chuckles here and there but that's all for the stupidity and risks this film is willing to take, what cinema tragedy.",
      "total_reactions": 0,
      "user": "SushiStoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "This movie is terrible! Kind of amazingly terrible though. I'm still not quite sure why I watched the entire thing. The weird thing was that the acting wasn't bad because the cast was a talented one and for whatever reason they actually tried. There were like one or two funny moments but they do not make up for all of the terrible jokes in this movie.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Despite an A List cast, Movie 43 is a tasteless exercise that feels like a 90 minute collection of rejected Saturday Night Live skits. It tries to intentionally parody itself, yet that fails, and the movie is really a bad parody of that parody. If that makes sense.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "People hate this movie a lot, but honestly it is much better than I expected.  I like SNL, and this is much funnier than SNL and is overall a great movie.  I love most of the actors involved and find this movie absolutely rewatchable.  Great movie if you want to see a bunch of raunchy skits.",
      "total_reactions": 0,
      "user": "greenchc12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "From begining to finish i was like: 0________________________0",
      "total_reactions": 0,
      "user": "idanidan123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Strictly for those who'll laugh at absolutely anything crude or stupid. A train-wreck, what-in- God's- name-were-they-thinking kind of experience. Embarrassing.",
      "total_reactions": 0,
      "user": "Shiftyeyeddog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "Movie 43 has a lot of famous actors and actresses starring in it. It also has a lot of skilled directors directing each piece of the whole combination. What this thing does not have, is the right to call itself a movie.",
      "total_reactions": 0,
      "user": "Tomle1202"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Is Movie 43 that bad? Hell yes! all of these brilliant stars can rise above this crappy not funny material; producer Charles Wessler knows the big stars and decides to crush these actors abilities of fame and talent. Director  Peter Farrelly (who produced the film and directed a segment), who has made funny comedies but decides to waste his talent I don't know how these people can be proud of their work. Positives: the film is funny but 'it's so bad that it's so good' all of these failed sketches (that are mean't for Saturday night live) are really funny and absurd I laugh throughout the film. But don't see this film! it is an atrocity towards cinema. But as a result is funny. Grade C-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "Yeah, it's funny, if you find humor in: feces jokes, a girl getting her period, Halle Berry degrading herself,  Hugh Jackman with a pair of nuts hanging off his neck, and a homosexual cartoon cat jerking off to Josh Duhamel. Well, let me rephrase that, jokes like these can be funny, but a little but of creativity is also required. It's going to take more than just tossing it at the screen people. It amazes me how all these talented people were in this movie. Seriously? Lindsay Lohan made better life choices.",
      "total_reactions": 0,
      "user": "NFW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "My most hated movie of all time, the film is a blundering mess and not one simple thing about this movie was funny, the script sounded like it was written by a brain damaged retarded six-year old obsessed with toilet humor!!",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "So many directors took an immature attempt to create possibly one of the most disgusting movies of 2013 yet. You know once there's too many directors, you know your movie will be bad.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "If you think Hugh Jackman sporting a pair of testicles dangling from his chin is funny, I've got some great news for you. The marketing team must have had a hell of a time trying to sell \"Movie 43\" to the general public because it's a comedy that really isn't about anything. It's a series of skits strung together by a barely cohesive narrative. Of course, there have been many skit films before \"Movie 43,\" but this is the first film to be backed by a major studio and to have a litany of A-list actors, actresses, and filmmakers involved.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    }
  ],
  "metascore": 18,
  "name": "Movie 43",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 25,
    "month": 1,
    "year": 2013
  },
  "opening_weekend_income": 4805878,
  "opening_weekend_income_currency": "$",
  "rating": 4.3,
  "rating_count": 82282,
  "rating_freq": {
    "1": 15811,
    "10": 5790,
    "2": 7976,
    "3": 8419,
    "4": 9208,
    "5": 10547,
    "6": 9552,
    "7": 7538,
    "8": 5011,
    "9": 2430
  },
  "release_day": 25,
  "release_month": "January",
  "release_year": 2013,
  "user_review_count": 356,
  "votes_per_demo": {
    "aged_18-29": 35988,
    "aged_30-44": 25597,
    "aged_45+": 4519,
    "aged_under_18": 270,
    "females": 13805,
    "females_aged_18-29": 8187,
    "females_aged_30-44": 3890,
    "females_aged_45+": 631,
    "females_under_18": 76,
    "imdb_staff": 8,
    "imdb_users": 82282,
    "males": 56242,
    "males_aged_18-29": 27431,
    "males_aged_30-44": 21390,
    "males_aged_45+": 3802,
    "males_under_18": 191,
    "non-us_users": 39337,
    "top_1000_voters": 361,
    "us_users": 12627
  },
  "year": 2013
}