{
  "avg_rating_per_demo": {
    "aged_18-29": 4.0,
    "aged_30-44": 2.6,
    "aged_45+": 3.6,
    "aged_under_18": 6.5,
    "females": 7.0,
    "females_aged_18-29": 7.1,
    "females_aged_30-44": 5.5,
    "females_aged_45+": 5.2,
    "females_under_18": 8.3,
    "imdb_staff": 7.0,
    "imdb_users": 4.1,
    "males": 2.3,
    "males_aged_18-29": 2.2,
    "males_aged_30-44": 2.1,
    "males_aged_45+": 3.2,
    "males_under_18": 3.3,
    "non-us_users": 3.3,
    "top_1000_voters": 3.0,
    "us_users": 4.0
  },
  "avg_screens": 1742.25,
  "budget": 10000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 10,
    "year": 2013
  },
  "critic_review_count": 83,
  "duration": 92,
  "genres": [
    "documentary",
    "music"
  ],
  "gross_income": 28873374,
  "max_screens": 2735,
  "mc_avg_user_score": 2.2,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "One Direction: This Is Us",
  "mc_negative_rating_frequency": 113,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bill Stamets",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "The true strength of Spurlock’s documentary is how he showcases the behind-the-scenes, off-stage personalities of the One Direction boys."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "Some of the film's most memorable moments involve Niall and Liam looking down on oceans of screaming devotees in the street, and controlling their cheers like orchestra conductors."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "Mostly, however, This Is Us counts on the musicians to supply the personality—a strategy that makes it feel more like an anonymous mash note than a warts-and-all glimpse behind the curtain. Then again, what warts?"
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 63,
      "summary": "It's misleading to call this a documentary — fan fodder is more like it."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "I’m on to you, Spurlock. There are holes in your story about five lads who don’t appear to ever drink, smoke, fight, curse or partake in romantic dalliances of any kind. At least, not on screen."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "I suspect a previous, wackier idea for the film was ditched in favour of a slick promotional video about their jaw-dropping global tour, but I also have to admit that this is a rather watchable record of a phenomenon."
    },
    {
      "critic": "Andrew Frisicano",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "It may be just an hour-and-a-half commercial for the new single, “Best Song Ever,” and a victory lap following a successful arena tour, but credit where it’s due: This behind-the-scenes look at the English-Irish boy band du jour captures the group’s unpretentious stage show and regular-joe nature in all their glory."
    },
    {
      "critic": "Jim Farber",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The most telling quotes in the new One Direction documentary “This Is Us” don’t come from any member of the band. They come from their parents, who, at various times, carp about their kids’ trajectory from the moment they were put together on “The X Factor” back in 2010."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The director is known for visually quirky choices and offbeat interviews and asides. These techniques can be a mixed bag; sometimes they help lighten up a deadly serious segment, other times they seems silly. But it’s distinctive, and “This Is Us” could have used more of it."
    },
    {
      "critic": "Matthew Leyland",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "Curveballs are rare in this pop-umentary on Earth’s biggest boyband; but with lengthy gig clips, lots of cute mucking-about (segways, disguises, hiding in wheelie bins) and Harry’s shirt off within the first 10 minutes, Directioners won’t be disappointed."
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "1D in 3D: the closest thing to a Shine A Light for Directioners."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "The filmmakers’ intent to depict them as “normal guys” mostly succeeds, primarily due to their not inconsiderable charm."
    },
    {
      "critic": "Staff [Not Credited]",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "What’s the opposite of warts-n-all? ‘No warts’ doesn’t even begin to describe Morgan Spurlock’s fly-on-the-wall film about One Direction. No warts, no acne – there’s not even a pimple on the butt of this on-tour portrait of the reality-bred boy popsters."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 58,
      "summary": "We're treated to what's essentially a slick, airbrushed promo reel of a bunch of genuinely sweet superstars who can't believe their dumb luck. That's charming. But it's also a little boring. What it's most definitely not is a documentary."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "Someday, we may get the true story of One Direction behind the scenes, full of fears and fights, egos and eccentricities. But today is not that day, and Spurlock is clearly not that storyteller."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "One Direction: This Is Us is not the raw confessional that title might imply but rather both a primer and new product presentation."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "No personal revelations surface in “This Is Us.” Also, no narrative, no conflict — no differentiation between band members, even, besides the designation of dark-eyed Zayn as “the mysterious one” (he likes to paint)."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Spurlock teases the baby sitter contingent with a brief scene where a scientist discusses the neuro-chemical appeal of pop music, but thereafter the film is aimed squarely at face-value fans of the Pre-Fab Five."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "Amounts to little more than a big, wet kiss to the group’s worldwide legions of young, female fans."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s disappointing that Spurlock didn’t have the access, the footage or the spine to depict any of the cynicism behind such creations."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The film’s central fivesome prove charming pallbearers throughout the film, which alternates between inspired and insipid as it hits its hagiographic marks."
    },
    {
      "critic": "Miriam Bale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "With a group so evidently versed in the visuals of rock history, it’s a shame that a filmmaker wasn’t hired who would pay homage to classic pop films instead of offering a satisfactory paid promotional."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Even with all the SFX overlays, it’s questionable whether any of this is entertaining enough to sustain even a svelte 92-minute runtime, but Spurlock and the boys can’t be faulted for holding back."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Spurlock himself is nowhere to be seen, perhaps because the man in charge of this film is plainly Cowell himself, whose influence hangs over the picture like the smell of a leaky bin bag."
    },
    {
      "critic": "Marc Hirsh",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "The problem is that the movie offers no way of differentiating between them beyond their hairstyles."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 25,
      "summary": "The 3-D 1D movie is aimless, seemingly deceptive and spreads a poor message: that it's OK to act extremely immature, as long as you have millions of blind followers who think it's cute."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 20,
      "summary": "Even calling the film a documentary feels deluded."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Overview",
      "total_reactions": 1,
      "user": "Amari-Sali"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "gent q naja essa nota kkkkkkkk",
      "total_reactions": 1,
      "user": "Georgia1234567"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "Absolutely appalling waste of money. Poorly constructed documentary, avoid at all costs! Nothing more than a ploy to feed out of 12 year old girls mother's purses.",
      "total_reactions": 15,
      "user": "PatDawgH"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "While \"This Is Us\" was inspirational, charismatic, and affirmed that anything can happen it was still incoherent, sloppy, and without direction (no pun intended). What makes the film sloppy and incoherent is the fact that much of the scenes are out of place. For example, one moment you are listening to them in concert and the next you're seeing them on \"The X-Factor\". Additionally, some scenes give off a staged feeling such as when Liam and Harry are talking on the dock. Finally, it is blatantly obvious by the structure of the film that the studio rushed to get this out there fully knowing that it would make a ton of money.",
      "total_reactions": 9,
      "user": "PoliSci0621"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "O this movies has 2 sides the directioner side and the normal man side-so this movieon the directioner side is perfect the movie is for teen girls and only they will say it is perfect i had a survey whit my frends whit it so i know,and on the regular male side like me the ,ovie is  pure cuz it is just no do not go and watch it if you do not like 1D i can listen to them but no so my score is 2 and that is it directioners can give it a 10000 but it will not help the movie is  and that is it",
      "total_reactions": 16,
      "user": "skyluxx"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "If you're like me and think 1D makes ears bleed, then the obviously-scripted terrible humor movie this claims to be (heh, calling it a movie as if its good... trust me its not) will throw constant amateur footage of concerts at you instead of giving any scenes with the group in and if so, it will just be dumb little skits. Bad, ripoff, and it seems like on of those movies quickly made off a TV show just to make money and not entertain you in the slightest. Give it a miss.",
      "total_reactions": 11,
      "user": "TheBlueConsole"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "It seems like I have to make up for 150 character for  It's a crapy \"documentary\" about a crappy \"band\", that is only getting positive reviews for 12 year old girls that discovered metacritic.",
      "total_reactions": 8,
      "user": "viegasn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay Gay and its gay as well",
      "total_reactions": 4,
      "user": "Radioactive"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "This movie was  great. At first I didn't want to go because I didn't like them  but after the movie I love them. I love this movie and it's my favorite movie right now.",
      "total_reactions": 16,
      "user": "BCFdjwx5"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "The movie was not top-tier, but it was acceptable. I've listened to One Direction's music also, not a fan, but it's more or less fine, but the hate is unnecessary. Half of the 49 negative reviews are probably from haters who just gave it zero without watching the movie. I also see that some of the people created accounts just to rate this movie a terrible score.",
      "total_reactions": 14,
      "user": "CheckGamesList"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "There are moments of clear absurdity  when the group of guys crafted on a Simon Cowell talent show insist that they can always just be themselves, for instance  and the film does lay on the “wacky kids” and “our fans are so important” gloss with marketing-ploy thickness. But there are moments of screwy honesty  a couple chats with obviously heartsick parents stick out as counterpoints to the celebration  and the actual concert moments are both better entwined and more explosively captured than anything of this popdoc ilk has so far managed (looking at you, Bieber and Perry). In short, there is nothing you wouldn’t expect, but at least it’s all done with flair. And it’s not like it’s made for anyone but the teenage girls who saw the concert the first time through anyway.",
      "total_reactions": 17,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 34,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "\"This is us\" is a wonderful documentary/concert movie for everyone. It doesn't matter if you are a fan of one direction or not. The 1D guys are  surprisingly charming, entertaining and also very talented. You'll enjoy it!!!",
      "total_reactions": 38,
      "user": "Prisca97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Let's be clear, if you're not a fan of this guys there's no reason why you should watch this movie. You'll end up being more annoyed than entertained, (The 3D isn't bad but it won't improve your experience) I don't hate 1D as much as other people do, however, It's true when they say that this movie is only meant for their die hard fans.",
      "total_reactions": 1,
      "user": "ReviewZone212"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "who would make a movie on 1d  there just a bunch of **** who waste there times who  write songs  i rather watch katy perry : this is a part of me then watch this ****",
      "total_reactions": 4,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "I was just starting to become a fan of One Direction's music when I decided to view this film and it actually helped me understand them better.  The guys themselves are charming, smart and talented.  The image they have to uphold is not.  It was very clear that there's the band and there's the phenomenon - as two separate entities.  Fans on the internet have uncovered just how controlling their management and label really is and it's quite clear in the way the film is formatted (song, \"our fans are great\", screaming fans, song, \"our fans\", screaming fans, song) that the one thing the team behind 1D doesn't want us to know is that the boys are actually well worth their fame and accolades.  They deserve to be praised for their talent and personalities but the label was, at this point, clearly hoping to just cash in and move on.  Go figure, that's the nature of a cutthroat industry, I guess.",
      "total_reactions": 0,
      "user": "writenow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "It is a great film, which focuses more on how they built their careers from the music and passion of each, and games behind the scenes making it more fun",
      "total_reactions": 0,
      "user": "BeatrizLima"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "it was an amazing it was enjoyable and its great for One Direction Fans you should go watch with a your family it was good time i enjoyed it  my son even enjoyed it.",
      "total_reactions": 0,
      "user": "QueenBritney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "A very good film if you are a fan of the boys but understandably if not people would not find it interesting. However it was nice to see the different personalities in the film and how dedicated they were to making their album.",
      "total_reactions": 0,
      "user": "Katiexxx"
    }
  ],
  "metascore": 49,
  "name": "One Direction: This Is Us",
  "num_weekends": 4,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 30,
    "month": 8,
    "year": 2013
  },
  "opening_weekend_income": 18472875,
  "opening_weekend_income_currency": "$",
  "rating": 4.1,
  "rating_count": 22303,
  "rating_freq": {
    "1": 9385,
    "10": 8573,
    "2": 361,
    "3": 278,
    "4": 421,
    "5": 627,
    "6": 657,
    "7": 763,
    "8": 719,
    "9": 519
  },
  "release_day": 30,
  "release_month": "August",
  "release_year": 2013,
  "user_review_count": 68,
  "votes_per_demo": {
    "aged_18-29": 10701,
    "aged_30-44": 2495,
    "aged_45+": 723,
    "aged_under_18": 536,
    "females": 7118,
    "females_aged_18-29": 4907,
    "females_aged_30-44": 537,
    "females_aged_45+": 208,
    "females_under_18": 410,
    "imdb_staff": 1,
    "imdb_users": 22303,
    "males": 9221,
    "males_aged_18-29": 5705,
    "males_aged_30-44": 1921,
    "males_aged_45+": 502,
    "males_under_18": 121,
    "non-us_users": 6649,
    "top_1000_voters": 82,
    "us_users": 2314
  },
  "year": 2013
}