{
  "avg_rating_per_demo": {
    "aged_18-29": 5.0,
    "aged_30-44": 5.0,
    "aged_45+": 4.8,
    "aged_under_18": 5.2,
    "females": 5.0,
    "females_aged_18-29": 5.0,
    "females_aged_30-44": 5.0,
    "females_aged_45+": 4.7,
    "females_under_18": 5.2,
    "imdb_staff": 4.0,
    "imdb_users": 5.0,
    "males": 5.0,
    "males_aged_18-29": 5.0,
    "males_aged_30-44": 5.0,
    "males_aged_45+": 4.8,
    "males_under_18": 5.2,
    "non-us_users": 4.9,
    "top_1000_voters": 4.4,
    "us_users": 5.2
  },
  "avg_screens": 1562.0,
  "budget": 5000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 2,
    "year": 2014
  },
  "critic_review_count": 221,
  "duration": 84,
  "genres": [
    "horror",
    "thriller"
  ],
  "gross_income": 32453345,
  "max_screens": 2883,
  "mc_avg_user_score": 5.1,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 42,
  "mc_movie_name": "Paranormal Activity: The Marked Ones",
  "mc_negative_rating_frequency": 68,
  "mc_positive_rating_frequency": 67,
  "mc_pro_critic_reviews": [
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 75,
      "summary": "It's a welcome update, qualifying as the best in the series since the first film captivated and unnerved audiences in 2007."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 70,
      "summary": "The Marked Ones is refreshingly uncynical and straightforward in its desire to simply be a movie that makes the audience jump and be scared. It's a fun fright film and wants to be nothing more."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "Provides the familiar cheap thrills but with a salsa tang."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "The haunted house setpieces provide reliable doses of jolts, even if one can see the scaffolding of each scare being built from miles away, and director Landon has fun with some clever camera placement here and there."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "The script succeeds by expanding the Paranormal Activity mythology with additional details and even a few surprising twists."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "Thankfully, the entertaining chemistry between the two young leads in Paranormal Activity: The Marked Ones (Andrew Jacobs and Jorge Diaz), almost saves it."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "The changes — goodbye, white suburbia; hello, gritty diversity — recharge the batteries somewhat. But there’s no escaping that the found-footage phenomenon has gone from fresh and original to just plain annoying."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "If The Marked Ones is mildly brilliant in the first half, it stumbles witlessly into its own dumb pentagram in the second."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "For every viewer happily creeped out by the franchise's simple scare tactics — its video vision of things going bump and creak and moan in the dark — there's another moviegoer completely unfazed by such low-budget prankery."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "This entry has been described as a “cousin” to the other movies. Specifically, The Marked Ones is a Hispanic cousin, customized for Latino audiences in the United States where the series is particularly popular."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "The shocks are no less effective than the ones in the other Paranormal Activity movies, but no more original, either, with only the whipping of a handheld camera to set it apart from the offscreen gamesmanship that’s long been the series’ stock in trade."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "As exhausted as this series and the genre it comes from is, it still manages a few decent jolts thanks to that new approach and a pretty good cast’s reactions to what they, and we, see through the video camera’s viewfinder."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "As ever with this series, the shocks are cheap but effective, and the shaky-cam aesthetic adds an unsettling layer of realism (if you’re willing to overlook the innate ridiculousness of the film-everything concept)."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 38,
      "summary": "What I found more disturbing was the casual misogyny of the convoluted story line."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 37,
      "summary": "This sharp left turn takes the films’ mythology in strange and not entirely satisfying new directions, including a crazy time-travel element."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 30,
      "summary": "Yeah, this movie's a dog, but you can't blame the producers for strip-mining the same old fool-proof formula to death … and beyond."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 30,
      "summary": "Does anybody really find this crap scary anymore?"
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 25,
      "summary": "Several reels' worth of ugly, unshaped footage that wouldn't have been deemed fit for a movie's end-credit outtakes not so long ago."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 20,
      "summary": "The concept is the same, and just as tired as it was when the second, third and fourth sequels to “Paranormal Activity’s” 2009 first installment."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "\"Paranormal Activity: The Marked Ones\" does not deliver the scares that a Paranormal Activity movie should present, and it does not follow the last movie, this is one of the proofs that it is not a direct sequel, therefore it connects the last four or at least the first and the third, it is absurd how it is all connected, with a scientific twist that might shock you and please you or it might upset you.",
      "total_reactions": 2,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "Remember when the first Paranormal Activity movie came out?, remember when the developers placed cameras on the cinemas so they could record people reactions?, those days are over.",
      "total_reactions": 1,
      "user": "Blazingsebas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "Completamente innecesaria y absolutamente ridícula y aburrida. The marked ones cambia completamente el estilo de la franquicia (aquí no existen las noches) parece una mezcla entre la película Chronicle con sustos baratos y decepcionantes. No aporta nada a la historia y es absolutamente aburrida.",
      "total_reactions": 1,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "This is the first horror movie of 2014 and man was I disappointed. The movie awkwardly transitioned from humor to cheesy jump scares at an alarming rate. I am a horror movie fanatic and this movie only scares little kids. I'm not joking. I found myself laughing more at the actual movie than the parts that were funny. If you're looking for a horror film that will scare you making you have nightmares look elsewhere. But if your're looking for a movie that is more comical than frighting this is the movie for you. Rating: 4/10. Not a movie worth watching in the theater, it's a rental at best.",
      "total_reactions": 6,
      "user": "Dust987"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "This movie is garbage. Repeated choreographed jump scares serve to punctuate the dreadfully dull 'downtime' segments that make up the bulk of the movie. The motivations of the characters make zero sense and i cannot justify half of the decisions they make in this movie. Also this movie is funnier than it is scary (which is not at all), if unintentionally so.",
      "total_reactions": 4,
      "user": "Shoji"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Wow...so what do u call a movie that's a sequel, reboot and a  disaster, well you call it \"Paranormal Activity: The Marked Ones\", I remember having nightmares weeks after the first paranormal film came out, but with this a actually laughed in this film after the Simon says part. oh and actually i want to ask, when did super powers come into all this...oh dear.",
      "total_reactions": 4,
      "user": "ConnorBaker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "If you look at my past reviews, some of my comments say worst movie I have ever seen. Well this movie is the worst movie I ever saw in my whole life. I'm sorry if I offend anyone but if anybody gave this movie more then a 0, you must have been totally intoxicated. The budget could not have cost more than 1,000.00 dollars and that includes paying the actors, if you want to call them that. I went with my 2 daughters, 15 and 18. My 18 year old almost threw up because of the 3 year old filming the scenes as well as me being nauseated. The camera keeps jerking around and can hardly make sence of any of the movie. My 15 year old is such a wuss that a fart will scare her if you do not tell her first that you're going to fart and she disliked the movie also. I would not leave the movie theatre till I got 3 free movie passes. And that was only because I would not leave and the manager wanted to go home. Almost got arrested because I would not leave till I got free movie passes. There is not even an ending. It just looked like the 3 year old filming pressed stop to go get his diaper changed and take a nap and forgot to film the ending. Do not go and see this low budget piece of sh*t movie. They should stop making these movies all together as none of them are worth a pile of dung. If you did or are going to watch this movie and you like it, It might be time to see a shrink, that is if you know how to use a phone.",
      "total_reactions": 6,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "This franchise went downhill after the first movie! The Marked Ones failed in every way, no creative scary moments, terrible plot, uninteresting characters! It adds nothing to the franchise, waste of time",
      "total_reactions": 3,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "After watching the 3rd installment to the series,and seeing all the people chasing the guy in the house, without knowing who they are and where they come from, made me utterly clueless. Luckily 2 films later, i now understand. This is a prime example of what this film does for the series, it answers questions, while developing new ones. Such as what happens next.",
      "total_reactions": 5,
      "user": "Extra_Official"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "This movie is a complete failure. Even the parody A Haunted House has some more scary scenes, and i don't think there's actually a \"frightening\" scene. This series's just like Adolf Hitler, it doesn't know when to stop and ends up an utter failure. DO NOT ENCOURAGE THESE DUMMIES TO MAKE A SEQUEL. DO NOT WATCH THIS MOVIE.",
      "total_reactions": 5,
      "user": "AnotherGamerFRA"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "This is probably one of the worst horror movies I have ever seen in my life. There is absolutely no redeeming qualities to this monstrosity, unless you like pointless cool effects and a POV shot movie that any YouTuber can make. I laughed more than I was afraid- which was never- and the story was so uninteresting, with a set of characters that I had no reason to care for, so much so that I actually laughed when he killed his granny or whoever she is LOL. I can't believe I wasted 8 pounds on this abomination of mankind.  off with these  movies Hollywood please.",
      "total_reactions": 5,
      "user": "anonymus111"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "I felt this movie held a lot of basis on the Idolatry that most spanish people believe in. This is quite a twist in the Paranormal Activity franchise and I give it some credit for changing it up. However compared to PA 3 I found this movie to be less frightening and creepy due to its lack of setting up a dynamic environment. The movie's plot held less an importance and the movie was more about an 18 year old graduate who ends up possessed by some pathetic spirit which they are able to communicate with by a light up simon says toy that lights up green and red lights to answer their questions. What a joke. I felt like this was one of those squeegee board sessions that girls have in their rooms to find out about their future and it felt highly childish and fake.",
      "total_reactions": 9,
      "user": "InvestmentX"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is very bad. The plot is too predictable. If you have seen the other Paranormal Activity movies you know what's going to happen, and you already know how it's going to end for the main character(s). A horror movie fan won't be scared by this movie, as it only contains a few cheap jump scares.",
      "total_reactions": 6,
      "user": "Taltal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "I've seen every Paranormal Activity film, and this is by far the least scary.  There are even a few laughs (when the gang members enter the witch ranch house in the end with a scatter gun and Mac 10).  I like the shift to Oxnard and the Mexican community, and I appreciate the new story (women are marked by witches and then killed after giving birth so that their first-born sons can form some sort of future army...) but when the guy walks into the wardrobe at the ranch and winds up on the first floor of the house owned by the couple from the first films, it loses a lot of credibility with me. Sure, the ranch house looks a lot like the house the babysitter runs to at the end of part IV, but how the hell does this dude get teleported to that San Diego house?  Bizarre and a bit of a cheat in my book.",
      "total_reactions": 4,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "I think it pointless to extend, this is not a horror movie. Each year to be even worse and spend less money. the film now ruin and very very bad. I don't understand P.A team..",
      "total_reactions": 4,
      "user": "murad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "I was really bored in this i am normally never bored in a horror film even if its a bad one but this was quite boring and i didnt find it scary just a few jump scares thats all. people might like it but it wasnt for me i found it boring and not scary 3/10",
      "total_reactions": 2,
      "user": "cool1707"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Going in I expected the normal first of January garbage horror movie instead I got an average but nonetheless harmless one.  While the film adds very little to the mythology it does have some decent suspense.  C",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "Esto es una verdadera bazofia, con momentos que dan más risa que sustos, las primeras partes te hacen creer que estas viendo una comedia de terror de esas tipo Scary Movie o A Haunted House, es como si el creador hubiera dicho: \"OK, pongamos el argumento más rápido y parco que tengamos, que los personajes sea un poco imbéciles para que el público se ría un poco y se encubra nuestra porquería, llenemos la película de screamers que ni dan miedo y listo terminamos la película\". Además los screamers son muy predecibles, ni siquiera los screamers hicieron bien. Por lo tanto si eres de asustarse muy fácilmente, viste las otras películas, y te traes mucha comida a la sala de cine como para que te dure toda la película y llevas a unos cuantos amigos como tú al cine, puede que te entretengas. De otra manera, para gente como yo, es una película para ir a comprobar que es mala y ver al público totalmente susceptible que se asusta con cualquier screamer que aparece en la pantalla. En cuanto a mí no se si estoy \"marcado\" por ir a ver un filme tan malo.",
      "total_reactions": 5,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "this movie was not scary at all, but hilarious, which is why my friends and myself go every year after the second one the movies are funny becuase of their failure to make it any where near scary if you are wanting to see a movie to laugh at watch this one.",
      "total_reactions": 5,
      "user": "metalupyourass"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "why did you deceive me by providing a link misleading? my computer a virus because you",
      "total_reactions": 5,
      "user": "jessicaalvord"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Paranormal Activity: The Marked Ones is the fifth film in the franchise  sixth if you count that Japanese-made Paranormal Activity film a few years back  and at this point, audience members have had many chances to decide if they enjoy this series or not. While The Marked Ones does have a few differences from the rest of the series, it’s still ultimately following the same path, so it’s unlikely to suddenly turn someone around who has disliked the entire thing. But if, like me, you’ve enjoyed the ongoing story about a bunch of really camera-obsessed people and the spooky things that haunt them, The Marked Ones is another enjoyable chapter.",
      "total_reactions": 8,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Bad movie to start in 2014,can't wait for 5th.The other one's are better then this crap,not really scary at all.If you're Paranormal Activity fan,you will be dissappointed in this.",
      "total_reactions": 8,
      "user": "SebastopolQueen"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "OK just to be fair I am a fan or the franchise and of \"found-footage\" style films. Now as of The Marked Ones it's really not that different from the first 4 films. If you've seen them then you know the routine...weird stuff and some jump scares. As for me I really enjoyed this one for a couple of reasons and here's why:",
      "total_reactions": 9,
      "user": "Skullz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "It was a fun movie, lots of laughs in the beginning, but it grows very dark as it progresses. If you are a fan of the franchise you will not be disappointed.",
      "total_reactions": 6,
      "user": "rmmahoney"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Amusing flick, but really a horse crap ending.  These found footage flicks really need to up the ante on the scares. Paranormal 2 had me pooping my pants.",
      "total_reactions": 3,
      "user": "FleshWorld"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Saw it.  Seriously liked and admired the direction of the movie. Explaining that Kristi and her family's story,  while pivotal, is not isolated,  but in fact part of a bigger plot effecting many people. One of the more interesting points of the marked ones was with the peripheral character Oscar. He,  in a daze of clinging to the last of his humanity, tells the main character that they have both been marked,  that \"she put it in me...  Like she put it in you.\"  and most unsettlingly goes on to explain that \"the only way to stop it is to kill yourself... Kill yourself before you hurt somebody you care about.\"  which is what he proceeds to do himself. The way that Oscar's story was attached to the root plot of the marked ones I don't doubt seeing the rest of his story told in another movie from the beginning, upto his showdown with Anna, and most disturbing, what horrible things he must have done between killing her and killing himself,  to make him give Jesse such a horrifyingly accurate warning of where their common possessions would lead if unchecked. I have always said that the paranormal activity movies offer much more individually as contributions to a very unique,  original, and ambitious saga than they do as stand alone projects.  Be that as it may, This film was loads of fun.",
      "total_reactions": 3,
      "user": "Mattyrob16"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I'll give you a link good movie, I was tired with all the wrong link,",
      "total_reactions": 3,
      "user": "Niasabila"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "best paranormal activity yet  a fantastic ride and i hope paranormal activity 5 will be good as this one but really the marked ones is much better than PA1",
      "total_reactions": 14,
      "user": "kevin96"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "If you are a fan of the franchise you will not be disappointed. Definitely a good time. Has its creepy moments, and even some comedic moments. More enjoyable with a group of friends.",
      "total_reactions": 7,
      "user": "Jbles303"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "DEFINITELY GIVE IT A TRY  ENDING IS GREAT !",
      "total_reactions": 8,
      "user": "z14170"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This flick was the worst piece of crap I've seen in ages. It's astonishing how people in hollywood KEEP working. If there were the real world, whoever was responsible for this garbage would be fired. The \"script\" was cookie cutter to begin with, then took a turn for utter absurdity.  Suggestion: if you were involved with the making of this movie in anyway, don't admit it. Instead, move on, get a job at a movie theater instead. Selling tickets or popcorn might be a better area of the biz for you to be working  in.",
      "total_reactions": 4,
      "user": "marco34la"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Great movie! Lots of laughs and scares. I enjoyed the new take on the film franchise. This film doesn't contain much filming of people sleeping which was really refreshing. Cant wait for the next film!",
      "total_reactions": 4,
      "user": "RFLORESJ17"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I'm a huge fan of the Paranormal Activity movies and I got to say that this was actually the second best in the series. It showed that these movies had to do with something even bigger than just one family getting harrassed by a demon. Another reason why I think this is a great spinoff is by keeping the original story the same but adding elements that we didn't see before and using them as advantages. I can't wait for the next PA movie to come out and I hope they make more afterwards.",
      "total_reactions": 4,
      "user": "TheHorrorMaster"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "HUGE improvement over the previous third and fourth installments!!! This film ditches the highly cliche night after night camera setup in the living room and bedrooms- style, and instead focuses on the characters themselves and the actions they take in response to the paranormal events that occur around them. The cast primarily consists of Latino actors and actresses, and they manage to pull off pretty decent (and often times humorous) performances. While the scares aren't original by any means, more tension than I could 've ever imagined is built up in the final twenty minutes or so! As with the fourth film's ending, this film's ending not only scared the living hell out of me, but also surprised the living hell out of me and completely caught me off guard!!! Those who had questions left unanswered in any of the previous installments (yes, even the first film) will hopefully be satisfied with this film's ending, as it certainly solved several questions, but also left several new ones unanswered that will hopefully be answered in the upcoming official fifth film (this is a spinoff, mind you.) So overall, definitely a very fresh entry into a slowly dying franchise. Loyal fans who enjoyed the previous installments and the franchise in general will almost certainly have a scary good time with this one!",
      "total_reactions": 5,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Paranormal activity: The Marked Ones is one of if not the best in the horror series. The excellent characters, script and story is something to note in which everything is put to place, credit goes to the director for making such an enjoyable franchise. If your wanting to watch a exciting and fun movie here is your choice, your in for a blast and plenty of jump scares.",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Neither fun nor scary, and packed with jump scares (surprise surprise), \"Paranormal Activity: The Marked Ones\" is further proof that the found footage genre just needs to die.",
      "total_reactions": 1,
      "user": "NFW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "i wouldent say it was a bad movie, i just didnt like it as much as the other paranormal activity movies. I found that i couldent take the movie seriously at most parts due to it just being more cheesy and silly than scary, it actually made me laugh at some points. i did think it had good acting and effects tho, just a silly movie overall, and when going to see a horror movie you dont wanna leave calling it silly.",
      "total_reactions": 1,
      "user": "JOSHDILISI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Paranormal Activity: The Marked Ones is an entertaining spin-off which is an improvement over the disappointment that is the 4th instalment. While, like the other films, it isn't really scary due to how predictable it was, there is still elements to be enjoyed. The acting seemed fine but the characters, though feeling like real people, were dumb and made the same mistakes usual horror movie characters make. Unlike most viewers of the film, I thought the time-travel aspect of the film was rather interesting and I personally would have it go back to the very beginning rather than the end of the first film - but it didn't bother me. Overall, The Marked Ones was decent canon and it was an improvement over the previous instalment but it didn't live up to the par of the 3rd film (which is the best in my opinion) and I, personally, truly hope that the next film (Paranormal Activity 5) is the last one.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "I’ve never cared for any of the “Paranormal Activity” films.  Aside from being bored by them, I’ve always found them to be impossible to scare me, filled with unlikeable characters played by terrible actors and to be, all around, cheaply made.  For the most part, this latest installation isn’t much different.  The story is still simple and doesn’t have much meat to it and I wasn’t scared at all.  However, this film finally brought some decent acting to the franchise and characters that really seemed to have some depth and culture to them and was not the usual privileged rich white people who all have faces that look like a demon haunting them is only slightly worse than having a poor signal for your Wi-Fi.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "I hate the Paranormal Activity franchise let me just say that first of all. The first movie was ok the first time you watch it and that's it the rest are all crap in fact I stopped watching them after the first installment. Paranormal Activity: The Marked Ones is no different it was easy to call every scene and see whats coming so at no point are you ever surprised. I guess they tried to make it something different so you have to give it that but it was just so terrible the only reason why i didnt leave the theater was because i was on a date and that would have just been rude but of course the chick i was with ended up loving the film so i was subjected to over an hour of talking about these HORRIBLE HORRIBLE movies.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "Here is the scare less, pointless, and boring spin-off to the decaying Paranormal Activity franchise, the main problem is that it is not scary it just uses the same lame scares from the previous movies, the acting is somehow more subpar than the previous movies, even hardcore fans might not find much to enjoy here, so you should avoid it.",
      "total_reactions": 0,
      "user": "Leo9127"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "Jesus, one of the worst horror movies ever made, it sucks in almost every aspect, the script is boring and predictable as always, the sums up all the movie, and the ending, WHO THE HELL WROTE THE ENDING? IT SUCKS, IT MAKES NO **** SENSE *SPOILER* HE GOES BACK IN TIME IN THE FINAL SCENE OF THE FIRST MOVIE, SHOWS HOW THE GUY GET STABBED AND THEN JESSE KILLS HIM *SPOILER END*  THROW **** IN WHOEVER WROTE THIS, AGAIN THE HORROR TYPE MOVIE WHERE THE ENTITY CAN DO EVERYTHING",
      "total_reactions": 0,
      "user": "KingDevil999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "This movie is so predictable because it's so stupid! Just because it's a horror movie, it does not mean you do whatever you have to to get more screams. Two of the main characters' friend is possessed. Nothing you can do to stop that without a priest if anything. They could have stayed at home, safe and sound. But no, they go after their friend, even though they have enough clues to say that he's possessed. And then the portal? WTF?!",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Genuinely, my hopes were not high. Having watched and reviewed all of the Paranormal Activity franchise thus far, I have looked on as what was once an admirable and innovative idea slowly descended into nothing more than a numbers game, generating more and more revenue for less and less quality. When the first PA was made, it was for next to nothing, but for the love of film-making, regardless of its potential profit. As time has gone on, the film-making appeared to be less important, the story more confusing and convoluted and with the best will in the world, it seemed like the audience was the last consideration of a juggernaut that relied on them, yet didn't really care enough about them to offer what they thought they'd paid for.",
      "total_reactions": 0,
      "user": "choc_raisins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "I hate horror movies I just find them so stupid and pointless, and this is another one of those. I have seen the first Paranormal activity movie and it really scared me. This one did not, the first half of the movie nothing scary even happens. And the second half there are some jump scares but most of them are expected and don't even scare you. Just a bland boring movie that didn't even do what it was supposed to do and that is scare.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Paranormal Activity: The Marked Ones is a 2014 American supernatural horror film written and directed by Christopher B. Landon. Released on January 3, 2014 in the United States, it is the first spin-off of the Paranormal Activity film series and the fifth installment of the franchise.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "I guess it's just not my taste, but The Marked Ones sorta let me down. This is a spin-off from the main series, so it doesn't have much to do with Katie, Hunter, or the other characters other than expanding the more vague aspects of the mythology. The Marked Ones does have a decently interesting story with an ending that kinda aggravated me, and there is a bit more action in this film than the other four installments, but I felt like it was missing something. The movie was filled with a lot more jump scares than the rest of the series, most failed and only some warranted a slight jump, and there was no suspense or real fear throughout this movie. This focused more on the action and humor rather than any scares, which wouldn't be a problem for most horror movies, but when I see a Paranormal Activity movie, I don't expect to see some guy draw a dick on another guy's face. It has some mildly scary scenes, and the change of setting does give a bit more variety to the series, but The Marked Ones mostly fails to live up to the impossibly high standards set by the franchise by being a by-the-numbers found footage flick.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Watched the trailer for Ghost Dimension and remembered this horrible mess. Who came up with the idea for this movie, it's generic plot and its non scary moments, actually one jump scare got me at the end but other than that it doesn't even feel like a paranormal activity movie or horror movie in general. The one thing that at least kinda saved the movie was when he goes to this house and teleports him to one certain place that was in 1 and 3 but it also sinks the franchise PA-GD better be good or this franchise needs to end",
      "total_reactions": 0,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "You know how it is with modern horror movies. They fail at passing and pass at failing as horror movies, as well as being movies period. This isn't as bad as others (Ouija, Annabelle, The Quiet Ones) but it is pretty bad.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "An almost okay film in that exhausted PA franchise. The same old formula, shaky camera, loud sounds, cheap jumpscares and an overall laziness. If you're a devoted PA fan you might enjoy it a little bit, but as a an average quality horror films looking person, you might just pass on it.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Now I personally found this film a bit boring. For nearly half of the film very little supernatural happens. It was like watching candid vid clips of ordinary peoples through daily humdrum affairs. Your basic dares, shenanigans, and trivial banter permeate the screen. I had to keep reminding myself to be patient and that this is a paranormal “horror” film. The paranormal finally kicks in on the film, at first having more similarities to “Chronicles” than evil spirits, utilizing the standard special effects tricks, however it soon gets into the normal groove of paranormal. The story is a strong concept that just seems to get cluttered with half hearted direction. One cool thing about the film was the cast’s ability to make the drama, banter and interaction on screen seem genuine. The dialog maintain a constant fluidity from start to finish. There is a mild sense of inability to sell the paranormal fright from a couple of the actors when the crap hits the fan but it is minimal and soon the cast is back in sync.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "Me and my dad watched this just moments ago, and I can definitely say this is a piece of crap, it was so bad I couldn't even crack decent enough jokes to laugh at it because it was simply that horrible. If you have any respect for your time living on this earth, give this a pass or at least have the fast-forward button at the ready, because this acts out more as a drama than any other type of genre, the horror and thriller elements are near non-existent, predictability (including jump scares), and my biggest gripe besides the everything else bad in this utter waste of time is my cheap ass phone has a better light on it than their stupid camera... This film is a defining example of what it means to milk a concept, imdb said it had an estimated $5m budget, but honestly I doubt any of that went into the film.  Go watch a indie horror film, or indie drama, they'll both be better than this nonsense. Dare I say, Dragonball: Evolution would be a better time spent than watching this. :O",
      "total_reactions": 0,
      "user": "Philbo72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Despite what producers intended, The Marked Ones doesn’t expand the Paranormal Activity brand. It scrapes the bottom of the franchise’s barrel, begging found-footage audiences for a few extra dollars as it drives the final nail into the coffin of a series that should have died years ago.",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "I liked the paranormal activity Franchise but the Problem is they keep doing the same movie every single time.The characters in this are stupid and dump.But this movie was fun watching with my mates.",
      "total_reactions": 0,
      "user": "hassall"
    }
  ],
  "metascore": 42,
  "name": "Paranormal Activity: The Marked Ones",
  "num_weekends": 6,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 3,
    "month": 1,
    "year": 2014
  },
  "opening_weekend_income": 18343611,
  "opening_weekend_income_currency": "$",
  "rating": 5.0,
  "rating_count": 33147,
  "rating_freq": {
    "1": 2882,
    "10": 1785,
    "2": 1788,
    "3": 2723,
    "4": 4549,
    "5": 6642,
    "6": 6051,
    "7": 4052,
    "8": 1908,
    "9": 767
  },
  "release_day": 3,
  "release_month": "January",
  "release_year": 2014,
  "user_review_count": 158,
  "votes_per_demo": {
    "aged_18-29": 13485,
    "aged_30-44": 10591,
    "aged_45+": 1949,
    "aged_under_18": 183,
    "females": 5647,
    "females_aged_18-29": 3133,
    "females_aged_30-44": 1747,
    "females_aged_45+": 315,
    "females_under_18": 46,
    "imdb_staff": 2,
    "imdb_users": 33147,
    "males": 22143,
    "males_aged_18-29": 10217,
    "males_aged_30-44": 8730,
    "males_aged_45+": 1600,
    "males_under_18": 137,
    "non-us_users": 14427,
    "top_1000_voters": 243,
    "us_users": 5848
  },
  "year": 2014
}