{
  "avg_rating_per_demo": {
    "aged_18-29": 8.5,
    "aged_30-44": 8.3,
    "aged_45+": 7.9,
    "aged_under_18": 8.5,
    "females": 8.7,
    "females_aged_18-29": 8.9,
    "females_aged_30-44": 8.7,
    "females_aged_45+": 8.2,
    "females_under_18": 8.0,
    "imdb_staff": 8.0,
    "imdb_users": 8.3,
    "males": 8.3,
    "males_aged_18-29": 8.4,
    "males_aged_30-44": 8.3,
    "males_aged_45+": 7.8,
    "males_under_18": 9.0,
    "non-us_users": 8.3,
    "top_1000_voters": 6.9,
    "us_users": 8.2
  },
  "avg_screens": 7.5,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 30,
    "month": 9,
    "year": 2011
  },
  "critic_review_count": 39,
  "duration": 109,
  "genres": [
    "documentary",
    "history",
    "music"
  ],
  "gross_income": 454784,
  "max_screens": 10,
  "mc_avg_user_score": 8.5,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 0,
  "mc_movie_name": "Pearl Jam Twenty",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 88,
      "summary": "A must-see for Pearl Jam fans - and for folks keen on gleaning insights into the pressures that come with megastardom."
    },
    {
      "critic": "Guy Dixon",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Even those more neutral about Pearl Jam will find it impossible not to enjoy director Cameron Crowe's driving retrospective of the band's stage-diving 20 years, at least on some level."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "What makes Pearl Jam Twenty a little better than the average fan-friendly documentary is that Crowe focuses on the more significant parts of the Pearl Jam story: not how the group wrote \"Alive,\" but how it's struggled with maintaining artistic credibility while selling millions."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "This is a lovingly assembled tribute to the career of a working band that's still very much, to quote the title of its most iconic hit, \"Alive.\""
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Before viewers learn this venerable ensemble's story, much less see its members rock out on screen, they are subjected to Mr. Crowe's voice-over account of his own early discovery of the Seattle scene."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Cameron Crowe's feature documentary is among his most effective and deeply felt work."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a shame that, after nearly 40 years of writing about rock, Cameron Crowe is receptive to the clichés of the genre."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Wholly uninterested in puffing up his subjects into an iconic rock outfit on a par with their idols Led Zeppelin and the Who, Crowe instead merely tells their story free from the constraints of rise-fall-rise clichés."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "The effort - by Vedder & Co., as well as Crowe - is heroic, if not quite persuasive. Legends aren't made of longevity alone, and while you wouldn't wish Kurt Cobain's pain on anyone, you can't help but feel this band survived well past its meaning."
    },
    {
      "critic": "Joseph Rose",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 58,
      "summary": "At its best, Pearl Jam 20 makes a convincing argument that Nirvana wasn't the most iconic band to rise from the grunge scene. Ultimately, however, Crowe's fanboy treatment pushes it into a mosh pit of mediocrity."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Kurt Cobain, TicketMaster and the tragic concert in Roskilde, Denmark, are addressed through plentiful backstage footage. If only it was about something other than rockers almost irked they got famous."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Perhaps Pearl Jam's arc too closely resembles Crowe's own, and he can't see what's so uniquely poignant about dimmed but enduring stars."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Finding a pulse only in the band's late-reel performance of \"Alive,\" a lusty passage that would've begun a pic intent on making a case for the group's greatness, \"Twenty\" simply counts the years from 1991 via sludgy backstage and onstage footage whose rarity can't forgive its inclusion. Crowe's critic mentor, the late Lester Bangs, would cringe."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was absolutely fantastic. The best music documentary I've seen if not THE best documentary I've ever seen. Crowe did an amazing job of chronicling the band's success and explaining their motives and the way they see the fans, touring, album making, and music. It was a touching, sometimes shocking, emotional experience that barely let up any moment in entertainment and intrigue. I can't think of one thing wrong with it. If you're a fan, you'll be in awe. If you're not a fan, you'll be in love again. See it. You won't regret it.",
      "total_reactions": 3,
      "user": "lionthunder"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was a great film, I absolutely loved it.  As a Pearl Jam fan, I think Cameron Crowe did an excellent job portraying the band.  There were a lot of rare footage on there and he covered everything from the beginning of Mother Love Bone until now.  I had shivers throughout the movie he chose some great performances to show.  If you were a fan way back in the beginning but lost your touch with PJ, watch this movie and feelings will return.",
      "total_reactions": 2,
      "user": "rinachandayo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Pay no attention to the mixed reaction in the metascore-- if you like Pearl Jam then you'll like this doc. If you don't like Pearl Jam, then I'd imagine it would be a bit dull. It's got some great archive footage, a compelling arc, and of course a great soundtrack.",
      "total_reactions": 0,
      "user": "whit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I never really got into Pearl Jam, and other than a couple of hits their career pretty much passed me by, but this is compulsive viewing. A combination of interviews and captured footage make this a great documentary. Can't say I'm a fan of the band as a result, but they seem a nice enough bunch who have handled fame and fortune better than some in the industry. Worth watching by anyone with the slightest interest in rock.",
      "total_reactions": 0,
      "user": "wetwebwork"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Where the Foo Fighters' \"Back and Forth\" was a discography with interesting anecdotes and philosophizing of music (which is great, and I love and own the film), Pearl Jam Twenty is an in depth exploration of an entire generation of music at a time when something new was born. It's a great documentary and the DVD has some exceptional special features. More than worth your time.",
      "total_reactions": 0,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed this film, like I do with most of Cameron Crowe's I'm surprised by the mixed feedback from critics. I'm a fan of Pearl Jam without really knowing who they are (like I'd imagine most people are, besides the die-hard fans). Even I had heard about some of the topics brought up in the movie (Denmark and Ticketmaster), the film had this kind of introspective point of view that made the movie both compelling and inspiring.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Esta es un gran documental, acerca mucho al lado humado de la banda, permite conocer cada detalle de la larga vida de este grupo que ha sobrevivido al cambio generacional y a la comercialización abrupta de nuevos talentos y música de moda.",
      "total_reactions": 0,
      "user": "fve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I came into this film only knowing a couple of songs by Pearl Jam and now 3 years later they are definitely in my top 5 favourite bands of all time. I've seen the film probably 5 or more times now and its just so well done. Cameron Crowe was the perfect man for the job, and he did such a great job of creating such an interesting and compelling story  over the span of 20 years. Granted, most of the film focused on the first year, that never bothered me. Definitely my favourite music-related documentary, and probably one of my favourite documentaries in general. I can definitely thank this documentary for truly introducing me to one of my favourite bands.",
      "total_reactions": 0,
      "user": "gilldawe"
    }
  ],
  "metascore": 59,
  "name": "Pearl Jam Twenty",
  "num_weekends": 2,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 23,
    "month": 9,
    "year": 2011
  },
  "opening_weekend_income": 102448,
  "opening_weekend_income_currency": "$",
  "rating": 8.3,
  "rating_count": 6772,
  "rating_freq": {
    "1": 60,
    "10": 1983,
    "2": 18,
    "3": 13,
    "4": 38,
    "5": 79,
    "6": 329,
    "7": 887,
    "8": 1782,
    "9": 1583
  },
  "release_day": 21,
  "release_month": "October",
  "release_year": 2011,
  "user_review_count": 17,
  "votes_per_demo": {
    "aged_18-29": 1794,
    "aged_30-44": 3609,
    "aged_45+": 581,
    "aged_under_18": 2,
    "females": 903,
    "females_aged_18-29": 359,
    "females_aged_30-44": 422,
    "females_aged_45+": 94,
    "females_under_18": 1,
    "imdb_staff": 3,
    "imdb_users": 6772,
    "males": 5188,
    "males_aged_18-29": 1419,
    "males_aged_30-44": 3144,
    "males_aged_45+": 480,
    "males_under_18": 1,
    "non-us_users": 3683,
    "top_1000_voters": 88,
    "us_users": 1440
  },
  "year": 2011
}