{
  "avg_rating_per_demo": {
    "aged_18-29": 3.7,
    "aged_30-44": 3.8,
    "aged_45+": 3.9,
    "aged_under_18": 4.2,
    "females": 3.5,
    "females_aged_18-29": 3.4,
    "females_aged_30-44": 3.6,
    "females_aged_45+": 3.5,
    "females_under_18": 4.4,
    "imdb_staff": 4.0,
    "imdb_users": 3.8,
    "males": 3.8,
    "males_aged_18-29": 3.7,
    "males_aged_30-44": 3.8,
    "males_aged_45+": 3.9,
    "males_under_18": 4.2,
    "non-us_users": 3.7,
    "top_1000_voters": 3.9,
    "us_users": 4.1
  },
  "avg_screens": 58.333333333333336,
  "budget": 5000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 15,
    "month": 6,
    "year": 2012
  },
  "critic_review_count": 237,
  "duration": 83,
  "genres": [
    "comedy",
    "horror"
  ],
  "gross_income": 370904,
  "max_screens": 86,
  "mc_avg_user_score": 4.2,
  "mc_metascore": 24,
  "mc_mixed_rating_frequency": 24,
  "mc_movie_name": "Piranha 3DD",
  "mc_negative_rating_frequency": 84,
  "mc_positive_rating_frequency": 48,
  "mc_pro_critic_reviews": [
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 60,
      "summary": "Ups the self-parody so much that it's practically a Wayans Brothers spoof, albeit with fewer jokes."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "Piranha 3DD is overcrowded and pointlessly mean. The stunt casting of David Hasselhoff playing himself, riffing off his infamous 2007 drunken home video, gets in the way of the storyline."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 40,
      "summary": "It seems impossible that a sequel to a movie as ridiculous as \"Piranha 3D\" could disappoint but Piranha 3DD stops at mediocre before arriving at gloriously bad."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 40,
      "summary": "\"Welcome to rock bottom!\" sighs Hasselhoff at one stage, pretty much summing up this textbook exercise in sloppy seconds. Here's hoping the piranhas have a better agent than he does."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 33,
      "summary": "The best part of Piranha 3DD, the pointless sequel to the utterly unnecessary 2010 remake of Piranha, is the credits. Not only do they signify that the film is finally, mercifully over, but they also allow for David Hasselhoff to sing the theme song to a new fake TV series called The Fish Hunter, a clever meta-gag that nods both to Baywatch and the Hoff's international recording success."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 30,
      "summary": "As sequels go, Piranha 3DD has barely enough heft to squeeze out 83 minutes of ho-hum entertainment, although it faithfully delivers plenty of menacing fish and bouncing boobs, as amply advertised."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 30,
      "summary": "Add to this that it takes place in the town of Merkin, and you'll get an idea of the labored spirit of dirty-old-man humor that prevails."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 25,
      "summary": "\"Piranha 3D\" was ridiculous, gory and fun, everything Piranha 3DD is not."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "John Gulager is neither artist nor genius, bringing only straight-to-video conviction to Piranha 3DD."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 20,
      "summary": "The director, John Gulager, has no idea how to mix his ingredients to create a savvy self-parody."
    },
    {
      "critic": "A. A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 20,
      "summary": "Hecklers can take the night off; ripping on a movie this bad is as rewarding as shooting fish in a barrel."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 16,
      "summary": "For the much-cheaper-looking sequel, Piranha 3DD, director John Gulager mostly seems to be trying to see how much he can degrade the old \"Jaws\" formula and still have it interpreted as parody rather than apathy."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 11,
      "summary": "Disappointingly, Piranha 3DD, the inevitable sequel to the remake, has none of Dante's wit, Aja's directorial skills, or Greg Nicotero's grotesqueries."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Piranha 3DD is the worst movie 2012, it is disgusting, toned down on horror and violence, the story is weak, the characters are dumb and the movie is full of cliches. Piranha 2 is not even watchable in 2D, and I doubt that the 3D is good either. Piranha 3DD, congratulations for being number 1 worst movie 2012 and one of the worst movies ever made.",
      "total_reactions": 3,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Alexandre Aja's Piranha 3D was hardly a masterpiece, but it was a real movie. It was well shot, featured some pretty great makeup effects and sported a decent amount of tension, balanced with zany comedy. The film took the characters seriously, even though the horror spewing mayhem of the killer fish all around them was laugh-inducing. That was part of the film's charm. John Gulager's follow-up, on the other hand, has no charm, or class for that matter. Piranha 3DD is an awful film because it doesn't understand what made the first film work for most audiences. Instead, it swaps sly political and social subtext for stale, shameful cameos, derp jokes and juvenile gags fit for a crass Meet the Spartans-type spoof. Picking up a little while after the events of the first film, Piranha 3DD brings the killer fish to a wild water park run by a sleazy entrepreneur (David Koechner). And that's pretty much the whole plot of the film, which barely runs over an hour (sans credits). The water park is overrun with the monster fish, and the final twist of the first film (that there are mega piranhas) is pretty much left untapped. The characters are meaningless, and there's not a likeable soul inhabiting a single corner of picture. The film is gory, sure, but even the violence and mayhem isn't nearly as shocking, or amusing. It's just bloody and uninventive. The nudity also feels dialed back, which is bizarre given the film takes place at a water park patrolled by stripper lifeguards. There's breasts and bums all over the place, but Aja's film pulled a few full frontal scenes, including a hilariously tantalizing underwater ballet. There's nothing here that tops that, nor does the film ever even seem to want to try. And that's the problem with Piranha 3DD  it's not trying, at all. It's just a shallow, muddy killer fish film with paper-thin characters, an insultingly boring narrative and lifeless thrills. The cameos are remarkably embarrassing, especially a seemingly drunken David Hasselhoff (who's seen better days). The returning actors from the previous film (Ving Rhames, Christopher Lloyd and Paul Scheer  who died off-screen, mind you) stick out like a sore thumb, too. They don't work in the world Gulager has created, because his world isn't logical, and it's populated by moronic stereotypes and unrealistic non-human humans. Piranha 3DD is a terrible film, and that's a tragedy. There was room for a good sequel to Alexandre Aja's original, but John Gulager and crew messed it all up. What remains is pretty solid Blu-ray for a film that's barely even worth renting.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "This is by far the worst movie I have ever seen aside to Movie 43, this movie makes the first one a masterpiece, I mean the first movie is actually fun and entertaining, it is bloody gruesome fun, but this movie fails in every aspect, it is not funny, tamed on violence and boosted on sexuality, I have seen porn movies that are more interesting than this sequel. Piranha 3DD fails on every aspect.",
      "total_reactions": 1,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "The first film was not to bad half decent 3D the story was alright and it was  fun to watch this was awful I have a monthly cinema card so I don't pay every time I go and even though I see why over my â",
      "total_reactions": 12,
      "user": "scoley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I don't know why David Hasselhoff is in the movie, but I'd pass on Piranha 2 3-D, 3DD, whatever you may call it. I like the first Piranha movie and it's even way better than Jaws. Piranha 3DD, on the other hand, wasn't made to be relaxing in the sun filled with deadly eating piranhas. I was trying to find it at the Edwards theater in Fairfield, CA, instead it's in limited releases. How stupid is that? I know what DD usually stands for... gigantic **** I love big women with big boobs. I thought it was supposed to be delayed until July or August, but June 1? Please. Even Baywatch has its own movie in 3-D. So I'd better watch Piranha on Itunes instead of watching this horrible messed up sequel with no returning cast (just good ol' Christopher Lloyd and Ving Rhames) and a slew of unfunny moments. Piranha 3DD looks to be a fish-out-of-water bomb and so I'll be waiting for the results of this week's box office to see it will be a flop for the summer. Until then, Piranha 3DD is one of the worst movies of 2012. Save your $20 bucks and wait for The Cabin in the Woods on Blu-Ray.",
      "total_reactions": 8,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "The first Piranha was funny, are a terrible, terrible movie, but be great, and now I don't understand who think that a sequel can be better, Piranha 3DD is same that the first movie, most gore, most sex, most 3D, Piranha 3DD not is any new.",
      "total_reactions": 8,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "HOW did this get a release in cinemas and not go straight to DVD.  The first was a watchable b movie, with above average 3d, and also a decent enough premise.  This however is a travesty, if it was not for The Hof giving us a few good one liners, I would be giving this ZERO. DO NOT spend money or time on this travesty of a movie.",
      "total_reactions": 4,
      "user": "AKH"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Worst film ever to touch the face of the earth.",
      "total_reactions": 3,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Given the extremely low user and critic reviews, I thought I, someone who loved Piranha 3D, would be greatly disappointed in this film.  But this film was hilarious!  What I don't understand is how people can criticize the movie for its story, acting, etc.  The movie is about a bunch of prehistoric piranhas that get into a water park where girls run around naked.  The film revels in its own absurdity, and that's what is so great about it.  What did you expect, Rosemary's Baby?",
      "total_reactions": 12,
      "user": "Unbelievable21"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "As a 3D film, it's abysmal.  Piranha 3DD was not shot in 3D to begin with, but is another of those post conversion hack jobs.  It doesn't help matters that the little fishies are framed in tight close-ups--it's all foreground, when the format needs deep backgrounds; no depth, no 3D.    The attacks are never scary, however, Piranha 3DD gets the job done when it goes for parody, especially of Jaws.  One of TV's most famous lifeguards makes an extended cameo, and a cast member of the original film gets a funny scene as well.  Full review on my blog.",
      "total_reactions": 12,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "This movie is a bit bad, but I'm going to get a five because you spend a \"good\" while watching it. I thought I saw Piranha 3D holding pieces and put into this film (not confirm that they were). And the movie has a very bad temper, eg kill the child when I was a little weird.",
      "total_reactions": 2,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 3,
      "user": "epicmorganguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "This movies is way better than the first, the predecessor is nothing more than a slaughter fest. This movie we have good character development and more interesting premises. The movie has its faults with being overtly silly and laughable but isn't that better than the first? The first was simply the brainless murder or a bunch of kids in a lake nothing more. In this movie we get some comedy, horror, and hassle hoff. Its not a bad movie better than the 1st.",
      "total_reactions": 1,
      "user": "GCMANINDAHOOD"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Piranha 3DD is a 2012 horror-comedy film and sequel to the 2010 film Piranha 3D. It is directed by John Gulager from a screenplay by Marcus Dunstan and Patrick Melton. It stars Danielle Panabaker, Matt Bush, David Koechner, Chris Zylka, Katrina Bowden, Gary Busey, Christopher Lloyd, and David Hasselhoff.Superb hot movie. Piranha is  all about fish eating many a.. Should see if you are masala movie lover.",
      "total_reactions": 10,
      "user": "AGEX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Over the top, hilarious, just because it isn't scary doesn't make it a bad movie, it is still a very fun ride, if you are so inclined to take it - samarathenymph xoxo",
      "total_reactions": 1,
      "user": "samarathenymph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "this is the perfect example not to make a remake version that contains a lot of nudity and comedy.I liked the old one,and much more sense than this movie,and the only thing that saves this movie from being sucks are just how much profanity and sexual content included on this movie.Even through its funny but its kinda old and  dull,and disappointing movie of the year.Don`t watch it,save your money on other movie instead.",
      "total_reactions": 0,
      "user": "murut87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "The piranha movies are really bad, no real story and no sign of normality. Although there is some pretty big  ( . Y . ) that belong to the wonderful porn-stars in the cast it's a completely pointless movie. The 3 is purely for arousal reasons.",
      "total_reactions": 0,
      "user": "seifer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "I don't understand why did they make a sequel of a terribly-made movie. This sequel is much worse than its predecessor. Stupid plot, stupid acting and stupid concept. AWFUL! AWFUL! AWFUL!",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "You know, I really wanted to like this movie. I made excuses for its rather lame attempt at humor and the misuse of David Hasselhoff in an extended cameo by insisting that its source material isn't all that series either. I tried to overlook the ridiculous sex scene that was probably the film's bloodiest moment. But when the massive carnage finally comes it is so limp and most of the \"Oh My God\" moments are reduced to hindsight reflections. Most of the kills occur so fast. The massive set piece (the water park) is stacked with possible gross out occurrences that never happen. Instead, we get a guy who is having his way with a pool drain. The cast is mostly wasted. What makes this even more of a let down is it has the same feisty-trashy stamp of awfulness that the two Feast sequels had. Yes, there is nothing wrong with mean-spirited but mean-spirited and humor don't really mesh well for me (personal taste).",
      "total_reactions": 0,
      "user": "gemini0577"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Really? Piranha 3DD is the best title they could come up with? Then just add two huge knockers on the poster to add more \"appeal\"? This movie is just a Huge waste of Money, time, and effort.",
      "total_reactions": 0,
      "user": "ManilaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Despite providing some amusing moments, this sequel is a cheaper clone of the fun 2010 film that is neither as entertaining or as humorous. It fact, this film feels like it is trying too hard to be that film.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is really bad. It gave me nothing. I was not scared, did not make me laugh, I was not entertained ... no nothing! A useless and disappointing sequel.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "I gave the first one a 6/10, which is a descent score for lame exploitation films like these. Well, unlike the first one, 3DD is a completely waste  of time.",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "The first film, \"Piranha,\" was adored by many as a guilty pleasure or a shot in the arm of cheese.  Now we are given, \"Piranha 3DD,\" which has the same pre-historic flesh eating army of piranhas moving from a vacation lake locale to a chlorine filled water-park.  Much is much the same, but just more gory, more nudity, and more senselessness.  This sequel has a new director in John Gulager (\"Feast\"), but it does not offer anything fresh.  Just more gross out deaths that come across as more head-shaking than elaborate of shocking.  The only returning cast members are Christopher Lloyd as Carl, whom is the nutty scientist character that learns more about the ancient piranhas, and Ving Rhames as Sheriff Fallon, whom we all thought died in the first, but only lost his legs to the piranhas and is now able to attach a shotgun as leg instead.  New to the cast is the young Danielle Panabaker (\"Sky High\" and \"Friday the 13th\") as the lead and David Koechner (\"Anchorman\") as her dim-witted stepfather and owner of the water park where the majority of the killing takes place.  If you are a fan of the original, you may enjoy this one, but it is just same gore fest over again shot entirely in 3D and of course with continuous nudity of young women.  The only mere bright spot is a the cameo of David Hasselhoff as himself.  He actually has a few really funny scenes poking fun at himself and his career, but it comes nowhere close to saving the film.  Gary Busey also makes a early cameo in the film, but its a mellow return to film for him, it might have worked better for him if he actually poked fun of himself like Hasselhoff rather than playing a character.  Bottom line:  Only notable thing about the film is a cameo by Hasselhoff, the rest is a forgettable, gore dunce fest that overstays its welcome.",
      "total_reactions": 0,
      "user": "Beastman21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Just when you thought it was safe to go back in the water park... The piranhas are back in another outrageous outing with even more blood and boobs than ever before! Those pesky pre-historic piranhas have found their way into a new lake, but unfortunately for the locals, the lake also serves as the source for the the new Big Wet water park! If you thought PIRANHA 3D was in poor taste, you ain't seen nuthin' yet! The creative team behind the cult-classic FEAST takes over in this direct-to-video sequel, and they have really nailed it this time. PIRANHA 3DD shoots way over the top with its crude humor and exploitative fun, throwing political-correctness to the wind along with plenty of limbs and bikini tops. Don't let the 'R' rating fool you... This film has more gratuitous nudity and violence than any Uncut DVD on the market. All contextualized, of course. Where PIRANHA 3D never struck an even balance between the humor and horror, director John Gulager and writers Patrick Melton and Marcus Dunstan keep the pace moving a mile a minute as they shock, entertain, and completely disgust along the way. If that weren't enough, PIRANHA 3DD unleashes the one-and-only David Hasselhoff in a brilliant self-parody for the final act. Any fans who may have been disappointed with the last PIRANHA can get ready for a stupid good time with PIRANHA 3DD!",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "what is everyone smoking??? this is hilarious, if not for intelligent, sharp, witty humour, than for 'what the f***?!' humour, people are taking this far too seriously...",
      "total_reactions": 0,
      "user": "mickelwick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "I really enjoyed the original despite low expectations. I found it to be a fun genre flick, held together by some really solid performances, and boobs. Well Piranha 3DD has plenty of the latter, but it seams that losing director Alexander Aja had been a major blow to this film. It is poorly acted and just plain stupid. The opening film boasts Gary Beusey igniting a cow fart. Yea this movie is just one huge stinker, with no soul or class.",
      "total_reactions": 0,
      "user": "R3DRocket"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "I haven't seen the first movie, but I suppose at this stage, it doesn't even matter. \"Piranha 3DD\" had almost nothing interesting and it was just some crap-CGI piranhas attacking people, the end. I'll grant them that there were a few scenes that had some decent tension, but the rest of the movie just sucked.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "After watching the first Piranha 3D movie in the cinema and thinking how this is one of the goriest movies I have seen in a long time. So when I heard that the movie was getting a sequel, I was hoping that the movie would be a lot better than the first one.",
      "total_reactions": 0,
      "user": "MrHannigan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was great! It was not a low budget film by any means. It was given a low budget look with crappy CGI to add to the humor. The actors in the movie prove that it was not a low budget film. The movie was hilarious and I laughed the whole way through. If you watched it and didn't like it, try watching it again with a mind-set that the movie is purely a comedy with crappy CGI to add to the humor(similar to the humor you get from watching an old horror movie that looks so ridiculously bad yet is still a horror film).",
      "total_reactions": 0,
      "user": "Movie-pro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Utterly tragic. Simply a train wreck of a project and reminiscent of titles that are made by wealthy people who think they know how to make money through film. Don't try categorizing this one, it doesn't fit into any niche and in fact insults cheaply made horror, T&A; horror, comedic horror and cinema in general as a whole. It almost beats John Carter for worst movie of all time.",
      "total_reactions": 0,
      "user": "zendoa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "The first Pirahna film at least tried to be somewhat serious, but with this film, the movie is completely ridiculous to the point of laughter.  Most of the film was just nudity and gore to the point where you just get tired of it aside from the poor acting.  The movie was pretty bad honestly and wouldn't see it again even if you paid me.",
      "total_reactions": 0,
      "user": "Globox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "One of the Worst Movies ever witnessed, nothing  called horrifying, nothing amazing, nothing existing, all in all nothing. Pathetic movie with Pathetic screenplay, with pathetic acting, all in all Pathetic.",
      "total_reactions": 0,
      "user": "subodhraj4u"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "i did not see the film in 3d, but what was this?",
      "total_reactions": 0,
      "user": "RagingMammoth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Chrome: right click on score bar: inspect element: find  Chrome: right click on score bar: inspect element: find  Chrome: right click on score bar: inspect element: find  Chrome: right click on score bar: inspect element: find  Chrome: right click on score bar: inspect element: find  Chrome: right click on score bar: inspect element: find",
      "total_reactions": 0,
      "user": "Bob197"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "This is Nixxy movie! Like the previous Piranha movies! Please make a realistic sequel!!!!!.........................BORING!.....................Please~~",
      "total_reactions": 0,
      "user": "tequila_sunrise"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "5/31/12: I can't comment on this film properly, as the stupid Philippine MPAA cut 20 minutes of this 80 minute movie. I'm going to unfortunately find a pirated version of this film uncut, and then I'll comment back later.",
      "total_reactions": 0,
      "user": "btzneb92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Completely ridiculous, one highly enjoyable cheesy horror film, the ending was one of the funniest and unexpected things i've seen in a long, long time.",
      "total_reactions": 0,
      "user": "billylenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "completely insane, and loving it...",
      "total_reactions": 0,
      "user": "emilypyre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Great, gory, rowdy fun, neither piranha movies are really that scary, but they are incredibly fun and gratuitous, and that is why people love it...",
      "total_reactions": 0,
      "user": "cweyland"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Silly and f***ing hilarious, i loved it.",
      "total_reactions": 0,
      "user": "onegreenematt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "there is a movie pesima movies that are terrible and this is no exception. pesima movie I do not know if the producers had wanted to make a trilogy with this film was made ​​clear that if one more go ruin the seventh art.",
      "total_reactions": 0,
      "user": "Cadmielt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "You won't last a second watching a terrible movie. The only thing is not 3D, just worse comedy and extermely boring attacks. Jaws is better and the original is much more thrilling than this waste of time.",
      "total_reactions": 0,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Why this movie was made as a sequel?!! It would be way to better if it was a parody, it will be really nice and I WOULD give it a 10/10! But it is not so ZERO A BIG FAT ZERO!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Come on now, why is this film so underrated?! :D  I enjoyed it!  I don't say its perfect,  because it's not. This film is a PARODY. It's funny, hilarious, etc. And there some nice girls too. For me this was better then the original \"Piranha 3D\".  :p",
      "total_reactions": 0,
      "user": "hunboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "i did not see the film in 3d, but what was this? the acting plain sucked. the film didnt know what it wanted too be, a comedy, a parody, action or horror. im not even going too go into huge amounts of depth of why i gave it a low rating, because it really doesn't deserve mine, or anybodies attention. and the ending.. really? walking... nevermind. you'll understand if you have seen the film. the reason why i'm not giving it a one, and a 2 is because of the 'bring me my legs scene'. that was just.. amazing... in a awful way.",
      "total_reactions": 0,
      "user": "MrRagingMammoth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "What did I just watch? The answer: 87 minutes of nudity, unneeded snap zooms, overly color corrected blue water, and absolutely zero plot or character development. I always try to find good in a film, but there are very few aspects of Piranha 3DD that made me enjoy it. The idea this film is based around is far-fetched to start with, but the creative team took it to an unfortunate extreme. Who was the protagonist? Who was the antagonist? What is stasis A and what is stasis B? Why do I care about any of the character's fates in this slaughterfest? If the director or any of the actors could answer these questions I would be impressed. It's a pandemonium of scenes spliced together and put on screen. This movie was made for the money not ratings, which is a shame. What is the Sci-fi/Horror genre becoming?",
      "total_reactions": 0,
      "user": "Luke_McLaughlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "A complete trash with lots of nudity which could have been good without the nude scenes. If you are easily offended, don't even think about watching the movie.",
      "total_reactions": 0,
      "user": "supermann234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "An absolute disgrace to movie making.I don't know what were they thinking making this movie and what was I thinking when I decided to watch this piece of crap called movie.From the acting to the deaths,everything it's so horrible that it gets laughable at times.Simply terrible and to those that maybe still haven't seen this just DON'T,save your time and use it for something else.",
      "total_reactions": 0,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Com um péssimo roteiro, atuações que beiram o cúmulo do ridículo e cenas apelativas de nudez e mutilação \"Piranha 3D\" consegue ser apenas mais um filme trash criado para adolescente acéfalos ou sem o menor senso critico",
      "total_reactions": 0,
      "user": "LucasTReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 1,
      "text": "Piranha 3DD? or Boobs 3DD? or silicon 3DD? Either way its cheesy, worst CGI ever and worse than the previous films, I think that film parodies are better than this crap! It uses every cliche in every film...ever.",
      "total_reactions": 0,
      "user": "matthewmn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2016
      },
      "score": 1,
      "text": "Illogical, dull, with a stupid story-telling and a completely deficient direction —and of course, gloomy interpretations—, Piranha 3DD is a sorry film of the one-of-a-kind saga, started by the classic Piranha, which was (in difference of this trash) a really great one.",
      "total_reactions": 0,
      "user": "Futuredirector"
    }
  ],
  "metascore": 24,
  "name": "Piranha 3DD",
  "num_weekends": 3,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 1,
    "month": 6,
    "year": 2012
  },
  "opening_weekend_income": 182237,
  "opening_weekend_income_currency": "$",
  "rating": 3.8,
  "rating_count": 33090,
  "rating_freq": {
    "1": 5739,
    "10": 1728,
    "2": 4563,
    "3": 5312,
    "4": 5327,
    "5": 4546,
    "6": 2920,
    "7": 1691,
    "8": 912,
    "9": 352
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 166,
  "votes_per_demo": {
    "aged_18-29": 13261,
    "aged_30-44": 12957,
    "aged_45+": 2271,
    "aged_under_18": 89,
    "females": 3423,
    "females_aged_18-29": 1905,
    "females_aged_30-44": 1124,
    "females_aged_45+": 207,
    "females_under_18": 16,
    "imdb_staff": 1,
    "imdb_users": 33090,
    "males": 25977,
    "males_aged_18-29": 11233,
    "males_aged_30-44": 11689,
    "males_aged_45+": 2022,
    "males_under_18": 73,
    "non-us_users": 18717,
    "top_1000_voters": 337,
    "us_users": 4470
  },
  "year": 2012
}