{
  "avg_rating_per_demo": {
    "aged_18-29": 5.8,
    "aged_30-44": 5.6,
    "aged_45+": 5.9,
    "aged_under_18": 6.2,
    "females": 6.1,
    "females_aged_18-29": 6.2,
    "females_aged_30-44": 5.9,
    "females_aged_45+": 6.3,
    "females_under_18": 6.9,
    "imdb_staff": 5.7,
    "imdb_users": 5.7,
    "males": 5.7,
    "males_aged_18-29": 5.8,
    "males_aged_30-44": 5.6,
    "males_aged_45+": 5.9,
    "males_under_18": 6.1,
    "non-us_users": 5.7,
    "top_1000_voters": 5.2,
    "us_users": 5.8
  },
  "avg_screens": 1411.5,
  "budget": 60000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 6,
    "year": 2011
  },
  "critic_review_count": 225,
  "duration": 87,
  "genres": [
    "action",
    "fantasy",
    "horror"
  ],
  "gross_income": 29136626,
  "max_screens": 2864,
  "mc_avg_user_score": 5.2,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 95,
  "mc_movie_name": "Priest",
  "mc_negative_rating_frequency": 60,
  "mc_positive_rating_frequency": 65,
  "mc_pro_critic_reviews": [
    {
      "critic": "S.T. Vanairsdale",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "To Stewart and screenwriter Cory Goodman's credit, the whole set up takes about 10 minutes flat, leaving Priest's remaining 77 minutes to the dark, desolate action at hand. Even more to their credit, there's something evocative in that darkness, something poetic in its desolation."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "It appears that turning the John Ford/John Wayne classic \"The Searchers\" into the church-vs-vampire adventure Priest was not an altogether god-awful idea. As long as we don't get \"The Man Who Shot Liberty Valance\" as an elegiac zombie drama, this adaptation of a graphic novel has some bite."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "In an era where monster mythology has become raw material for all sorts of mediocrity, Priest is one of the best examples of a broad-scale vampire blockbuster."
    },
    {
      "critic": "Mark Feeney",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Priest is based on a series of Korean graphic novels. What it's really based on, though, is other movies - a whole lot of other movies."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "This is mildly entertaining for its cheery sacrilege (crucifixes that turn into throwing stars, etc), but once the premise has been rolled out, the movie is about as surprising to watch as the Stations of the Cross."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Not exactly an unholy mess, but still a rather too pious retread of classic sci-fi/action/horror riffs that lacks originality or pizzazz."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 42,
      "summary": "Its B-movie sins are many, worst among them an icy hero and a plot that feels like it was built from relics of other, better films."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "Bettany exudes an intensity that lays the groundwork for an interesting character, but Priest hasn't a prayer of creating anything more subtle than the giant cross tattooed on his face."
    },
    {
      "critic": null,
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "The film is somehow a disappointing combo of too-full and oddly empty. Even with all the various parts and pieces going into its structure, it feels bare-bones."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "It becomes clear pretty quickly that the only real thought in the movie has gone into the cowboy-gothic costumes and the computer-generated effects."
    },
    {
      "critic": "Ray Bennett",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "A short, dour and stodgy creature feature with average 3D effects that draws on so many film influences from westerns, action adventures and sci-fi tales that what fun there is comes from spotting the many sources."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "A mad mash-up of sci-fi, Western, sacrilegious  silliness and vampire movie.\r\nWhat lifts it to \"I've seen worse\" status is the previous teaming of star and director Scott Stewart, who last gave us the archangel fighting off other angels fiasco \"Legion.\""
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 33,
      "summary": "Bettany's performance consists entirely of a purposeful frown paired with a menacing glare: He goes about his godly business with solemn, no-frills intensity. The film follows suit."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "If you go in without high expectations, you'll be decently surprised. This is definitely one of those movies you instantly see and know it could have been better if not for its restrictions with its pg-13 rating. In the obnoxious current vampire craze, this takes a different direction and its welcomed in my opinion. Being based on a graphic novel helps, no twilight influences here. The beginning doesn't drag on, it spends just enough time on the character development and gets going. Parts are cheesy and some dialogue is corny, but the most part, it's worth seeing. I didn't care for the way it ended, its not terrible, but it could have been done a lot better. If your on edge, probably see it in a budget theater or rent it, you won't be missing too much.",
      "total_reactions": 4,
      "user": "shadowhawk749"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "All is not quiet at the Catholic Holy Cross Cemetery. Somebody get a priest. On second thought, don't. That's what has John Ford rolling in his grave to begin with. It's the breach in the fine line between homage and ripoff. The sacreligiousity at work here is two-fold. The filmmaker manages to upset both Christians and cineastes in equal proportions. The \"Legion\" director, whose funny idea of the holy spirit in his 2009 debut was that God would send down a battalion of homicidal angels to zombify the masses with an ecclesiastical opiate, has moved on from ripping off a B-movie classic like George Romero's \"Night of the Living Dead\". Now, in his not-so-infinite wisdom, he's raiding the film canon for ideas. In \"Priest\", the filmmakers takes \"The Searchers\" template and replaces the cowboys and Indians with clergymen and vampires, then sets their ongoing hostilities toward each other in a dystopian world where the Catholic church functions as a totalitarian regime. The all-powerful monsignors, a group of theological autocrats, who preside over the God-fearing masses in these walled-up cities, use Orwellian-like methods of mind control to neutralize the priests, whom the church disbanded after the vampire menace was deemed to be over. Taking a cue from Sam Peckinpah's \"Ride the High Country\", the priest(Paul Bettany), no longer a useful member of society(the marginalized vampires are tucked away on reservations), is reduced to shoveling coal for a living, a humiliating job, similar to the cowboy Westrum in the 1962 film, who runs a rigged carnival game out of desperation. (Alas, Peckinpah was cremated and had his ashes scattered at sea.) Unlike Ethan Edwards(John Wayne), the priest never returns home to be among the kinfolk. That's probably because he still covets his brother's wife, Shannon. The child they bore together prior to his leaving for the clergy is a dead giveaway; the child whom Hicks and the priest with no name are now searching for. Fate. You can't run away from it. By roaming the city all those years like a vagabond, the priest avoids the sexual tension that Ethan faces when he finally succumbs to love and returns home to see Martha Edwards, still married to his brother Aaron. In the film's iconic first shot, when Martha opens the door, framing the outback in its opening, you notice her hands, first the left, then the right, gripping the house itself to steady herself as she makes her way outside. In that instant, she's not a mother and wife; she's a woman in love, struggling to remember her vows. While Ethan approaches the homestead, Martha does something very subtle with her hand that hints at the desire which belies her blue dress and white apron get-up. Before she straightens her fingers to block out the glare of the sun, they're arranged at the forehead in such a way that suggests she's about to faint. It's not the heat; this conservative frontier woman is swooning. When Ethan chastely kisses her forehead, she closes her eyes. Meanwhile, the Confederate Army hero isn't thinking straight either. The cowboy mistakes Debbie for Lucy, despite the girls being at least ten years apart in age. That's anguish. He wants to turn back the years. Because of \"Priest\", with its similar but different relationship dynamic between Ethan/Priest and Martha/Shannon, perhaps, a shared sexual past, and not unrequited love, is the correct interpretation for Ethan's stolen glances and the way Martha gently smooths her brother-in-law's military coat. Maybe, just maybe, the identically named Lucy is Ethan's daughter. Now the scene where Ethan and Martha's hands briefly touch as they both reach for a lantern becomes more ambiguous. Aaron, who is storing money away while this display of subtle intimacy takes place, rather than being oblivious to his wife's slight marital indiscretion, may possibly know, and accepts their muted flirtation, but chooses to look the other way. In \"Priest\", Owen knows that the child isn't his. Evidence of a sexual past can be gleaned from the scene in which Ethan stabs the soil(vagina) with his knife(penis), a metaphorical remembrance, perhaps, of the night he and Martha conceived Lucy, whose denuded lifeless body the war hero discovers in the cave. \"Don't ever ask me MORE,\" Ethan tells Brad, later on, when Lucy's boyfriend mistakes a squaw for his betrothed. \"More\", filtered through \"Priest\", suddenly becomes a loaded word. Whereas Ethan's love for Martha outweighs his hatred for the Indians as the determining deterrent against killing Debbie, a converted Comanche, in \"Priest\", Hicks(the stand-in for Martin), Lucy's protector, probably knows that vampire infection isn't the sole reason for the potentiality of the father committing fratricide. He broke his vow of celibacy. The timeline is a mere technicality. Now he must atone, murderously. Does the priest love God more than his daughter? Thankfully, no.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "This movie could have been much better than it was. The main actor paul bettany played the priest and he certainly fit the role. Everything was great but the plot could have been better. I really liked the costumes. Thanks to this movie I decided to buy Legion to check that out due to Bettany's performance in this movie.",
      "total_reactions": 1,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "This movie is laughably bad, seriously I laughed throughout this entire thing at how stupid it was, it takes place in some kind of futuristic sci-fi western world, the acting is horrible, and I found myself literally predicting everything that would happen, from what the characters would say, to what was around the next corner, to how it all play out, and it has what is probably the worst ending of all time, and it tries so hard to be serious which makes it all the more pathetic, honestly avoid this movie at all costs unless you looking for a good laugh, the only reason it's not scoring lower is because I had so much fun laughing at it, this may just be one of the worst movies of all time, don't waste your time or money.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "I actually got some good entertainment. Priest is set in the future after a war between vampires and humans has come to an end. But after a vampire attack outside of the city and a kidnapping of Priest's niece and death of his brother, he defies church vows and hunts down the vampire. There is a twist in the film that is thrown in there. But this movie isnt really about the story. its a stylish action film and big step up from Legion, Scott Stewart's directing debut film.",
      "total_reactions": 1,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "i have to say that this movie actually surprised me. i thought this movie had decent dialogue (could've been much better) the action scenes were fantastic and the plot was decently put together. considering the fact that the producers had very low intentions for this movie anyway makes it even better. i believe if they had any real hope in this movie it could have been very much better. while watching it i though of countless scenarios to which priest 2 could be about(im actually trying to write a script for the second one just for fun) this movie has real potential. they could've tied in religion a little deeper into the action, etc.i also like the way they depicted the vampires. i like that they took the eyes away, considering that \"vampires are soul-less creatures\". the ending of the movie was a cliff hanger pretty much (they never found the queen). so they can work that into the sequel (which is one of the major stories of my script :-] ). there are many scenarios they can work into it to make the movie much better. so, this movie has real potential but nobody really believed it would do goo, so that's why it really didn't. the key to any movie is confidence.. with out that, you wont put much effort into the production and in the end have a disaster of a movie....",
      "total_reactions": 1,
      "user": "xclusivedabest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "not the best film i have seen by far, but still enjoyable if you like crazy fight scenes and some impressive usage of weapons, storyline is a bit weak and hard to get into, but the action alone was enough to keep me interested",
      "total_reactions": 1,
      "user": "Shwesty"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "I expected little, I received even less. I didn't expect a full blown story, but a full of fights and special FX spectacle. It lacked those also. Its more of a trailer for Priest 2, than an actual movie. Considering the back-story the possibilities are endless, but ... they were not even touched. And open ending makes me fear continuation.",
      "total_reactions": 6,
      "user": "Arrow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "\"Priest\" tries to tame the wild SF+horror+western genre with impressive CGI. Ultimately, the movie is what you will expect.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "I had low expectations for this movie because Legion was so awful. But i was veryy surprised to see just  how good this movie is. The plot, in a nutshell, are combat trained priest who kill vampires. One priest goes against his vows to save someone special from a mysterious enemy. I'm not familiar with the source material but this was good enough for the style of movie. I first give my kudos to the directing style. The movie moves at a perfect pace by focusing on the action but slowing just enough to give the audience insight into the characters. Action sequences really stand out and pretty violent for PG-13. The characters aren't very deep but just right for this movie. Also the dialogue never gets preachy or sappy just for the sake of it. This film is just what it should be and i fully recomened it.",
      "total_reactions": 4,
      "user": "Libra85"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "This movie took one of my favorite graphic novels and turned it into a watered down, PG-13, Church VS Vampires piece of junk. I have never actually boycotted a movie before but there's a first time for everything.",
      "total_reactions": 3,
      "user": "tfitzzz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "I enjoyed this movie. Paul Bettany, Karl Urban, and Cam Gigandent (3 main characters) did a very good job. I loved the beginning of the movie and how they explained the setting of the story. I also loved the new take on vampires.",
      "total_reactions": 3,
      "user": "Princess_Peach"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "Unlike the film vampires you are familiar with who are articulate, handsome, and philosophical, the vampires in Priest are savage animals, almost like feral wolves.  Based on a series of graphic novels, the title Priest refers to an elite squad of vampire hunters who, working directly for the Catholic Church, battle vampires.  According to the back story, humans and vampires have been in direct and bloody conflict throughout history.  Due to the priestâ",
      "total_reactions": 6,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "If you're a fan of vampires, you probably won't like this movie.  The bad guys could have been anything in this movie - another race, zombies, etc.  This movie does not delve into the history or complexity of vampires, it is simply a shoot-em-up good guy against bad guy movie.  It is predictable and there is nothing new in the story telling.  I have to give props for the overall look of the movie, however.  I liked the dark, sepia look of the film, and the CGI looks good.  At first I was taken aback because there was no female love interest, which is mandatory for a Hollywood film these days, but sure enough the woman shows up halfway through.  As it turns out, she is probably the best actor and most interesting character in the film.  The ending sets up a sequel, but I don't think it garnered enough ticket sales for that.  We'll see.",
      "total_reactions": 4,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "This movie is just plain lame. There is nothing really special going for it. It seemed like it would be a pretty cool idea, but it pretty much just failed throughout. I didn't care for the characters and the action wasn't great. In the end, I pretty much just didn't care what was gonna happen in the movie.",
      "total_reactions": 2,
      "user": "BingoTrousers14"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Now to be honest I was expecting at least a bit more. But I was still satisfied with the final result and is a big enough improvement over Legion. Priest is based on a series of Graphic Novels. What I like about this movie is the fact that the vampires aren't really normal. They're like savage animals and much more monstrous than the average ones you see in Twilight who in my opinion aren't proper vampires at all. But anyway let's get to the acting. The acting wasn't too bad but it wasn't really good either. It was just average and good enough for a film like Priest. Paul Bettany's and Maggie Q's performances stood out compared to everybody elses but apart from that nothing much. The story was pretty good. Priests vs. Vampires and all that stuff. It was pretty good. The action sequences and the effects were awesome so if you want to see the film just for the effects (but why would someone do that?) you can. And you won't be disappointed. So I'll just round that all up and give Priest an 8/10 for Paul Bettany's performance and effects but the acting could have been better. This is Mewtwo465 saying goodbye.",
      "total_reactions": 5,
      "user": "Mewtwo465"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "The Korean comic book after which this movie seems to be patterned (same name, same creatures) is better to read than this film is to watch.  Feeling sorry that Bettany's acting skills couldn't have been put to better use.",
      "total_reactions": 3,
      "user": "BrahmaBull"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Priest is...a bad movie. But I enjoyed it, I thought it was rather entertaining and hilarious. It was, (shall I say), Soo-bad-it-was-good.",
      "total_reactions": 3,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "When will Hollywood learn? When you take mature content and turn it into a P-13 movie you ruin the source material and are left with a watered-down piece of garbage. Personally I have have grown so tired with Hollywood I rarely watch movies these days. Let alone spend money on them. Gaming is the best form of media entertainment to be had these days and Hollywood takes no shame in continuing to ripoff their ideas. Just like they have been doing with Graphic Novels and Comic Books. There are no creative people left in that town. Most of the quality talent venture into gaming.",
      "total_reactions": 10,
      "user": "HaVoK308"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "It's a borderline boring movie that's saved by a stellar performance (in a limited role) by Maggie Q. She should have been the star of this film - and should be the lead in something coming up. Her action sequences are terrific.  The rest of the movie is ho hum - too grim, not enough humanity. The story is just not that compelling.  Paul Bettany is solid in general, but he's tough to root for here. I enjoyed the opening animated sequence probably more than the movie itself. For some reason, this film reminds me of the far superior Equilibrium with Christian Bale & Taye Diggs.  (Rent that one instead).",
      "total_reactions": 5,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "the movie was bad, not good special effects, lousy performances, the plot of the movie was the typical and boring story, and the main thing was an insult to the legends of vampires, that nastiness, I hope not torture comesfrom the the second part",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "In contrast to the glimmering, good-looking people vampires have been portrayed to be in recent movies/TV shows, the vampires portrayed in Priests are the complete opposite, and is pretty awesome. However the story was bland and some of the dialogues felt awkward. This movie seemed more like a straight to DVD, or a made for TV, type film. I would recommend that those who are thinking about watching this in theaters to skip it and pick it up for rental when it comes out.",
      "total_reactions": 2,
      "user": "herrojew"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "Priest was not a good movie. The plot was weak. The battles sequences were subpar at best. The special effects were nothing to write home about either. The movie also seemed to be quite short. I was disappointed because the previews looked promising....but it did not deliver at all. Should you see it? In my opinion.....no. But I am not you.",
      "total_reactions": 1,
      "user": "xGreyWardeNx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "This movie is horrible. I thank God i've been on a promotional screening and i didnt have to pay for it...",
      "total_reactions": 1,
      "user": "badrain"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "Priest was a good to kill some time movie. The only reason I saw it was because its free because i work at a movie theatre. If i had to pay for my ticket i would've been very upset, especially if I payed extra for the 3D. I watched this movie before I had to go into work and i couldn't complain because it was free and I was only watching it to kill time and it looked like it had potential. Thi movie was ok though. Paul Bettany we all know isn't the greatest actor on the planet. He's a good action film star. This film was pretty much like Legion except in a different area and even darker. Karl Urban plays the villain and I have to say he did an absolute horrible job. His acting was terrible, I don't know if it was the writing or what but he was bad, his lines were so dumb. Overall a 4/10, if your seeing it for free then its worth a watch but if your paying then I would save your money.",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "Plot of this \"movie\" is so banal, stale and lacking of originality that it can be written a piece of tissue. I had that strange feeling during this movie that it was shot in a fast forward and lots of stuff was simply removed it during production. It lacks any details at all. Though I'm not sure if I want any of them at all. Actors play as if they were some kind of volunteers and not being paid for their jobs. Cliche.",
      "total_reactions": 1,
      "user": "Zeak"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "When I saw the movie I felt that the motorcycle was the star, maybe the motorcycle expressed more emotion than the lead actor. totally predictable and boring occasions, monetarily is entertaining, JUST monetarily.",
      "total_reactions": 1,
      "user": "DDtcs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "\"Priest\" is exactly what you'd expect it to be - a blood-infested, action-packed, testosterone-charged action fest. That does not necessarily mean it's bad, it's just typical. It follows a rather linear story, with bad dialogue (very machoist, many a times) and some bad visual effects. For a change, however, it does show vampires as not the over-sexualised, highly intelligent beings, but as brute alien like monsters, which was somewhat refreshing. The film is also surprisingly short with only 1 hour and 20 minutes - definitely could have been longer. Well, if it had been better, it could have been longer. The way it is now, though, 1:20 is perfectly fine. I don't even know what to say. Yes, it's entertaining, but it won't leave you with wanting any more than what you've been given. The ending does provide for a perfect (intentionally so) setup for a sequel, that due to horrible reviews and box office will never be made. The films biggest flaw is its poor screenplay, but that might be a fault of the original comic book too, which I have never read before. In general, the film was overly predictable and not very exciting, though reasonably entertaining. Going into it you won't find anything that you haven't seen in films like this before, but you won't be completely disappointed either. If you are looking for what I've described in the first sentence, you'll definitely get that. If you are looking for some genre changer, you will be severely disappointed.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Paul Bettany plays a holy man who's also a badass vampire killer. Unfortunately, the movie isn't badassâ",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Priest is everything one would expect out of a movie where a priest fights monsters. First, let's set the back story: the year is 2017 when the Catholic church, in an attempt to make young children more...available, begins to create their own stock of humans, genetically engineered to have super-sucking abilities. Everything is well and good until these creations become self-aware, and turn into vampires (naturally). In any case, it's a wonderful morality play, and it's got everything you want: trains, vampires, wastelands, and that albino from The Da Vinci Code. 10/10, go see Priest.",
      "total_reactions": 0,
      "user": "boneshaker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Poor movie that doesn't know if it is a western, a sci fi or a horror and is severely lacking in script or character depth (despite there being ample opportunities for either). The ending is a damp squid and I am struggling to find another movie where an evil foe was defeated so easily. Although left open for a sequel hopefully everybody will decide to do the world a favour and leave this in the bargain bin section where it belongs.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "This movie had a lot of potential, but really fell short in terms of dialog, story, and acting.  The action scenes were visually stunning, yet they were short and sporadic, leaving a lot of dull, corny, in-between scenes without substance.  If the producers would have gone with an R rating and had more horror gore (something like 300), then the \"graphic novel\" feel to the setting would have possibly made up for the bad acting, plot, and dialog.  I gave Priest a 3, because it really is not worth seeing or renting.",
      "total_reactions": 0,
      "user": "Geogun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "First impressions afer watching it are that its spends far too much time putting foundations down for a sequel throughout the movie, again telling you too many explantions for why things are etc... it felt like they needed to say it for the sake of it.... trying too hard is all it feels like, and falls short because of it. I only watched it for karl Urban, and he thankfully came out of this smelling of roses even with his cheesy bounty hunter style vampire, unfortunately the rest is quite bleak and feels a missed opportunity.",
      "total_reactions": 0,
      "user": "HighwayUK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Weak. I expected as much. There is nothing really new here and Bettany continues in these lackluster, apocalyptic films that have just become old-hat now. Is this his companion piece to Legion (which was a slightly better film)? I can't say I was thrilled, excited, or even mildly interested in what was going on on-screen. This film is just tired and and it tries too hard and I found myself asking, \"Is it over yet?\"",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "People giving this movie bad reviews either don't like vampire movies, or don't know anything about them. Priest is not meant to be Twilight. It's not meant to be sexy. It's meant to be awesome, and it is. Another guy on here was talking about Hollywood taking rated R movies and making them PG13 (which makes them horrible normally-I definitely agree)...I think this movie is the exeption to that PG13 is censored R rule. Priest is not a movie that feels like it was forced into being PG13 and I remember being worried about it sucking because it is pg13. I mean the movies' main character is a priest...it's not like there's going to be a lot of sex and 'bad' words...the violence is bloody, not gory.",
      "total_reactions": 0,
      "user": "andwee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "Here's my attempt at a non-biased review. The movie overall was not good. One of the things that erked me the most was the main character. For one the actor was not what you'd call a good choice. Don't get me wrong he wasn't bad, but he did not fit. A skinny little white guy with a cross  on his face is going to save the world from a vampire threat? Ewwww not going to fly. Plus, lets also add in that his fight seens really weren't to immaculate. Yes, he did kill vampires in various ways which was pretty cool, but then at the end when he had to fight the main bad guy he just got **** up. He really got **** up. Now im aware that he is only a vampire killer and he should only do well against vampires, that in and of itself destroys the badass thing that the movie was going for. Yeah he's pretty cool fighting **** that he knows how to kill and that he can kill easily, but when it comes something a little bit stronger he just gets destroyed. There was no improv from his part he justs get beaten up and then saved by the girl priest. Not very badass......at all. So the writing for the main character could have been much better and then they definately needed a new actor, I'd say vin diesel, or \"The Rock\" or maybe Jason Statham or someone along those lines.",
      "total_reactions": 0,
      "user": "Eatmyreviewdawg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "This movie had great potential and was squandered. The quality of the world that was created was passable albeit a mash-up of Blade-Runner, Dune, and any given western.The character development was very lacking and we only got a surface treatment of who we think the characters should be. The biggest problem wasn't the actor's(except the sheriff),  it was when I left the theater I felt that I just payed in full and only watched half a movie.",
      "total_reactions": 0,
      "user": "Carnaged"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "As someone who was previously unfamiliar with the Priest comic series, but a big fan of comics, I have to say actually enjoyed this movie. I'm as surprised as you are, but it's largely due to the fact that by not being a fan, nothing was ruined. For a comicbook movie, it's fun. The acting is par with action movies, there's some decent action scenes, and I'm not left confused or depressed. In the realm of comicbook movies; it's equal to the Blade movies, the Spidermans, and better than the recent Captain America, Green Lantern, or any of the X-men movies. If you're by a redbox, I say splurge on the dollar rental!",
      "total_reactions": 0,
      "user": "Redfordsto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "These are wonderful! Thank you for sharing gucci handbags on sale coach bags cheap gucci outlet Discount Gucci Gucci 2011 New Perhaps this is one of the most interesting blogs that I have ever seen. Interesting article, Funny comment. Keep it up!",
      "total_reactions": 0,
      "user": "zippo1515"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Boring, slow paced movie with uninteresting and forgettable characters. The 9s and 10s the people are giving are from people that watched the film on the big screen and feel bad for wasting $10 for this film and are in denial. Not enough fight scenes, not enough interesting dialogues, you sometimes forget the cowboy kid is even in the movie; why was the kid in the film anyway? I forgot. Atleast the improved it just a lil' bit from legion but thats like saying the s*** I took today improved from the sh** i took yesturday.  The only character thats actually half decent is Karl Urban who plays the Black Hat and thats because he was surrounded by stupid characters so it Karl stands out. Boring movie. Rent it ONLY if you are a fan of Paul Bethany like me (thought I'm starting to lose faith in his work)",
      "total_reactions": 0,
      "user": "LordOFlibertY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I rather enjoyed this film, not as much as Legion but it's a very different film, but it could have been even better. I do not understand the excessive criticism, ok it wasn't wholly originl but so what ? For the worst thing is that the film doesn't really end. It is clear they set you up for a sequel one cannot but feeling cheated as you prepare for war the entire film and it all ends after one battle. Also what's with the low certificate ? This is not stuff meant for children, they should live the film as the filmaker intended it and stick a 15 certificate as a minimum, 18 even better. I hope they do Priest 2 as there's much to explore and to improve. I do not think it's worth a 10 but neither a 2 ! What kind of vote is 2 ? This movie is no disaster, yes it's borrows elements everywhere but so do other accepted hits, it merely needed more time and maybe a better cut. Karl Urban and Paul Bettany are good as usual.",
      "total_reactions": 0,
      "user": "Morituri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "This is one of the worst movies I've ever seen. The story isn't original. They chose the wrong actor for the main role. Why is whenever Hollywood makes a movie like this one, that they always choose the wrong actors. I mean really. To be perfectly honest, I think this movie was a waste of Hollywood's time and money.",
      "total_reactions": 0,
      "user": "wolfritz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "My recipe for a Priest ****  add equal parts of Blade 2 and Equilibrium into a glass.  Add a splash of The Searchers.  Serve with a slice of Mortal Kombat as Garnish.  Enjoy.",
      "total_reactions": 0,
      "user": "AtomicSwirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "I really didn't know what to expect with this movie. As soon as the movie began to play my eye instantly caught the aesthetic style of the world that this movie painted, and the back story that set the film's plot up was decent to boot. The CGI was decent and the acting wasn't terrible. The movie opened with the tale of a war with vampires and special warriors called priests tasked with stopping the vamps. After the vampire threat was long thought diminished they begin to return. After this interesting set-up the film shifts it's plot to more of a rescue mission. it completely loses the scope that it sets up at the beginning of the film and ends with a very lackluster climax that is unfortunately forgettable, which is pretty much what I'd say about the whole film itself. The story just didn't pan out very well ant the cool art direction was ditched after the first fifteen minutes of the movie, They had a really cool noire looking city in the middle of the desert and we barley got to see any of it. This movie could have been so much more, well at least the vampires didn't sparkle...",
      "total_reactions": 0,
      "user": "RoscoeY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Priest is an alright film. It had some cool fighting scenes in this film and the actors did a solid performance for their characters. The problems with this film is the story isnt that great, ive seen better vampire films than this and alot of things in the film could have gone into more detail but they didnt. I would give this film a high rental.",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Well, this movies isn't really what I expected from such an entertaining trailer. I really waited for this movies, a long time, and when it showed I was like, WTF ? Seriously. Not that impressive, I don't usually give bad marks to movies, but this one, really doesn't deserve more than a solid 5, maybe not even that, I usually appreciate hard work and especially great actors, even though they were not at their best in this movie. Maybe wait for a better sequel, of course, I seriously doubt that. Mistakes, over mistakes, story-line wasn't that great, not really having that ground history, which people usually admire. Not much more to say, it's not completely a waste of time, but I have seen movies from that category, much much better. But if you are a movie addict and want to see something new, that will probably stun you at the end, when you're surprised what you did for the last hour and a half, watch this movie. Story-line beats special effects, in my opinion, and of course above all, a decent acting performance, even though I don't have much to complain about Paul Bettany, except the fact that he chooses his movies a little unwisely.",
      "total_reactions": 0,
      "user": "BeK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "Of all the great memories from vampire hunters like Selene from the Underworld series and Buffy the Vampire Slayer, there's only one movie that I missed the mark, Priest. This is one of the worst movies of 2011 because the action. the script, and the plain storyline is just not even worth a dollar. I still love Screen Gems, but they should've get rid of both Legion and Priest.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "\"Scott Stewart's Priest  is a dull movie with a boring script  . Priest doesn't have a single moment of enjoyment . Bad directing , Worst script , disturbing sound made this movie super boring ! Paul did his best but the others but most most of all Karl Urban made much more worst . anyone could do better then what he did . Spacial effect was not so good too ! and this movie ruined the comics ! overall its a its a time waste .  Story : 0.62 [wot well written at all]",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "This movie's unique style and rather creative setting gave it great possibility. Unfortunately, the film makers wasted it with a predictable storyline, zero character development, and a rather short and shallow plot. After watching it, I find myself engrossed by the setting, but still feeling like I only watched a preview. The only thing I suggest for this movie is, if you're into dystopian sci-fi, watch the first 10 minutes, then shut it off.",
      "total_reactions": 0,
      "user": "J_Thom123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "This was an enjoyable movie--good action, pretty good story. The ending was not the best--typical setup for a sequel which I doubt will be made based on the ticket sales this got.",
      "total_reactions": 0,
      "user": "joelschnick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "I think the most shocking thing about this film is that I didn't hate it. I actually quite enjoyed it despite the fact its obviously lacking in the same power as other graphic novel adaptations (Sin City). Priest doesn't try to push itself beyond the boundaries of its source material and that is why it works. It stays true to the world created in the novel while adding its own qualities, such as some of the beautiful landscapes. The film embraces western conventions such as costumes, locations and mannerisms giving this action film more to it than just a run, slice and kill experience. However the fact it has to embrace multiple genres also holds the film back with equal time being spent indulging in Blade Runner-esque dystopia which seems to overpower the film. If only there were subtle references to the futuristic aspect of the world but the film unfortunately spends a decent chunk of the beginning in the dark and dreary cityscapes instead of where the film belongs. The film is overburdened by the multiple genres but still manages to entertain. It even provides a new take on the vampire which I found very welcome, not because of Twilight or True Bloods over sexualized take on them but because it showed them as monsters, not redeemable creatures, not things that possess emotion but feral beasts, ready to rip you apart. I won't spend much time critiquing acting because this is not the kind of film where stellar work is required. The actors get the story from A to B just fine and Maggie Q even manages to tap into a well of emotion in comparison to Bettany's sullen portrayal of Priest (sometimes not giving a character a name is clever but in this case it just seems lazy). A fun little film packed with great landscapes and some terrifying monsters (No Karl Urban, you do not count) that entertains if only because it doesn't try to be fine art.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "This is how vampire movies go too far. Perhaps the comix had more plot and inspiring imagery unlike the movie, which looks very low budget and badly scripted. The main character seems to be the only one with slight personality, at best. Not worth it.",
      "total_reactions": 0,
      "user": "Endo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "The point of this movie is lost on me. I love  movies that make you think, but can't come up for an excuse for this beast of a picture. It's pretty much one of those movies that was drafted out in an hour and posted on screen. Vampires are the in thing right now, and the whole thing is just about chasing and wanting and hunting. I hate to say it, skip it and go see Twilight...just kidding.",
      "total_reactions": 0,
      "user": "LaursLacrosse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "People are failing to understand that there is some emotion here. The plot is mediocre but the characters are interesting in their own right. Its not that bad. Its an okay movie with a few cool action moments.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Priest could be done in a better way as there were many ideas to make a film very nice. The biggest flaw in the film was a definite lack of the psychology of the characters. But Priest has good scenes just helpful in the film (post-apocalyptic scenarios), well made and the special effects. The mixture of fantasy, horror and western succeeded. You can not say it's a bad film but a film in the media but it could be really nice if done in a more elaborate way (especially in speech).",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Priest is a ridiculously brainless and unmemorable action movie that seems to have had no effort put into any aspect of its production. The CGI could have been from the '90s, the slow-motion is irritating, and the 3D effects are obtrusive and gratuitous. The story is practically 'good guy fights bad guy' - then it ends. The acting, particularly from Gigandet, is laughably wooden. In fact, no one seems committed to their role, but it's not hard to see why; the make-up effects consist of a painted cross on the head -- everything else is CGI. When the actors are given NOTHING to work with, then it becomes difficult to put together a meaningful performance. It's interesting to note the amount of times the word 'priest' and its plural are said; often characters will just yell it out for no reason, making for what would be an interesting drinking game. That's just it, though; with all of its amateurishness, you could have a lot of fun with this movie in the right mood; it's lame, it's stupid, and it's most certainly terrible; but it's a hell of a way to kill 80 minutes.",
      "total_reactions": 0,
      "user": "Ven-Wede"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "Bear with me. This shouldn't take long.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Generic plot with dreadful dialogue. Priest had foolish and laughable dialogue throughout this undersized movie, which is used as a failed attempt to keep you on edge with the basic action movie storyline. A plus for the alternative perspective on the vampire, then the beautiful forms that presents themselves in todayâ",
      "total_reactions": 0,
      "user": "tterch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "With some of the reviews for this movie not being all that good I watched it with some trepidation, but that said, it's entertaining and easy to watch. Even though it's a sf-western-horror it at least treats vampires a bit differently than some current brain dead shows. I should say I haven't read the comic and it looks like the majority of people giving it a major thumbs down are comic fan-boys.",
      "total_reactions": 0,
      "user": "Thebob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Well, I wouldn't say the movie is good, because it isn't, but it is not bad at all, because of the lack of plot and the sudden boredom the movie starts to wreck havoc on.",
      "total_reactions": 0,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "mykhawke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "cool",
      "total_reactions": 0,
      "user": "robertashfield"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "violentmilk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 0,
      "user": "billylenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Priest  is a movie, that really attempts to make you think theirs allot more going on, than what actually is. I started to drift off in this movie, I just wanted it to end. I wanted to like this movie, but I was disappointed, nothing memorable about it. I give it a 6, cause it`s worth watching, but make sure you have no amazing other options.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "If there was ever a movie with a glaring weakness, than it might be Priest. The weakness dominates almost every scene: it is the male lead Paul Betanny. This becomes obvious whenever someone else walks into the scene, whether it is Karl Urban, Cam Gigandet or Maggie Q. Not notable names by any means, but they yank away the camera regardless.",
      "total_reactions": 0,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Priest é um filme razoavelmente bom,Paul Bettany,Cam Gigandet,Maggie Q,Karl Urban e a linda Lily Collins todos dão uma sólida performance. O Filme tem seus momentos,tem suas grandes cenas de ação uma boa de faroeste,mas Priest não passa de um bom filme.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "One thing that must be understood about this movie right off the bat is that it comes from the Blade and Riddick tradition of dark, violent action thrillers, and is therefore not meant to be excellent in terms of what critics would normally judge a film by. That said, the acting could still have been at least existent in the film. Overall, I got the feeling that reading the script would have shown more expression than most of these actors do. However, the vampire idea used in this movie is fairly unique compared to most movies, and the plot and action sequences were interesting enough to keep my attention.",
      "total_reactions": 0,
      "user": "XavierBlaq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is a complete waste of time. The performance was flat and hard to buy, the characters unmemorable, and the main villains are CGI unthinking monsters. Though there is a leader vampire who is actually played by an honest to goodness person, his part in the story is still unconvincing. I watched this expecting to see action, but I got endless clips of CGI, talking, and desert.",
      "total_reactions": 0,
      "user": "MarmaladeOven"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The good news is that Priest is not nearly as painful to sit through as Legion. But that's about it for the good news.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "This was a nice surprise...Post Apocalyptic vampire movie with a Western setting. Paul Bethany is perfect as a melancholy avenger.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ],
  "metascore": 41,
  "name": "Priest",
  "num_weekends": 6,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 5,
    "year": 2011
  },
  "opening_weekend_income": 396038,
  "opening_weekend_income_currency": "£",
  "rating": 5.7,
  "rating_count": 99465,
  "rating_freq": {
    "1": 2658,
    "10": 5869,
    "2": 2623,
    "3": 4915,
    "4": 9495,
    "5": 18404,
    "6": 24980,
    "7": 18159,
    "8": 8865,
    "9": 3497
  },
  "release_day": 13,
  "release_month": "May",
  "release_year": 2011,
  "user_review_count": 234,
  "votes_per_demo": {
    "aged_18-29": 36412,
    "aged_30-44": 42551,
    "aged_45+": 8764,
    "aged_under_18": 93,
    "females": 13966,
    "females_aged_18-29": 6544,
    "females_aged_30-44": 5668,
    "females_aged_45+": 1284,
    "females_under_18": 23,
    "imdb_staff": 5,
    "imdb_users": 99465,
    "males": 75292,
    "males_aged_18-29": 29522,
    "males_aged_30-44": 36390,
    "males_aged_45+": 7342,
    "males_under_18": 70,
    "non-us_users": 56699,
    "top_1000_voters": 477,
    "us_users": 15093
  },
  "year": 2011
}