{
  "avg_rating_per_demo": {
    "aged_18-29": 6.1,
    "aged_30-44": 5.7,
    "aged_45+": 6.0,
    "aged_under_18": 6.5,
    "females": 6.6,
    "females_aged_18-29": 6.6,
    "females_aged_30-44": 6.3,
    "females_aged_45+": 7.0,
    "females_under_18": 5.7,
    "imdb_staff": 6.5,
    "imdb_users": 5.9,
    "males": 5.8,
    "males_aged_18-29": 6.1,
    "males_aged_30-44": 5.6,
    "males_aged_45+": 5.9,
    "males_under_18": 6.5,
    "non-us_users": 5.8,
    "top_1000_voters": 5.4,
    "us_users": 5.8
  },
  "avg_screens": 600.8421052631579,
  "budget": 58000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 1,
    "month": 6,
    "year": 2012
  },
  "critic_review_count": 143,
  "duration": 125,
  "genres": [
    "action",
    "adventure",
    "drama"
  ],
  "gross_income": 49875589,
  "max_screens": 2573,
  "mc_avg_user_score": 5.8,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 31,
  "mc_movie_name": "Red Tails",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 44,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Thankfully, much of Red Tails is spent in the skies, where fighter planes swoop and zoom in thrilling dogfights with incendiary direct hits. Executive producer George Lucas apparently gave Hemingway the keys to his CGI kingdom, creating marvelously designed in-flight action and a sappy, snappy salute to the Tuskegee Airmen."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Overreaching fits of melodrama, occasionally stilted dialogue, and performances by Gooding Jr. and Howard that are mostly a series of serious faces can't keep the shiny Red Tails from taking flight."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "A well-acted, well-directed (by TV veteran Anthony Hemingway) popcorn movie with great aerial battles and solid dramatic scenes that hold your attention for two good hours."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Perhaps the movie's most surprising feat? Somehow, the darned thing mostly works, probably because its heart is in the right place."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 67,
      "summary": "Kudos to the makers Red Tails for paying homage to a remarkable group of men and their genuinely heroic deeds, and a hat-tip as well for the idea that the best way to tell the story was the old-fashioned way.  But would that the film's old-school aura felt knowingly retro rather than dutifully rote."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 67,
      "summary": "As long as it stays in the air, Red Tails is a compelling sky-war pageant of a movie. On the ground, it's a far shakier experience: dutiful and prosaic, with thinly scripted episodes that don't add up to a satisfying story."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "Sadly, the result is a disappointment. Sure, the aerial battles are technically adept and occasionally exhilarating, but it's almost painful to sit through some of the \"drama\" that occurs on the ground."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "David Oyelowo stands out as the daredevil Joe \"Lightning\" Little, the unit's best flier. With his bravery and bravado, he's the film's most complex character."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "There isn't a real, flesh-and-blood figure in the bunch. Everything about Red Tails - the breaking down of racial barriers, the military achievements, the courage and sacrifice - is diminished in the process."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "Red Tails is entertaining. Audiences are likely to enjoy it. The scenes of aerial combat are skillfully done and exciting."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "Such a story is made to be colored in jumbo crayon, and at first you might long for a more nuanced approach, but this film was produced in the 1940's serial style that's made Lucas Films enormous."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "In the end Red Tails is mostly about the coolness of flying. Its heart is in the clouds, instead of with the men at the controls."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 58,
      "summary": "When a great movie subject results in a middling movie, the loss is double."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "You leave Red Tails thinking of what might have been instead of what is – a missed opportunity."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Red Tails is both a stirring and simplistic tribute to the men that not only shattered the U.S. Army Air Corps' racial barrier but also saved the lives of many a white, B-17 crew member, all while downing countless numbers of Hitler's formidable, jet-propelled Luftwaffe."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Where Spielberg has made WWII a venue for his sanctimonious side, a platform to convince viewers that war is indeed hell, Lucas is still in a state of pre-adolescent fascination with the conflict."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie is so desperate to be palatable, to appeal to everybody that it doesn't taste like anything."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Every character here is so squeaky-clean, and the prejudice as depicted is so toothless and easily overcome, that the film feels like a gingerly fantasy version of what, in real life, was an exceptional example of resilient trail-blazing."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Red Tails squanders a great subject, reducing the real-life struggles and fierce heroics of the Tuskegee Airmen to rickety cliche."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 42,
      "summary": "The aerial sequences look an awful lot like X-wing-versus-TIE-fighter battles and the effects have the same not-quite-solid feel of the Star Wars prequels. When the heroes crash, they go up in blazes of digital glory that seem just as artificial as the plotting that brought them to their fates."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "For all the occasional grace of its high-flying derring-do, Red Tails barely feels like a movie. It's an uncertain hodgepodge of impulses and desires that never coheres enough to even crash and burn."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "To say that this live-action comic book lives up to Mr. Lucas's description is not a wholehearted endorsement. Are teenage boys as naïve today as they were 60 or more years ago? And much of the dialogue is groaningly clunky. But so it was back then."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "One could argue that the target audience - black teenagers, Mr. Lucas has said - might be most receptive to a film that conveys history through contemporary entertainment. But this isn't contemporary entertainment, it's antiquated kitsch reprocessed by the producer's nostalgia for the movies of his boyhood. The story has been stripped of historical context - don't black teenagers and everyone else deserve hard facts? - and internal logic."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "Alas, it was George Lucas who became captivated by the Tuskegee Airmen and has, after many years as devoted producer, managed to turn their story into a feature film that falls much closer to the goofy \"Hogan's Heroes\" in the spectrum of World War II-focused productions than \"Saving Private Ryan.\""
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "Apart from the occasional thrill provided by CG-enhanced aerial dogfights, this stuffy history lesson about the groundbreaking African-American fighter pilot division never quite takes off, weighed down by wooden characters and leaden screenwriting."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "George Lucas produced this candy-coated, fictionalized drama, and while its cast is first-rate and its flying sequences sharp, the movie is as glazed and wide-eyed as a 70-year-old comic book."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "George Lucas served as executive producer for this effects-heavy action film about the Tuskegee Airmen, and it feels as synthetic and dull as \"The Phantom Menace.\""
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "So narratively old-fashioned it creaks."
    },
    {
      "critic": "James Adams",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "Virtue aside, however, Red Tails is a lousy film. Not wincingly bad, mind you, just mediocre."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "The war-movie cliches are as abundant as the antiaircraft fire, and the dialogue as wooden as a balsa glider. The leading characters are issued one personality trait apiece, and some don't even get that. Cuba Gooding Jr., for example, plays Maj. Emanuelle Stance as a man who smokes a pipe."
    },
    {
      "critic": "Forrest Wickman",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 30,
      "summary": "Remember that scene from \"Raiders of the Lost Ark,\" when a swastika-stamped Nazi crate explodes for no good reason (beyond the fact that the Ark hates Nazis)? Red Tails is like that, only less awesome, and considerably longer."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "What's missing is any hint of realism. There's no grit to it anywhere."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "\"Red Tails\" (2012) is a film (fictional, but based on real events) directed by Anthony Hemingway and written by John Ridley, based on a book by John B.Holway, which tells the story of a team of African- American pilots, in the Tuskegee training program at a time when racial segregation was diffuse and explicit in society and in the army.",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "This film was ok, but if were to recommed a film about the Tuskegee Airman, i'd deffinatly reffer people to the video store for a copy of the last one that was made. The story isn't as good and i can't really say that improved CG made the flight sequences any more exciting. Worth a watch, but i'd wait for Netflix for this one if i could do it again.",
      "total_reactions": 1,
      "user": "Csquared1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "When I saw the trailer for this movie, it looked like it could of been a very good WWII movie. The film follows a group of African American Fighter pilots who struggle to get the appreciation that they deserve. The story starts with the pilots attacking only certain targets such as trains and trucks while the White Americans attacked all kinds of enemy targets. However by the end of the film, they are helping the Americans bomb Germany and attack the German Fighter Pilots.",
      "total_reactions": 1,
      "user": "MrHannigan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "After having consecutively viewed two early 2012 wide release war films, this and 'Act of Valor', I can say that 'Red Tails' is the better, but by no standard a worthy movie of it's subject material. It contains a lot of unauthentic dialogue between the Tuskegee airmen (which is really the most crucial and most difficult aspect of a war film to capture) and effects that would be considered the greatest effects of all time in a PC flier game, but are sadly just mediocre by today's standards for film visual effects. Throughout I remained unengaged emotionally and couldn't care less about the plights of these men, who I'm sure in real life had more struggles than those portrayed here. The movie is also a lot longer than could keep my attention and my mind began to drift to other things, missing occasional plot elements here and there, but I knew that the film would become redundant and I certainly could come back in with full understanding having missed nothing. I'm sure that the Tuskegee airmen are a subject not just worthy of a movie, but a great one at that, but 'Red Tails' isn't it.",
      "total_reactions": 1,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Red Tails should go down as a classic film.  The acting was good, the action was amazing, and the story was great.  I think too many people came to see this movie with their predjudices already warmed up, never willing to give this film a chance.  It's an important story, that far too many people in the world just aren't ready to face.  This is a definite choice to be in my DVD collection, and should be shared by fathers to their sons for generations.",
      "total_reactions": 4,
      "user": "md5269"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "The movie Red Tails is an amazing movie, that finally captures and embodies many of the emotions, and experiences of the African-American pilots of the 1940's. Not only does it manage to do this in a way that is somewhat nostalgic, but also successfully conveys the much needed to be heard aspirations of African-Americans to be respected within society. I believe the movie somewhat parallels the present day conditions we are experiencing now. Critics seam to be deliberately under rating the movie in an atempt to debase the movie's relevence, for whatever dubious reasons, but because the movie is exceptionally well done, like the African-American pilots of the Tuskegee experiment, success of the Red Tails movie is inevitable. I only hope and trust that people will remember which critics were correct, and which were way off in their assessment of Red Tails and movies like it. I loved this movie, and have hopes that more films like it will follow. It scores 10 out of 10 !!!",
      "total_reactions": 4,
      "user": "Yea-or-Nay"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Great Movie! So proud to be Tuskegee ALUM!!! Great acting and great script! So much rich history!!!!!!!!!!!!!!!!!!!!!!!!!! This speaks to the numerous untold stories of American Americans and other great pioneer of other races in this country!",
      "total_reactions": 6,
      "user": "friedasanders"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I loved Red Tails because it is a fun, action-packed, shoot-em-up movie that incorporates an important story too often left out of history.  I found the chemistry between the actors to be wonderful, and the story to be captivating -- i.e., underdogs fighting for a chance to kick some Nazi butt (not to mention just get recognized by their fellow countrymen as human beings).  Lastly it's refreshing to see a broader story told about our past, and celebrate a group of often unsung heroes.",
      "total_reactions": 6,
      "user": "ImJoshing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Unless your totally burned out by decades of Swedish art films",
      "total_reactions": 3,
      "user": "Benarden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I loved Red Tails because it is a fun, action-packed, shoot-em-up movie that incorporates an important story too often left out of history. I found the chemistry between the actors to be wonderful, and the story to be captivating -- i.e., underdogs fighting for a chance to kick some Nazi butt (not to mention just get recognized by their fellow countrymen as human beings). Lastly it's refreshing to see a broader story told about our past, and celebrate a group of often unsung heroes. Thankfully, much of Red Tails is spent in the skies, where fighter planes swoop and zoom in thrilling dogfights with incendiary direct hits. Executive producer George Lucas apparently gave Hemingway the keys to his CGI kingdom, creating marvelously designed in-flight action and a sappy, snappy salute to the Tuskegee Airmen.'ve read have some merit. Some of the dialogue may be stilted, some of the acting is stiff (but the acting of one of the lead pilots, Joe Little - a.k.a. \"Lighting\" is fabulous), the historical accuracy might not be spot-on... BUT, frankly I don't think these flaws take away from the bigger package of an exciting action movie. Cuba Gooding, Jr. as Major Emanuel Stance",
      "total_reactions": 3,
      "user": "Bustergundam4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I just got back from watching  RED TAIL,  It was an ok movie however, I thought it very much short of the movie a few years ago titled  \"TUSKEGEE AIRMEN\",  now that was a great movie about the Tuskegee Airmen and a goo war air movie about these guys.",
      "total_reactions": 8,
      "user": "flyboyala"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "â",
      "total_reactions": 5,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is excellent.  It is very historically accurate as well.  Most importantly it does address race and discrimination in a meaningful way without making that the focal point of the film.  As the theme states, \"courage has no color\" and that is expressed throughly as this is not a sad story about victims but a triumphant story about heroes despite all odds serving their country and excelling in it.",
      "total_reactions": 5,
      "user": "drjavi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Not a perfect movie, but definitely enjoyable. The characters are likable and the aerial combat is spectacular. This movie was not meant to be a docudrama about the Tuskegee airmen, but more of an action movie set to inspire today's youths and show a side of WWII that few know about. If you want factual accounts, then watch the History channel, but if you want to be entertained by a movie that was inspired by the Tuskegee Airmen, then please go see this movie.",
      "total_reactions": 5,
      "user": "MX312"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This movie had its flaws, just like every movie out there has. It did a great job, however, at showing the struggle the \"colors\" had to go through, even when defending our country. I can't give it a perfect score, because a 10 to me means i think it is the best movie for all of 2012. I can, however, say i can't wait to see it again!",
      "total_reactions": 7,
      "user": "Ironmonger"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Wow. Many critics have slammed the film. Not every movie is the artsy, indie, twisting plot will be a mess. I do not like the move from time to time, but it is not one of those films. If you are looking to feel like you're full of good movies, great special effects (and you do not take this film to be) inspired and learn something about history, then, to see this film and do not listen to critics. I see the movie opening night with my wife and we both love!",
      "total_reactions": 7,
      "user": "Ginqs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "I had been wanting to watch this movie since I first saw the trailer.  Now that I have seen it, it pains me that I have to give it such a low score.  It had so much potential and is based on the kind of people I admire.  I'm a pilot myself, and an aviation buff, and while I don't normally go out to watch just any movie, anything that captures the exciting moments and challenges of flight, especially the roar of a Packard version of a Merlin strapped to a P-51, is enough to give me pause.  Movies like these are a rarity these days so I had high hopes, but in a lot of ways, this movie simply crashed and burned.  (Note: Spoilers ahead)",
      "total_reactions": 4,
      "user": "Ming120"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "I went an watched Red tails yesterday and...well I must say that I was a bit disappointed with the overall flow of the movie.  I really wish that they would have just kept the main focus on two characters...I really felt no connection with anybody specific because the story lines were bouncing all of the map the entire film.  No real outstanding performance from Cuba or Terrance.  The Tuskegee airmen were an amazing group of men that didn't get the recognition that they so deserved but I feel Mr. Lucas fell short on this one.  Great dog fight scenes but aside from that I would wait for it to come out on DVD, don't rush out to see.",
      "total_reactions": 4,
      "user": "tuffcork"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Too much CG in a film that didn't need to have that much.  Relied too much on the computer for simple long shots of an air base.  Great story and it should be told.  Thought the actors did a good job.",
      "total_reactions": 2,
      "user": "smoman03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Hokey story but so what?  Flight scenes were fantastic!  POV in the fighters and the bombers really showed how fast things happen.  Most obvious cliche to me:  I knew the guy was dead as soon as she said yes.",
      "total_reactions": 2,
      "user": "psiclist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "I remember when I watch the poster of Red Tails, I think: \"other boring movie about the war, or all this things?\". After when I watch that George Lucas do the movie I think: \"I wanna watch the movie\", but after when I watch the movie I say: The movie is simple. Red Tails is a regular movie, the cast is okay, but I think some in the level of Star Wars, but no, in moments the movie is really boring, but in other moments is brilliant. I think that red tails is a DVD movie, but no a cinema movie.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "This movie was terrible. The story could have and should have been much more in depth. I liked the idea that G. Lucas wanted to produce an all black cast, but this simply wasn't worth paying $19 for two tickets.",
      "total_reactions": 7,
      "user": "Jacksjus"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "The Tuskegee Airmen Part 2. Didn't they already make a movie about this? I know the politically correct people who make these movies want to do everything they can to shove a story like this in everyone's face so they can feel better about themselves but enough is enough. They lost me with the trailer and the airmens' supposed pre-flight/pre-game chant as if Ray Lewis is flying one of these planes. Stupid.",
      "total_reactions": 5,
      "user": "frogwipe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "Probably one of the worst high budget films ever made. I was laughing at it non stop because the stereotypes are just so in your face. Lucas must have known this film was a complete joke. I can't believe it even exists. The plot and the subject matter if definitely film worthy, but it's approached in such a patronizing, unrealistic and childish way that you don't really appreciate what these men achieved. The dog fights look great as you'd expect but they'd completely unrealistic. You've got these tiny planes making multiple passes over naval warships, somehow dodging the flak from 5-6 anti aircraft guns and still making it home in one piece. Black jesus or no black jesus to keep you safe, this is just ridiculous. Worth a watch if you fancy a giggle though. The films just about manages to stay entertaining as it's so utterly utterly dire.",
      "total_reactions": 3,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed this film! Granted the dialogue could have been better, but it was action packed, it had romance, and keep in mind, Lucas probably has prequels and other things that he wrote into the movie. I doubt if they will see the light of day, being that he didn't get HUGE numbers like he had wanted, but it had action, and romance, and lot of other things that stood out.",
      "total_reactions": 3,
      "user": "Cellus357"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "\"Red Tails\" seemed to be trying to emulate those great old war films of the 1940s, but it lacked the corny charm and sometimes riveting drama of those movies. \"Red Tails\" was at it's best when the theater was filled with the roar of those P51s screaming across the movie screen. Other than that, it wasn't impossible to get through, but very close to a yawner.",
      "total_reactions": 3,
      "user": "KnowNothing"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "It was an ok movie, im just glad i saw it for free, because there is no way i woulda paid to see this. The story felt slightly rushed. Tristan Wild wasn't needed in this film and is probably the worst actor in the film. Some of the acting was good, and some of it was bad. I just feel like they coulda did more with the story, but this film was DECENT at best.",
      "total_reactions": 4,
      "user": "Jbrizzy"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "The CGI was pretty good (it's distracting in the trailer). The action scenes are excellent.  But.....everything else is BAD!. Don't take my word for it, take the word of the critic sitting next me me that said it sounds like a 12-year old wrote this. That's giving it too much credit. My 8-year old could have written the dialogue. I can't decide if the dialogue made the acting bad, or bad acting made the bad dialogue even worse. But the lead character \"Easy\" has no emotional investment in anything he says, does, or sees. And on top of everything else the filmmakers have scored the film within an inch of it's life. For the first 20-minutes the film is score and dialogue that is so, crisp it sounds like it was all recorded in a vacuum. There is no foley or ambient noise...it's actually distractingly weird. The 3rd act of the film is supposed to be emotionally resonant but it falls flat.....it's a build up to nothing. I'm also wondering if a key plot or subplot was removed from the film as there are two indications. First, Bryan Cranston disappears completely and never comes back. Second, when Gerald McRainey give a big speech, it's all ADR and you only see the back side of his head (It's a bizarre shot, which leads me to believe it was the only angle they had where McRainey's mouth couldn't be seen).  If they were re-writing this script to fix it in post, can you imagine how bad the shooting draft must have been. Overall 2/5 stars. Good luck with this one.",
      "total_reactions": 7,
      "user": "ciaobaby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This movie has great characters, action, and emotion. After watching it, I literally stood up and held my hand to my heart. This is the best African American action picture and the best aerial dogfight movie. This is a very important story that everyone needs to know about. It looks and sounds spectacular on blu-ray. The extra features are superb. I just wish there were more of them. That's not because they're lacking but because I love the movie so much.",
      "total_reactions": 1,
      "user": "Garr"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "What a piece of crud.  What an insult to the actual African American airmen, and an insult to other white airmen who all gave so much to protect our freedom.  Leave it to Steven Spielberg to re-write history, as it is clear he has never read a history book.  Do not waste your money on this film, as it is ridiculous garbage and an insult to veterans.",
      "total_reactions": 10,
      "user": "Bart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Might be one of the worst WW2 movies. It certainly is not based on historical facts. In the end they claim that the Tuskegee Airmen held the best record of WW2 of any Fighter groups in WW2.",
      "total_reactions": 2,
      "user": "wijse"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Everything about this movie as an abomination unless your black then its amazing, so i have to have a longer review of this peice of crap, um the converstations in the movie are very repetitive no story line, actors are pretty bad, like they barely react when one of their friends die or atleast is a compeletly false reactor this can be said for every aspect of the movie.",
      "total_reactions": 1,
      "user": "hootis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "This was a good movie but not great and what's unfortunate is that it had the potential to be that. The actors were great and the story being based on true events gave it a perfect opportunity to do great things. But unlike the men in the film, it didn't take advantage of it. The stereotypically needless explosions seemed more abundant than usual, the dialogue was hammy, and the plot (not the part that was true but the added character drama) was too predictable. Combine those things with a horrible soundtrack and you get an average movie.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "This was exactly what I thought it was going to be:  A predictable, cheesy & highly-glamorized depiction of a true story story.  It's heavy reliance on CGI is a good thing because it takes your mind off the cookie-cutter dialogue.",
      "total_reactions": 8,
      "user": "Pahn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Red Tails is a really great film. It starts with action and doesn't let up until the end. Lucas and his team have deftly used the movie to tell the main story of the Tuskegee Airmen while leaving the origin and after-effects of the war for another time. This gives it a more action oriented feel rather than being a documentary. It's light on the drama and heavy on the action to give it more entertainment heft. I think this works in favor of the movie as it keeps the viewer engaged while learning of the exploits of Easy and Lightning the film's main heroes.",
      "total_reactions": 2,
      "user": "franklanzkie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "After watching Red Tails I left the movie feeling like I had not learned a single thing about the Tuskegee Airmen or black pilots in World War II.   It seemed like the movie started at â",
      "total_reactions": 2,
      "user": "ShamDeluxe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I thought this movie seemed to give a good representation of the Tuskegee Airman.  I am a WW2 Aviation history buff, so I loved the movie.  It was full of great flying action and a good story.  By the way, did you all know the Red Tails were the ONLY fighter squadron in the ENTIRE war that NEVER lost a bomber to enemy aircraft?!  I think this says a lot about the courage, training and ability of the Tuskegee Airman.",
      "total_reactions": 1,
      "user": "dana73"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Lots of great action and a good story. Some of the non action scenes go on too long and it would be better if they cut a bit from each of them to reduce the length of the movie, but they do contribute to the story. There is one guy who's acting is laughably bad but he only has a tiny role. (The p38 pilot)",
      "total_reactions": 1,
      "user": "SwarleyStinson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Every second I was watching it I was wishing that it would just end. The movie suffered from it's leads who all were annoying in their own way. There is no character development they just have a bunch of airplanes shooting at things like trains, boats, other planes, military bases, but it's not even entertaining. This is seriously the whole movie, right here. Planes shoot - There's a new mission - Fly - Shoot - Someone you didn't even know existed dies - Everyone's sad - Shoot - Mission Accomplished! - Yay! ...... I'm not even kidding. It's that bad.",
      "total_reactions": 1,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I really enjoyed this film. It was entertaining. The air-to-air combat scenes were pretty amazing. I loved the photography and cinematography. And the special effects blew me away.",
      "total_reactions": 0,
      "user": "jewliwolf52"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Action was good but the story line was mediocre! If it were not for all the great flying scenes the movie would not be very good at all. If that organization was as loose as they portray it would have been a wonder if they would have succeeded at all.",
      "total_reactions": 0,
      "user": "Nodak7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Besides the fact that it's about black pilots in WW2 this film is rather the same as most other fighter pilot movies. The (mostly CGI) dogfights are nicely done but the film drags on a bit too long and unfolds in an unsurpising and rather straightforward way. It didn't make too much money so I guess nobody was really waiting for this story to be brought to the screen (except maybe for Mr. Lucas who has been working to get it to the screen since 1988). George will apparently also bless us with a sequel and a prequel direct by Spike Lee and Lee Daniels.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "I gotta say, my expectation did not met when watching the movie. When the trailers of this movie was first released, I was excited with all those actions and stuff (I'm a big fan of war action movies). But when I watched it, I thought the trailer was much better than the real movie. Seriously I don't blame for the effects and actions used in this movie but I'd like to blame on the depth of story, dialogue and worst of all, the background music. For me, background music in movies are what affects me the most into getting the feel when watching a story. It gives that sense of mood for that particular scene. But when I saw Red Tails and the background music that was used, I gotta say that was crap. This movie deserves more effort and details. I thought that if the director focused on those kind of aspect, it would have turned out well. The CGI effects and actions was good but sometimes it's the little things that can have a large impact on the whole outcome.",
      "total_reactions": 0,
      "user": "asy8492"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "There are aspects of Red Tails that are thoroughly enjoyable, but the poor plot line and inseparable character traits ultimately led to its demise. In short, there are to many story lines to be properly understood. Had it focused on the love story/relationship between the two main men it could have worked. Had it focused purely on the historical elements it could have worked. Unfortunately, it tries to tackle all three and the result is a confusing, forced, unsatisfactory ending. There is so little exposition that all the characters seem to be carbon copies of one another. They are all pilots, yes, but what makes them unique? The special effects, like many movies from LucasFilms, are almost to extreme to be believed, but the sound and lighting were dead on. Red Tails is worth a watch if you enjoy war flicks, but if you aren't interested don't go out of your way to see this film.",
      "total_reactions": 0,
      "user": "Luke_McLaughlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "It was a long and boring movie that had no signs of encouragement all throughout the entire film. I honestly wonder what the director was thinking. Or perhaps, he wasn't.",
      "total_reactions": 0,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "\"Red Tails\" is a movie of all flash and little substance. The story is honestly another run of the mill blacks overcoming adversity type story. Which is fine, but it usually works better in sports movies(dunno why but it does). Honestly, it could worked great here and probably been very inspirational. However, the filmmakers decided to concentrate more on the visual effects of the dogfights as opposed to the execution of the story surrounding the action.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "THIS IS PERHAPS THE MOST HISTORICALLY INACCURATE WW2 MOVIE EVER MADE. When the 332 Fighter Group, usually known as the Tuskegee Airmen, started flying bomber escort missions in May of 1944, much of the Luftwaffe's front line combat strength had already been decimated, largely as a result of Operation Pointblank, which reached its peak during Operation Argument, Big Week, February 20-26. This was a focused attempt, largely the brainchild of Jimmy Doolittle, to savage Germany's aircraft industry and decimate its fighter squadrons. It went into full scale during January of 1944, and ended in April, as bomber missions then started a concentrated campaign to cut Germany's supply of oil and to cripple its transportation infrastructure prior to D-Day. The Tuskegee fliers took no part in it. During that period, the Eighth Air Force's top pilots ( based in England , and under Doolittle's command ), Francis Gabreski, Robert Johnson and Don Gentile scored 10, 15 and 19 kills on Luftwaffe fighters, respectively. John Godfrey, Gentile's wingman, shot down 6 ( incidentally, the Gentile/Godfrey team was the most famous fighter pairing of World War 2 ). To make this as clear as possible, between January and April of 1944, these four pilots downed half as many planes as the entire 332nd did IN ITS FULL YEAR OF FLYING ESCORT MISSIONS ! Contrary to the film's adolescent dramatics, fighters were directed to seek out and pursue German fighters BEFORE THEY COULD REACH THE BOMBERS ! Dead Germans could not hurt the bombers, and bomber losses to fighters plummeted throughout 1944 ( however, German flak got much worse, as 88mm guns were pulled from the Russian Front to protect German cities). Likewise, accompanying bombers over target areas made no sense for our fighters, as German fighters usually struck before and after the B17s and B24s hit their industrial targets SO AS NOT TO BE SHOT DOWN BY THEIR OWN FLAK ! Flying over target thus put fighters at unnecessary risk from flak, which they had no power over during escort missions. Regarding the Curtis P 40 ( which is loudly complained about in the movie by 332nd pilots ), British, Australian and South African pilots were very successful against Axis fighters with them in North Africa ( Clive Caldwell , top Aussie Ace, notched 22 kills with the P 40 before being transferred to the Pacific ). At the same time the 332nd was receiving P 51s, The Flying Tigers (14th Air Force ) were still overwhelmingly dependent on P 40s, using them to great effect the spring of 1944 to thwart the Japanese Ichi-Go Offensive in China, not completely converting to P 51 Mustangs until June of 1945. CONCLUSION : The only way to enjoy this movie is by knowing little about WW2, nothing about the air war, less than nothing about the war in the Mediterranean, and much less than nothing about the air war in the MTO. Lukas has colluded to insult every other American fighter group, especially the other six ( 1st, 14th, 82nd---all flying P38s---31st, 52nd, and 325th ---all flying P51s the last year of the war ) that served the Fifteenth Air Force along with the 332nd. Those six groups downed over 1,400 Axis planes, on average each credited with twice as many kills as The Tuskegee guys. GOT THE PICTURE ? Read The Forgotten Fifteenth by Barrett Tillman for more insights !",
      "total_reactions": 0,
      "user": "Pelaro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "The actors' convincing portrayals and realistic bond with each other, along with the spectacular visual and sound effects created by Lucas, makes Red Tails feel genuine and powerful.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 46,
  "name": "Red Tails",
  "num_weekends": 19,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 1,
    "year": 2012
  },
  "opening_weekend_income": 18782154,
  "opening_weekend_income_currency": "$",
  "rating": 5.9,
  "rating_count": 29464,
  "rating_freq": {
    "1": 1726,
    "10": 3275,
    "2": 872,
    "3": 1255,
    "4": 2071,
    "5": 3993,
    "6": 5994,
    "7": 5518,
    "8": 3234,
    "9": 1526
  },
  "release_day": 20,
  "release_month": "January",
  "release_year": 2012,
  "user_review_count": 274,
  "votes_per_demo": {
    "aged_18-29": 8498,
    "aged_30-44": 11518,
    "aged_45+": 4717,
    "aged_under_18": 41,
    "females": 3004,
    "females_aged_18-29": 938,
    "females_aged_30-44": 1161,
    "females_aged_45+": 693,
    "females_under_18": 3,
    "imdb_staff": 2,
    "imdb_users": 29464,
    "males": 22748,
    "males_aged_18-29": 7489,
    "males_aged_30-44": 10256,
    "males_aged_45+": 3962,
    "males_under_18": 36,
    "non-us_users": 11373,
    "top_1000_voters": 271,
    "us_users": 8499
  },
  "year": 2012
}