{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.6,
    "aged_45+": 6.7,
    "aged_under_18": 5.9,
    "females": 7.0,
    "females_aged_18-29": 7.1,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.9,
    "females_under_18": 6.9,
    "imdb_staff": 8.5,
    "imdb_users": 6.8,
    "males": 6.7,
    "males_aged_18-29": 6.9,
    "males_aged_30-44": 6.5,
    "males_aged_45+": 6.6,
    "males_under_18": 5.0,
    "non-us_users": 6.8,
    "top_1000_voters": 5.4,
    "us_users": 6.5
  },
  "avg_screens": 22.545454545454547,
  "budget": 15000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 12,
    "year": 2011
  },
  "critic_review_count": 161,
  "duration": 91,
  "genres": [
    "drama",
    "romance"
  ],
  "gross_income": 163141,
  "max_screens": 126,
  "mc_avg_user_score": 7.2,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Restless",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 19,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 75,
      "summary": "Restless is far more precious than profound. But that takes little away from this soulful teenage exploration of love, life and death."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "All of the performances are pitched correctly. Nobody pushes too hard. Nobody underlines anything. Perhaps calmed by Van Sant, the characters seem peaceful, not troubled (as they should be)."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "An emotionally rewarding experience: strong performances from leads Henry Hooper and Mia Wasikowska and a tender love story conveyed with genuine feeling."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "The picture is so fluttering and tender, so guileless, that you almost can't believe it was made by an old hand like Van Sant. Then again, maybe you can."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "If you haven't seen a wasting disease in real life, you might think Restless is romantic. If you have, you might diagnose it as terminally cute."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "As clearly calculated and self-consciously cutesy as it is, it's also tender and meaningful stuff -- and far more watchable than other recent attempts to capture the existential angst of adolescence. (\"The Art of Getting By.\")"
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Restless is a self-consciously quirky coming-of-age tale that's essentially a teenage hipster \"Love Story.\""
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Wasikowska, from \"Alice in Wonderland\" to \"Jane Eyre,\" is an actress of translucent expressiveness. And Hopper has his father's brooding intensity and a quicksilver humor all his own. They are both so good, I suggest you dive into the story unfolding in their eyes rather than the banal one in the script."
    },
    {
      "critic": "Richard Nilsen",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "You also aren't sure what the film is about or if it's about anything at all, except fluid filmmaking."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "If \"Harold and Maude\" hadn't already gotten there 40 years ago, this quirky but engaging trifle might seem refreshingly original."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Gus Van Sant directs his players just shy of mush; he's a filmmaker capable of brilliant dares (Milk, Paranoid Park) and shocking whiffs (Finding Forrester, the pointless remake of Psycho). This one's kind of in the middle."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "If anyone other than Gus Van Sant had directed Restless, the film could have well been impossible to sit through."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Relentlessly twee as all this is, Wasikowska's warmth and Hopper's off-beat timing (he's the son of the late Dennis Hopper) are appealing to watch."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Restless is saved from movie-of-the-week soppiness by its plucky lead actors; by now we assume (correctly) that Wasikowska will infuse her character with lucid, clear-eyed warmth."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "If illuminating dawns and dusks had basked Mia Wasikowska and Henry Hopper in a rosy glow, the mopey cuteness of Restless would have been too much to bear."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "The insistently quirky details don't disguise the fact that the drama grows ever more predictable and precious, complete with falling-in-love montage. Screenwriter Jason Lew's character insights take the form of the obvious."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "It is hard to say, though, if this film, directed by Gus Van Sant from a script by Jason Lew, is an argument for denial or a treatise on acceptance. Curiously, and in a way that is sometimes touching and sometimes icky, it does not seem to perceive much of a difference."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Annabel and Enoch learn from each other, even as time ticks away and the end draws near. Weeping is invited, but by no means required."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Somehow, Van Sant has made a film about life and death in which the stakes never seem higher than whether one insolent kid will stop being such a horrible mope."
    },
    {
      "critic": "Mark Holcomb",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Gus Van Sant's latest - a middle-class hetero teen romance, no less - walks the line between mainstream sentimentality and dark art-house humor so effectively that it seems noncommittal."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "At once delicate and clumsy, tender and twee, Restless wraps the pain of grief and impending mortality in the balm of a teenage love story."
    },
    {
      "critic": "Damon Wise",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Compared to its direct inspiration - Hal Ashby's blackly brilliant \"Harold And Maude\" - Restless comes off like an anemic facsimile. After the excellent \"Milk,\" this is more like curdled cheese."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "This story about two death-obsessed teens is twee and precious instead of genuine and candid."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "This overly twee, morbidly cute romance initially digs up the ageless \"Harold and Maude\" as a touchstone before it slips the coils of watchability."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "A torpidly precious love story about death-obsessed adolescents, the film's becalmed and embalmed in its own sensitive self-pity."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "Unlike Van Sant's grittier, less sentimental recent small films, it's twee enough to make your teeth ache. It's the director's biggest miscalculation since \"Even Cowgirls Get the Blues\" 18 years ago."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "The young sweethearts amuse themselves by donning steampunk outfits and crashing the funerals of dead children, which may seem quirky and sweet if you can disregard the awful grief of such gatherings; the problem is that, once you manage this, the main characters' grief doesn't register either."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "The most banal and indulgent of Gus Van Sant's periodic studies of troubled kids, this agonizingly treacly tale comes off like an indie version of \"Love Story\" except with worse music."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "The film is morbid and mawkish, and packed with enough forced whimsy to make you scream."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Gus Van Sant's cinema, which of late has been fixated on immersing viewers in\r\nparticular times and spaces, takes a detour into excruciating quirkland with\r\nRestless."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "For their souls, the titular metalheads challenge death to a game of Battleship in \"Bill and Ted's Bogus Journey\"(a send-up of \"The Seventh Seal\", and wins, but the Grim Reaper turns out to be a poor sport, so it's not until the surfer dudes dominate at  Clue, electric football, and Twister, does the scythe-carrying man begrudgingly lets them go. After Death's battleship is sunk, it's clear that the boys won. Conversely, when Hiroshi, a kamikaze pilot from WWII, \"blows up\" Enoch's toy pieces to smithereens, every successive sinking presents a paradox, made so by the cultural objective of the player, since it means that the Japanese aviator has won, perversely, by crashing his plane into an American naval vessel, somewhere over a Pacific constructed out of blue plastic. Hiroshi loses his life, many times over, every single day. While Enoch complains that his dead friend always wins, maybe he loses on purpose, in order to keep their symbiotic relationship intact. Win a game, Enoch intuits, and perhaps, Hiroshi will fade away. The kamikaze needs some vestige of that faraway war, whereas Enoch enjoys the pilot's imperative to die. Both competitors need a new game, like Life. It's something that neither Hiroshi, nor Enoch, ever got to experience. In the testimonies of the few remaining \"tokkotai\" members from the 2007 doc \"Wings of Defeat\", the aging kamikazes reveal that their comrades were not the automatons as seen in American films such as \"Tora! Tora! Tora!\" and \"Pearl Harbor\", but were in fact, scared boys, hemmed in by a culture which preached death before dishonor. So scared, in fact, were some of these flyers, that they didn't complete their missions, choosing instead to return back home, rather than die in vain. It's a facet of the Japanese persona we never knew existed. One doesn't normally associate free will with wartime soldiers, whose allegiance to the emperor was a testament to militaristic programming, but these interviewees are, in essence, conscientious objectors, or in other words, from the Japanese perspective: cowards. Over the intervening years, since the bomb ended the war, suicides suc h as Hiroshi, and other pilots like him, after mulling things over, must have realized that their sacrifices were for nothing, but curiously, the aviator squares off against Enoch in a seemingly game of Battleship on a daily basis. Most former soldiers don't like to relive their war experiences, and yet, here is Hiroshi, metaphorically nosediving into aircraft carriers, submarines, destroyers, and patrol boats. Since most kamikaze pilots received the highest honors in death, being promoted to positions of leadership posthumously, what's the deal with Hiroshi's purgatorial-like deferment from heaven. Why is he stuck in the northwest with Enoch? Furthermore, the Japanese are notoriously closed-mouthed when it comes to talking about themselves, but, Hiroshi rattles off his sterling military record to Annabel before Enoch cuts him off. There's a shrine in the sky? Why isn't he there? Maybe it's because Hiroshi turned his plane around, just like the surviving crew in the Morimoto film; maybe contrary to the love letter that he writes to his sweetheart, the ghost as a man, neither screamed \"Banzai!\" nor whispered the name of a girl, before plowing into enemy aircraft, because the suicide mission he had purported to carry out, in actuality, was a bogus journey. Game after game, the disgraced pilot defeats Enoch in order to join his decorated comrades, but alas, it's fruitless. Battleship is only a game. It's a real probability that Enoch committed ritualistic suicide(\"hara-kiri\"), because his prolonged life was an insult to those brave enough to make the ultimate sacrifice, therefore bringing shame to the family and a Japan razed to the ground by nuclear emissions. \"Restless\", billed in some quarters as this generation's \"Love Story\", and sure, the Arthur Hiller film, for good reason, was the go-to film when it came to doomed love, but the seventies classic differs in one crucial way: Enoch, the funeral crasher(ala Bud Cort in \"Harold and Maude\"), really needs Annabel, an old soul(she dresses in clothes from Ruth Gordon's time) with terminal cancer, unlike Oliver Barrett, the preppie, who ultimately, despite denying it, marries the poor Catholic girl as a way of irking his fabulously rich and snobby parents. If Oliver truly loved the pianist, he would have allowed the scholar to study abroad, in Paris, rather than turn her into a lawyer's wife. Oliver loves what she represents. On the other hand, Enoch just simply loves Annabel. Unfortunately, he doesn't realize that Hiroshi is no Clarence, Angel Second Class from \"It's a Wonderful Life\". The kamikaze pilot hasn't earned his \"wings\". When Annabel dies, Hiroshi isn't there to escort her to heaven, but instead, acquires for himself a new Battleship partner, in his quest to become an admiral in the afterlife.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "This tedious and sophomoric examination of death stars Henry Hopper (son of Dennis) as a youth who's troubled by the death of his parents, Mia Wasikowska who's facing death from cancer and the ghost of a Japanese kamikaze pilot. Did I saw this was about death? They mope and make moon eyes at each otherâ",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "The first hour of this film is wonderful, funny, touching and underplayed. Mia Wasikowska is something special (as is Schuyler Fisk as her sister struggling to accept the reality of the situation) and the relationship between her, Henry Hopper and the Japanese ghost is nicely drawn (after you give in to the logic of it). The problem is the last third of the film. What was being built up to be quite an emotional conclusion, dissolved into cliche quickly and undercut the impact of the film's conclusion.",
      "total_reactions": 0,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "Annabel (Mia Wasikowska) has cancer, but donâ",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "When expressing my views on a film I examine my feelings. Did I \"feel' something? Was it strong, believable? Did I cry, laugh, hide my eyes, etc. The characters in Restless made me feel something. They communicated their situation. They made me see how their reactions to their personal challenge made sense. In this film plot-lines or a story faux pas does not matter. Two wonderful portrayals of people who fall in love and must deal with heart breaking issues. They do it, they understand the \"thing\" their dealing with, and hopefully reach a better place in their lives. I \"felt\" their pain, sorrow, but most of all their happiness in finding each other when they needed someone the most. An A-.",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "A Febiofest screening, nothing signposts that 3 years after multi-Ocsar nominated (including 2 wins) MILK (2008), Gus Van Sant will cook such a cancer-ridden romantic flick grappling with a soul-healing recovery of a parents-bereaved boy after his short relationship with a dying girl although death has been a persistent topic all through his omnibus. The over-simplified structure may impede Gus from a more spacious platform to perform his mastery, and precipitating an out-and-out snub from all sorts of awards consideration and the disastrous box-office turnover is fatal to destroy its investorâ",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Don't look for revelation, but portrayal of  young angst at the unanswerables of life through a quirky plot and lovely acting you will find. Somewhat endearing. I liked it.",
      "total_reactions": 0,
      "user": "DJ7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Quirky, death-obsessed...oddly touching...faintly amusing",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 47,
  "name": "Restless",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 9,
    "year": 2011
  },
  "opening_weekend_income": 15467,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 15497,
  "rating_freq": {
    "1": 207,
    "10": 1357,
    "2": 159,
    "3": 267,
    "4": 527,
    "5": 1164,
    "6": 2946,
    "7": 4521,
    "8": 3005,
    "9": 1344
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 32,
  "votes_per_demo": {
    "aged_18-29": 6774,
    "aged_30-44": 5480,
    "aged_45+": 1399,
    "aged_under_18": 10,
    "females": 5699,
    "females_aged_18-29": 3636,
    "females_aged_30-44": 1575,
    "females_aged_45+": 293,
    "females_under_18": 7,
    "imdb_staff": 2,
    "imdb_users": 15497,
    "males": 8122,
    "males_aged_18-29": 3054,
    "males_aged_30-44": 3810,
    "males_aged_45+": 1079,
    "males_under_18": 3,
    "non-us_users": 9878,
    "top_1000_voters": 200,
    "us_users": 1581
  },
  "year": 2011
}