{
  "avg_rating_per_demo": {
    "aged_18-29": 5.7,
    "aged_30-44": 5.5,
    "aged_45+": 5.7,
    "aged_under_18": 5.8,
    "females": 5.9,
    "females_aged_18-29": 6.0,
    "females_aged_30-44": 5.7,
    "females_aged_45+": 5.9,
    "females_under_18": 7.1,
    "imdb_staff": 4.8,
    "imdb_users": 5.6,
    "males": 5.5,
    "males_aged_18-29": 5.6,
    "males_aged_30-44": 5.5,
    "males_aged_45+": 5.7,
    "males_under_18": 5.5,
    "non-us_users": 5.5,
    "top_1000_voters": 5.3,
    "us_users": 5.4
  },
  "avg_screens": 894.2,
  "budget": 130000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 9,
    "year": 2013
  },
  "critic_review_count": 204,
  "duration": 96,
  "genres": [
    "action",
    "comedy",
    "fantasy"
  ],
  "gross_income": 33592415,
  "max_screens": 2852,
  "mc_avg_user_score": 4.7,
  "mc_metascore": 25,
  "mc_mixed_rating_frequency": 88,
  "mc_movie_name": "R.I.P.D.",
  "mc_negative_rating_frequency": 99,
  "mc_positive_rating_frequency": 77,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Thank heavens — or at least the “Department of Eternal Affairs” — for Jeff Bridges, whose hilariously free-associative performance as a 19th-century frontier marshal-turned-21st-century undead lawman is like an adrenaline shot to the heart of R.I.P.D."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 58,
      "summary": "While he's (Bridges) having more fun than anyone in the audience is likely to be having, it's such a rip-snorting go-for-broke performance that it almost makes R.I.P.D. worth the price of admission. Almost."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Nothing short of wiping their memories with a real-life neuralizer is going to convince moviegoers that the supernatural buddy-cop comedy R.I.P.D. is anything more than a thinly disguised \"Men In Black\" ripoff."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "A film that grows less compelling and original by the minute, R.I.P.D. serves due notice that the mismatched-buddy-cop movie is wearing out its welcome all over again."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Confusing and uninspired rather than completely inept, it’s still likely to be swiftly struck from the résumés of all involved."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "R.I.P.D. devotes far more energy to concept than execution, leaving most of the promising aspects high and dry."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "There is less eye candy than you would expect, and it’s underwhelming."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "In R.I.P.D., we have a legitimate train wreck of a motion picture: a film that doesn't work on any level. It's not funny. It's not exciting. It's not engaging. It's a waste of time and money."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "Perhaps there was a clever germ of an idea here, but the five credited writers didn't develop characters, scenarios or rules in this sci-fi world well enough to engage the audience."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 38,
      "summary": "The worst comic book adaptation since “Jonah Hex.”"
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 36,
      "summary": "There is a legitimate film in here somewhere, buried deep beneath the rubble of its terrible script and editing."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "With its low-stakes chase scenes, obvious-from-the-get-go villains and nonsensical plotting, this feels more like a 96-minute-long episode of Scooby-Doo that's been laboriously translated into another language and then back into English."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "It's an unpleasant way to pass a couple summer hours."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Unfortunately, the interesting drabness of the afterlife’s police department is paired with the colorless paucity of the film’s heavies...The deados, unmemorable CG brutes, spout generic bad-guy dialogue undistinguished by humor or characterization."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "The entire film has an oddly underdone quality to it, as if aiming not for greatness but to simply be passable."
    },
    {
      "critic": "Steven Boone",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "Mostly loud and graceless, despite some arresting hyperbolic visuals that deserve an action film of actual soul and purpose. It's simply too generic at heart to justify director Schwentke's delirious, sidewinding, arcing, snap-zooming and whip-panning anti-gravity camerawork."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "A dud that squanders a decent cast and succeeds neither as the comedy nor the action film it purports to be."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "R.I.P.D. never creates a believable universe, interesting action sequences, or dynamic characters. It’s a paint-by-numbers approach in which the film’s comedy and drama both fall flat."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "It's nothing special. Which sort of makes it a loser all the way 'round. Expect a sad afterlife for it on cable."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Tired byplay between Reynolds’s mystified straight man and Bridges’s supernatural old pro will kill off any fond memories you have of zesty buddy films past and present."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "What’s missing is what’s often absent in industrial moviemaking of this type: story and characters, yes, but also the human touch and a sense that someone behind the scenes actually cares about the work."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Less a bad movie than simply not a movie, R.I.P.D. gives every indication of having been a sloppy first-draft script."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "It so shamelessly borrows from so many other movies, and then does absolutely nothing to add to them -- nothing to raise the bar, nothing to make it more interesting, and really nothing to make it the least bit appealing."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "This is a second-rate special effects-dominated 3D entry that will join several prominent would-be blockbusters that need not be mentioned on the summer junk heap."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 12,
      "summary": "For a movie that so strenuously rips off “Ghostbusters” and “Men in Black,” R.I.P.D. manages to come up with fresh new ways of being absolutely terrible."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "summary": "The whole thing seems ill-conceived from the start, unable to keep its parameters simple – think of Ghostbusters and “Don’t cross the streams!” – but also lacking any genuine comic spark or imagination. It’s an exhausting 98 minute ride to nowhere."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "summary": "This expensive misfire runs a little less than ninety minutes, which means that there’s likely a 105-110 minute long version that the producers hacked up in order to get the maximum amount of 3D showtimes to not embarrass the studio on opening weekend. Judging by the released product, that version is likely even worse, if such a thing were possible."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This was an enjoyable film! What do people expect? The performances were fun, it was well cast, and the story was entertaining. Yes  its the stepchild of better movies (MIB, Ghostbusters), but that's not to downgrade it  I'd urge you to watch it when it hits a home release though. Feels like it would work better that way.",
      "total_reactions": 2,
      "user": "Kefrif"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I don't get all the hate this movie is great if you feel like watching a silly movie about killing dead people, laughed my head off. Sometimes you just need a dumb movie to make you feel all happy inside and this is what R.I.P.D is.",
      "total_reactions": 2,
      "user": "Jabbtoth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "For the supposed worst film of the year, It honestly wasn't that bad. I thought Bridges and Reynolds worked well together and as always Bacon makes for a good villain. Bits of comedy through out that were enjoyable. Yes it is sort of like Men In Black but it's far more action packed although not as well done. The biggest disappointment, for me, would be the special effects. For a film that has a 130 million dollar budget, I expected far better visuals, and the visuals in this film were rather disappointing, unconvincing, and poorly done.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "The movie has, like, two or three scenes where you find yourself chuckling, but as a whole, it fails to entertain. The film is just so silly that it becomes pretty dull in many places.",
      "total_reactions": 1,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "I totally don't understand all the hate towards this movie. Yes, R.I.P.D. has many parallels with Men In Black, but it's not the makers' fault, it's based on an existing comic after all. Besides, \"a MIB clone\" sounds like a compliment for me, since I absolutely love the MIB movies. Anyway, this movie's got stellar cast (Reynolds, cowboy Bridges, Kevin Bacon and the ever-pretty Mary-Louise Parker), mostly funny jokes, quite gripping action scenes and, suddenly, a bit of convincing drama. Now the downsides are that the plot's a bit predictable and the visual effects aren't all polished, but those are minor to me. A solid 8 out of 10, don't skip this out because of the critics.",
      "total_reactions": 1,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "There are several problems here terrible CGI, awful chemistry, and a forgettable story.  Overall I know they were trying to capitalize on MIB's success, but just like MIB 3 this film is just not that fun.  Plus what was with that terrible accent by Jeff Bridges? D",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "I rather enjoyed this movie. It was fairly clean for a PG-13. My son enjoyed it, as it brought back \"old school\" movie themes like Ghost Busters, a modern theme, and Men in Black charisma. It was funny, the monsters weren't super creepy. It probably would have done better with a little younger target age group. I recommend this.",
      "total_reactions": 1,
      "user": "adde1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "RED and Flightplan director Robert Schwentke's paranormal action flick R.I.P.D. is based on a comic book of the same name by Peter M. Lenkov. For everyone else involved, it's a Men in Black sequel that swaps ghosts in for aliens. That's OK  the MIB franchise rests on chemistry and that's what makes R.I.P.D. halfway tolerable. Ryan Reynolds, the perfect leading man who can't catch a break in Hollywood, stars as Nick, a Boston cop trying to carve out a life with his French lovely, Julia (Stephanie Szostak). Nick has made on major mistake in that genial plan: At his most recent drug bust, he helped his parter Hayes (Kevin Bacon) steal some ancient gold he thinks can be pawned for serious dollars. Why was there ancient gold stashed away in the crates that carried illegal drugs into Boston? This is one of the many blanks R.I.P.D. asks you to fill in. \"You have seen enough movies, it should be easy,\" the script silently says to us as it speeds along to make its 90-minute runtime. When Nick decides he's out of the corrupt gold smuggling plot, Hayes shoots him in the face. That would be the end of most Boston cops, but it turns out",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "If MiB and Ghost Busters had a baby…",
      "total_reactions": 3,
      "user": "Cailore"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Worst film of the year. I honestly hope that I can forget that Jeff Bridges was ever in this movie. The first thing that I noticed was wrong with this movie was the editing. I'm going to try and not insult this movie dishonestly, so here is an honest insult. The stunts in this movie looks like it was edited by a high-school student getting started in AV class. The CGI was overused, this movie disgraces CGI. I'm so glad it was short, it left me wanting to get the hell out of there. I got 0 laugh(s) out of this film.",
      "total_reactions": 6,
      "user": "nicholasprado"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "This film right here was the breaking point for me, thank you RIPD and thank you Hollywood for getting me off my ass to voice my insignificant opinion to the world by signing up and contributing points to this abomination of a film.  I went into this movie like I have went into every other film this summer, low expectations and hopefully opening night so I could have crowd reactions to give me something to laugh at, but this film managed to near put me to sleep!",
      "total_reactions": 6,
      "user": "Steamcausedthis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "I have no idea why the other users on this site are being so harsh. I though it was an okay, some what cheesy action comedy. But anyone who says it's bad didn't needs to get better taste in movies. Personally, I had a great time seeing it, and I think you will too.",
      "total_reactions": 4,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "The summer movie season isn't exactly one of the better ones, with \"The Lone Ranger\" falling flat and no real dramatic gem.    \"Wolverine\" is out next week and may be the hit Hollywood is hoping for next to the wonderful \"Despicable Me 2\".    Despite its promos, \"RIPD\" doesn't live up to the preview's promise.",
      "total_reactions": 4,
      "user": "shpostal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Nice funny move. Jeff Bridges is briliant actor. Because of him this move looks good. Its a clone of MIB indeed, but I had a great time and can reccoment it to friends.",
      "total_reactions": 4,
      "user": "Miko_York"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Don't listen to all this hate. This movie was action packed and a good, imaginative story made this movie great. I can't believe all this hate for such a great movie. OK, maybe it was a bit like Men in Black but the story was completely original. Ryan Reynold and Jeff Bridges performance was great. definitely recommend this for people who want an original, funny, and well made sci-fi  movie.",
      "total_reactions": 4,
      "user": "etb444"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "After last years Men in Black 3 I got a taste for the early days of Sci-Fi buddy pics, the original MIB and the breezy thrills of two guys throwing caution to the wind to protect the people of the world, RIPD is that film and as it turns out I wasn't missing much at all. When NIck (Ryan Reynolds) is murdered hi is enlisted by the RIPD, the Rest In Peace Department, a group of undead officers including Nick's new partner Roy (Jeff Bridges) that hunt deados, undead that refuse to just die and cling to life until Roy and Nick and the rest of the RIPD can bring them in or destroy them. Everything about RIPD is reused and fashioned out of spare parts other movies didn't want. It's a poor man's Men in Black as it follows the same formula (two partners, one old, one young, one recently recruited, the other a seasoned pro who still has things to learn.) It's vapid film making that only really stands out thanks to its comic book action sequences and stellar CGI action that MIB didn't have back when the originals came out. Everything else is unfortunate mimicry that is just plain painful to watch.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Pretty average movie, the story is pretty shallow, the overall concept is a mixture of MIB plus Ghostbusters. There are some nice ideas but the realization is pretty mediocre. There is not much to laugh on and overall the best thing here is Jeff Bridges.",
      "total_reactions": 2,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "After seeing all the success Jeff Bridges has had after all these years, I wish he would get better roles to star in and stop playing in stupid movies such as this. Now, Ryan Reynolds? Hardly a good actor, why do we care? Anyway, the whole time I was watching this movie, I kept thinking one thing: Men In Black. Honestly, aside from the slightly different story, this movie is like Men In Black. Good CGI, but just a horrible movie all around. Its movies like this that make me mad because this is a recycled idea and a horrible one, at that, but the fact Universal Pictures would green light this over, say an original idea from an up-and-coming screenwriter, is quite frankly embarrassing. But then again, Universal is hot off the heels from all that money Fast & Furious 6 just made them. They can afford to create and release a horrible movie.",
      "total_reactions": 2,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "This review was originally posted on www.Pixcelation.com by Andrew Korkmas",
      "total_reactions": 2,
      "user": "Pixcelation"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I honestly don't understand all the hate. I thoroughly enjoyed every moment of this film. Yes it was a bit like MiB maybe and the CGI could've been a bit better, but my friends and I, as well as the packed theater, couldn't stop laughing. All I can say is don't listen to reviews and go see for yourself. If you go in expecting a bad movie, you're not going to enjoy yourself.",
      "total_reactions": 19,
      "user": "Mazzyrazzy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "It fell flat. Bridges character had potential but most of his laugh lines just petered out. I saw it with a couple teenage girls who thought it was \"fun\" however, I was a little uncomfortable with the pervasive foul language. I can't recommend it.",
      "total_reactions": 6,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "After he dies in the line of duty, Ryan Reynolds comes back as a member of the Rest In Peace Department. He's partnered with a Wild West lawman (Jeff Bridges) and they set about killing bizarro creatures who haunt the earth. Think of a mashup between \"Ghostbusters\" and \"Men in Black\" without any of the inventiveness, comedy or coolness. There's a frantic pace, but nothing entertaining to fill it. Reynolds plays it serious, while Bridges chews the scenery (and some chaw that often makes his mush mouth indiscernible). The efx aren't bad, but the whole thing is simply DOA.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "This film doesn't make any sense at all.",
      "total_reactions": 14,
      "user": "tkhow"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Only saw this because it was free (I work at a theater) so that should should tell you something right there. This isn't worth any of your cash, probably not your time either. I wasted my time for 2 reasons, it was free as i previously stated and because of Jeff Bridges who happens to be the only reason I gave this movie a 3. R.I.P.D. was too corny for my taste and this is coming from someone who enjoys sci-fi channel original movies. Stay away from this one, wait for Redbox, it's worth a dollar rental but nothing more. 3/10",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "I think people are being very harsh I don’t think it’s the best film ever but is definitely not that bad to get such a hammering if you like Men In Black you will like this if you don’t  then don’t go  anywhere near it. There are  some very funny bits in it Jeff Bridges is not too bad   a few good special effects worth a watch on the telly or if you have a cinema monthly pass",
      "total_reactions": 2,
      "user": "scoley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "I did go into this hoping it would be better than all the negativity I had previously heard. But sadly, this movie lives up to its reputation. There is almost nothing about this movie that I liked:",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "My God was this movie a mess! It's a visually dull and stupid Men in Black Rip-off. Truly one of the worst movies of the year, and this is coming from the guy that made \"Red\". I just don't understand. Overall, it's a complete waste of summer potential. Be sure to check out my YouTube channel \"TheMovieManLife\" and let me know what you think.",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Interesting take on a movie. It's like someone's nightmare made into a movie. Wasnt the best but it wasnt bad. Jeff Bridges was very believable. Without him in the movie the movie would be terrible.",
      "total_reactions": 1,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Down in the dumps when it comes to comedy, \"R.I.P.D\" isn't the worst thing out there, but definitely is far down the road in the several of mediocre films this summer. The premise is average, the character development is barely there, leaving only comedy in the dust. I quite liked the jokes at times, especially Jeff Bridge's performance, and will most likely leave audiences laughing at some times. Though the film isn't the worst, its a far cry from anything due to its ultimately dim-witted and formulaic story.",
      "total_reactions": 1,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "R.I.P.D wasn't bad, but I would wait for either red box, netflix, On demand etc. It was enjoyable to watch, but the script was just awful. I think the cast really did the best they could with the script. Kevin Bacon was a good villain and Ryan Reynolds did a great job in his role, but Jeff Bridges's role was below him and he probably should of passed on the movie. It had a cool concept, similar to MIB. The action was great (3D, even better.) Don't expect anything great, but if you liked MIB, you will enjoy this.",
      "total_reactions": 1,
      "user": "Kitkatkatie360"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Bridges' wannabe cowboy shtick is getting old. Boring, unfunny, hard to watch and a waste of money. Can't wait to see yet another tough old guy Bridges cowboy impersonation.",
      "total_reactions": 2,
      "user": "Luap"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "When I say that I was pleasantly surprised by R.I.P.D what I really mean is a terrible movie was just bad. The performances were completely lacking emotionally, but the comedy played well in some areas. Every other aspect was just ho-hum, nothing fantastic, but also nothing noticeably horrid.  If it made more sense logically, looked better, and was given some time and care this could have been an O.K. film. Unfortunately, it did not get any of those aspects. I was surprised because it looked terrible in previews, and it was, but not to the level I expected.",
      "total_reactions": 3,
      "user": "Luke_McLaughlin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Funny bits in between a vast ocean of boredom. Nothing new cliched up the portal to heaven. Like riding in wagon with hemorrhoids. It was fun and a good couple of chuckles but never again shall a watch this",
      "total_reactions": 1,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This movie may be good for a 12-year-old who reads comics, but I thought it was just plain silly.  There were holes in the plot, and it reminded me of a cross between a hugely distorted version of Ghost, and Ghost Busters.  Not recommended for adults unless they have had a lot to drink.",
      "total_reactions": 1,
      "user": "kathleen75080"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "The idea of R.I.P.D. maybe is good, but sounds like the son of Men in Black movies and The Ghostbusters movies, and the result is completely different than the movies of the two franchises. Terrible movie, no more.",
      "total_reactions": 1,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "The problem wih this movie is the limited acting range of Kris Kristofferson. Wisecracking sheethead. That's it. Good for a few laughs tho ........................",
      "total_reactions": 1,
      "user": "calhounite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Some parts where bearable. It should be called RIP OFF. I didn't realize heaven was full of so many weirdoes and subspecies as I always believed heaven was strictly a concept created by humans so naturally I expected humans in the afterlife.  .silly me. Stupid movie",
      "total_reactions": 1,
      "user": "jules_mozar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "RIPD is not that good at creating monsters and writing the script . but i love the fact Ryan Ryenolds's avatar is a Asian that **** is hilarous . i also love the stunts but still the cast is okay but not kevin bacon i do not know why kevin bacon  is in this ?",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"R.I.P.D.\" 10 Scale Rating: 3.0 (Bad) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "It's definitely silly but it has many memorable moments. Personally i think Jeff Bridges is the driving force behind this movie. How they got him to accept a role like this i'll never understand but i definitely see why they did it.  Ryan Reynolds did a good job bringing life to an otherwise cliche role. Kevin Bacon is also very believable. The only thing i take issue with are the special effects. They're very disappointing. All in all, its a nice movie, not without charm and should not be judged solely on the fact that MiB came out first.",
      "total_reactions": 0,
      "user": "MadclownJack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "I was really dissapointed with this movie when it had such potential. The CGI was **** and the scenes where.something was supposed to happen just turns out to be strange. And you find out who killed Ryan Reynolds right at the beginning of the film. Really dissapointed.",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Trust me you will forget this even existed in a few months. This is a movie you go into with low expectations, or you will be disappointed. R.I.P.D struggles to be serious and funny. I feel like they should have gone into a full blown comedy than at least we would know it was just a big joke. Problem is it gets so crazy at times that you just lose interest in whats happening like none of it matters. Jeff Bridge is the best thing in this movie, but he doesn`t make it anything better than an ok movie.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "R.I.P.D had a budget of 130 million dollars, if this is true why is the CGI so incredibly bad? I really don't know what to say. This review is not going to be very long because I haven't got a lot to say. The acting is terrible, yes even Kevin Bacon. The plot is impossible to understand, not that it made much of a difference, and (quite obviously) stolen from Men In Black. The CGI reminds me of a 1980's Doctor Who episode. The action is straightforward, without brains and easily forgettable. The ending is such an anti climax that it brings the movie down by a whole point. The only aspect of R.I.P.D which is done well, is the mildly entertaining humor which made me laugh a few times. Simple sentences used to simply describe a dumb and simple Men In Black rip off which was made solely to entertain under 18's. And it doesn't even do that!",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "It can be entertaining at times. And the visual effects are better than expected. That said, the only really good thing about it is that you get to see Ryan Reynolds hot body for an entire movie. He is so fine.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Surprisingly, this movie entertained me. I am not saying it isn't a terrible movie because it is terrible but there are much worse ones out there. It is very much a ripoff of MiB and was a lot of wasted potential. Unfortunately, I was actually entertained and almost teared up once or twice. Just expect nothing out of it and you might be mildly entertained or watch it drunk.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "I have turned off the film after 10 minutes. Why you ask?",
      "total_reactions": 0,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Critics and audiences weren't the biggest fans of this film but, while I admit it had some issues, I actually had fun watching it.  Jeff Bridges is just fantastically amusing and clearly doesn't care how over-the-top he is or how much scenery he eats in every scene and Ryan Reynolds is decent as his partner.  The special effects on the villains is really hard to digest as they just look absolutely terrible but the film has its fair share of funny moments, has a decent story and some fun, popcorn action going for it that makes it a very passable comic book adaptation.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "The only thing memorable about this film was Jeff Bridges' hilarious performance as old man Roy. This movie reminded me of Ghostbusters or MIB, but a lot dumber. You cannot star Kevin Bacon in any movie and expect us to be surprised that he is the bad guy.",
      "total_reactions": 0,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "R.I.P.D. Ridiculous. Idiots. Producing. Dreadful. Films. I went into R.I.P.D. (Rest in Peace Department) expecting to truly enjoy the movie being a teen and all. I figured that the adults “over thought” and “misunderstood” Robert Schwentke’s “true meaning” for the film. Being the director of the original Red, he couldn’t mess it up right? Wrong. R.I.P.D. features Ryan Reynolds as Nick Walker, A cop killed by his own partner Hayes (Kevin Bacon) who he worked with for five years. After time being stopped and his body rising into the office of Proctor (Mary-Louise Parker) Nick is offered the choice of a job at R.I.P.D. or to face judgment. He quickly takes the job to reconvene with his wife and go back to earth until he meets his new partner Roy Pulsipher (Jeff Bridges).",
      "total_reactions": 0,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "This movie isint good but its not that bad either. Ryan Renalds and Kevin Bacon are meh in this movie. Bridges is quite funny and the only character that i liked in this movie. The story is predictable and not that special, i really liked the CGI in this movie. R.I.P.D is an okay movie at best.",
      "total_reactions": 0,
      "user": "SJ-ULTI-Reiews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "After watching the whole film, it seems that the story is too much fake. yes, its a fantasy movie but too much fantasy makes this movie too much dull. the transformation wasn't so good.... not so realistic.....",
      "total_reactions": 0,
      "user": "ISHTIAK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Actually not that bad. Jeff Bridges is... well he is Jeff Bridges so he is great as usual. Ryan R. fine, he is decent enough in this film. Probably the big negative for me is the CGI, it is pretty bad for a movie made in 2013. But overall, very exciting and over-bashed by the media. And James Hong is amazing.",
      "total_reactions": 0,
      "user": "NShep53"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Short review: Bad.",
      "total_reactions": 0,
      "user": "Soupinacup96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "The movie was fire. I don't know why all the hate is coming down on this one movie. People who talk bad about this movie are wrong and probably don't have a imagination or a funny bone in there body. Anyone any age can be a dusty hating mad at the world and everything hater.",
      "total_reactions": 0,
      "user": "stew1017"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "I have to agree mostly with Mazzyrazzy!  I thought Jeff Bridges was HILARIOUS and my husband and I laughed so much during certain parts we had to watch again.  I've seen movies that were much, much, MUCH worse...",
      "total_reactions": 0,
      "user": "x_tina74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This movie was certainly not amazing but it really doesn't deserve all the hate that its gotten. The premise is  really interesting although I'm sure they likely could have done a better job with the overall product, there was more potential here. There's lots of action and original looking computer animation for the dead people. Jeff Bridges was definitely my favorite character. He was badass the whole way through. Ryan Reynolds still hasn't convinced me though. This movie certainly wasn't horrible but it could've been better.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "This is the **** film I have ever seen. This film is a **** A **** Its just a massive Men In Black ripoff with **** CGI & **** characters. I am only giving this film 1/10 because Kevin Bacon in it. And even he cannot fix the **** this film has.",
      "total_reactions": 0,
      "user": "TechnoElf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 0,
      "text": "Bottom line: It has been a long time since a movie very nearly ruined my day...",
      "total_reactions": 0,
      "user": "GregePorter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "R.I.P.D may look like something that you've seen before (and you kind of have) but with deft direction, the primal allure of redemption and lightning pace; prepare for a surprisingly entertaining ride.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "So. This movie is alot like men in black except worse. Literally this is men in black with different actors and a different sense of story. Ryan Reynolds and Jeff bridges have some good chemistry and the whole idea of them having a different idea because they are dead made for a few laugh out load moments. The story is also surprisingly action packed and the action scenes are quite exciting i must admit. however this movie suffers from a horrible, predictable, and cliche story. I could almost predict everything that was going to happen like in the movie San Andreas and that is never a good thing. Haven't the director ever had an original though before? Anyway This movie is a ok one time watch movie but I would never own this one",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Really, don't get hold back by all the negative review. It's just a good action/shooter movie with a decent plot. The story is wel thought of and really I actually don't see why people keep saying its a simple MIB/ghostbusters copy. I didn't even think of that untill I read the reviews. Yes, the story might be predictable, but I wasn't bored a single time during the movie. So, R.I.P.D. is an excelent movie to watch on your free friday evening and just let the fiction and shooting go.",
      "total_reactions": 0,
      "user": "hollandmajor"
    }
  ],
  "metascore": 25,
  "name": "R.I.P.D.",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 19,
    "month": 7,
    "year": 2013
  },
  "opening_weekend_income": 12691415,
  "opening_weekend_income_currency": "$",
  "rating": 5.6,
  "rating_count": 95336,
  "rating_freq": {
    "1": 2795,
    "10": 4231,
    "2": 2901,
    "3": 5327,
    "4": 9847,
    "5": 19408,
    "6": 25053,
    "7": 16623,
    "8": 6798,
    "9": 2353
  },
  "release_day": 19,
  "release_month": "July",
  "release_year": 2013,
  "user_review_count": 217,
  "votes_per_demo": {
    "aged_18-29": 32358,
    "aged_30-44": 36281,
    "aged_45+": 8481,
    "aged_under_18": 299,
    "females": 13141,
    "females_aged_18-29": 5857,
    "females_aged_30-44": 4875,
    "females_aged_45+": 1270,
    "females_under_18": 65,
    "imdb_staff": 9,
    "imdb_users": 95336,
    "males": 68595,
    "males_aged_18-29": 26169,
    "males_aged_30-44": 30927,
    "males_aged_45+": 7063,
    "males_under_18": 229,
    "non-us_users": 47488,
    "top_1000_voters": 461,
    "us_users": 13613
  },
  "year": 2013
}