{
  "avg_rating_per_demo": {
    "aged_18-29": 5.8,
    "aged_30-44": 5.5,
    "aged_45+": 5.6,
    "aged_under_18": 5.9,
    "females": 5.7,
    "females_aged_18-29": 5.8,
    "females_aged_30-44": 5.6,
    "females_aged_45+": 5.9,
    "females_under_18": 5.5,
    "imdb_staff": 4.4,
    "imdb_users": 5.6,
    "males": 5.6,
    "males_aged_18-29": 5.8,
    "males_aged_30-44": 5.5,
    "males_aged_45+": 5.6,
    "males_under_18": 6.0,
    "non-us_users": 5.6,
    "top_1000_voters": 5.0,
    "us_users": 5.5
  },
  "avg_screens": 1178.375,
  "budget": 30000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 12,
    "year": 2013
  },
  "critic_review_count": 184,
  "duration": 88,
  "genres": [
    "crime",
    "thriller"
  ],
  "gross_income": 19316646,
  "max_screens": 3026,
  "mc_avg_user_score": 5.4,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 43,
  "mc_movie_name": "Runner Runner",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 30,
  "mc_pro_critic_reviews": [
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Runner Runner starts off with a solid draw, then folds on the flop."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 58,
      "summary": "Could have been a fun film, but instead merely displays the trappings of one."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Ben Affleck makes for a pretty good jerk, but he can’t pull off outright villainy. That’s probably the main problem with the crime thriller Runner Runner."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Various subplots are given short shrift and the whole thing feels more like a Cliff's Notes version of a longer piece than an actual finished motion picture."
    },
    {
      "critic": "Dan Callahan",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The kind of meat-and-potatoes genre picture that might be passable if the people involved in making it had given the same thought and concentration to the development of the plot and the ending as they did to the fairly involving set-up."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Even the best player can only go so far with a bum hand."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The ultimately forgettable Runner Runner is, for a gambling film, markedly risk-averse."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "After an intriguing setup, “Runner Runner” devolves into a by-the-books thriller."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The struggles in the movie are with the moments when life and liberty are on the line. The ones that should put you on the edge of your seat are more likely to have you glancing at your watch."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "In different hands, Runner Runner might have worked as sleazy tropical noir, but director Brad Furman (The Lincoln Lawyer) never quite embraces the tawdriness of his material."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "One of the film's biggest problems is that Richie is an unsympathetic and rather dim character. The badly drawn role does the likable Timberlake no favors."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Runner Runner is content to stay high gloss, with no filler."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The best parts of Runner Runner feel like a Rounders facsimile—right down to the metaphor-heavy narration—and the worst seem like a case of mission drift, as if the filmmakers set out to make a behind-the-curtain thriller about online gambling, but got hung up in paying off the plot."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Thrillers don’t come much more nondescript than this: If Runner Runner were a color scheme, it would be beige, with an accent wall in taupe."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "This is little more than an expensive-looking celebrity vacation video—more evidence in support of the notion that the Hollywood house always wins."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "This is the kind of movie that, in order to puff itself up, quotes Meyer Lansky, Napoleon and Native American sayings. But according to Hoyle — as poker players would say — the film really just does boilerplate Hollywood drama."
    },
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "However exotic the locations and starry the stars, there’s no escaping this is The Devil’s Advocate of online gambling. Fold."
    },
    {
      "critic": "Stephen Kelly",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Justin Timberlake and Ben Affleck give their best poker faces but ultimately fail to convince you to gamble your cash away on this limp, unoriginal story of a man out of his depth."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "This is a lazy, trashy film that barely goes through the motions."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 40,
      "summary": "Runner Runner’s appeal increases dramatically whenever Affleck enters the frame."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "Runner Runner is a bad run of cliché clichés."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "Affleck? You never believe a word he says, not a gesture. This is the sort of acting he did in the sort of movies he made before he started writing and directing his own movies — bad."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "Remember the old Ben Affleck, the one who made 28 consecutive bad movies before he turned out to be a pretty good director? He’s back! Behold, the second coming of . . . Badfleck."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "The sort of generic crime thriller - stick-figure characters, pointless muddle of plot, people entering and exiting SUVs and Lear jets with a sense of urgency - that feels like it could drag on forever, and drag us down into a purgatory of stupefaction with it."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "When it’s time for the hot sex scene between Timberlake’s ambitious Richie Furst and Rebecca (Gemma Arterton), his boss’s luscious second-in-command, the encounter is as charmless and chemistry-free as the wooden banter that has led up to it. I’ve had dentist’s appointments that were sexier."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 37,
      "summary": "The film might take its name from poker subculture, but it lacks all the urgency, single-mindedness and swiftness that the title implies at its most literal. Runner Runner is a bummer. Bummer."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "It feels like a halfhearted bluff and has the stale smell of yesterday’s after-shave."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 30,
      "summary": "What's actually up onscreen in this vaguely ambitious but tawdry melodrama falls into an in-between no-man's-land that endows it with no distinction whatsoever, a work lacking both style and insight into the netherworld it seeks to reveal."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "The actors hit the jackpot, but only in terms of their paychecks. The audience gets a tension-free, tight-assed, \"Casino\" ripoff that leaves them thoroughly fleeced."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "Runner Runner is less than mediocre, but it's not repellent, which means that to watch it is to root for it - and to be disappointed."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "In its early moments, the movie evokes everything from \"The Social Network\" to \"Casino.\" By the end, the film has become as exciting as a game of Old Maid. R-rated thrillers are hardly ever this dull and listless, but this movie manages to eradicate all of Timberlake’s charisma and makes you flash back to Affleck’s \"Paycheck\"/\"Gigli\" era. How does this even happen?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Justin Timberlake plays a Princeton student who travels to Costa Rica to confront on-line gambling kingpin Ben Affleck about being cheated. When he gets there, he's offered a part in the game, which turns predictably sour and dangerous. While there's nothing original, this film is adequate in style and performances. The pacing never lapses and the art direction is attractive. If you enjoy these actors and don't want to see anything else, you won't be bored. You won't be thrilled, either.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "By far the biggest shortcoming of the film is the lack of interconnectivity between the gambling world and the characters in the movie itself. Early on, a behind-the-scenes glimpse at the online gaming industry is captivating but the film never commits to maintaining the insight as the larger crime narrative locks into place. Throughout the film, Thurman attempts to remind viewers that Runner Runner is about gambling through heavy-handed metaphors and exposition that explain the connections between high-stakes poker and high-roller living but none of these ideas come full circle by the end  as the story locks into a standard cat and mouse chase. As a result, gambling enthusiasts will likely conclude that Runner Runner is a shallow, and outright superficial, look at their hobby/business while anyone hoping for a sharp-witted look behind-the-scenes will find the film prioritizes generic story beats over innovative drama. Solid performances hint that, somewhere along the line, Thurman lost sight of any captivating hooks in his gambling thriller  instead delivering a bland and familiar narrative that, given the on-the-nose messages about striving for greatness, ironically, takes very few risks.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Ben Affleck as some good appeal here, and JT is pretty decent as well, but the acting can't save this movie. It comes out strong at the beginning, but the plot becomes weak and muddled as the movie drags on. Both actors are just stranded in weak material here.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "It's not a terrible movie as many suggest- it's highly predictable, but Timberlake, Arterton and Affleck are fun to watch in this context.  You've got gambling, sex, attractive people in pools, and a smart person negotiating his way out of a difficult series of circumstances.  It's the ultimate popcorn movie that doesn't require much in the way of thinking.  If you're up for that sort of thing, this should fill the bill.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Although I'm not too sure with the chemistry between a Grammy-winning pop megastar and a Oscar-winning actor (who's going to be in the Man of Steel sequel as the new Clooney *ahem... Batman). JT has some huge talented skills, but he can't act in a traditional style of a poker-esque movie. Runner, Runner has a list of great cast like Gemma Atkinson and Anthony Mackie, but there's nothing new in the movie. I feel very disappointed at Justin Timberlake's movie career status because he's not yet a full Hollywood A-lister and just like Taylor Kirsch and Colin Farrell and even Ryan Reynolds, he's just not making a name for himself when it comes to becoming a musician turned actor. Affleck's performance in Runner Runner is lesser than Gigli and more than Argo. But I think he took a few steps backwards before he even got nominated for his work in Argo. It was supposed to be a good thriller, but then again I just might go see \"Gravity\" instead. I think I should wait for a rental, but I don't wanna see Runner Runner right now. If you like poker movies, try \"Leaving Las Vegas\" or \"Casino Royale\" and maybe you're just in time to play the cards right.",
      "total_reactions": 2,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Occasionally bad or more appropriately named \"convenient writing\" aside, Runner Runner is simplistic hollywood entertainment. It never aspires to be anything super exceptional and it certainly doesn't dissappoint. It's weaker than 21, a somewhat similar movie but it offers up enough enjoyment to make it worth seeing. The trailers spoiled some of the plot and i think this is the kind of movie that would be more enjoyable if you went in knowing nothing about it. A lot of the f-bomb dropping seems unnecessary. The acting is passable all around. It was interesting to see the soon to be Batman in a villain sort of role. I wouldn't say he did a great job as Ivan Block but I also wouldn't say he did a terrible job either. The romance side plot between Gemma and Justin is laughable at best. Gemma's character in general seems very token, much like every other side character. Justin Timberlake did fine. I've never felt like he was a bad actor so maybe that's why I'm ok with his performance. Some of the twists near the end were good, but there were also some things that happened that were kinda iffy near the end as well. Really it's as I said before, it's good entertaining movie, and absolutely nothing more. Not one single aspect about it is exceptional and only a couple things are bad about it. Ultimately, it's a movie that knows it needs to entertain, something many much higher profile movies tend to forget.",
      "total_reactions": 0,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "I had many laughs while a watch this movie. You know why, for who else it could be, none other than our Ben Affleck. He was in a negative role in the movie but for me he looked more like a chocolate boy who is ready to romance than vicious villain. I liked his acting but not as a villain. I am not doubting his capable of performance but I felt the character should have been replaced with another actor. Then the movie would have been in a different position than now.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "I never used to understand what critics meant when they said that a movie \"never quite knows what it is\", then I watched Runner Runner. Justin Timberlake, yes he does acting now, stars as the sort of main Richie Furst who leaves college to become part of Ben Afflecks business (Batman Industries). While Affleck compensates for pretty much every other performance in the movie. Timberlake just makes them look a lot better. It's not that he can't act he just  actually he can't act it's as simple as that. Gemma Arterton plays the girlfriend of every male character in the movie, and is obviously still trying to recover from St Trinians 2, but does it well. With the exception of the slightly intriguing premise (which probably looked good on paper) that is the only positive thing about Runner Runner. Everything else mainly the plot is very easily forgettable or all over the place or both. It goes from drama to thriller to romance to drama to action to crime and back to romance, that's only the first 10 minutes. I would explain how varied the whole movie is but I can't remember more than 20 minutes of the 100 minute runtime. However I can recall being slightly entertained or at least not bored. Which was actually quite surprising because there was not one explosion, a rare thing to see in any movie nowadays. Actually I'm not 100% sure there were no explosions because it was so easily forgettable. Undoubtedly not worth watching.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "Well if this isn't one of the worst movies I've ever seen then I don't know what is. It's like they put the actors up to something they weren't ready for in their career, basically saying the acting was bad. The story just flops on itself and never recovers. 2/10 would hardly recommend.",
      "total_reactions": 0,
      "user": "Aedrone12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Ben Affleck should stick to directing.  This film did not make use of any of the potential it had to be captivating. It was way to easy to figure out where it was going right from the start.",
      "total_reactions": 0,
      "user": "JJorgy77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "one smelly crack word.................................................................................................................... Ben Affleck.",
      "total_reactions": 0,
      "user": "theEdman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Terrible movie, I went to the theater when it was out did not know what this was seen it afterwards I felt like my life was wasted watching this. The story is very Terrible and Justin Timberlake acting is the worst I seen and I watched the love guru and in time(both staring him and where terrible). Ben Affleck acted great although that did not help the movie it self. Overall this movie is about a college student who got scammed on internet gambling and tracks down the guy who owns the site (Affeck) then he hires him to work online for him then the rest of the movie gets very stupid and terrible the end.",
      "total_reactions": 0,
      "user": "VampireRawr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Some really great actors in this movie but they didn't work well together and didn't make a good movie. It was very predictable with nothing interesting really happening and it never got my attention like I wanted it too.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"Runner Runner\" 10 Scale Rating: 5.0 (Mediocre) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "ore. You can tell all of her songs came from the heart. The only thing that I have to say is that I don't think \"Run The World (Girls)\" fits into the album AT ALL. Other than that, the album is flawle",
      "total_reactions": 0,
      "user": "Clubsocial"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Foxes é maravilhosa. Eu amo tudo o que ela faz, tudo bem feito, impecável. Coisa de artista de verdade, é uma pena ver que não tem o reconhecimento merecido.",
      "total_reactions": 0,
      "user": "Rosaria88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "The mannered speech is fun, the players are charismatic, and director Brad Furman maintains an agreeably brisk pace.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 36,
  "name": "Runner Runner",
  "num_weekends": 8,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 10,
    "year": 2013
  },
  "opening_weekend_income": 7706712,
  "opening_weekend_income_currency": "$",
  "rating": 5.6,
  "rating_count": 53615,
  "rating_freq": {
    "1": 1256,
    "10": 1857,
    "2": 1179,
    "3": 2355,
    "4": 5173,
    "5": 11849,
    "6": 15912,
    "7": 9694,
    "8": 3299,
    "9": 1041
  },
  "release_day": 4,
  "release_month": "October",
  "release_year": 2013,
  "user_review_count": 97,
  "votes_per_demo": {
    "aged_18-29": 18643,
    "aged_30-44": 20512,
    "aged_45+": 4308,
    "aged_under_18": 85,
    "females": 7246,
    "females_aged_18-29": 3418,
    "females_aged_30-44": 2650,
    "females_aged_45+": 580,
    "females_under_18": 20,
    "imdb_staff": 5,
    "imdb_users": 53615,
    "males": 38790,
    "males_aged_18-29": 15037,
    "males_aged_30-44": 17575,
    "males_aged_45+": 3653,
    "males_under_18": 62,
    "non-us_users": 27839,
    "top_1000_voters": 303,
    "us_users": 6774
  },
  "year": 2013
}