{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 7.0,
    "aged_45+": 7.0,
    "aged_under_18": 7.3,
    "females": 7.0,
    "females_aged_18-29": 7.0,
    "females_aged_30-44": 7.0,
    "females_aged_45+": 7.1,
    "females_under_18": 7.2,
    "imdb_staff": 7.9,
    "imdb_users": 7.0,
    "males": 7.0,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.9,
    "males_aged_45+": 7.0,
    "males_under_18": 7.3,
    "non-us_users": 6.9,
    "top_1000_voters": 6.5,
    "us_users": 7.3
  },
  "avg_screens": 79.22222222222223,
  "budget": 750000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 12,
    "month": 10,
    "year": 2012
  },
  "critic_review_count": 269,
  "duration": 86,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 4007792,
  "max_screens": 182,
  "mc_avg_user_score": 7.6,
  "mc_metascore": 72,
  "mc_mixed_rating_frequency": 34,
  "mc_movie_name": "Safety Not Guaranteed",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 127,
  "mc_pro_critic_reviews": [
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 100,
      "summary": "It's equally endearing as a sweetly funny romance between two likable oddballs and as a low-tech time-travel thriller, and has something profound to say about making the most of the present."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 88,
      "summary": "Safety Not Guaranteed not only has dialogue that's about something, but characters who have some depth and dimension."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Even if something feels crazy -- whether it's falling in with a self-taught time-traveler, or buying into a charming but faintly flawed movie premise -- if you listen to your gut, wonderful things can happen."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "This is the rare movie with no one to root against, a film filled with good guys and weird guys (and gals), all of whom you hope find what they're looking for, even if you know that's not possible."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "The real revelation here is Plaza, whose shtick - the willowy cutie deadpanning about how lousy her life is - should be grating and tired, but it works remarkably well for some reason."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Delightful proof that money and fame have nothing on ingenuity and wit, Safety Not Guaranteed is worth a million meaningless blockbusters."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Aubrey Plaza proves she can carry a film with this multiplex-friendly comedy about time travel."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 80,
      "summary": "Develops into an endearingly scrappy and romantic romp that serves up some nice soul-searching moments alongside a steady stream of laughs."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Call me biased, but I'm quick to put out the welcome mat for any movie – good, bad or indifferent – that resists easy categorizing. That's certainly the charm of Safety NotGuaranteed, which flirts with two very different genres yet never goes steady with either."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "It's brisk and assured and never begs the audience's indulgence. No time is wasted. The movie is, at every moment, either funny or pushing the story forward, or both."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "It's about time: Aubrey Plaza gets her own movie!"
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "As happens with many time-travel films, this one ultimately paints itself into a bit of a narrative corner."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "The final scenes deliver a payoff worthy of the film's scrappy optimism, but that may not be the reason you walk out of the theater on a cloud. It's the sight of a character coming rapturously into her own at the same time as the actress playing her."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "You may buy the ending or not. The filmmakers certainly do, which helps. And the film is modest but skillful and heartfelt, spiced just so by Plaza and company."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "For the most part, Safety Not Guaranteed is a pleasant viewing experience, but there is a flaw. While Darius is bonding with Kenneth, Jeff is reconnecting with his past. This subplot goes nowhere."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "The main flaw is that, as an actor, Duplass isn't able to make the audience love him. Picture \"Bottle Rocket\"-era Owen Wilson in the role, and you've got something special."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Director Colin Trevorrow and writer Derek Connolly keep the film humming with funny and touching surprises. And Plaza is a flat-out enchantress."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "It's a tribute to Plaza and Duplass that they're able to make such slight material resonate at all, let alone with the poignancy they occasionally find."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Safety Not Guaranteed is a fable of ''redemption,'' and it's too tidy by half, but it is also very sweetly told."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "More focused on emotion than adventure, it teases out the possibilities and perils of time travel without embroiling itself in the confusion inherent to the subject."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Safety Not Guaranteed is permeated with that aura of unfocused melancholy common to so many indies these days -- what are we all so damn sad about? -- but by tying it back to characters that don't seem popped from any too-familiar mold, the film allows its sense of regret, its alarm at time passing, to feel earned."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "That time machine - a wonderful-looking gizmo with some lasers stolen from a medical laboratory - really exists. Whether it works or not, you'll have to see for yourself. It's worth the wait."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Touching, generous, sweet, this little slip of a movie puts you under some kind of spell."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "A viewer's patience with some of Safety's more rote stretches is rewarded in the film's final 15 minutes, when the plot takes a truly unexpected turn. As a DIY answer to the Spielberg generation's nostalgia for movie magic, the film's fully earnest, fantastic climax beats something like \"Super 8\" at its own game for a fraction of the cost."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 67,
      "summary": "I found myself falling for it, hard. It's Trevorrow's feature debut and we'd like to see more, please."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 67,
      "summary": "The movie shifts awkwardly from slapstick firearms training sessions to tender campfire kisses to straightforward suspense (who are those mysterious trench-coated figures?). Combined with unconvincing behavior from all of its characters, that's enough to leave this a disappointing realization of a potentially fascinating idea."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "Eccentric enough to get mistaken for an uplifting fantasy, but it's Plaza who belongs in the penthouse."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Where the narrative and characterization work, the visuals are lacking. Director Colin Trevorrow's digital cinematography occasionally resembles a YouTube video in mid-buffer, making the gorgeous and picturesque setting of the Pacific Northwest coastline appear bland and texture-less."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "I was onboard with the gentle charm of Safety Not Guaranteed until these last few scenes, when the genuine trauma suffered by these characters - especially Kenneth, whose paranoia and isolationism seem like symptoms of real mental illness - gets glossed over in an unconvincingly Spielbergian happy ending."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Safety Not Guaranteed doesn't quite know what kind of comedy it wants to be; the humor works best in its first hour, when the news-of-the-weird plot takes on a suggestive dimension of romantic desperation."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "Not sure if you'll enjoy Safety Not Guaranteed? Here's a quick litmus test: how do you feel about watching Mark Duplass, accompanying himself on zither (!), singing a heartfelt song about how \"everyone in the big machine tries to break your heart?\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I don't know why but I really liked Safety not guaranteed. It has great story and plot and it's really smart. It shows how important friendship is. It had some extremely funny moments and it was humouristic but it also had some sad moments. It had also sci-fi moments and the combination of those three is really good and the result of that film was excellent. The actors were ok and the film had many things going on which made it really interesting. I liked it  I didn't know the film but when I read about it I knew that I would like. An indie-low budget-must-watch. I guarantee you that you will like this film!",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "There is not really much to like or dislike in this film as it is not a complete film. Like many in of its type, its lacks any real depth and tries to get by on some teenage or SNL type charm. The result is a movie that has no real story, no resolution, no real characters that you give a damn, and you just leave the theater shaking your head. Why this was a crowd pleaser at Sundance may be because everything else was so lame? I don't know but this is a paper thin attempt at novelty that doesn't work.",
      "total_reactions": 3,
      "user": "JamesL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "I really enjoyed Safety Not Guaranteed, and it was mostly because Aubrey Plaza is very enjoyable/interesting to watch. My crush on her aside, this movie was very well done, in that it didn't sell out and explain everything going on but gave some tidbits here and there to keep your imagination going. There are laughs throughout, some times where you might feel some tears lingering behind your eyes, and other times where you are confused on what to feel- but that's a good thing. Everything about this movie is interesting and well played by the cast and every one else involved with the film. Definitely recommend anyone in their late teens and older to go check this out.",
      "total_reactions": 3,
      "user": "ManiacPhantom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "While it does have science fiction elements, Safety Not Guaranteed is much more quirky comedy than anything else.  It has the warmth, humor and intelligence that make for a good date movie, appealing to both men and women, but without the gushing sentimentality that is typical of mainstream rom-coms.  As a guy, this is the kind of date movie I actually like seeing.  Full review on my blog.",
      "total_reactions": 2,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Retro cinematic joy. I doubt that there is anyone who will not like this movie. Its witty, funny, well acted, well shot, imaginative, well thought out, well written, beautifully executed and the list just goes on. Its an extremely amazing dramedy which has way too many perks and NO cons. I recommend this movie to all movie goers.",
      "total_reactions": 2,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "The writing is extremely tight in this film.  The acting - especially Jake Johnson from The New Girl - is uniformly solid.  What starts out as a quirky, snarky story truly ends with substance. It's unexpectedly satisfying.",
      "total_reactions": 3,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Once in a while you have very little expectations before you start watching a movie and as you watch and the story develops you begin to be more and more interested, you giggle and smile and suddenly you get it, and you must see the conclusion! Safety Not Guaranteed is one of those movies.",
      "total_reactions": 1,
      "user": "bitburn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The message of the movie is uplifting. No matter how  weird a person is they are usually better with a companion. The ending of the film was just awkward to me.",
      "total_reactions": 1,
      "user": "eliteco3"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This is a wonderful little quirky film.  At no time during the film was I ever bored.  Aubrey Plaza (sort of reprising her role from Parks and Recreation) was marvelous and made the film for me.  The plot (inspired by a real life ad that appeared in a magazine) unfolds slowly and surprisingly, unlike so many other independent films, actually has an ending!",
      "total_reactions": 1,
      "user": "Rogerdob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "didn't like the acting, didn't like the script (alternatively vague and too on the nose and too unfunny), didn't like the cinematography, didn't like the music.  liked mark dupass, SPOILER the design of the time machine, and a few lines.  Don't believe the hype on this one.  I feel ripped off by how lame the movie was.  the story had potential and it went in none of the cool directions i hoped it might during the film.",
      "total_reactions": 1,
      "user": "ZenRobot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This movie is cute.  Honestly, there's no other way to say it.  It borders on cheesy at times but it's a very cute film that honestly makes you feel happy when it's over.  Not the best movie of 2012 but definitely a good, very cute film.  Perfect date movie.",
      "total_reactions": 1,
      "user": "Firestorm8623"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Wow, what a charmer this movie is. Jake Johnson pulls of the Russell Brand trick of making a smarmy, cynical character likable, and Aubrey Plaza is really a revelation. You suspect that her moping around in the first third of this movie would drive you away, but the way she warms up as the story progresses is really irresistible. Oh, and Mark Duplass should be a leading man in every other rom-com from here on out. Supporting roles are also uniformly stellar. I'm going to compare this to Juno because you think it's going to aggravate like nails on a blackboard, but then it completely wins you over. Highly recommended",
      "total_reactions": 1,
      "user": "OSS117"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This is a low budget movie that would probably bore 95% of the population. That being said, I am not part of that grouping because I loved it. I mainly only watched the movie because I love Aubrey Plaza but I am happy to say that I was pleasantly surprised. The acting was absolutely fantastic and the story was incredibly original. The movie was more about life and how we perceive ourselves in it than time travel and I think that's what the writer and director were going for so I think they did a great job. This film reminded me of a quote from the show Boston Legal where the character Alan Shore says, \"I think we live our lives so afraid to be seen as weak that we die, perhaps, without ever having been seen at all.\" If you see the movie I think you'd see why.",
      "total_reactions": 2,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Good acting and good writing. I expected it to be really corny at the end but it was actually very satisfying and enjoyable. I really liked this movie. It's the sleeper hit of the year imo.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "I took this movie by chance without knowing anything about the script or who were the producers - and it was a very good surprise.",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "I wouldn't understand how anyone could really dislike this movie. Maybe for the fact that Mark Duplass is way older than Aubrey Plaza, but then this movie illustrates that there are no bounds on love. With three people, out to investigate a story about a classified ad in the paper, each finds a separate story that they go out to take part of. Darius goes out to earn the trust of Kenneth to earn a place to go back in time and investigate the story. Jeff goes back to Ocean View to meet up with a lost love. And Arnau doesn't do much until he gets some inspiration on the trip. A very heartfelt kind of story that plays mostly on the acting and great script, \"Safety Not Guranteed\" is surely a winner and an admiration piece of work in the indie film business.",
      "total_reactions": 1,
      "user": "racketracer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I really appreciate the way this film avoids trying to milk drama out the obvious places.  Strong acting; comedy from Jake Johnson and depth from Mark Duplass. Just the way I like it, no sensationalism and plenty of understatement.",
      "total_reactions": 1,
      "user": "elliott41"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "http://www.sanctuaryreview.com/2012/08/movie-review-safety-not-guaranteed.html#more This summer has had an overwhelming amount of indie romance flicks.  Every other week it seems like there is another dramedy staring a who",
      "total_reactions": 1,
      "user": "sanctuaryreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "This is a movie about life and how time sucks the life out of you.  The 4 main characters are Kenneth (the crazy, socially inept, nice, crazy guy), Darius (the pretty, bitter, sad,  antisocial young woman), Jeff (the self centered, egotistical, rude, nostalgic aging man) & Arnau (the nerdy, quiet, awkward, intelligent student).",
      "total_reactions": 1,
      "user": "Zeusifer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Safety Not Guaranteed starts off like a film with promise. Remember how you felt when you first watched Little Miss Sunshine? Yeah, it starts off like that. But it doesn't take much longer than twenty or thirty minutes for Aubrey Plaza's one dimensional, too-cool-to-be-here attitude to completely remove the viewer from any dedication to her character. It's all the \"you're stupid\" blank stares you've come to love from her character in Parks and Rec...only for way longer. The same goes for Jake Johnson, who makes you think he is going to be hilarious for the whole film until you realize he's really just the cliche alcoholic **** writer with a silly story arc of his own in the film that has literally no payoff or relevance to the overall plot. With that being said, Mark Duplass as the paranoid time traveler is just really fantastic. His character distracted me from Plaza and Johnson's super indie, first world problematics and gave me a reason to stay awake for the entire film. He even performs a beautiful song somewhere near the end. But then there's \"the end.\" I've heard other critics give the ending of this movie a lot of praise. To be frank, I don't know why. It has a good ending the same way The Sopranos had a good ending. It just ends. So if you're looking for the heartfelt, dramatic comedy romp with a wild storyline and goosebumps-inducing ending...you're not going to get it. But I suppose if you have an hour and a half to spare, you can start this film up and enjoy Duplass being a stupidly good actor.",
      "total_reactions": 1,
      "user": "VonUnion"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "The movie is what one could deem an alt. romantic comedy any other belief going in is only going to lead you into a sad state affairs. The casting is uninspired, but there are not many romantic comedies alt. or regular that can say otherwise. So in terms of enjoyment do you like quirky things? Do have a positive state of being even when the evidence suggests otherwise? Congratulations this film is for you, everyone else exit the room because that ending will surely ruin your day.",
      "total_reactions": 1,
      "user": "poewilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Made with relatively unknown actors who however bring something really fresh on the silver screen, with relatively low budget leaving a lot of things through out the film in the viewers imagination, an original script that take you on a journey that you haven't been before and a visionary director who manages to pull all this madness together in a very endearing and enjoyable picture.  One of the most welcomed surprises of the year.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "A fun premise that gets ground into the dirt by the absolutely leaden acting of the always vacuous Aubrey Plaza and occasionally derailed by a supporting character subplot that goes nowhere and offers nothing to the main storyline. The oh-so hip indie soundtrack got far more thought put into it than the actual movie.",
      "total_reactions": 0,
      "user": "kakupacal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "Aubrey Plaza has this look about her.  She is short with large eyeballs so she has this way of looking up at people and showing them non-verbally that she thinks they are morons and whatever situation she is in at the moment is stupid.  If you are a fan of the TV show Parks & Recreation, you have seen this character before in April Ludgate.  The filmmakers of Safety Not Guaranteed most likely thought,",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Safety Not Guaranted is not overly dramatic or funny, but the light tone and depth of the story make it an enjoyable 80 minutes. The two leads are very likeable and the film is also about something, which is rare in our times.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Safety Not Guaranteed is a well acted, quirky and original comedy-drama; aside from a few unnecessary subplots and being little slow at times.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "This movie strikes a chord on a multitude of levels, with a few direct statements of truth. It doesn't hold your hand in some Hollywood fashion slowly ramping you up to \"get it\". It simply tells an all too real fairy tale of life, love and hardship. I cannot find a way to discredit this great flick in anyway, whether its campy nature or amateur window dressing shine through. It honestly deserves nothing less than a 10 for it's honesty.",
      "total_reactions": 0,
      "user": "Lionhearted"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "This film is a mildly amusing fanciful romp -- nothing more and nothing less.  Keep your expectations low and you should be pleasantly surprised.  A fun hour and a half.",
      "total_reactions": 0,
      "user": "DTDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "We are reminded once more of Aubrey Plaza's charm and bright career ahead of her. Safety Not Guaranteed is a young comedy that is uplifting enough to be remembered.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "“Safety Not Guaranteed” is a fairly quiet and genuine film about taking chances. That life should be taken advantage to its full potential, whether it be with an idea or loved one. There is also an underlying message about regret and how we should cope with it. We could either live with it, forget it or try to fix it.",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Impossible not to fall in love with this one. It really is a great example of how fun a film can be and how enjoyable watching a film can truly be. The acting from Aubrey Plaza, Mark Duplass, Jake Johnson, and Karan Soni, is great and very authentic. These people truly feel like real human beings and because of that, you can really identify with them. This is in large part thanks to the very good acting and the very good writing. The story really strikes a chord with you and the way it is presented is very good. I also like the the combination of comedy, romance, and sci-fi here. All are very well done and provide enough to keep your interest high. Overall, Safety Not Guaranteed is a funny, charming, touching, and exciting, little film that is worthy of the small amount of praise it got, though it may even deserve a bit more. It is not one of the best films ever, but it is a fun little watch that makes the hour and a half fly by like nothing.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Insanely likeable as it is funny and charming with wonderful performances by Mark Duplass, Jake Johnson, and Aubrey Plaza.  However, the tonal shift at the conclusion is jarring and feels inorganic to the rest of the story.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "A reasonably watchable movie and Aubrey Plaza is hard not to like. Ultimately however, the film descends into the sort of hipster drivel that we are seeing more of lately and the final product just seems to lack cohesion. It's one of those movies where after seeing the trailer you don't know how they could possibly make a full film based on what you've seen. I should probably start trusting my instincts when I feel that way about a preview, instead of deciding to watch a film based on the reviews and/or out of curiosity after seeing a head-scratching trailer.",
      "total_reactions": 0,
      "user": "Novagorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "With a killer premise, a witty personality, and an infectiously endearing heart at its center, \"Safety Not Guaranteed\" not only represents a lynchpin moment in the careers of both Aubrey Plaza and Mark Duplass, but the start of an explosively interesting career from Colin Trevorrow.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This film is all about the relationship between two characters who in the wrong director's hand might not be as believable or as heart felt as what we get here.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "\"Safety Not Guaranteed\" is a fantastic movie that you will never regret seeing. It's a happy movie with fun actors and will leave you smiling at its finish.",
      "total_reactions": 0,
      "user": "TrumanTruman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "I didn't find the movie all that funny, but it did have an effective dramatic side. I thought that they did well by not getting too technical about all the components of time travel because that would have just made it boring. I really enjoyed Jake Johnson in this movie I would've liked to have seen a bit more from him in the movie. However Karan Soni and Mark Duplass were both characters that I didn't really care for. I think the really I didn't like this movie as much as I had hoped was because it just gets too romantic. Safety Not Guaranteed isn't bad but I probably wouldn't watch it again.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "\"Safety Not Guaranteed\" 10 Scale Rating: 7.0 (Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Who: Aubrey Plaza, Pete Eckhart, and Nick Miller as Jeff Schwensen",
      "total_reactions": 0,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "Sci-fi. Guy recruits people to go back in time with him to save his girlfriend. Government agents take an interest. Not enough to hold my interest, turned off after half an hour.",
      "total_reactions": 0,
      "user": "shiftworker"
    }
  ],
  "metascore": 72,
  "name": "Safety Not Guaranteed",
  "num_weekends": 18,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 6,
    "year": 2012
  },
  "opening_weekend_income": 97762,
  "opening_weekend_income_currency": "$",
  "rating": 7.0,
  "rating_count": 104083,
  "rating_freq": {
    "1": 994,
    "10": 6055,
    "2": 644,
    "3": 1199,
    "4": 2547,
    "5": 6722,
    "6": 17966,
    "7": 33333,
    "8": 25038,
    "9": 9585
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 262,
  "votes_per_demo": {
    "aged_18-29": 38667,
    "aged_30-44": 41380,
    "aged_45+": 8506,
    "aged_under_18": 134,
    "females": 18526,
    "females_aged_18-29": 9354,
    "females_aged_30-44": 6803,
    "females_aged_45+": 1436,
    "females_under_18": 33,
    "imdb_staff": 29,
    "imdb_users": 104083,
    "males": 72478,
    "males_aged_18-29": 28852,
    "males_aged_30-44": 34048,
    "males_aged_45+": 6907,
    "males_under_18": 98,
    "non-us_users": 50818,
    "top_1000_voters": 427,
    "us_users": 23977
  },
  "year": 2012
}