{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.4,
    "aged_45+": 6.5,
    "aged_under_18": 7.0,
    "females": 6.6,
    "females_aged_18-29": 6.6,
    "females_aged_30-44": 6.5,
    "females_aged_45+": 6.8,
    "females_under_18": 7.5,
    "imdb_staff": 6.0,
    "imdb_users": 6.5,
    "males": 6.5,
    "males_aged_18-29": 6.6,
    "males_aged_30-44": 6.4,
    "males_aged_45+": 6.5,
    "males_under_18": 6.9,
    "non-us_users": 6.4,
    "top_1000_voters": 6.0,
    "us_users": 6.6
  },
  "avg_screens": 900.5,
  "budget": 30000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 15,
    "month": 6,
    "year": 2012
  },
  "critic_review_count": 257,
  "duration": 94,
  "genres": [
    "action",
    "crime",
    "thriller"
  ],
  "gross_income": 17120019,
  "max_screens": 2271,
  "mc_avg_user_score": 7.2,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 47,
  "mc_movie_name": "Safe",
  "mc_negative_rating_frequency": 10,
  "mc_positive_rating_frequency": 88,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Safe is both a slavish imitation of cinema gone by and a movie for our time. I found it wickedly entertaining and perversely refreshing in its total lack of contemporary piety."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "A rough, exhausting, exhilarating action picture with a payoff which would have delighted Sam Fuller or Howard Hawks. The Stath - an actual Olympian, remember - is on top form."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "There's a back story to this, and it's actually sort of witty."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "There are zero surprises, but it looks good, moves well through a trim running time and wields its clichés with defiant aplomb."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Boaz Yakin's slick direction, marked by quick cuts, unstinting energy and a lack of sentimentality, makes the action scenes satisfying. But he's a better director than writer."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The violence has the straightforward, unflinching characteristic evident in \"Reservoir Dogs\" and \"Pulp Fiction,\" although Yakin's dialogue falls considerably short of Tarantino's, both in terms of substance and offbeat humor."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "There's nothing terribly original about Safe, but it's a suitably grimy playground for action cinema's reigning pit bull."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Statham probably isn't going to be doing Shakespeare anytime soon. But everybody ought to be good at something, and when it comes to this kind of thing, Statham is very good, indeed."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "A preposterously enjoyable - or enjoyably preposterous - action-thriller."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Safe's primary contribution to the burgeoning Jason-Statham-kicks-everyone's-ass subgenre is setting three of its set pieces in crowded New York City venues (a subway car, a hotel dining room, and a Chinatown nightclub) where shootouts lead to believable mass-exodus pandemonium."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 60,
      "summary": "With Yakin's all-action plot operating like clockwork, an on-song Statham proves anything but expendable in a genre he dominates. Predictable, sure, but equally pleasurable."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "You can't help feeling that an initially adventurous movie has had its rough edges sanded away."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 58,
      "summary": "The character-building is proffered in bad faith, like every scene in Safe that doesn't involve bloodshed. Statham can sell a punch, but not his own vulnerability."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 58,
      "summary": "Safe has more action than intrigue (or logic), and it's boilerplate vicious. It may satisfy Statham's fans, but they - like he - would do well to enlarge their expectations."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 55,
      "summary": "It has neither the Red Bull–fueled crudeness of \"Crank\" nor the Frenchified lunatic vitality of the \"Transporter\" movies; it's not even as cheaply entertaining as the generic hit-man retread \"The Mechanic.\" Safe shows Statham comfortably treading water, proving all the things he no longer needs to prove."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Safe bangs along respectably enough, all thrown fists and cheeky comments, but it never feels like more than a second-tier video game brought to life."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Love the kid though, and Statham too – it takes a star with quality to be so rock solid in a crumbling yarn."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "None of this bears much or any resemblance to the real world, but the violence crunches, the editing snaps and the humorous one-liners pop at well-timed junctures."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Now, if only someone would offer this actor a project worthy of the full range of his talent."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Statham is still playing it safe in Safe, but vulnerability is showing through the cracks."
    },
    {
      "critic": "Stephen Dalton",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Though Safe initially seems a little darker and more thoughtful than the British star's previous comic-book escapades in \"Death Race,\" \"The Expendables\" or the \"Transporter\" trilogy, it ultimately reverts to testosterone-heavy formula."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "What starts out crisp and promising gives way to a conventional shoot-'em-up in Safe, a fast-paced but extremely familiar vehicle for Jason Statham, who can only carry the material so far on his brawny shoulders."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "Enough already with the pointless gun battles that litter Safe like spent syringes in a shooting gallery. No matter how spastically you edit them, you'll never top John Woo's early work, or, for that matter, Sam Peckinpah's. Aim higher, even if it means fewer hits."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 38,
      "summary": "Writer-director Boaz Yakin delivers his conflicting elements mostly as intended, and with obvious ambition. But he fails to take care of certain fundamentals - most problematically, coaxing out the emotion he's seeking from Statham and young newcomer Catherine Chan."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 20,
      "summary": "Safe arrives filled with bombast and sneers but barely any thrills."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Navigating between the Chinese Triad, Russian Mafia, corrupt NYPD members and an equally corrupt NY City Mayor's office, Stratham is either befriending or fighting with one or all four of the groups.  The movie is very predictable, but it was hard not to like it.  Stratham is a very capable action anti-hero here, though his character's back story is ludicrous.  The villains are all pretty stereotypical and mostly decently acted (with the exception of Chris Sarandon's gay mayor, who did not need to be gay and was was not a good casting decision -- totally unbelievable).  The sidekick little girl is cute and effective in her role.  It almost had the feel of a Chinese or Korean gangster movie, except the story just got too convoluted.  The main story line is preposterous, with the math savant child, the Triad's need for her in the U.S., then the dual safe exchange involved in the main plot payoff.  So when the story is this awful, but the action is real and pretty well filmed, how you rate it depends entirely on how much you like action movies. They are my guilty pleasure, but I like them better when they are not so contrived.  People who rate this movie poorly don't like the genre. Those who rate it highly are perhaps too enamored with the genre to be objective.",
      "total_reactions": 1,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "This may be Jason Statham's worst flick yet. The convoluted plot involves corrupt NYC cops pitted Chinese and Russian gangs. They're all out to find a Chinese girl with a gift for numbers and Statham is the indomitable tough guy who decides to protect her. The action gets off to a slow start (too much chatter) and most of the encounters involve gunplay (not hand-to-hand, which is Statham's forte). Like so many weak films these days, the fights are staged with jerky camera moves and blurry editing, so it's impossible to appreciate what's really happening. Nothing about Statham, the stunts or the story is special.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "'' Safe '' is just another Jason Statham's fun, violent action movie. Well, I actually enjoyed it. There were things that surprised me, that I wasn't expecting. The camera work was excellent. I was interested by the background story. The actions scenes were intense. Sure, there were shaky cameras, but it worked for this movie. You could still tell what was going on, so I didn't had problems with it. In action, gang, spy movies these days, we see a lot of stereotypes. You know, evil Russians, Chinese mobsters, etc. I'm sick and tired of seeing that. I know it's just a movie, but Hollywood should be more original sometimes. Of course, in '' Safe '', the math genius had to be a little Chinese girl. Oh well, what the heck, I liked her in the movie. Anyway, '' Safe '' was entertaining and it's a good action flick to see with some friends.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Safe is a Jason Statham film and for that reason there is a certain lowering of expectations that comes with it. For instance when I watched Killer Elite I went into it hoping for some competent action and Robert De Niro hamming it up as he likes to do from time to time. Because I went in expecting exactly what I got out of it, I was in the end, thoroughly entertained. However despite my expectations being incredibly low I just couldn't shake the feeling that Safe was missing something. Safe as a movie is all about chaos. the chaotic nature of the New York underground, where the film starts is compared with the underground crime families the film is based around. As people start killing and losing money in equal measure everything turns into chaos. That being said the chaos feels really scripted, as if someone is pulling the strings on one of the fasted puppet shows ever made. A fight emerges when expected, a tense conversation ends in bullets firing in the most predictable of ways. It's all designed to be exciting but if anything it just feels safe. It's a heavily mapped out action film with no room for original thought or a detour from whats expected. It ends neatly, the action is relatively well handled in a seen that before kind of way, and lots of people die. It's everything an action fan could want but somehow I just wanted more.",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Jason Statham is one half Jet Li and one half Bruce Willis, but the sum of the parts don't equal the whole. Plot is implausible, action sequences so-so. Bonus: the Chinese being spoken in this movie is painfully funny (but on average, more painful than funny.)",
      "total_reactions": 1,
      "user": "Darian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Jason needs to stop doing the B rated movies.  He is much to good for that.   This is another one that is just not up to the standard he should set for himself.",
      "total_reactions": 1,
      "user": "pdwlsn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "It's an extremely violent film and shows many racial stereotypes too, although I liked the fact that it shows a Chinese girl who is a mathematical genius (another stereotype). I love Jason Statham as an actor, although I think he should be given a better script to show off his acting chops.",
      "total_reactions": 4,
      "user": "mschoa"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Awesome movie with insanely cool action, terrific acting, and a great plot. It's one of the best action movies I've seen in a long time and I highly recommend it.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Really enjoyed this movie. Cool plot with awesome action. Don't expect much more. But I say it is definitely worth the money to see as it is a great ride and is better than most every other movie out for the last and next few weeks. Personally not sure why it is rated R. There's no nudity and no blood and hardly any swearing. I say it's a PG-13 level IMO. So if you're comfortable with with taking kids to a pg13 show this movie should be fine.",
      "total_reactions": 2,
      "user": "theoffice"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 2,
      "text": "What a horrible excuse for a film. The whole point here was to show ultra violent scenes, not to have a story that anyone cpould give a damn about.. I thought \"Safehouse\"was absurd but this makes it look like a calm, deliberate masterpiece. Violence, gore, and brain matter splattering acroos the sreen do not make a film. Half the time, you do not even know who is being killed. Also, I am sick and tired of the shaky camera technique.  I am not a prude but this nonsense is getting out of hand.   Pure garbarge.",
      "total_reactions": 7,
      "user": "JamesL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "It was OK.  It's not a full-course meal, but consider it one of those huge appetizers.  Just enough plot, style, and decent camera work to wrap around the real point of the movie:  showing a lot of as--s getting kicked.  With Van Damme and Segal's careers pretty much over, the only non-Asian carrying the martial arts torch these days is Statham and he does it well enough.  Transporter was his best, but this one fits in nicely with the rest of Jason's work.",
      "total_reactions": 1,
      "user": "BrahmaBull"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "mercury rising 2....with a vengeance! seriously this has been done. directors aren't even trying anymore with this bs. EXPLOSION! PEW PEW PEW!!!! and of coarse the gifted child that can memorize anything is an asian girl! i feel a 1st grader could have written the story line for this movie and done an as good if not better job.",
      "total_reactions": 3,
      "user": "ThePizzaman100"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "The plot is old school Clint Eastwood/Dirty Harry, but with a lot more violence.  Bad cops, Asian Mafia, Russian Mafia, can't trust anybody, etc etc etc.  However, the action scenes are riveting and there are a lot of them.  The director uses the dreaded motion camera, but you can still see what's going on in most of the scenes.  I feel Jason Stathom is the Clint Eastwood of action films, a man of few words, but talks with his fists and facial expressions.  Clint was criticized a lot for making the same film over and over, but I felt every movie he did was entertaining in its own way, and I feel that way about Jason Stathom.  This is a well done, entertaining film.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "Terrible film, unbelievable premise, cliched and racially stereotyped characters and rubbish dialogue. I wish Stratham was a bit more picky about his roles because I actually think he's a credible action hero. I was hoping the action scenes would save this one but they take too long to get going and when you've just finishing watching The Raid Redemption it seems more like pushing and shoving.",
      "total_reactions": 2,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "Safe is no thriller.  It is, however, convoluted,  preposterous, and predictable. There are chase scenes, a couple of gun fights, and occasional fisticuffs--none of which are at all exciting.  The fights in Safe are uninspired, messy brawls, done in the modern shaky-cam quick-cut style, which obscures Statham's martial arts prowess.   Safe spends 30 minutes setting up a premise that makes no sense, and then does nothing with it.  The story of Safe is too complicated, and the characters are too simple.  There is no reason to care about what happens to Luke and Mei against two gangs or twenty.   Statham delivers one-liners that suggests fun 80's action camp.  Safe, however, is not fun.  It is dull and tedious.  We are told much too early what the code is for; there are no surprises.  From then on, Safe is a mechanical exercise, void of any suspense or purpose.  Full review on my blog.",
      "total_reactions": 1,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Safe, the new fil of Jason Statham, Ineed say that is better than the Mechanic, but have the same problem that the other movies of Jason, is same. The story of Safe is interesting, but the development, yeah, is like the other movies, Statham kill, and we watch a boom, and the rest you know. The cast have terrible performances, but don't be important because they don't think in an oscar or a golden globe. Is better than the mechanic, but I feel that I watch a new version of the transporter.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "SAFE is loud, violent and funny, and most of all, really enjoyable. Out of all the Jason Statham films I have seen, SAFE is the best.",
      "total_reactions": 2,
      "user": "BBonasera15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Really enjoyed this statham's movie. In fact, Safe plays like a whoâ",
      "total_reactions": 1,
      "user": "LuckJoe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Statham is at his most comfortathable in films such as this, brutal violence and cheesy one liners. By design its an adrenaline fuelled ride and in that sense it certainly lives up. If you enjoy your action films then this is one to add to your bed notch, war movies apart, it is possibly the most killings in a film iv ever seen!",
      "total_reactions": 1,
      "user": "m4mercurial"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "It is typical a Jason Statham film. Action, action, action. From power punches until to realy really smal lovestorie. It is not so good as Transporter or Crank. The little Girl played realy well. She's playing in the film so real, that you don't think she's an actor. I think New York is a good place that they took. Definitely the metro made a good touch in the movie. But yeah the whole history isn't new, allready filmed. But for a action night in the cinema is this a good choize.",
      "total_reactions": 2,
      "user": "themarvin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Safe is a rather entertaining and somewhat competent action flick.  It features some nice brutal action and a surprisingly intelligent relationship between a hero and a little girl he is protecting.  The movie does, admittedly, take too long setting up the situation before the two meet; I'd estimate a solid third of the movie, which is a tad annoying since it is all a series of flashbacks.  There is also a distinct lack of action in this opening chapter as well, despite a high amount of tension, enemies being forged in a series of rather heated moments.  When the action comes, however, it is engaging and energetic.  The reason for all action sequences is generally clear, and this helps the audience connect with the situation in the movie.  Additionally, when Statham engages in a fight scene, he not only pulls a convincing performance of anger and fury, but also a clear look of desperation, as he is on a personal mission to keep this girl safe and free.  And that brings me up to another point:  I also appreciated that Statham's character is helping this girl on his own accord, for understandable but non-sappy personal reasons, versus some cliche reason, such as being a mercenary, or her being the daughter of some VIP.  And the ending of the movie does leave one with a reasonable amount of satisfaction; if there is a sequel or not is pretty much unimportant.  As an action movie, it's enjoyable - the gunfights are tight and the shoot-outs/fight sequences are very well choreographed and blocked.  My only serious complaint is that the cinematography often has the camera too close in on the action; a common problem with today's movies, and still annoying, but not the worst I've seen.",
      "total_reactions": 1,
      "user": "NojEsco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Great movie, plenty of action and has an actual plot that develops well. Also has quite alot of gore and blood. Although that helps with the reality of the plot. Overall this movie is just another example of a very good Jason Statham movie.",
      "total_reactions": 1,
      "user": "tjacobs38"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Significantly better than most run-of-the-mill Statham action thrillers. Just goes to show how just a little back story can push a film above mediocrity.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Good action and fighting scenes but the ending really sucks even though the story is nothing special.",
      "total_reactions": 0,
      "user": "Caestus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Like most Jason Statham movies, Safe was very entertaining and had tons of action and great fighting sequences. Unlike most though, and this was a good thing, the plot and character development was actually very good and the acting, though not a requirement in an action film with little drama and emotion, was also good. Statham is a BA, period. The critics will never love his movies because they're rather have artsy fartsy cinematic flare over just straight up, hard core action. This is why the best action movies never get high acclaim from them and never will. Regardless, if you like action and fighting movies, this is a movie for you.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "I've been on a bit of a Jason Statham kick lately and by now you all know how fond I am of his films. The man really has the action junkies raving and each film is better than the last, but even he has a hard time making Safe worth watching. Former New York City Police Detective, Luke Wright (Statham), has lost his job, his family, and his respect. He's down on his luck and on his way out, when he finds a lost Asian girl in the subway. That girl is Mei, a numbers servant from China, who has been kidnapped and forced to work for an organized crime syndicate. As it turns out, Mei is holding a secret in her head that the Chinese, Russians, and even the New York City Police are willing to kill for, so when she runs away all hell breaks loose. The story here is actually pretty solid and Jason Statham is once again terrific, playing a deep character with a great back story. Had this film expanded on the story and flashed back to the past, it may have been a lot better, but as it was, Safe quickly turns into to one big chase, with lots of bullets and bodies. Newcomer Catherine Chan plays Mei and she was horrible. This girl has been kidnapped and seen horrors that most of us couldn't even imagine, yet she's always stone faced. She is emotionless and clearly using a fake accent, making her performance dry and full of mumbled lines that do nothing but confuse the audience. Jason Statham gives his usual high energy performance, with amazing moves, and terrific one-liners, but without any support, in a film that goes from one chase to another, it really is just a wasted effort.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I found 'Safe' to be a competently made action thriller that fully lives up to it's name; the film plays it way too safe. Sure, Jason Statham delivers a surplus of ass-kickings and there is plenty of violent invention on display (I found a scene involving the use of a bottle as a silencer quite original) and I'll admit that I enjoy watching a bad-guy have his trachea broken. But violence can only go so far in entertainment and at some point a storyline and characters surface that can't match the focus placed on the action scenes. I would say that 'Safe' is a perfect cookie cutter example of such problematic action films. What I really was interested in was watching the relationship between Statham and Chan unfold, which it never did, and I couldn't help feeling bad for James Hong, who seemed horribly miscast as a chinese gangster. Give 'Safe' a chance if you're into mindless action devoid of any meaning. I however, have interests that lie elsewhere.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Safe is safe for the most part, not much blood, and no sex scenes.I thought it was a good movie. Did it have allot of action? YES! And what is wrong with that? It had a good enough story to fill in between the drama. I don`t understand how people go into a movie like this expecting some kind of deep story.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "I went into this movie not expecting anything great. My expectations were met. Safe is a rather uninteresting, unfocused movie without much value. Never in the movie was I drawn in. The characters weren't interesting, the story was bland, and the protagonists intentions were never really explained. Something about a homeless kick-boxer saving an asian girl and then wanting to get 30 million dollars. I don't get it.",
      "total_reactions": 0,
      "user": "shprea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Excelente filme!!!!",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "A pretty good action movie, action scenes are done uniquely and the idea is pretty cool. Overall it is an enjoyable action movie, sometimes the action scenes can get a little lackluster but it is still a kind little action movie.",
      "total_reactions": 0,
      "user": "Johnluna1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Safe is an exceptional Jason Statham B-movie that managed to sneak through the cracks during its theatrical release.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 55,
  "name": "Safe",
  "num_weekends": 8,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 27,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 7892539,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 86755,
  "rating_freq": {
    "1": 732,
    "10": 5602,
    "2": 543,
    "3": 1160,
    "4": 2971,
    "5": 8905,
    "6": 23646,
    "7": 27573,
    "8": 11817,
    "9": 3806
  },
  "release_day": 27,
  "release_month": "April",
  "release_year": 2012,
  "user_review_count": 137,
  "votes_per_demo": {
    "aged_18-29": 32994,
    "aged_30-44": 32578,
    "aged_45+": 7126,
    "aged_under_18": 157,
    "females": 7745,
    "females_aged_18-29": 3502,
    "females_aged_30-44": 2939,
    "females_aged_45+": 796,
    "females_under_18": 26,
    "imdb_staff": 7,
    "imdb_users": 86755,
    "males": 67807,
    "males_aged_18-29": 29179,
    "males_aged_30-44": 29282,
    "males_aged_45+": 6221,
    "males_under_18": 130,
    "non-us_users": 48252,
    "top_1000_voters": 431,
    "us_users": 10042
  },
  "year": 2012
}