{
  "avg_rating_per_demo": {
    "aged_18-29": 6.4,
    "aged_30-44": 5.9,
    "aged_45+": 5.9,
    "aged_under_18": 7.0,
    "females": 6.3,
    "females_aged_18-29": 6.4,
    "females_aged_30-44": 6.0,
    "females_aged_45+": 6.3,
    "females_under_18": 7.0,
    "imdb_staff": 5.4,
    "imdb_users": 6.2,
    "males": 6.1,
    "males_aged_18-29": 6.4,
    "males_aged_30-44": 5.9,
    "males_aged_45+": 5.9,
    "males_under_18": 7.0,
    "non-us_users": 6.0,
    "top_1000_voters": 6.0,
    "us_users": 6.5
  },
  "avg_screens": 1233.6666666666667,
  "budget": 40000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 24,
    "month": 6,
    "year": 2011
  },
  "critic_review_count": 422,
  "duration": 111,
  "genres": [
    "horror",
    "mystery"
  ],
  "gross_income": 38176892,
  "max_screens": 3314,
  "mc_avg_user_score": 6.5,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 102,
  "mc_movie_name": "Scream 4",
  "mc_negative_rating_frequency": 64,
  "mc_positive_rating_frequency": 226,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 83,
      "summary": "It's about time that another Scream flick came along to gouge the new cliches out of their sockets. Scream 4 does it in grandly Guignol style."
    },
    {
      "critic": "Josh Levin",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "Craven guides us expertly down a series of blind, bloody alleys, a journey that's more pleasurable than frustrating. On account of his steady hand, the last act is as good as could be expected: skillfully conceived and entertaining in its preposterousness."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "The kills themselves are both bountiful and bloody, the movie references are brilliant and bloody, the funny is very frequent and very frequently bloody, but to say any more would ruin the boo."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Don't be late to this homecoming of director Wes Craven and writer Kevin Williamson's horror series, which begins with a twisty opening sequence that's bloody fun."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "A strange concoction, clever and self-knowing in the extreme and yet operating in primal ways that bypass wit. Something about it feels very modern."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "The film isn't as concerned with terrifying you as it is with showing you a good time, culminating with an over-the-top climax that is simultaneously utterly ridiculous and enjoyable."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Existing in a self-contained universe, Scream 4 is its own remake (Screamake), sequel (shriekquel), parody and critique. Thus it taunts and pleases audiences, mocks and justifies itself and makes any review redundant."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "The burden of creative responsibility feels heavier here than in any of the previous installments, ditto the trauma of seeing teenagers get stabbed to death. As a result this is quite effective as horror filmmaking and more pungent than anything he's done in a while."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 67,
      "summary": "Some of the riffs are really funny and/or expertly scary. Others have the feel of awfully snappy dialogue crafted by middleaged people trying a little too eagerly to sound like the young people from whose mouths the banter flows."
    },
    {
      "critic": "S.T. VanAirsdale ",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 65,
      "summary": "It would have a very good shot at being entertaining were it not so outwardly concerned with being important."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "For genre geeks, this can be fun - although nothing in Scream 4 is quite as clever as the filmmakers seem to think it is."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "It's fun to see that charming underreactor Neve Campbell, looking about 20 minutes older, back as Sidney Prescott."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "The generational mix of actors works well enough, although Campbell too often seems stranded with little to do until the climax."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "It's almost really cool, without quite being really cool."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "The picture delivers enough of the expected goods, if seldom with the wit or panache of the series' best."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "Don't go in expecting scares so much as laughs. Scream 4 is a better \"Scary Movie\" than any of the \"Scary Movies\" ever were, from its inventively gut-busting kills (watch out for that mail slot!) to the unintentionally humorous sight of the three leads acting as if they're in three separate films."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Scream 4 is so obsessed with the self-referential element that made the original Scream unique that it loses the capacity to be genuinely scary or funny."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Why doesn't anybody just buy a gun? I guess the female characters spent all their money on tight tank tops."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Between a diabolically funny start and a surprise climax, Scream 4 offers nothing more than a series of gory deaths that grow tiresome with repetition. The rating is a hard R, but Craven and Williamson keep it soft at its core. \"Scream 1\" is still the only keeper."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "It's hard to sustain that cheeky meta humor, and the film seems to just give in and join its slasher brethren, devolving into a string of gruesome, but unoriginal, slayings."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "It's rare for a sequel to extensively acknowledge its own pointlessness, let alone make the unnecessary nature of its existence a recurring theme, the way Scream 4 does. Then again, the Scream franchise has always been ahead of the curve when it comes to deconstructing itself and the rules of the slasher genre."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "All through the movie, Scream 4 lets us know that it knows exactly what it's up to - and then goes right ahead and gets up to it."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Scream 4 has a smart beginning, featuring Anna Paquin and Kristen Bell, and one well-delivered line at the end that would have brought down the house in a better movie."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "A fast-starting film that quickly piles meta, self-referential elements on top of each other until they no longer make much sense, and the whole thing collapses under the weight of its own coolness."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Too self-referential for its own good by half."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "After a promising start that uses Anna Paquin and Kristen Bell to perfection, they settle into their old stomping grounds as if they'd never left - and that turns out to be a letdown."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "The central conceit of the characters' fates being determined by the \"rules\" of horror movies feels irredeemably tired; a clever idea that was worth one movie."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "A desire to Know What You Did Last Installment is likely to be the biggest draw for Scream number four, but if this proves to be the last in the series, it's a bloody shame it ended not with a Scream but a whimper."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "If there was ever a horror film that made fans of the genre feel old, it's Scream 4."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "The problem is, the movie doesn't really care if we are laughing with it or at it."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "It's a fitfully amusing, not remotely scary slasher picture."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2011
      },
      "score": 30,
      "summary": "The enjoyable moments are limited to Alison Brie, funny as Sidney's publicist, and the final recasting of the movie as a backstage diva drama. As ever, the self-reflexive horror stuff is superficial, loveless, and constant-a ladled-on sauce to disguise what you're eating."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "To start, I am a massive \"Scream\" trilogy fan, but my thought in going in was that \"the franchise has had it's time and this is completely new, a new trilogy\". The film rewrites the rules of the first trilogy, and one of the most evident changes comes in the opening scene, in which 2 characters, 1 male, 1 female are killed. This scene will be seen as either boring and long-winded, or completely genius; my belief being the latter. It excited me and shocked me, without ever leaving the viewer lost, and in it's last moments (while giving a violent nod to a famous death from the 1st film) becomes the most violent and aggressive pre-title scene from all 4 films. Following a couple of misleading \"jumps\" and a little exposition, with the original 3 survivors positions all being developed quickly and efficiently, it isn't long before the film delves into the \"who's next?\" pace. With the standard \"CiCi/Candy\" kill being presented, in this movie as a more intelligent, brutal killing (and a particularly active Sidney Prescott facing off with 'Ghostface'), the movie already feels very different to it's predecessors. The kills are creative, quick and in heavy supply, and the list of suspects is soon whittled down, leading to the most shocking, well-acted, and at times hilarious conclusion that leads the viewer asking \"When is Scream 5 coming out?\".",
      "total_reactions": 6,
      "user": "RhysHilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Hey Wes Craven I give you an applause for bringing the franchise back to form and earning its good reputation back again with solid scares, skilled kills, and laughs. Too bad it did bad at the box-office you could start another trilogy. I give this movie 71%.",
      "total_reactions": 4,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "This is how it has gone in the series:",
      "total_reactions": 3,
      "user": "liptap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "The series that refuses to die.  Most horror movies have been going down hill for years so I'm glad they took another stab at resurrecting the SCREAM franchise - why not?!  Big stars, decent twists and lots of blood will almost always equate to big box office bucks and SCREAM 4 adequately mocks and embraces the horror genre all at the same time.  It's a little cheesy and too self-referential for it's own good (which is the idea; although I'm not sure they intended to be as over-the-top as it is) - but it mostly knows how to maintain  the suspense, occasionally entertain and, heaven forbid, be a watchable movie.  It won't bring back much life to a dilapidated genre - but it works.  If you're a fan of the series carve out a little time this weekend - you won't be disappointed.",
      "total_reactions": 3,
      "user": "MovieGuyBrian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I was really quite surprised at how much I liked Scream 4 - I was honestly expecting another Scream 3, or worse. The franchise is probably never going to equal the heights of the first installment again, but miraculously, it still remains a hugely enjoyable series. Wes Craven thankfully got the three main players back again (four if you count Roger L. Jackson). Neve Campbell's Sidney Prescott still makes a likeable protagonist (even if you wonder why, after all she's been through, she doesn't arm herself at all times) and David Arquette's Sherriff Dewey and Courtney Cox's Gale Weathers are still entertaining. The cast of young newcomers including Emma Roberts, Hayden Panettiere and Rory Culkin all serve their purpose, either by dying horribly or as potential Ghostface suspects. So it's business as usual in Wes Craven's Scream world, and while the plot's a little too predictable, some of the self-referential winks to the audience a little smug and annoying, and the run-time a bit lengthy, the film's energy and Kevin Willaimson's sharp script keeps you entertained throughout (bucket-loads of blood and some good jokes don't hurt either). So it's not as good as the original (something the film itself even amusingly points out at one point), but I struggle to think of many (if any) other fourth films in a franchise that are this decent, and that still have something to say. Horror films, after all, have evolved (or devolved, depending on your perspective) over the last decade, with handheld horror mockumentaries, torture-porn and the seemingly endless procession of remakes giving Craven an Williamson ample ammunition for affectionate parody. Scream 4 is a much more satisfying conclusion to the series than its underwhelming predecessor, but unfortunately, Hollywood being what it is, I doubt Ghostface is gone for good...",
      "total_reactions": 3,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "When it was first released in 1996, the original 'Scream' was an intelligent, and fun horror film that gave the slasher genre a big boost of much needed energy.  'Scream 2' was an entertaining sequel that cleverly built upon what the original film started.  'Scream 3', although not as bad as some people say, was admittedly a bit of a let down.  So after more than 10 years of horror films in between, we have 'Scream 4', ready to dissect and poke fun at recent horror films (and the state of the horror genre in general) once again, and it turns out, it's pretty good!  If you thought this series couldn't get any more self-aware, you were very, very wrong.  'Scream 4' is a hall of mirrors to the horror genre. It is arguable that this film is self-aware to a fault (with constant references not just to other horror movies, but to past 'Scream' films as well). And this time around the comedy is turned up a few notches, which does take away a bit from some of the bloodshed.  But, if taken with a small grain of salt, this can still be a fun movie. So enough about the cons, and onto the pros. Although not as good as 'Scream', 'Scream 4' is about on par with 'Scream 2', and is admittedly an improvement over 'Scream 3'.  For starters, it has a decent amount of fresh faces to liven things up (Hayden Penattiere and Rory Culkin are two standouts).  Like before, the characters in the film all speak with clever, self-aware dialogue.  There are also a few reasonably suspenseful set pieces, and the who will get it next/whodunit angle still works well enough to keep you guessing throughout the film.  If these movies are not your thing, I would be surprised if this one changed your mind.  But if you do enjoy the 'Scream' films for what they are (entertaining and suspenseful horror-comedies), then give 'Scream 4' a try.",
      "total_reactions": 2,
      "user": "vern"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Scream 4 recaptures the tone and intent of the first film in this franchise perfectly.  All the major players are back and boy, are they in for the ride of their lives!  Go see this if you love a good scary movie, but check out the original three films first, if you can.  A real fanboy (and fangirl) treat here!  Careful, the theater is dark.  Better take a friend to keep you company.  Plop down full price on this one, and be proud.",
      "total_reactions": 2,
      "user": "Finnatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Scream 4 does exactly what is expected, roll the first three movie together, add a twist (although hardly a surprise when it does happen) and let the body count rise. Worth a watch if you enjoyed the first three.",
      "total_reactions": 2,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Its true, its not particularly scary.  Once you've made enough sequels, it kind of loses its effect.  However, this is definitely an entertaining movie.  I laughed out loud a number of times, and unlike a lot of horror films, it wasn't unintentional.  Was also great from a nostalgia point of view.  Would definitely recommend to fans of the series.  For those disappointed with Scream 3, you could quite easily ignore that movie and pretend this was the real Scream 3.",
      "total_reactions": 1,
      "user": "bustinit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I'm a HUGE Scream fan. Scream 2 has always been my favorite for some reason. I think at this point it's purely nostalgic. For some reason as a kid I was obsessed with these movies, which is strange, I know. Any way, long story short, if you like the original trilogy, you'll like this one. Better than Scream 3 by far! Probably the most gory Scream movie yet and in my opinion, although none of them are all that scary, this is probably the scariest. Check it out!",
      "total_reactions": 1,
      "user": "ImTheOwens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was excellent! It was clever, scary, and the acting was great especially Emma Roberts and Hayden P. What was unusual was how it definitely beat out the 3rd movie right off the bat. Worth to watch.",
      "total_reactions": 1,
      "user": "Jfilo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "I have to say, I was impressed with this little reboot. I was eager to see it, but was not expecting much, boy did it surprise me. I don't think they could have done better at trying to bring the franchise back, I would almost say I like this better than the first movie, maybe not as good but I still really liked it. It was entertaining and had some good twists and the ending was very pleasing. I couldn't have ask for more from this movie. If your a fan of the franchise i would suggest giving this one a shot, just remember its not the original! its still a sequel and will never have the cult following of the original, but it is still a great installment and it will be added to my movie collection the day it is released on dvd.",
      "total_reactions": 1,
      "user": "maximumxxxx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "is the best film in the Scream series, because the deaths are more real, the picture quality is better than the other three and also has more positive than anything else. Emma Roberts and to complete ta fantastic in this movie",
      "total_reactions": 1,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Who could forget the first time Drew Barrymore met her end after being hunted down by ghost face in the original scream film some 15 years ago. Its been a decade since scream underwhelmed everybody with its lacklustre third instalment and with a fourth on the way I was sceptical about how the fourth would go and how it would affect the introduction to the review I would to write about it.",
      "total_reactions": 1,
      "user": "madmandonna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "Highly anticipated new slasher by Master Wes Craven. Lots of gore and an intriguing case of the murders. As always we seem not to know who the murderer is up to the end of the movie. Obviously, there's nothing in the movie we can't expect, nevertheless this is just a two-hour-long thrilling journey with Neve Campbell in the leading role. Looking forward to the next episode. Good 8 from me!",
      "total_reactions": 1,
      "user": "geminirs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I was a bit hesitant in seeing this movie, because of the typical downfall of horror films that just keeping making more movies when it should have stopped way sooner, such as Saw, or Final Destination. But this movie surprised me. As always, and I won't spoil anything, the killer or killers at the end were totally unexpected. Courtney Cox and David Arquette were great in their parts, but then again, they always are. Emma Roberts blindsided me. I had no idea her acting abilities were to that standard, as I always remembered her from 'Unfabulous' or 'Hotel for Dogs'. She really played her part magnificently. The movie was every bit as good as the first three, or maybe even better.",
      "total_reactions": 1,
      "user": "ashley_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "A great sequel-remake, Scre4m or Scream 4 is really awesome, the intro, jaja is very funny, Emma Roberts, David Arquette, Courteney Cow and Neve Campbell are awesome. This is a great example of sequel.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "The best movie of the saga.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "From the giddily familiar image of â",
      "total_reactions": 5,
      "user": "Deathromp"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I definitely have to say..speaking as a HUGE fan of the first 3 films that 11 yrs later in Scream 4...i was definitely thoroughly entertained. It was an amazing opening and ending that still has me thinking WOW! I highly recommend this to any horror fan and any fan of the first 3 films...way to go Kevin Williamson and Wes Craven...cant wait for Scream 5 and 6!",
      "total_reactions": 13,
      "user": "NateJax81"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "This sequel hopes to outsmart the audience by turning the tropes upside down, but it's more posing that payoff. It's the tenth anniversary of the original massacre and the town's teens are celebrating, even the original trio is back (Campbell, Cox & Arquette). Naturally, Ghost Face starts stabbing and provides plenty of bloody blows. There are a few mild jumps, but updating it to the social media slant isn't really that original.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I Loved the first Scream and the second one, not sure about the Third one but this is a Perfect Sequel! it wraps up everything in the Past and brings new Elements to the formula. Im not so Happy about this being a new Set of Sequels because this one Ended really Good!",
      "total_reactions": 3,
      "user": "TheOnlineGamer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "i found scream 4 to be hilarious, with its sudden outbursts and random comments, just adding some blood and guts to it makes it all the more weird. but what made this movie funny is that all the actors constantly try to avoid there inevitable death with their knowledge of scary movies that they've seen. If wes craven and kevin williamson thought this movie was gonna be scary they were far from right. suspencful maybe. scary not close.",
      "total_reactions": 9,
      "user": "dnaxmeister"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "It's a damned fun movie.  Had a little something for everyone - jump-out-of-your-skin moments, fresh commentary on other horror movies and social media obsession, classic characters from the series, and not one, not two, but three opening \"phone\" sequences. In my immediate vicinity, there were no less than 4 people hiding their eyes throughout the film, which is always a good sign.  Probably the best cast of any Scream film - no offense to Jamie Kennedy.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Scream 4 is one of the worst films I've ever seen: it is not clear if it is serious or a comedy. Indeed, often funny, but simply because it's ridiculous.",
      "total_reactions": 2,
      "user": "god-amaterasu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "Scream 4 has its ups and downs -- it is at times both fresh and formulaic -- however, fans of the series will be more than pleased. Pros: Lots of meta humor; likable characters with hilarious dialog; it feels like a classic slasher film. Cons: Formulaic; predictable; adds nothing fresh to the series; a hit-or-miss twist.",
      "total_reactions": 2,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "Wes Craven proves his genius once again, with this excellent \"reboot\" of the Scream series. This is an excellent slasher movie. It doesn't try to innovate, it incorporates clichÃ©s found in over three decades of horror movies and updates them for 2011. Not a 10 obviously, but it will give you a couple of good scares while also making you laugh.",
      "total_reactions": 2,
      "user": "Skyduke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Scream 4 is a welcome return to the franchise, reuniting old favorites with Ghostface, who is targeting unsuspecting victims in a mad ploy to get to survivor Sydney Prescott. The plot is pretty solid with a few blatant winks to the first film. The acting is mostly stellar (some hamming-it-up moments detract from the impact of the film in some instances) and the gore does not disapoint. Where does the film go wrong? Well, the opening sequence, in trying to be spectacular, kind of falls flat and turns out to be the weakest opening yet. It tries to take a stab at the ridiculous franchises out there that seem to fall apart as a new installment hits but doesn't take itself seriously enough in the moment, thus rendering it more of a Scary Movie type spoof than an actual slasher flick shocker. Still, the film delivers in thrills. And the pop culture references serve as a fun interlude to all the killing.",
      "total_reactions": 2,
      "user": "gemini0577"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "One of the best horror movies, comedies and horror mixed in a way unsurpassed. A great script, great performances. No more words, a great movie without taking nor by.",
      "total_reactions": 2,
      "user": "vini1904"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A wonderful exciting movie that took me by surprise. It was so creative and adaptive to this time period and the best Scream yet. I really hope there is another one. It was scary and funny which makes it stand out.",
      "total_reactions": 2,
      "user": "Trev29"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "The movie inside the movie, inside of the original movie, in conclusion it was **** omg.! not long ago that crap was tremendous, everything, absolutely everything was lousy.",
      "total_reactions": 7,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "This movies plot was terrible how a girl wanted to take Sydney's place and she was behind the whole thing ghost face should be a guy not a girl. .everyone hers a tip this movie is a waste of your time.",
      "total_reactions": 7,
      "user": "darktiger898"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "This is postmodernism at its finest, with a pure lack of inspiration, and iteration after iteration.",
      "total_reactions": 8,
      "user": "Afotai"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "It started off better then I expected (I am a huge Saw fan and I found it rather funny and kind of pathetic that they diss Saw in the intro of the film) but it took a huge turn for the worst. The entire film was just a remake of the first film when it comes down to it and its terribly acted. The last 20-30 mins (the climax of the film) was enjoyable and probably the only actual good part of the film.",
      "total_reactions": 4,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "As the critic Michael O'Sullivan from the Washington Post noted in his review of the film, Scream 4 does not care whether one laughs with it or at it. And I definitely laughed at it. It was one of the most ridiculous attempts at a horror film that I have seen. With no scares, and barely a few thrills (but 49 different plot twists to make up for it, unfortunately), Scream 4 just fails at being a horror and turns into a parody of itself and of the franchise it represents. Not remembering most of the previous Scream films, since I watched them a long time ago, I soon enough realised that there should not have been another Scream film in the first place. The desperation of the producers to get some more money out of the died franchise is obvious, when they are trying to \"re-invent\" the franchise through recycling old material but making it seem \"original\" and \"different.\" I ended up laughing at most of the film (I guess, at least it was entertaining in that regard), but also found myself palm-slapping myself a number of times because of how poor the screenplay was. It is basically a comedy and has nothing what a horror ought to have. It is a failed attempt to rejuvenate the franchise, which in my eyes, has utterly failed. Hopefully this will be the last of the Scream films.",
      "total_reactions": 5,
      "user": "smijatov"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "If you like this movie you are probably the worst kind of person. Try reading a book once in a while or actually thinking... but don't hurt yourself.",
      "total_reactions": 21,
      "user": "DGDSN"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "a movie empties into emotions",
      "total_reactions": 7,
      "user": "joregano"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "I  was bored for most part, never really scared or terrified and kept thinking where are they going with this script? A lot of missed chances to make this one interesting unfortunately. I hoped this one would be more scary again, bring something new. But it went to go down the funny road instead and also repeat the all-to-familiar self-citing and irony, which I found just lame and uninteresting. It's 2011, Wes Craven... Also I thought the movie wasn't clever like the first or parts of the second. Too many moments where you ask yourself if your intelligence as a viewer is being regarded at all. I would have loved this one to come out better, it's been 10 yrs and it seemed like they might just have had some great new takes on the series. But they didn't deliver that. More of the same old, which was great, even brilliant in part one, but doesn't drag out well in a forth installment. I rank this one as not as bad as the 3rd, but not as good as the 2nd film.",
      "total_reactions": 4,
      "user": "andisart"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "pure comedy plain and simple, not a moment of horror..just the same old lame cliches and  stupidity. Besides a decent twist at the end the rest made me laugh",
      "total_reactions": 3,
      "user": "jdm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "WOW! Scream 4 was just another masterpiece of Craven. Wes Craven, and Kevin Williamson prove once again that they are a strong team, and that the horror/comedy genre isn't dead, yet. Scream 4 is full of laughs, scares, and suspense!!!! I loved it!",
      "total_reactions": 1,
      "user": "Scream4Lover"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Scream 4 is an alright film. There were very good stab scenes in the film and the story can be interesting at some stages. The problems with this film is the movie trys to be way too funny but it dosent reach it goals and as much as it does improve from the third one, it stills dosent reach the goal that 1 and 2 did. I would give this a high rental.",
      "total_reactions": 1,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "Really? This is what one of the most acclaimed classic, horror movie series has to offer me? A bunch of teenage girls getting hacked up? It may appeal to other people, (for reasons I don't fully understand) but that is not what I would call a good horror movie experience. I realize it's just suppose to be a fun scary movie to take your date on, but that is just to much for my liking. Acting performances were fine. But the whole plot was just stupid.",
      "total_reactions": 3,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "The film is pretty terrible up until the last 30 mins then it got rather good. I did enjoy the twist at the end. The acting was horrible through out, the kills were boring and too generic, the entire film just sucked until the twist happens then its enjoyable for that part. Sadly though, It doesnt make up for the trash before that.",
      "total_reactions": 2,
      "user": "spadenx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was amassing it was the best scream installment yet and I really hope they make more because they get better and better. But the one thing i didn't like is you never find out what happend to her dad",
      "total_reactions": 2,
      "user": "Wesfan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Funny, meta, and for once actually unpredictable, Scream 4, in my opinion, actually outdoes the original.  However, it's still hindered greatly by the fact that it's the fourth in the series, and the fact that horror movies have been satirized and spoofed for well over a decade now doesn't help it out much either.  There were parts of it that I actually laughed out loud at, and other parts where it actually got me nervous.  It wasn't terrifying, but I can live with that.  My main complaint is that it takes itself too seriously.  It too often just feels like another horror film.  Craven directs it confidently, but couldn't he give it a little more style, or make it a little bit more of a spoof?  4 movies in I wish the series would stop trying to mix actual horror with the laughs.  I'm not saying to make it like the Scary Movie series, but I feel that a lighter tone would have helped it out.  Still, I'm hard pressed to try and recommend any other slasher film over it.  I had a decent time with it, but not a great one.",
      "total_reactions": 3,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I remember seeing this opening night, which I'm happy to say was actually my best theatrical experience I've ever had. Within the first seven minutes the film brings meta-humor and self-deprecation to a new level, pointing out all of the supposed flaws that anyone could complain about and opening addresses itself with, \"It's been done to death... Stick a fork in 1996 already.\" The dialogue is witty and acerbic the entire time and all feels fresh and modern, which in itself is a huge accomplishment. Characters are completely believable as teens and the acting is actually great, specifically Hayden Panettiere who plays my favorite character: a dry, sardonic and sexy closeted film geek. The brilliantly orchestrated final act discusses modern society's obsession with technology and easy-found fame and the identity of the killer surprised me to no end; even being a die hard fan of the franchise and a cinephile, I didn't guess anything correctly. There are SO many red herrings that make you contemplate if something is too obvious, who was doing what when, and makes you double check yourself in regards to reverse psychology of believing who the killer is. The best part is that all but one of the cliches and tropes that are utilized for satire are subverted and/or openly acknowledged. The script justifies a character's seemingly stupid actions or flips it outright. Everything is shot well with good use of lighting as well as a good orchestral score and the directing is good (pay attention to the increasing corniness of the opening scene). It's actually the best of the series, better than the first with very clever kills and witty satire regarding torture porn, found footage genre films, modern horror, remakes and reboots. And yes, it scared the crap out of me. 9.5/10, incredible, two thumbs up, etc.",
      "total_reactions": 1,
      "user": "MattCipolla926"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Before I become to critical of the film, let me say that Scream 4 did save the series after the disastrous Scream 3 and had its high points. However, between Emma Robert's lackluster acting and the gaping plot holes, Scream 4 certainly did not bring the series back to its former glory. Don't get me started on the ridiculous scene where the publicist is killed because there are multiple issues with that on its on. Overall, there are some great moments like when Kirby answers horror movie trivia with the killer, but the movie is plagued with mediocre acting and mediocre writing that make me refuse to score it higher than a 6.",
      "total_reactions": 1,
      "user": "HawkWD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "The cinema club leaders of Westboro High are pretty uninformed about the genre they profess to admire, or maybe it's a matter of the two fanboys placing restrictions on what constitutes a horror movie; a matter of tastemaker-sanctioned genre staticness. During a meeting, in which the rules for surviving a horror movie are being dissected, Charlie says, \"To be the new version, you know, 2.0? The killer should be filming the murders.\" With this heedless declaration, John McNaughton's \"Henry: Portrait of a Serial Killer\", and more importantly, \"Man Bites Dog\"(the original meta-horror movie that meant serious business), goes unacknowledged, especially when Robbie puts in his own two cents, adding that \"it's the natural next step in psycho slasher innovation,\" as if the murderers in \"Scream 4\" are pioneering a new methodology in the killing business. Benoit Poelvoorde, playing \"himself\" in the 1992 Belgian production, is the subject of a documentary film that profiles the day-to-day travails of a serial killer. To paraphrase and co-opt Robbie's proclamation in its proper context, \"the psycho slasher innovation\" of \"Man Bites Dog\" is how the filmmaker shifts the focus away from the cult of personality surrounding the homicidal maniac and more towards the person he's putting under life-threatening duress, so that the moviegoer identifies with the inevitable victim and not some hillbilly with a chainsaw, or a knife-wielding goalie. Ben doesn't have the sex appeal of an anti-hero; he has no gimmick. With the cameras rolling, this no frills psychopath, at one point, suffocates a young boy in his own bed, the culmination of a home invasion gone awry. The hands that hold the pillow steady over the smothered child's face are ordinary hands, all-too-human ones, without the accoutrements of knives extending from the fingers. The vicarious thrill of harmless bloodlusting people get from watching people die is largely absent, made strange by the film's straight-faced mockumentary form, in which the horror is the end-result of a slaying, and not the creative spectacle(the incident that prompts the arterial spray and all manners of bloodletting) leading up to the latest casualty in Jason, Michael Myers, or Freddy Kreuger's killing spree. The content is self-reflexive. It confronts the moviegoer with this burning question: Why do we like to watch people die in grisly fashion for fun? The \"Stab\" franchise, the movie series within the movie series, is used in \"Scream 4\" to exemplify the fandom behind slasher flicks in the form of an impromptu film festival, a \"Stab\"-athon staged by Robbie and Charlie. Playing to a capacity crowd in a barn house, \"Stab\" open just like \"Scream\", but with one significant change in the film-within-the-film adaptation of  \"The Woodsboro Murders\", the Gail Weathers bestselling book that gives the \"real-life\" account of the Ghostface Killer , whose fictitious handiwork is transformed into non-fiction by \"Scream 2\". Heather Graham, playing the role of the girl who gets murdered at the outset of \"Scream\", disrobes in the bathroom, an outright deviation from \"actual\" events leading up to the crime. To us, the actual moviegoers, the nudity is implied, but to the \"Stab\" audience, the partygoers at the \"Stab\"-athon, the suggested nudity from their diegetical perspective is frontal, and gratuitous, since the character Drew Barrymore plays, never endeavors to shower, therefore deconstructing the slasher pic trope of topless nubiles, because the bathroom scene in \"Stab\" is indeed superfluous, which is proven by the put-upon historicity of the original \"Scream\". In \"Stab\", just like many slasher movies of its ilk, the young woman shows us her breasts, then sooner or later, she shows us her blood. \"Man Bites Dog\" knows the trope well, and is more blunt about the interconnectedness that binds sex and violence together in all its R-rated glory, by replacing the usual display of exhibitionism(or consensual sex) found in most dead teenager movies with gang-rape as the prelude to the woman being murdered. \"Man Bites Dog\" brings to the foreground the seeming disinterest in sex that is common to all the major figures in the annals of horror cinema. Like \"Man Bites Dog\", the killer has sex on the brain in \"Henry: Portrait of a Serial Killer\", when Otis sexually assaults the woman that he and the titular character kills(along with her husband and son), and videotapes. These two seminal horror films are real in a way that \"Scream\" can never be, even with the advantage of the film-within-the-film device. As the Ghostface Killer records his attempted murder of Gail in the hayloft, the juxtaposition between the \"true story\" and \"based on a true story\" reveals nary a difference in form and content, especially since the homicidal videographer never shows his true face. He hides behind an iconic mask, a signifer of entertainment, purveyor of cinematic violence.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Although scary in a less haunting way than the first 'Scream' (which actually had you scared to fall asleep in case GhostFace came for you), 'Scream 4' manages to keep fans on the edge of their seat by using meta humour, shocking twists, and even a couple of genuine scares, both of which make up for the lack of emotion present and over-the-top body count.",
      "total_reactions": 0,
      "user": "GavGav96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "Scream 4 is a return for the original cast members and director Wes Craven..... but it seems that a lot has been lost in the transfer to a more modern horror. While I applaud Scream 4 in originality (the old satirical humour is still very much alive) a lot of tension, for me at least, was lost to half arsed dialogue, lack of build up and a predictable structure. It just wasn't tense enough. I really didn't care about the new characters they brought to the franchise. In fact, the only reason Scream isn't getting a lower score is because I was nowhere near guessing the killers identity. That and I have a soft spot for slashers, a genre of horror films that has nearly dried up. And it was good to see ghostface.",
      "total_reactions": 0,
      "user": "themoza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Very average, i was a fan of the originals of course, to me the best being 1 and 2. In any case, I think the producers / director tried to do too much here and tried waaay to hard to make it \"hip\" to the whole new media / internet / social media generation.",
      "total_reactions": 0,
      "user": "Melcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Before I watch the movie, I thought it was going to be so bad, because the 3rd movie wasn't so good as the 1st too, and by this time, it gave me the sensation this would be even worse. There are so many movies like this today, that I simply thought they couldn't innovate.",
      "total_reactions": 0,
      "user": "Xtreme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I really enjoyed this movie. The first half, I had mixed opinions since it was all the new characters and no actual action, but once things started to bounce in, I loved it. I also didn't expect the killer(s) to be who they were. Overall great movie and it definitely has revived the series!",
      "total_reactions": 0,
      "user": "Shikaidou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Scream 4 is a mildly diverting sequel for fans of the slasher franchise. There is definitely some fun nostalgia to derived from the familiar characters and settings. That said, all the clever in movie talk about the predictability of sequels / remakes ends up feeling very apt. Been there. Seen that. All the Ghostface staples are present and accounted for, but are blandly delivered without much innovation or suspense. Only the final stand dares to deviate from the usual formula. That said, it could have been a lot worse.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Scream 4's awkward pacing in the middle and some sometimes bad dialogue are very small prices to pay for a good movie. A clever script, a consistent cast, and the ways that Wes Craven refreshens the franchise are satisfying. Whether you think that this is better than the original Scream or not, it is the best since the original and is definitely worth checking out.",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Never watched the trilogy before (it's new trilogy by the way).Clever kills although the suspense reduce along with duration, but let's forget that and another minus, I love the dialogues, satire, so funny, entertaining overall.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "Pleasant surprise coming by from this. Scream 4 is the continuation of the franchise that best know how to relate to the original film through a script that manages to be creative, intelligent and fun most of the time. The opening sequence can now rival the great original film by making a joke of metalanguage in creative ways, something that the applicant in the franchise. Here the screenwriter Kevin Williamson can (de)construct a remake with new characters while giving prominence to the old characters, can play with the cliches of the genre, but can be stressful enough to function as suspense. In the collective ideas, those who work are more numerous than those who donâ",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This movie was watchable and the plot was good enough, but it just doesn't live up to Scream 1/2. Sometimes the acting was just horrible, especially from Sid's cousin.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I went to see the film yesterday, expecting to see a Scream movie. And do you know what I saw? A Scream movie. A damn good one at that. This movie does what a slasher horror film is supposed to do, make you scared, make you laugh, shock you, and give you a great plot. If your debating seeing this film, do not for a second longer. GO NOW!",
      "total_reactions": 0,
      "user": "Ethan24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "FINALLY!! A horror movie that does not blow. If you want to see a movie that will scare you to death, then this is not the movie you want. But this movie does provide the scares, the laughs, and makes you think also. It is the smartest horror movie i've ever seen. It catches all the modern cliches of horror movies. It brings the same genius writing that was in the first and second installment. The acting was god, and believable. With a great ensemble cast, Legendary director, and a horror savy writer, this movie tops the list of must sees.",
      "total_reactions": 0,
      "user": "AlexArvin21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "So 11 years on after the 'SCREAM' franchise was seemingly brought to a close Wes Craven is back with a fourth instalment of the horror series with the return of the original protagonists as well as a new generation of characters. This time around its a \"new generation\" so \"new rules.\" As always theres a few cameos in the opening sequences and Scre4m is no different, and this one is actually a pleasant surprise. And this makes a returning Sidney Prescott a murder suspect as she is returning to Woodsboro on the anniversary of the orginal murders to promote her new book. Before long the Ghostface killer goes on the murder path and the bodycount rises. As a fan of the original trilogy I was concerned that Scream 4 was nother more than a cash stunt but im glad to say its not the case. It's true it's not the scariest film, far from it but it does have some great, typical Scream moments and surprising certain parts are genuinely funny. Without spoiling the ending all I can say is I was really satisfied with the finale to Scream 4 and completely bought the motives of the killer which I suppose was a bit of a surprise given the circumstances. If it is to be the start of a new series of films then the signs look pretty good because it is a promising start to a new trilogy. As always the performances of the original cast are ever reliable with Neve Campbell is good as always as the victimised Sydney, David Arquette is funny as Sheriff Duey and Courtney Cox is fantastic as the minipulative Gail Winters who is suffering from writers black and not to be forgotten Hayden Panettiere who is awesome as the sexy-horror geek Kirby! In conclusion Scream 4 is a promising start if it is to kickstart a new set of movies and it bodes well for future outings but it's nothing to to fans of the horror genre and newcomers might struggle to understand all the fuss as it does nothing to raise the bar but nonetheless is immensly enjoyable and a worthwile watch.",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "I thought the first Scream was very good, but as for two and three, it's like they said i this one, \"They keep recycling the same **** over and over again...\" but I think the fourth redeemed the series. I didn't love this film, but I didn't hate it at all.",
      "total_reactions": 0,
      "user": "ZacharyMatson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Scream 4 had many suspenseful scenes and had some really funny moments and remarks. This film was not scary but I don't think it was trying to be. In my opinion it was the best scream film yet, the 1st one would be 2nd of the series. I really enjoyed this film and the bonus is that Hayden Panetierre blessed us with her appearance in this film.",
      "total_reactions": 0,
      "user": "Jcrank42210"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Very Entertaining. I was shocked when i saw a fourth was coming out after 11 years. But i couldn't resist to watch it. This movie was awesome. It wasn't trying to scare you, it was trying to entertain you. Which it did greatly with a hilarious opening, and a great ending. A shocking twist at the end which definitely catches everyone off guard. I lost faith in Wes Craven with 'My Soul To Take', which was garbage. But Scream 4 won't get anywhere near the garbage can.",
      "total_reactions": 0,
      "user": "jstrickler872"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "I first went in the theater expecting to see a half @ss remake , oh boy how wrong i was.. The first hour of the movie was setting all for the ending.. the killing , the story with sidney and her family, and then everything when crazy. The last 30 min where like mind blowing.. even though i love scary movies not in a million years was i expecting what happen at the end. Overall a really entertaining movie, and it is worth  the ticket .. i would go to see it again!!!..",
      "total_reactions": 0,
      "user": "mlrs138"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Scream 4 was definitely forth the wait. It had that old twist from Scream 1 for the old generation and the new twist for the new generation. So this was well thought out. It is a well rounded movie for the family to go and see. i think the parent and kids will be talking about this movie for months. I would recommend to anyone who just wants to sit down and watch a good movie not just horror fans.",
      "total_reactions": 0,
      "user": "willing83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "This movie was decent although I did not think it would ever end with the plot twists. It was entertaining but it pretty much sticks to the Scream formula and there isn't any new ideas here but the writer and director knows what works and the film is above average because of that. Wes Craven is very good at these kind of movies and I look foward to seeing the upcoming Scream sequels (if there are any)",
      "total_reactions": 0,
      "user": "cerealciller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "speaking as a HUGE fan of the first 3 films Scream 4 was just as good as the first i thought it was amazing with a ending that surpassed all the other movies",
      "total_reactions": 0,
      "user": "movieboy77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Scream 4 is a very good movie, both as part of the franchise, and as a standalone. It also stands as a good slasher flick. In my opinion nothing was overdone in the film. The script and plot where very inventive, and will keep you guessing until the end. I will admit, I feared that SCREAM 4 was just another cheap cash-in. What Williamson and Craven did here was impressive and ingenious. Some rare moments in the film were even mind-blowing! The cast is great and the film is hugely entertaining. Needless to say. Definetly 10 out of 10!!!!",
      "total_reactions": 0,
      "user": "Valek923"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "This review will be relatively spoiler freeâ",
      "total_reactions": 0,
      "user": "ilo2112"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Not bad not good. Could be a renter. I went for free and had fun. It pokes fun at itself and the genre. I come from the T&A; school of horror comedy. So, I guess I wanted more of that and less dutch angles. Oh yea I read books too.",
      "total_reactions": 0,
      "user": "jimmydean"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Plain and simple, if you want to have fun at the movies, you should see this movie! It is both, funny and scary. It may not be perfect, but it is the best movie theaters have at the moment.",
      "total_reactions": 0,
      "user": "Snake-007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Scream 4 is the horror movie i have ever seen.",
      "total_reactions": 0,
      "user": "TDG1992"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Scream 4 is a return to form for the Scream franchise that provides more of the humour and the thrills that made the original 1996 film as memorable as it is",
      "total_reactions": 0,
      "user": "BrandonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "I was completely blown away by the ending. Wes Craven has redeemed his name after the garbage that he put out in October, My Soul To Take. Easily that was his worst film in his long career. But Scream 4 redeems his name and its addition to the Scream franchise. The film paints many people as suspects and i was able to call who one of the killers was but the 2nd killer was what blew me away",
      "total_reactions": 0,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Scream 4",
      "total_reactions": 0,
      "user": "StopLookListen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Kevin Williamson's crazy arguments and Wes Craven's auto-parody make the highest fun from 2011 until now: The perfect remix of 1996's Scream and the perfect satire around the teenager horror genre. There is a lot of narrative problems too, as some exaggerations in the bloody joke and self-references, but it really takes the saga from the almost below ground. Just don't get so serious, and you will be surprised.",
      "total_reactions": 0,
      "user": "Viniaranha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "SCRE4M is a step up from its predecessor but it isn't as grand as the 1st and 2nd entry in this series. Theres blood and gore but like its passed on-traditional style, its also self-referential and has a comical outlook on horror cliches.and one liner puns. Still, I had a bloody good time! Its really nice to see the three back in action even though they don't have enough screen time.",
      "total_reactions": 0,
      "user": "Leeway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Not as bad as Scream 3, but doesn't come close to touching 1 or 2. With Kevin Williamson behind the pen I had high expectations going in. While some of those were met, overall it felt like maybe they (Craven and Williamson) should step away from the Scream movies and work on something new.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "I wasn't expected a reboot of the series but I was surprised by how \"Scream 4\" doesn't take itself so seriously and still knows how to play with the banalities of the horror genre.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Scream 4 is a dull and one of the least thrilled thriller movie . it wasn't scary at all and The story pretty much sucked . All the positive point goes to the awesome ensemble cast members . Cortney , David , Hayden did the best work , Emma and nave seems a little of but its okay ! Except for the cast the whole movie would probably be a non watchable movie . The way people die here that was so funny . my whole 5.5 point goes to the cast specially the names above !",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Scream 4 is a fun, modern horror movie that seems much more comfortable with the tone of the franchise than its two predecessors.",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Scream 4 flies past Scream 3 as a better film. Seeing Neve on the big screen again was an absolute pleasure. It is by far the funnest Horror Movie I've seen in a long time. Was great to see a horror movie use its brain and not rely on blood spurts, hacked body limbs and torture porn. While it's not a solid 10, it's way up there. But Scream 1 and 2 still reign supreme",
      "total_reactions": 0,
      "user": "driesy8888"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "I have been praying for a year that this film would be good. Or should I say, whenever my love of the scream trilogy and my knowledge of #4 coincided. Well, I loved it.",
      "total_reactions": 0,
      "user": "LordNaseby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "i loved this film. all i will say if your a scream fan i highly recommend this addition to the series. Oh and wes craven is back to prime form as is kevin williamson",
      "total_reactions": 0,
      "user": "ajh0795"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Scream 4 was a huge surprise. Sure, there was all the hype, but I never thought it would pay off. It definitely did, 100%. Well, that's what I thought when I saw it in theatres. Upon the second viewing, Scream 4's flaws are more noticeable, such as a bit of predictability and a few disappointing moments. However, the pros are all there: The characters are all distinct and interesting, the film actually has suspense and tension, and it was just a bloody good time. It's the perfect film for the Halloween season.",
      "total_reactions": 0,
      "user": "Dartcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "Not the best this year by a long shot, but not the worse either. I've seen a few of the others in the franchise (so I wasn't expecting something heavyweight in the brain area) and I more-or-less got what I paid for. The performances were mostly solid, the exception being that of Emma Roberts who seemed out of her depth (even in such a shallow movie). The blend of comedy and jumps was okay and the plot was daft enough to stay true to its predecessors. I think if you're not a fan of the genre, you should probably stay well clear - and if you are a fan, try to take it easy and not expect too much from a critically ill horse.",
      "total_reactions": 0,
      "user": "jayemm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "I would have to say that this movie is way better than the 2nd & 3rd, but that's probably because its a lot like the first. There were a lot of similar scenes where at times it was kind of hard to tell if the were continuing the story or trying to re-make the first. Besides that this movie wasn't too bad. It kept me entertained but I feel like they didn't take this one too seriously. The ending caught me by surprise and I thought it was the best part of the movie. That's my two cents (:",
      "total_reactions": 0,
      "user": "xximmabadkitty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "the opening of the movie was great, creative, and kind of funny. and i really like the whole story, it's pretty predictable, but still shocking. i love the idea of \"usually, in a movie, what will happen next is...\" or something like that. it's creative and it makes the viewer to think and guess, who was the killer. the characters were pretty much classic, Neve Campbell was predictable, Hayden Panettiere as well, but Emma Roberts was awesome. it's a joy to see her acting as a psycho, not just a sweet good girl like i always see on tv. she has proven the viewers that she is a great actress. the whole movie was entertaining to  me and i enjoyed watching it.",
      "total_reactions": 0,
      "user": "applemon26"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Scream 4 is a return to form for the Scream franchise that provides more of the humour and the thrills that made the original 1996 film as memorable as it is.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "I wanted to like Scream 4 more than I ultimately did, however, a few issues with the outlandish nature of some scenes, such as Alison Brie's parking garage bit and several other moments had me rolling my eyes a few too many times. It was really great having the main characters back and to delve back into the world of Sidney Prescott who is as stubborn as a mule, why won't she just die?! Nah, I jest, the tongue in cheek nature of these films alone is alone to set them above, say, Friday the 13th sequels which ultimately serve no purpose other than to kill off big titted women. Scream 4 has always featured familiar names getting killed off in simpler ways than, say, Freddy Kruger. The real-world, grounded nature of the human serial killer is a scarier notion than any ghost story so when these films go OTT like in Scream 3 and now 4, it ruins the film series. The original Scream still remains one of the scariest films because of the \"this could actually happen\" feeling which comes with a non-supernatural villain. Not that the villain in Scream 4 has any powers (Scream 3 certainly seemed to have whacky **** going on, dunno what but it's methods didn't make sense like in 2 or 1). Scream 4 was an attempt to fill the void left by Scream 3, bring the saga back into line whilst going off into a new, modern day horror comment. Unfortunately the lingering nature of Scream 3 stuck around therefore loses it a few points. As I said before, some familiar names here to get hacked off, and in true Scream tradition they're all from popular TV shows, which only makes the hacking more fun. Unfortunately the end twist was a little too predictable, however the very end, the last few lines were a clever nod to how we as society praise the good and the bad, even if we don't have all the facts. 7/10, I was hoping for a 9 at least.",
      "total_reactions": 0,
      "user": "radiobenji"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The entire plot in this movie reminded me of Scary Movie, which made the movie seem like a big joke to me. But there is a huge plot twist towards the end, so the movie isn't completely futile. I'm not a big fan of horror movies but this was actually a good one. It wasn't great, but it was good.",
      "total_reactions": 0,
      "user": "iAGR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Let's face it, when a film franchise makes it to a fourth film or higher, it usually sucks. What else can they really do with it and what's left of the story to tell us that we don't already know? That was my thinking going into Scream 4, but when it comes to Wes Craven, you really never know what you're going to get. After pumping out three movies in four years, Craven took eleven years off before taking another crack at Scream, thinking why not make what's old new again, and it works! Scream 4 continues the legacy of the series by combining a classic slasher film with the technology and youth of today, who are still making a mockery of the whole situation. The screenwriting is absolutely genius, as is evident by the opening scene, which actually rivals the scene in the first film. In Scream 4, we see a grown up Sidney Prescott return home to Woodsboro a changed woman. She's there to promote her new book and catch up with her old friends, Sheriff Dewey and his wife Gail. They're all having a nice reunion, on what turns out to be the anniversary of the first killings, when all of a sudden things turn ugly again. You know the characters and you know the actors playing them. They're a little bit older, they're a little bit wiser, and they're every bit as energetic and interesting as they were in the first three films. The old school Woodsboro family meets the current Woodsboro family and what you get is something that's very similar, but oddly different. Scream 4 is witty, clever, and updated. Wes Craven was right, what was old is new again and it reminded me of just how much I loved the original films.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I liked this movie and I didn't.. But for some reason, it didn't feel like a \"Scream\" film. However, I loved how Sidney's character how she matured for the better; as well as Gale's whom has stayed true to herself throughout the whole series. I didn't really like the idea of introducing a new group. But It's a new beginning, so you gotta do what you gotta do. But it just didn't feel like a Scream film sadly. It ill probably grow on me, I've only seen it three times.",
      "total_reactions": 0,
      "user": "ScarTissue1990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "This is like the MW3 of scream the movie sucks balls Emma Roberts seriously who gets her in it she is Nickelodeon ancient dusty vagina plus the plot was bull **** just cause the dumb butch **** wanted to be like cindy I left the theaters after Hayden panettiere died in it seriously left then",
      "total_reactions": 0,
      "user": "noblesix24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "This Scream is a lot better than the previous piles of crap. Little more scary and funny at the same time but the killer caught me by total surprise which was really refreshing for a horror picture.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The ever-growing popularity of the Horror remake has not escaped the tragic town of Woodsboro, and Sidney Prescott's return home sparks a new series of murders that have been fashioned after her first encounter with the Ghostface killer! SCREAM makes a surprising comeback after a decade away from the screen, teaming series creator Kevin Williamson with Wes Craven once more in what is easily the best sequel in the franchise. The new script is just as sharp as Ghostface's knife, never missing an opportunity to poke fun at modern Horror trends or the series, itself. Some of the greatest moments are achieved by exacerbating the concept of the metafilm to the point of lunacy, essentially creating a film about making a film about a film about films. The tagline promises a \"New Decade. New Rules.\" As we have come to find out from the previous films, the only New Rule is that SCREAM breaks all the rules. Plot contrivances aside, the film legitimately keeps the audience guessing until the very end, never knowing which cliche will be the next to suffer. Williamson has taken a clever approach to the remake as only the SCREAM films can, using the remake as an integral plot device towards something wholly original. While it is still as sappy and pretentious as each of the earlier entries, SCREAM 4 is equally entertaining for fans of the series. Neve Campbell, Courtney Cox, and David Arquette are each at home in their returning roles, and even the newcomers earn passing grades. One can only hope that the inevitable sequels continue to uphold the same level of intelligence and humor shown in this fourth film.",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "“Scream 4”, also known as “Scre4m”, knows its genre well enough to prove its superiority over the dumb horror films it proudly mocks, but it doesn’t come close to matching the quality of some of the great horror films it celebrates. Considering the franchise’s satirical nature, the past decade has provided director Wes Craven and writer Kevin Williamson with much material to work with. The movie succeeds when it sticks to the self-aware antics that it’s known for. Too bad this sequel often abandons this clever concept for ideas we’ve all grown familiar with.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "This Is The Biggest Step Up From Scream 3..",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "This isn't up to the same standard as the first Scream film but it is still enjoyable and well worth a view. I actually enjoyed the ensemble cast and thought that they all did very good jobs. Hopefully they won't make a fifth one as that may just be a step too far.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I know most critics don't love \"Scream 4\", but I believe it saved the franchise.  \"3\" showed the series was dead, but with a great use of humor and very clever kills, \"4\" is great entertainment.  Assuming you can find the horror in bloody slashings.  The usage of new characters along with returning favorites works well, and the twist at the end is satisfying.  This isn't classy, or even that memorable entertainment, but it should inspire several viewings.",
      "total_reactions": 0,
      "user": "BlakeP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "You start with a bad idea. Then you write a terrible script. Add some horror cliches,but so its not at all scary. Add some blood to show you mean business. What do you get? Scream 4.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "As it turns out the only Scream movie I have seen until about a month ago was the first one when it came out on DVD or TV one of the two. I just watched the 3rd one yesterday and the 4th today.  I really liked the 2nd one when I watched it a month or so ago and as of yesterday thought it was the best one out of the three. This one however, takes the cake. It may not try to achieve any ground breaking concepts for the franchise or the horror genre but, it delivers where it counts. The writing and filming are even better in my opinion then for the other three films. People say it's not scary but the scenes are just different enough from film to film that I think anyone afraid of jumpy scenes will get plenty of shock value. I don't think that it's just more of the same. A \"Who Did It\" plot is always exciting no matter how many times it has been done, as long as it's done so well like in this movie. All that being said, I think if done correctly there could be two more successful movies for the franchise. That being good actors playing the right characters. A good story driven plot and some new twists and turns we all want and expect.",
      "total_reactions": 0,
      "user": "mikeachu7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "I was surprised that \"Scream 4\" didn't suck, it was very good, actually great! I loved it! Good effects, great music, nice twist and some horror with a lot of fun!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "'Scre4m' is totally hot, showing us more than smart dialogues, scenes of great persecution, great deception, followed by great revelations, and a big, BIG, final act.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "To start, I am ahuge Scream series fan. When I first went to see it I didn't know what to expect. But in the end, it turned out to be decent. The only problem was the ending. I mean come on. Neve Campbelle got stabbed twice with a hunting knife and lived. How does that happen when everyone else who got stabbed once died. I guess they just couldn't afford to change things up a bit. The performances were great though, especially Hayden Panettiere's.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Scream 4,É estupidamente divertido,Não assusta tanto mas é inteligente.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Scream 4 is a good movie. The masked man was unpredictable who he was, the killings are good and i think it's better than scream 2 and 3. I would happily watch a fifth movie as the fourth was a funny thriller, which was not bad at all actually",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I was a bit nervous when I first heard that they were making a Scream movie in recent times, since times have changed, plus, with all the technology like phones and internet, people try way too hard to put it into movies, but, the use of technology in this movie was good and not very distracting at all, plus, the characters besides the Main Three were probably the most memorable out of every Scream movie. This one is definitely my favorite.",
      "total_reactions": 0,
      "user": "ItsRaininMen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Ahh, a refreshing installment to the Scream series, like drinking an ice cold Coke on a warm day. After a little over a decade of no Scream 4, viewers wanted something more than Scream 3, and that made the appeal a little better. When the third Scream as on its last legs, the fourth one found a crutch! Bravo to Wes Craven and the writers for finding their magic touch again.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "I would recommend you this movie only if you are a fan of Wes Craven, the Scream series or you would watch ''any'' horror movie just because. Yeah it can make fun of itself, but the acting of the characters are as bad as the other 3 movies, and the stupidity of the characters (how come ALL OF THEM could be this stupid) just makes you angry while you are watching the movie. So I hope it will be the last movie in Scream Saga...",
      "total_reactions": 0,
      "user": "Nefaki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "A decent instalment to a dead franchise. This was supposed to open the door to a potential new Scream Trilogy, however after a decade none of the ideas were fresh and the death scenes were predictable. The film's message that the unexpected is the new cliche is accurate however nothing was added to counteract.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Even though the film is more thrilling than scary, Scream 4 makes excellent use of its cast, new and old, and does very well as an updated who-dun-it thriller.",
      "total_reactions": 0,
      "user": "bradyshiro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "Scream 4 gets back to the biting humour, the intelligent characters, and the fantastic story, while adding more gore (a close-up of a gutting, a police officer stabbed in the forehead, etc.) and modernising the series without turning away from what made the first two so great.",
      "total_reactions": 0,
      "user": "TimeOfTheChimps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "The 4th scream movie is a definite improvement from the 3rd and this time with several plot twists that force you to watch to the end. I'ts a non-stop cycle of twists that continue all the way up to the end.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "As a big fan of the first 3 scream films, this was kinder disappointing honestly, it wasn't terrible, but it messes with the original formula in a bad way, but on the bright side, the scare factor is still there, the characters are very interesting & despite every character being very well developed, you never know who the killer is until the finale, on the down side, the beginning is very silly & repetitive, there are a lot of very daft moments & the climax is absolute ****, nowhere near as entertaining as the first three & a lot stupider too, again has it's good points but after an 11 year gap, quite the disappointment, but that's probably just me!",
      "total_reactions": 0,
      "user": "Robinson2511"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "I can't decide which is the weakest, the second or the fourth. While this one has one of the worst acting of the franchise, the kills were entertaining and kind of gory.As a fan of the Scream franchise, I was kind of let down by this final instalment. But, overall, a good film. Nothing more, nothing less.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Eleven years after Sidney Prescott (Neve Campbell) and her posse last tangled with a mad slasher/killer, the Scream series has been exhumed. Ignoring or forgetting that the final part of the original trilogy, Scream 3, underwhelmed in terms of popular reaction and ticket sales, the filmmakers have exhaled a last, rattling breath of desperation and returned to a well that ran dry last millennium and hasn't gained any moisture since then. There's no real story here; Scream 4 offers little more than a group of familiar characters wandering around a horror movie setting and uttering self-referential one-liners as the body count mounts... and mounts... and mounts. Scream's brand of horror, which lampooned the slasher genre while simultaneously embracing it, was fun and breezy in 1996. In 2011, it's about as fresh as the whiff of something stale and rank from a crypt.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Scre4m is a solid entry in the scream film franchise with some nifty moments of suspense and great humour this time around scream 4 does not really take itself to seriously which is good at times and bad at others for example when thy have a truly effective scary moment it will all be undone by a silly one liner. but all in all its a good movie that I would check out if you are a fan of the previous films.",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "The thing that make this film work is the false sense you get that you know what is going to happen because you have seen it all before. The fact that this is actually addressed by the characters themselves lets you know you are only along for the ride. Not that there isn’t some element of surprise because there are a few. Each kill is quick and brutal in classic Ghostface style. Sadly though the big reveal is not really a reveal. You can pretty much tell who the killers are two thirds of the way through the film. The obvious sign that lets you know –1. the way the direction focuses on trying to make you question everyone, except for two characters, who seem to be portrayed as innocent and hapless. Barely glanced at as merely harmless players. 2. a bit more hidden and subtle, every scenario of a “Scream” plot has been played out and discussed on screen, off screen, so where else could the story go but to venture deep within the family in order to validate the signature rage or misguided angst always directed toward Sidney Prescott.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Easily rises up its peers in the genre and is a suspenseful sequel worth screaming about.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "From the meta opening to its brutal ending, ''SCREAM 4'' proves to be the most entertaining of the franchise. One of the killer's motives is brilliant and so relevant even more today than it was five years ago. Emma Roberts is amazing as Jill. The trio is lovely, but the most interesting character by far is this generation's Randy, Kirby. The film does feel like it needs a lot more character development, but it is saved by the gory and sad deaths, memorable moments, opening kill, the killers' identity, their motive, and one particular line in the climax. Here's hoping that soon, a final sequel will be made to end the series properly. But if it won't happen, then this fourth installment in what is clearly horror's most consistent slasher franchise is a nice epilogue to the trilogy that shook the whole genre back in the 90s.",
      "total_reactions": 0,
      "user": "SPeterG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Eleven years after Sidney Prescott (Neve Campbell) and her posse last tangled with a mad slasher/killer, the Scream series has been exhumed. Ignoring or forgetting that the final part of the original trilogy, Scream 3, underwhelmed in terms of popular reaction and ticket sales, the filmmakers have exhaled a last, rattling breath of desperation and returned to a well that ran dry last millennium and hasn't gained any moisture since then. There's no real story here; Scream 4 offers little more than a group of familiar characters wandering around a horror movie setting and uttering self-referential one-liners as the body count mounts... and mounts... and mounts. Scream's brand of horror, which lampooned the slasher genre while simultaneously embracing it, was fun and breezy in 1996. In 2011, it's about as fresh as the whiff of something stale and rank from a crypt.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "The artistic medium of film is very subjective. Every audience member has a different set of criteria they use to measure their viewing experience. Not everyone shares the same set of criteria. If we did, what a bland and uninspired world this would be.",
      "total_reactions": 0,
      "user": "BerC"
    }
  ],
  "metascore": 52,
  "name": "Scream 4",
  "num_weekends": 9,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 15,
    "month": 4,
    "year": 2011
  },
  "opening_weekend_income": 2061885,
  "opening_weekend_income_currency": "£",
  "rating": 6.2,
  "rating_count": 107429,
  "rating_freq": {
    "1": 3647,
    "10": 10696,
    "2": 2468,
    "3": 3931,
    "4": 7492,
    "5": 14352,
    "6": 23614,
    "7": 22416,
    "8": 13143,
    "9": 5670
  },
  "release_day": 15,
  "release_month": "April",
  "release_year": 2011,
  "user_review_count": 524,
  "votes_per_demo": {
    "aged_18-29": 45116,
    "aged_30-44": 42252,
    "aged_45+": 5545,
    "aged_under_18": 301,
    "females": 18157,
    "females_aged_18-29": 10102,
    "females_aged_30-44": 6550,
    "females_aged_45+": 845,
    "females_under_18": 64,
    "imdb_staff": 9,
    "imdb_users": 107429,
    "males": 76923,
    "males_aged_18-29": 34612,
    "males_aged_30-44": 35229,
    "males_aged_45+": 4610,
    "males_under_18": 232,
    "non-us_users": 56188,
    "top_1000_voters": 571,
    "us_users": 22714
  },
  "year": 2011
}