{
  "avg_rating_per_demo": {
    "aged_18-29": 5.4,
    "aged_30-44": 5.3,
    "aged_45+": 5.6,
    "aged_under_18": 6.0,
    "females": 5.4,
    "females_aged_18-29": 5.4,
    "females_aged_30-44": 5.3,
    "females_aged_45+": 5.9,
    "females_under_18": 6.2,
    "imdb_staff": 5.9,
    "imdb_users": 5.4,
    "males": 5.4,
    "males_aged_18-29": 5.4,
    "males_aged_30-44": 5.3,
    "males_aged_45+": 5.6,
    "males_under_18": 6.0,
    "non-us_users": 5.4,
    "top_1000_voters": 5.1,
    "us_users": 5.3
  },
  "avg_screens": 1009.3,
  "budget": 40000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 18,
    "month": 3,
    "year": 2011
  },
  "critic_review_count": 276,
  "duration": 95,
  "genres": [
    "action",
    "adventure",
    "fantasy"
  ],
  "gross_income": 24823283,
  "max_screens": 2827,
  "mc_avg_user_score": 5.0,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 72,
  "mc_movie_name": "Season of the Witch",
  "mc_negative_rating_frequency": 38,
  "mc_positive_rating_frequency": 36,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 55,
      "summary": "Season of the Witch is barely even a Nicolas Cage movie. He wanders through the picture, zombified."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "You know I am a fan of Nic Cage and Ron Perlman. Here, like cows, they devour the scenery, regurgitate it to a second stomach found only in actors and chew it as cud. It is a noble effort, but I prefer them in their straight-through Human Centipede mode."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Though it slows down in the back half, the opening acts of Season are reasonably entertaining."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The pretty good stuff comes early, when Nic and Ron, weary of wasting women and children, suffer an attack of conscience and desert the Crusades."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "A mishmash of horror and history genres that's not as bad as its trailers but ultimately is dragged down by, of all things, its star."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "The best thing about it is Claire Foy's performance as the seething, caged is-she-a-witch?. Foy, like a Brit Kristen Stewart, has an entrancing sparkle of disdain."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 42,
      "summary": "It would take a lot more than holy water to rescue Season of the Witch from mediocrity."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "It's \"Centurion Deux\" without the second-coming-of-Carpenter pretense, though you still wish the trashiness were more distinctive."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "The makeup department's glommed-on plague pustules are fantastic, but the concession to modern technology in a badly rendered last-act CGI demon, cut and pasted from a Diablo II screen-grab, is so eminently lame as to cure all fear of hellfire."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "Cage supplies energy but no depth in his portrayal of a disillusioned knight. Ditto that for Perlman, who never feels comfortable in the sidekick role so he pretty much goes through the (exaggerated) motions."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "Does to the medieval era what Cage's Wicker Man did to Anthony Shaffer. Hokum and not in a good way."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "Cage appears as a knight of the Crusades, slogging across the continents, slaying infidels and unbelievers and anyone else who gets in his way. There isn't a minute when it looks like he's having fun."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "Season of the Witch teeters on the edge of slipping into the \"so bad it's good\" camp, but ultimately ends up being merely bad."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "A movie that appears to have been shot entirely on leftover sets from \"Monty Python and the Holy Grail.\""
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "As usual, Cage alternates between leaden line readings and thunderous outbursts, making his accomplished costars Ulrich Thomsen and Stephen Campbell Moore look even better."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "The entire film seems to be happening on the other side of a dirty window - good news for the dreadful computer-generated effects, if not for our eyes."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "Season of the Witch is at its worst when it tries to be a straight-ahead action-adventure film. The early sequence set against the epic battles of the Crusades is almost brazenly bad with its unconvincing \"300\"-style special effects."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "Off the top of my head, I'm guessing that Season of the Witch claims a place in the top five all-time bizarre and pointless homages to art cinema."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "Both overblown and undercooked, Season of the Witch is a fine example of a film that would've been great fun if only its creators had a sense of humor about the wild brew of absurdity they had percolating."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "The movie proceeds in near darkness, perhaps to obscure its shoddy special effects, but the pervasive gloom is less discouraging than star Nicolas Cage's indifferent performance."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "The best you can say about this hooey is that at least he had the King of the Bs, Ron Perlman, along for a few sidekick laughs."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "After a while, the movie tires of the witch business and trots out a plot twist that permits the effects department to spend money. Some moviegoers might find the bait-and-switch funny."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "The real plague is the movie, a sci-fi hodgepodge of bad history and worse special effects."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "The film looks dispiritingly cheap and, as if in response, most of his cast seems half-committed at best, as if they're counting the moments until they can move on to a bigger picture."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 20,
      "summary": "At least \"Witch\" offers Perlman's easy, early-hominid charm, and a semi-suspenseful rickety-bridge scene."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 11,
      "summary": "Things do not end well, least of all for the audience."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "summary": "Mr. Cage's knight ends up playing second banana to a digital devil. Welcome to the January dead zone."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "A hearty \"Meh!\" for this film. Look, you KNOW what you're getting into whenever you purchase tickets to a Nicholas Cage film: a high-budget, low-brainpower crapfest. I mean, I'm seriously starting to think that this man picks his scripts by throwing darts at a wall. Anyway, knowing the aforementioned full well before entering the theater, \"Season of the Witch\" wasn't THAT terrible. Maybe they could have shaved off 15 minutes in the middle due to a few boring scenes... But other than that, there's some entertaining, wacky, and explosive fun to be had. And the bad acting is so bad, it's good. Try to notice the completely discordant use of accents (or lack thereof) throughout the movie. For instance, Nick Cage (the most guilty actor of the bunch) has a classical English accent in some scenes, yet no accent whatsoever in others! Brilliant... In conclusion: yeah, it's a bad movie. But you KNEW that walking in the door. So have a sense of humor, and enjoy some butt-kicking crusaders take on the supernatural.",
      "total_reactions": 7,
      "user": "JasonGoalie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Incredibly cliched and incredibly enjoyable. Nic's hair is difficult to get past, as is the appalling script, but it's actually likable, with plenty of attractive locations, a great performance by the female ?witch and a buddy-movie feel between Nic Cage and Ron Perlman. It's undemanding but any film which opens with an old crone of a witch vomiting into a man's face gets my thumbs-up as a good night's mindless entertainment.",
      "total_reactions": 5,
      "user": "aarj"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "If you loved other classic nic cage films as Wicker Man and Ghost Rider then you will love Season of the Witch.. Ron Perlman is awesome as well and honestly if you go to movies to smell your own farts then go watch Black Swan and save some more children.",
      "total_reactions": 9,
      "user": "mwagamer16"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Tituba's \"Barbados songs\" are best left to the imagination, but in Nicholas Hytner's adaptation of Arthur Miller's 1953 play \"The Crucible\", we see the black woman conjuring spells over a cauldron; we also see her disciples, languishing New England schoolgirls, who have gathered in the woods by moonlight for this secret assemblage with the expressed interest of quelling their unrequited passions, once and for all. Into the pot does each girl make her contribution to the love potion, mostly harmless fauna and flora, except for Abigail Williams(Winona Ryder), who brings a live chicken to the estrogen-heightened proceedings. Abigail smashes the bird on a rock, then smears the fowl's blood on her lips. In \"Season of the Witch\", a principled knight who leaves the Crusades(along with his pal Felson, played by Ron Perlman) after ruminating over the morality of killing innocent women and children(it finally hits him: hey, it's wrong!), dreams about his last victim(a woman that he speared in the chest), and in this delirious reenactment, she feasts on the blood gathered around her mouth, just like Abigail. Did the conscientious objector conjure this image on his own, or did the girl in the cage(Claire Foy), the alleged witch, put it there? John Proctor(Daniel Day Lewis) didn't believe in necromancy, and neither does Behman, which is how he allows himself to be manipulated by Anna, who convinces the runaway knight that the priest, Deblezar(Stephen Campbell), is the enemy. In this world, fourteenth century England, the church's hysteria, concerning the devil and the threat he poses to the inhabitants of the material realm, is warranted, because unlike the Massachusetts of 1692, magic exists; witches walk among the English people, many of them, victimized by the Black Plague. \"Season of the Witch\", as a result of having studied \"The Crucible\", plays topsy-turvy with the two camps: the accused(the women, the supposed witches) and the accusers(the church), when the film defies expectations when one of the sentenced women(in the film's opening scene), a confessor(unlike the Miller play, divulging one's guilt doesn't result in an automatic reprieve), turns into a demon after she is dragged out of the icy cold river water, the surprising aftermath of a public execution. It wasn't a senseless killing, after all. Whereas the prologue in the Hytner film(written by Miller himself) suggests the possibility, however slight, that the devil did reside in Salem, which to a certain degree, justifies the micro-proselytizing of the theocratic officials, the church in this \"Lord of the Rings\"-meets-\"The Exorcist\" mash-up is seen as totally in their right to round-up potential occultists for their kangaroo court. The witch hunt, with its allusions to McCarthyism, makes \"Season of the Witch\" a sort of apologist film for the red scare tactics plied by the U.S. senator on many Hollywood professionals in the nineteen-fifties, since the woman in the opening scene, and Anna, indeed do have something to hide. The church, so often portrayed as a patriarchal construct whose sole purpose is to keep robed men in power, in this otherwise forgettable and routine film, is seen as a heroic institution, vital even, since superstition(the root cause of all that goes wrong in John Proctor's world), in this cinematic domain, becomes almost indistinguishable from empirical observation. The devil isn't a psychological entity, something conjured up in the mind's eye of Abigail Williams, but rather, it's a physiological one, as seen in the monastery, home to the Key of Solomon(a book of incantations that contains a spell to break the plague), when the devil breaks loose from the girl's body.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Nicholas Cage and Ron Pearlman are not half bad in their roles,even though this creepy movie has not much interesting and all we could we see is a complete dull story with cheap visual effects.",
      "total_reactions": 0,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "My opinion is that this movie has been wrongly rated; The acting is alright, the story line is fairly interesting and the graphics were pretty good. It is a reasonable effort for Nicholas Cage and a fairly good job for Ron Perlman, they are the only reason that the movie was moderately enjoyable;  the other actors did a fairly satisfactory job. I enjoyed watching it and I recommend this to anybody who likes either Nicholas Cage or Ron Perlman and probably people who like the knight and armor/ dragon slaying kind of movies, its up to you if its worth to buy, but it is definitely worth renting it.",
      "total_reactions": 0,
      "user": "Teh_Pwnerer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "If the Saturday morning pictures I remember going to as a child had allowed 15 rated movies to be shown this would have been one of them. It's 3:10 to Yuma set in medieval times, with some supernatural stuff thrown in. There's enough action to keep you interested to the end. An old style movie with decent effects and good actors. Claire Foy is particularly good, as is Ron Perlman. My advice is to watch, enjoy and forget. 8/10.",
      "total_reactions": 0,
      "user": "WTCC_Grunty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Acting isn't all that great, an okay movie but, besides some eye-popping action scenes. There isn't nothing too special about this. Just an action movie with a few good spots. Worth a check once.",
      "total_reactions": 0,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "nick cage and Ron Perlman are a great combination. lots of action in the begining, then the mystery of the witch. is she a witch? is she good or evil? great movie with a sad ending.",
      "total_reactions": 0,
      "user": "evilhomer12345"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Solid movie. To be fair the script was a little weak at times. With a little more effort this could have been a total gem, but a good movie both ways.",
      "total_reactions": 0,
      "user": "Amp191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "A little rough around the edges do to some bad writing and far from greatness, but it's still enjoyable, the acting is actually really good, its got humor, action, and a little bit of mystery in the beginning, it's not going to be the most popular movie out there, and it's only going to be liked by a specific audience, but if your looking for a good movie for a rental this is a good choice.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "This movie is horrible, but in a good way. Nicolas Cage is in it. That alone makes it a movie worth watching. The acting is horrible (also NC) and the movie looks rushed. Watch it anyways.",
      "total_reactions": 0,
      "user": "Antlia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Lets get the story straight. I really hate Nicholas Cage. He's let all his fame go to his head and he thinks anything he makes is pure gold when in reality most of it is crap. That being said, I went into this movie with zero expectations. That being said, it wasn't horrible. It kept me entertained. The acting as a whole is decent, nothing special from anyone. The special effects are surprisingly good, the ending fight was very cool to watch. That being said, there are glaring holes in this movie. For instance, some of the acting is just horrible(the supporting characters were just really, really bad. Also, during many parts in this movie, they are just talking, which I'm fine with, but there isn't a point to anything they're saying! If they actually had a point to what they were doing, it would be OK, but they don't. One more thing that was extremely stupid was if what happened was supposed to happen, then this whole journey they take could have been avoided. Overall, Season of the Witch is a movie I probably wont ever see again, but for a one time, popcorn flick its worth a shot I suppose.",
      "total_reactions": 0,
      "user": "sh831994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Okay i have seen plently of either bad or just medicroe movies lately but this has to been one of the worst movies i have seen in the last few months. I mean where do i begin it is poorly paced, badly directed, badly acted (What happend to Nicloas Cage), laughably written, only a few decent action scenes it's just a bad movie and not much fun of all. Nicolas Cage should either stop doing movies or fire is acting because i mean he's amazingly talented like in movies like Leaving Las Vegas, Con Air, The Rock, Adoption and even the National Treasure movies (which i think are actully pretty good chessy but really good). But he has made some really bad movies latley i mean The Sorcerer's Apprentince and Knowing was okay haven't seen Kick-Ass yet but Next, The Wicker Man, Bangkok Dangeours and now this are all terrible. Sorry i just had to put out my hatred for this movie really a waste of money.",
      "total_reactions": 0,
      "user": "Goyankees"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This film I saw at the People's Choice Awards 2011 Watched it & fell head over heeles in love with it. Bring on Season Of The Witch 2 I liken this film to the TV series Merlin",
      "total_reactions": 0,
      "user": "LillyanneS1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I am never one to go by other's opinions, so even when my Husband pointed out that this movie ha horrific reviews, I love movies about witches, the supernatural, and anything related to such, so I decided to let myself be the judge an went to see it anyway. I thought it was great. I think that there are certain people that will like it and certain people that go in just looking to tear it apart. In one comment that I read, a critic stated that Nicholas Cage transitioned back an forth between his own voice and an English accent, but I never heard this happen once. Most of the people who criticized the movie boldly stated from the get go that they hated Nicholas Cage. My question is, \"Why Go?\" If you want to see a neat story about witch slaying and demons, go, but if you don't like Nicholas Cage, don't bother, you will be picking it apart from the start, so why waste your money? It was a neat story with a good cast. I think it deserves a much better review than what it has been receiving",
      "total_reactions": 0,
      "user": "ChelleC1026"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Such a great plot SotW had, but the choice of cast brought doom upon the film. Nic Cage and Ron Perlman are great but they look and sound out of place as they were in 20th century mode when they should've been in",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "Is Nick Cage still acting? Who's giving him these gigs? Oh well. The film was entertaining enough so long as you have plenty of popcorn and pepsi. The young girl who plays the proposed witch is quite intriguing. But I would not choose this movie over most other films at the theater.",
      "total_reactions": 0,
      "user": "theycallhimdrj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "What should i say about this, i was excepting this films to be at least as good as The Sorcerer's Apprentice, which it self was not a good film at all, but this goes worse than that. I can not imagine Nic in its new  hair cut style :)  I went into the movie with hope. The trailer looked promising and I believed that the movie was very well cast, but I realized its not. For a story that should have been treated with a bit more of a linear perspective of Alexander's youth to his death (and everything in between), it hopped around like a suicidal jackrabbit. Changing position without warning and begging for something to quickly put it out of it's misery.",
      "total_reactions": 0,
      "user": "g3rt1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Its one of those Nic Cage movies that shows Nic Cage is really having a fun time, the best way i could find to describe it is it's a \"Kingdom of Heaven\" meets \"Resident Evil\" and they did a good job really pulling that kind of story off. i did make the mistake of seeing \"Black Death\" before but it really does show that kind of time line.",
      "total_reactions": 0,
      "user": "Uncle_Darais"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Perlman role could have been beefed up a bit more, but thankfully Cage kept his mooney-ness subdued. Nice atmospheric setting but the ending was overdone. But overall quite enjoyable.",
      "total_reactions": 0,
      "user": "Kipnosky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "This wasn't as bad as I had expected. I didn't expect much, and proceeding with that disposition, I enjoyed the witchcraft, demonic possessions, and flashy special effects. The \"witch\" was an interesting character and this film does well in confusing the audience sentiment towards her. Cage occasionally sounded like he was trying to pull off some kind of English accent at times, and it was not attractive. However, as always, Cage does try hard in every role he attempts, and I found a bit of enjoyment throughout this film. What was with the never-ending, relentless, unapologetic multi-battle opening sequence all about? I'm glad I watched it at home however.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Its pretty close to impossible to like this film. Of course i respect all reviews but this film was not the best way to start a new year of trips to the movies. It was overly cliched and dull. And the acting was terrible except for Ron Perlman who in my opinion was the only entertainment i got out of this film",
      "total_reactions": 0,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Even though many people consider this a very bad movie, I would very much disagree. Not a summer blockbuster or anything like that, but still a film worth seeing. Nicolas Cage, and his not very admired choices of movies, played a very strong role, as a protector, a crusader, and I might add he did a fairly good job, even though he can do a lot better. As an example \"Face to Face\". In general it's a history type movie showing the crusades, combined with magic and death, this is the very short version. See it, and you'll find out that if you enjoy films having the characteristics mentioned earlier you will be impressed, at least in two or three action phases. Not incredible special effects, but well and off a movie which will probably be forgotten sooner than you can say. Underestimated from every aspect, but as a conclusion not that bad. Not much more to say, see it, rate it, and move on.",
      "total_reactions": 0,
      "user": "BeK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "A Typical Nicholas Cage movie.  All throughout the movie, you are slightly confused until you witness the mediocre graphics of lucifer (who speaks perfect english, by the way).  Although I found the movie slightly bias against the Catholic Church (an understatement really), the message was good.  And that only message is this: Decide on a different movie.",
      "total_reactions": 0,
      "user": "mbrownd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Before Reviewing I am saying that Nico Cage is my favorite actor !",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "i really enjoyed the start to this film. and then came the oh so hate-able nic cage, the movie was  so dull, cheap looking and it just dissapointed  overall",
      "total_reactions": 0,
      "user": "ajh0795"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "I don't really find the film as much low budget as everybody is saying. The acting is not as convincing as it could have been. The story has some flashy moments. It is somewhat worth watching.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "They picked a good location I'll give it that but that won't help that much considering how bad this movie really was. I would call it a supernatural thriller that is not that thrilling. It looks cheaply made, you can tell by how Nicolas Cage is speaking, he always seems to be shouting. I'll put it this way; costumes production and design are good. Editing and visual effects are definitely not. The cinematography was crude with the film being dark, dusty and foggy in almost every scene. The dialogue wasn't bad but the fact that it changes from Let's drink to Kill her doesn't really make it well played out. It has a B movie aesthetic to it. The film was pieced together terribly with bad cliche's. They put the genre of the movie in between horror and historical thriller, a mix that doesn't go together really well. They made the movie too long by putting unneeded dialogue and bad special effects that delay the overall story line. Cut out all that and it might just catch somebodies eye without them leaving the movie theatre with a frown on their face.",
      "total_reactions": 0,
      "user": "JoshCampbell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Plot seemed interesting at first, but there is as just as much as historical accuracy in the dialogue during the scenes inside fighting The Crusades as in a bad Titanic flick. The visuals were little above par and the acting (admittedly) wasn't bad. Hell, this could have been a \"so bad it's good\" pass-over.  The only thing that  felt forced was the character introductions, and the pacing was moving along so quickly. The part where the new comer alter boy joins the quest, was so cliched. Just fight with blandly arranged choreography and go. Anyway the ending was flat-out horribly cheesy, I don't seem to take the main antagonistic demon to be taken seriously. Overall it wasn't bad, but it could have gotten worse....",
      "total_reactions": 0,
      "user": "giraffeluver88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Two crusading knights receive the task of transporting a suspected witch through treacherous terrain so that she may stand trial before the church after being accused of causing the Black Plague in SEASON OF THE WITCH. The premise seems thrilling enough, but SEASON OF THE WITCH is sabotaged by its incompetent special effects and unworthy cast. The period setting which director Dominic Sena tries to convey is drowned out by poorly computerized environments that generate a sense of artifice on screen. What makes matters worse are the laughable performances by Nicholas Cage and Ron Perlman, who can't be bothered with simple things like diction or accent when it comes to creating a convincing 14th-century character. Sena doesn't allow for much suspense when we are quickly given glimpses into the witch's powers, leaving behind a long and perilous viewing experience instead. For a superior take on the same theme, be sure to check out Christopher Smith's BLACK DEATH from 2010.",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Boring and predictable is all I have to say regarding the story. I was expecting way more out of the cast then this snore. I can't even say anything else, it was just that bad.",
      "total_reactions": 0,
      "user": "tterch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "This film is so dopey and is just boring.  What is Nick Cage and Ron Pearlman doing here?  They should have fired their agents as soon as they got the script.  F",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Somewhere in medieval Europe, three women are sentenced to death as penalty for witchcraft, then hanged and drowned for their crimes. All our preconceptions about the brutality and futility of the classic witch trial are brought to the forefront, as the youngest begs for mercy.",
      "total_reactions": 0,
      "user": "Jack_Sunshine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "The movie may not be the best but still better than many",
      "total_reactions": 0,
      "user": "ba01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "This was a great watch, very entertaining, good cast as well. Glad I watched this. Added to my faves and to my playlist.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Don't be fooled by the star power.  This is a simple horror puzzler and a good one.  It's about how you are feeling about the witch and what would you do in their shoes.  It's a quest/journey story too... So, not a Hollywood blockbuster at all, but a low key twisty indie horror road trip with tension and some complexity that worked for me.  I don't usually like supernatural movies, but this one felt genuine to me.  I feel like this was marketed to blockbuster or dragon-slayer audiences, and it isn't that.  It is more about the mixed feelings you have about the witch.  I thought it did a better job than the much better rated \"Witch\" 2016 at that.",
      "total_reactions": 0,
      "user": "johnbingham"
    }
  ],
  "metascore": 28,
  "name": "Season of the Witch",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 7,
    "month": 1,
    "year": 2011
  },
  "opening_weekend_income": 559769,
  "opening_weekend_income_currency": "£",
  "rating": 5.4,
  "rating_count": 78403,
  "rating_freq": {
    "1": 3184,
    "10": 3800,
    "2": 3003,
    "3": 5430,
    "4": 9484,
    "5": 16391,
    "6": 18662,
    "7": 11598,
    "8": 5022,
    "9": 1829
  },
  "release_day": 7,
  "release_month": "January",
  "release_year": 2011,
  "user_review_count": 216,
  "votes_per_demo": {
    "aged_18-29": 29038,
    "aged_30-44": 33060,
    "aged_45+": 6984,
    "aged_under_18": 101,
    "females": 10891,
    "females_aged_18-29": 5293,
    "females_aged_30-44": 4309,
    "females_aged_45+": 937,
    "females_under_18": 21,
    "imdb_staff": 6,
    "imdb_users": 78403,
    "males": 59321,
    "males_aged_18-29": 23499,
    "males_aged_30-44": 28370,
    "males_aged_45+": 5947,
    "males_under_18": 79,
    "non-us_users": 47793,
    "top_1000_voters": 459,
    "us_users": 9888
  },
  "year": 2011
}