{
  "avg_rating_per_demo": {
    "aged_18-29": 4.1,
    "aged_30-44": 3.9,
    "aged_45+": 4.1,
    "aged_under_18": 4.7,
    "females": 4.2,
    "females_aged_18-29": 4.4,
    "females_aged_30-44": 4.0,
    "females_aged_45+": 4.5,
    "females_under_18": 4.1,
    "imdb_staff": 5.0,
    "imdb_users": 4.0,
    "males": 3.9,
    "males_aged_18-29": 4.0,
    "males_aged_30-44": 3.9,
    "males_aged_45+": 4.1,
    "males_under_18": 4.9,
    "non-us_users": 3.9,
    "top_1000_voters": 3.9,
    "us_users": 4.2
  },
  "avg_screens": 768.0833333333334,
  "budget": 25000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 11,
    "month": 11,
    "year": 2011
  },
  "critic_review_count": 229,
  "duration": 90,
  "genres": [
    "horror",
    "thriller"
  ],
  "gross_income": 18860403,
  "max_screens": 2848,
  "mc_avg_user_score": 4.4,
  "mc_metascore": 22,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Shark Night 3D",
  "mc_negative_rating_frequency": 31,
  "mc_positive_rating_frequency": 15,
  "mc_pro_critic_reviews": [
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 65,
      "summary": "Shark Night isn't fantastic, but it's a good enough time, and it'll never be better than when it's watched with a rowdy crowd in a theater."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "It's refreshing to see Shark Night 3D director David R. Ellis try to pull off a semi-sincere second-generation \"Jaws\" rip-off, even if he doesn't quite succeed."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Aspires to nothing more or less than carrying along an audience through a string of unremarkable kills, often involving high-jumping fish."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "The result is a movie that isn't crummy, exactly, just blah: when the freakiest teeth on screen belong not to one of Walt Conti's animatronically realized sharks but to a good-ol'-boy called Red, you know you have a problem."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "The equivalent of a skin flick in which all the sex scenes are tastefully obscured by blankets and sheets."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "Stay past the credits, though, and you'll find a tongue-in-cheek rap video recap with the cast - and directed by star Dustin Milligan - that carries the kind of spoofy insouciance missing from the main attraction."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "The PG-13 film is heavy on scenes of cloudy blood in the water but almost entirely lacking shock shots of flesh torn asunder. (And while marketing relies heavily on bikinis, the movie's light on that kind of flesh as well.)"
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "Unlike his \"Snakes on a Plane,\" director David R. Ellis' sharks-in-a-lake thriller displays little sense of its scenario's camp potential. Gore, too, is in short supply on account of the pic's PG-13 rating, which renders the attack scenes nearly toothless."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Heartlessness, stupidity, cynicism, and greed are a demoralizing combination for movie-going. We pay to see a movie that doesn't respect us for being there at all."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "A ho-hum series of kills and lulls so predictable that it doesn't even look like much fun for the sharks; when they open wide, they might as well be yawning."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "The worst movie of the summer, arriving on the last weekend of the summer."
    },
    {
      "critic": "Nick Schager",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "A thoroughly shabby attempt to piggyback on the success of last year's \"Piranha 3D,\" Shark Night 3D embraces convention with a voraciousness matched only by its predictability, amateurishness and all-around tameness."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "The one crime a B-movie should never commit is boring its audience. By even these low standards, Shark Night 3D is dead in the water."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 11,
      "summary": "About as humorless – and joyless – as they come."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "summary": "Shark Night 3D barely bothered to show up, let alone deliver the minimal goods."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "Alright first off, all of you people who expected to see an academy award nominated film or a top notch horror film when going to see this, well you are dumb. This movie was meant to be stupid fun. It was meant to make you laugh and it was meant for you to jump back in your seat and go \"ohhhh snap!\" and nothing else. Its a cheesy B-movie. Thats what it was meant to be and ive always loved watching the cheesy scifi channel movies so ive grown to enjoy these movies and they are just pure fun, especially in 3D. This movie was just plain dumb fun and if you don't enjoy movies like that then don't see it because you will hate it, but me on the other hand, i loved it, not as fun as last years Piranha in 3D but still fun, 6/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "As i watched this movie I liked it until i got to the end and Spoilers!!!!!!!!!! got to the end it ended just like Piranha 3D,but this movie had a lot of good qualities it didn't have over large sharks that was completely fake it didn't have horrible actors, it had a great story line and producer.",
      "total_reactions": 1,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "This movie was just ok. It should have had more death in it  But we can't always have what we want. Jaws will always be the best shark movie. The only thing that could be better than Jaws. Is if the shark grows arms and legs. Gets a chainsaw, and starts killing everybody on land and in the water. Hellyeah that would be great.",
      "total_reactions": 1,
      "user": "Stonecutter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Typical shark eats teen movie with a modern twist. If you are going to watch this movie, then you already know that the bar is set low. If you have no expectations, then it will be a fun ride. We all know how it will end!",
      "total_reactions": 4,
      "user": "dapper_dan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "Skip-it - This is not Pirahna 3D! This truly is \"a dumb shark movie.\" This is a neutered PG-13 \"horror\" film with no gore and zero nudity - in other words, one of the worst films of the year.",
      "total_reactions": 4,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "Are you people serious, this movie is so stupid, I knew it would be bad, but not that bad, like those actors are 0 to me, like go take some acting classes please, and that director should stop trying to make movies. It was a 2, and because the dog survived, kidding. It was just awful to see. And that Shark common you could have done a better job with that. Screenplay was same old same old, bla bla bla teenagers go into a lake house, and there's a bunch of sharks in the lake and they get kill one by one, until one of them kills the shark (oh but this time they had to worry about two freaks). It was stupid.",
      "total_reactions": 2,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "\"Shark Night\", in short, is a vapid, cheap, moronic slop of a movie. The villains are amazingly stupid and mean-spirited, with motivations that wouldn't make sense to a rock. The story is crap. The characters are beyond forgettable. And the sharks, in a movie that is supposed to be focusing on them, feel less like the center of this thoughtless fart and more like minimalist gimmicks slipped in at the last minute.",
      "total_reactions": 2,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This film was marketed like it was a follow-up to \"Piranha 3-D\" which was a campy, gory, fun-fest with no pretense to being anything other than a B-Movie. That film worked very hard to be the best B-movie it could be and deliver in spades upon all of the viewer's expectations.  This tedious little poop-fest didn't even try. You only have a handful of characters to kill off and a couple of the deaths have no build up, no tension, no suspense, it's just \"There he is. Oh look a shark jumps up and gets him -- now back to the 'A' story.\" This film is just a cynical grab for summer dollars. If you aren't even willing to make a dumb, but mildly entertaining film, why are you in this business at all? The answer is money. The only film worse than this for 2011 is \"His Highness\" and that's saying something because that film may be the worst major theatrical release I've seen in my entire life.",
      "total_reactions": 3,
      "user": "crankyerma"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "This film was shockingly bad and the worst film I have ever experienced. I can't believe someone would even put their name on this film, in fear of complete embarrassment. The storyline was weak and pathetic - Avoid and save your money!",
      "total_reactions": 3,
      "user": "dalec"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "There is nothing new but Shark Night 3D is very entertaining.",
      "total_reactions": 4,
      "user": "Nick5414"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I was very encouraged to find this site. I wanted to thank you for this special read. I definitely savored every little bit of  it. Seo New York  (NYC)",
      "total_reactions": 4,
      "user": "zoesmith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "This is what you call a film?! Nothing but the blood-thirsty, animated big ocean fishes in a lake? I wasted my time around, so just warning people to save your money to do something more serious than just see this bloody mess.",
      "total_reactions": 1,
      "user": "lionalio"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "Yeah, okay, so there are an unbelievable number of different species of shark in this film, most of the popular ones and a few of the less popular, but I could still find some enjoyment in this film. As expected, the acting is fair to weak, the story is ridiculous, and the effects could be better. The 3D was okay, though this film in HD is impressive. The film tries too hard to be something that it is not. At least Piranha 3D went all out with the gore, nudity, and an all-star cast. Yet, I still found this one slightly enjoyable for a nice 90 minute distraction.",
      "total_reactions": 1,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "Shark Night 3D, for what it is, makes for fun and really dumb viewing. However the film is tonally confused, which ultimately makes for a film that is not sure what it wants to be: a Jaws clone or a Piranha 3D clone.",
      "total_reactions": 0,
      "user": "BrandonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "It shouldn't come as much of a surprise that Shark Night 3D is awful. Its theatrical release is due entirely to the success of Piranha 3D, but it lacks Piranha's bite; sure, that movie was a nasty, semi-soft-core misogynist piece of trash, but at least it delivered on its promise of decidedly R-rated nudity and gore. Shark Night offers neither, instead throwing in an even more preposterous plot, even blander actors playing duller characters, and teases where Piranha came through. There's also overuse of MTV-style editing to let viewers know the characters are having fun, because anyone watching certainly won't be enjoying themselves. Put David R. Ellis at the helm and what you've got is a recipe for disaster. The ineptitude is clear from the opening sequence, which rips off of the opening sequence in Jaws. The attack is unclear and fairly unconvincing; where the effect of pulling someone through the water to simulate a shark attack was new in '75, here it feels obviously dated and, well, boring. The subsequent attacks are similarly handled, with characters simply being dragged underwater and no clear details, though some sequences feature horrible special effects and laughably unrealistic shark behavior. The plot comes second to the shark attacks, yet takes up most of the film's running time. College students venture to a lake house for Spring Break, only to find the waters fairly shark-infested. Might this have anything to do with the creepy, foreboding locals? Too much time is spent getting from one place to another, especially when a thinking audience can figure that most escape attempts won't play in favor of the college-aged shark bait. The 3D is hardly used, and when it is, the effect is hampered by the inability to properly frame the action. In the end, Shark Night 3D is a waste of your time and money. If you're really in the mood for a shark flick, you're much better off waiting for SyFy to have a Terror-in-the-Water weekend.",
      "total_reactions": 0,
      "user": "Myffubs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "At first I was like , yeah its going okay ! but as soon as the shark started to doing its think soon the movie went to hell & I mean Deep bloody hell . The movie had the two hostess girl Sara Paxton & Katharine McPhee but didn't help coz of a bad script . Piranha 3D was an awesome movie , it could be too but it was one of the worst shark movie ever ! Writing , Directing , Acting was so bad . Only the shooting location was really awesome but this did help coz without this amazing view I couldn't see the whole movie .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "I was actually a fan of Pirannha 3D, so I thought this would be similarly fun while being stupid.  Unfortunately, it was all stupid and no fun.  Can't believe they made it PG-13, such a cynical ploy that took away any of the gore/nudity that might have helped.",
      "total_reactions": 0,
      "user": "Dave2008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "Shark Night 3D, for what it is, makes for fun and really dumb viewing. However the film is tonally confused, which ultimately makes for a film that is not sure what it wants to be: a Jaws clone or a Piranha 3D clone.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "One of the worst movies you'll ever see. The plot was incredibly stupid, the abilities of the sharks were ridiculous, and the characters and development was pathetically cliche. The only reason I gave this a 2/10 instead of a 1 is that the acting wasn't all that bad and because Sara Paxton and Katharine McPhee are super hot. Don't bother wasting 90 minutes of your time on this piece of crap.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "A weekend escape turns deadly for a group of college students when they encounter a group of man-eating sharks in the waters surrounding their remote island getaway! Make no mistake about it, the PG-13 rating for SHARK NIGHT clearly designates both the intended audience and the level of intelligence behind the script. Every attempt to make this movie \"hip\" for the younger generations instead comes off as being trite and cliche, and every move the characters make is utterly predictable... That is, up until the ridiculous final act. Technology has apparently devolved once again, considering that the computerized sharks in SHARK NIGHT look worse than those created 13 years ago in DEEP BLUE SEA. It is also sad to think that a film like this could ever have made it in to theaters, when the quality of the overall production falls behind many of the awful made-for-TV movies that drown the SyFy channel yearly. At least with the 2010 PIRANHA remake, Alexandre Aja knew enough to play up the high camp in the picture, and delivered an abusive amount of gore. There is no fun to be had anywhere in SHARK NIGHT, and it is nearly bloodless. Do not waste your time on this pathetic film. -Carl Manes",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "A bad movie .. but the idea and encourages you entertainment.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "I couldn't help but grin when when the shark jumped twenty feet into the air out of the water, snatching a boy from a tree and swimming into the lake's depths to consume him.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "Coloquei “play” neste filme já sabendo que não ia ser grande coisa. Geralmente, os filmes com esse tema, de uns anos pra cá são praticamente a mesma coisa. Não sei o que as pessoas esperam, aliás, de produtos assim...",
      "total_reactions": 0,
      "user": "felipescavo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "The thing that stinks most is that it had so much potential to be good. It's not that it wasn't entertaining, it's just that every other problem was wrong with it. The acting wasn't very believable, the special effects were mediocre, it has almost zero originality, and how unrealistic it is. I mean seriously. 5 seconds after someone gets into the water they get eaten by a shark. Like that would happen.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I am shocked at all the bad reviews from users. I mean if you go into the theater and expect to see and academy winning horror flick then you have lost your mind most people do that with every horror movie. The Cabin in the Woods, Sinister, maybe about 5 more, would be the only horror film to actually win almost every horror film is either to shock you or make you laugh or scared. I watched it and enjoyed it. Its a teen shark horror flick just watch with no real expectations. My advice is watch it for the ride it's not really a deep ploted film. Just something for the teens to watch.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This movie works better as a thriller movie than a horror movie. The storyline is interesting as it is filled with suspense. However, this movie offers too little scares and doesn't make you feel disturbed at all. Like most horror movies, it has a bad ending which I hate to see.",
      "total_reactions": 0,
      "user": "supermann234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "What did you expect? Jaws is the only good shark movie ever.... period. Other shark movies that try to be a good shark movie fails and instead being so insanely bad they want your money so you can easily feel ashamed of watching this.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ],
  "metascore": 22,
  "name": "Shark Night 3D",
  "num_weekends": 12,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 2,
    "month": 9,
    "year": 2011
  },
  "opening_weekend_income": 8404260,
  "opening_weekend_income_currency": "$",
  "rating": 4.0,
  "rating_count": 21303,
  "rating_freq": {
    "1": 2683,
    "10": 1153,
    "2": 2568,
    "3": 3315,
    "4": 3803,
    "5": 3500,
    "6": 2249,
    "7": 1182,
    "8": 580,
    "9": 270
  },
  "release_day": 2,
  "release_month": "September",
  "release_year": 2011,
  "user_review_count": 132,
  "votes_per_demo": {
    "aged_18-29": 7878,
    "aged_30-44": 8951,
    "aged_45+": 1905,
    "aged_under_18": 44,
    "females": 3073,
    "females_aged_18-29": 1660,
    "females_aged_30-44": 1090,
    "females_aged_45+": 213,
    "females_under_18": 10,
    "imdb_staff": 3,
    "imdb_users": 21303,
    "males": 16094,
    "males_aged_18-29": 6149,
    "males_aged_30-44": 7760,
    "males_aged_45+": 1654,
    "males_under_18": 32,
    "non-us_users": 11433,
    "top_1000_voters": 293,
    "us_users": 4294
  },
  "year": 2011
}