{
  "avg_rating_per_demo": {
    "aged_18-29": 6.9,
    "aged_30-44": 6.6,
    "aged_45+": 6.6,
    "aged_under_18": 7.3,
    "females": 6.8,
    "females_aged_18-29": 6.8,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.8,
    "females_under_18": 7.4,
    "imdb_staff": 7.3,
    "imdb_users": 6.8,
    "males": 6.8,
    "males_aged_18-29": 6.9,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.6,
    "males_under_18": 7.2,
    "non-us_users": 6.7,
    "top_1000_voters": 6.1,
    "us_users": 6.8
  },
  "avg_screens": 1225.4,
  "budget": 3000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 28,
    "month": 12,
    "year": 2012
  },
  "critic_review_count": 416,
  "duration": 110,
  "genres": [
    "horror",
    "mystery"
  ],
  "gross_income": 48056940,
  "max_screens": 2542,
  "mc_avg_user_score": 7.3,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 80,
  "mc_movie_name": "Sinister",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 241,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "It's all done in questionable taste, mucking around in the nasty terrain of snuff films and children in constant peril, but Sinister is smart and well-crafted, and it scarcely gives the audience a moment to breathe."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Rather than another drearily workaday horror picture, Sinister uses the supernatural to underline its examination of the all-too-human foibles of insecurity and myopic self-centeredness. As the best horror stories so often do, Sinister makes clear that we are our own boogeymen, the worst monsters of all."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Hawke's taut performance - lightly parodying his own career doldrums while playing an egotistical hack who's a close cousin of John Cassavetes's self-loathing actor in Rosemary's Baby - is totally credible."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "The scares are not just intense but unyielding in this compelling horror yarn from \"The Exorcism of Emily Rose\" director Scott Derrickson."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "It comes together with a gruesome though excellent ending that some will find difficult to shake."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Even though the ending is inescapable (and therefore predictable), that does little to diminish its effectiveness."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "And then there is Vincent D'Onofrio, as a university professor of the occult and mythological, who opens up a line of possibility that eventually saves the ending from being a red herring. Yes, the ending is horrifying, but I don't believe in that stuff. I'm pretty sure I don't."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "I knew perfectly well, after a while, what Sinister was going to scare me with. But I got scared anyway."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "The movie makes up for uneven dialogue and pacing issues through sheer horrific imagery."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "Occasionally stupid (stretching even fright-flick conventions) but scary nonetheless, the picture should please horror fans."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "The clichés are still clichés. They've just been renovated."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Sinister has so much going for it - adult psychology, a great bitchfest of a marital meltdown - that you wince when it finally makes some rather dull choices involving the supernatural."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "Derrickson bounces back from his insipid redo of \"The Day The Earth Stood Still\" with an effective chiller that's got a skeleton or two in its closet."
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "An enjoyable, if boilerplate, boo-flick that maintains an enviable rate of scares per minute by throwing everything – demons, ghosts, snakes, loud noises – at the screen."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Here's the thing: Found footage is scary when - because - it leaves you to fill in a lot of the blanks yourself. But actually watching whole families have terrible things done to them - well, hard-core horror fans may dig it, I guess. I'd call it forced voyeurism of the worst sort."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "A mixed bag of old-school and contemporary horror tricks that occasionally raises a hair prickle of intrigue."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Despite the hype, this horror story can't shake its run-of-the-mill storytelling."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The film's sound design is also expertly wrought with a blend of nearly subliminal noises, bumps in the night, and other frights."
    },
    {
      "critic": "Nick McCarthy",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Ellison's fascination with celluloid to solve a crime recalls Antonioni's \"Blowup,\" but Scott Derrickson is unable to conjure an aura that isn't as transparent and weightless as a ghost."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 42,
      "summary": "Sinister is basically a collection of bogus snuff films linked by standard haunted house tricks - everything creaking and slamming, with the power conveniently shut off."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Pros and cons aside, Sinister has the benefit of arriving in the thick of Halloween season, right when movie-goers are most hungry for a few scares. And they'll get them from Derrickson's film, too."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "A twitchy Mr. Hawke builds a persuasive portrait of desperation with little help from the script and despite playing a character who makes so many mistakes he might as well be on a suicide mission."
    },
    {
      "critic": "Miriam Bale",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Ridiculous, and never scary, and with the worst ghost makeup in the history of the horror genre, Sinister is enjoyable, even funny at times. Most amusing might be watching Hawke play a character willing to do anything to regain his fame."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The movie is full of feints, shocks and scenes of particularly perverse violence, but nothing about it is fresh enough to haunt you in the night. It's predictable."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Throughout Sinister, the rooms remain darker than crypts, whether at breakfast or dinnertime, and the sound design causes everything in the house to moan and groan in consort with the hero's worrisome quest. I still can't decide what creaks the most: the floors, the doors, the walls, the dialogue, the acting, or the fatal boughs outside."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The snuff-porn aesthetic might suggest a realist drama, but a supernatural dimension is brought into play, making the plot directionless. There isn't an ounce of ingenuity in the way the movie is concluded, but some generic expertise in the way it is put together."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "The hero of Sinister is almost unaccountably dumb. So, unfortunately, is the movie."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "Sinister did something I thought would be impossible: It made this lifelong horror freak abhor horror movies."
    },
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "Sinister is pretty much everything to hate about modern horror in one mixed bag, a ramshackle teardown of jump-scares and creaky tricks, saw-it-coming \"surprises\" and the lead-footed thud of inevitability as it tediously places one clumsy foot in front of the other, plodding towards a finale that comes far too late."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Though its previews give Sinister the appearance of a by-the-numbers fright flick, or perhaps some crummy J-horror ripoff, the end results are different, and decidedly better. Ethan Hawke stars as Ellison Oswalt, a true-crime novelist who moves his family into a home which doubles as the site of several ghastly murders. Tellingly he plans to write about them without telling his wife (Rylance) or children (D'Addario, Foley). Ellison uncovers reels documenting the crime along with footage of other killings. Upon viewing the murders, he sees a common thread, which then begins to weave itself into his family's life. Rounding out the cast are a disapproving local sheriff (Thompson), his eager-to-please deputy (Ransone), and a college professor (D'Onofrio) only present via webcam. Sinister works on a small scale, but uses this to its advantage; its few characters and fewer locations provide a more claustrophobic feel to draw the audience in and aid the story's horror. Writer/director Scott Derrickson and fellow writer C. Robert Cargill occasionally allow the film and plot to resemble other genre standards (namely The Exorcist, Poltergeist, The Ring, and The Shining) but refrain from hackneying or reproducing the works that inspired them. Though some moments dip into silliness and others into stupidity, Sinister reveals itself as a surprisingly satisfying experience. Its scares do scare and its horror does horrify. Those hoping for a gore fest are advised to sit this one out. Those who want to be frightened while being entertained would do well to see Sinister.",
      "total_reactions": 2,
      "user": "Myffubs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Ah, the creators of Paranormal Activity and Insidious bring us this well strapped together, macabre film we know as \"Sinister.\" Now, as this film starts off we see that the family we are spectating, are moving into a new house, the father, Ellison (Ethan Hawke) Is looking to write a book based off of the dark and eerie murders that took place in just the back yard of their residence. He then finds boxes with an old film projector and Super 8 tapes. Inside these very tapes lie the twisted deaths that the previous families living in these homes met. I will start off by saying this is an exceptionally written and acted film, I felt the characters were very believable and realistic. The scares weren't cheap at all, very real and clever. The soundtrack also worked very well, as their mellow tones met well with the overall theme of the film. The only complaint I have to make about this film is how the main villain/demon Baghuul, kept sticking his face directly in the camera. I found that to be a nuisance. Overall, Sinister is a chilling, creepy 8.5/10.",
      "total_reactions": 2,
      "user": "GirGir777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Sinister brings an interesting idea to the horror genre, but sadly, it fails to fully flesh it out. Slowly it begins to fall into horror cliches, and what is in my opinion a very lackluster ending. Taking this aside, yes at times Sinister can be disturbing, even if the trailer shows all the scares we still jump out our skin, and as the main character begins to figure out whats going on, it gets you hooked. The tape sequences are also very interesting and will have you thinking about for weeks. But, overall, the film just simply fails to bring anything new to the genre, with scares predictable, and to many cliches to count.",
      "total_reactions": 2,
      "user": "charlieW24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "It",
      "total_reactions": 2,
      "user": "Paganostaghetti"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"Sinister not suffering from much horror cliches. Is actually a great horror film, that is well written, great performance by Ethan Hawke and actually some smart thrills. made me jump. Needless to say Sinister is that scary movie we all need and crave.\"  B",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Not many horror movies make the jeeper creepers jump out of me, but this one definitely takes the cake. The flow from scene to scene and the dramatic sounds and camera angles coincided with each other very well. I would recommend this movie to anyone that wants a late night scare.",
      "total_reactions": 1,
      "user": "dmullz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Sinister is a 2012 horror film directed by Scott Derrickson (The Exorcism of Emily Rose) with Ethan Hawke and Vincent D'Onofrio.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Sinister is one of those films that are not scary on the whole but the little bits and a few scenes such as ghosts walking around you, strange sounds in the attic, things happening on their own, which despite of being typical and somewhat perdictable, manage to give you slight scares. The concept of the film is really different and amazing but it's execution is not brilliant, at least, not to me. Ethan Hawke's performance is the one thing that keeps you connected with the film and obviously, the main storyline of the film. At some points, it all feels pointless but if we look closer, the connection of the murders is present and is explained as well. I don't know why would anyone move into a house where the murders happened and not tell his own wife about it. This seems freaky. Ethan's character is really freaky, he gets obsessed with this stuff and that's what costs him and his entire family. This film does not offer blood and gore, what it offers requires your complete attention and concentration in the storyline. Honestly, my expectations were not high and I think it's a good thing because I am completely satisfied with this movie. Not scary, but this isn't a bad film either especially in 2012, when majority of the horror films sucked.",
      "total_reactions": 1,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Sinister is refreshing and omni-effective as a horror film; the blend of anxiety and discomfort forces the viewer to attach the character",
      "total_reactions": 1,
      "user": "Wes_Brewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is extremely creepy and screwed up. It is actually a good murder mystery film too. There are a few jump scares but the film doesn't rely on that alone. This is one of the better horror movies I've seen, not the best but not the worst. If you haven't seen it I recommend watching it. There was a part I physical turned away from the movie because that's how messed up it is. This film isn't for the faint of heart.",
      "total_reactions": 1,
      "user": "LevelSeven"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "\"Sinister\" 10 Scale Rating: 8.5 (Excellent) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This film is incredible, the best film I've seen all year, it takes a lot to make me jump in a horror movie and this one made me jump twice in my books that's impressive. I was a bit skeptical at first but this film proved to be worth my time, this film escapes the cliche of a psycho murderer and I thought it was quite a clever plot although I think that it was a bit weird that they have the youngest child possessed by some sort of cult and killing their family members in gruesome bloody ways. However it was clever because no-one would suspect a child who is portrayed as innocent an sane who then disappears after murdering their family and have you believe that it was a murder and child abduction case. I also thought the mask was incredible and creepy. Loved this film.",
      "total_reactions": 4,
      "user": "DaizyBurchill"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "After a once-successful author decides to move his family into a house where a heinous murder took place, things start to get weird. That is great for the viewer and bad for the family. This film is a nightmarish voyage into the past of unsolved murders and how the missing link doesn't always need to be found. The chills are perfectly timed and the pace of this thrilling horror film is perfect, weaving in and out of states of undeniable tension with little effort. Ethan Hawke is superb as the the distraught author. This isn't a by-the-numbers genre piece. It packs soe interesting surprises. And it doesn't hold back on the thrills, chills, and gore. For the most part, this is what horror should be. The flaw, and not really a big one, is that yet again a horror movie features characters that do not act rationally. Still, that's a minor setback to an otherwise perfect gem of taught horror.",
      "total_reactions": 7,
      "user": "gemini0577"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Quite an interesting horror film.  Not typical of recent entries into the Horror genre, it is one that is more psychological than physical horror. The movie follows a \"True Crime\" writer who moves his family into a house where the previous family had been killed and upon further investigation discovers that this murder may have been part of a larger chain of events dating back several decades.  The first act is rather slow but necessary to the big events in the second and third acts of the film.",
      "total_reactions": 6,
      "user": "kheas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Sinister is a very creepy and jumpy film! I definitely had nightmares for a few days! If you're into the horror genre, you wouldn't want to miss out on Sinister!",
      "total_reactions": 6,
      "user": "jennanana"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "It was definitely a decent film, it is truly hard to find a scary movie of such high caliber now a days as many rely heavily on blood and gore and cheap scares needless to say this film did in fact have its share of them. The movie is physiologically boggling and the plot and story captivate the viewer and raises anticipation and anxiety within the viewer. It is quite clever for a film of its class and has a good amount of good scares and jump scenes and clever and delightfully frighting visuals and images. The movies though lacks a consistent base and drifts off into a somewhat absurd heavily rigidity plot which makes the reviewer scratch his head and wonder whats going on, the logic of some of the characters is also somewhat questionable and you can't help but face palm at some of the character's decisions. Another factor is its use of cliche scares such as the good old but overly used popping out of nowhere in your face scare which always leads to a good jump but not quite satisfying as you feel the plot is driven more by cheap scares. The plot is also quite complicated to understand but in the end it ends up being a rather well thought of and daring film that can actually be considered \"chilling\" the film never failed to surprise aside from the end and it gets a well deserved thumbs up. Best scary movie I have seen in years.",
      "total_reactions": 3,
      "user": "GCMANINDAHOOD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Scariest movie out there by far! This film has you thinking throughout the whole film. Much scarier than Paranormal Activity. !!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 3,
      "user": "ReaIistiC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Sinister is one of those paranormal, occult movies I've been waiting to play in theaters; however, after watching this film I was left disappointed. The ending was too obvious. The storyline was dragged on, wasted, and never even met it's climax. The character's names aren't even memorable. It had the stereotypical annoying, jobless wife or the \"housewife\", creepy kids, and an obsessed writer. The writer of this film took no authentic advantages of the daughter who was seeing Stephanie, or the son and his night terrors. The son could of been dreaming and the demon thing could've started appearing in his dreams as if it was trying to possess him and that could've been why his night terrors were progressive; and, the daughter was used at the very end, but there were no evident changing behaviors like her drawing pictures of their family dying or her saying weird things. But, instead, It's like the children were just \"there\". There are no other settings in the movie, in which eliminates the chances for striking, memorable scenes or encounters. Happenings like the skinny policeman or deputy sneaking data for the dad's book and the old deputy/sheriff guy getting suspicious, or the old guy checking up on the dad trying to see what he's up to or taking his tapes and data. Or, kids being bullied, and teachers worried about the son or daughter's behavior or drawings. Or, neighbors and townspeople giving the family crazy looks or disapproval like the wife said they were. Or even, the dad could have hallucinated the demon/children soul-eater thing in a library when researching or asking neighbors about the past family who lived in that house. In his son's room, IT could've been standing or kneeling beside his son's bed while his son is sleeping and  whispering into his son's ear of something to possess him all while the dad can't even see IT, then later his son has another night terror. Or, the dad could be hallucinating about IT in public places because of obsession to his \"detective work\". They never even showed the dad trying to start writing his new book. After they moved, that should have been the half-mark of the movie, because so much could have happened then. At the end, they could've at least added a special scene where the police find their bodies, take the tapes into evidence, then watch them appalled. Overall, although I expected more out of Sinister, the eerie sounds and music, the disturbing kill scenes, the creepy pool scene where you first see IT, the use of the manual, old, and new technology (homemade evidence board, film projector, and the laptop), and seeing Ethan Hawke in a new movie made it likeable.",
      "total_reactions": 3,
      "user": "AkaLia"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "By far one of the best horror movies made in 2012. The action begins to build up right from the beginning and the suspense makes you watch it until the end. It is the kind of movie that lets you know when you will get scared, but makes sure you will still jump or scream. Even if there is nothing surprising in the story, the music and the dark atmosphere transform the movie into a spooky experience.",
      "total_reactions": 3,
      "user": "knorbi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "WOW... I expected nothing of this movie... I was so damn scary. At least the most scariest movie this year. What scene gives me the most creeps especially?? the pool scene on the tape. That thing what ate the kids looks nothing alike in the other tapes. It was if he had a very long nose, whaha.. Ands all those kids in the attic freaks me out too. I have to check all of my paintings tonight :P",
      "total_reactions": 3,
      "user": "MisssZ"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "Sinister was  a movie that I had happily be awaiting for some time.  I really wanted to see if this movie could successfully scare me.  The trailers looked good enough to convince me to drop 12 bucks and see what was up.  What I got was a series of predicable scares, a villain who is completely useless, and road map for the last act of the film.  If you pay attention to the movie, even with one eye open and half asleep, you can see every twist and turn this movie has coming by at least 10 mins before it does.  Not to say the jump scares don't make you jump, they do, but for what?  This movie is advertised as a horror movie with an actual story.. and sad to say It just isn't here.  The last 5 min of the movie feel so lazy I was blown away, it just sort of stops.  As if the movie is saying, \"I'm bored of entertaining you... go home.\"  I won't go into detail for spoiler sake, but instead of keeping adrenaline high an going out with a bang, this movie plays it safe, and you walk out of the theater with none of the scares or really anything for that matter to remember.  I really wanted to love this movie and all it had to offer, but clearly this is one best saved for catching on a random day when it hits HBOGO.",
      "total_reactions": 12,
      "user": "cenzorlord"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "This film is more creepy and messed up than it is actually scary. All but one of the films scares are jump scares, and they're shown in the trailer. Really this is just like \"Insidious\" just with more gruesome killings. Not an awful movie, just not really scary. I will sleep fine tonight.",
      "total_reactions": 11,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Cheap scares here! The movie is a real cliché of the horror genre. Boring, badly acted, pretentious, dull, no suspense at all. You can see the ending coming from a mile.......Ethan Hawke what a waste of talent there...",
      "total_reactions": 4,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "This was a decent horror actually, one of the best I've seen in a while. The pacing is very good and it stays creepy throughout. I felt a genuine sense of dread on more than one occassion. It's in the vein of the Ring, with that kind of moody, atmospheric horror that relies on building up suspense rather than bludgeoning you with explanations too early. It leaves lots to your imagination and feeds it at the right pace. Very clever film and quite underated by critics for some reason. Go by the user score on this one.",
      "total_reactions": 2,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "The goal of a horror movie is to scare you, it succeeded. the script a little loose in the middle and the end nothing relevant, perhaps more of the same, but if the film is good.",
      "total_reactions": 2,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "While it's one of the better horror movies I've seen, \"Sinister\" fails to bring any real scares. It's got a creepy tone, but it never manages to turn creepiness into terror. The plot about a failing true-crime writer trying solve a murder that the cops can't in order to relive his glory days is a good anchor point, and watching him do this at the expense of his family gives the film a certain bleak tone that sets it apart. The movie is at its best when you watch the main character witness gruesome murders through these mysterious recordings, and seeing how it affects his sanity. These moments succeed because they have a sick and creepy voyeuristic feel to them, and also because they give the film a feeling of mystery that has you dying to know just what the heck is going on. The movie suffers when the main character is investigating bumps in the night, which is disappointing because this usually happens right after the good parts. This is when the movie should get scary, but instead it lets us down. Rather than providing a terrifying moment the movie gives us a lame jump scare, or even worse, nothing at all. Why the film chose to build up the tension only to let it fizzle out here is beyond me. But by far the most disappointing thing in the movie is when it finally reveals what is going on. After watching the mystery build and build, and have you get more and more invested, it falls flat on its face an incredibly disappointing and un-scary reveal. It ruins the whole tone of the movie and even opens up one big plot hole, ending the movie in disappointment. I haven't been scared in a horror movie in forever and \"Sinister\" was no different. The one thing that keeps the movie watchable is the fact that it is creepy, which is more than I can say for most other horror movies. It's just a shame it never takes the next step to make it scary.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "If you want a better take of this story, watch the brilliant 'Insidious'.  Sinister on the other hand feels so by the numbers...family moved to a house, said house is 'haunted'..BOO! While it tries so hard to be scary, it just ends up being boring.  Avoid this.",
      "total_reactions": 2,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "While it may not be scary, The good plot and the solid acting by the cast makes this movie worth watching. It's easily one of the better horror movies I have seen in recent years.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I thought the film was pretty good for the price I paid to see it. It was more eerie than scary but had a couple of \"oh crap!\" moments that catch you off guard. I thought Ethan Hawke did an awesome job acting as a progressively semi-crazy individual. My only complaint would be that the audience needs more of a history lesson in the origins of the demon and why He/It does what He/It does. All-in-all, a pretty good flick.",
      "total_reactions": 2,
      "user": "coreyg007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Although its ending isn't exactly satisfying, \"Sinister\" still offers up a rather fresh story, a great lead performance from Ethan Hawke, and some impossibly horrifying imagery throughout.",
      "total_reactions": 2,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "I saw this movie at a Halloween movie marathon in the theater and Sinister was the night's highlight. It easily outclassed the movies Paranormal Activity 4, The Awakening and Silent House i also saw that night. Sinister  kept me on the edge of my chair and wouldn't let me go. The suspense was so good i felt re leaved when the dawn approached the next morning and felt anxiety at sunset. It's true that most scares are jump scares but that's because there is so much suspense you just automatically launch yourself from your chair. I am a mayor psychological horror/thriller movie fan and am always looking for a new scary/disturbing experience. And this movie was great enough to see it 2 times in the theaters. There was only one thing that spoiled this experience a little and that was the movie trailer. It just shows and spoils many important events so that you know what is going to happen when you are watching the movie. This is the reason i don't wanna watch movie trailers again. So don't watch the trailer. Final Verdict: I'd say this is the best horror/thriller movie of 2012.",
      "total_reactions": 2,
      "user": "PastVSPresent"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Every Ethan Hawke movie I seen he dies. The purge. But sinister he dies too. I loved the movie it made me try to guess and it did not let me and I paid the price by the scares and mystery.",
      "total_reactions": 2,
      "user": "cliftonrain"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "I was very disappointed with this movie. It's filled to the brim with cliches and predictability. It's basically 110 minutes of mostly painfully bad acting, with some snuff films tucked inside. I thought there would have been more focus on the footage, like a Paranormal Activity type deal with a different spin on it,but I'm not basing my dissatisfaction on what I was expecting.  It really didn't deliver much on scares or creepiness for me. I always expect horror movies to be bad on some level, in fact I enjoy that aspect to them, but this....just pass on this one. I do have to give some major respect for using a Boards of Canada song, though--that was a pleasant surprise.",
      "total_reactions": 6,
      "user": "Capta1n_Howdy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "I will agree with tropicAces with the \"creepy more than scary\" description, but I think that is the reason for whatever success the film has. The weakest parts of Sinister were the force-fed \"ghosts\" that seemed to interrupt the decline of our protagonist's state of mind. Their participation was inconsistent and didn't really make all that much sense to me. Sinister works because it is unsettling on several levels, one of which is a real-life conflict that I am sure strikes fear into the hearts of many people on a daily basis: failure. With a career, family, marriage, and mental stability all in danger of failing, a sense of desperation leaks into every corner of Hawke's character's life. That combined with a new angle (though not fleshed out entirely, the villain is kind of freaky) make it a worthy watch.",
      "total_reactions": 3,
      "user": "perfectbaby"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Horrible movie.  Way too drawn out and not enough scares.  The plot of this movie gives it a nice disturbing feel, but it is not a good horror film.  I never felt scared the entire movie.",
      "total_reactions": 8,
      "user": "CapnAwesome"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "0 is a bening review for this piece of mediocre and stupid crap done for the mindless masses from sinister Hollywood. The only thing it produces is lotes of yawns an ocasional laughters.",
      "total_reactions": 4,
      "user": "taifun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "With all of the hype that had garnered around \"Sinister\", admittedly I expected a bit more from it.  On the plus side, there are a few jumps scares that work well, a palpable sense of dread throughout, and an undeniably effective soundtrack (a major highlight). On the down side, there are some gaping logic holes (especially in a few of the jump-scare scenes), a wandering script, and some weak acting. \"Sinister\", although better than most of the horror movies released so far this year, is only a moderately effective horror film.",
      "total_reactions": 1,
      "user": "vern"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "The only horror film i had hopes for this year and once again i was disappointed. It definitely had a few moments of terror throughout the film but as a whole this movie was a letdown. Especially the ending, i was expecting something awesome, but then it was just like \"oh, exactly what i thought was going to happen happened\" i honest to god predicted the ending in the first five minutes of the movie. Sinister is a letdown for me but im sure others will enjoy. Give it a shot but whatever you do, don't get your hopes up. 4.5/10",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I'm not really a fan of horror movies and this one proved exactly why. I worked out what would happen very early on, the whole thing felt so formulaic and typical, not very original. It wasn't even scary either, in parts it was just slightly creepy and I even laughed at some 'scary' parts. Let me put it this way - the best part was when someone in the cinema fell over when they went to the loo.",
      "total_reactions": 2,
      "user": "glacier777"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Many people still consider the horror genre a marginal cinema, and if you watch movies like Sinister you can fast jump to that conclusion. There is here a very good story, however, quite badly told, and the blame falls on the many cliches that are essential to keep the narrative going on. But what is more harmful for the movie is how much aseptic and clean its horror and violence are depicted, how light is the treat and how faded is the fate of the main characters, in a way the movie ends up being self censored probably to hit more audiences with a lower rate. So, what remains of a movie not scary, not terrifying or disturbing, qualities of the horror cinema, are lame cliches that make the final act as predictable as the end of a soap opera. Don't rely on Sinister to judge horror cinema, this is the hollywoodian horror cinema. Stick on extreme french wave if you wish a real evolving of the genre or at least, stay away from, most of, the horror that comes from US.",
      "total_reactions": 1,
      "user": "vladsch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Definitely a great horror movie. It was not brilliant. But what it did, it did right. Genuinely creepy, good acting, story moved right along and was definitely more than the trailer.",
      "total_reactions": 1,
      "user": "JPG127"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Fairly bland, honestly. It's not all that scary. Ethan Hawke does a solid job. The lighting is terrible. There are literally never lights on in the house for whatever reason. Slightly above average horror fare, but nothing remarkable. 5.8/10",
      "total_reactions": 1,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "Stupid movie, with bad actors, bad script, bad environment, a lot of advertising...",
      "total_reactions": 2,
      "user": "voiders"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "its pretty good thats why i gave it a 8 its one of the best scary movies i have seen sure it wasnt that scary to me well alot of movies arent that scary to me but watch it its good",
      "total_reactions": 1,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2016
      },
      "score": 9,
      "text": "Horror is the only genre in which I NEVER trust or care what the critics say. Honestly, I do not know what pleases them. \"Sinister\" was so scary that I had to pause it a couple times and watch some Teletubbie videos from Youtube to calm down.",
      "total_reactions": 1,
      "user": "PetitBikini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "A man moves his family into a house where a family was brutally murdered.  Will they suffer the same fate?  What do your instincts tell you?  Sinister offers plenty of thrills and chills.  Story-wise, however, this isn't anything you haven't seen done before.",
      "total_reactions": 0,
      "user": "emcoffey3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2016
      },
      "score": 2,
      "text": "The budget must have been minuscule, which isn't necessarily a bad thing.  But you soon realize that the story moves so slowly because they needed to fill 1 hour, 45 minutes.  No masterpiece here.",
      "total_reactions": 0,
      "user": "adverb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Very good. Happy a movie was scary. Its been quite a while. Highly recommend. Its been 10 years and only a handful of scary movies. Not saying its the best movie ever, however for a horror movie it has a plot, is scary, has a few twist, and will make you jump. This one is a winner.",
      "total_reactions": 0,
      "user": "bobmoorwessel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "One of the most scariest horror movies, I have ever seen! The beginning is great, it setups a great story f the movie and the mystery starts with a lot of scares. The ending is alittle bad. But overall 90 percent of the movie is great!",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Sinister is a decent midrange flick with a decent, somewhat washed up storyline and antagonist. The film only contains a handful of jumpscares, but they're pretty effective.",
      "total_reactions": 0,
      "user": "dakydaky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Although it has allot of the cliché horror film elements it differentiates itself by having good actors (Hawke) and a creepy atmosphere which suggests more scary things could happen than there actually do. Maybe not a classic in the genre but certainly one of the better horror films.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "This one has jump scares, but good jump scares. Too often, bad horror films will rely on jump scares that startle more than they do scare. However, in Sinister, it does a fantastic job crafting an eerie and fully unsettling atmosphere thanks to a great back story, mysterious happenings, and the phenomenal score (did I mention the score?). Sinister is successful because it does not rely on these scares, rather it is the atmosphere that keeps you on edge and thrills you throughout. Ethan Hawke and the rest of the cast do a good job, but really, this shows director Scott Derrickson truly does have talent. With this atmospheric and creepy horror film, any claims to the opposite can be disregarded. A truly haunting experience, Sinister works well not only as a horror film, but as a crime film with a truly captivating story behind it that you try and piece together along with Hawke. If this film does not scare you, I truly envy you, because I was petrified from the very beginning.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I usually dont watch horror movies cause they are booring as  but this one were very interesting and actually a bit scary.",
      "total_reactions": 0,
      "user": "Xgashh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "if you can watch a movie without over-analyzing it and take it as what it is. . . a piece of fiction then you can appreciate sinister. movies use tricks of all sort that defy any sense of realism but we love them anyways because they are ultimately a form of escapism. hence, sinister is great film. i have become desensitised to horror but still look for that movie that could give me the chill factor and sinister although absurd in some ways did just that.",
      "total_reactions": 0,
      "user": "kyldesty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "A few months back, I saw \"The Apparition\" and \"The Possession\"--two would-be horror films that were so utterly boring and generic that they blur together to the point that I now struggle to remember what detail belonged to which film. I suspect in three months time I will be saying the same thing about \"Sinister\". As mainstream US horror movies go, Scott Derrickson first gained attention with the success of \"The Exorcism of Emily Rose\" and then the widely disliked remake of \"The Day the Earth Stood Still\". The film follows true-crime writer Ellison Oswalt (Ethan Hawke) as he discovers a box of home movies that puts his family in eminent danger. Ellison Oswalt moves himself and his family in to a house where a horrific crime took place earlier, but his family doesn't know. He is trying to find out more about the crime so he can write a new book about it to help his flailing career. He uses some \"snuff\" film that he finds which show the crimes to help in his research, but he soon finds more than he bargained for. Some credit is due for an intriguing twist to the central concept, blending what's happening in the reels with the actual action on-screen. This is what provides the film's best jump-out-of-your-seat moments, with Hawke giving a solid lead performance as the \"cardigan-clad\" Ellison. Unfortunately, the film become less effective and more predictable as the film's narrative meanders on of just more of the same. Day turns to night, the projector film rolls, creepy noises are coming from the attic, and it's time to go investigate. The best spook house flicks offer credible reasons why the family stay in such a terrifying environment. Yet \"Sinister\" struggles to convince us. It takes sometime to determine if you are watching a film about the mundane activities of a killer, or a haunted house story as the film seems to wander aimlessly. Hawke is subjected to horrific experiences yet unbelievably brushes them off. He keeps it all from his family which is some feat given the loud racket every night which his wife happily sleeps through. Nothing ground breaking here, but I would recommend picking this up at your nearest RedBox for a late night watch for those who enjoy horror flicks.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "This is a horror movie that is trying really hard to be a real horror. The problem is, it isn't. While there are a few genuinely creepy moments, generally it is rather dull with little excitement. There is very little atmosphere and rather dry dialogue. The movie feels like it would have been better had it been made by a bunch of college freshmen as a school project. Other than Hawke's character, you really do not care at all about any of the other characters and they barely seem relevant other than being plot devices.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Great movie, plot is great and characters are great, first good scary movie that ive seen in a long time. But, the downfall of it is there wasnt alot of background info on how the demon came to be and why the first family",
      "total_reactions": 0,
      "user": "MakailaM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "A solid Thriller that will have you sitting in fear for most of the movie! It's a fairly simplistic plot but has you guessing throughout it as to what is actually going on in this house and with author Ellison Oswalt. The 'bughuul' is rather terrifying but he is nothing compared to a crop of kids that will scare the sh!t out of you! It's nothing that hasn't been done before but there are some fresh ideas in here that made it very enjoyable to watch, but probably don't watch it alone!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The movie wasn't entirely original because there were too many cliche moments from other films. An example would be the main premise of moving into a murder home has been explored several times thus it was obvious where most of the story plot was going to go. Additionally, there were too many expected moments that were suppose to be",
      "total_reactions": 0,
      "user": "PoliSci0621"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is awesome. The idea is commonly used but they did it in a way that works. The story is pretty simple and easy to follow but that doesn't make it so that the story sucks. This movie doesn't run on jump scares and instead runs on creepy music/atmosphere which I think they pulled off very well  the camera effects like Film Grain and dark lighting give the whole movie a really creepy feeling.",
      "total_reactions": 0,
      "user": "TheRubixGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I decided to watch this film and all I can say it was pretty scary and very exciting. The beginning was good, not too fast nor too slow and was well made up which I liked. The films which the main character found on the attic was also pretty well made and seemed realistic; the story seemed to be true. Although I was expecting more scary parts in the movie, but that didn't really let me down because the story was enjoyable. The most shocking part is the ending which I didn't expect at all. The writer finds out the missing childs killed their own family and actually they're behind the camera in the films. Soon after his daughter appears at the door and kills her family, then Bagul takes the girl into the film she just made. Most horror like films end happily, but this one doesn't and I liked it for this reason. I can only suggest to watch this film.",
      "total_reactions": 0,
      "user": "Hollika"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "\"Don't worry, daddy. I'll make you famous again.\" - Ashley",
      "total_reactions": 0,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "rented this in red box not sure what it would be like... i was very suprised that it kept me on the edge of my seat the whole movie. great story and was very creepy. its been a while since ive seen a movie that creepy.",
      "total_reactions": 0,
      "user": "rpg4life"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is mysterious and chilling. The very core of supernatural horror movies invoking the late Stanley Kubrick's  The shinning\" in it's spine tingling thrills.",
      "total_reactions": 0,
      "user": "mrkillface"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Despite the fact that this is a horror movie the plot is well executed. This movie was more creepy then scary but it has it's moments. Ethan Hawke is very convincing as a true crime author struggling to write another good story. The classic film projector was a good addition to the story which adds suspense to some of the scenes. Though the ending could have been better this was a good yet creepy movie.",
      "total_reactions": 0,
      "user": "soren40"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "I really wanted this movie to be scary...because it's been awhile since I've seen a really good horror movie. However this movie didn't deliver from start to end   It just wasn't as scary throughout as it could have been. There was a lot of promise in the beginning  but the ending disappoints. Would I recommend that you watch it? Sure, it does have some scary parts and it is generally creepy.",
      "total_reactions": 0,
      "user": "LDiane"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "A horror movie that wasn't bad.  Unfortunately for someone whose a horror movie fan like myself I have to say the genre has disappointed in a big way.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Brilliant acting from Ethan Hawke and creepy story will make you dream nightmares for sure! With few boring and weak scenes, overall this is a great movie for all horror lovers!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "I believe this was very well written with convincing acting. Overall a good, original horror movie... well despite the whole \"camera\" trend these days.",
      "total_reactions": 0,
      "user": "Joshthomas2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Although I enjoyed the overall concept there were a few things that threw me off the movie and took it down a few notches from being perfect. I didn't personally enjoy some of the overly-theatrical scenes involving dead children appearing, which is a little overdone and didn't really add anything to what the film was trying to achieve. Jump scenes (minus the dead children) were very well executed and sometimes gave you unexpected frights  others were predictable. The script needed a bit of work, particularly the wife's lines. She is an English character yet everything she says is very Americanized  some of her words are even spoken with an American twang (despite the fact the actress is actually English)  which is quite irritating as it detracts from the authenticity of the movie. Her scenes with 'Ellison' were often quite overdramatic and you couldn't really feel much a connection between the two of them; their on-screen marriage seemed to be a (hard to stomach) mixture of love and hate. If that is what it was supposed to be, it wasn't portrayed well!",
      "total_reactions": 0,
      "user": "omgzalicia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This horror flick stood out to me, I started out with no expectations what so ever... Sinister nailed it, it really got me thinking and pondering of what supernatural means to me. Being a Horror film buff,  this movie's script seems edgy, bold, different and smart. (In my opinion, of course)... I loved everything about this film! A well written script, an amazing director, Scott Derrickson and Cinematographer, Chris Norr who did an amazing job",
      "total_reactions": 0,
      "user": "blockofcheese"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This horror film is probably one of the scariest I have seen in a while, and not because of the jump scares. Just the overall feel of the film is tension enough, but the music and sound makes the movie 10 times better. The music while you see some of the disturbing scenes is quite hard to listen too at some points, starting from the very beginning. But it does have it's problems, when you start finding and figuring stuff out, the creepiness goes away. Films like this need to learn how to end it on a cliff hanger, or let the audience decide theories on what was happening. It's not really a film I would watch again, but if your deciding on what horror to watch next, perhaps you should try adding this to the list, altho I could name a dozen more that could probably have more of a desired effect.",
      "total_reactions": 0,
      "user": "DanielWesoly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Sinister is a great horror film with some mystery in it and is keeps you interested throughout the whole movie. There is only one bad thing on Sinister. The ending. Though the film is well directed and it has its scary moments there is a bad ending which ruins the whole movie. it doesn't explain you why this all happened and how is it possible for the kids to do that things. That is the bad thing about that movie. Though it is scary and it keeps you it has a bad ending which doesn't make sense. Too bad. However you will enjoy that film and you may  bricks. In the good way",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Best horror movie I have ever seen. It was so scary I had to turn the lights on! The music is particularly effective, being low bassy and menacing. The found footage is very creepy, and having no sound makes it worse. I did not even recognise Ziggy from The Wire! I only saw his name afterwards.",
      "total_reactions": 0,
      "user": "numcrun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I really like this movie, i  recommend this to all people who like creepy, mysterious movies. It was pretty there were scenes which creeped me out and that's what i love about Horror-movies.",
      "total_reactions": 0,
      "user": "97_mario_97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Sinister, although maybe looking pretty tame, is one of the scariest movies of the last ten years, and is probably one of the top ten scariest movies I have ever seen, right up there with Rosemary's Baby and The Exorcist. Of course, some of the elements of the movie are a bit cliché at times, but they are overshadowed by its ability to create scares and thrills pretty much out of thin air. Plus, the movie is bolstered by great acting and a very intriguing and engaging story. This one really surprised me, and took me to levels that I never would've expected from this genre. It is a truly bone-chillingly horrifying movie.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "I keep getting this move and \"Insidious\" mixed up.  Neither one is very distinguishable from the other; if you liked one, you'll probably like the other.  Ethan Hawke was entertaining to watch, the rest of the movie was just OK. It wouldn't be a complete waste of a movie night to watch this, but you won't remember much, or really care to.",
      "total_reactions": 0,
      "user": "mrjonesezn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "There are creepy moments...I guess. But MAN a bunch of loud noises is not scary.",
      "total_reactions": 0,
      "user": "RRJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Reviewing this for comparison against Sinister 2. Sinister had some good acting talent behind it with Ethan Hawke as the tortured protagonist of the film. The film is a little too reliant on jumpscares but it still has its creepy moments. First viewing I thought the film was rather well done but on second I saw it as a reasonable effort but nothing too special. The main villain has a creepy design, but some jump scares in this film are just too cheap. I give this a 6.5/10, but will keep it at a 6/10 on metacritics score.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "'Sinister' is a creepy horror movie lover's delight. The opening sequence sets the tone of the movie. Ethan Hawk's performance, as a once famous crime writer who now struggles for another best seller, is near perfect. The ambient electronic music score is very unsettling which adds to the fright factor. Amateur Super 8 film footage of different brutal murders, which are linked together, throughout the country over a 50 year timespan imply serial killings and run through an old film projector adds even more to the tone of the movie's creepiness. Sinister is thoroughly engrossing and a true fright fest that had me jumping in my seat! But it's the climax that's the final killer that sets this movie above many other horror films.",
      "total_reactions": 0,
      "user": "theloanarranger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Sinister is one of creepiest dangerous , criminal acts movies of the year 2012 you could tell this  is the conjuring vibe  you can tell  by the music this is the  most shocking film by Scott Derickson that i have ever seen. But to be honest its a little bit better then  James Wan's The Conjuring. (but honestly nothing is better then the conjuring )  I think that this more messed up then Saw. But if you like Saw , Insidious then watch the horror's legend horror  film ' Sinister '. Grade A+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "This is perhaps one of the best horror movies ever made in a long time. The movie does not solely rely on jump-scares but more on the intense creepy and disturbing factor. However, whenever jump-scares are present, it is indeed scary! Great acting, original plot, and unique concept. A sequel must be made!",
      "total_reactions": 0,
      "user": "moviemaster18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This is more of a  drama than a horror film.But the movie still has some effective \"scary\" scenes.The movie is  kind of slow and the horror is present in the end but,the movie is pretty entertaining and Ethan Hawke is really good.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I have to give this a movie a 10 rating. Sinister is a very dark movie, creepy, spine tingling. This is the only movie that I have watch in the past ten years that spooked me. A perfect dark story line with an equally dark soundtrack makes this movie one of my favorites.",
      "total_reactions": 0,
      "user": "Crusty_Cowboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was one of the best horror movies that I have ever seen and I think that's because it is a good blend of a few other genres of film but on top of it all its really scary. I found myself very scared throughout this movie which is kind of a rarity for me unless I'm watching one of the classic horror films. I love the crime aspect of this movie, I think every human being secret loves a good serial killer film because we are so mesmerised with how their brains work. This film has a few twists along the way and really does leave you guessing until the very end. Ethan Hawke was amazing in this film as well. This guy could be the horror king if he wanted to, I'd like to see him in more films like this. If you are a horror fan please watch Sinister.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Sinister is a 2012 slasher horror film directed by Scott Derrickson and written by Derrickson and C. Robert Cargill. It stars Ethan Hawke as fictional true-crime writer Ellison Oswalt who discovers a box of home movies in his attic that puts his family in danger. Sinister premiered at the SXSW festival, and was released in the United States on October 12, 2012, and in the UK on October 5, 2012.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "'Sinister' delivers on the premise that it is in all essence a horror film. It certainly succeeds in creating a feeling of suspense; dusty video clips and darkened rooms are plenty, complete with squeaking doors and creaking floorboards. Sufficient time is invested in the main characters and the murders themselves are certainly creative.",
      "total_reactions": 0,
      "user": "amfever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "\"Sinister\" better-than-average modern horror flick, and, while it may be similar to \"The Ring\" in some aspects, it's still an entertaining and scary film with a good twist ending.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Summary: Despite Hawke's superb performance and a few scary moments, most of Sinister relies on cheap jump-scares. 50/100 [C]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Sinister is one of my all time favorite horror movies, with Cabin in the woods and Insidious. A pagan deity from Babylonian times named Bagul, otherwise known as the eater/devourer of children and the corruption of innocence, luring or tricking them to watch snuff movies of other children he has lured to slaughter their entire families while filming the ordeal as a sort of cult initiation, trapping them in his own nether world to consume their souls begins to terrorize a new family that has settled into the house of the previous families murder, after  true crime novelist protagonist finds the old tape reels of the previous murders of other families, putting his family in danger.",
      "total_reactions": 0,
      "user": "Signas501"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Someone finally figured out a way to make the concept of \"found footage\" interesting, and it's by incorporating it into the film's overall scope rather than employing it as the governing factor. Sinister is an intense horror film that starts out masquerading as something more mundane. It's hair-raising and gripping, although some of its narrative turns require a significant level of \"suspension of disbelief.\" In true horror movie tradition, characters do things that are head-scratchingly dumb. Once you accept those logic-defying moments, the movie works with diabolical effectiveness. And, even though the ending is inescapable (and therefore predictable), that does little to diminish its effectiveness.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "Probably my favorite horror movie after The babadook, Sinister is an utterly creepy movie with an unsettling and eerie feeling throughout the whole film.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Sinister is a very good horror film that uses scary imagery and heart wrenching suspense to scare the audience despite having a relatively familiar plot and characters.",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "I gave this movie a ten as it is the first horror movie to make the get up out of my seat and say no and begin to walk out, this movie terrified me so much, my friend had to drag my arse back down so I didn't leave the cinema and it was the lawn mower scene that did that, this film was original, scary and very unsettling, the OST was the greatest horror OST ever created, it managed to terrify me at every single scene, Sinister is my favorite horror of all time and will remain like that for a long time to come",
      "total_reactions": 0,
      "user": "Proctorious"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "One of the very few modern horror films that manages to be chilling, thrilling, frightening, and disturbing. Great acting and a clever premise are just the icing on the cake.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "The constant red herrings and cliche plot points prevent me from giving this film a 7 or 8. The film could have been a lot better, but it isn't a bad film by any means.",
      "total_reactions": 0,
      "user": "BritishWolf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This movie gave me a creep. I haven’t slept for a couple of nights because of this movie.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This was a truly creepy horror film. I wish it was a little scarier, but Scott & Blumhouse knew what they were doing with this film. I was super pumped about the sequel, and I loved this movie, despite wanting more scares. However, it's worth watching and owning, and you should watch it",
      "total_reactions": 0,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Ethan Hawke stars as a crime novelist obsessed with a missing-girl case in Scott Derrickson's latest scary movie.",
      "total_reactions": 0,
      "user": "FilmClub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Something wicked comes creaking along the floorboards in “Sinister” before racing prematurely out the door. Ethan Hawke plays a true-crime author who, when this creepy horror flick opens, is moving his family into a house where another family was slaughtered. He’s investigating the murders for his next book and tells his wife it’s the only house they can afford. The tree from which members of the other family were hanged — a scene that the director Scott Derrickson, who shows it several times, is clearly proud of — looms in a picture window like an omen.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "Deutsche Review - Kritik",
      "total_reactions": 0,
      "user": "KayVen17"
    }
  ],
  "metascore": 53,
  "name": "Sinister",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 12,
    "month": 10,
    "year": 2012
  },
  "opening_weekend_income": 18007634,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 165948,
  "rating_freq": {
    "1": 2147,
    "10": 12742,
    "2": 1552,
    "3": 2846,
    "4": 5775,
    "5": 13905,
    "6": 31931,
    "7": 49315,
    "8": 32476,
    "9": 13259
  },
  "release_day": 12,
  "release_month": "October",
  "release_year": 2012,
  "user_review_count": 536,
  "votes_per_demo": {
    "aged_18-29": 68170,
    "aged_30-44": 52962,
    "aged_45+": 9388,
    "aged_under_18": 762,
    "females": 30329,
    "females_aged_18-29": 16869,
    "females_aged_30-44": 9306,
    "females_aged_45+": 1734,
    "females_under_18": 235,
    "imdb_staff": 8,
    "imdb_users": 165948,
    "males": 108288,
    "males_aged_18-29": 50670,
    "males_aged_30-44": 42950,
    "males_aged_45+": 7486,
    "males_under_18": 519,
    "non-us_users": 77067,
    "top_1000_voters": 533,
    "us_users": 24819
  },
  "year": 2012
}