{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.6,
    "aged_45+": 6.8,
    "aged_under_18": 7.2,
    "females": 6.8,
    "females_aged_18-29": 6.8,
    "females_aged_30-44": 6.6,
    "females_aged_45+": 7.1,
    "females_under_18": 7.5,
    "imdb_staff": 5.8,
    "imdb_users": 6.8,
    "males": 6.8,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.7,
    "males_under_18": 7.2,
    "non-us_users": 6.7,
    "top_1000_voters": 6.0,
    "us_users": 7.0
  },
  "avg_screens": 22.272727272727273,
  "budget": 500000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 1,
    "year": 2013
  },
  "critic_review_count": 110,
  "duration": 81,
  "genres": [
    "drama"
  ],
  "gross_income": 375981,
  "max_screens": 50,
  "mc_avg_user_score": 7.9,
  "mc_metascore": 71,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Smashed",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 34,
  "mc_pro_critic_reviews": [
    {
      "critic": "James Rocchi",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Ponsoldt, Paul and Winstead make a remarkably effective team for this film's points and purposes, and Smashed burns long after it goes down smoothly."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 91,
      "summary": "What's new about the unsensationalized portrait of one-day-at-a-time progress (and setbacks) is the low-key energy of this drunks' tale, by and for a generation with a high tolerance for humor and a low tolerance for soapiness."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "The degree to which Smashed refuses to indulge a voyeuristic taste for the kind of sordid details exploited by reality television amounts to an unspoken declaration of principle. In lieu of self-pity, Smashed substitutes tough love."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "Movies about drugs and alcohol might be a dime (bag) a dozen, but James Ponsoldt's Smashed is so beautifully shot and well acted as to transcend the genre."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "Its sharp writing and essential credibility make this small, intimate tale fresh and involving."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "This is a serious movie about drinking but not a depressing one. You notice that in the way it handles Charlie (Aaron Paul), Kate's husband. He is also her drinking buddy. When two alcoholics are married, they value each other's company because they know they can expect forgiveness and understanding, while a civilian might not choose to share their typical days."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "In spite of the out-of-place pregnancy subplot, Smashed is a film of pummeling intensity and bruised emotions."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "For appreciators of fine acting, it's a film well worth seeing, as well as one worth toasting - if only with ginger ale."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 80,
      "summary": "The sharp ends in Smashed are here for all to see, and Ponsoldt never shies away from their spiky, thought-provoking effect. Yet he also finds grace and warmth in the story."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "A terrific performance by Mary Elizabeth Winstead as a rock-bottom alcoholic is only one reason to appreciate Smashed, an affecting and immersive addiction drama about the unforeseen pitfalls along the road to recovery."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 75,
      "summary": "There will never be another Marilyn Monroe or Elizabeth Taylor, but Hollywood may have found a new Lee Remick in Mary Elizabeth Winstead."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "It's a familiar, straightforward story, carried from start to finish by Winstead, who makes Kate an interesting study in contradictions."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "If you had to be an alcoholic, you'd want to be like Kate, the young drunk played by Mary Elizabeth Winstead in the new movie Smashed."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Director James Ponsoldt, who co-wrote the script with Susan Burke (inspired in part by her own experiences), opts for realism and modesty instead of sensation."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Director James Ponsoldt knows what his job is here. He keeps the camera on his lead actress and doesn't cut away. For Winstead, Smashed is the doorway to great things."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Smashed is quietly affecting, though sometimes difficult to sit through. The saving grace is Winstead's smashing performance."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "The movie has some powerful moments, but it's mostly superficial."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Don't forget Winstead when making a list of the year's Best Actress contenders. Yes, she's that good."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "The truthfulness of Winstead's performance - and those of her co-stars, too - has a steadying influence on James Ponsoldt's modest drama, which at times seems in danger of failing a sobriety test."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Winstead's performance provides a trenchant wakeup call even when the movie can't keep pace."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "Winstead, who appears in nearly every scene, can be compelling but, like the material, often pushes too hard, especially in Kate's climactic dive off the wagon. In a far more limited role, Paul is lower-key and convincing."
    },
    {
      "critic": "Mark Keizer",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "Alcoholic movie characters run the gamut from lovable millionaire (Arthur) to Skid Row bum (Henry Chinaski from Barfly) to all-out, suicidal depressive (Ben from Leaving Las Vegas). As written and performed, Winstead's Kate triangulates between all these approaches and finds a sincerity that plays to the intellect, not to the rafters."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "The most interesting thing about Smashed is the way Kate, the movie's alcoholic schoolteacher, never looks drunk - at least, not the way drunk people do in the movies."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Feels different from most recovering-train-wreck stories. The movie is a tidy relaying of a messy situation involving two reasonably functional middle-class LA alcoholics, one of whom gets serious about cleaning up a lot sooner than the other."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "Two fine performances - particularly from an unhinged Winstead - almost elevate Smashed to greatness. But an under-worked script leaves you feeling groggy and bleary-eyed by the end."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Winstead and director James Ponsoldt add something gripping and modern to the cinema of recovery, a well-mined genre that can still, it seems, yield thoughtful surprises."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "To be sure, the film as a whole feels like a creaky vehicle, belabored with plot strands and stereotypes that only serve to highlight Winstead's ragged commitment to something real."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Smashed may be better at preaching to the choir and is likely to find its largest audience among struggling 12-steppers."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Smashed never really rises much above the level of a dramatic public service announcement. That's not so much because of its tone, but because what it's announcing isn't exactly news. Alcoholism is a disease. Alcoholics aren't bad people. Quitting is hard."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Smashed touches on the awkward perversity that often comes from seemingly pure emotions and intentions, and turns a noticeable, if slightly analytical, eye toward the selfish hurt and narcissistic projections inflicted by the perceived moral hierarchy against recovering addicts."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "There needs to be a 12-step program for movie people to stop sharing their \"deeply personal\" yet insight-free stories of addiction."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I was fortunate enough to have seen the film with the director and cast (less Aaron Paul) in attendance. VERY talented group, and really good chemistry for a team that had worked together for such a short period of time.  After the first 20 minutes, when the film is establishing Mary Elizabeth and Aaron's drinking behavior and how it affects their lives, I thought I was going to loathe the film.  Yes, let's observe a couple of alcoholics making bad decisions!   But the film becomes much more about the relationship between someone in recovery and her partner who is not, which is intriguing.  Her support system (colleagues at her school, sponsor ,mother) is well fleshed-out.  Offerman, Spencer, and Mullaly are all terrific in their supporting roles, and it's amazing that they shot this film in only 19 days considering how well they related to one another.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Smashed is a small but powerful film that goes through both the highs and lows of alcoholism and sobering up. I was fascinated at how realistic the lead characters of Kate (Mary Elizabeth Winstead) and Charlie (Aaron Paul) were on the surface as just a pair of fun loving people who like to drink to have a good time, maybe occasionally going overboard. As someone who rarely drinks myself, I have observed similar behavior far too often and never thought much of it, but Smashed explores the deeper issues beneath the surface masked by the funny and entertaining antics performed while under the influence. As the film unfolds some of these scenes that seemed hilarious become tainted in a sense with the darkness of Kate's situation, highlighting the complexities of identifying and dealing with alcohol addiction.",
      "total_reactions": 1,
      "user": "lufflyness"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Smashed\" is excellent.... it deals with addiction issues and dysfunctional family system and alcoholism issues.... but it's far from being a \"downer\", it's very positive and intelligent in its take on this material ....great cast !....great direction....great script.....a very MATURE, INSIGHTFUL and THOUGHTFUL film....and God knows we could these qualities a lot more these days !! Go see it !!",
      "total_reactions": 0,
      "user": "jhep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Wow, Mary Elizabeth Winstead, I really liked her in 'Scott Pilgrim', 'The Thing' and the new 'Die Hard' movie and even though she was good in them she was brilliant in this. I imagine the writing and directing team had first hand knowledge of alcoholism to give Mary Elizabeth Winstead such spot on direction. I have seen this exact behaviour before as I'm sure everyone has so I knew what I was seeing was an accurate portrayal. This wasn't an easy film to watch but it was rewarding. It's far from a new story but it's always nice when an old idea is given a facelift with excellent performances. Aaron Paul plays the husband really well but I watch 'Breaking Bad' so I can't quite see him as anyone other than Jesse, lol. The brilliant Octavia Spencer has little to do but it rounds this great cast off nicely. This is a very good film.",
      "total_reactions": 0,
      "user": "NavQ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "\"Smashed\" 10 Scale Rating: 7.5 (Very Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 3,
      "text": "Some people saying \"Days of Wine and Roses\", yes, and I'd add also... \"Clean and Sober\" was definitely the modern gold standard, for this type of film, as much abuse and fury is involved in AA and ACA (which can affect generations of family underneath, I should know!) ! This makes AA or family dysfunction just too too easy, or the Bohemian/Oregonian granola hipster form applied to alcoholism, gimme a break here, the characters are much too \"cleaned up well\" for this!! Any of the addicts out of THE WIRE would do nicely over these ones! or the stereotypical nerd male teacher in a Cosby sweater who also is a sheltered pervert, proof that Sundance is starting to sadly become a parody of itself like all the other multiplex lamestream films (It's white people too, I swear! and I should know since I am one!)! Seriously, even Don Draper offers more of a character study, even if I have to put up with all the lame commercials on AMC...",
      "total_reactions": 0,
      "user": "pdw123"
    }
  ],
  "metascore": 71,
  "name": "Smashed",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 12,
    "month": 10,
    "year": 2012
  },
  "opening_weekend_income": 26943,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 13835,
  "rating_freq": {
    "1": 166,
    "10": 679,
    "2": 99,
    "3": 176,
    "4": 393,
    "5": 1110,
    "6": 2995,
    "7": 4775,
    "8": 2705,
    "9": 737
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 31,
  "votes_per_demo": {
    "aged_18-29": 5400,
    "aged_30-44": 5210,
    "aged_45+": 1395,
    "aged_under_18": 13,
    "females": 3068,
    "females_aged_18-29": 1541,
    "females_aged_30-44": 1103,
    "females_aged_45+": 302,
    "females_under_18": 2,
    "imdb_staff": 4,
    "imdb_users": 13835,
    "males": 9182,
    "males_aged_18-29": 3786,
    "males_aged_30-44": 4028,
    "males_aged_45+": 1068,
    "males_under_18": 11,
    "non-us_users": 7484,
    "top_1000_voters": 170,
    "us_users": 2916
  },
  "year": 2012
}