{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.4,
    "aged_45+": 6.4,
    "aged_under_18": 7.2,
    "females": 6.5,
    "females_aged_18-29": 6.6,
    "females_aged_30-44": 6.4,
    "females_aged_45+": 6.7,
    "females_under_18": 7.0,
    "imdb_staff": 5.9,
    "imdb_users": 6.5,
    "males": 6.5,
    "males_aged_18-29": 6.6,
    "males_aged_30-44": 6.4,
    "males_aged_45+": 6.4,
    "males_under_18": 7.1,
    "non-us_users": 6.4,
    "top_1000_voters": 6.0,
    "us_users": 6.5
  },
  "avg_screens": 989.2142857142857,
  "budget": 15000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 24,
    "month": 5,
    "year": 2013
  },
  "critic_review_count": 239,
  "duration": 112,
  "genres": [
    "action",
    "drama",
    "thriller"
  ],
  "gross_income": 42919096,
  "max_screens": 2511,
  "mc_avg_user_score": 6.1,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Snitch",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 59,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "Snitch is grittily streetwise, and until its last 20 minutes fairly credible compared to other movies \"inspired by\" true stories."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Despite its apparent compromises to noble finger-wagging (initially) and requisite fist-pumping (eventually), Waugh has fashioned a sturdy character-first entertainment out of Snitch at a time of year when those are all too rare to behold."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Pleasant because, instead of the usual hero-and-mayhem jive, Snitch is an honest exercise in workmanlike craft. This is to film what ceramic is to floors or Billy is to bookcase or what a third-line centre is to a winning hockey team – hardly great but good and solid and functional."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "In its focus on an ordinary family facing a nightmarish scenario, Snitch is a terrifying but relatable story."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "It's an entertaining picture — pulp, coming from a place of righteous indignation."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "There’s a lot of cartoonish potential in Snitch, but director Ric Roman Waugh (who previously made the excellent prison drama \"Felon,\" another exercise in somber desperation) seems intent on trying to sell the movie as a more serious enterprise. And amazingly, the gambit works."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "Unusual for this sort of thing, Snitch is a film after which you remember the characters and actors more than the big action moments."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 67,
      "summary": "Snitch toys with moral ambiguity and fatalism before losing its nerve and delivering the action-movie goods in a climax that hews closer to fantasy than the keenly observed realism of the film’s solid center."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Snitch is protein-and-starch filmmaking at its utilitarian -- and belly-filling -- best. Johnson brings the steak; Bernthal the sizzle. The father-son drama is served up as sauce on the side. But as long as the beef isn’t too overcooked, who needs the A1?"
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Snitch gets a decent amount of drama (and action, of course) out of the argument that there’s paying for a crime, and then there’s overpaying."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Directed by veteran stuntman Ric Roman Waugh, Snitch is shot with a mix of nervous close-ups and weirdly vertiginous angles."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Who would have guessed Dwayne “The Rock” Johnson would deliver the best work of his career playing a guy who squares off against a pack of small-time street thugs."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "What gives it’s juice is the supporting cast. John Bernthal (“The Walking Dead”) is credibly wary as the ex-con John begs to get him in the door of the drug world. And the terrific Michael Kenneth Williams is the first dealer he meets, a guy who pulls a gun on him just to test him."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "While not the balls-out action movie the marketing suggests, this Rock-powered family drama is not with its moments."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Snitch is a movie that cries out for the wiry B stars of yore: Robert Forster, a younger Tommy Lee Jones. And it would have occurred to a craftier screenwriter to make his hero’s walk on the criminal wild side a touch more tempting."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Although Johnson performs admirably in the drama-heavy role — far better than many of his action-hero colleagues would manage — John Matthews is a character as boring as his name."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "It's nice to have actors of Sarandon and Pepper's caliber onboard for the office-bound wheeler-dealer scenes, but mostly, it's the prospect of witnessing Johnson at the helm of an 18-wheeler as he rams his way through machine-gun fire that excites."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 55,
      "summary": "Whatever lizard-brain fun might have been had in watching Johnson do battle against a drug cartel is weakened by the occasional hard tug at the social conscience. The film winds up divided against itself."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Not the usual action movie. It's too odd for that. Based on a true story, it has the weirdness of real life, which is good. But also like real life, it has that funny way of not making much sense or being all that enjoyable."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "A glorified TV movie."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "For all its violence and road rage, Snitch doesn’t disintegrate into noisy popcorn nonsense."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Someone please get director Ric Roman Waugh a tripod! Snitch might be a passable action-thriller but it's hard to say because every time an action scene comes along, the image shakes so badly it's impossible to keep anything in view or focus."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The verdict on Snitch is that Johnson has attempted a career detour on a street marked Do Not Enter."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Unfortunately, Snitch is torn between being an ideological drama and a more traditional action film – and Johnson’s presence only contributes to the confusion."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 42,
      "summary": "The film tries to paint in shades of gray with vague criticisms of the war on drugs, but the absurdity of its he-man Everyman plot ends up turning its moral palette a muddy brown."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "Neither clever nor stupid enough to work."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "Good intentions are all but submerged in nonsense."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "This is the sort of movie that Charles Bronson would have made back in the day, and indeed a shot of Johnson standing in a sporting goods store, contemplating a wall of shotguns as he gets ready to get busy, could have come from any \"Death Wish.\""
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "All the talking would be fine, but the dialogue is preachy, the drama too earnest and the action kind of sluggish, though it's hard not to get a jolt when Johnson jumps behind the wheel."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Snitch is like watching an elephant on ice: inelegant, but you admire the effort."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "Snitch wasn’t going to be good no matter what Johnson did; it is so poorly directed that even Academy Award winner Susan Sarandon, playing a shrewish federal prosecutor, comes off as a hack straight off a soap opera."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "Though Snitch loudly announces itself as a social-issues movie, its nominal outrage over the severity of our nation's sentencing laws for first-time drug offenders is quickly subsumed by a jacked-up narrative of a father going to extremes to save his son."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "Snitch is just a big, dumb, ugly-looking waste of time, one that turns one of cinema's most charismatic heroes into a restless drone. As they say in the joint: snitches get stitches. But Snitch deserves to be put down for good."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "Snitch is the latest in a long line of films whose sole purpose is to flatten a major social problem into a pulp ideal for self-serious spectacle."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Snitch wasn't a bad movie. I just did not think it was as good as it wanted me to think it was. This is no \"Faster\" or \"GI-Joe\". Dwayne Johnson tries to play a simple man in over his head. Unfortunately his pecs the size of the Brooklyn Bridge make it a little less convincing. Like I said not bad, but compared to the abysmal spring 2013 movie season this thing is a masterpiece!!!!",
      "total_reactions": 3,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Let me start by saying that this is probably the best Dwayne Johnson performance in his career which is why its a shame that its in this monotonous crime thriller. Snitch is the story of what happens when John Matthews (Johnson) finds out his son has been arrested for distributing drugs. Matthews decides he must infiltrate a drug ring to bring someone to justice to truncate his sons prison sentence but this may ultimately ruin everything he has ever built. At the beginning of Snitch you are reminded that this is a film based on actual events and then these supposed real life people go on to do some of the most ridiculous things in the name of family and justice that you find it ever so hard to believe that this has any standing in reality. The film splits its time between two families, one being John's family, the other belongs to one of John's employees, Daniel (Jon Bernthal), an ex con looking for a second chance for him and his family. The film feels no desire to discuss or even talk about these characters lives or how they got to this place, instead it lets the viewer fill in the gaps thanks to vague hints dolled out in increments over the course of the film. This allows you to make your own story for them but it also changes very little to do with the film making it lazy storytelling at best. As stated above this is a film grounded by a strong central performance by Johnson but the films slow pace and nonsensical storytelling makes it impossible to enjoy as the characters don't do normal logical things and they have not really been given any character traits to suggest they might even consider doing this. The end therefore leaves you unsatisfied and if your anything like me, quite a bit confused",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This was a decent movie with a good story and realistic action sequences. At times it seems a little absurd (father with another daughter and wife going to such lengths for his son and ex-wife...) but overall I enjoyed it. Note that this is not an action movie but more of a drama.",
      "total_reactions": 1,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "It starts off telling a story about how a stupid pothead was setup by his friend and was caught by the po-po. The action scenes are similar to that of your typical action film like Die Hard. The effects were well done. Dwayne Johnson did a good job in this movie and it was nice seeing Jon Bernthal who did a great job in TWD. Overall a good film but nothing special.",
      "total_reactions": 1,
      "user": "BVGNOfficial"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Complete boredom. I tried so hard to get through this movie The Rock was so miscasted it is ridiculous. 5 Minutes of action in the entire movie and I think I may be pushing it.",
      "total_reactions": 1,
      "user": "WhySoSerious54"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Any film with Dwayne \"The Rock\" Johnson on the front cover inspires images of butt kicking and broken bones, however, this film appears to be an attempt to leave that behind and show the world that their is more to him than big muscles.",
      "total_reactions": 1,
      "user": "Oddsbodikins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This is a more genteel Dwayne Johnson than were used to and paired with the recent leap in his acting ability it's been good to see 'The Rock' alter ego finally (and successfully)go to the great Smackdown in the sky and the new and improved \"Thespian\" flourish. I've been enjoying (and occasionally cringing at) his action movies since he started acting. There has of course been other athletes who've tried and failed at the crossover but Dwayne Johnson has come up through the ranks and has made me take notice. Strangely, I just saw 'Faster (2010)' a few days ago for the first time, and was taken aback at his rock steady performance (no pun intended) doing an hard action movie with very little dialogue and saying more in those few words than all his other films put together. It was good and he's done it again. I remember thinking similar things about Mr Marky Mark and I think Mr Wahlberg is a tremendous actor now. I just remembered, Marky and Rock (Y?) were in 'The Other Guys' together, lol. It's been directed by former stuntman Ric Roman Waugh who gave us the reasonable prison flick 'Felon'. This is a more stylish movie than his others and he seems to be one of those people who has to work hard at his job. You know the way P T Anderson or Tarantino just seem to know where the camera should go? Well most need to start small and work up so were seeing Ric Roman Waugh about a third of the way up the directing ladder. He is purty promising though.",
      "total_reactions": 4,
      "user": "NavQ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Slow and tedious. Don't waste your money. 10 minutes of action at the end but before that it is a talking movie for almost the whole time. It feels like Dwayne Johnson fit this movie into his schedule. The script was hacked together by committee. Yes, I felt like I was ripped off. Don't pay good money, see it on TV if you are interested in a year.",
      "total_reactions": 5,
      "user": "nameless"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "I almost vomited from boredom.  Same plot as always.  Same cheap tricks.  When are these hollywood film makers going to start catering to smart, compassionate people?  They're oiling a machine that's destroying our planet.  Makes me sick, literally.",
      "total_reactions": 6,
      "user": "strapcharles"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Snitch is a great film, the badasses are setting aside the hot cars and woman but instead they are saving family in a badass way. Dwayne Johnson is awesome because of his pumped up muscles, I am a big movie fan and this guy is the best body builder ever leaving Arnold S. Ric Roman Waugh has said it's a true story, but I don't think this ever happened... Maybe he is right. Well overall, Snitch is a great edge of your seat ride. 8/10!",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Unbelievably great movie. Edge of my seat the whole way through. I thought it would be just a dumb funny action movie like The Rundown or something. Nope. The title, poster, marketing. Everything was a lie hiding a much more toned down, thoughtful piece. They're's maybe 12 minutes of action in it's almost two hour runtime. The rest of it is set up, slowly paced but intense. Films like this are why this guy is my favourite actor. He can make any terrible movie half way decent, but in a smart, well executed film like this he makes it great.",
      "total_reactions": 1,
      "user": "phildog"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "It's first act could use a little sprucing up, but everything else about this movie shines bright: colorful characters, thrilling action/tension, and a devoted lead performance from Dwayne Johnson.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "This is perhaps one of Dwayne Johnson's better movies and Susan Sarandon is good as district attorney Joanne Keegan. This movie adds emotion with hardcore action making it slightly better then most Dwayne Johnson movies. However it did start off slowly and it gradually started picking up and taking off to become a good movie. Overall it is actually a decent movie.",
      "total_reactions": 1,
      "user": "soren40"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"Snitch is no-where near originality or up to par with the Rock's other action flicks, but entertaining enough to the point where if you can get past the flaws, there are many, you may actually find enjoyment out of this easily forgettable action film.\"  B",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "This is a good movie, and a bit of a surprise.  It is well-acted and well-paced.  It sits somewhere between blockbuster and indie territory, which might explain the mixed reviews.  With that being said, it is an engaging drama and well worth watching.  It is very comparable to The Yards in feel and quality.",
      "total_reactions": 0,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Some movies are I find are over rated here on Meta Critic, some under rated.  I believe this movie is vastly under rated  for men. For women, I can understand why you might not like this movie. But for men... I believe most will enjoy it.  Suspenseful through out, good directing, good cinematography, and good editing. Chase scene is not over or under done  nice.",
      "total_reactions": 0,
      "user": "Orman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This isn't your typical action movie. You aren't going to see bullets constantly flying, you aren't going to hear cheesy one-liners, and the heroes aren't going to walk away unscathed. That's what makes \"Snitch\" so great. Dwayne \"The Rock\" Johnson gives a fantastic performance, if not occasionally lacking enough emotion, and Jon Bernthal (Shane from The Walking Dead!) is fantastic. The plot is realistic and really pulls you in. As a matter of a fact the whole movie is realistic, and that's what separates it from other movies and helps keep it tense and enjoyable. It's just a fantastic movie, the casting couldn't have been better, and constantly keeping you worried that not every character will walk away is something I haven't seen in many movies. \"Snitch\" is amazing and I highly recommend it.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "A teenager is wrongly accused of a drug distribution crime and faces 10 years minimum unless he can 'snitch' on the dealers, his Father (The Rock!) sets up a deal with the FBI to crack a Mexican drugs cartel to free the boy.",
      "total_reactions": 0,
      "user": "GeorgeVader"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "One of the few action movies I've seen recently that manages to make all the events seem plausible. Believable motivation and believeable action. Dwayne Johnson has a few \"off moments\" in regards to his acting but they are few & far between.",
      "total_reactions": 0,
      "user": "410MaXiMuS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Dwyane Johnson proves once again that he's become a surprisingly versatile actor and capable of being the leading guy in Snitch, a very good movie that was suspenseful, intense, and emotionally driven. Barry Pepper, Susan Sarandon, and formerly of the Walking Dead John Bernthal provide a great supporting cast but The Rock leads the way in a movie about how far a father is willing to go to protect his son. I wasn't a huge fan of some of the camera work and other cinematic effects but there's nothing overdone about this film and that's actually a good thing. The story develops well and is enough to keep you engaged without the need of excessive explosions or anything else. This isn't actually an action movie and just about any other quality actor could've played the role of John Matthews but as I said, the fact that Dwyane Johnson did it well shows how far he's come. Between his role in Fast & Furious 6, his recent comeback on WWE, his new shot on TNT \"The Hero\", and this leading role, Dwyane Johnson seems to be everywhere right now but he's performed his roles well so that's not a bad thing.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Had me intrigued till the preposterous and unnecessary action-heavy finale. And even though it gets a little preachy towards the end, this is some fine dramatic work and Johnson's performance is more than solid.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Better than I thought. It was a little slow but Johnson's puts up a fighting fatherly performance. The action kind of got drowsy but the main idea was decent.",
      "total_reactions": 0,
      "user": "jfrotylpe532"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "Snitch was a very disappointing movie.The best thing going for it is the Rock, nothing much besides him.It`s a low budget movie, that felt like a TV movie allot of times.I wanted to like it but it`s average at best.Honestly it`s of those movies Dwayne Johnson is just trying to prove hes more than an Action Hero.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "Snitch tries to show sympathy but ends up going off-topic with uneeded plot material.",
      "total_reactions": 0,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "first  off all i would like to state that i have nothing against dwayne johnson, i actually  appreciate his performance however",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "A pretty good film with really solid character development.  This is not a normal action film there is a lot of very dramatic moments.  Nothing special but it's just a solid film. B",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Snitch was very nice since it is based on a true story. It has a good plot and Dwayne Johnson is just the perfect person for that role. I rated it 9 out of 10 because it was a little bit complicated at its middle and there are some non-skilled cast in the movie.",
      "total_reactions": 0,
      "user": "movieaddict"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "Not a very good movie. Guys son gets tricked by his friend and as a result gets thrown in jail and the father makes a deal with authorities to go undercover and help them destroy a drug cartel. Very boring movie, drama. Not recommending it.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Not sure why this is getting a lot of negative reviews. Sure it is not going to win any oscars, but it's a solid thriller/action flick with the always charismatic Dwayne Johnson. A lot of thick suspense and great, et not over the top, action sequences. I enjoyed it.",
      "total_reactions": 0,
      "user": "clawlan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Not the action promised. Johnson had a mediocre performance, but the kid had a great performance, to me. I didn't really feel any suspense or thrill either.",
      "total_reactions": 0,
      "user": "kewlgeek555"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "Boring!  Most scenes shot in the dark. Not worth the money.  Dozed off during the first half.  Dwayne Johnson is better than this.  It's not worth rating.  If I had to I'd rate it \"D\" for DULL.",
      "total_reactions": 0,
      "user": "jayare"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "This movie was just a really long bore. I mean going into this movie I thought that this movie would be action packed and exciting but it was just the exact opposite. I mean The Rock's performance was not to good but John Bernthal's performance surpassed that of The Rock's in my opinion. All the movie is is just an hour long drug deal. The best part of the movie was the ending just because it has the most action in it and it is also a happy ending. Don't have too much to say on this one.",
      "total_reactions": 0,
      "user": "dark_mater97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "After hearing little about Snitch in the media, I wasn't sure if this was going to be a movie worth two hours of my life. As I was typing this review, I learned that the movie only made 42 million dollars in the box office. I was rather surprised by this considering Grown Ups pulled in a whopping roughly seven and a half times more than that. (300 Million)",
      "total_reactions": 0,
      "user": "AlexProductions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Good movie. Loved the sex scene and when Tom Cruise jumped from that really cool skyscraper and the rock just drove his truck through the building and it transformed into optimus prime and it was just really awesome 11/10 but the score only goes to ten.",
      "total_reactions": 0,
      "user": "SegY0l0m8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "It's intense and involving from the start, even when it turns preachy.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "There were a number of moments in this movie during which I was shaking my head due to their complete implausibility (one particular incident that comes to mind is a highway chase during which a man fires a shotgun one-handed out the window of an 18-wheeler truck while remaining in perfect control of the vehicle), but its quiet, intense handling of the subject matter and powerful performances are just enough to elevate it above typical action fare. Dwayne Johnson is always entertaining to watch on screen, but this was the first time (in a serious movie, at least) that I felt totally engrossed by one of his performances.",
      "total_reactions": 0,
      "user": "GerardistheWay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "Snitch was a good film to watch as it was a crime drama. It was about when John Mathhew's (Dwayne Johnson) son, was under arrest for selling drugs and the film tells you what happens in everyday life. A good part of the film is when John Matthew's son got pulled up by the police and eventually got arrested for illegal drugs trafficking.",
      "total_reactions": 0,
      "user": "jdw44"
    }
  ],
  "metascore": 51,
  "name": "Snitch",
  "num_weekends": 14,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 22,
    "month": 2,
    "year": 2013
  },
  "opening_weekend_income": 13167607,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 67214,
  "rating_freq": {
    "1": 740,
    "10": 4246,
    "2": 465,
    "3": 984,
    "4": 2427,
    "5": 7400,
    "6": 18346,
    "7": 21189,
    "8": 8833,
    "9": 2584
  },
  "release_day": 22,
  "release_month": "February",
  "release_year": 2013,
  "user_review_count": 122,
  "votes_per_demo": {
    "aged_18-29": 23400,
    "aged_30-44": 25721,
    "aged_45+": 5379,
    "aged_under_18": 132,
    "females": 5649,
    "females_aged_18-29": 2160,
    "females_aged_30-44": 2207,
    "females_aged_45+": 707,
    "females_under_18": 13,
    "imdb_staff": 7,
    "imdb_users": 67214,
    "males": 52220,
    "males_aged_18-29": 21031,
    "males_aged_30-44": 23231,
    "males_aged_45+": 4593,
    "males_under_18": 117,
    "non-us_users": 33903,
    "top_1000_voters": 358,
    "us_users": 9467
  },
  "year": 2013
}