{
  "avg_rating_per_demo": {
    "aged_18-29": 6.1,
    "aged_30-44": 5.7,
    "aged_45+": 5.7,
    "aged_under_18": 6.8,
    "females": 6.2,
    "females_aged_18-29": 6.3,
    "females_aged_30-44": 6.1,
    "females_aged_45+": 6.1,
    "females_under_18": 6.8,
    "imdb_staff": 5.5,
    "imdb_users": 5.9,
    "males": 5.5,
    "males_aged_18-29": 5.7,
    "males_aged_30-44": 5.3,
    "males_aged_45+": 5.6,
    "males_under_18": 6.5,
    "non-us_users": 5.8,
    "top_1000_voters": 4.8,
    "us_users": 5.8
  },
  "avg_screens": 987.3333333333334,
  "budget": 35000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 22,
    "month": 7,
    "year": 2011
  },
  "critic_review_count": 127,
  "duration": 112,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 39026186,
  "max_screens": 2904,
  "mc_avg_user_score": 5.2,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "Something Borrowed",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "The film is terrific: smart, sexy and funny."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Something Borrowed commits the most fatal mistake of all: Its characters are so deeply uninteresting that the audience can't get invested in their eventual happiness."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a testament to Goodwin's skill as an actress that we almost buy this."
    },
    {
      "critic": "Jody Mitori",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Doesn't break any new ground, but it is a decent way to spend a girls' night out."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Goodwin radiates probity and makes waiting almost look interesting, and so, for all the movie's awkwardness, it remains watchable."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "To paraphrase one of its few laughs, it's a zombie movie directed by Vera Wang."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Overlong and at times tedious; the taste is gritty and lingers unpleasantly."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "A genial cast and moderately funny script prevail over the sort of sappy music cues and white-bread settings that have become the grating norm in Hollywood rom-coms."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "All of the characters are treated sincerely and played in a straightforward style. It's just that we don't love them enough."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Fairly uninspiring, but it still manages to ingratiate itself, largely through the efforts of Krasinski in a secondary part."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "It's clear that Something Borrowed finds it easier to tell us about relationships than to show us them under way."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "If you have already begun to suspect that Something Borrowed may be something less than the sum of its parts-all of which do indeed seem borrowed from other movies and TV rom-coms too numerous to mention-you are right."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 45,
      "summary": "As horrific as Something Borrowed is, it's compelling in its own sick way."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 42,
      "summary": "Yes, perhaps the audience will like its favored couple more, but all the engineering that goes into making them sympathetic results in a film that feels agonizingly synthetic and alien."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "Despite the pretty overload and the smoldering blue-eyed handsome of Egglesfield, the heart-pounding, palm-sweating, heavy-breathing chemical reactions that should be causing major blackouts in Manhattan, where this story unfolds, are nowhere to be found."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "The most dispiriting thing about Something Borrowed is that with a little more art, craft and wit it could have been a lot better, maybe even good."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "Will anyone really believe in this GQ-perfect big man on campus who lacks the courage to ask her out on a date?"
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "This rom-com certainly has something old, something borrowed and something blue-the something new, however, is MIA."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "Doesn't so much borrow from other movies as settle into a comfort zone of raising provocative questions regarding love, commitment and marriage only to dismiss them with a brush of a hand as so much dandruff."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "Try as she might, Hudson can't turn Darcy into a three-dimensional character: She's astonishingly easy to dislike, but not nearly amusing enough in what could have been an unforgettable camp performance."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "Something Borrowed clinches it: It is not okay to sleep with the fiance of one's best friend. What's odd, and ultimately icky, is how enthusiastically the film attempts to justify doing so."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "It is fluffy, yes, but it also is ugly and annoying and something you neither want nor need."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "Bonds are tested and feelings hurt, but who really cares? The story takes predictable turns, embraces clichés and dodges all humor."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "I don't know whether she's (Hudson) drunk, stoned, or simply out of her mind, but if it weren't so sad watching her pick away at this skimpy, overlong romantic lie, she might be entertaining."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 38,
      "summary": "Thank heavens Krasinski, at least, had the screenwriter's ear. He makes every one-liner land. \"The Hamptons are like a zombie movie directed by Ralph Lauren.\""
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 33,
      "summary": "Soul-sucking romantic comedy."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 25,
      "summary": "The sisterhood is already grumbling about a movie that suggests women will happily choose a mate over friendship, but actually it's the stereotypes of good behaviour rather than bad that bring this rom com crashing down."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 25,
      "summary": "Something Borrowed is a romantic comedy in which absolutely no one deserves to end up happy."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 20,
      "summary": "Even if you've got a soft spot for silly rom-coms, know that this one is as empty-headed as it gets."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 12,
      "summary": "The half-star rating goes to John Krasinski for heroically rising above this vile dung heap of a movie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Three months into rehearsals, indie stalwart Sarah Polley bowed out from \"Almost Famous\" where she was was set to play the role of a legendary rock groupie. Citing her own personal realization that she wasn't the sort of girl who could light up a room as the reason for quitting on the spot, Kate Hudson(originally slated to play William Miller's sister Anita) took over the role of Penny Lane from the maverick actress, parlaying this piece of manna from heaven into an Academy Award nomination. Polley was wrong, of course. She could be an aurora, if pressed. During the rave scene in \"Go\", the moviegoer sees what would turn out to be a rare occurrence, the sight of Polley having fun, no less, dancing, which must have convinced Crowe that he had found his main Band Aid. Although the illumination in the warehouse is minimal at best, Polley manages to move above the darkness of the dance floor. You could say she lights it up. While the official record shows that it is Hudson who adroitly demonstrates(in a scene which may have intimidated Polley) the ability to be the center of attention, a life force, when she brightens the natural light in a hotel room hootenanny with her best stewardess imitation(\"Ladies and gentleman...), the body of work the slumping actress has produced since her 2000 star-turn suggests that the director of \"Away From Her\" might have been equally up to the task. By some fluke coincidence, in \"Desert Blue\", Hudson, playing a Hollywood actress who befriends a group of rural outback kids after the two-bit town gets placed under quarantine, asks her newfound friends, while huddled around a campfire, \"What if this is our last night? What do you want to do?\" Skye promptly kisses Blue. Polley, as Nicole Burnell, sits down with her dysfunctional family for one final disquieting supper, in  \"The Sweet Hereafter\", a movie about the last night on earth,which takes a decidedly anti-Hollywood approach to an impending catastrophic disaster. In retrospect, it's a pity that Hudson couldn't simply borrow Penny Lane, then give the role back to its rightful owner. With each passing year, Hudson seems to be incrementally becoming famous for being famous. If Sarah Polley was a household name, she would be known for good movies, not disposable junk such as \"Something Borrowed\", yet another forgettable entry in a long line of bad rom-coms for this one-time ingenue. In \"Bride Wars\", like Rachel, a successful defense attorney, who, at thirty, feels as if she's fast becoming an aging spinster, the best friend, Emma, a schoolteacher, fights back, when a similarly aggressive Hudson character behaves badly. \"Something Borrowed\" has the slight advantage of being less cartoonish than \"Bride Wars\", but Hudson, more or less, remains the same. Angry over Emma's disinclination to reschedule her Plaza wedding after an unfortunate same-day double-booking, Liv throws down the gauntlet at the schoolteacher's spray tanning session, whose outcome results in the lawyer's oldest and dearest friend looking either like an Oompa Loompa, or Q-Bert. The association should end right then and there, as it would in real life, but the war escalates to epic proportions, concluding with Liv's original plan to play an incriminating spring break DVD of Emma during the actual ceremony, come to fruition. This time out, it's the best friend who's in the law profession, but Rachel is no more smarter than Emma, as evidenced by her continuing friendship with Darcy, even though she had intervened on a perfect love match. In pertaining to the girlfriend switcheroo at that long ago bar booth, a date which should live in infamy from Rachel's vantage point, the film seems to be under the pretense, however naively, that Darcy unwittingly stole Dex away from her alleged best friend. Rachel, as written, is so stupid, rooting for this willing doormat proves to be a chore. The moviegoer waits in vain for an epiphany in Southampton. Alas, Rachel never figures out, because \"Something Borrowed\" never admits, that Darcy's poaching was a calculated act. In any other case, nine months of incessant talk about one guy would present itself as an indication to most best friends that their closest confidant is unequivocally in love. Without this knowledge, the affair Rachel has with Dex gets weighed unfairly against her. Morally, it would still be wrong, but not indefensibly so. When Darcy asks Rachel to write her wedding vows, \"Something Borrowed\" recalls the play \"Cyrano de Bergerac\", which perhaps reveals the film's problem may lie in its umpteenth presentation of the old \"Pygmallion\" trope. Whereas Cyrano had a large nose, Rachel wore unflattering glasses back in law school as an explanation for her feelings of inadequacy. Now, as a finished product, a transformed beauty, Rachel should address what went down the night that Darcy asked Dex out, but the torrid argument only covers the second betrayal.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "Unfortunately this is a movie about regular people, being DUMB, if I wanted to watch that I could just go to the local mall. There is only one character worth a salt and the rest are all poorly written people that lack basic communication skills, any sort of concept of consequence and selfish jerks. The ending was absolutely awful no catharsis, no conclusion, it is just a bunch of people that are going on to the rest of their lives as stupid selfish people.",
      "total_reactions": 1,
      "user": "Carnaged"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "This movie could have been written by a grade 9 drama class (read: exactly the wrong thing happened to everyone) There were continuity errors, awkward unexplained slow motion dances, and is it just me or does time not work in this movie? It jumped seemingly with out reason through seasons (the first half was before July 4th and the movie ended when it should have been 5 months later, but it was somehow still summer in Manhattan?!?!? ((help))). The lines were laughably predictable but the plot was shockingly wrong, not in a quirky indie way, but in a psychological is-this-going-to-make-me-insane way. I honestly was expecting all of them to take off their human masks and be lizard people and talk to me through the screen by name. All in all it was just so so so so so bad.",
      "total_reactions": 1,
      "user": "qwertymt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "It was so bad. Don't watch it. No no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no no.",
      "total_reactions": 2,
      "user": "1234567890"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Absolute non-sense, stupid story, non-ethical, no friendship values, bad talking, rude words. Rachel (Ginnifer Goodwin) steals her best friend, Darcey (Ginnifer Goodwin) , fiancee, Dex (Colin Egglesfield), after sleeping with him at the end of her 30th birthday party, while the friend, Darcey, cheats her fiancee with another one, Marcus (Steve Howey), and get pregnant!! Two more characters appear to waste more of our time and increase boredom, Ethan (John Krasinski) and Claire (Ashley Williams). If you have nothing to do, go eat some pizza.",
      "total_reactions": 3,
      "user": "Hfahmy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Basic premise: Rachel drunkenly sleeps with her best friend's fiancee, a man she's been in love with since law school. Rom-com complications ensue. The two points are for John Krasinkski who is the only funny or likeable character in this whole mess of a movie. Even the normally charming Ginnifer Goodwin, playing Rachel, whom one assumes is supposed to be the \"intelligent everygirl\", comes across as just a whiny doormat. Even more obnoxious is Kate Hudson (oh, how long it has been since Almost Famous) as Darcy, her \"BFF\" (though any symptom of actual friendship between the two of them is completely devoid from this movie) who is so **** and self-centered that it's a wonder she has a fiancee for Rachel to steal. Speaking of whom, Dex the fiancee is so bland, spineless and lacking in any personality what-so-ever that it's hard to believe he has even one girl fighting for him-- let alone two. Best line of the whole movie: \"The Hamptons are like a zombie movie directed by Ralph Lauren.\" There. Now you have not even one excuse to go see this charmless bore of a movie.",
      "total_reactions": 3,
      "user": "RogueGhost"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "I think that this movie was a romantic comedy. I loved watching this movie i could watch it all day. People say that it was a bad movie but how many or you people could write a movie like that ? It was a wonderful movie that I think she be rated 10 outta 10. Maybe not the best movie for kids because of the sexual things :) Loved it ! wouldn't mind a part-two to the movie.",
      "total_reactions": 3,
      "user": "Billie16rocker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I don't know what all the negative vibe for this film is for. I'm a 18 years old man and I enjoyed this movie. I work at a movie theatre and I took my mom to see this for mother's day and i thoroughly enjoyed it. If you absolutely hate love movies with romanticism and drama then maybe not the movie for you but if you can deal with it a little bit, it is worth seeing, this movie was funny, dramatic, and exciting. I thought some of the acting was a little bad and the writing could've been better but overall a 7/10 for me, this was a good enjoyable film, if you get a chance to see it before it leaves the theatres then its worth a watch, if not, order it on demand or red box it because it is worth your time.",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "i feel depressed after watching this. What about Ethan? Why did she end up with a spineless a-hole. I admit Dex is not the devil but he made his choice. Rachel just picked up her best friends leftovers.  Ew! Sloppy seconds!",
      "total_reactions": 1,
      "user": "dirtymag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "The only redeeming quality of this film is that the actors are so watchable.  Biggest critique someone tell Kate Hudson and Ginnfer Goodwin to not dance in film anymore.  They got no rythmn.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I did enjoy it; nevertheless, I understand why some people wouldn't. I am myself not into flick chick's stuff, even though I am a girl myself...but there is something about this movie that kept me watching it... I found it engaging, and easy. They used the typical antagonistic stereotypes of the 'crazy, popular girl' and the 'cute, smart, shy girl'. Darcey (Kate Hudson)was a bit too much for me. Her character is utterly egocentric , loud, cheap, and shallow; at times, however, she shows this loving side with Rachel..(Ginnifer Goodwin). On the other hand, Rachel is soothing, sweet, quiet , conservative, noble and at times frail..she is doing something is not considered 'ethical' and she knows it, but wouldn't her choice- mo matter what that is- hurt someone anyway?.  Dex can be frustrating because he appears to be weak and indecisive, yet none of them is 'bad' or 'good' they are just real people facing a big emotional issue and in this case, either if something is done about it or not, they know someone will get hurt. I guess you have to watch this movie taking as it is : a simple, romantic story, with fairly stereotyped characters, and not overly witty. Don't expect a moral lesson, or ethics, because a movie is not meant to teach that, and don't we have all different perspectives about how  to deal with things?. You may question the values of the characters of this movie...but remember it is not real life (although, situations like this definitely happen in life...who are we to judge?). Finally, be ready for a bit of that 'corney' stuff that most of romantic American comedies are filled with. Personally, I wouldn't label this as a 'comedy'. I think you will have a good time watching it, if you lower your expectations a bit... and do not expect great rhetoric, moral lessons or philosophical treatises...( I love them, but I do not expect them on this kind of films)",
      "total_reactions": 0,
      "user": "RegOz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "It's not often a film comes along that could have potentially mirrored my own life. A shame, then, that almost every character came across as unlikeable, to the point that I honestly didn't care what happened to any of them. Only John Krasinski provided entertainment in his supporting role. Oh, and some of the shots were well coloured, I suppose.",
      "total_reactions": 0,
      "user": "Sidasta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The film in general is bad, bland, but entertaining. The end of the film is depressing.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "Great actors. But by far the worst romantic movie ending I've ever seen. I do not believe it is a movie worth seeing, it leads you on but does not give a sufficient ending. Horrible. It just does not end the way it is suppose to. Drives me nuts.",
      "total_reactions": 0,
      "user": "Isayanna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The work of the lead trio keeps the movie from ever becoming something blue.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 36,
  "name": "Something Borrowed",
  "num_weekends": 12,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 5,
    "year": 2011
  },
  "opening_weekend_income": 707863,
  "opening_weekend_income_currency": "£",
  "rating": 5.9,
  "rating_count": 49588,
  "rating_freq": {
    "1": 1644,
    "10": 4501,
    "2": 1318,
    "3": 2109,
    "4": 3692,
    "5": 7607,
    "6": 11314,
    "7": 9142,
    "8": 5559,
    "9": 2702
  },
  "release_day": 6,
  "release_month": "May",
  "release_year": 2011,
  "user_review_count": 155,
  "votes_per_demo": {
    "aged_18-29": 22404,
    "aged_30-44": 16718,
    "aged_45+": 3146,
    "aged_under_18": 104,
    "females": 27177,
    "females_aged_18-29": 16331,
    "females_aged_30-44": 8574,
    "females_aged_45+": 1136,
    "females_under_18": 90,
    "imdb_staff": 5,
    "imdb_users": 49588,
    "males": 16209,
    "males_aged_18-29": 5850,
    "males_aged_30-44": 7938,
    "males_aged_45+": 1960,
    "males_under_18": 13,
    "non-us_users": 24862,
    "top_1000_voters": 272,
    "us_users": 9551
  },
  "year": 2011
}