{
  "avg_rating_per_demo": {
    "aged_18-29": 6.8,
    "aged_30-44": 6.6,
    "aged_45+": 6.5,
    "aged_under_18": 7.6,
    "females": 6.7,
    "females_aged_18-29": 6.7,
    "females_aged_30-44": 6.6,
    "females_aged_45+": 6.4,
    "females_under_18": 7.2,
    "imdb_staff": 7.4,
    "imdb_users": 6.7,
    "males": 6.7,
    "males_aged_18-29": 6.9,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.5,
    "males_under_18": 7.8,
    "non-us_users": 6.6,
    "top_1000_voters": 6.0,
    "us_users": 6.9
  },
  "avg_screens": 27.666666666666668,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 22,
    "month": 6,
    "year": 2012
  },
  "critic_review_count": 137,
  "duration": 85,
  "genres": [
    "drama",
    "mystery",
    "sci-fi"
  ],
  "gross_income": 405614,
  "max_screens": 48,
  "mc_avg_user_score": 7.4,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Sound of My Voice",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 27,
  "mc_pro_critic_reviews": [
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 90,
      "summary": "Sound of My Voice offers promise and pay off at the same time. Star and writer Brit Marling is having a rare double-whammy of a debut."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 88,
      "summary": "This clever, low-budget film kicks the concept up a few notches to mesmerizing."
    },
    {
      "critic": "Alison Willmore",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "Like \"Martha Marcy May Marlene,\" Sound Of My Voice plausibly demonstrates how someone's sense of self and certainty can be eroded, and like \"Another Earth,\" it was co-written by actress Brit Marling, a melancholy, luminous presence as the group's leader."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "Sound of My Voice doesn't follow through on everything it sets up, yet it has a hushed and revealing psycho-intensity. It also has an oh-wow Twilight Zone ending that truly made me go, ''Oh, wow.''"
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "Open-ended and decidedly un-Hollywood, it is faintly dissatisfying, especially coming on the heels of such as engaging and crisply presented story. But it offers movie-goers a wonderful opportunity to roll it all around in their heads and discuss it, even debate it, as they drive back to that cozy little cult compound they call home."
    },
    {
      "critic": "Rob James",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 80,
      "summary": "Like \"Martha Marcy May Marlene,\" this lo-fi psychodrama reaps the benefits of a mesmerising female lead, only this time as cult leader not disciple. Marling continues to impress."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 80,
      "summary": "Creepy, confounding and more than a little curious. It's also quietly compelling."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Sound of My Voice has such creepy-crawly, brain-tickling energy that I wanted a much bigger payoff out of the final collision of all these people and episodes. Maybe they're saving that for the sequel."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Now Batmanglij and Marling deliver another terrific and engrossing venture into speculative fiction, Sound of My Voice."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "Two documentary filmmakers infiltrate a mysterious cult, only to find themselves drawn into the leader's insidious grip, in the taut, compelling low-budget feature Sound of My Voice."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Denham impressively captures Peter's flintiness, rendering him sympathetic yet not quite likable, and Vicius is just right as the wary Lorna."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "It's as much a satire as a mystery, a film as much about art as it is about faith."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "The Sound of My Voice never precisely declares whether her story is true. Without going into detail, I can say that the film never precisely declares anything to be true."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 75,
      "summary": "An economical thriller, both narratively and budgetarily, Sound of My Voice serves up moments of extreme dread and discomfort, but works a winning undercurrent of playful absurdity into the material as well."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The star of Sound of My Voice is co-screenwriter, female lead Brit Marling, who plays Maggie with melancholy, amusement and scorn. Compulsively watchable, she can change who we think she is by simply turning her face. In profile, she's Vanessa Redgrave. Laughing, she becomes Debbie Reynolds. Marling might become a great character actress. Let's hope the movies use her well."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "A smart, effectively unsettling movie about the need to believe and the hard, cruel arts of persuasion."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "The movie explores the basic debate over faith, the idea that we can feel a sense of relief in cynicism realized and turn around and face the horror of our lack of faith in the next moment."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "With storytelling economy and dramatic precision often missing from today's independent films, Batmanglij augments the building blocks for a nifty paranoid thriller with sharp commentary on our faction-centered society and the pitfalls of reinvention."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "The film is thin and mannered, even though many of the mannerisms are intrinsic to its shrewd vision of cult behavior. There's no arguing, though - and who would want to? - Ms. Marling's extraordinary gift for taking the camera and weaving a spell."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "Batmanglij keeps the movie even-keeled, full of medium close-ups, underscored by ambient plinks and shimmers, with nothing to break the trance until a last scene that upends everything we thought we knew."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 67,
      "summary": "The movie is directed with real confidence by Batmanglij. He lets his actors breathe, builds suspense in one group-purge brainwashing scene, and lets the mystery unfold in an immersive way that's probably a bit more compelling than its actual scripted payoff deserves."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 63,
      "summary": "This visually engaging, well-acted story held me for an hour as tightly as anything I've seen this year. But as we neared the climax, I realized only a miracle could resolve the contradictions of the tale – and we didn't get one."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "It's hard to say whether Sound of My Voice is a wholly bogus and pretentious indie enterprise or a weirdly compelling bit of low-budget storytelling."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Despite some tough-to-take moments, this challenging, smart movie is worth the trip."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "Ambiguities trump answers, and possibly even logic. For those who aren't burdened by such things, the loopy, off-kilter pace and frontal-lobe frying provide their own  unconventional pleasures. It's a cult film, in more ways than one."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "Given the number of real-world cults that have ended in major bloodshed, there's some irony - and no small narrative coquetry - in any drama on the subject that ducks out so pointedly at the finish."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "In the end, the film doesn't add up to much of anything, but its individual parts are sometimes greater than its whole."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Holds your attention for a while, but fails to build much suspense as it races toward a predictable climax. It probably would have worked better as a series of Webisodes, which reportedly was the original plan."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 50,
      "summary": "Does it matter that Maggie might be a charlatan if she's truly capable of helping people? That's the film's most intriguing, and open-ended, question - not the more gimmicky one that will leave you hanging, and probably disappointed, at the end."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 40,
      "summary": "The bland, jittery visual \"realism\" can't counteract overheated performances of tin-eared dialogue, which strain for pulp but often land at soap."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "This is a well-acted but ultimately disappointing film, that leaves one too many significant plot questions unanswered.  Also, at times the pacing gets painfully slow.  Of course it is not necessary to resolve every issue raised in a plot, but leaving so many loose threads can be indicative of weak writing, rather than an effort to create mystery.",
      "total_reactions": 1,
      "user": "DTDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "The single most overlooked film of the year. Not enough people went out to see it (i saw it 3 times in theaters) and those who saw it, could not appreciate Brit Marling's performance. After seeing Another Earth and now Sound of My Voice i know Brit Marling is one of the best actresses out there. A must see for any fans of things like twilight zone as well.",
      "total_reactions": 1,
      "user": "AngusMilne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "A very low key movie, but a very good movie.  The concept of a cult leader from the future is interesting and the film plays it at a very serious and somber level.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "I Love this film! I have done a lot of research about it's meaning and refused to settle for ambiguity\". If you want to look deeper research Greenbaum Cult  Manchurian Candidate /CIA Mind control. It will explain a LOT about the confusing scenes  the little girl Abigail... the Police Officer searching room for bugs.",
      "total_reactions": 1,
      "user": "LPickers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Outside the train car, on a platform, a mysterious blonde woman lights Bennett Marco's cigarette, then says, \"Maryland is a beautiful state.\" The sound of Rosie's voice makes the major her hostage. He would eat earthworms; he would vomit up an apple. Similarly, in Sound of My Voice, Peter becomes a Manchurian Candidate of sorts, when Maggie lights a cigarette, and asks him to commit a crime. Her followers aren't formally brainwashed like the infantry platoon in the 1962 John Frankenheimer film, but it's close. This supposed time-traveler, when coaxed into singing a popular song from 2054, chooses The Cranberries' \"Dreams\". Rather than point out the incontrovertible fact that the Dolores O'Riordan-sung hit is, in fact, an oldie, Maggie's adherents join in the sing-a-long, with the exception of Lam, who is through with magical thinking, and pedantically points out to his guru the era in which \"Dreams\" came out. Angered by being put on the spot, Maggie ousts the skeptic from the \"cult\". The challenge to her validity as a futurist agitates Maggie, and in that instant, the mystique she had imposed on the group is lost, thereby reducing the charismatic time traveler into a dangerous flake. As way of explaining the gaffe, Maggie explains that \"Dreams\" had been made popular again by a performer from her time. Without any CDs or MP3's, presumably destroyed in the alleged civil war, it's plausible that she wouldn't know the 60-year-old song(for her) was a cover, or plagiarized. Singing a well-known song from the nineties either makes Maggie a dumb blonde, the charlatan that documentary filmmakers Peter and Lorna purport her to be, or the real McCoy, a woman from a dystopian future, who, in all likelihood, is on a mission that has something to do with the preservation of the time line. If Maggie was a fraud, wouldn't she have anticipated such an occasion, and prepared an original, or obscure song, to prove herself? In The Manchurian Candidate, Rosie says, \"I was one of the original Chinese workmen who laid the track on this stretch,\" making her sound like a time traveler. Is she preparing Marco to be the next terminator, in the event that Raymond fails? Unfortunately, Sound of My Voice ends before things get interesting, just when the film reveals itself to be a feminized version of James Cameron's The Terminator. Maggie's mother, the little girl whom Peter, a teacher, kidnaps during his class field trip to the museum, needs protection from some nefarious force that doesn't want Maggie to be born. It's a variation on the premise from the 1984 thriller, in which Reese, knowing that the fate of his post-apocalyptical world depends on Sarah Connor's survival, shadows the buff cyborg, as man and machine fight over conflicting potentialities: the making or unmaking of John Connor, the future's only hope. First-person narration aside, susceptible as it is to fallibility, nevertheless, Maggie's story begins in a bathtub, submerged in water, without a stitch of clothing, which just happens to be the state of dress for Reese and the Terminator unit when they manifest themselves on the street in a downpour. Captured by police, Reese explains to the criminal psychologist in an interview that \"nothing dead will go through\" the time-displacement machine. Silberman wants proof, just like Lam. Maggie, stricken with amnesia upon her arrival, has no artifacts to orientate her, since, apparently, the quantum physics that is applicable to this diegesis shares the same properties as Reese's world. But Maggie has a memento, a tattoo. The ink on her ankle is intrinsic to projecting what the film leaves to your imagination. The 54 inscribed on Maggie's skin stands for the year 2054, references The Terminator(in addition, the anchor could be a Titanic denotation), in the sense that 27, as in 2027, the year of the rebels' victory and subsequent cyborg's revenge, numerically connects the two films through a proper factor. Without Reese's protection, Sarah becomes an easy target for the hyper-violent android. If she dies, the machines win. In Sound of My Voice, the climax suggests that Maggie is a revolutionary, not your garden variety cult leader, who, by the look of things, completes her mission. But what is that mission, exactly? If the Cameron film is a template for understanding the film, there must be a terminator who wants the mother dead. When Lorna plays informant for the black detective, she leaves the girl exposed, as Maggie, her adult daughter, gets dragged away in handcuffs. But is this woman really the law? We only see her in the field. There's no one to verify Maggie's alleged crimes and aliases. Arguably, the black detective is the terminator. Although Maggie, lies, it's a white lie; she's not hiding from the sun; she's hiding from her enemy. Labeled as a \"militia\" by the detective, Maggie's group could better be described as a resistance. The black detective will be back.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "My love for this movie is based on the fact that it leaves things very ambiguous, I don't need full story lines explaining every single little detail. I need my imagination to fill in the blanks. It was shot very low budget like the movie primer and it make me love indie cinema. If you like seeing the whole story, and you like having answers, this movie isn't for you. This movie is a romantic movie about what you believe in, or don't believe in. This is a perfect date movie, you will learn more about your significant other than any other movie.",
      "total_reactions": 2,
      "user": "westondeboer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 2,
      "text": "Is Maggie (Brit Marling) a 23 year old woman from the year 2054 or is she a scam artist on the run from the FBI?  Is 8 year old Abigail (Avery Pohl) her mother? And why, and with what, does her father inject her foot with every night?  Does each member, of what might be a cult, really have to learn that handshake that is so complicated were the actors chosen only by those who could accomplish it?",
      "total_reactions": 3,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Have to admit I'm fascinated by Brit Marling and how she wrote 2 scripts at the same time to produce 2 very intriguing films. She's quite mesmerizing on screen. I loved how the viewer is slowly drawn into this mystery and its trippy sc fi element, where you're never quite sure what's going on until the end and then ? Very impressive little indie movie. I wonder what she will come up with next.",
      "total_reactions": 0,
      "user": "movieboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Sound of My Voice is a decent execution to a rather intriguing premise that does have some tense, a nice pace and good acting from Brit Marling as the enigmatic Maggie. It was an enjoyable film that sadly feels like a TV-movie and could have provided a little more, but overall  Sound of My Voice is good.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Slowly builds to a climax that flips everything you know on its head, this is a wonderfully mysterious film with understated performances and interesting messages about truth, loyalty, and honesty.  Another example of Brit Marling delivering a top-notch story from her writer/actress perch.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "What I saw on screen was excellent. I am more annoyed at the film for what I didn't see on screen. I was not expecting such an ambiguous ending. I am perfectly happy for a movie to leave some things to the imagination, but I don't think it was executed well enough in this particular case. Aside from the sour taste it left me with, causing it to drop 2 points, I still loved this movie very much and am really forcing myself not to elevate it above a 7",
      "total_reactions": 0,
      "user": "El_Jacko"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "I like a film that requires an open mind. This is the case with this compelling look into cultism; which due to its sometimes contradicting plot points, can leave you scratching your head. Nevertheless, its mysterious nature is what makes this otherwise bland affair, entertaining.",
      "total_reactions": 0,
      "user": "Joellemm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Really interesting movie. wasn't what I was expecting and I felt like it was really well acted. Different but a good different. Totally crazy idea and sad that people in this world fall for this kind of s#!t all the time.",
      "total_reactions": 0,
      "user": "Stargirl04"
    }
  ],
  "metascore": 67,
  "name": "Sound of My Voice",
  "num_weekends": 9,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 27,
    "month": 4,
    "year": 2012
  },
  "opening_weekend_income": 36134,
  "opening_weekend_income_currency": "$",
  "rating": 6.7,
  "rating_count": 16951,
  "rating_freq": {
    "1": 319,
    "10": 941,
    "2": 203,
    "3": 336,
    "4": 649,
    "5": 1604,
    "6": 3503,
    "7": 5145,
    "8": 3139,
    "9": 1112
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 71,
  "votes_per_demo": {
    "aged_18-29": 4923,
    "aged_30-44": 7737,
    "aged_45+": 2001,
    "aged_under_18": 17,
    "females": 3071,
    "females_aged_18-29": 1343,
    "females_aged_30-44": 1269,
    "females_aged_45+": 327,
    "females_under_18": 5,
    "imdb_staff": 6,
    "imdb_users": 16951,
    "males": 11867,
    "males_aged_18-29": 3520,
    "males_aged_30-44": 6346,
    "males_aged_45+": 1639,
    "males_under_18": 12,
    "non-us_users": 9047,
    "top_1000_voters": 212,
    "us_users": 3594
  },
  "year": 2011
}