{
  "avg_rating_per_demo": {
    "aged_18-29": 5.7,
    "aged_30-44": 5.6,
    "aged_45+": 5.9,
    "aged_under_18": 5.3,
    "females": 5.8,
    "females_aged_18-29": 5.7,
    "females_aged_30-44": 5.7,
    "females_aged_45+": 6.3,
    "females_under_18": 5.5,
    "imdb_staff": 8.0,
    "imdb_users": 5.7,
    "males": 5.7,
    "males_aged_18-29": 5.7,
    "males_aged_30-44": 5.6,
    "males_aged_45+": 5.9,
    "males_under_18": 5.4,
    "non-us_users": 5.7,
    "top_1000_voters": 5.4,
    "us_users": 5.8
  },
  "avg_screens": 5.4,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 11,
    "month": 11,
    "year": 2011
  },
  "critic_review_count": 114,
  "duration": 105,
  "genres": [
    "crime",
    "drama",
    "history"
  ],
  "gross_income": 45282,
  "max_screens": 10,
  "mc_avg_user_score": 6.4,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "Texas Killing Fields",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 8,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "Applying Dad's directorial style of sweaty closeups, prowling telephoto shots and an ominous electronic score (by ex-Tindersticks member Dickon Hinchliffe), the younger Mann has dished out a meaty drama with familiar ingredients from the Law & Order kitchen but a distinctively bitter taste."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 70,
      "summary": "It's an intriguingly murky B-movie that should satisfy genre buffs."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Without \"The Wire\" and its like as a point of comparison, Texas Killing Fields might seem the natural heir to a gritty '70s cop drama. But with great contemporary TV around, it seems strangely incomplete."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "The plot is a chaos of underdeveloped relationships and frayed loose ends, but every so often, Mann does something so right that it makes this seem less a matter of narrative disorganization than a commentary on the anarchy intrinsic to any investigation."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 60,
      "summary": "When it comes to scenes in which characters are asked to say more than two words, however, the filmmaker's a decided amateur; Moretz, in particular, seems hopelessly stranded as the attitudinal wild child."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 55,
      "summary": "Moretz brings some natural gravity to a role that hasn't been adequately fleshed out."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Michael Mann was one of the producers, and his daughter Ami Canaan Mann directed; a couple more Manns fill out the credits, which makes you wonder why they couldn't just have a nice picnic and softball game at a state park somewhere."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The story simply doesn't stand up, with its combination of well-worn plot elements and confusing red herrings -- or maybe they're just details that don't add up."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Texas Killing Fields begins along the lines of a police procedural and might have been perfectly absorbing if it had played by the rules: strict logic, attention to detail, reference to technical police work. Unfortunately, the movie often seems to stray from such discipline."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Basically \"csi: East Texas,'' the debut feature of Ami Canaan Mann is long on style and short on coherent storytelling, not unlike numerous efforts by her director dad, Michael, who serves as a producer here."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Ms. Mann (Michael's daughter) does stage a bracing car chase, and Mr. Morgan makes an impression despite a story that's sometimes hard to follow."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "The younger Mann goes through the motions of a gritty murder mystery with plenty of technical proficiency but only a modicum of soul. The Mann touch is not only in the DNA of the director but in her movie, which inadvertently makes the case that atmosphere is more hereditary than innovation."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Texas Killing Fields's mood is one of drowning in quicksand, though said atmosphere is the byproduct of both Ami Canaan Mann's often dreamy direction and an editorial structure that intermittently devolves into elliptical incongruity."
    },
    {
      "critic": "Neil Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "A just-OK second feature from Ami Canaan Mann – daughter of Michael Mann, one of two credited producers here – and the latest outing for \"Avatar\" and \"Clash of the Titans'\" Sam Worthington."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "As good as Worthington, Chastain, Moretz and Morgan can be as they try to untangle the morass and the menace - and get caught up in it - they just can't quite pull it off. The real killer, sadly, is the script."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Script by former DEA officer Don Ferrarone isn't that bad in itself, but matters aren't helped by the mumbled performances and poor sound, which make it hard to hear what anyone's saying, while sloppy editing wreaks havoc on the story."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 20,
      "summary": "Rote, dull and point-blank obvious."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Sloppy and confusing, this movie just didn't know what it wanted to be. Midway through I knew it wasn't going to right itself again and at least in that respect it didn't disappoint.",
      "total_reactions": 1,
      "user": "24fps"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Does this movie satisfies the requirements of the genre? Yep. The Genre being: Methodical Crime Thriller. The movie is not slow: It takes its time setting up ambiance and characters, and strives for gritty realism. So expect that, and you will find a nice thriller with a wicked story.",
      "total_reactions": 1,
      "user": "dhunter_12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Despite it's chase scene and ambush scene. Texas Killing Fields is dead. It suffer uneven pacing, confused script, to many plothole and bad acting from its stellar cast.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "Dull, Dull, Dull. A Terrific waste of time. Terrible plodding storyline that failed to deliver on any front. The movie ended with me wondering what the point of it all was.",
      "total_reactions": 0,
      "user": "karma_karl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "Texas Killing Fields is a movie that should have been a TV series instead. There is way too much going on here for a simple two hour movie, leaving things confusing and unsettled. Based on a true story, Texas Killing Fields tells the story of an area outside of Texas City known as the highway to hell. Since 1970, more than 60 bodies have been found dumped in this desolate area and most of the crimes have never been solved. This film follows the arrival of a New York City Homicide Detective, who has moved to the area and starts investigating a recent series of crimes. If this film had stuck to the story, it would have been terrific, because there was a lot to work with. Instead, the film jumps between three different crimes, in two different jurisdictions, which leaves a team of detectives separated and working on their own things. There is absolutely no background story on the detectives, the victims, the suspects, or the fields, and when the cops are talking to people, it feels like you've missed a whole lot of background information. Everyone knows everyone in these small towns, but the writers seem to have forgotten that we don't know anyone and were left extremely confused. There are a dozen suspect and a new victim every half hour. With each cop working on his own, we are thrown back and fourth to the point where the film becomes unwatchable. Avatar's Sam Worthington stars and as with that film, he's really nothing special. The guy is an interesting side character at best, but definitely not ready to be starring his own film. His partner is played by Jeffery Morgan, who eerily looks like he could be Javier Bardem's twin. Morgan was somewhat better than Worthington, but again the performance was uneven and hard to judge, because it was simply impossible to keep up with what was going on. Texas Killing Fields had a real life story to play on, but too many good ideas for it's own good. The producers try to pack in as much as they could into 105 minutes, which wasn't enough time to tell the story, and left the audience scratching it's heads.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "While we are watching Texas Killing Fields, our mood keeps changing in a very strange, uncontrollable way. We are bored, interested, bored, surprised, and unfortunately, bored again. Maybe this is the fault of clumsy directing, maybe of annoyingly simplified screenplay... and maybe of both of them.",
      "total_reactions": 0,
      "user": "Horlan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The film tries to be good with no success. It's a pity as the story is good and the actors  Chloe) are outstanding. I guess that the whole production didn't go very well. Thumbs up for Chloe.",
      "total_reactions": 0,
      "user": "Kiva"
    }
  ],
  "metascore": 49,
  "name": "Texas Killing Fields",
  "num_weekends": 5,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 10,
    "year": 2011
  },
  "opening_weekend_income": 8772,
  "opening_weekend_income_currency": "$",
  "rating": 5.7,
  "rating_count": 15231,
  "rating_freq": {
    "1": 338,
    "10": 620,
    "2": 339,
    "3": 644,
    "4": 1481,
    "5": 3307,
    "6": 4326,
    "7": 2741,
    "8": 1077,
    "9": 358
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 73,
  "votes_per_demo": {
    "aged_18-29": 3634,
    "aged_30-44": 7124,
    "aged_45+": 2584,
    "aged_under_18": 12,
    "females": 2372,
    "females_aged_18-29": 787,
    "females_aged_30-44": 1117,
    "females_aged_45+": 363,
    "females_under_18": 4,
    "imdb_staff": 1,
    "imdb_users": 15231,
    "males": 11287,
    "males_aged_18-29": 2808,
    "males_aged_30-44": 5941,
    "males_aged_45+": 2179,
    "males_under_18": 8,
    "non-us_users": 9466,
    "top_1000_voters": 278,
    "us_users": 2247
  },
  "year": 2011
}