{
  "avg_rating_per_demo": {
    "aged_18-29": 6.6,
    "aged_30-44": 6.3,
    "aged_45+": 6.4,
    "aged_under_18": 7.4,
    "females": 6.8,
    "females_aged_18-29": 6.8,
    "females_aged_30-44": 6.7,
    "females_aged_45+": 6.8,
    "females_under_18": 7.7,
    "imdb_staff": 7.2,
    "imdb_users": 6.5,
    "males": 6.3,
    "males_aged_18-29": 6.4,
    "males_aged_30-44": 6.1,
    "males_aged_45+": 6.3,
    "males_under_18": 7.0,
    "non-us_users": 6.4,
    "top_1000_voters": 5.7,
    "us_users": 6.6
  },
  "avg_screens": 1171.4545454545455,
  "budget": 8500000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 5,
    "year": 2015
  },
  "critic_review_count": 134,
  "duration": 101,
  "genres": [
    "comedy"
  ],
  "gross_income": 34017854,
  "max_screens": 2622,
  "mc_avg_user_score": 6.6,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "The DUFF",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 61,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 90,
      "summary": "Wit and charm matter, and The DUFF has a good deal of both. The cast will be stars, the gags will be immortal, and you’ll still be watching this movie years from now."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 90,
      "summary": "There’s no doubt that The DUFF is clever, funny and quotable enough to become this decade’s “Mean Girls.” Watch your back, Regina George — there’s a new queen bee in town."
    },
    {
      "critic": "Maggie Wrobel",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 88,
      "summary": "The film belongs to Whitman, who, fresh off a five-year stint on the now-defunct TV series \"Parenthood,\" infuses her first big-screen leading role with a unique charm. If Whitman looks familiar, but you can’t quite place her, that’s about right."
    },
    {
      "critic": "Nick Schager",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "Canny and funny in equal measure, it’s a film that embraces technology — just like it does its protagonist — on its own perfectly imperfect terms."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "What’s terrific about The Duff is that Casey and Jessica may not have intentionally befriended the less attractive Bianca as a way to make themselves look better, but they don’t exactly deny that she serves that purpose."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Quickly and convincingly, it becomes its own funny and fast-paced phenomenon with its own modern-day charm."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "The DUFF would make John Hughes smile. With its mixture of wit, teen friendly situations, and heart, The DUFF feels like something that might have come out of Hughes' '80s playbook."
    },
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Overall, though, Sandel’s film has heart, some good laughs, and a decent message. In this age of cyberbullying, that’s nothing to scoff at."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "It's a comedy with an easy message, and it's sort of sweet. Not too raunchy, not too challenging. A good date movie for sophomores."
    },
    {
      "critic": "Katie Rife",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "A better question to ask about this movie, however, is “What is up with the writers of teen movies and their obsession with name-checking apps, an approach that all but guarantees that the film will be dated by the time it hits Netflix?”"
    },
    {
      "critic": "Kevin P. Sullivan",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "As misspent of an opportunity as The DUFF may be, it’s hard to completely dismiss a film that gives someone as talented as Whitman her long-overdue spotlight."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "This is a well-intentioned and sometimes quite sharp high school movie that falls just short of the mark due to a few way-off-the-mark scenes and too much heavy-handed preaching."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Slightly radical in portraying high schoolers as human beings of normal niceness and intelligence. That means this winsome comedy is a little low in the stakes department, not to mention predictable, but it gets an “A” for charm."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "A snappy, sweet-spirited teen comedy about a smart girl who tries to fight high school labeling with wit and words. And the occasional punch."
    },
    {
      "critic": "James Luxford",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "This is a heartfelt and charismatic teen movie that gives a platform to a promising young talent."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "For all its potential pitfalls, The DUFF manages to keep its head above water, thanks to Whitman, Amell, and a willingness to engage with teen-movie clichés in a relatively thoughtful way."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Fortunately, the cast — featuring Allison Janney as Bianca’s scattered mom and Ken Jeong as her sympathetic mentor — is savvy and silly. Really, though, most of the credit goes to Whitman, who stands in, and stands up, for the DUFF in all of us."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "More a middle-of-the-road rom-com than a teen-spirit sendup, the pic weaves its lighthearted mix of silly and serious with increasingly heavy-handed spiels on self-esteem."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It falls short of the mark, even as it hits every one of the genre's conventions."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Romance, or the desire to find someone special, isn't a bad thing — if it's not the only thing. But as it stands in DUFF, the denouement at prom has cliché written all over it."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "If you've seen \"Mean Girls\" or \"Easy A,\" you've seen a far better version of The DUFF."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Whitman's a wily cross between Janeane Garofalo and Ellen Page and in her scenes with her motivational-speaker single mother (Allison Janney), you sense a better movie lurking in the shadows."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "There's freedom in facing the truth. There would be even more freedom in a heroine finishing the film in her favorite ugly overalls, but we haven't gotten there yet."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Even in this would-be subversive comedy. Success means getting the guy. Getting good grades (as Bianca does) is not enough, nor is writing the front-page article in the school paper."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "The film deposits its heroine and everyone in the audience looking toward her for image-maintaining guidance back at square one."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 33,
      "summary": "Director Ari Sandel, working with a script by Josh A. Cagan, doesn't have the deftness to really convey how Bianca's personality turns conventional wisdom into her own unique, attractive qualities."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "An adaptation of Kody Keplinger’s YA novel, The DUFF is exponentially dumb."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "Between its grating heroine, strident speechifying, derivative plot and draggy tone and tempo, it’s like the redheaded stepchild of “Mean Girls” and “Freaky Friday.”"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "It's genial and means well - and it's LEAGUES better than Hot Tub Time Machine 2 - but it lacks a bit of puch that similar movies like 10 Things I Hate About You have. The bad **** isn't bad enough.  The \"good\" cool guy stays the same throughout the movie.  And the lead just isn't quite dynamic enough.  However, the two leads are extremely likable, and it's fun to root for them.",
      "total_reactions": 1,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "The movie is preachy and predictable but at times came across genuine among the two lead actors. The DUFF is basically Mean Girls 3, only not as funny.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Another Mean girls movie. Between good and bad. A movie for teenagers, school and bullying lovers. I wish thins kind of movie wasn't so superficial, take things into a deeper level of thinking and making conscience about bullying and teenagers ideas and real living in school would make me rate it better.",
      "total_reactions": 1,
      "user": "LadyJesse"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was outstanding. It teaches young adults to not try to change who they are and be themselves.Sadly, I didn't see the turnout i was hoping for of the amount of people but it was a very good Movie. 10/10",
      "total_reactions": 4,
      "user": "thegamingbee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I got sorta dragged into seeing this, and guess I was expecting more of a straight up comedy. I got a lot more than I had hoped. The movie was really funny; it had a bunch of scenes where I laughed hard. This really worked so well mostly because of Mae Whitman, who plays \"the DUFF\". She's a great actress, and she acts like any normal teenager would with just a slight awkwardness and a lot of sarcasm and heart. The movie even slips in some lessons on cyberbullying and just being yourself, but it's never preachy about it. The morals are worked in smoothly. It's definitely a huge surprise to me that I liked The DUFF so much, and I would recommend this to all of you.",
      "total_reactions": 3,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "The DUFF is something clearly not made for people like me. I am looking for comedy without borders, but DUFF keeps it in the borders, when I look for acting, I find Bella Thorne, which is really not amusing. But, it was fresh, original and admittedly, funny. This is a film that climbes up the ladder of High School dramedies and becomes a total king of them. The dialogue is sharp and brilliantly written, while the starpower make for some interesting acting skills. The DUFF is a witty film, that is funny enough to hold your attention.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "I had to choose between an action movie and this one, i wish i had chosen the former. The Duff turned out to be a teen comedy, so if you're 17 and below, this movie is for you. Felt like watching 2 episode of a disney channel series. The story is fun but childish, it's about a high-school girl who discovers that she's the designated ugly fat friend (duff) and wants to change that and un-duff herself. cool",
      "total_reactions": 4,
      "user": "zouz123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This movie is a coming of age movie, witch means it was made for high schools in mind. This movie was fun and interesting. It showed how high school really works in today's society.",
      "total_reactions": 2,
      "user": "Lagamedog"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "The DUFF is quite entertaining and has a really nice poignant message. The film captures life, I mean the characters, and I'm mostly refering to Wesley (Robbie Amell) and Bianca (Mae Whitman), are realistic, humanized. I got a weird sense that I was watching people I knew and not a stereotypical film version of them. The movie has that documentary feel to it and it's due to how the leads portrayed their characters and how easy it is to relate to them.",
      "total_reactions": 2,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "I wasn't expecting much from this film, as it appeared to be a retelling of yet another 'victimized teen' drama, but with a modern 'update' via the latest technological weapons of social assault.  What I witnessed was a deeply moving, funny, creative, instant classic.  Mae Whitman was absolutely FANTASTIC !!!",
      "total_reactions": 3,
      "user": "Unclefunnyman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I am always hesitant to go see Teen Movies these days as few are like the greats I grew up with, such as The Breakfast Club, Ferris Bueller's Day Off, Don't Tell Mom the Baby Sitter's Dead, Weird Science, 16 Candles, and so on!!  The main reason I went to see this one is I loved Mae Whitman in \"Parenthood\" as I think she is a great little actress, and bingo I guessed right as she pulls this movie off in a grand way.  Actually it is well written minus all the stupid humor injected unnecessarily, does have some meaning to it for either if you are old or young, and Mae's supporting cast does a good job as the glue to make it all fit.  There is humor, humor that made me laugh, but humor that wasn't over the top!!  This I think this should be added to the list of great teen movies.  Well done Bravo Ari Sandel who is the director, hope we get to see more from you in the future as you got this one right!!  Thanks for all your effort and again well done!!  Was an enjoyable evening at the movies.",
      "total_reactions": 3,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "It's not about a GEEK, but somebody's DUFF.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Was surprised by this one. A meaty performance from Mae Whitman pushes this past regular teen fodder into a fresh comedic space, even if the ending is predictable.",
      "total_reactions": 1,
      "user": "heromoder"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "The Duff chick flick movie, is something that  teenagers can relate, and some just eh not so so much. I am a dude so i can not relate to this **** and \"the popular girl,\" Bella Thorne her acting skills is not that well done she has no place to be in Hollywood. There is some mean spirited humor, but even though it does get hilarious. Grade C+",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "The Duff is a strong teen movie, that was kind of unexpected. Mae Whitman has a great performance in this film which is unexpected for her first major leading role. We end up cheering for her throughout the film like an underdog sports team. She's not necessarily that funny all the time but she does draw you in. Robbie Amell was also really good which we doesn't always expect from the good looking love interest guy. This film conquers some teen issues that are apparent in high schools today and I'm sure a lot of young adults will be able to make connections to this movie and that will be what makes it special.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Very cute. Typical ending but does convey a positive message. Light hearted comedy.",
      "total_reactions": 1,
      "user": "heat_fan13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "I hadn't even heard of this film until my mate asked me to go and see it ! I was thinking ohhhh this will be okishhhh I presume .... Well I have not laughed out loud that much for a long time.... It was very cheesy in parts but what can you expect for a high school American film , it's to be expected. This makes people see that bullying isn't nice and it hurts people's feelings, it only makes the people doing it look more insecure . Brilliant film !",
      "total_reactions": 1,
      "user": "Eeyorevictoria"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo.",
      "total_reactions": 1,
      "user": "leefirmino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "Enjoyable, but overall very predictable. I still recommend it to all teens out there looking for a movie - it deserves a watch. But i'm giving it a 5/10 because it was a decent movie for me and i can't tell if you'll like it or not.",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "This movie stars a bunch of talented young Hollywood types that do a fairly good job, but for me it came across as an upscale Nickelodeon special. Not my cup of tea.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Great movie with a powerful message. For a dramedy, it wasn't that funny, just entertaining. Also amazing performances by pretty much everybody. I wish they keep on making movies like this aimed toward teens.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "The movie may have some snappy, modern dialogue that young people will get a kick out of, but it's the film's incredibly charming leads that make it entertaining.",
      "total_reactions": 0,
      "user": "alexa417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "WHAT I LIKED: For a movie to just while away a couple of hours - you could do much worse than 'The Duff.' There's just enough fun humour, character development and good acting to keep you engaged - it's just a bit of fun that carries a slight whiff of serious theme and relationship development to carry you along.",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "I really enjoyed this movie. made me laugh quite a bit. It was predictable, not much new, but still good and we'll acted! :) Love the cast of this film the most, probably what made me like it so much.",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Some of the best movies in my opinion sometimes get some of the worst reviews. The movie the Duff is given some of the worst reviews for the movie. One of them says that it has a draggy tone. In my opinion the Duff shows the mindset of a teenage female in high school. Me and Bianca are so similar yet so different. We both are considered fat, but we do not have the same wideness. We also have a difficulty getting a boyfriend, or having a boy like us. Another bad review for this wonderful movie is that someone called it exceptionally Dumb. Even though it is supposed to be like the book but it is not like it really that much. In the end of both of them she ends up getting the womanizer/playboy Wesley Rush. In the end of the year i will probably not have a boyfriend like Bianca.",
      "total_reactions": 0,
      "user": "CountryMusic"
    }
  ],
  "metascore": 56,
  "name": "The Duff",
  "num_weekends": 11,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 20,
    "month": 2,
    "year": 2015
  },
  "opening_weekend_income": 10809149,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 56367,
  "rating_freq": {
    "1": 955,
    "10": 5754,
    "2": 596,
    "3": 1055,
    "4": 2283,
    "5": 5933,
    "6": 12690,
    "7": 15325,
    "8": 8301,
    "9": 3475
  },
  "release_day": 20,
  "release_month": "February",
  "release_year": 2015,
  "user_review_count": 122,
  "votes_per_demo": {
    "aged_18-29": 25738,
    "aged_30-44": 12251,
    "aged_45+": 2502,
    "aged_under_18": 863,
    "females": 20872,
    "females_aged_18-29": 13747,
    "females_aged_30-44": 4172,
    "females_aged_45+": 653,
    "females_under_18": 622,
    "imdb_staff": 4,
    "imdb_users": 56367,
    "males": 22935,
    "males_aged_18-29": 11679,
    "males_aged_30-44": 7922,
    "males_aged_45+": 1800,
    "males_under_18": 232,
    "non-us_users": 23274,
    "top_1000_voters": 245,
    "us_users": 7946
  },
  "year": 2015
}