{
  "avg_rating_per_demo": {
    "aged_18-29": 7.5,
    "aged_30-44": 6.9,
    "aged_45+": 6.5,
    "aged_under_18": 8.3,
    "females": 6.7,
    "females_aged_18-29": 7.0,
    "females_aged_30-44": 6.5,
    "females_aged_45+": 6.4,
    "females_under_18": 7.8,
    "imdb_staff": 7.3,
    "imdb_users": 7.1,
    "males": 7.1,
    "males_aged_18-29": 7.6,
    "males_aged_30-44": 6.9,
    "males_aged_45+": 6.5,
    "males_under_18": 8.4,
    "non-us_users": 7.0,
    "top_1000_voters": 6.6,
    "us_users": 7.3
  },
  "avg_screens": 230.6315789473684,
  "budget": 32000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 15,
    "month": 3,
    "year": 2013
  },
  "critic_review_count": 547,
  "duration": 144,
  "genres": [
    "drama"
  ],
  "gross_income": 16377274,
  "max_screens": 877,
  "mc_avg_user_score": 7.1,
  "mc_metascore": 86,
  "mc_mixed_rating_frequency": 84,
  "mc_movie_name": "The Master",
  "mc_negative_rating_frequency": 77,
  "mc_positive_rating_frequency": 330,
  "mc_pro_critic_reviews": [
    {
      "critic": "Emma Dibdin",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "With potent performers and poetic visuals, Anderson has made the boldest American picture of the year. Its strangeness can be hard to process, but this is a shattering study of the impossibility of recovering the past."
    },
    {
      "critic": "Damon Wise",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "An often brilliant '50s-throwback character drama that never feels nostalgic, with terrific central performances and a luminous, unforgettable visual beauty."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Like Stanley Kubrick's \"Eyes Wide Shut,\" Anderson's latest is enigmatic. But if you have eyes and can see, The Master it is unmistakably some kind of wonder. At least, it's an exhilarating demonstration of big-screen moviemaking in dreamlike colours and a sense-heightening 70-mm format."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Nothing as big and strange and right as The Master should feel as effortless as it does. That's not the same as saying that it's light. It's actually heavy. It weighs more than any American film from this or last year. It's the sort of movie that young men aspiring to write the Great American Novel never actually write."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "The Master is not a schematic attack on a particular religion. It is a brilliantly conceived and powerfully realized work of art, with complex characters, exquisite images and ambiguously big ideas."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "The Master is brilliantly, wholly itself for a little more than half of its 137 minutes. Then it chases its own tail a bit and settles for being merely a fascinating metaphoric father-son relationship reaching endgame. It may not all \"work,\" but most of it's remarkable."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "This is a rapturous cinematic experience, a spellbinding expression of shrouded ideas and exposed talent, top to bottom."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "The Master takes some getting used to. This is a superbly crafted film that's at times intentionally opaque, as if its creator didn't want us to see all the way into its heart of darkness."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "It's also one of the great movies of the year - an ambitious, challenging, and creatively hot-blooded but cool toned project that picks seriously at knotty ideas about American personality, success, rootlessness, master-disciple dynamics, and father-son mutually assured destruction."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "The performances by Phoenix and Hoffman are studies in contrast. Phoenix carries himself with a jagged, lurching, simianlike grace while Hoffman gives Dodd a calm deliberateness. Both actors have rarely been better in the movies. The real Master class here is about acting – and that includes just about everybody else in the film, especially Adams, whose twinkly girl-next-door quality is used here to fine subversive effect."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "It is a movie about the lure and folly of greatness that comes as close as anything I've seen recently to being a great movie. There will be skeptics, but the cult is already forming. Count me in."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "It's a feisty, contentious, deliberately misshapen film, designed to challenge and frustrate audiences looking for a clean resolution. Just because it's over doesn't mean it's settled."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Written, directed, acted, shot, edited and scored with a bracing vibrancy that restores your faith in film as an art form, The Master is nirvana for movie lovers. Anderson mixes sounds and images into a dark, dazzling music that is all his own."
    },
    {
      "critic": "Xan Brooks",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "The themes may be contentious, but the handling is perfect. If there were ever a movie to cause the lame to walk and the blind to see, The Master may just be it."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Two things stand out: the extraordinary command of cinematic technique, which alone is nearly enough to keep a connoisseur on the edge of his seat the entire time, and the tremendous portrayals by Joaquin Phoenix and Philip Seymour Hoffman of two entirely antithetical men"
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 95,
      "summary": "Without ever saying so, the movie adds up to nothing less than a social psychology of the nervous, spiritually questing geist of post-World War II America."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "The film is not an epic. It's not a masterpiece. But it is an involving study of men searching, searching for answers, for belonging, for a foothold in life at a time when footholds were hard to find."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "The Master is often spectacular and never less than handsome, and it has numerous moments of disturbing and almost electrical power. I can't say, after one viewing, that I found it moving or satisfying as a whole, but I'm also not sure it's supposed to be. This is an almost apocalyptic tale of thwarted emotion - love cut short - set in a pitiless land of delusions."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "What makes The Master such a singular experience, as dense as a mille-feuille, is that it is not Lancaster's story but Freddie's, and told as such, in layers that are sensorially rich but that do not always lead easily from one to another."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "Paul Thomas Anderson's remarkable sixth feature addresses, by extension, the all-too-human process of eager seekers falling under the spell of charismatic authority figures, be they gurus, dictators or cult leaders. Or, in the case of this masterly production, a couple of spellbinding actors."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "It's a film of breathtaking cinematic romanticism and near-complete denial of conventional catharsis. You might wish it gave you more in terms of comfort food pleasure, but that's not Anderson's problem."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "On reflection, and despite these cavils, we should bow to The Master, because it gives us so much to revere, starting with the image that opens the film and recurs right up to the end-the turbid, blue-white wake of a ship. There goes the past, receding and not always redeemable, and here comes the future, waiting to churn us up."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "The writer-director's typically eccentric sixth feature is a sustained immersion in a series of hypnotic moods and longueurs, an imposing picture that thrillingly and sometimes maddeningly refuses to conform to expectations."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "Anderson tells this story slowly, inexorably, with a sense of control I've never felt from him before. This is the least violent of his five dramas, the first where nobody dies. It's also the bleakest."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "It's a sharply written, unforgettably directed character study with brilliant performances by Joaquin Phoenix, Philip Seymour Hoffman and Amy Adams - far more intimate but no less intense than director Paul Thomas Anderson's Oscar-winning last film, \"There Will Be Blood.''"
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 83,
      "summary": "Anderson, god love him, seems determined to make the \"Great American Film.\"  The Master isn't it, but you come away from it with the sense that may be on the right path."
    },
    {
      "critic": "Charlie Schmidilin",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 83,
      "summary": "Even amongst its most wrenching scenes of unfettered anger and broken loyalty, a volatile sensuality nonetheless invades every frame of Paul Thomas Anderson's arresting The Master."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "The Master is above all a love story between Joaquin Phoenix's damaged WWII vet, Freddie Quell, and Philip Seymour Hoffmann's charismatic charlatan, Lancaster Dodd. And that relationship is powerful and funny and twisted and strange enough that maybe that's all the movie needs to be about."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "This superb, cerebral film about unchecked belief is a fictionalized and cutting drama hinging on the origins of Scientology. Scratch around a bit, though, and its wider indictments become clear."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "If I seem cool, it might be because I came in hoping for the same level of blood-and-thunder as in the Evangelical scenes of \"There Will Be Blood,\" whereas The Master is a cerebral experience. But Anderson has gone about exploring fundamental tensions in the American character with more discipline than I once thought him capable."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Phoenix's performance is one of such wild, intense abandon that it is not to be believed, and this, in fact, was my problem as The Master sailed into its momentum-less second hour."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Yet, for all of The Master's laudable elements, it falls short of greatness for one simple reason: the storytelling is unspectacular."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "The Master is big screen marvel intended for 70mm projection (a rare treat), with some beautiful imagery, but often inaudible dialogue. Phoenix's lived-in mumble comes off about as clear as Fenster from The Usual Suspects and Amy Adam's precise diction can't even save her harshest talking points."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "While the movie is glorious to watch, it brings no coherence or insight to its two main characters."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "By bringing so much thought, verve and visual poetry to bear on two neurotics acting out -- rather than on the larger cultural story they anticipate and embody -- The Master turns out to be more of a self-defeating whimper than the big, important bang it could have been."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "Fabulously well-acted and crafted, but when I reach for it, my hand closes on air. It has rich material and isn't clear what it thinks about it. It has two performances of Oscar caliber, but do they connect?"
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "Anderson has taken pains to re-create the '50s with superb production design and gorgeous cinematography. But he seems less concerned with whether the audience is along for the ride. The story can leave viewers at sea, floundering to give meaning to what they are watching."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "What Anderson's talky and willfully opaque film doesn't have, however, is an unfailingly compelling story to tell."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "I'd trade much of The Master for one extraordinary moment played by the ever-improving Amy Adams, in front of the bathroom mirror with Hoffman."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The Master has become a contest between two gifted actors trying to shout each other down. The commitment to their roles is impressive, but it's tethered to a weightless, airless movie, a film so enamored of itself, the audience gets shut out."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "If it were just a middling effort, The Master would be a lot less frustrating. But the latest from writer-director Paul Thomas Anderson has greatness in it - two extraordinary performances, intuitive and revealing photography and scene setting, and a distinct directorial sensibility that hovers between sobriety and satire. Yet all those virtues are undermined by a narrative that goes all but dead for the last hour."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The Master is Paul Thomas Anderson with the edges sanded off, the best bits shorn down to nubs."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "Call The Master whatever you want, but lobotomized catatonia from what I call the New Hacks can never take the place of well-made narrative films about real people that tell profound stories for a broader and more sophisticated audience. Fads come and go, but as Walter Kerr used to say, \"I'll yell tripe whenever tripe is served.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 28,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Another amazing epic Paul Thomas Anderson film where every facet of the film is extremely dynamic. It is very dense and there's a lot to take in whether it be the tense, grinding score, the gorgeous shot choices (punctuated by vibrant color and detail in 70mm), or knock out performances from the lead males. The physical work that Joaquin does is outstanding, I have not seen an actor as fully committed and free in a long time, perhaps since Daniel Day in There Will Be Blood. Paul's most interesting film in terms of structure/ editing, jumping through time willy nilly, perhaps mirroring the teachings of Lancaster Dodd or perhaps entering the mind of Freddie continually going back to where he is stuck (the war/ lost loves). The relationship between Dodd and Quell is tense and at times adorable, they are so in love and desire so much to have what the other has: Lancaster wants to act on impulse and not be controlled by any \"Master\" and Freddie whats to break this insane cycle he seems to find himself trapped in. This film will absolutely take many more viewings and I believe it will continue to grow in my mind as PT's best film (potentially).",
      "total_reactions": 31,
      "user": "Silvertooth"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "There is a growing chorus of hosannas greeting \"The Master\" that will no doubt crescendo around Oscar time, but I would like to add my voice to the minority.  There are very few negative reviews for this movie.  Those I have seen have usually received a stream of venom from readers, who fill the comments sections with wounded outrage.  The raves, meanwhile, are telling in their own way.  Consider this quote from our own Kenneth Turan (\"'The Master' mesmerizes in word and deed\", LA Times, 9/13/12): \"its interest is not in tidy narrative satisfactions but rather the excesses and extremes of human behavior, the interplay of troubled souls desperate to find their footing.\"  Tidy narrative satisfactions.  Here's another: \"This is a superbly crafted film that's at times intentionally opaque, as if its creator didn't want us to see all the way into its heart of darkness.\"  Anyone beginning to get a whiff of **** here?  No?  Perhaps we should take the advice of Entertainment Weekly's Lisa Schwarzbaum: \"the movie may not even be fully comprehensible on first viewing, the bigger patterns in the narrative and the rhythms of the filmmaking revealing themselves more fully and clearly only with a return visit. Even then The Master is enigmatic.\" Well, you can't have everything.  But Kenneth Turan deserves the final word: \"it's disconcerting that the relationship between (Dodd and Quell) gets murkier rather than clearer as time goes on, (but) that is perhaps the point.\"  Yes, we all love being disconcerted by murky enigmas, don't we?  There's a certain feeling of sophistication that comes along with it.  But this seems to me to be more like the shared thrill of a mob mentality, the kind of thing that gets dictators elected and cult leaders established, a projected fantasy of greatness that finds affirmation in incomprehensible mediocrity.  We've seen it before.  It would be perhaps too harsh to say that \"The Master\" is an example of this.  There is no doubt a lot fine work on display in this film.  But if I want opacity, I can always just stare at a wall.",
      "total_reactions": 28,
      "user": "bloech"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "If Malick, Antonioni and Kubrick had a baby he would have made The Master. This  may be be PTA's most impressive movie, but you need to give it time to digest.",
      "total_reactions": 6,
      "user": "stfuDonnie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is by far the best film of the year! The Master has two incredible performances (Phoenix, Hoffman), beautiful cinematography, and a powerful message. This film will tear out your heart by subtly exposing people for who they are at their core. I believe this to be true for all of the masterpieces creating by Paul Thomas Anderson. Bravo, sir, bravo!",
      "total_reactions": 4,
      "user": "Zeus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "A film with two great performances by Phoenix and Hoffman and great character development. Another fantastic uneasy soundtrack gives this a feel similar to There Will Be Blood, although this film seems even darker in tone. Worth more than one viewing",
      "total_reactions": 3,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Whether a movie is good, bad, opaque or an epic, it should never be boring.  And, in my opinion, this film was boring.  Joaquin Phoenix´s acting was very good, but acting very well a bad script is a bad result.  Some situations were absurd, in the bad sense of the word.  The characters, except that of Mr. Phoenix´s, were not well delineated, and the directing was all over the place, something not surprising given the poor script.  The basis of the story was good, but it needed a good development.  This film lacks a good development.",
      "total_reactions": 2,
      "user": "jlua"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This is a great movie. It's as captivating as any of PTA's work but maybe in different ways. This film isn't about competition like There Will Be Blood but more about a teacher/mentor relationship unlike any other. It would be easy to write Phoenix's character as a pure audience surrogate but instead we get an unreliable source who could actually benefit from guidance. Shot beautifully, there are enough breathtaking shots that would worth seeing it a second time but in 70mm if given the chance. The performances are also spectacular. Unsurprising Hoffman is the star here. He's able to create a charisma that makes you understand why people are drawn to him and yet you can see the gears in his head moving. His character is thinker whereas Planview was an animal in the way Hoffman detests. Phoenix is excellent as well, bringing more to his character than just his surface mannerisms. Adams is also very good.",
      "total_reactions": 2,
      "user": "RjngoKid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Difficult and depressing. On the one hand, the acting is sensational - both Joaquin Phoenix and Phillip Seymour Hoffman are clearly amongst the greatest actors of their generation, and are absolutely compelling to watch. On the other hand, why put yourself through the trauma of watching horrible characters being horrible to each other and everybody else for about three hours? Occasionally humour, humanity and redemption do peek through, but it is still a bit of a slog. I had the same uneasy reaction to \"There Will Be Blood\". If you liked that, you will probably like this. But is this kind of relentless psychodrama a good night out? On balance, this is abject pandering to the desire of actors to stamp their authority on their art. Nevertheless, this movie is certainly different to anything else that is coming out, and as such deserves an airing. Just be aware that the subject matter and tone is unforgivingly dark.",
      "total_reactions": 2,
      "user": "Brutus54"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Beautifully crafted, perfectly acted  and a genius score to go with it. But, you cant help feel that the storyline was rather weak. you really want to connect with the characters and really get into the film, but it just doesn't seem to give as much as you want it to. Saying that it is still a brilliant piece of cinema!",
      "total_reactions": 2,
      "user": "cnrcnr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "The power house performances from Phoenix and Hoffman help create some of the most mesmerizing scenes of 2012, and Paul Thomas Anderson has a great eye for scenery. However, I felt that the story ultimately meandered around the concept of cult and towards the final act fell apart for me, leaving a sense of unfulfillment. It is not his best film to date (that honor still goes to 'There Will Be Blood') but any fan of Paul Thomas Anderson will find greatness through the failures.",
      "total_reactions": 2,
      "user": "Longbottom94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "Excact same experience as There Will Be Blood. The first time you'll notice the amazing acting but the film with seem pretty empy. The next time you watch it you see all sorts of potential in it and the acting will seem even better. Every time you watch it after that it will seem rich and full, and you'll realize P. T. Anderson actually truelly knows what he is doing. My favorite movie of the year, and DD Lewis was great but I wish the oscar went to Jaoquine. Did you know his brother was River Phoenix? I somehow didn't know that till recently. Anyways, I digress.",
      "total_reactions": 1,
      "user": "VidsRule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "PT Anderson is one of the greatest talent's in American cinema, for one simple reason; He does not pander to the masses. This is a beautifully directed character study of a charasmatic man trying to levetate above animalistic biology and his antithesis, a man destined to succumb to them. At no point does Anderson give in to character exposition or reveal his intentions. The acting of both male leads was sublime. Phoenix, doing enough in my opinion, to best Day Lewis in Lincoln. The Oscar snub for Best film and director was clearly a reaction to the Scientology basis, even though this is not strictly a film about Scientology.",
      "total_reactions": 1,
      "user": "Evolutionary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Superbly crafted, The Master is the ultimate contemporary Avant-garde film. The complexity of the story and the lack of dramatic coherence and unity, combined with richly colored cinematography, Greenwood's brilliant score and  Anderson's nearly unprecedented artistic talent rich in philosophically adventurous and thematically exploitative spirit, makes The Master a layered statement against conventional narrative and determined resolution. Therefore, it  sustains its marvelous and enigmatic opacity and many may find it very difficult to deal with it. Nonetheless, even those who find it difficult to digest Anderson's lack of transparency and non-eventful story, should be able to find a lot to enjoy in, e.g. the masterclass performances. Besides the grand aesthetic values, the film also explores themes such as post-war American society, its psychological, emotional and moral structure, the western's world principles of freedom and the conflicting yet absorbing authority of the master, the loss, weirdness, sadness, mental illness, belief, accompanied with suggestive philosophical ideas such as the impossibility of reconstructing and ultimately, facing one' s past.",
      "total_reactions": 1,
      "user": "MarkAngel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "I really can't wrap my head around why people hated this movie so much. I think alot of it has to do with expectations. i personally didn't love There Will Be Blood, so I went into this with no expectations. While it did have a few problems of its own, it was the most fantastic film-going experience I've had in a LOOOooong time. It doesn't have a cookie cutter narrative, and it certainly speaks in metaphors...lots of visual poetry and character development as metaphor. The narrative really exists inside the audience's mind. If you're not willing to think a little, you're missing out. I think American audiences are just a little too spoiled and ADD for this type of film in the 21st century. Maybe I'm wrong. I just really want to understand what people hate about this movie.",
      "total_reactions": 1,
      "user": "mrarrowshooter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is an amazing film, but you can't go in expecting it to be an L. Ron Hubbard expose in the style of There Will Be Blood. Like all PTA movies, this changes the game.",
      "total_reactions": 1,
      "user": "ThePoorMouth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is just as brilliant as any other PTA film... and it even provides more food for thought. The fact that so many people found this \"stupid and pointless\" while they the loved Inception just goes to show you that all you need to satisfy most movie goers is a couple guns and explosions.",
      "total_reactions": 1,
      "user": "rickrolled"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is my favorite movie (yes of all time). I'm not sure who should take credit for it either. Joaquin Phoenix had a breathtaking performance, along with Philip Seymour Hoffman. Paul Thomas Anderson did a fantastic job directing, especially during the single shot realism takes. He chose to use an old Panavision camera and shot in 70 mm and it looks better than any other movie that I have ever seen. The DOP Mihai Malaimare Jr. did a fantastic and notable job on this film as well. A masterpiece.",
      "total_reactions": 1,
      "user": "antipopculture"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "The acting prowess of the trio of Philip Seymour Hoffman, Joachim Phoenix, and Amy Adams that made this worth-while for viewers. Paul Thomas Anderson's \"The Master\" is fabulously well-acted and crafted--no question, but it's the material that is not clear. It has two performances of Oscar caliber, but how do they connect? \"The Master\" won't likely impress the audience of his earlier masterstroke. A film that starts off seeming like the best of 2012 slowly becomes a chore to sit through. It didn't have to be that way. The things that are lacking in \"The Master\"--are those any good screenwriter could have fixed. Alas, Anderson wrote this one himself.",
      "total_reactions": 1,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Paul Thomas Anderson continues to prove that he's one of the best directors going today.  If you want a film with superior acting and outstanding dialogue then I would highly recommend The Master.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Lots to chew on here, but there will certainly be skeptics on this one, as A.O. Scott mentions.  As epic as it feels in some respects, it is the smallest of epics.  It follows one fairly hard to connect with man wandering and struggling and not much else, narratively speaking.  There is some treasure for those who enjoy digging for it, but it is not as grandiose nor as tactually \"enjoyable\" as There Will Be Blood.  Really, the thing *I* am beginning to most appreciate about PTA is what will drive many others away - that he's not scared of wrestling with failure.  And with that sometimes comes moments that may surprise and bring something fresh to the screen, and other times one may feel he overreaches.  But whereas I once maybe felt his over reaching was of an egotistical sort, I find them now to be rather selfless in a way.  He has the command to make something impeccably polished and yet chooses to relinquish it, not to show off, but to explore something outside of that comfort zone.  Anyway, interesting stuff.  World class acting, and equally amazing score and cine.  Will definitely see it again.",
      "total_reactions": 13,
      "user": "ThomasLC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Hypnotic and mesmerizing.  I felt entranced throughout many portions of this movie.  Such a beautifully filmed piece of work; and the score by Jonny Greenwood was both jarring and unsettling, helping to maintain the unique observatory tone of this film.  Is it possible for Joaquin and Philip to split the best actor Oscar?  They keep you engaged at levels I've hardly experienced before (and Joaquin's physical presentation is astounding!).  The film explores so many ideas and leaves so many questions unanswered I don't know where to begin.  I definitely plan on seeing it again!",
      "total_reactions": 6,
      "user": "CollinP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This is a great film that requires multiple viewings and thoughts. Here",
      "total_reactions": 5,
      "user": "LonesomeDove"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This is a very polarizing film. I recall at least three people walking out. What does that mean? If you've come to watch a typical Hollywood movie, with typical storytelling and a predictable ending, I'm afraid you might be utterly disappointed. Possibly disgusted. This film isn't for you. It's creepy, uncomfortable, awkward, tense, exhilarating, vile, hilarious, somber, and beautiful. The lead actors deliver stunning performances. Their on-screen relationship is natural and believable. The supporting cast is also brilliant, there are no weak links in this chain. The unsettling, off-putting, gorgeous score from Jonny Greenwood is near perfect. The cinematography feels new, fresh, inspired. There is nothing else like this being done in major Hollywood productions. Without sounding pretentious, this film is a piece of art, first and foremost. If you want to see a beautiful film made by a director and actors at the top of their game, this just may be the film for you.",
      "total_reactions": 8,
      "user": "NathanR"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "This is a mesmerizing film. I haven't a clue if it's a good film, but it sure struts itself out as one. The acting is beyond superb, even if Phoenix made me squirm with his  part psycho, part PTSD, neanderthal, as loose a cannon that ever strode the silver screen. It's not a profound film, just made to look like one, but the film making is awesome. And I would love to see the Director's cut. It reminded me a lot of Orson Welles best  work, minus the heavy metaphors (except of course the sand lady). It's as quintessential American as any movie I've seen. Power, religion, ego, violence, unconscious self loathing, all wrapped into one complicated, and perplexing picture. And scene after scene of either/or hold your breath, squirm in your seat, shake your head tension, or all three.",
      "total_reactions": 4,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Cinephiles are not animals. We are not part of the animal kingdom. This movie is not for animals. Animals will not enjoy this movie. Cinephiles will enjoy this movie.",
      "total_reactions": 4,
      "user": "JLLoren"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "As usual the user reviews are better than the professional critics. This film is surely epic in the sense that it has some amazing acting and some nice scenery and the sort of spaciousness that There Will Be Blood had. BUT.... pretty much nothing actually happens. Get it later on DVD and you will soon be drifting off and checking your email while the characters sit in rooms talking.  The plot is almost literally non-existent (apart from 'ex-sailor gets involved in religious cult') but really... it gets more and more boring as it goes on and the ending is very very lacklustre. It just sort of gives up. Almost as if there were no ideas. Style over substance. 90% of the film is people in rooms talking, about 8% Joaquin Phoenix's character swigging booze or looking perplexed, 2% action. ie some actual engaging movement on the screen.  At no point do you really give a toss about the main characters and what happens to them, as aside from some moments where JP starts to get programmed by the cult, he's really not a likeable character in the least and the cult leader himself is shown as no more than a clever manipulator not really any kind of vulnerable human being.",
      "total_reactions": 4,
      "user": "Rex_richards"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "My wife and I both felt that this was an assemblage of progressively weirder scenes rather than a story... and there was truly no one in it to like. To take the talents of these main actors, all of whom I love, and have their intensity in service of this thin gruel is pretty disappointing. Gorgeous to look at, and the mise en scene was brilliant, the period was presented wonderfully. That began to be odd in itself. Why be so faithful to this period if there was not a compelling story within it? The story could be either true or somehow dependent the era. This assemblage of mild depravity was neither. So I gather it was mainly in exercise in style.",
      "total_reactions": 3,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is a public service announcement: Do not waste your money on this flick, we paid $1.00 at Redbox and stopped the movie 30 minutes in due to 'not wanting to waste another 2 hours of my life' on such a morose, insignificant, depressing, weird movie. These actors (who are superb, by the way) tried to save it, but couldn't. Other uses of my $1.00? Would have preferred the dollar menu at McDs or maybe a dime bag to forget I rented this slop.",
      "total_reactions": 3,
      "user": "MetaVince"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "A masterpiece and one of the best films of all time. If you dislike this film, then you shouldn't watch movies. Beautiful, haunting and flawlessly executed in all areas, it's a movie that will be analyzed and talked about for decades",
      "total_reactions": 3,
      "user": "Brasiliansoxfan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "I have never seen so many people walk out of the theater about halfway through the movie.  To those of you expecting an Oscar-caliber film, while it may undeservedly be nominated for Oscars, this movie is nothing but a collection of beautifully shot but meandering scenes.  There's no story, no narrative arc, just two unlikeable characters interacting in crazier ways. It becomes tiresome, fast.",
      "total_reactions": 7,
      "user": "Mercurio"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "It's tempting to label opaque films as profound.  Their ambiguity hints at a well of feeling percolating just beneath the surface, one that touches on pain, loss, sadness, everything it is to be human.  But, and this may be a hard pill to swallow, sometimes opaque films are just that: opaque.  They are pointless exercises in nebulous action and inactive structure for the sake of appearing profound.  The Master falls into this category.  It is a full 2.5 hours of unbridled fatuous nonsense.  Paul Thomas Anderson, who is no doubt a talented writer/director, seems to have gotten lost in his own reputation for literary mystique, and the result is one of the more narcissistic pieces of films I've had the displeasure of watching.  Be assured that if any no-name writer/director submitted this script for financing, he/she would have been met with a resounding chorus of criticism, and the project would never have gotten off the ground.  The Master presents no story, no real characters, nothing beyond a handsomely shot vacuous mess.  The film's climactic moments fail to stir an emotional response because they signify nothing grander than the cinematic arrogance of an auteur that relishes the label auteur.  If ever there was an example of narcissism in film, The Master is it.  As for the throngs of adoring fans, I would only suggest that artistic output, particularly vague, nonsensical artistic output, has the unique ability to coerce accolades by intimidation.  To suggest that there is nothing profound in The Master is to open oneself up to the criticism that he/she was incapable of picking up on the films nuances.  It's tempting instead to nod along with the discordant soundtrack and addled story structure and pretend to get it.  But I don't feel like nodding along to this because there is nothing here to get.  And the unending stream of praise might be the most pointed example of insecurity since the Emperor sauntered out in public wearing his new clothes.",
      "total_reactions": 26,
      "user": "bicktrav"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "In the end, the film is self-important- a hodgepodge of shiftless vignettes that add up to something tiresomely less than their sum. An incredible acting performance from Phoenix is diminished and finally dissolved in a stagnant reservoir of anti-plot where the maddening fact that nothing ever happens is justified audaciously and insultingly by the old highbrow notion that each non-happening is so meaningful in itself as to make the need for story irrelevant. Adding salt to the wound, the audience is consistently made to feel guilty and ashamed for its terribly middle class inability to appreciate or connect with such a vaunted and critically acclaimed \"masterpiece.\" Viewers are finally left to wonder if even Scientology itself could take their eleven dollars while offering such straight-faced, masturbatory nonsense in return.",
      "total_reactions": 12,
      "user": "JakeMaguire"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "I use metacritic to help make my movie selections, so someone needs to say this! Yes, good acting. Yes, unusual music, though disturbing. Yes, good cinematography that you expect for any movie. But expected for any movie is a plot, a story, a reason to exist, to watch, to understand, to persuade, to enjoy or even to hate. There's nothing here. After 2 1/2 hours, thankfully it ends and you're grateful that you at least had a comfy chair and hot buttered popcorn to waste your time!",
      "total_reactions": 12,
      "user": "Havetosay"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "I am with the other 19 reviewers giving this a negative review. People think way too hard. Any one who was coming out of this thinking that the movie was some grand statement or beautiful work saw a different movie than what I saw. I kept wanting to leave the movie, and didn't--just because I thought maybe, just maybe it would get better in the end. I have never run out of a theatre as fast as I did when that was over. It was really just a bore, and made me very, very upset, and taught me not to use Metacritic to pick which movies to see. Please don't see this. I'll feel bad if you do.",
      "total_reactions": 10,
      "user": "10ma11"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "It's an absolutely beautiful film - shot for shot - especially if you're seeing it in 70mm.  A couple of shots, actually, were probably the most amazing I've ever seen (ie., the boat leaving SF Harbor).  Phoenix and Hoffman deliver absolutely phenomenal performances - I was transfixed by the first couple of \"processing\" sequences.  The jailhouse scene is incredible. What prevented it from getting a higher score from me what that it loosened up toward the end and lost some focus.  It simply wasn't as coherent and tight as the artists best work - There Will Be Blood, Punch Drunk Love, et al.",
      "total_reactions": 8,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "This movie should be called \"Blah, Blah, Blah\".  I tried to love it.  I wanted to love it.  I admire and respect all the creative artists involved.  It was pretty.  It was well acted.  But somewhere in the second hour (it would be incorrect to call it an \"act\", there are no \"acts\" in this film), I found myself wanted to chew through my arms to release myself from the theater.  Perhaps if I had seen it in 70 mm the drive, character arcs or (god forbid art house movie lovers)... the PLOT might have been revealed in greater detail.  As it was, I left shaking my head and wondering what I could have done if I got those 2 1/2 hours back...",
      "total_reactions": 8,
      "user": "cupcake666"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Whenever the critics rate a movie above 80 I start to get nervous.  The closer to 100 the movie gets to 100 the chance the movie will be either great or an \"artsie\" disaster.  This movie was long, dull at times, and its message was obscure.  It wasn't a disaster but too \"artsie\" to be enjoyable.  Most in the theatre left with a look of \"what did I just spend 2 hours looking at\".  I gave the movie a solid 5",
      "total_reactions": 6,
      "user": "gfny"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "A long lamentable movie that has no positive qualities. It is among the most lifeless pieces of cinema I have ever seen. Why people love this movie is beyond my comprehension; it is just deplorable on every single level.",
      "total_reactions": 4,
      "user": "Trev29"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "I could not, for the life of me, believe in the premise of the movie, that the Seymour-Hoffman character was supposed to be this charismatic figure people flocked to.  His character was so uncharismatic, so completely banal -- why would any of the characters in the movie be interested in anything he said?  I was bored beyond caring halfway through the movie and wished I was watching Burt Lancaster in Elmer Gantry instead.",
      "total_reactions": 4,
      "user": "Heyjackkerouac"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "I sat through this movie for almost 2 hours wondering where it was going and when. Maybe it was to artsy or just over my head. Whatever it was, I haven't been so confused about a movie since Memento, even Memento made you think. The master will probably win an Oscar, it only made me feel like I was punked.",
      "total_reactions": 4,
      "user": "pletch57"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Paul Thomas Anderson continues to mesmerise us with his gripping and powerful and intriguing techniques of film, and the journey doesn't stop with The Master,even if the film never fully let's us in on the whole plan.",
      "total_reactions": 2,
      "user": "StevenF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Where do I begin with this mystical masterpiece, and where do I end? Off the heels of his modern day classic, The Will Be Blood, Paul Thomas Anderson constructs yet another challenging art film that’s sure to mystify and perplex viewers across the globe in The Master. The film follows Freddie Quell, an unstable drifter fueled by alcohol, who recently returned from the Second World War. Plunged deep within his most basic animalistic instincts, Quell stumbles upon the charismatic, self-actualized man known as Lacaster Dodd, who leads a movement (cult!) called the Cause. Dodd sees this man as a new challenge, and the film treks his attempt to tame this beast that is Freddie Quell. Is Dodd truly the Master (as he is commonly referred to in the film) or is it Quell who has mastered and embraced his animalistic instinct… One could even go further to question if Dodd’s wife (played with chilly precision by Amy Adams!!), who seems to be married to the Cause, has more clout than she lets on. Clearly inspired by scientology and its founding father, L. Ron Hubbard, the movie attempts to indulge us without being too candid. Its open ended-ness begs you to question whether there was any real resolution or if the extensive, thought provoking process was worth it. But these are the raging questions that make you appreciate this complex piece of work even more. Anderson constructs a masculine ballet of words, between man and animal. Both men played brilliantly by Joaquin Phoenix (Quell) and Philip Seymour Hoffman (Dodd). Phoenix channels much rage and aggression in a difficult role and Hoffman, conversely, channels a lot of charisma and wit (which may come across as easy) in an equally difficult role. Adams also gives one of the best performances of her career in this film; as the enigmatic, Peggy Dodd. With its brilliant editing and cinematography, not to mention the score that was a character of its own, the film proved to be a feast for the mind, eyes and ears. Next to Cloud Atlas, The Master is the most ambitious films of 2012, that’s expected to endure decades of analysis and reinterpretations. It is simply the year’s best.",
      "total_reactions": 2,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "The maddening and precipitous nature that ran rampant across Joaquin Phoenix",
      "total_reactions": 2,
      "user": "VisionsofJohana"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "Pointless. While this movie has nice cinematography and good acting, it is not tied together by a plot. So, I found myself staring at cinematographic diarreah for two hours that felt like four. One of the worst movies I've paid money to watch.",
      "total_reactions": 2,
      "user": "mmm3m"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Just because it's unconventional doesn't mean it's bad. Audiences need to stop being repulsed at the thought of being challenged by a film. This is one of the best movies I've seen, because it has so many layers. I could go back many times and get more and more meaning out of it.",
      "total_reactions": 2,
      "user": "MajesticUterus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "This film is genius. but lacks a story and ultimately looses the audience with it , this film  was SELF INDULGENT, and didn't speak to the audience its too far ahead of its time i' m sure in 20 years it will be voted one of the best films.",
      "total_reactions": 2,
      "user": "nathanroberts"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is not fast-paced, unthinking entertainment. Rather, it is an eery, haunting exploration into the minds of two madmen and the general cult insanity of America in its 50s. Through outstanding performances, Anderson takes us through the painful, moment-by-moment mix of reality and delusion, fantasy and belief which is the hallmark of cult life and followers. Often humorous, but always disturbing, this film is unlike no other. The themes have no easy answers, so there is no neat bow and tie here.  This is a landmark movie which makes any viewer think twice - about loyalties to any group or individual based on need.",
      "total_reactions": 11,
      "user": "SMSandoz"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "For me, this movie was a case of the critics serving the cool-aide and us moronic masses following their leaders (cult)! While I'll admit that the individual performances were good, the collective was an uninteresting mess. I had zero connection to any of the characters and could have cared less what happened to them. Dreadfully long, dreadfully boring. Our entire group simply hated it.",
      "total_reactions": 11,
      "user": "MHJP"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "I wanted to like this movie because the director has made great movies in the past, but this movie has no redeeming value whatsoever. Two lead characters who are jerks from the very beginning of the movie to the end, what was the point? It seems to me the movie was some kind of joke played by the director on the audience, why do you hate us mr. Anderson? What did we do to you? I wanted to walk out because of how intensely detestable these characters were but I stayed until the end hoping something redeeming would happen. I want the 2 hours of my life I wasted on this movie and my money back with an apology mr. Anderson.",
      "total_reactions": 9,
      "user": "irmdog"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "If this show is considered good - then I don't get it!  Although, I don't consider myself a prude and can tolerate brief nudity this was BEYOND my tolerance! The whole theme of the movie was disgusting and nauseating! This is really about degenerate men doing degenerate things.  I saw no redeeming qualities in the men or the show. Some of the scenery was beautiful - but is spoiled by what goes on in the movie.  I can't think of a movie I have watched that was a disgusting as this one - the only 10 it gets from me is 10 for disgusting.",
      "total_reactions": 5,
      "user": "handsyhelen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "What a rambling movie.  I really tried to get engaged but the plot just kept on bouncing around.  I did find that acting excellent by Joaquin Phoenix and Phillip Seymour Hoffman, but they could not overcome the ramble.  Cinematography was beautiful; scenes were well shot and crafted.  But too slow a pace, too thin an understanding of the characters, too much boredom,",
      "total_reactions": 5,
      "user": "Bart0814"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "I watched this film today, from a 70mm print. It is one of a handful of movies I wish I had never seen. It is slow and ponderous for the first half. The two main characters are unlikeable, which would be OK if they engaged you, which they don't. I might have sympathized with Freddie and his obvious PTSD issue if he hadn't been such a crude violent drunken jerk. The Master never felt real; portraying a faker without looking and feeling fake must be harder than I thought. All the way through this film is distinctly 1950's shooting and editing. The professional critics apparently love this; but in the theater audience it felt distinctly weird. We have moved on a long way from Panasonic 65mm cameras. This film is a throwback. If you like retro films and plots that go nowhere, this film was made for you.",
      "total_reactions": 18,
      "user": "MartinX"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "I went to see this movie because  Joaquin Phoenix and Philip Seymour Hoffman were in it and it had great reviews. I think at the time it had an 88 here on Metacritic. That is pretty much a no lose situation. Well there are always exceptions to the rules.... OK first let me say I found the acting of  Joaquin Phoenix, and Philip Seymour Hoffman to be brilliant. That being said this movie was excruciating to watch. My favorite part was the end because that signified the last of my suffering. I never cared about the story itself or the characters involved. I kept waiting for it to go somewhere or get interesting but for the most part it never did. If you want to see brilliant acting and don't care about the story then I highly recommend The Master. If you want an interesting/entertaining story then I would select another movie.",
      "total_reactions": 9,
      "user": "TheVegan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "There Will Be Hyperbole.  The critical acclaim and the great performances are to what end? (I hope this movie does not precipitate any external or internal psychiatric events.)",
      "total_reactions": 3,
      "user": "Cranksy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "Critics have been desperately prostrating themselves before The Master, Paul Thomas Anderson",
      "total_reactions": 3,
      "user": "bennington13"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This film plays more like a fevered dream than like realist history, so people expecting some sort of conventional narrative may quickly lose patience with this movie. They may also be missing something special. In addition to being glowing symbols more than they are conventional characters, neither Freddie Quell (Jochain Phoenix) or Lancaster Dodd (Philip Seymour Hoffmann) is especially likable. But the performances suggest emotional and historical truth in ways that are often moving, without pretension or sentimentality. Freddie Quell is a figure of the American male id, post World War II: violent, sensuous, insatiable. He's driven to drink drafts of American industry to quench his burning: the fuel of torpedoes, the fluids of photography, institutional cleaners, all mixed with the fruits of the earth. Dodd, \"The Master,\" is a new-model super ego who might tame and direct Quell. Dodd is smug as a baronial magnate, as full of literary pretensions as Tom Sawyer; his resolve is borrowed from his steely wife (Amy Adams). Hoffman's Dodd, contrary to rumors about the film, is not a charismatic, psychological autocrat, but is wounded, defensive, and dreamy. He lives out a fantasy of priestly insight and command, but few people really believe him; he gets the benefit of many doubts. As Quell is drawn to Dodd's fantasies of mind over history, Dodd is drawn to Quell's energy and chemical inventiveness. Together they suggest different means of achieving atomic-age versions of the old American goal of obliterating the past and standing alone in a new present. They also suggest the polar tensions of raw animal desire and magisterial fantasies of triumph present in many American men. Quell's desire to consume, dominate and love the earth (Quell is obsessed with a woman sculpted in sand) meets a rhetoric of platonic self-mastery in Dodd. The preposterous incongruity of the men and their desires does not result in a drama of control and exploitation, which audiences may expect, but in inchoate attempts at mutual understanding in several scenes that are more humanly intimate and dramatically resonant than most sexual episodes in movies. The 70mm \"real film\" photography in this movie is amazing; many of the film's strongest moments, including those with people, are wordless. An irony of the film is that lush and magnificent nature (the Pacific ocean, the Arizona desert, the San Francisco Bay) is often overlooked by Quell and Dodd in their self involutions. Nature in American writing often becomes a symbol of self; it automatically is for these two. But nature may have the last word, in an ending that is unexpectedly funny and tender. I rate this as one of the best American movies.",
      "total_reactions": 3,
      "user": "Johann_Cat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "First, my PTA credentials: I have consistently named Magnolia as my favorite movie of all time ever since it was released.  It still is.",
      "total_reactions": 3,
      "user": "iTheViewer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I have never seen a movie that got on my nerves more than the Master. Boring is actually the least of the problems. From the pace, to the incoherent story, to the horrible ending,  the movie is utter garbage. The movie goes nowhere and by the 20 minutes into the film you want it to end, problem is you have another 2 hours of hell to sit through.",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "ok phoenix is pretty awesome as an actor but the plot is grotesquely pointless and you will be cheated out of nearly 3 hours of your life if you watch this literally plotless movie.",
      "total_reactions": 16,
      "user": "shaunmed"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "This is my first review on Metacritic. Odd that I would finally choose my first review on something that felt passionless. I go into every movie with my mind open wide, ready for an experience I will remember. This movie did have some great cinematography, but not much else. I guess I also should give the actors a great deal of credit for portraying lunacy at its finest. Yet, we never really know any of the characters. They exist almost as if they are in our dreams representing some kind of strange, obscure beings. I did not walk away with much of anything and feel as if someone reached in my head and scrambled up my brains. I keep hoping to piece something together, but thus far I cannot seem to do it. I am a bit disappointed and confused. Although, maybe..just maybe it is nothing more than a master of trickery on all who partake.  One who is in a cult, follows blindly into the darkness hanging on for dear life. The audiences follow movies and directors in a cult like way at times. Most of us follow reviews....so do we climb aboard this ship of praise for this movie or do you we stand apart from the crowd and say\"what the heck was the point?\"",
      "total_reactions": 4,
      "user": "coolmomdee"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "After the brilliance of  \"There Will Be Blood\", I was really looking forward to this film. Like many of the other users stated, I get nervous when the experts starting lavishing out the high praise as I have found that means really slow and boring abot 50% of the time. Well, this film is is dreadfully slow, boring,and untethered. \"Tree of Life\" was an action film compared to this snoozer. I think I got the outlines of the plot but they sure could have added something in to the emptiness to engage the viewer. Phoenix's drunken, violent persona was a one dimensional bore after two times and Hoffman is a great actor but he didn't have much to work with. My viewing friend kept asking if I wanted to leave but I stayed to the bitter end. An end that did not come soon enough. Dreadful!",
      "total_reactions": 5,
      "user": "JamesL"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "Some people go to a movie to sit back, relax and be entertained. Others don",
      "total_reactions": 5,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "This was one of the worst movies we have ever seen. There are only 2 other movies we disliked more than this one! The acting was pretty good but seemed like a waste on such an absolutely terrible movie. Nearly walked out 3 times. If it wasn't for one of our friends sons who actually liked it we would have walked out. He was just released from a mental institute on Monday and hadn't seen a movie in over a year; he loved the seen of Joaquin masturbating to beach sand (no joke). He likes animals a little too much. We will not be hanging out with him again. Don't waste your money on this Church of Scientology bunk. Notice how this movie started off strong in early ratings, now that more people have seen it the user score has dropped significantly!",
      "total_reactions": 17,
      "user": "dianetrujillo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "It's official:  The Master is Paul Thomas Anderson's strangest film to date, ousting Punch Drunk Love from the top spot.  I'll admit that I'm not entirely sure what to make of this shapeless jumble aside from the fact that Phoenix and Hoffman give masterful performances and that Anderson is, I think, exploring the psychological makeup of delusional  mystics/prophets and the minds that are drawn to them.  The only thing I can say with any certainty, however, is that it is painfully pretentious and dull.  I was truly hoping for more from one of the most talented directors working today.",
      "total_reactions": 2,
      "user": "BKM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "This is my second review.  The first was for \"Tree of Life\".  This is not much different.  While Paul Anderson dispensed with dinosaurs and psychedelics, the rest was a puzzling, endless, Mobius strip: no beginning, no end.  Like \"Tree of Life\", this movie was crafted for the critics and the various \"chic\" critics awards, not ordinary, even intelligent movie goers.  Phillip Seymour Hoffman is brilliant in virtually every role and is again in this one, thus the score is 1, not 0.  The question is: to what end? Joaquin Phoenix mumbles endlessly, from one unintelligible sentence to another.  He is incomprehensible. This movie is pointless and endless.  Save your money.",
      "total_reactions": 1,
      "user": "brewster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "Obviously, those who enjoyed this movie or thought it was profound have never lived in California, where unhealed healers abound, and everyone gets suckered at least once. I did think it was well acted, especially by Joaquin Phoenix, but by 2012, the con is an old one, and there isn't much more to say about it. I am sorry that this pretentious and arduous effort is getting such big play. Many more imaginative movies out there!",
      "total_reactions": 1,
      "user": "Ashesndiamonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "It looks stunning, sounds stunning and is superbly acted. There's no denying Paul Thomas Anderson's ability to make a film except for me The Master is pretty incomprehensible and as a result feels extremely overhyped and very unsatisfying. Disappointing.",
      "total_reactions": 1,
      "user": "TheBear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "Maybe the film went over my head, but I took nothing away from the Master. No feelings, no questions, no discussion. The Master is a film that sets out to tell no particular story, in no particular hurry. The characters are paper-thin, and really only give us glimpses of anything truly interesting. Make no mistake, the acting is superb, but I fear everybody is mistaking the wonderful acting for an overall enjoyable experience, film, and directing. Sure, Anderson tries a lot of different things to make it seem like an important film (shooting in 65mm), but he never made it a captivating one. If many take away nothing from a film other than adoration for the director, then is it really a film worth seeing, or is it simply fodder for the critics?",
      "total_reactions": 1,
      "user": "AstorSapolsky"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "I tend to love dark and weird movies but this one, just didn't work at all for me. A matte of fact, I thought it was completely retarded. Experience at your own risk.",
      "total_reactions": 1,
      "user": "bitburn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "A good movie is inherently defined by its pleasurable viewing moments, and this movie delivers very few.  The loosely jointed plot never knits itself into any kind of coherent narrative, nor are there characters with whom one can identify or for whom one can root. It is much easier for a film to abandon the demands of  solid story telling, and this movie takes the easy way out in every sense.",
      "total_reactions": 1,
      "user": "franclinolin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "FUMBLING-ON-THE-FIVE-YARD-LINE",
      "total_reactions": 3,
      "user": "jhep"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Should I watch it again?, I really don't want to ... but I clearly missed something. This film totally flew over my head without touching it. Don't take me wrong, I see and understand what happens, but I just don't care. Pointless?!",
      "total_reactions": 1,
      "user": "Jalemany"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Paul thomas Anderson has once again made a movie that almost reach perfection; not only because of the beautiful cinematography, the unique soundtrack, and the amazing actings. But because of the fact that it's strenght comes from the little intense moments, and the deepness of the characters; not because of a story. The screenplay is great as it is. It is a proof that a film doesn't need a complex storyline to be great.",
      "total_reactions": 1,
      "user": "EnriqueKik"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "I went to see this movie because of positive critic reviews. Although there are good performances by the excellent cast, the overall movie is incomprehensible and boring. All four of us fell asleep. As a reference, I've fallen asleep during about 3 movies in my entire life. In my opinion and in general, it's a bad sign when the user score is dramatically lower than the critic score here on metacritic.",
      "total_reactions": 5,
      "user": "squeezings"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Very sorry to have to say that The Master was a major disappointment. This one LOOKED like a \"no-brainer\" based on the brilliant trailer, the tremendous cast, and being written and directed by Paul Thomas Anderson, whose last film, There Will Be Blood, was one of the most artistic movies of the 21st century. Although the story starts off intriguingly enough with Joaquin Phoenix brilliant in the role of a WWII vet struggling with a severe case of PTSD, once things soon meld down to essentially Clash of the (psychopathic) Titans (Phoenix vs Hoffman), the story never really goes anywhere, other than to provide Oscar bait scene chewing scenes for the two male leads. Don't get me wrong, the film LOOKS great (cinematography, sets, costumes), however, the overall feeling I was left with (at least 40 minutes before the film even ended) was frustration and disappointment of what COULD have been. This one is strictly for those interested in seeing some interesting acting choices from Phoenix, Hoffman and Adams. Past that,... I fully expect The Master to be expelled from theaters before Halloween. Save this one for your Netflix que,...if that. Grade = C-.",
      "total_reactions": 2,
      "user": "Bhawk"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Technically well done but did not like it otherwise.  Tedious, pretentious and too long.  Not a masterpiece by a long shot.  The critics have been well paid to write glowing reviews.",
      "total_reactions": 2,
      "user": "LISTEN2ME"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "Acting was a 9 out of 10, music and cinematography was also great....story itself, not so much. My girlfriend and I left the theater completely confused about what we just watched for 2 hours....story has potential but never develops.",
      "total_reactions": 1,
      "user": "vmd1020"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "Barely watchable, self indulgent, boring and a complete waste of the viewers time.  The acting is great.  Unfortunately the script hangs like a dead weight around their necks.  Audible snoring in the theater and I almost wished I could have joined them, but the noise was keeping me awake.",
      "total_reactions": 1,
      "user": "Jessied44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "I love to see all of P.T. Anderson's movies, but I might give up after this one.  He seems to have locked onto the idea of making movies now about the least likable characters possible.  Whereas most films create an idealized portrait of humanity, lately he goes the other way, creating movies with grimy, grisly characters who seem to have very little redeeming qualities, if any.  In \"There Will Be Blood\", I was okay with that because I thought it was just for one film.  But he delves even deeper into darkness with \"The Master\", and this felt more like an assault against the viewer in its dark mirth and creepiness than the real telling of a story.  The acting is, of course, incredible, but the biggest problem, for me, was that he seemed to take us to very dark places without it feeling like there was a satisfactory justification.  I didn't feel like the film had any payoff.  It was very interesting, and the acting was great, but it was super dark, and to me unsatisfying.",
      "total_reactions": 1,
      "user": "thedude74"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "\"The Master\" is too good to be written off as bad, but not good enough to be recommended without reservation. I think the director (PT Anderson) was going for an Kubrick-esque \"Eyes Wide Shut\" vibe, the camera lingers too long, there's discordant music accompaniment, and a nude women scene that's more cringe-y than enjoyable. Anderson was definitely driving a parallel to LR Hubbard and Scientology's earliest beginnings, no doubt, and the insight had some value. Juaquin Phoenix's portrayal of a derelict alcoholic was Oscar worthy but I still didn't like the character or his journey but those affected by alcoholism may identify with him. Overall, the pacing was too slow, I was on the FF button alot, and there was just minor entertainment or information value, so I can definitely understand why some think it's a waste of time. I personally wouldn't recommend it unless you're a Scientology groupie, someone affected by alcoholism, or a fan of the cast.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "The Master, the new Paul Thomas Anderson movie, with Amy Adams and Joaquin Phoenix, and what happen? The movie is AWESOME, have an interesting story, with an incredible development, the characters are awesome because the performances are really great, and the screenplay wow, cool. I love The Master.",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "The movie attempts to throw light on the cult phenomenon in America; instead it shrouds it in darkness.  The training scenes, based as they are in mind numbing repetition, are an ordeal to sit through.  Joaquin Phoenix is a  brooding presence but often is inaudible (a mercy?)  Hoffman is superb.  There are some sensibilities who will acclaim this a masterpiece; others a pretentious bore.  If you are in doubt, wait for the sure to come satire of it on SNL/",
      "total_reactions": 1,
      "user": "amboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "The longest 2.5 hours of the year. Unmitigated crap, self indulgent, pretentious and most of all boring. Oh yeah, excessively overacted as well. Anything Hoffman and Phoenix act in, the critics love. Even this terrible excuse for a movie.",
      "total_reactions": 1,
      "user": "Gads300"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "The entire movie made no sense.  Many of the scenes were equally nonsensical and Joaquin Phoneix's entire role was unnecessary.  Don't know what the critics saw or if they are afraid of the director but this movie is junk.",
      "total_reactions": 2,
      "user": "TheDavo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "I went into this movie with high expectations because of all the press it has received. Unfortunately, I was disappointed.   I kept waiting for the storyline to go somewhere and it didn't.  There was no plot to this movie.  While Joaquin Phoenix's performance was outstanding the movie itself was not.  You know it's bad when during the movie you look at your watch and say to yourself this movie is not over yet...geez!",
      "total_reactions": 2,
      "user": "bgirl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Both the intellectually amusing and the emotionally disturbing attributes of The Master make it a true and enjoyable P.T. Anderson movie. This is not a movie for everyone. Before watching this movie you should remember who it is coming from. If you think you understand previous P.T. Anderson's movies, then go watch it because you will enjoy it. If you don't recall any P.T Anderson movie then go with an open mind. And if you remember There Will Be Blood and Magnolia, and you are not sure if you liked them, then watch it but don't come back and write a negative review.",
      "total_reactions": 1,
      "user": "fernandohs"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "The Master left us confused and a little empty. Hoffman and Phoenix deliver dramatic portraits that take us nowhere. None of the characters were very likable.",
      "total_reactions": 6,
      "user": "Corekevin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "Joaquin Phoenix and Philip Seymour Hoffman, with these two great actors, this is what they produced?  There is no denying the tremendous acting ability of these two men, but the movie, stinks on ice.  I noticed my fellow theater goers checking their watch, as I was, to see how long we would have to suffer until it was over.   I had the opportunity to speak to some of the movie goers on our way out,  complete disappointment.",
      "total_reactions": 1,
      "user": "8eagles"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "This brings us to",
      "total_reactions": 2,
      "user": "erikcharter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "I have never felt more embarrassed recommending a movie to a group of friends - and on my birthday no less!  As a P.T. Anderson fan, I was swayed by the amazing reviews from the \"critics\".  I now wonder what Cool-aid they are drinking to give it such rave ratings.",
      "total_reactions": 3,
      "user": "nlightn"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "What a terrible disappointment. Great cast and director, terrific reviews and tons of boredom. The movie started off slow and we waited for it to get better. It never did. The performances were excellent  but the material wasn't there. I think the positive reviews of the story are what the reviewers expect to see and are projecting, rather than what the film contains. The audience chatter exiting the movie was overwhelmingly negative. I haven't been fooled this badly by critics since Punch Drunk Love.",
      "total_reactions": 3,
      "user": "ILikeMostMovies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "The actors were great, the story line was totally obtuse. It was the first movie I have seen a third of the audience walk out.  We discussed asking for our money back...no joy for us who have to wait to see one movie a month.",
      "total_reactions": 1,
      "user": "amby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Two hours and seventeen minutes of whaaaaa... My misconception was that this was about L. Ron Hubbard the founder of Scientology but it was about a fictitious founder of \"The Cause\".  I sure missed something.   I struggled through it hoping it would get better.  It didn't.",
      "total_reactions": 1,
      "user": "rkeinc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Some will say the storyline of The Master seems basic, and told in an overly convuluted way; however, any true movie-hound knows Anderson doesn't care about what's happening on the surface. It's all about the symbolism, and The Master is filled with fascinating meanings and subtle truth, the when looked for, hit you like a bullet train. It is a magnificent accomplishment in acting, writing, directing, editing, cinematography, and score, and the best American film of the year.",
      "total_reactions": 2,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Although it appears that others do appreciated the pace of the film, If found it  too slow for my liking. Had no other option to stop less than half way and give up on it.",
      "total_reactions": 1,
      "user": "loki-sf"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "I went into the cinema expecting a film that would take a serious or thought provoking view on Scientology or cults like it. What I got was 3 hours of tedious boredom in which It seemed to follow a cycle of Joaquin Phoenix displaying his sand fetish, Philip Seymour Hoffman repeating the same lines over and over then deciding to prance around like a lunatic and then when all interest is lost it puts on awkward nude scenes. Never before have I been to a film where the audience was either collectively falling asleep, swearing at the screen over how terrible the film is or cheering when they think it's all over but then have their hopes of escape dashed.",
      "total_reactions": 3,
      "user": "Apache287"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "If you hated this but loved Tree of Life, you need your head examined. Both are prime examples of an auteur filmmaker getting the opportunity to make pictures that go against Hollywood norms for the sake of their own artistry. It's a miracle a movie like The Master can even get made when the entire industry's sole purpose is profit. A movie like this doesn't get made to please the masses. Paul Thomas Anderson deserves credit for, once again, writing and directing a film that is reminiscent of Kubrick or Welles. Anderson's films appeal to an audience that enjoys great acting and character over repetitious conventions in plot development. Only a handful of movies like this get made a year that end up getting a nationwide major theater release and audiences should be welcoming it, rather than admonish it. Don't bother with The Master if you honestly believe Skyfall is worthy of a Best Picture nomination.",
      "total_reactions": 1,
      "user": "vdiaz9"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Pretentious, self consciously acted and ultimately boring film. Scene after scene drags on to little point or effect and the ending seemed vague. The three leads are not served well by the story or setting and i'm sure in a better focused film they would be considered excellent in their roles. However, that's what might have been. Paul Thomas Anderson seems to enjoy making these long and profound films and whilst I enjoyed 'Boogie Night' and There Will be Blood' to some extent I wouldn't say either of them were completely successful either. Also disappointing was the rather bombastic score. Only the cinematography shines through here. The end result was so what!",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "2 hours and 24 minutes of what seems to be rather an astonishing performance by Philip Seymour Hoffman and Joaquin Phoenix less than an entertaining and interesting narrative. The story lacks the gripping sense of delving into the world of a WWII veteran and his gradual involvement in a cult which aims to \"cure\" him and others of illness of the mind and soul. Instead it conveys a continuous and monotonous journey of Freddy (Jeaquin Phoenix) with no change in mental state or an arc for character development, nor is there really any objective/motivation of the protagonist, just a drifting nothing.  For a film that I had such high expectation, the film had me looking at my watch every two minutes and counting the aisles of the cinema room before taking a sigh of relief to the fact that the film was over so I could enter the boring reality of my world which is far more thrilling than Paul Thomas Anderson's 'The Master'. The subtleties of the plot could be picked up on giving it artistic merit but only to the fact that sometimes the script needed to be to the point and objective focused rather than babble on about nothing with no entertainment value or character development occurring. Of course, the film appears to be highly orchestrated and a beautiful craft of screenplay/film techniques, however, it is in dire thirst of the fundamental aspect of film...to entertain and strike interest.",
      "total_reactions": 1,
      "user": "AngusWard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "A rare breed of film which compels it's audience to think and come to their own conclusions about what they are witnessing. From the soundtrack to every poignant shot, 'The Master' demonstrates technical excellence and brandishes a superb cast. How such a momentous piece of work can be so grossly overlooked is unfathomable.",
      "total_reactions": 1,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "The Master is an interesting story with masterful performances by Philip Seymour Hoffman, Joaquin Phoenix, and Amy Adams. But it drags to a point in which you count the minutes until it is finished. But even after the conclusion of the film you are confused about what the hell just happened.",
      "total_reactions": 1,
      "user": "BrendanCogs99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Modern self-indulgent rubbish. Too long. I gained nothing from watching this. It's nicely photographed, but that is a given in the 21st century. The acting is fine, but this is a review of the movie as a whole. Don't waste your time.",
      "total_reactions": 1,
      "user": "Pugwash"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Two Word Critic: Pretentious Nonsense.",
      "total_reactions": 1,
      "user": "twodm"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "No movie is possibly as artless or worthless as this movie is. Since all the actors were great I should give them some credit, but I hated it so much. I rather have vomited than see this.",
      "total_reactions": 5,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "Terrible.  This is the kind of movie critics love but I can't find a single person I know who liked it so most of the positive reviews are just trying to be cool like the critics.  My wife fell asleep it was so boring.",
      "total_reactions": 1,
      "user": "westau"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"The Master\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is pretty much the worst movie I've ever seen. Good acting, but what for? There's no plot. They should either say that in the summary or just leave it blank. An absolute waste of time.",
      "total_reactions": 0,
      "user": "pr3d4tor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Truly remarkable performances from Phoenix and Hoffman, with the former (Freddie) portraying an navy veteran, a true outcast and degenerate, unable to conform, always following his instincts in contrast with the latter (the Master) who has it all worked out and will not reason with anyone who does not believe in 'The Cause', a philosophy of life he introduced and cultivates and promotes through his method.  When the two men are brought together, they inevitably effect one another, with the Master inspired the animalistic behaviour of Freddie whilst Freddie goes on a journey to find himself.  I would not be surprised if this film wins a number of awards especially for acting.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "The film is beautifully shot, making full use of the various surroundings they find themselves in. The use of music from the period was quite effective also, not always to my taste, but it seemed to fit pretty well. As to performances, well, all the major parts were excellently portrayed with Philip Seymour Hoffman standing out. I found I really paid attention to every scene he was in; without him, meaning no disrespect to the other actors involved, it kind of fell flat. I though Amy Adams was excellent too, although I felt she was underused. There appeared to be an awful lot of improvisation, particularly from Joaquin Phoenix and I found these scenes very hit and miss. I sometimes felt like I was watching an acting class. As far as the narrative goes, well I found it meandering; it was very slow (not that this is always a bad thing) and when we did get to a point it would then go off in a totally different direction. Over all, it didn’t stand out as the particularly outstanding work the critics seem to think it is; but then again, I don’t have to watch all the dross they have to on a day to day basis. Maybe I have to watch a lot of really bad films and then watch this one again, but for now it’s ‘Recommended’, but only just.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Joaquin Phoenix returns to the screen as an extremely troubled WWII vet, who falls in with a religious cult leader (Philip Seymour Hoffman). The somber tone that pervades this film would have you believe that it",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "The cinematography wraps a quaint, pleasant world around two men navigating a hopeless search for order in the world and themselves. The audience won't immediately identify with the manic behavior or violent mood swings (Rex Reed hates anything that isn't immediately likable like a dessert), but the audience will certainly identify the religious aspects and human behavior surrounding tightly-gripped philosophies and beliefs: certainty, skepticism, narcissism, insanity. It's serious, funny, subtle, just perfect to dissect and enjoy.",
      "total_reactions": 0,
      "user": "Scraper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The Master with Joaquin Phoenix and Philip Seymour Hoffman  altho the acting was very good the story was repetitive and unfulfilling. My understanding had been it was about an L Ron Hubbard type charlatan and a mentally crippled WW2 soldier looking for something. It sometimes got a hit but more frequently seemed comatose and missed the ball...I expected something more incisive and not obscurantist poetic.",
      "total_reactions": 0,
      "user": "lholz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "It's enigmatic trailer drove a lot of curious minds to the theatre in the hopes of gaining clarification on the mystery P.T. Anderson presented. What we left with instead were many more questions. The film is, undoubtedly, a puzzle. P.T. Anderson's usually straightforward, grounded style is eschewed in favor of a centrifuge of ideas and emotions all tossed around, reminiscent of Slaughterhouse Five's blend of moments to create tone while still throwing the audience andy time it thinks it has a grasp on the meaning of the work. The film's \"message\", if it has one, doesn't become clear until long after one has left its seat, and the internal debates the film instigates will last even longer. With cinematography as sharp as There Will Be Blood and performances as stellar as Magnolia, P.T. Anderson's puzzle is a glorious one, and one well worth solving.",
      "total_reactions": 0,
      "user": "NKOAS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I would not recommend for mainstream movie-goers. It's a visually impressive display of equally impressive performances, but the lack of a traditional narrative will likely alienate most audiences. This is not a \"normal\" movie by any means.",
      "total_reactions": 0,
      "user": "kenster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "One thing that will drive me to go see a movie is the widely varying reviews here on Metacritic - like those for The Master. A lot of people hated it - A lot of people loved it - and as a Hollywood citizen who has to walk by Scientology centers offering me free personality tests, or their Museum of Death (by psychiatry) to get to the Cinerama Dome - I was already a bit intrigued - plus I was having a boring day and thought I'd kill a few hours and make up my own mind.",
      "total_reactions": 0,
      "user": "Headcrusher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "It's not a perfect film but the effect it had on me warrants a perfect score. It has the best performances of the year with Joaquin Phoenix playing Freddy Quiad and Philip Seymour Hoffman playing Lancaster Dodd. It may be to long and some scenes may not work as well as they should but the overall effect of the film is undeniably powerful. At the end of the film a failed to get out of my seat it was that thought provoking and powerful.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The Master is the movie to beat this year. If you want a movie to think for you go see something else. Without a doubt the movie will polarize it's audiences. But what did you expect from Paul Thomas Anderson? The same person who brought us \"There Will Be Blood,\" \"Boogie Nights,\" and \"Magnolia.\"",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "I believe this is a fine film.Forget everything except the interplay between \"the Master\" and his acolyte-Fred, each of whom is unforgetably portrayed. There is an underlying and far from explicit suggestion of homosexuality between the two men, plus the explicit portrayal of master-slave relationship. Fred has a family background of psychosis and alcoholism, while master demonstrates  strong evidence of domination.The movie moves slowly which is its main failing, but disregard allbut the two men, their strengths and weaknesses. A strong Oscar contender for picture and best actor(s).",
      "total_reactions": 0,
      "user": "drchoc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This has potential - as with Anderson's other spectacular films - to be one of the most important pieces of cinema in the past 50 years. It's a story of power, control, desire, moving on, and relapse. It's magnificently acted, terrifically scripted, and gorgeously shot. This is the epitome of electrifying filmmaking.",
      "total_reactions": 0,
      "user": "LetzTalkMoveez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "Great acting from Philip Seymour Hoffman and Joaquin Phoenix, but the film is boring and self-indulgent. It is way too long; it doesn't go anywhere. It's definitely way overrated by the critics.",
      "total_reactions": 0,
      "user": "marioping"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Perceived as my most anticipating film of 2012, THE MASTER is Paul Thomas Anderson’s ambitious comeback after THERE WILL BE BLOOD (2007, 9/10), 5 years interval may be too long for PTA fanboys, but again the wait is unmistakably deserved.    Post-WWII, a USA naval veteran inadvertently hops on a yacht one night and is hooked on a cult named “The Cause”, lead by its eloquent yet irascible master, while being an avid follower of the master, his perennial booze-abusive, sex-driven, violent nature enables himself to be the soul needs salvation, a side-kick and a role model, it also encroaches his mental realm and life orientation, eventually challenges his loyalty with The Cause and the master. PTA’s trademark roving and tracking long-shots maintain as engaging as any directors could ever achieve, not obtrusive but impeccably tally with the storytelling; the retro-soaked palette authentically establishes a mystic aura of the inexplicable internal mechanism of how our emotion rises and falls, attended by a rhythmic score from Jonny Greenwood.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Every so often we get a film that challenges us--this is that film for 2012. Joaquin Phoenix, Amy Adams and Philip Seymour Hoffman each give some of their finest work. With such boldness and poetry through the eyes of Paul Thomas Anderson, The Master will not be easily forgotten.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "I think that if you had no idea who PT Anderson is you could pick out his movies by now. He has created another wonderfully atmospheric film full of  broken multilayer-ed characters. This film falls short for me where many other Anderson films have, I don't care what happens to these characters, I never become emotionally invested in them. For me that is what keeps most of his films from going from very good to great. However I don't know if I want Anderson to create those types of characters because his films always haunt me for weeks, and his characters are so ambiguous that I find myself in wonderment of who they are and where they came from. Phoenix and Hoffman, and Adams for that matter, are all excellent in this film. Phoenix and Hoffman's scenes together are mesmerizing. Their characters are so emotionally complex that we become immersed in their misery and desperation.  I am immensely looking forward to revisiting this film again in the future.",
      "total_reactions": 0,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "The Master is set in the early years of 1950, where I was instantly introduced to Freddie Sutton, played by an amazing performance from (Joaquin Phoenix), which I believe will win his first Oscar. In the first couple of scenes, I realize that Sutton is a very heavy alcoholic, who is also a war veteran, and does not have a stable mind. After getting to know Sutton",
      "total_reactions": 0,
      "user": "Tbrown15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "I truly did like this one, though I do not find it to be as deep and sophisticated as many critics and others who have watched this one. At the end of the day, this one has themes like every other film, but for the most part, the question, \"What is this one about?\" can be answered by saying that it is a character study of a deeply troubled man and his father-son type relationship with a cult leader. Nothing profound or deep and, to me, many people are looking into this one too closely and looking for something that is simply not there. Now, onto the film itself. Joaquin Phoenix and Philip Seymour Hoffman are fantastic and are a great juxtaposition to one another, as Phoenix is over the top, unhinged, violent, and angry, while Hoffman is calm, cool, collected, and calculating. Amy Adams is also good here, though I do wish her role was larger, but at the end of the day, this one is about Phoenix and Hoffman's relationship. The script here is also very strong and does a fantastic job developing the characters. The cinematography is gorgeous, in particular the repeated shots of the water and then the shots of them in desert. Really well done and beautiful to look at without question. Paul Thomas Anderson's direction is also strong as well. After watching Punch-Drunk Love and not liking it after having loved There Will Be Blood and liking Hard Eight, I was still worried that maybe Anderson's films would be more hit and miss for me. However, this one convinced me that that may not be the case, as his direction and this film were really good. At the end of the day, The Master is not for everyone, but for me, it was right up my alley.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "One of the most interesting and highest quality movie I have seen for a long time. The acting was superb. Mr. Joaquin Phoenix and Mr. Philip Seymour Hoffman acting was more than brilliant. Amy Adams was also great in her role. What is that movie about? I think it is a character study and a meditation on the human desire to find its place in life. This is shown through the life of a \"lost\" man who is looking for happiness, a purpose and a bond with others (a family of some sort). This way He (Phoenix) bumps into the Cause, and meets the Master (Philip Seymour Hoffman). The Master is a man who is also kind of \"lost\" in life, and tries to find his happiness and place trough the cult he is leading. In the movie we see a snippet from the life of a cult and the people behind it. These people (like many other people) try to find a meaning behind their life. I think this was the main theme of the movie, beside many more themes... in my opinion",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This film was just spectacular and Paul Thomas Anderson continues to impress over and over again. For my full review check out:",
      "total_reactions": 0,
      "user": "alsukes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Although the acting was solid, the movie was confusing and depressing.  Maybe that's saying something for Phoenix's acting because he was such a sad character, I wanted to leave the movie.  Maybe the movie's success and/or failure was in the fact that modern day psychology uses some of techniques that the so-called cult leader used, making followers believe at first he is a good guy.   Phillip Seymour Hoffman really looks like he has high blood pressure in all his latest movies, so I'm beginning to think it's not acting that makes him red-faced.  His smoldering character in this movie was similar to his priest in Doubt.  A solid downer of a movie, great or not----you decide.  Don't make it for a date night.  Make for that night you plan on drinking yourself into oblivion.",
      "total_reactions": 0,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "While I admit to being a huge PT fan, I'm not averse to calling out his flaws and errors: for instance: While I enjoyed TWBB more than the Coens 'No Country for Old Men,' I thought NCFOM deserved best picture on account it was a tighter script and a more cohesive picture overall.  After reading some of the critics reviews about The Master I was genuinely worried that the errors of TWBB were expanded upon in PTs latest film. Two friends of mine, huge PT fans as well and very astute cinematic watchers seemed more baffled than intrigued after watching The Master and this worried me.  I became anxious ratehr than excited as my turn came to watch the movie that I was gonna find PT had went over board with his ego and contented himself with obfuscation for the sake of perplexing his audience as an end. A dread came over me that there would be proof that my god - PTA - was a false one.  I am far too honest, even when watching my gods fall, to fabricate or justify my their existence, regardless of the medium.  My favorite author, Cormac McCarthy, who has written my favorite book in Blood Meridian proved perfectly capable of not only writing tripe, but publishing it in his play, 'Sunset Limited. ' So when I say that The Master is anything but tripe, please entertain the idea that Im no acolyte and I am concluding this honestly. I have no intention of convincing anyone that you will \"like it\" once watched, but I assure you this is one of the most intimate and honest investigations into a wounded soul and what happens when it is remedied by a master of illusions.  If you do not grasp how completely damaged Freddie Quell is (And its not even an intellectual acquisition, its a simple one - PT puts it all on the screen) and what happens when he runs into this first rate charmer and con-man, the formula is astounding and a narrative honesty unfolds.   Im not sure that my experience of meeting dozens of con-artists and charlatans and having watched debauched, rakish,  atheists and agnostics go from partying every night to singing all things Jesus the very next morning, had anything to do with how I understand this film, but it may have helped.  Once I fell in line with Freddie, and became the reactionary simpleton that he is, the story holds true form there till the end.  From this angle it is an extraordinarily tight narrative and the advent of the semi-quack in Dodd only solidifies the psychological trajectory of both men right until the very last scene. I disagree with all those who believe this movie is \"trying to be complex.\"  There are several critics that suggested this despite giving the movie very high ratings. Sure, i think the more you dig, the more you get, but you dont have to take seminars on film making, or to be familiar with quantum physics or to have read Derrida or any other high-brow philosophies on consciousness or culture in order to compute this film.  I suggest just discover Freddie's wounds, assimilate to the simian-like simpleton mind he has (with accompanying traumas) in the beginning and everything will follow from there. Again, even if you do this, Im not promising youll like the film as much as I did, but I think youll see that PT wrote a particularly rich and tight script.  Hes not trying to get away with any pseudo-complexities to pass of for high-art.  Its mostly a simple story, with some questions I still have not answered - but they're in the periphery, not wholly detrimental to the story - but it is high art, in the simplest of forms.  A tall order and few could have pulled it off.",
      "total_reactions": 0,
      "user": "MWayne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "\"Genius Madhouse Escaped Lunatic\"",
      "total_reactions": 0,
      "user": "jordantmcgill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Was curious as to why the reviews are either \"OH NO\" or \"MUST GO\", and upon viewing, now know why. This film is aimed at a very small segment of the population, dealing with heavy philosophical issues, existential angst, man's need for ultimate truth, manifest destiny and the weaknesses of the human spirit. If the names Sartre, Kafka, Tolstoy, Wilber, Dyer and Hubbard mean nothing to you; and the terms Existentialism, Integral Theory, Dianetics and New Age as well, chances are you will hate this film. And you won't be alone, in that probably 2% of the population has even heard of these concepts.",
      "total_reactions": 0,
      "user": "Spike69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "To Spike 69:  I agree that Mr. Thomas aims at big themes.  But, but, but, he is not Sartre, Tolstoy, Kafka, etc... and neither is Mr. Hubbard or dyanetics philosophyl.  Let's keep it in good measure.",
      "total_reactions": 0,
      "user": "Feigastrul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Submerged below the apparent, surface theme of animalism vs perfectionism are several levels of human emotional and pragmatic intentions with the deepest level hidden by the murky waters of societal taboos. Framed by succulent cinematography and an appropriately disturbing musical score, the tormented souls interact in dances of self protection and manipulations of others. In the shallow depths of this art piece we are explicitly allowed to view the baseness of Quell and the calmness of Dodd. But intertwining with the surface are the contradictions within both character's personas. Dodd wants Quell as protege but also as guinea pig. Quell desires some freedom from his desires and is constantly thwarted in his efforts. However, it is the intertwining next level below where the central, deepest theme flows. Submerged (suppressed?) below in the psyche of both men is a desire unspoken during the mid twentieth century. A desire revealed during their last meeting. A desire seen suppressed in previous scenes by the standards of the day which embed themselves within the characters. FULL SPOILER ALERT:  the opening scene is full of partially clad men of the navy with a woman made of sand to defile. We are not privy to the initial meeting of Quell and Dodd but Dodd makes reference to Quell being a scoundrel. During \"processing\" Dodd asks about hanging out in bus stations and sex with family members. What is he getting at?  When Dodd dances and sings in Philadelphia, the women from Quell",
      "total_reactions": 0,
      "user": "zbob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Alla fine, uno si chiede: ma Freddie, in fondo, ha sempre e solo considerato importante il sesso? Forse non la più profonda tra le tante domande che possono nascere dalla visione di 'The master' ma, come tutte le altre, è impossibile fornire una risposta certa. Nel film che, per molti, è stato il vincitore morale dell'ultimo festival di Venezia, Anderson (suoi anche soggetto e sceneggiatura) si limita a raccontare, senza l'esigenza di dare spiegazioni o esprimere giudizi: se Lancaster Dodd può ricordare vagamente Ron Hubbard, La Causa si rifà a Scientology come potrebbe ispirarsi a qualsiasi altra setta basata sul condizionamento mentale. L'interesse del regista è incentrato sulle dinamiche interpersonali: la più importante è quella tra i due protagonisti principali, ma le altre sono comunque necessarie per delineare il microcosmo in cui si svolge l'azione, a partire dal rapporto (di forza) tra Dodd e la moglie Peggy. Da tutto ciò si possono dedurre con facilità due considerazioni: si tratta di un film complesso, tutt'altro che immediato anche perché la storia è quasi solo un esile pretesto (motivo per cui l'opera ha la sua schiera di detrattori fra coloro che pensano che due ore così siano eccessive o inutili); perché ogni cosa funzioni, è necessaria una maiuscola prova d'attori. Il che puntualmente accade, con un cast ben assortito e funzionale su cui giganteggiano Phoenix e Hoffman (con relativa pioggia di premi e nomination che coinvolge anche Amy Adams che è Peggy). Il primo interpreta Freddie, un marinaio reduce della Seconda Guerra Mondiale con più di un problema annidato in una psicologia incline alla violenza, dandogli una camminata e un modo di parlare da Braccio di Ferro vestito come Humphrey Bogart (ah, i pantaloni a vita alta..), ma mantenendo in miracoloso equilibrio un ruolo a forte rischio caricaturale. Il secondo è invece Dodd, pifferaio magico capace di parlare molto senza dire nulla e riuscendo comunque a condizionare le menti di chi ne subisce il fascino fino alla commozione, come la Helen Sullivan nei cui panni ho ritrovato, dopo una vita, Laura Dern. Freddie entra nella sua orbita, complici anche i fortissimi liquori che egli stesso fabbrica, ma, pur restando coinvolto nel rapporto maestro-allievo (anche se 'maestro' non rende appieno l'originale 'master'), riesce a mantenere sempre una sottile linea di resistenza alla completa sudditanza :è vero, qualcosa ci perde",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "An unusual, atmospheric film.  The story seems to start in the middle and end a little later in the middle.  It is a series of questions that ends in a question. Joaquin Phoenix really inhabits the role of Freddie.  Just sitting in a theatre I was uneasy from the violent rage he projected. In the final analysis, it pleases because it leaves one thinking about the film, the characters and the meaning of it all.",
      "total_reactions": 0,
      "user": "Austin101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Dustin Hoffamn and Joaquin Phoenix are remarkable",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I see a lot of people seem to think this movie is pointless (an accusation never thrown at movies with explosions or CGI) which is sad because this is the most substantive movie in many years. The elephant in the room here is religion. The easiest thing to take away from this film is exploration of religions positive and negatives effect. A lot of people wanted this to be a scientology takedown and found themselves wanting to look away when they realized the only criticisms coming their way could also be applied to their religion.",
      "total_reactions": 0,
      "user": "bulletpark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Paul Thomas Anderson's \"The Master\" represents everything a challenging movie should be  compellingly dissonant performances, intentionally vague thematic ideas, and a virtual plentitude of eye-catching images. It may not be for everybody, but it's definitely a philosophically engrossing ride.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "I saw the movie at the Venice Film Festival. I loved it: deep, well directed and acted in an extraordinary way. I found great interpretation of P. S. Hoffman.",
      "total_reactions": 0,
      "user": "wagny70"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Very beautifully acted, a really great cinematographic achievement, however i do think this movie is really difficult to connect with as an audience. 6/10",
      "total_reactions": 0,
      "user": "SlimShaddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "When a director has such a fame as PTA has - with people calling him wunderkind, the next blabla and other appalling names - it is inevitable that each new film tends to be seen as a new step in his career, as if his works were all connected. I don't think this is the case: The Master kind of stands alone amongst PTA's filmography, and I must confess, if I were to rate it comparing it with his previous films, I'd give it a 4.",
      "total_reactions": 0,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "The Master symbolizes our inner fight. Our friend, ruler or foe. Unexplained human reaction explained by ghosts of the past. Group that practice no sensitivity judges the stranger as feeble-minded but they all envy him on his freedom. People create conditional love unconsciously... Beautiful pervaded philosophical work.",
      "total_reactions": 0,
      "user": "Coffeeandcream"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I consider Anderson's \"The Master\" to be one of his weakest narrative films. Yet, Anderson's weakest film can still be considered as a great film when compared to other film maker's works. While Phoenix and Hoffman's performances were phenomenal, they really out shined their supporting cast.  The screenplay and plot were above average in comparison to other great original screenplays such as \"Amour\" or \"Django Unchained.\" What really stood out in this film were the technical elements. The directing, music, editing, and cinematography had a unique Paul Thomas Anderson signature. This same signature that brought some of the best films of the 2000s. Anderson is, in my opinion, one of the greatest auteurs of his generation. It is difficult to meet the standards that you have set yourself. I'm still a fan!!",
      "total_reactions": 0,
      "user": "thairocks88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is interesting and it has something to say. Sometimes it is brilliant, sometimes not.",
      "total_reactions": 0,
      "user": "MBond1810"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "this movie is not for people whom are not movie lovers. this artwork is a masterpiece and actually PTA is The Master. acts are brilliant. Hoffman is great as always and this is Joaquin's best act ever. along side with The Holy Motors, the best movies of 2012... if you know about movies and PTA, this comment is unnecessary and you already ignored the low scored reviews.",
      "total_reactions": 0,
      "user": "farhoodn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "THE MASTER is a very pretty turd of a film. Beautifully shot and acted but it's an incomprehensible mess. I've yet to find a person who can actually explain it, but quite a few who will leap to: \"the point is there is no point! It's art!\"  Really? In that case, I point you to the episode of the original Batman TV series where The Joker enters a \"painting\" into an art contest that's just a blank canvas, entitled \"The Emptiness of Life\". That managed the same trick and didn't take 2.5 hours to get there.  There's an ever-present sense while watching THE MASTER that something deep and profound is going on just out of sight, but the film itself can't seem to find it.  Maybe that's its point about Scientology, but if so, again, I say \"cheap trick\". Well, Darren Aronofsky had THE FOUNTAIN and now PT Anderson has his \"so incomprehensible the critics are afraid to pan it, but quickly forgotten\" film, too.",
      "total_reactions": 0,
      "user": "jcasetnl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "strong and smart perfomances, this is a movie teach you how can you change, and the most important the script is something than you never forget......",
      "total_reactions": 0,
      "user": "JosephMarroquin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "It's an extremely slow movie which gives you no conclusion neither during the movie nor at the end. But what special about this movie is it's plot which is so deep and artistic that even you were getting bored with the slow pace but you will keep wondering what going to happen next. These are certain high moments as well. Joaquin phoenix is great as always.",
      "total_reactions": 0,
      "user": "Nitish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "The Master is a well-executed and thought-provoking drama from Paul Thomas Anderson that raises many moral questions, and refuses to accept easy answers. While countless directors have gone down the \"dystopian future \"road, Anderson creates a very interesting \"dystopian past\". Now I use this term loosely because this film is based in real society, but the dystopian part shows in the mind of PTSD sufferer Freddie Quell, a disturbed man who is drawn in to the lifestyle of Lancaster Dodd, a cult leader. While the film may overstay its welcome in the final third, it's still a great and important picture.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Horrible, boring movie that critics love so that they can feel intellectually superior to the rest of us who just don't 'get\" the move.  Boring.  Pointless.  No plot, no resolution.  But hey, the acting is good.",
      "total_reactions": 0,
      "user": "pinkpheonix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Wow what a dud. In the 60's when I began looking more critically at movies, character development, production values, etc., nudity, people masturbating, puking was kind of shocking. Now, with the advent of so many minor league producers and directors, it is commonplace. The notable part of this disaster was having such an array of fine actors scrummed in this lightweight, faux masterpiece.",
      "total_reactions": 0,
      "user": "Zhiemie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "If There Will Be Blood is the best movie that Paul Thomas Anderson has ever created, then The Master fills in the 1.b. category on the list of his movies. The Master is as artful and cerebral as its acclaimed predecessor, and one of the best movies of the decade so far.",
      "total_reactions": 0,
      "user": "Caesaroctopus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "The Master is not only Paul Thomas Anderson's best work but it is also one of the very best art films in cinema history. It is shot beautifully, acted superbly, written and directed in the best possible way. No, it is not a type of film that can be comprehended just by first viewing; it requires revisiting like 2001: A Space Odyssey. This film divides the audiences into two different reactions; they love it or they hate it. Not just mainstream audiences but also to critics and film lovers (which doesn't happen so often). If you are a serious audience who appreciate pure art-house cinema, this will be a wonderful gift for you. If that's not, this might be a nightmare; a very terrible one.",
      "total_reactions": 0,
      "user": "hillfingerh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "This is a work of art and Paul Thomas Anderson has constantly shown us again and again that he may be the most artistically gifted film-maker working today. Although it's brimming with philosophical ideas about deception, manipulation, scientology and psychiatry and pervaded with beautiful visuals, at its essence the Master is a love story. It follows the storyline of a Naval veteran (brilliantly played by Joaquin Phoenix) who arrives home from war unsettled by the traumatic events he's been through and unsure of his place in the world. By the end of the film, we learn that the real question to ask isn't if he's ready to be a part of the world, but, \"Is the world ready to know him?\".",
      "total_reactions": 0,
      "user": "AkashVijay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "I personally consider this film better than There Will Be Blood. The decisions of filmmaking were extremely original and with purpose, the performances are perfect, the directing is top notch, the story is intriguing, complex and engaging. I am not even sure If i got the whole thing! But the things that i got made me love this movie. The use of music is perfect to set out the tone and the characters are very interesting and well written. Paul Thomas Anderson again brings us a masterful film that is misunderstanded now.",
      "total_reactions": 0,
      "user": "PfenderStrat621"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "it gets a ten because the thought of amy adams being smarter than hoffman would kill him in real life... not to mention the scene in the prison cell and the fact that modest mouse told me to watch it.......makes it automatic ten...also love cults to death",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "When I first watched The Master I didn't really like it that much. I thought the movie was slow and kind of dull on my first viewing, but after re watching it for a second time, I really liked this movie and the film did grow on me after awhile.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Superb acting is in this film - for viewers who love to see actors tear themselves apart with a role, here it is. Phoenix and Hoffman are at the pinnacle of their respective abilities. Phoenix, playing Freddie Quell draws you in the minute you see his creased up face answering questions from a psychological evaluation post WWII. Hoffman, the deranged but maybe even genius Lancaster Dodd does exactly what he always does - makes you fall dearly in love for twisted and maniacal men. And to give due credit to Paul Thomas Anderson, a director who literally can't have a bad idea; this is one of my favorite directors and this movie is what sparked my interest even more than it ever was in method-acting, the Daniel Day-Lewis-esque idea. With both Philip and Joaquin getting an Academy Award nomination, Amy Adams must also receive due credit and recognition for playing the far-seeing Peggy, whose eye's seem to be peering through people rather than at them. She received a nomination as well. I love this film and these actors. Watch it!",
      "total_reactions": 0,
      "user": "Zadaris2021"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "The Master directed by the masterful director Paul Thomas Anderson starring Joaquin Phoenix, Philip Seymour Hoffman and Amy Adams is again a good movie from Anderson. First of all there's some really good acting, and by good I mean Oscar worthy performances especially by Phoenix and Hoffman. Some excellent writing too. Just only looking at the scenes where Hoffman's character is questioning Phoenix's character. The writing is just very good. The cinematography is also just beautiful. Long takes, a good use of focus and lighting makes this a very beautifully looking picture. At certain scenes I was just smiling, not because there was something humorous, but because it was so well done on every level. But where this movie flaws is where certain scenes felt a bit unnecessary and out of place. This movie is already vague at some moments and these scenes make the movie even more vague and overly convoluted at times. This can really take away the enjoyment of this movie for you. Especially when those scenes keep on going for too long. This leaves the viewer with questions in the end. This is that kind of movie that really needs a second view because the plot is at times too convoluted for its own good.",
      "total_reactions": 0,
      "user": "Rutger-Kikkert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Truly one of the best films from this past decade. Amazingly acted and beautifully shot, The Master is the tale of one man who truly becomes his own master, while providing a thoughtful critique on human organizations. One of Paul Thomas Anderson's best works.",
      "total_reactions": 0,
      "user": "The3AcademySins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "The Master is not quite a masterpiece, but it is a solid thought provoking film. It isn't enrapturing and it doesn't grab a hold of you and drag you in, but it does raise questions about post-WW2 ptsd, the charismatic nature of cult leaders, and why they can exist, and self doubt about one's work. It is beautifully shot and it does lift and lower your spirits, with humorous and somber moments. The dialogue is not deep in words, but it feels concise and to the point; there are no wasted words. The chemistry between Hoffman and Phoenix is visceral and beautiful. It made me want Hoffman to succeed as a leader, partly because of his frustration and humanness, but at the same time, I know he is a cult leader with, literally, out of this world beliefs.",
      "total_reactions": 0,
      "user": "jmain504"
    }
  ],
  "metascore": 86,
  "name": "The Master",
  "num_weekends": 19,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 9,
    "year": 2012
  },
  "opening_weekend_income": 736311,
  "opening_weekend_income_currency": "$",
  "rating": 7.1,
  "rating_count": 110855,
  "rating_freq": {
    "1": 2505,
    "10": 10247,
    "2": 1653,
    "3": 2377,
    "4": 4180,
    "5": 8493,
    "6": 16465,
    "7": 26708,
    "8": 24544,
    "9": 13683
  },
  "release_day": 21,
  "release_month": "September",
  "release_year": 2012,
  "user_review_count": 409,
  "votes_per_demo": {
    "aged_18-29": 39895,
    "aged_30-44": 42792,
    "aged_45+": 10820,
    "aged_under_18": 210,
    "females": 13270,
    "females_aged_18-29": 5523,
    "females_aged_30-44": 5386,
    "females_aged_45+": 1754,
    "females_under_18": 17,
    "imdb_staff": 12,
    "imdb_users": 110855,
    "males": 82986,
    "males_aged_18-29": 33936,
    "males_aged_30-44": 36784,
    "males_aged_45+": 8874,
    "males_under_18": 187,
    "non-us_users": 57788,
    "top_1000_voters": 542,
    "us_users": 22534
  },
  "year": 2012
}