{
  "avg_rating_per_demo": {
    "aged_18-29": 7.5,
    "aged_30-44": 7.0,
    "aged_45+": 6.8,
    "aged_under_18": 7.9,
    "females": 7.6,
    "females_aged_18-29": 7.7,
    "females_aged_30-44": 7.3,
    "females_aged_45+": 7.2,
    "females_under_18": 8.2,
    "imdb_staff": 6.8,
    "imdb_users": 7.3,
    "males": 7.2,
    "males_aged_18-29": 7.4,
    "males_aged_30-44": 7.0,
    "males_aged_45+": 6.7,
    "males_under_18": 7.7,
    "non-us_users": 7.2,
    "top_1000_voters": 6.3,
    "us_users": 7.0
  },
  "avg_screens": 1206.4,
  "budget": 105000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 8,
    "year": 2013
  },
  "critic_review_count": 493,
  "duration": 143,
  "genres": [
    "drama",
    "romance"
  ],
  "gross_income": 144812796,
  "max_screens": 3550,
  "mc_avg_user_score": 7.3,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 171,
  "mc_movie_name": "The Great Gatsby",
  "mc_negative_rating_frequency": 61,
  "mc_positive_rating_frequency": 537,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "It’s a terrific adaptation that succeeds not only as a work of cinema but also, wonderfully, as proof of the novel’s greatness. In short, the picture rebukes the revisionists even while entertaining them."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "Amidst all the fireworks and the cascading champagne and the insanely over-the-top parties, we’re reminded again and again that The Great Gatsby is about a man who spends half a decade constructing an elaborate monument to the woman of his dreams."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "Baz Luhrmann’s The Great Gatsby is the first must-see film of Hollywood’s summer season, if for no other reason than its jaw-dropping evocation of Roaring ’20s New York — in 3-D, no less."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "Now comes director Baz Luhrmann, who’s incapable of taking anything literally, and what do we get? The “Gatsby” that, of three I’ve seen and two I’ve read about, seems most faithful to the spirit of Fitzgerald’s superbly sad book. His audacity pays off in a way that may not exactly reproduce the novel but continually illuminates it."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "When the camera glides down a pier to settle for the first time on Gatsby's face, it's a movie-star moment of the sort we don't often get anymore, and there aren't many actors who could pull off Gatsby's mixture of confident charisma and pathetic vulnerability."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "As a purely sensory experience at the movies you're hard-pressed to find anything more dazzling than the first 90 minutes of The Great Gatsby, when Luhrmann's riotous amusements make anything possible."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "The Great Gatsby is both swooningly romantic and giddily energetic."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "This movie hangs utterly on performance, and DiCaprio’s Gatsby is mesmerizing."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "It is, as I suspected, a gargantuan hunk of over-art-directed kitsch, but it makes for a grandiose, colorful, pleasure-drenched night at the movies."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "The actors emote up a summer storm. Maguire’s otherworldly coolness suits the observer drawn into a story he might prefer only to watch. DiCaprio is persuasive as the little boy lost impersonating a tough guy, and Mulligan finds ways to express Daisy’s magnetism and weakness."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "You can find fault with virtually every scene in Luhrmann’s The Great Gatsby — and yet in spite of all the wrong notes, Fitzgerald (and the excess he was writing about and living) comes through. The Deco extravagance of the big party scenes is enthralling. Luhrmann throws money at the screen in a way that is positively Gatsby-like, walloping you intentionally and un- with the theme of prodigal waste."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "Less a conventional movie adaptation than a splashy, trashy opera, a wayward, lavishly theatrical celebration of the emotional and material extravagance that Fitzgerald surveyed with fascinated ambivalence."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "It's an expressionist work, a story reinvented to the point of total self-invention, polished to a handsome sheen and possessing no class or taste beyond the kind you can buy. And those are the reasons to love it."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "No matter how frenzied and elaborate and sometimes distracting his technique may be, Luhrmann's personal connection and commitment to the material remains palpable, which makes for a film that, most of the time, feels vibrantly alive while remaining quite faithful to the spirit, if not the letter or the tone, of its source."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "It's a dazzling time capsule of a shimmering era and a devastating look into the dark side of the American dream. Too bad Luhrmann, the caffeinated conductor, doesn't trust that story enough. He'd rather blast your retinas into sugar-shock submission. Uncle, old sport! Uncle!"
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 63,
      "summary": "Even when the movie's not working, its style fascinates. That \"not working\" part is a deal breaker, though — and it has little to do with Luhrmann's stylistic gambits, and everything to do with his inability to reconcile them with an urge to play things straight."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "It has in Leonardo DiCaprio — magnificent is the only word to describe this performance — the best movie Gatsby by far, superhuman in his charm and connections, the host of revels beyond imagining, and at his heart an insecure fraud whose hopes are pinned to a woman."
    },
    {
      "critic": "Richard Larson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "This is a film which takes classic source material and imbues it on screen with a sense of wonder commensurate to its prior form, perhaps offering an even more visceral impression of the possibilities inherent to this beautiful, tragic world."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "What Luhrmann makes intoxicating is a sense of place – the houses, the rooms, the city, the roads – and the sense that all this is unfolding in a bubble like some mad fable. Where he falters is in persuading us that these are real, breathing folk whose experiences and destinies can move us."
    },
    {
      "critic": "Jane Crowther",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Gatsby fans will be unoffended yet untransported, but soundtracks will sell, DiCaprio will be on bedroom walls again and new readers may discover the book - which is no bad thing."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The acting is really good, particularly Leonardo DiCaprio as Gatsby. But boy, with a running time of nearly 21/2 hours and a near-constant bombardment of visual overstimulation, it’s exhausting."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "More often, Gatsby feels like a well-rehearsed classic in which the actors say their lines ably, but with no discernible feeling behind them."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "Like Romeo + Juliet (1996), Luhrmann’s version of The Great Gatsby emerges as a half-reverent, half-travestying adaptation that’s campy but not a betrayal, offering a lively take on a familiar work while sacrificing such niceties as structure, character, and nuance."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "In the end, his (Luhrmann) Gatsby takes the fitting form of a cocktail glass, at once undeniably polished and unfailingly empty."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "With the sound off, Baz Luhrmann’s The Great Gatsby surely looks as radiant and extraordinary as some of the most dazzling movies ever committed to celluloid, but with the sound up and the experience on full volume, the movie is mostly a cacophony of style, excess and noise that makes you want to turn it all down a notch...or three..."
    },
    {
      "critic": "Keith Phipps",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "When Luhrmann finally reveals the title character, he does so as assorted partygoers work themselves into a frenzy, Rhapsody in Blue pounds on the soundtrack and fireworks explode in the sky...Unfortunately, the film is never again as successful; from here on, it has to dig into the bothersome business of telling Fitzgerald's story."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "There are so many things wrong with Luhrmann's Great Gatsby - the filmmaker's attention-deficit-disorder approach, the anachronistic convergence of hip-hop and swing, the choppy elision of Fitzgerald's plot, the jarring collision of Jazz Age cool and Millennial cluelessness. But at the crux of things, the problem is that it's impossible to care."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Tobey Maguire is fine as Nick but his function is more as an observer than a participant. Carey Mulligan's Daisy is unremarkable in every way. And Joel Edgerton is just a mustache twirl away from doing a Snidely Whiplash impersonation."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Luhrmann’s The Great Gatsby is a failure that should have at least been a magnificent mistake, a risky endeavor that showed a daring intent even if its brash vision didn’t quite succeed. Instead, the movie leaves you cold and weary and vaguely disgusted."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Childlike, fetishistic and painfully literal, Luhrmann’s experiment proves once again that it’s Fitzgerald’s writing — not his plot, his characters or his grasp of material detail — that has always made “Gatsby” great."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Despite a few good ideas and the uniformly splendid production and costume designs by Luhrmann's mate and partner, Catherine Martin, this frenzied adaptation of The Great Gatsby is all look and no feel."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "So much effort seems to have gone into the eye-popping production design, swooping camera work and anachronistic musical score that the result is hyper-active cacophony rather than enthralling entertainment."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 42,
      "summary": "The Great Gatsby isn’t simply a classic American text: In Luhrmann’s hands, it’s also the greatest self-help manual ever written."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 42,
      "summary": "Luhrmann's The Great Gatsby has the hallmarks of a contemporary Hollywood spectacle. It's missing the explosions, but make no mistake: Gatsby is one glitzy misfire."
    },
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Despite DiCaprio’s prize performance, purists will fume, but even as lit-crashing razzle-dazzle entertainment Luhrmann’s adaptation is a candelabrum too far."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Luhrmann piles on one shiny distraction after another. But amid all the seductively gaudy excess, DiCaprio finds both the heart and hurt buried within one of literature’s everlasting enigmas."
    },
    {
      "critic": null,
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The director has steadfastly proclaimed his passion for the novel, but the film he's made of it too often plays as no more than an excuse to display his frantic, frenetic personal style."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Luhrmann has always had a knack with the fever of passion, but here he only catches high fever’s empty gibberish."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Whether or not Luhrmann’s “Gatsby” will go down in history as a legendary flop is not for me to judge (though all signs currently point toward yes), but it surely belongs to the category of baroque, overblown, megalomaniacal spectacles dubbed “film follies” by longtime Nation film critic Stuart Klawans."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Shorn of its quintessentially American roots, a biting tale of adult extravagance becomes insubstantially tween-aged."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "What's intractably wrong with the film is that there's no reality to heighten; it's a spectacle in search of a soul."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "There may be worse movies this summer than The Great Gatsby, but there won't be a more crushing disappointment."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "I love the publicity quotes by Baz Luhrmann stating that his intention was to make an epic romantic vision that is enormous. Also: overwrought, asinine, exaggerated and boring. But in the end, about as romantic as a pet rock."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 10,
      "pos_reactions": 26,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Saw this when it opened. Had low expectations because of movie critics who obviously grew up in the wrong era. The quality of the book is revived perfectly; It's a period peace, but transcends period with its subtle hints of modern music and style. Every actor was perfectly cast. It's heavy use of Art Deco (my favorite architectural style) fills the screen with beauty that reaches for the heavens, however unattainable they were and still are.",
      "total_reactions": 36,
      "user": "Greenlemonade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "This is a film that takes a while to get into the story although the visuals are constant like all of Baz Lurhmann's work.  I do wish there was more character development and the film was a little shorter, but overall a solid effort. B",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "A great story, with great actors, with a amazing director, with good spécial effects !",
      "total_reactions": 2,
      "user": "Expectoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Easily superior to both the 1974 and 1949 films, a gaudy, fast, noisy, overloaded, gorgeously detailed style matches the novel's smashed up atmosphere of distortion and excess. Convincing performances from the entire cast render characters more lifelike than the novel. While it could be a perfect film, the director created a blemish by making the story Romeo and Juliet, when it is meant as Don Quixote. The almost cubist, many-sided Gatsby is more than a schmoozing opportunist because of his capacity for illusion  that's what makes him \"great\"  leaving him more than a little absurd in the emerging modernist world. He can't see that his earnest, midwestern, pioneering spirit now reaches for something fundamentally careless, insincere, and artificial, like Daisy Buchanan; this movie wrongly gives the impression of tragically unconsummated mutual devotion. While the forest is missed for the trees, this is still a very very fun movie, especially the mashed up styles in the soundtrack.",
      "total_reactions": 2,
      "user": "jasonbowden1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "A surprising emotional scope blended with good  cinematography, a great soundtrack and very stylish direction gives The Great Gatsby a grand overall feel.",
      "total_reactions": 2,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "When I saw this movie, I had no idea what to expect. I mainly wanted to see this because of its ensemble cast, but after watching it, I can safely say it is so far 2013's best film. I found the story of the film to be pretty well written. It's very interesting, and with its fine acting, the film kept me off the edge of my seat, anticipating what will happen next. I have yet to read the book, so I have no idea how much it stays true to the source novel. The cast does a great job as their roles.  Leonardo and Toby kill it as their roles, as they are the best actors in the entire film. The rest does great as well, though I think that some actors had potential to do more in the film. My favorite aspect of the movie is the visuals and the music. The film is visually exciting, as there are colors all over the place. this is best evident during the party scenes. The music is very catchy, and I constantly find myself humming along to the tunes this film has to offer. Really my only problem with this film certain scenes. I felt that there were a few scenes that were trying to go for something emotional to happen, but it never really got there, let alone didn't try to. For example, the scene where Tom and Myrtle break up could have gone somewhere in the film, but the characters never speak any dialogue again. Aside from these select scenes, The Great Gatsby is visually charming, well acted, and musically catchy, making up for what I believe is the best film of the year so far.",
      "total_reactions": 1,
      "user": "Aquaris475"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Great soundtrack, insane visuals, intense performances, and some good humor to boot. A sick adaptation of Gatsby. It far exceeded my expectations. The critics must be seeing a completely different film than me.",
      "total_reactions": 1,
      "user": "BlackfuryRises"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This movie completely captures the flavor of Fitzgerald's words with the images of Baz Luhrmann.  I did not expect it to be REAL.  I expected it to be romantic and impressionistic and it was.  Strong performance by Leonard Dicaprio.  His acting and the extravagance of the sets were well worth the price of admission to me.",
      "total_reactions": 1,
      "user": "keyelepro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "the great gatsby was a excellent and great movie",
      "total_reactions": 1,
      "user": "killian13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Visually stunning, great pace and dramatization.  IMO really gets to the core issues Fitzgerald had in mind.  Makes you think about your own goals in life and what happiness really is.",
      "total_reactions": 1,
      "user": "maddog1780"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Great film, everything about the movie was fascinating..  I was kept on edge until the ending which was a complete shock to me, I keep replaying scenes of the movie in my imagination, it's a very impressive film that was very compelling. I don't think my words are enough to express how great this film is, go watch it and experience the enjoyment for yourself. I am slightly upset by the number of people that didn't like this film, to say this film doesn't meet your standards is a joke.",
      "total_reactions": 1,
      "user": "deemo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "As a reader of the F Scott Fitzgerald novel and watcher of the, Robert Redford, film The Great Gatsby I loved the new film. The New film only reinforced my admiration of this timeless story. Green Light",
      "total_reactions": 1,
      "user": "Jgatz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I originally thought I wasn't going to enjoy this film because I feared it was going to be all flash with no substance as the special effects and odd choices of music would be the film's dominating elements.  While the film has a lot of flash and style, it still contained the heart of the novel and it was incredibly addicting and enthralling.  Finally, the performances are amazing with Joel Edgerton really being the spotlight stealer in this one!",
      "total_reactions": 1,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Within the first ten minutes of this movie you know its a Baz Luhrman film. Baz tries to throw a modern spin on a 1920's flick in which he successfully executes. The characters were all over-acted which seems to be on purpose and, considering the setting, was appropriate. Leonardo was the perfect man to play as Mr. Jay Gatsby and he executed flawlessly as always. The casting for all the other characters were also done extremely well. The movie did not stray from the infamous novel which was appreciated.",
      "total_reactions": 1,
      "user": "cheeseberger11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This was a very decent movie. It was very well-made in my opinion. I thought that the first third was the best part, I loved the party scenes, they were so beautifully made.",
      "total_reactions": 1,
      "user": "AVTRlover41"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Exciting and thought-provoking. A talented cast, along with stunning visuals  think Moulin Rouge  capture the imagination and curiosity of its viewers. It kept me well at the edge of my seat,  guessing and second guessing the characters involved. As the story unfolds, \"ooo\"s and \"ahh\"s are likely to escape your lips as it did mine.",
      "total_reactions": 1,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I really didn't know what to expect when I watched this movie, but I can tell you I was at least pleased with the outcome. Leonardo DiCaprio and Tobey Maguire both did good performances as well. While the film provides an interesting look at the height of the \"Roaring Twenties\" and a devastating look into the dark side of the American dream, it's running time of nearly 21/2 hours and a near-constant bombardment of visual over-stimulation might make the film somewhat exhausting for some. Every bit as visually dazzling as one might expect with it's production, grand sets, scenery, and detailed costume designs. I personally feel that while this film doesn't necessarily belongs to the category of overblown, over-elaborate movies out there, it could have benefited from having a less dazzling tone. All that aside, the plot was good and I felt sad at the end for Gatsby. Whether or not the film is a satisfactory adaptation of the novel I can't say because I haven't read the book.",
      "total_reactions": 1,
      "user": "andrewgarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "I've never been a fan of Baz Luhrmann's filmography, and his new Gatsby project is no exception. This is an amazing book, but his adaptation to the screen employs rap music and modern references here and there that do not fit the story at all. Now, I'm not a cinema purist when it comes to adding modern hints in period pieces, but the way Luhrmann does it is too obvious to benefit from subtlety. Also, Carey Mulligan and Isla Fisher should've switched their respective roles as Daisy and Myrtle: the casting choices there were not great. Each woman would've played the other character better, and the movie would've benefitted greatly. As for DiCaprio and Maguire, they played their characters on par with Fitzgerald's writing, and added some character nuances that only great actors can pull off, so bravo to them. If you're a fan of the story, it might be worthwhile to check out the movie, but don't set high expectations.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Be aware going in that this is a Baz Luhrmann movie so there is an interesting twist on the cinematography and music selections.  This is an enjoyable movie with a fairly quick pace  Quite enjoyable but not for everyone.",
      "total_reactions": 1,
      "user": "mymedia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "The Great Gatsby  Baz Luhrmann (May 2013)",
      "total_reactions": 1,
      "user": "Joo_lene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "The Great Gatsby is perhaps the greatest American novel ever written. The novel deserves a perfect adaptation that captures its spirit as well as heartrending tragedy. Many have tried, most notably Robert Redford and his golden smile, but all have failed. Now, Baz Luhrmann, director of the critically divided Romeo and Juliet, attempts to tackle one of Hollywood's adaptations. The critics were once again thoroughly divided on his film, most claiming that Leonardo diCaprio made the movie as Gatsby shine but the film lacked the true heart of the book, replacing the important character development with over the top party scenes. The question is: We're the critics right? Or is this the Gatsby movie that Fitzgerald fans have been waiting for?",
      "total_reactions": 1,
      "user": "cbeers2513"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This film is full of brilliant actors, a story told in a very good way. The setting is beautiful. The screen play is amazing. I can watch this film time and time again.",
      "total_reactions": 1,
      "user": "tlight"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "I'd like to begin by calling The Great Gatsby one of the greatest novels I have ever read. It is beautifully written, very powerful and deep, and just all round ground.",
      "total_reactions": 1,
      "user": "jedwards"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Unfortunately, reducing one of the great novels to a shiny self-indulgent music video is the least of its problems. The narration was so annoying and never ending and the performances were bizarre. I could care less about the characters because not one of the them actually felt real. It was a very boring movie. There was obviously a great deal of effort put into this movie, but  Luhrmann is more interested in what you see and hear rather than what you are supposed to think and feel.",
      "total_reactions": 6,
      "user": "Trev29"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Baz Luhrmann really has outdone himself in this film. The cast is beautiful as is the script. The scenes are a visual feast. It is as if Luhrmann reached into Fitzgerald's vision of the 20's, pulled out the heart of it and merged it with what society is today, over nine decades later. Alongside personal strife, we see social inequality, abuse of drugs and alcohol, political and moral corruption, and the failure of financial institutions and their responsibility to people. This film will make you feel that these issues will always be relevant, and that not much changes from generation to generation.",
      "total_reactions": 15,
      "user": "PinBB"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Baz Luhrmann’s “The Great Gatsby,” is fairly accurate to the classic novel and keeps most of its themes intact. However, Luhrmann’s own flair adds a new dimension to the story. Visually this film is incredibly stunning. From grand sets to the detailed period dresses, this film is a treat for the eyes. Never once does it not take your breath away from its impressive scenery. Many people might be worried about the updated music, but there is nothing to fear. Jay-Z’s track works incredible well with the film and complements the era in which it is set.",
      "total_reactions": 11,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "The movie was long, tedious and Jay-Z's music in 1912.  The actors have done their respective roles well but the story was weak. I don't understand \"what is this love about?\"",
      "total_reactions": 10,
      "user": "franissavio"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "So, could Baz Luhrmann, with Jay-Z at his side, deliver a modern adaptation of the the Great American Novel that would be well received by all? I think the answer from the offset was always going to be no. Instead, Luhrmann delivers a visual feast of a film, one that tries to balance Luhrman's big number style with an authenticity to the source material but one that relies too heavily on narration, some cheap visual effects and ends up failing to fully flesh out the key relationship central to the story.",
      "total_reactions": 9,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This movie was absolutely great, mainly for its screenplay and it staying true to the Gatsby storyline. It was enjoyable all the way through, DiCaprio was amazing as Gatsby, and all of the roles were well played. The music though was stunning and fit the mood, even if it wasn't all Jazz (Black 1920s music). Instead, cleverly they used Hip-hop (Modern day black music). Overall, if you have read, or not read the book, you should absolutely see this.",
      "total_reactions": 9,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Baz Luhrmann's adaptation of \"The Great Gatsby\" isn't a disaster. Every frame is sincere. Its miscalculations come from a wish to avoid embalming a classic novel in \"respectfulness\"  a worthy goal, in theory. It boasts the third most imaginative use of 3D I've seen recently, after \"U2 3D\" and \"Hugo.\" It's a technological and aesthetic lab that has four or five experiments cooking in each scene. Even when the movie's not working, its style fascinates. That \"not working\" part is a deal breaker, though  and it has little to do with Luhrmann's stylistic gambits, and everything to do with his inability to reconcile them with an urge to play things straight.",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Despite lacking depth in some parts, \"The Great Gatsby\" is a excellent piece of artwork that not only stays true and faithful to its original source, but also mixes the creative genius thawed out from the illustrious mind of Baz Luhrmann.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "All I can say is that you should never listen to the critics. They are so full of themselves. The best they can do is take someone's hard work and turn it on its head. Leo nails the plight and desperation of Gatsby with such intensity that you can't help but feel for him. I wished to be there for him and to tell him that everything would be all right. I've not read the book and frankly the plot seems very generic. A man from humble beginnings rises through society for the sake of winning the girl he lost several years ago. Yet the book is hailed as 'The Great American Novel.' I don't know why that is, but the movie only shines because of Leo. That man knows the most intimate secrets of playing a character and bringing it to life. Of course one may argue that there was no electronic music and rap in the 1920s, and yet Moulin Rouge! didn't seem to have historical accuracy going against it when it received critical acclaim, as I don't think Nirvana existed in the nineteenth century. Carey Mulligan also deserves a mention.",
      "total_reactions": 3,
      "user": "Swati"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "To much party scenes, 3D traveling shots and not enough dialogue and dept in each  character. And every time they seem to be getting to the core of some meaningful revelation, the voice over appears to take you far away from the scene and its climate. I wouldn't call it bad storytelling, but the entire movie seems to slip through your fingers and splash in a thousand colorful 3d-camera movements on to the ground. I had high expectations, and there were only a few moments in which this were matched.",
      "total_reactions": 3,
      "user": "StateOfFilm"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "As a huge fan of DiCaprio, Mulligan, Fitzgerald and Lurhmann, I went in with pretty high expectations. Sure enough, the acting, direction and script are top-notch, if a little too faithful to the source material in letter, while being wildly all over the place in tone, leading to a bloated, overlong production.",
      "total_reactions": 22,
      "user": "samichsupernova"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I'm going to make this very simple for you. If you like the book, you'll like the movie. Why? It encompasses everything that makes the novel great. The script basically is the book, from the narration, to the dialogue, the the plot line. The magic of the book is brought to life by Baz Lurhmann's direction, and by the performances. We really get to see this fantastic world the same way we imagined Nick saw it, when we were reading the book. People complain about the style, and how it's too shallow, and goes out of its way to look good, but that's the point. Gatsby's fantastic life was completely shallow, but Nick didn't see that initially. I'm interested in hearing the opinion of someone who liked the book, but didn't like the movie, because I'd like to know what they were expecting. They must've read a different book than I did.",
      "total_reactions": 11,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I remember watching the trailer for this movie a year ago and expecting it to come out at Christmas. I just don't understand why the movie was delayed 6 months. But now that the movie is here I can personally say it was worth the wait. The Great Gatsby is a very beautiful story and well told through miraculous cinematography, some visuals and fantastic acting. Hands down, Leonardo DiCaprio is the heart and soul of the movie. I mean, he's just such a tremendous actor. It may not be his biggest and best role, but he still gives one hell of a performance (just as usual). There were some even some other great actors such as Joel Edgerton, Carey Mulligan and even Tobey Maguire. I honestly wasn't sure if I would like him in this movie but he actual is really good. But his best role for me will always be in \"Brothers\". The cinematography is definitely one of the things that impressed me the most. Cinematographer Simon Duggan really knows how to not only get great shots, but take you through the world of Jay Gatsby himself. The one thing I really don't understand is this. Why is there a 3-D release for this movie? I mean, it has those good shots, but honestly it doesn't need to be shot in 3-D. That's like making \"The Notebook\" in 3-D. It just doesn't work. But don't let that distract you from watching an (Oscar worthy) type-movie. If your going to go watch it, watch it in 2-D. But overall, it's a beautifully crafted story of drama and romance.",
      "total_reactions": 11,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I'll admit this is one of my favorite novels of all time. In my opinion it is THE great american novel. I think it encapsulates everything that is America. The excess, the lust for money, the shallowness of keeping up appearances, and people's admiration for those they deem successful.",
      "total_reactions": 11,
      "user": "woohoo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Dude! This is the best movie of the summer!! I saw one of the best performances of Leonardo DiCaprio and the rest breaks too! I recommend to all!!",
      "total_reactions": 10,
      "user": "Gatsby123"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Perfection. Brought out every emotion from the book and then some.  It may have left out or rearranged the details, but the heart and the idea of the book remained intact.",
      "total_reactions": 10,
      "user": "knieskj"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "The scenery is beautiful, but Maguire becomes annoying fast. The movie jumps around between scenes with no real transitions. Very difficult to stay interested.",
      "total_reactions": 5,
      "user": "Cloppers"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "It's first act is certainly aimless and unbearably frantic, but the rest of \"The Great Gatsby\" endures as an emotionally involving and thematically thought-provoking piece.",
      "total_reactions": 5,
      "user": "Compi24"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Let us get the obvious out of the way: The Great Gatsby as the inspirational literature piece, is extremely better than this movie. But lets not kid ourselves. This movie was a damn good movie. An AMAZING movie. Upon seeing the trailer for this movie, I had high expectations and couldn't wait to see the movie. Reviews starting filing in and I couldn't understand it. Bad review after bad review. My expectations lowered. As you would expect. The movie starts and it sort of started slow to me and somewhat worried me, but the movie started to get going and I found myself enjoying it thoroughly. By the end, the tragedy, the romance, the broken relationships, the lies, deceit. It was pure emotion. These were truly the life and times of Jay Gatsby. The rise and fall of Jay Gatsby, if you will. It was extraordinary from start to finish. Nothing captivated me like this since Django Unchained last year. I will definitely see this movie again. I highly recommend this movie regardless if you're a fan of the book or haven't read the book at all and enjoy a good movie. Very good.",
      "total_reactions": 11,
      "user": "ClayMerritt"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "The set pieces are great. Exactly what I imagined when I read the book. The acting is pretty solid. But the overuse of CGI (on things as simple as rain on a dock) and heavy music take away from the movie. I don't hate the film, but I didn't like it either. I literally nothing this movie.",
      "total_reactions": 13,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "After seeing this movie a second time, I began to like it even more, ultimately going back a total of 4 times.  In my first viewing, I unfairly underrated this movie and wish to make amends to its creator.  This movie is gorgeous.  Acting of the 3 leading men is impeccable.  DiCaprio brings to life a more deluded version of Gatsby than prior versions.  His depiction felt off at first viewing, but after seeing the movie again it felt perfect.  My apologies Baz Lurhmann.  I think this movie should get all the academy awards except for the actress categories.",
      "total_reactions": 13,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "The new Gatsby tries to center itself on visual masterpiece, costume design, and other technical categories that it forgets to spend time on acting, direction, and greatness making this classic plot go uneven and present possibly the worst performance of Tobey McGuire fairly good career.",
      "total_reactions": 6,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "The Great Gatsby is a beautiful novel and while adapted to a film, it became visually beautiful. However, for some mystical reason the visual did not coincide well with the plot or the narrative.  I was hearing the story from the narrator as oppose to seeing it. Close to the end I decided to shut my eyes and hear the story because it was the visuals were frankly redundant although spectacular. The fact that Jay Z executive produced this film is very obvious from when you hear Jay Z's music like you're at his concerts, it got too repetitive for me regardless of the quality of the actual music.  Overall, Great Gatsby was unable to give us a full experience without one sense blinding the other.",
      "total_reactions": 4,
      "user": "Brad_"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "It is now apparent that F. Scott Fitzgerald's classic novel The Great Gatsby does not translate well to the big screen. The acting was perfectly fine but the story, as classic as it may be, can simply not be made into a decent major motion picture.",
      "total_reactions": 4,
      "user": "madams"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Baz Luhrmann really outdone himself with this one. Great honour to Fitzgerald for making a great movie out of a brilliant book. A don't get the negative reviews from the critics but I know they're unfair.",
      "total_reactions": 4,
      "user": "Badmohfacka"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I thought this movie was wonderful! The book is one of my all-time favorites and the movie does the book great justice. I really like how the movie stayed on script with the book, the important elements of the book were portrayed within the movie. The acting was wonderful and each actor was perfectly placed in their role. Leo did a great job at Gatsby and the other actors and actresses did exceptionally well also. I really like how the director incorporated modern hip-hop in the movie instead of playing the traditional 1920's jazz that I assumed would have been in the movie. I would recommend this movie to everyone!",
      "total_reactions": 4,
      "user": "alexak"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Luhrmann has been one of my favourite directors solely relying on his mastery with \"Moulin Rouge\". I enjoyed \"Romeo+Juliet\" also, but nowhere near as much as MR, and then Australia was kind of a let down. His visual style, however, has always been consistently amazing and his films are a true feast for the eyes.",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I  was having trouble rating it 7or8. Because it's one of those movies with an epic story, an amazing cast, magnificent scenes, breathtaking music, but a not so good director...",
      "total_reactions": 2,
      "user": "Vanessa_S"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "The movie is clearly overdone on spectacle, but deep within, the emotion and complexity of Fitzgerald's novel comes to life to remind people of a what made this book so important then and now.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Beautiful, extravagent, and as over the top as one would expect, Baz Luhrmann's The Great Gatsby does a brilliant job capturing the beauty and wealth possessed by Gatsby. This film is pure eye candy, yet it does have some substance beneath it and I think it did a swell job capturing the essence of the novel and telling the fateful tale of Jay Gatsby. In addition, the acting, led by Tobey Maguire, Leonardo DiCaprio, and Carey Mulligan, was great as well.",
      "total_reactions": 2,
      "user": "Spangle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Very underrated movie that had me gripped the whole time. Was it bizarre and over the top? Absolutely, but it wouldn't be a Baz Luhrman movie if it wasn't. My advice is to sit back, don't ask questions and be marveled by the this spectacle of a movie.",
      "total_reactions": 2,
      "user": "counts0981"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "With any  Baz Luhrmann film you expect  high camp anachronistic pyrotechnics, but  whereas Moulin Rouge worked extremely well, Gatsby doesn't. The main problem is that it's setting and story is less appropriate for this over the top kind of  approach. Moulin Rouge was set in a musical revue nightclub and therefore all the outrageous antics could be more readily embraced. The first half feels like Luhrmann wanted to make a musical and was taken with the ides of wild parties, decadence and lavish costumes only to discover halfway through that he had a story to finish telling. In fact it's only when Gatsby turns to 'straight' drama that it works at all. Generally it's a visually stunning mess, although even here everyone and every thing is so perfectly positioned and placed that the artifice in scene after scene wins the day. Performances are unexceptional although DiCaprio acquits himself well. There is less to be said for Tobey Maguire. His performance as neighbour and story narrator Nick Carraway, is bland and borders on the boring. The writing is trite and often undermines the visual style. For all the criticisms that have been levelled at the 1974 Redford/Farrow film, it must be said that the writing, acting and screenplay were all superior to this frenetic self indulgence. On the plus side the main musical theme is just beautiful.",
      "total_reactions": 2,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "You must have read the book to enjoy this movie to its fullest. The visuals in this movie perfectly captures the emotion and complexity of the Fitzgerald's novel. Leonardo DiCaprio is Gatsby. He captures the aura and personality of Gatsby, but still expresses his characters emptiness. The whole cast complements Leo's acting. Baz topped his Romeo  Juliet reinvention and has broken another cinema literature barrier.",
      "total_reactions": 2,
      "user": "jtc05111995"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is a HUGE surprise  walking in I thought this movie would be boring, but I got a really interesting movie with likable characters  and stunning visuals  Some over acting in some parts  and the soundtrack of the movie could turn you off  but if you stuck around Django Unchained  you could handle this",
      "total_reactions": 2,
      "user": "Rosewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Visually striking, but a bit slow, and too long. The story did seem to lack depth and felt hollow. The use of modern rap and other asynchronous music in the soundtrack was noticeably off-putting, inappropriate, and killed suspension of disbelief. Better than the earlier versions, but still failed to have significant depth. All glitter and flash makes Gatsby a dull boy.",
      "total_reactions": 2,
      "user": "MikeBierman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "I went into this movie thinking it would be alright because im not a fan of baz's but i had read the book so i saw it because i read the novel. this movie blew me away, the acting was excellent and perfectly picked for each part, the story great if you are into that kind of story like a romantic very dramatic one with little action but thats okay  i felt like the modern music and style was a great addition to add to the movie. now comparison between the novel and the movie are just alike but with few changes to make it into a better movie based off the novel. the cinematography in the movie was great i loved the color or filter that baz's brought into this dark world it looked great and the 3d was ok but nothing exceptional. overall this was a very good movie that many people should see but dont expect a lot of action.",
      "total_reactions": 2,
      "user": "NobodysCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Here's my review: i am not going to see this even if it comes out on a $2 DVD sale at BigW.  It reminds me of the movie Australia, overlong, boring and self indulgent, it assumes its own importance will draw me in. I haven't seen Australia either.",
      "total_reactions": 2,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "The acting in 'The Great Gatsby' was incredible, Leonardo DiCaprio throws out of the park with this performance. DiCaprio slips into the role of Gatsby perfectly, he found all of the key qualities of the deep character of Gatsby. Maguire unlike most of his performance is no longer playing Tobey Maguire, he is a great narrator to the story, and I put that down to the direction from Baz Luhrmann.The rest of the cast were sublime the acting quality is incredibly high on this feature. Luhrmann is a great director, however despite his skill his vibrant colors do distract from the actual film, which is a down side, obviously. The writing of the film is good and I personally loved the way the narration is taken straight from the book as we see Maguire writing it.",
      "total_reactions": 2,
      "user": "McLaughlinViews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "This is probably the most uninteresting movie. You shouldn't put newer music in a movie that's supposed to take place in 20's, the music threw everything off. Yeah the movie should only be partially like the book but since the book is a really good classic  you guys screwed everything up. Leonardo dicaprio is an amazing actor and is good in this movie but the rest of actors is just a no.",
      "total_reactions": 2,
      "user": "mybabymichael"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "“The Great Gatsby” stars Leonardo DiCaprio, Carey Mulligan, Tobey maguire (he spells it that way), Jason Clark and Joel Edgerton in this remake of F. Scott Fitzgerald’s novel of life and its extravagances in the mid ‘20’s. Unfortunately, not true to the flavor and depth of this great novel, Director and Co-writer Baz Luhrmann gives us a glitzy overdone film with no depth or intensity but, instead, the shallowness of a music video. First, a disclaimer. I am no fan of either Tobey maguire or of Mr. DiCaprio and with these precommitted feelings, it’s difficult to enjoy any vehicle either of them are in, let alone both. Mr. maguire whines his way through this overdone narrative and Mr. DiCaprio continues to look like a teenager trying to play an adult. If he uttered the phrase “old spoaht” one more time in the film, I would’ve thrown my 3D glasses at the screen. Speaking of that, this film has no dimension so the need to try to see it in 3D is useless. I at one point took off the glasses and could not honestly tell the difference. So visually and substantively, the film lacks so much except one thing…..time. This lifeless seemingly never ending film lasts for 2 and  hours and screams for an editor’s splicing machine. The special effects and scenery, as costly as they may have been, seems to be the impetus for the movie’s length since it’s hard to put so much set money on the floor of the editing room. The old “how many times did I look at my watch” test proved accurate for I recall no less than 6. This Gatsy is neither ‘great’ nor ‘good’ and, at best, is mediocre.  As bad as the 1974 version of the film with Robert Redford and Mia Farrow was, this is probably worse. I give the film a rating of 3.The viewers, F. Scott and those interested in good filmmaking deserve better.",
      "total_reactions": 13,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Contrary to what the majority of critics are saying about Luhrmann's Gatsby, there is a lot to love about the picture.2013's Gatsby contains everything that fans of the book have come to expect: grande scenes, vivacious music, and a world of shallowness that becomes to much for the narrator (and audiences) to handle. The cast is stunning all around, from Jason Clarke's unstable Wilson to DiCaprio's glowing Gatsby, the performances are A-list. Tobey Maguire was brilliant as Nick Carraway, capturing the dry wit that Fitzgerald frequently utilized in the original novel. Unfortunately, it is not until the final act of the film that Luhrmann's direction truly allows the cast to genuinely act. The movie's first two acts were more focused on the glitz and glamour of the Roarin' Twenties than effectively setting the scene. Nonetheless, the colors of this adaptation are a breathe of fresh air in comparison to previous efforts. Overall, despite having an excess of flash and a sometimes effective (\"Love is Blindness\" at the film's climax)-often inappropriate (Jay-Z's \"$100 Bill\" used literally whenever the director saw fit) inclusion of modern rock and hip-hop into what is supposed to be a classic Jazz Age story, Luhrmann's clear passion for the work and a perfect cast more than makes up for it. Definitely worth the $9.50",
      "total_reactions": 9,
      "user": "matteo704"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "All of the ambiguity and thoughtfulness that is required to read 'The Great Gatsby' is thrown out of the window with characters' blatant explanations of symbols, ideas and character development.",
      "total_reactions": 23,
      "user": "nothanksgiving"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "I have not read the book for this film but I am fairly certain it doesn't reference the Jay-Z and Beyonce songs playing in the background. Look, I get that this is how the director likes to do his thing, but I can't take it, complete garbage and it will look even worse in ten years when people hear the awful music and laugh it off.",
      "total_reactions": 14,
      "user": "bobecker"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "1st Time",
      "total_reactions": 7,
      "user": "kifozem"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "The Great Gatsby is very beatiful movie. It has nice scenery, good cast and and unexpectedly, a good soundtrack. But there are some inconsistencies in the story, and the ending seems so tightened. It could be better. And of course, Leonardo DiCaprio is great.",
      "total_reactions": 5,
      "user": "YuRown92"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "It was a great movie with a fantastic performance by Leonardo DiCaprio. It is an emotional thrill ride that has you on the edge of your seat throughout nearly all of the movie.",
      "total_reactions": 5,
      "user": "mrfutbol107"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Is it just me or was this the most boring Leo movie ever! No intense moments whatsoever. I really have nothing else to add except that it was way too long and I almost fell asleep in the movie theatre. And 3D is not worth it if there is just going to be 3d snow an rain.",
      "total_reactions": 5,
      "user": "Mastabrad85"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "what a great disappointment this movie was. a totally  unrealistic and poorly directed movie  i am a die hard Leonardo fan but this was the worst movie i have seen him in.  my wife and i have watched nearly ten thousand movies together over the years. we have only ever walked out of three movies.  the great Gatsby was the third.",
      "total_reactions": 5,
      "user": "chrisjay"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Horrible. Simply awful. How anyone can endure this for more than 5 minutes is beyond me. Rap music in the twenties  WTF  The characters are all overacted to the point that none of them is the least bit intriguing or interesting. The dialogues are beyond dumb and stupid. There is no chemistry at all between the main character and the writer. Why would Gatsby show him around  The writer is the most boring person on the face of the planet. None of the women are pretty or interesting either.",
      "total_reactions": 6,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "'The Great Gatsby' was an absolutely fantastic movie! The story, acting, cinematics... everything was at the highest level and definitely shows a high production value. Best movie I've seen in a long time. I had mixed expectations coming in just based on some of the negative reviews I've heard but I honestly don't see why those even exist. I think what makes Gatsby a great film is that it is different. It's not your typical summer action movie. It's not your typical romantic love story. 'Gatsby' goes much deeper and further than the vast majority movies today tend to go. The acting and story really draw you in while the cinematic shots never cease to impress. Overall I thoroughly enjoyed the film and highly recommend it to everyone. Just goes to show that when directors and writers actually try and stick to the source material instead of making their \"improvements\" you come out with a much better product.",
      "total_reactions": 6,
      "user": "theoffice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is one of the worst movies ever. The director should be arrested for this absolutely insulting adaption of The Great Gatsby. Never was I more convinced to just get up and leave the theater in  the middle of the movie.",
      "total_reactions": 3,
      "user": "ReviewCenter"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Horrible. The green-screen was overused and the story was reduced to cheap soap-opera with awful music. The acting is okay, but the characters are suffering from the writing too. Every character seems overacted and just like the whole movie 'artificial'. Not worth watching...",
      "total_reactions": 3,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best movies I've seen this year. I f**king hate Toby Maguire but he didn't bother me in this. Leonardo Decaprio delivered another stellar performance, but this won't be the vehicle that gets him his oscar, which is disappointing, but he's still got a chance with The Wolf of Wall Street. 9.4/10",
      "total_reactions": 3,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "With expectations of the flashy Roaring 1920s, I was certainly given the experience I wanted, albeit to a certain degree. Baz Luhrmanns style has certainly left a footprint in the way we visually enjoy a film, however I felt that the camera cuts to new angles and takes away from the film by a small margin. The Great Gatsby contains an excellent cast (With my money on Maguire winning Best Supporting Actor at next years Oscars) and a story that remains intact even with Luhrmanns visual flair. Like the book, Maybe this film will be appreciated with time.",
      "total_reactions": 3,
      "user": "Benihana"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "too long by 45 minutes and slow, very slow.  once again they focus on the mega parties instead of the characters, as a result the acting did not seem to be explore real human dimensions, two dimsional instead of really being fleshed out.",
      "total_reactions": 3,
      "user": "holymoviecrap"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Wonderfully done, I think this film is being largely overlooked because of reviewers' inability to stay open minded.",
      "total_reactions": 3,
      "user": "Apotheosis34"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Luhrmann's take on Gatsby is not perfect, the modern music mixed with the tradition is slightly distasteful, but in ways brings things up to date, while still keeping the traditional mystery that encompassed the roaring 20's. The camera work in the opening scenes is extremely fast paced, and full of stunning shots, yet it's reminiscent of the novel in this way. It begins as a fast paced piece of life and action, and slows down to capture it's essence. What really makes this Gatsby so fantastic is that is so accurately captures the spirit of the novel. The acting is superb, with Leonardo handing in a typical mesmerizing performance, while Toby Maguire stuns as Nick. Joel Edgerton and Carey Mulligan give the genuine nature of Tom and Daisy, while maintaining the vast carelessness of the two that's necessary for the magic. Lhurmann's masterpiece doesn't transport me back to the 20's, or to Gatsby's parties, but instead takes me into the heart of a man clung on hope, hope that tomorrow we WILL stretch our arms farther. That's where Lhurmann goes right, he captures the spirit of the novel, a feat that is worthy of praise.",
      "total_reactions": 3,
      "user": "GHopp8"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "There are a couple of classics that I've never read and this is one of them. That being said, I really enjoyed the cinematography, actors' performances, and the mixture of modern music with the world of the 1920s.",
      "total_reactions": 3,
      "user": "Faz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "There's never been a film like this!!! A masterpiece!!!! One of the best films ever made, and one of Leo's best pictures!!!! Baz Luhrmann has a gift!!!!",
      "total_reactions": 3,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I think that, ultimately, The Great Gatsby is a success for Baz, and especially for the actors. Personally, I feel that Baz's over-the-top style works for the source material, where major themes include materialism, greed, and flaunting of wealth. I think that the movie does an amazing job of commenting on all of the social aspects that are discussed in Fitzgerald's novel. The only reason I could see people being upset about this film is because of the soundtrack. Personally, I loved the integration of old and new music, I think it is a good way to bring Gatsby to a moder audience and it shows how relevant the novel still is, but I could see where people would not agree. Besides the directing and scenic design, I also think that the acting was superb. DiCaprio did an amazing job portraying the complicated character that is Gatsby. Edgerton and Mulligan did a great job portraying the Buchanans. I also liked how many of the lines in the script came *directly* from the novel, for instance \"Gatsby, What Gatsby?\" is one of the most famous lines in literature, and I was excited to see that it was kept in, along with many others. Only two things really bothered me about the film. 1, the insistant words that showed up on screen. It would have been fine for one or two scenes, but it became annoying after a while in my opinion. And 2, the fact that Nick Carraway has discussions with a doctor throughout the film to write a book about Gatsby, I dont understand why it could not have been narrated without an excuse of an explanation, which was not in the original novel.",
      "total_reactions": 4,
      "user": "jdubz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "This interpretation of the great Gatsby is neither great nor good. This is a bust, add this to the recent list of DiCaprio  flops. the rap music and dizzying camera work made me sick. the great f. Scot Fitzgerald nevel is turned in to garbage. The only saving grace is Toby Maguire's supporting performance. Pleas, read the book, forget the movie.",
      "total_reactions": 4,
      "user": "lismis7000"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Disgraceful, distasteful and every other adjective that means appalling, and that still wouldn't be enough to describe this movie. Leo was flat out embarrassing. One of the worst movies I've ever seen.",
      "total_reactions": 4,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "You never know what you're going to get when a movie is hyped to the point of seeing some reference to it at every turn. Gatsby was a bit like that for me. And sometimes, the hype meets the HIGH expectations and sometimes it falls way short. I'd say Gatsby is somewhere in the middle. I enjoyed the movie, the story, and the characters, but there were a few sappy moments as well. I felt a bit torn between realism and fantasy and which one the director wanted me to be.  Leonardo and Toby \"made\" the movie and without them, it could have been a yawner. The scenery, costumes, and makeup were EXCELLENT and who can argue the soundtrack  that was pure genius to take today's music and spin it as 1920's. I left entertained and satisfied.",
      "total_reactions": 5,
      "user": "osuwkuman"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "I wasn't sure what to expect, but my expectations were relatively high.  They were high however for Luhrmann's \"thing\" and here he frankly walks a pretty straight and narrow.  The movie is a solid \"good\" movie, wonderful costumes, acting/casting... but it never really took off the way I imagined the director would make it.",
      "total_reactions": 3,
      "user": "A7sus4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Baz Luhrmann returns for his new fifth film, The Great Gatsby. Since the dark romantic edge of Romeo  Juliet and the goofy over the top musical of Moulin Rouge, The Great Gatsby takes the new wonderful  view of F. Scott Fitzgerald's greatest novel. In 1920's, Nick Carraway (Tobey Maguire) is a bond salesman who tells his story about Jay Gatsby (Leonardo DiCaprio) is a mysterious businessman who lives a rich mansion and he desperately fells in love with Daisy (Carey Mulligan) who still lives with her rich husband, Tom (Joel Edgerton). Carraway spends quality time with Gatsby at the huge party that has a terrific design sets and a good looking people. Gatsby and Daisy are fell in love for a long time and they both have a good chemistry to each other. The Great Gatsby is a nicely well done movie with great acting, great effects, and great characters. The visuals are very astounding, while watching in 3D. Tobey Maguire did really good job as Nick Carraway and finally return his acting career since the Spider-Man Trilogy. Leonardo DiCaprio did a fantastic job for portraying as Jay Gatsby in his good looks and acting like Orsen Welles. Even though I'm not a huge fan of Baz Luhrmann's work for his fast paced and his over the top performances, but I think the film did a really good job and Luhrmann has a great taste for making a huge poetic film. Much more better than Romeo  Juliet or Moulin Rouge, but at least it has flaws. Thumbs Up.",
      "total_reactions": 2,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Director Baz Luhrmann creates extravagant and exceptional cinematic imagery. The first 90 minutes of this 2:23 long movie bristle with electric energy: dazzling mise en scene, dynamic pacing and gorgeous cinematography. Once the dramatic conflict grabs hold, it slams to a stop and starts to feel long. Leonardo DiCaprio gives a subdued, but nuanced performance in the title role. Tobey Maguire (Carraway) is appropriately bland and the ladies are lovely. The soundtrack, a mashup of 20s period, jazz, hip hop and R&B;, is outstanding right thru the credits. This is a big, glamorous motion picture. A bit emotionally slight, but impressive to appreciate.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Despite a brilliantly vibrant cast, The Great Gatsby is merely an intoxicated image of 1920's extravagance and a poor interpretation of the classic we know and love.",
      "total_reactions": 1,
      "user": "Creativita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "I don't ever give scores like these. But, this is indeed an exception.",
      "total_reactions": 2,
      "user": "artaeun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The Great Gatsby:  Maybe it’s like caviar, an acquired taste that I have yet to acquire, but I didn’t care for “Gatsby.”  I didn’t like the book in high school or college, I didn’t care for the re-read last month, and I didn’t much care for the movie.  Daisy Buchannan was nicely cast (cute but perfectly shallow) but everyone else was a cardboard cutout, and the movie was overwrought: “Gatsby” didn’t need truckloads of CGI, and loading it up as they did made it seem like a comic book.  It was pretty to look at but, seriously, when they stopped at Wilson’s Texaco station I was waiting for Batman to slowly settle in the background.  There were some highlights though: Daisy and Nick dancing to the heavy downbeat of the Wurlitzer and the image collage of Gatsby and Daisy together, shot in sepia, like framed portraits from the 1920s.  Other than that, fodder for the 3D generation. Two and a half stars from this old codger.",
      "total_reactions": 1,
      "user": "Renzomalo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Very strong adaptation and visual assertion into a provokitive atmosphere wound through beautiful visual charismatics in costumes, art-direction and in the usage of 3D. The astounding music sways the movie forward, but when you have actors simply embodying their characters, this might be the most memorable movie of the summer that is steadily improving over time.",
      "total_reactions": 1,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "There is little of redeeming value in this flick. It made me nostalgic for the version with Robert Redford and Mia Farrow and the critics weren't very kind to that one either.",
      "total_reactions": 1,
      "user": "jgzeger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I was fully prepared to dislike this film. But I was drawn into it, and carried along moment to moment. I even found it moving. And I can't stick LDC usually!",
      "total_reactions": 1,
      "user": "robozot"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "Baz Luhrmann turns everything he touches into Las Vegas.  Fitzgerald's curtains billowing in the breeze become Salome's seven veils;   Gatsby's expensive shirts are flung about like confetti.  DiCaprio alone emerges with honor.  Some of the supporting players seem to have come from The Addams family (Jordan Baker) or Bollywood (Meyer Wolfsheim).  There's a difference between expansive and crass--it's not heeded here.  Rock bottom.",
      "total_reactions": 2,
      "user": "amboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Very well made movie and an excellent modern homage to F. Scott Fitzgerald's American classic.",
      "total_reactions": 1,
      "user": "Vorch"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I have not a fan of anything captured on film  never revisited twice serials, films, or something else, but at the Gatsby I want to go a second time. Once again savor the views of New York, the story interpreted Luhrmann again. This is the best thing I've ever watched, this is the best interpretation of the book on the big screen",
      "total_reactions": 3,
      "user": "robben1234"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Far too much style over too little substance, The Great Gatsby is a muddled mess of a film. Characters dont engage and the tone of the film never settles. Despite being set in 1920s, it never tries to be a period piece  which surely defeats the purpose? Some people may like it but you could have easily set the film in the modern age (which would play well against the current financal backdrop) but with the style of the 20s.",
      "total_reactions": 1,
      "user": "reddave2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is the sama as Romeo  Juliet and Moulin Rouge (Spoilers)  come on in The Great Gatsby he die's too ,we see Leonardo DiCaprio ,die's in lot's of movies.",
      "total_reactions": 1,
      "user": "Dollis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This film is nothing less than a tour de force.  Such painstakingly perfect detail in every scene.  Even if you haven't read the book, it is a flawless piece of movie-making, so much more than the sum of its individual parts and characters.  Who else but Baz Luhrmann could deliver such breath-taking imagery  no scene is without impeccable attention to detail.  The soundtrack is brilliant and original and highly evocative.  This movie gets better and better with every viewing",
      "total_reactions": 1,
      "user": "Huckster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "la película avanza con paso firme en los primeros veinte minutos pero cuando llega el momento en que uno de verdad se da cuenta cual es la trama central de la pelicula uno como espectador pierde toda esperanza que la pelicula se vuelva mas interesante",
      "total_reactions": 2,
      "user": "diego9901"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "I finally decided to see this film, despite its low ratings. I was pleasantly surprised and can now safely say that I understand why the novel is such a central piece of American literature.",
      "total_reactions": 1,
      "user": "Nathonas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "(most of) THE CRITICS WERE WRONG. it's a long movie, and a well thought out movie. everyone involved with this movie put in a lot of hard work and should be applauded for the result. the music worked, the 3d worked, the time travel to another era worked. it was well worth it and I'm glad i went against the poor reviews.",
      "total_reactions": 2,
      "user": "ferg3000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Baz, it worked for Moulin Rouge a really great movie but once is enough, be creative that is what you get paid for otherwise you could just do Fast and Furious #7  #22.  There is so much to the story but hokey photography, 3D effects and a lamed out screen play leaves one looking for the end.  Once again DiCaprio shows his depth in this one still can’t act, never could doubtful that he ever will.  DiCaprio is like so many other mono dimensional “actors” that are only able to play parts that don’t require them to act just play themselves in front of the camera.  Tom Cruise, John Wayne and Ashton Kutcher just to name a few.  One more thing; what is with the Rap music in a 1920’s film?  If you like supporting crappy, ridiculous, unimaginative (remember this is just a Moulin Rouge feel rip-off) Hollywood movies and pretty boy actors, then please throw you money away.",
      "total_reactions": 2,
      "user": "MTP"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "The Great Gatsby is known as one of the greatest pieces of literature ever to be written. It holds a special place in many people's hearts and that goes without needing an explanation. I have read the book, I loved the book, and if you haven't read the book, see this movie.",
      "total_reactions": 2,
      "user": "TylerDsCreation"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "I must first state that the book is worth a read and delves deeper into the films themes, it is also simply a fantastic book.",
      "total_reactions": 1,
      "user": "EwanDaveyKeefe"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "물랑루즈2를",
      "total_reactions": 3,
      "user": "e9t"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "The adaptation of the story which I don't actually know. Excellent soundtrack and scenery of America of the early 20th century. The effect of that movie is in a while after watching.",
      "total_reactions": 1,
      "user": "teodante"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I entered a special preview of The Great Gatsby with quite high expectations. I had heard a lot about the star-studded production, the released trailers were quite appealing, and the film was receiving quite good reviews abroad since its Cannes premier.",
      "total_reactions": 1,
      "user": "SharP1007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "The film swaps the tender poetry of the book for snappy, breezy gloss, and is further tarnishes the classic with the cartoony CGI settings.",
      "total_reactions": 1,
      "user": "Squidcake"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 2,
      "text": "I've read the book and absolutely hated this movie. its just some over-polished, badly paced, and poorly acted piece of trash. i couldn't  care less about the characters, they all felt so disconnected to the movie, they all felt sooo fake. and what about those party scenes where everybody just spontaneously spazzes out to some \"hip tuuunes\" that did nothing but SUCK. all this combined spiraled this movie into an unbearable 2h c***fest",
      "total_reactions": 1,
      "user": "Punkmail"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "The film is an extended, almost annoying than the boring. Uneventful, low scenario. Anyone who does not wait to see more. I did not like. I do not recommend it!",
      "total_reactions": 1,
      "user": "Firebala"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The Great Gatsby is a novel that will forever exemplify the glamour and style that was the roaring twenties. The recent movie portrayed this culture in a way that almost made the viewers nostalgic of the time period. The costume and set design were so over the top with the sparkles and classic flappers dresses the women looked spoiled in glamour; we as 21st century viewers sat in awe and jealousy of what seemed such carefree, lavish, and exciting time. Watching the movie ignorant to the novel allowed for people to view it in awe rather than disappointment.",
      "total_reactions": 1,
      "user": "marthalorimer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "A letdown to say the least. The first 20 minutes of the film is a rushed mess. The visuals and cinematography, however, are spectacular and keep the film afloat. It's just unfortunate that a movie should have to rely on it.",
      "total_reactions": 1,
      "user": "willkulka"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "F. Scott Fitzgerald's \"The Great Gatsby\" is undeniably one if the greatest novels in American literature, and one of my personal favourites. I was thrilled to find out that the book was being adapted into big budget movie, and I thought that Casting Leo as Gatsby was brilliant.... I was so disappointed with the film. The acting was spot on, and the cinematography was impressive; however, the directing was horrible. Also, the most iconic moments in the book were cut short and reduced into a music video. What the hell was Baz thinking? I'll rate it a one for Leo and Carey",
      "total_reactions": 1,
      "user": "SeniorMints"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "It's not the performances that are bad, it's the idea and story itself. It just isn't interesting, it's painfully boring, and Baz Luhrmann made it even worse, because after the first 20 minutes of lights and music, the rest is extremely boring.",
      "total_reactions": 1,
      "user": "MattG_123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I was interested why Leo didn't get an Oscar, so I went to watch this movie. In short - now I know why.",
      "total_reactions": 1,
      "user": "stako"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Let me to say first. I have not seen the original film. (I mean the one in 1974). For me this film is one of the best films seen. Leonardo DiCaprio other actors, playing in a very pleasant way. Music is also very good, even impressed me.",
      "total_reactions": 1,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "The Great Gatsby starts weak. Everything felt too uneventful, the introduction of characters and their performances were overshadowed by the fast paced direction that seemed to give more importance to its bombastic and exuberant screenplay than anything else. Whats more, the script which is full of actual quotes from the book felt forced. Is as if Luhrmann wanted to draw every detail from the book as fast as possible and with little depth. Fortunately the movie eventually slows down and starts delivering a much more profound and interesting film. The scenes become longer and much more significant, and the performances from the great cast start to flourish. Leonardo DiCaprio is the highlight, delivering a very credible Gatsby that fits perfectly within the lines of the book. That is with Joel Edgerton also delivering an incredible performance as Tom. At the end. the movie then becomes a smooth combination of great story, acting and amazing cinematography, but never letting the latter outshine the former like it did in  the first 15 minutes or so. Ultimately it is a very enjoyable film that effectively transcends the book into the big screen, and its one of the best movies of the year so far.",
      "total_reactions": 0,
      "user": "Gilberto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I enjoyed this movie. The sets are fantastic, although the juxtaposition of modern music with a 1920's setting is not a good choice. I would expect this in a Broadway musical, but to see 1920's characters dancing to Jay-Z is just distracting in this film. They could just as easily have replaced the phones in the film with the latest IPhones, it would have had the same effect.. The music unnecessarily breaks the fourth wall even though the characters do not. The film is otherwise great.",
      "total_reactions": 0,
      "user": "Edgar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "I wish “The Great Gatsby” had opted to be either much more faithful or much less faithful to Fitzgerald's novel.  As it was, the film’s fidelity, especially early on, made its ultimate departures dismaying--at least to this lover of both Fitzgerald's writing and Luhrmann's films.  It was as though the director was perfectly happy to party with the novelist but didn’t want to endure the brutal clarity of his hangover.  The worst offenders, for me, were the kinder, gentler Daisy and Tom.  In the novel, though superficially charming, they are, at heart, cruel, greedy and self-obsessed; in the film, they are flawed but relatively sympathetic.  And, to make that work, Luhrman makes Gatsby less sympathetic--and he makes Nick’s admiration for Gatsby deeply suspect.  During the final showdown at the Plaza Hotel, for example, Luhrmann's Gatsby becomes physically violent, alarming Daisy, who then decides to leave him.  In the novel, Gatsby's violence is limited to a fleeting facial expression, and Daisy's terror has multiple causes, not least the intrusion of real passions into her elaborate social game.  In the film, right after Myrtle is killed, Tom points her vengeful husband at Gatsby, as the driver of the \"death car.\"  Perfectly understandable: Gatsby normally drives the car, and Tom is distraught over the death of his lover.  In the novel, however, Tom fingers Gatsby the following day, AFTER learning that Gatsby is innocent and his own wife the killer.  That's a whole 'nother level of depravity, and, for me, it's much more interesting than \"he did it because he was grieving,\" a tired motive that appears on TV at least a hundred times per week.  So what does Luhrman achieve by making Fitzgerald's characters more familiar and formulaic while preserving so much of Fitzgerald's language and plot?  For one thing, he backs away from the idea that vast, unearned wealth can be corrupting, as can vast differences between the “haves” and the “have nots.”  Moreover, from the moment he introduces Nick as a mental patient, he decides for us that Gatsby was more deluded fool than idealist, whereas Fitzgerald was careful to keep the two possibilities balanced.  These, for me, are losses.  While I have no problem with plot or character changes, generally--I loved Luhrmann’s tweaking of “Romeo and Juliet,” for instance--there has to be a payoff, and I don’t see one here, unless you count instant recognition as a virtue, which, I suppose, billions of McDonald’s customers do.  Finally, a word about the film's music.  When I heard Filter’s “Happy Together” in a preview, I got excited.  After the mostly edgeless tunes and sappy baladeering of “Moulin Rouge,” I was ready for some thrilling music to accompany Luhrmann’s thrilling visuals.  But thrills turned out to be in short supply.  I liked Jay Z’s “$100 Bill” for the speakeasy scene, which was appropriately urban and decadent, but some of the other hip-hop tunes clashed badly with the anti-urban milieu of the Hamptons.  The most egregious misfire, however, was Lana Del Ray’s “Young and Beautiful” as the theme song of Gatsby and Daisy’s renewed love.  “Will you still love me when I’m no longer young and beautiful?” asks the song, over and over, a question utterly irrelevant to the reunion, after five years, of a man cherishing a beautiful illusion and a woman seeking diversion.  I can only conclude that Luhrmann and his music director, Anton Monsted, think audiences don’t listen to song lyrics.  I also question Monsted’s taste (he did “Moulin Rouge,” too), which I find too reliant on what is--or has been--at the top of the charts.  He strikes me as a man who listens to popular radio and little else, making most of his musical choices obvious, boring, and ill-suited to their dramatic contexts.  I’ve heard much better music on TV shows such as “The Sopranos,” “Life,” and “Sons of Anarchy,” and I wish Luhrmann would hire one of their music supervisors (or me) for his next film.",
      "total_reactions": 0,
      "user": "JennetP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "\"The Great Gatsby was not as \"great\" as it should have been, but features some of the most dazzling visuals, outstanding soundtrack and just breathtaking performances across the board. Baz Luhrman has given the classic novel the film adaptation it deserves\"  B+",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "A film with some great set pieces; I found the party scenes particularly spectacular. It’s beautifully shot and I’m quite glad I saw it in 2D as I couldn’t see how 3D would have enhanced it much. I found the music interesting with the big set pieces being handed over to rapper Jay-Z (also an Executive Producer), but it was the original music by Craig Armstrong that I found most enthralling. There are several well known themes subtly placed in the soundtrack and I found both refreshing and interesting. All the performances were great with DiCaprio and Mulligan getting top billing; but I thought Tobey Maguire was equally good. I guess I’ll have to read the book to be able to decide just how good an adaptation this is; but for now I found it quite a satisfying watch with plenty of drama to keep me entertained. If I was to be super critical I would have to say I found the character of Gatsby a little one-dimensional, but having said that it’s still well worth a look if you get the chance.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "This is a very mixed movie.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "I feel like this movie is going to have the most value to those who have actually read the book. Not that those unfamiliar with F. Scott Fitzgerald's literary masterpiece can't enjoy themselves. It's just that part of the movie's appeal is seeing the story brought to life with visual exuberance.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "The Great Gatsby is my favorite novel of all time and I am keenly aware that it is super difficult to translate into film. That said, if you can make it past the garish \"I'm Bazz Lurhmann!\" horror of the first 30 minutes, the director finally lets his actors breathe and the classic scenes come raining down with suitable emotion. It's not a home-run for sure, but this version of The Great Gatsby is at least a good try.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Love is blind, motivating, energizing. Gatsby the new name of a poor man who becomes wealthy out of nowhere. He buys a huge residence close to his lost love, he invites the town hopping she shows up. When he finds her he starts going back to losing her again. He is finally killed by wrong understanding from a poor man who thought Gatsby is behind his wife killing in a car accident. Excellent scenes and colors, persuading acting.  Everybody has this movie in mind days after leaving the theater. Not to be missed.",
      "total_reactions": 0,
      "user": "Hfahmy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "I both like and hate The Great Gatsby. How? Why let me explain! The first half of the film basically relies on too much of modern rap music, annoying close ups and bizarre sequences that feel like the film itself is on acid. Not only are those a problem, but also the film begins to fall into campy territories with unintentionally funny moments and over-the-top acting. But later on in the film, the flaws of the first half begin to fade (though they reappear sometimes) and the film starts to feel more like a 1920s drama film rather than an over-the-top bizarre stage play music video. The film, to be honest, didn't need to be as visually impressive as it is and the 3D, though good at times, didn't need to be present. Besides a pretty robotic performance from Carey Mulligan, the acting was often solid, though every actor and actress had their fair-share of over-the-top and campy moments. In the conclusion, The Great Gatsby is a visually dazzling and a decent movie, though self-indulgent and not at all great.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Watched this topical Baz Luhrmann extravaganza in a plain 2D version, adapted from a world-famous classic, the daunting comparison is predestined, lucky me for being completely oblivious of the original novel and its earlier cinema adaption, so I feel privileged to take my pleasure from viewing this film without being nettled by any premeditated notions whatsoever, blessing the ignorance!",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "The critics truly were too harsh with this gem--it is always difficult to adapt such a beautiful novel as this, but Baz Luhrmann has created such a stunning interpretation.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Some books should not be made into films. I have always believed The Great Gatsby is one of them. But, this film does a good job making a modern day adaptation of it. If you know the book, you have to stretch your mind a bit to envision the characters. I thought Leo as Gatsby was a good casting move as he is solid. And although I am not a fan of Tobey he does a good job as Carraway as well. But, if you like the movie, read the book.",
      "total_reactions": 0,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "This film adaption of F. Scott Fitzgerald's novel, The Great Gatsby, is about a man in the 1920s trying to win back the woman he loves.  This version is a cartoon with real life actors - everything super brightly colored and sporting more special effects than a Star Wars movie, much of it very fake looking. Gatsby's home when shot from the exterior is so obviously computer generated it's shocking. There's plenty of blue screen (or green screen these days) that is about as obvious as can be, with the lighting on the actor standing in front of the green screen not matching the lighting in the scene projected behind him on the green screen. It might as well be a Godzilla movie from the 60s at those moments. You might wonder why they felt the need for so many effects. The camera whizzes around Long Island over and under elevated tracks in Manhattan, almost all of which (both Manhattan and Long Island) appear computer generated, so much like a computer game I felt like readying my controller to start controlling the main character. It's a miracle that amidst all this crazy visual jazz, that the story's basic outline (because that is all there is here; just a skeleton of the plot) doesn't get lost. That was a feat and for that I give it 1 star out of 10.",
      "total_reactions": 0,
      "user": "NikolayG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Absolutely a beautifully shot movie. Each frame of the film looks almost like a painting. This film is drenched with color and has brilliant filming The largest problems in this film is that it features a soundtrack that is contemporary music mixed with music that is more to the time period of the film. Surprisingly the contemporary music works in most instances however there is one or two times where the much more modern contemporary music seems out of place. The other major flaw is that so much time was spent in this movie on it's stylistic looks which as i said earlier were flawless but so much time and effort was spent on these that it seems to have taken away from the character development side of the film. While there are many scenes that are pretty I wish they would have sacrificed some of those to develop characters other than Gatsby and Carraway.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "This movie has me so torn. Some things I just loved about this story. Other things really distracted and annoyed me. Overall a good film. I loved the scenery. The scenes of them in the city with the contrast turned up on the color made me feel like I was watching a 60 year old movie in a good way. On the other hand the Beyonce and other Hip-Hop songs were well not well contrived. Good  the way the city is set up with the labor class supporting the upper class was done in an almost cartoonish way that was very beautiful. The acting was great and the actress playing Daisy steals every scene she is in. The omissions from the original story  Bad. Overall a good pretty looking movie that you will forget about in a few weeks.",
      "total_reactions": 0,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "E’ il poco prolifico australiano Baz Luhrmann a prendersi il rischio di scrivere (assieme a Craig Pearce) e a filmare la terza versione per il grande schermo dell’opera più conosciuta di Francis Scott Fitzgerald, romanzo che ha dato parecchio filo da torcere ai propri adattamenti cinematografici. Per provare a vincerne la sfida, il regista dà alla storia una confezione molto modernista, disegnando degli anni Venti davvero ruggenti, in cui dominano colori netti e brillanti che ben si inseriscono in un décor a dir poco sovrabbondante: ad amplificarne l’effetto pensa poi una colonna sonora che unisce l’arrembante musica dell’età del charleston con inserti hip-hop  uno dei produttori esecutivi  Jay-Z  che sottolineano ancor di più la frenesia del periodo (il che porta a infischiarsene maggiormente di altri anacronismi, tipo la ‘Rapsodia in blue’ che non era ancora stata scritta al momento in cui si svolge l’azione). Con alcuni passaggi coreografati quasi come un balletto  la gestione delle finestre nella villa dei  Buchanan, l’arredamento floreale della casa di Nick  la prima parte viene raccontata come una grande fiaba, con i due castelli che si fronteggiano dalle parti opposte della baia, quello sfavillante del principe biondo e quello in cui vive prigioniera la bella di cui lui  innamorato: il tutto raccontato dallo scudiero che serve da collegamento, almeno parziale, con una realtà che può essere molto lontana dalle feste organizzate da Gatsby. Quando la favola che il protagonista principale si era costruito si incrina, il contatto dei due mondi  quello di chi ha troppo e quello di chi ha troppo poco  apre le porte alla tragedia, rivelando sì la vera, controversa identità del personaggio, ma soprattutto la povertà umana e morale di una classe benestante a cui anche Daisy aderisce alla perfezione, ben lontana dall’immagine idealizzata da Gatsby. Purtroppo, però, proprio nel momento in cui il pathos della storia dovrebbe raggiungere il culmine, il film comincia a perdere qualche colpo, quasi che, venuta a mancare la sovrastruttura luccicante, la scrittura smarrisca il giusto ritmo in una serie di situazioni trascinate troppo per le lunghe. Anche nell’ultimo terzo di pellicola non mancano i momenti belli e le intuizioni efficaci  come quando le lettere che giocano sullo schermo finiscono per formare le intense parole di Fitzgerald lette dalla voce narrante di Nick oppure nel richiamo, attraverso le ultime inquadrature della piscina, dell’incipit di ‘Viale del tramonto’  si finisce per sbirciare l’orologio qualche volta di troppo, con la conseguenza di raffreddare l’emotività. Fa capolino così il sospetto che, seppur in modo meno grave che altrove, la cura per la confezione abbia finito per essere prevalente rispetto a quella riservata al contenuto (il film  distribuito anche in un superfluo 3D): a soffrirne  il giudizio complessivo che, pur senza dubbio migliore rispetto agli adattamenti precedenti, finisce per essere inferiore all’aspettativa creata dalla somma delle parti., Fra queste ultime, spicca la prova di un cast davvero affiatato: DiCaprio, che già aveva lavorato con Luhrmann in ‘Romeo e Giulietta’, aggiunge un solido mattone alla costruzione della sua carriera vestendo alla meglio i panni di un altro personaggio più grande della vita, mentre il suo amico (anche nella realtà) Maguire dimostra ancora una volta di avere la faccia giusta per interpretare chi si trova a osservare con stupore quel che di inatteso gli capita. Se poi Carey Mulligan disegna una Daisy dolce e indecifrabile (ma che meraviglia erano mai i tagli a caschetto?), in caso di scelta obbligata del migliore la preferenza cadrebbe forse su Joel Edgerton alle prese con lo scomodo ruolo di suo marito Tom. Azzeccati anche i ruoli di contorno  Jason Clarke fa ancora una volta il ruvido  fra i quali spunta, in una particina monobattuta da guidatore di taxi, Nick Tate: per i maniaci (come me) l’indimenticato pilota di Aquile in ‘Spazio 1999’.",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "A classic Baz Luhrmann spectacle, if a slightly vacuous one. Perhaps more a film of a 'Great Gatsby' fairy tale than the novel, struggling through slightly trippy 3D and an admittedly intelligent parallelism with between 20's and contemporary culture.  It omitted multiple areas of symbolism, the most exasperating of which being the infantile interpretation of Gatsby's love for Daisy, avoiding the true messages of delusion and futile aspiration. This could be tolerated if the dialogue wasn't selected with such a bias as to ignore other allegories and messages. This being said, Lurhrmann's interpretation, however devoid of substance, was perfectly carried out by an ever-charming DiCaprio, with a surprisingly intimate performance by still-faced Elizabeth Debicki. But this saw itself ever overshadowed by crude hyperbole regarding the Valley of Ashes, all exacerbated a simplified representation of Daisy. A well directed piece of art, masking a high school interpretation of the novel.",
      "total_reactions": 0,
      "user": "Edster8000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "I liked this much more than I thought I would. The Great Gatsby takes you to another world.It has a magical feeling.I never read the book and enjoyed it.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Not that great if you ask me. The final 20-30 minutes make up for the rest of the movie though. Which comprises of 1 and a half hours of over the top scenes that have zero substance and left me bored out of my mind.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "The movie's overblown style (CG, 3D, and Jay-Z), chokes the very life out of any substance the story may hold. There's always something to distract the eye, but it becomes increasingly annoying and persistently rings hollow. There is a mystique about F. Scott Fitzgerald’s \"The Great Gatsby\" that has proved unattainable to filmmakers. Four previous attempts have fallen short of capturing the book's projections of an America succumbing to the allure of money. Chalk this up as the fifth.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This is a tricky one to review as I did enjoy it but it was a rather odd film. Very good acting, especially from the leads, but as great as Leo DiCaprio was I couldn't help but get annoyed by his character and of that term 'Old Sport'. The party scenes looked amazing and where a clear highlight of the film. It got a little mellow and slower towards the middle before picking up more towards the end, but overall an entertaining film that should please many, but it had potential to be a bit better!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Ive never read the book so i dont know how well it does to compare, however, i thought this movie had a real sense of life to it. it was captivating and i have no idea why the movie got such a low score from critics.",
      "total_reactions": 0,
      "user": "emnix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Just like the book, the movie is slow in the beginning. However, it gradually picks up its pace and moves forward. I don't think this is how I imagined the book when I read it. I really do think Toby Maguire is miscast. Also, the movie just didn't feel like the book (I don't know how to say this). Overall, it was an okay movie.",
      "total_reactions": 0,
      "user": "JoyTheWizard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Disappointing for Di Caprio as he is such a talented actor. I will begin by saying this film is very well shot and well lit, the party scenes were kind of interesting as well as a organised and 'modern infused' soundtrack. However, there were many negatives that I have to discuss. Daisy, was the worst kind of person, I won't spoil the ending but I must say that it ruined the entire film for me. This is so much fuss over one girl..I know the whole aspect over 'Daisy wants her daughter to be a fool because she needs a man' but it clings to it like flies to honey. The highlight of this 2 hour drive around New York with some complaining was Toby Maguire. The entire film he was a third wheel to all the **** going on and almost seemed to be the one thinking 'uh....are you serious?'. A very disappointing movie for me.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The Great Gatsby is romantic comedy drama taking place in 1920's New York during prohibition. Following footpaths of Moulin Rouge, it is stacked with big-name actors, hip music and capturing visuals. If leaving out vibrant party scenes, cool soundtrack and sure-fire casting there is really much to The Great Gatsby.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Before I saw this movie, I had heard it was just mediocre. But who ever thinks that is dead wrong. This is well above mediocre. It's fresh, interesting, entertaining, well directed, well acted, and it's got style. One of the biggest complaints from critics was the Jay Z rap. The Jay Z rap turned out to be awesome and it goes well with the movie. Leonardo DiCaprio is perfect as J. Gatsby but everyone in this movie had a great performance.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Baz Luhrmann's films each have a distinct visual and aural quality to them. We are witness to vibrant colours, sweeping camera movements, sudden zooming in, and mystery which is supporting by a suitable soundtrack. These features translate well into the 1920's setting to transport the viewer into a bygone era. However despite all these positives even they cannot make a really long, slow and dull story any more watchable.",
      "total_reactions": 0,
      "user": "bm2759"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Who is Gatsby? That's what Nick Caraway the films narrator tries to tell us over the course of this film. The film leans heavily on the source material with word for word translation from book to screen, which was fine for the most part but the delivery of some lines felt strange. The acting throughout is pretty decent by all involved. The visuals as at times are stunning especially with the use of the 3d effects;though sometimes I felt it could have been used more, though at times it becomes clear that actors are stood in front of a green screen. The modern music was a nice touch making the setting feel more relevant to a modern audience. Again however it felt underused. I found the story was interesting and yet I couldn't quite see the underlying meanings of the story, so perhaps a prior knowledge of the story would be beneficial to viewing the film.",
      "total_reactions": 0,
      "user": "CtheTav"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "The Great Gatsby. The quintessential novel by F. Scott Fitzgerald about the disillusionment of the decadent wealth of the 1920s and a cautionary tale about the American dream seems like a no-brainer to turn into a blockbuster film. But does director Baz Luhrmann’s stylized vision of the time period do the book justice, old sport?",
      "total_reactions": 0,
      "user": "Recomedia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "The movie was just great, it had a great story and depicted the Roaring 20's wonderfully. Great Gatsby veterans might not prefer this version over Robert's back in the 70's but it's really entertaining and worth watching. The only problem I had was some of the soundtrack, and by some, I mean Jay-Z. You read right, Jay-Z. I would of preffered jazz to depict the 20's alot better but the soundtrack didn't kill the movie so there's nothing to worry about it.",
      "total_reactions": 0,
      "user": "The-Truth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "The atmosphere was absolutely amazing, one of the few movies that actually draws you in and makes you a part of the story. The plot on the other hand was rather weak. They should have made a greater story around the business side of things. Why this spiderman fella was in the movie i do not know, he had absolutely nothing to bring to the story. i would normally rate this movie a 6 or 7, but the AMAZING MUSIC definitely made me press the 8 button. Add to your list of must have seen",
      "total_reactions": 0,
      "user": "Ulquiorra"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This movie looks exactly like Moulin Rouge transported to the 1920s in New York. It's a beautiful feast that those of us who are under thirty will identify with and love. It is not an uplifting riotous good story. It's Fizgerald, updated and green screened. And I loved it.",
      "total_reactions": 0,
      "user": "lehuggin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I went into this movie having not-so high hopes for this movie. I heard from my friends that the people were casted incorrectly and that the story-line was OK and Leonardo DiCaprio was the only good thing in the movie. I was thoroughly surprised at what I saw. I never read the book so I am not basing it off of that. I think that Toby McGuire did an excellent job at playing the role of Nick Carroway. Leo did an extraordinary job at playing Jay Gatsby. I enjoyed the movie and enjoyed the story-line. I tip my hat to you Baz for having a cool name and directing the movie very well. I enjoyed the dubstep sequences though most people didn't like that. i thought it brought a different feel to the film. A good film. I have to say at some parts it was alright and others it was great. It was pretty good, but not extraordinary. This is why I give it an 8/10.",
      "total_reactions": 0,
      "user": "Voice0fReason"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Its great seeing my favorite literary character brought to the screen by a director I greatly admire, but I can’t say the sum is equal to the e parts. The Great Gatsby was a decent film, there was a lot that I liked and a lot that I just flat out didn’t like; all which stems back to the way it was directed. Like all Baz Luhrmann directed films, Baz Luhrman is the star of the show. His whimsical, almost animated, way of telling a story shines bright in this picture; from those wild camera angles, startling soundtrack, hasty editing, and flamboyant set designs and not to mention the eccentric performances he extracts from his cast. While much of his flare worked well for those party sequences, I felt the film itself was far too off-the-wall for its own good. I am hardly convinced that this was the direction he should have taken, but at no point in time did it leave me bored. Do not fret too much, the visuals did not get in the way of the romantic aspects of the story; as it was delivered to the screen in a respectable manner. What I was really bothered by was the way some of the intricacies of F. Scott Fitzgerald’s exquisite story were taken away, in favor of style and visual intricacies. I believe this hindered the dark social commentary on the wealthy and the nature their moral detachment; which was quite disappointing. But, what can I say… such style! Catherine Martin’s fantastic costumes and sets were characters of their own. Clearly my view on the film and the way it was made is very much mixed; but one thing I appreciated without a doubt was Leonardo DiCaprio’s performance as Gatsby. Gatsby’s bold attempt to reach for that green light and regain his love, Daisy, is noble yet foolish. However, you can’t help but relate to this character, as it’s sometimes easier to hold on to hope than to let go completely. While not perfect, DiCaprio made a fine Gatsby in my opinion.",
      "total_reactions": 0,
      "user": "Prodigy2013"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "THE GREAT GATSBY",
      "total_reactions": 0,
      "user": "CriticWes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This film is one of the best I've seen for a while! I haven't read the book, so had no preconception of what it was going to be like. I loved the use of vivid colours and symbolism throughout the film, and I found the film really intriguing. It really gets in your head and plays with your mind. Overall, a thought-provoking, yet enjoyable film with an awesome soundtrack! I'm definitely going to read the book now!",
      "total_reactions": 0,
      "user": "willscott"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "This movie is certainly fantastical, but there are a few things that throw it off course. First, I loved the way Baz Luhrmann portrayed the twenties, but I wanted the generational music to go with it. Who cares if it's Jay-Z? (Everybody). I wanted some jazz to finalize the theatricality of the cinematography! Also, this is Luhrmann's attempt at getting some oscar recognition, which he won't get. The film simply doesn't hold together like an oscar contender. Having said that, the movie is worth checking out. #seeit",
      "total_reactions": 0,
      "user": "ceefrosty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Like almost every American who has been through high school I read The Great Gatsby and like most high schoolers likely didn't appreciate the novel that first time around. Though the more accurate word is probably that I didn't comprehend all of what it was trying to say I still have yet to re-visit the novel since my sophomore year, but as I sat down to experience the latest film adaptation of the novel by the often flamboyant and always stylish director Baz Luhrman the parts of the story that I vaguely recalled seemed to escape me completely and I was then able to completely embrace the extravagant world in which Luhrman and his team had created for the audience to dig into and become all the better acquainted with the specific time period, the social climate, and the characters that it is necessary to care about before we become entranced with their melodramatic lives. It is to be understood that through the glitz and the glamour of the roaring twenties that this is essentially what F. Scott Fitzgerald's great American novel was if not a high form of it wrapped in commentary for the societal issues of the changing culture during that time. Though it would be easy to dismiss the film as a case of style over substance I was completely on board from the very beginning as the caliber of the cast here was able to elevate what might have been an otherwise overlooked aspect of the production. The depth each actor brings to his or her character lend an emphasis to the themes Fitzgerald touched upon and they are only embellished by Luhrman's preference to have everything as big and excessive as possible. It is a film that entices by the fantasy of the world it exists in and it holds our attention by being consistently stylish and letting it's cast bring their A-game that in turn creates a combination that captures the essence of everything I expected and wanted this film to be.",
      "total_reactions": 0,
      "user": "VandyPrice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Really wonderful film with great Leonardo Dicaprio. It is good that today in the world which had lost all morale principles we can see such a film...Moreover there's also a great soundtrack!",
      "total_reactions": 0,
      "user": "anmatan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Though the movie capture the extravagant parties and the fast-paced lifestyle of the Roaring Twenties, it ultimately falters when trying to touch on the book's symbolism. The conflict  when it arrived  felt rushed, and the resolution even sloppier. Some scenes excel in portraying the love and obsession Gatsby had, but when the movie ended, there was a feeling that there should've been more. The casting of Tobey Maguire as Nick Carraway, the unreliable, sometimes sarcastic narrator, did not help the movie's cause either. Although this is the best book adaptation, there is still much sought after.",
      "total_reactions": 0,
      "user": "BIG-Dong"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Soul-less, overly extravagant, and adorned with nauseating rap music, this relatively poor interpretation of an all-time favourite American classic succeeds in disappointing any hopeful viewer.",
      "total_reactions": 0,
      "user": "Elucidate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Glossy to where it's nauseating. A music track missing the era by at least eight decades. And bland performances from all with the exception of Leonardo DiCaprio and Tobey Maguire. It dragged on for at least thirty minutes. And the script is just as bland as the actors' acting. And too much color. Baz Luhrmann, you have s**t for talent.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "I thought it was a mediocre movie. I'm not really disappointed but i must say it was not very authentic.",
      "total_reactions": 0,
      "user": "Lordpeke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Emotional film  which has in the great interpretation of Di Caprio (and I say this as someone who usually can hardly appreciate him), and in the wise use of certain phrases/sections of the book, its strength.",
      "total_reactions": 0,
      "user": "Corwin86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Great movie. I didn't like the book very much, but the movie was very good. Dicaprio plays Gatsby perfectly. He acts bad acting. If he seems like he's not the right person for the role, thats good. Gatsby is described in the book as sounding almost as if he is going out of the way to sound and appear to be \"old money\". All roles were cast perfectly. Very few negatives to this movie.",
      "total_reactions": 0,
      "user": "Shift857"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "I really didn't know what to expect when I watched this movie, but I can tell you I was at least pleased with the outcome. Leonardo DiCaprio and Tobey Maguire both did good performances, as well as the rest of the cast. The film provides an interesting look at the height of the \"Roaring Twenties\". However, it's long running time of nearly 21/2 hours and a near-constant bombardment of visual over-stimulation might make the film somewhat exhausting for some. Every bit as visually dazzling as one might expect with it's production, grand sets, scenery, and detailed costume designs. I personally feel that while this film doesn't necessarily belongs to the category of overblown, over-elaborate movies out there, it could have benefited from having a less dazzling tone. All that aside, the plot was good and I felt sad at the end for Gatsby. Because of the film I decided to read the book, and the movie is a good adaption of the novel.",
      "total_reactions": 0,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "I can't understand why the critics panned this movie. I thought it was one of the most visually brilliant films I have seen. The visual imagery has also been well used to capture the period, the characters, the plot, the emotions and the mood of the movie. Leonardo DiCaprio turns in a fine performance and is well supported by Tobey Maguire.  I enjoyed every bit of it.",
      "total_reactions": 0,
      "user": "MobyZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "First half impressions:",
      "total_reactions": 0,
      "user": "xolve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Beautiful picture with really good actors and a interesting story, but the jay-z songs in the middle of the 20s NY scenario and the extremely computerized buildings and cities didn`t convince me.",
      "total_reactions": 0,
      "user": "mvoelcker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "It is a more faithful film than the previous remake of The Great Gatsby and thus is more watchable, but this version is seem more interested in it's special effects rather than a full focused story.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Another adaptation of Fitzgerald's pièce de résistance novel also the second film adaptation of 1974 film. I haven't read the novel, but what I've heard about this is this movie is that it stays true to the novel, which fans of the novel will love about this movie but what people are worried about is director Baz Luhrmann distracting the viewers with too much eye candy and not making it more realistic also you don't buy the fact it's the 20's it has a terrible pop culture style if the movie didn't to much Jay Z music it could be more realistic. The cast is selling it, we actually get to know these characters and do a good job. Luhrmann does screw up the realism but it's a fun ravishing movie with great clothing design and intoxicating breathless party scenes and brainy dialogue. Screenwriter Craig Pearce and Baz Luhrmann (whom Luhrmann wrote the script) do a pretty astonishing job writing 20's brainy dialogue and a having dreamlike quality to the film. DiCaprio and Carey Mulligan have some okay  \"Romeo and Juliet\" chemistry also Tobey Maguire was great too as the narrorator also a loyal friend to Gastby. A Midwestern war veteran finds himself drawn to the past and lifestyle of his millionaire neighbor.  Grade A",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Luhrmann's attempt to modernise the story does come across overall as rather stilted. I can see how the purists would be annoyed at the lack of subtlety and how certain themes and characters are portrayed. As a cinematic piece however, the visuals, with some great editing in scenes, and certain performances hold this film together.",
      "total_reactions": 0,
      "user": "Kayak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "This is a story that lots of us have heard of. I personally enjoy this movie more than the old one. The main thing I like is that the creator could link the times when the Gatsby is from and nowadays. The costumes and decorations were from 'there, but the music was from our time. Some of the music were following the style ofjazz and some were just like dubstep, which helped to notice tge difference between two worlds. However, behind that, I felt like I am there with Gatsby and other characters, feeling everything they feel. Good new production, but I reccomend to read the book before watching.",
      "total_reactions": 0,
      "user": "tania9torres"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I’ll have this soundtrack going though my head for the next couple of weeks. The Great Gatsby takes place in a futuristic feeling twenties which gives the movie a very entertaining yet confusing setting. The movie follows an average New York Wall Street broker who takes an interest in his mysterious neighbor, Mr. Gatsby. It’s hard to say what this movie is really about without giving away too much. For a movie based on a critically acclaimed novel written in the the mid-twenties, it sure has a modern feel to it. This aspect of the film bugged me at first, but I quickly got used to it, falling into the surreal fantasy of Gatsby's world. I found this movie very entertaining and fun, all while being clever. The film had a very exaggerated feel to it, like a play on broadway. At first it was distracting but the style grew on me as the movie progressed. So I have to say acting was pretty good, Leonardo DiCaprio knocked it out of the park as usual with a great performance. On more of the downside the film lacked a sense of reality and pushed characters past the point of being believable. I felt it didn't really try to be anything it wasn't, and seemed to be pretty self-aware. The movie looked and sounded great. I recommend it for a different kind of movie watching experience.",
      "total_reactions": 0,
      "user": "B-RAX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "The cast is excellent and it all looks perfect. I suggest reading the book first as it makes the movie better. I like Jay Z so I have no problem with the music selections. Overall, a good movie but Fitzgerald's story ultimately drags the movie down a little.",
      "total_reactions": 0,
      "user": "TEM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "The Great Gatsby looks to be very simple, but it actually hides a very complex story that is more than a romantic, high society, what ever story. charismatic Jay Gatsby uses all of New York to weave his shell game. It is so well written that when reading a lot of reviews, professional and not, so many do not see the forest through the trees. What Mr. Fitzgerald has done is woven multiple stories into one character, and made it look easy. The movie was well done on all aspects",
      "total_reactions": 0,
      "user": "DanRich"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "I believe modernizing \"The Great Gatsby\" was a huge mistake, because precise period detail plays a very important role in Gatsby's story. Using modern hip-hop and R&B; songs obviously won't give you a glimpse of the roaring 20s. Casting Tobey Maguire as Nick Carraway seems wrong as well; his character is supposed to be the one any viewer could identify with, (Because in the book he is the POV character) but \"Peter Parker\" obviously does not have the skills to do that.",
      "total_reactions": 0,
      "user": "Apartment64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "As I seen The Great Gatsby movie at my school, I find it pretty good. Though the only problem with this movie is the music. You see, the music wasn't fit in right. It was too modern. Especially with Jay-Z as the music producer. If he weren't producing rap music much, I would loved the movie even more. So go check it out if you hadn't seen it. It's a pretty good movie.",
      "total_reactions": 0,
      "user": "Tison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "Film is such a gift by science and a chance to take the flat page and make it truly alive in sight and sound and mood, this movie reminds me as a child of my wonderment in seeing my first pop up picture book, and after a fleeting wonderment,  just wanting to rip the image out to see if it does anything else.",
      "total_reactions": 0,
      "user": "ThomasSmithson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "A surprising emotional scope blended with good cinematography, a great soundtrack and very stylish direction gives Baz Luhrmann's The Great Gatsby a grand overall feel.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "\"The Great Gatsby\" is just another movie that proves Leonardo DeCaprio deserves an Oscar. Sure the movie was even more complicated than i expected, which made me feel less and less a fan of the movie, but the only thing that was 100% positive was Leonardo Decaprio's acting. Amazing.",
      "total_reactions": 0,
      "user": "RanSBuzz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "A magnificent and beautiful film to watch, The Great Gatsby captures the opulence but little else.",
      "total_reactions": 0,
      "user": "ArchonMagazine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "\"The Great Gatsby\" 10 Scale Rating: 7.5 (Very Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "The simplicity behind the story is almost laughable, it’s been done, and it’s déjà-vu but The Great Gatsby plays its cards right. It’s starts with the execution, the directing, the photography and the acting is impressive. You can see Baz Luhrmann’s stamp throughout the film, it’s colorful, loud, and a bit in your face but it works because it fits Nick (Tobey Maguire)’s point of view. Nick’s the one telling the story, so the excess, the sensory overload, the overwhelming aspect of the fast life of the roaring 20s New York is exactly how a guy like Nick would experience it.",
      "total_reactions": 0,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "One of those few movies that gives its book incredible life (not saying it necessarily reflects the book).",
      "total_reactions": 0,
      "user": "jlhg11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "This movie is just awful! it just awful and awful movies don't need to be in here because it just awful you feel me? so yes I would agree that this movie is for the next gen but it awful.",
      "total_reactions": 0,
      "user": "B1gboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "The drama is tense and the romance is believable, but die to Luhmann's chaotic direction, the heart of the material gets lost along the way. At the end of the day, The Great Gatsby, is far from a masterpiece in many aspects, but at least it's a faithful tribute to the novel its based upon, which I supposed is all a big Gatsby fan can as for at this point.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "This isn't the first time that F. Scott Fitzgerald's acclaimed book from 1925 was adapted into feature length film. The novel was first adapted in 1926 as a silent film starring Warner Baxter and Lois Wilson, then again in 1949 with Alan Ladd and Betty Field in the lead roles. Then, once again in 1974 starring Robert Redford and Mia Farrow. But this one, in 2013 had something to deliver...it had Baz Luhrmann in the director's chair, the famous director best known for his more modern take on \"Romeo and Juliet\" in 1996, and he directed the elaborate and eccentric musical that is 'Moulin Rouge' (2001).",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Dear F. Scott Fitzgerald,",
      "total_reactions": 0,
      "user": "MirandaMckinnon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "A pretty solid adaption of the classic book. Dicaprio and Maguire give their all with this film and totally capture the characters right off the page. There are alot of problems with the editing and script however.",
      "total_reactions": 0,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Movie critics are useless.............................................................................................................................................",
      "total_reactions": 0,
      "user": "mc_ryn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "This is one of the greatest movie of the 21 st century. The acting, the filming and the story, it's all there and it's perfectly done in every way possible. As always Leo is just amazing but it's really Tobey Maguire's part in the movie whitch is outstanding.  Ten out of ten all the way.",
      "total_reactions": 0,
      "user": "Jonte_V19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "\"Will you still love me, when I'm no longer young...\" are the words to the chorus of The Great Gatsby's theme song. That fact of the matter is that I will absolutely still love this film when its no longer young. Sure, some may criticize its lack of subtlety and tender pace that were characteristic of The Great Gatsby novel, but few can deny this film's masterful portrayal of key characters and the orgastic yet sickly vibe of the so-called \"Roaring Twenties.\" Heart-shattering the plot, amazing the visuals, and skilled are the cast in this ambitious interpretation of Fitzgerald's book. Make sure to read the book before seeing The Great Gatsby, as it does speed by some important ideas at the pace of a motion picture.",
      "total_reactions": 0,
      "user": "IntelliCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Stunning movie. The music, vivid colors, amazing scenery, all combined",
      "total_reactions": 0,
      "user": "Ubervaag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Marvelous performances, style, costumes, mindblowing soundtrack. 100 out of 100! The best \"Gatsby\", in my opinion. Loved every minute of it. Leonardo DiCaprio is phenomenal.",
      "total_reactions": 0,
      "user": "HeidiK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "I was disappointed with the character roles in this movie. Luhrmann makes it seem like the men work to make money to support the women, and the women are happy to be the men's arm candy. The female characters are predominately dominated by the male characters and both sides seem to be content with their roles. This was pathetic in my opinion.",
      "total_reactions": 0,
      "user": "AmeliaCrave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "**** the critics, **** the negative comments! this one of the BEST movies LEO has EVER done!!! if i could i would watch this movie a thousand times a day! the music, the lights, the scenery everything was so spot on!!! i read the book and i can say that a movie finally does a book justice",
      "total_reactions": 0,
      "user": "simonerodriguez"
    }
  ],
  "metascore": 55,
  "name": "The Great Gatsby",
  "num_weekends": 15,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 10,
    "month": 5,
    "year": 2013
  },
  "opening_weekend_income": 50085184,
  "opening_weekend_income_currency": "$",
  "rating": 7.3,
  "rating_count": 379896,
  "rating_freq": {
    "1": 4119,
    "10": 47829,
    "2": 2496,
    "3": 4186,
    "4": 8354,
    "5": 19910,
    "6": 48178,
    "7": 96772,
    "8": 97898,
    "9": 50154
  },
  "release_day": 10,
  "release_month": "May",
  "release_year": 2013,
  "user_review_count": 772,
  "votes_per_demo": {
    "aged_18-29": 173473,
    "aged_30-44": 100036,
    "aged_45+": 17726,
    "aged_under_18": 1436,
    "females": 90725,
    "females_aged_18-29": 55826,
    "females_aged_30-44": 22807,
    "females_aged_45+": 4109,
    "females_under_18": 618,
    "imdb_staff": 28,
    "imdb_users": 379896,
    "males": 221118,
    "males_aged_18-29": 115819,
    "males_aged_30-44": 75789,
    "males_aged_45+": 13292,
    "males_under_18": 803,
    "non-us_users": 173042,
    "top_1000_voters": 585,
    "us_users": 46947
  },
  "year": 2013
}