{
  "avg_rating_per_demo": {
    "aged_18-29": 5.9,
    "aged_30-44": 5.5,
    "aged_45+": 5.2,
    "aged_under_18": 7.0,
    "females": 5.5,
    "females_aged_18-29": 5.8,
    "females_aged_30-44": 5.5,
    "females_aged_45+": 5.0,
    "females_under_18": 6.0,
    "imdb_users": 5.5,
    "males": 5.5,
    "males_aged_18-29": 5.9,
    "males_aged_30-44": 5.5,
    "males_aged_45+": 5.2,
    "males_under_18": 8.0,
    "non-us_users": 5.5,
    "top_1000_voters": 5.1,
    "us_users": 5.5
  },
  "avg_screens": 7.625,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 12,
    "year": 2012
  },
  "critic_review_count": 107,
  "duration": 113,
  "genres": [
    "thriller"
  ],
  "gross_income": 128519,
  "max_screens": 13,
  "mc_avg_user_score": 5.4,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "The Loneliest Planet",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 7,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "The film feels as beautifully calibrated as a great piece of short fiction, only with visual accents and emphases filling in for the prose. It's a relationship movie where the most important exchanges remain unspoken."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "One of the year's most original and emotionally profound movies masquerades as the tiny story of a young couple who take a backpacking trip in the Caucasus Mountains the summer before their wedding."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 95,
      "summary": "One of the finest of the year, The Loneliest Planet is based on a short story by Tom Bissell that's itself inspired by a famous Hemingway work, \"The Short Happy Life of Francis Macomber.\""
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 91,
      "summary": "Suspense is rarely delivered with such distinctive patience."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "The movie captures a kind of tragedy of self."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "The Loneliest Planet is not a perfect work of art, but it gets at something powerful: the way that life can turn us around in a flash, without warning."
    },
    {
      "critic": "Erik McClanahan",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "Bernal continues to put in one good performance after another, and his turn here is no exception."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Bernal and Furstenberg exist within this meditative space with all the ease and unease of a couple still trying each other on for size. The forces that push and pull them feel so rooted in reality that if not for the layers of meaning it might seem a complete improvisation."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Blink your eyes and you've lost track of them, but one of the interesting things about the experience is that you don't want to lose track; though the film moves as slowly as its hikers, it demands, and deserves, to be watched closely. (The cinematographer was Inti Briones.)"
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Adjust to the deliberate rhythms of this hiking movie-set on the lush slopes of Georgia's Caucasus Mountains - and the psychological payoff stings like a blister."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The languid, observational style of director Julia Loktev will frustrate those expecting stuff to, like, happen more, but it has its real rewards."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "It is gripping and haunting, but also coy and elusive."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "The story is carefully constructed, with moments that seem offhand initially, but are later revealed as crucial."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "Julia Loktev's marvelous, slow-burning follow-up to her minimalist thriller \"Day Night Day Night\" somehow manages to be both audacious and subtle."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Much of the film's final act is given to alienated walking, which too often plays as an abstract study of triangular arrangements in which non-speaking figures move across a barren terrain."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Writer-director Julia Loktev sustains the tension for long, Antonioni-esque passages that portend something momentous. The film delivers in unexpected ways, and then ponders what it means."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "There's no getting around it. Though it's not without virtues, The Loneliest Planet may try the patience of even the most dedicated lovers of art film."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "All of this grows tiresome. We're given no particular reason at the outset of The Loneliest Planet to care about these people, our interest doesn't grow along the way, the landscape grows repetitive, the director's approach is aggressively minimalist, and if you ask me, this romance was not made in heaven."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Gorgeous surroundings don't make up for sulky, feuding travel companions."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "The Loneliest Planet is a colossal bore that doesn't offer any real payoff of any sort.  Yes, the scenery is nice and the film goes to great lengths to accurately depict the ways in which people are unable of communicating with one another, but the bottom line is that this movie doesn't have very much to say and yet it takes an extremely long time to do so.",
      "total_reactions": 3,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "Please, if I can save you the nearly 2 hours this film takes to make its point, your time won't be wasted like mine.  This is a movie based on a short story by Tom Bissell; the movie might have been interesting itself as a short.  However it drags on for nearly 2 hours, during which time there are literally only a couple of minutes of important scenes.  The rest of the time is devoted to trying to set the mood of the relationship between the characters (which could have been done in minutes, not hours)...which unfortunately fails to be interesting or believable.",
      "total_reactions": 2,
      "user": "iiigoiii"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "The movie is boring, then unrealistic,  then all out stupid mixed with repugnant.  I cant believe the favorable reviews this garbage got.  I had to make an account just to post this.  Essentially the couple is not relatable or realistic.  Its sort of sexist against men.  Most people take it for granted how men are expected to instinctually react,  but thats really female chauvinism.",
      "total_reactions": 1,
      "user": "Terikan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "One of the most original odd movies that are interesting. Most of the movie is a wordless mature movie that is emotional and physical at the same time",
      "total_reactions": 1,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "An absolutely beautifully-shot film.  I would be shocked if a not-insignificant percentage of people who see this film didn't plan a trip to Georgia to make this hike.  Truly extraordinary.  However, very little happens in this film.  And that's certainly ok.  Sometimes you just have to let art flow by you.   No need to be super analytical here.  There are essentially two moments of drama to the film, followed by some weighty emotional repercussions, and that's it!  But hey, I felt like i was there, it made me think of my boy scout backpacking days, and in that sense, I enjoyed it.  But a great film scoring at or near perfect scores from some of these critics?  No.  I will say that it's better than another critically acclaimed film with the same pacing - Meek's Cutoff.  That sucker bored me to tears.  This movie is not boring - it just rolls at a meticulous pace, as if you're walking with the trio through a very beautiful museum.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "The Loneliest Planet is worth seeing for the scenery alone!  This is a marvelous movie to watch while you are doing the dishes or cooking a meal, or while doing two sets of dishes and cooking two meals.  There is a bit of nudity at the beginning and some groping and moaning scattered through the rest of the movie, but the movie was much more interesting for the landscape than for the acting or the plot.",
      "total_reactions": 0,
      "user": "metamom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 3,
      "text": "If you removed the plot and characters from this movie, I would've given it a significantly higher rating. It starts out alright plotwise. We see the main two characters interacting with each other and the locals, and while nothing gripping happens, we get the point. One climactic event in the whole story was mildly interesting and a little funny, but nothing interesting happens as a result of it. The resolution takes forever to get to and is fairly ridiculous, yet predictable. The movie gives the viewer no reason to care about any of the characters. I gave it any points at all because the scenery is beautiful. The Georgian landscape fills the screen and we're treated to some amazing, stunning shots. If the entire movie was just shots of the landscape it would've been great, but the two main characters managed to be at once obnoxious and pathetic. They made a visually stunning homage to Georgian geography into a boring and drawn out story about a couple of petty tourists.",
      "total_reactions": 0,
      "user": "Cxpn89"
    }
  ],
  "metascore": 76,
  "name": "The Loneliest Planet",
  "num_weekends": 8,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 26,
    "month": 10,
    "year": 2012
  },
  "opening_weekend_income": 15689,
  "opening_weekend_income_currency": "$",
  "rating": 5.5,
  "rating_count": 3281,
  "rating_freq": {
    "1": 265,
    "10": 168,
    "2": 184,
    "3": 243,
    "4": 322,
    "5": 487,
    "6": 582,
    "7": 526,
    "8": 360,
    "9": 144
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 41,
  "votes_per_demo": {
    "aged_18-29": 791,
    "aged_30-44": 1510,
    "aged_45+": 563,
    "aged_under_18": 2,
    "females": 762,
    "females_aged_18-29": 258,
    "females_aged_30-44": 354,
    "females_aged_45+": 112,
    "females_under_18": 1,
    "imdb_users": 3281,
    "males": 2164,
    "males_aged_18-29": 521,
    "males_aged_30-44": 1132,
    "males_aged_45+": 444,
    "males_under_18": 1,
    "non-us_users": 1662,
    "top_1000_voters": 89,
    "us_users": 867
  },
  "year": 2011
}