{
  "avg_rating_per_demo": {
    "aged_18-29": 6.7,
    "aged_30-44": 6.1,
    "aged_45+": 5.9,
    "aged_under_18": 5.7,
    "females": 6.4,
    "females_aged_18-29": 6.6,
    "females_aged_30-44": 6.1,
    "females_aged_45+": 6.6,
    "females_under_18": 6.0,
    "imdb_staff": 5.0,
    "imdb_users": 6.2,
    "males": 6.2,
    "males_aged_18-29": 6.7,
    "males_aged_30-44": 6.0,
    "males_aged_45+": 5.7,
    "males_under_18": 5.0,
    "non-us_users": 6.2,
    "top_1000_voters": 5.2,
    "us_users": 6.3
  },
  "avg_screens": 17.6,
  "budget": 1000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 9,
    "month": 12,
    "year": 2011
  },
  "critic_review_count": 162,
  "duration": 91,
  "genres": [
    "comedy",
    "drama",
    "romance"
  ],
  "gross_income": 568366,
  "max_screens": 31,
  "mc_avg_user_score": 5.9,
  "mc_metascore": 67,
  "mc_mixed_rating_frequency": 12,
  "mc_movie_name": "The Future",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 91,
      "summary": "As she did in her striking 2005 debut, \"Me and You and Everyone We Know,\" July creates a fluid cinematic universe."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 91,
      "summary": "The Future's main characters are, undeniably, dopes. But July and Linklater turn their ineptitude into a funny running joke, which becomes surprisingly affecting in the second half."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 88,
      "summary": "A meditation on mortality, on loneliness, on the way technology and narcissism have intersected to create a fascinating monster, The Future is all of this and more. What Frank Capra would have made of it, who knows? But he would have liked its star."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 88,
      "summary": "On the surface, this film is an enchanting meditation. At its core is the hard steel of individuality."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 85,
      "summary": "July is more of a presence than an actress, or even a believable persona."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2011
      },
      "score": 83,
      "summary": "As the portrait of a relationship meltdown involving two eccentric creative types prone to self-doubt, July's sophomore feature bears a strong resemblance to husband Mike Mills's upcoming \"Beginners,\" although July's version of the story has a more experimental edge."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "July's second film, while not quite as perfectly realised as her debut, nimbly avoids the 'sophomore slump', providing the curious with another window into her highly idiosyncratic world."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "Some people will find Miranda July's film a poetic triumph, a meditation on responsibility and disappointment. Others will find it hopelessly pretentious, one of those movies only pointy-headed critics can abide. I found the film to be more of the former than the latter. Except when the cat talks."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "The magical, metaphorical strain in The Future is what makes it powerful, unsettling and strange, as well as charming. The everyday fears and frustrations that shadow us on our awkward trip through the life cycle often feel enormous, even cosmic, and Ms. July has the audacity to find images and situations that give form to those metaphysical inklings."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "It can definitely grate on your nerves but, at best, it also gets into your mind, and sticks fast."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "What does The Future hold? Wonders, each of them weirder and more unnerving than the last."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Halfway into this film, I wanted to smack the mopey bohemian couple played by July and Hamish Linklater; by the end, I realized the director was smacking them for me, and hard. In a case of biting the hand that feeds her, July has made possibly the worst date movie ever for trendy modern couples - a work that traps a pair of passive-aggressive hipsters in a drift of their own making."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "This sense of unruly behavior is mitigated, deliberately, by the gentleness and odd comic grace of July's presence and voice."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "This is worth seeing, but only if you think you can tolerate the precious voice-over narration from the couple's wounded cat, delivered by July in a high, scratchy voice."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "The movie, which Miranda July wrote and directed, is pretty sharp, not to say acidic, on the silliness of good intentions, but she also takes care to slant the best lines toward the subject of time, and its terrible crawl."
    },
    {
      "critic": "Ray Greene",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "July has mounted a surrealist fable about the delicate balance between relationships and the inner monologue inside each lover, with its incessant demands and individual needs. Unevenness is an aesthetic here - not so much a flaw as a conscious choice."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 67,
      "summary": "July, like Hal Hartley, another overrated art-house luminary, is an acquired taste I have yet to acquire."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "July is a provocative and honorably independent filmmaker, but given the meager rewards of investing our time, The Future wasn't worth the wait."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 63,
      "summary": "The omnipresence of oddity in The Future dilutes its charm: A T-shirt creeps around on its own, a little girl likes being buried neck-deep in the backyard. Whatevs."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "The mood of this movie will brew with you for a while, even if it swirls around characters who aren't quite persuasive."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "This could be the premise of a zany comedy, but the mood of The Future is, from the outset, defeatist - annoyingly defeatist, to be frank."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "For all the superficial hilarity of July's approach, a much sadder streak runs deep through the entire film, reinforced by Jon Brion's score (more tones than melody). Still, it's curious that this is the feeling she chooses to leave us with in the end."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 58,
      "summary": "The art of Miranda July, the former Portlander and hyphenate extraordinaire, balances on the edge of the cunning and the precious, of depth and naivety, of the fetching and (sorry) the revolting."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "July also narrates the film, in voiceover, as the cat, and every time she does, it's a white-knuckle thing. You have to hold on until she stops."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Sophie's (or is it July's?) coy narcissism becomes a criticism of itself, and her \"sadness\" turns into something truly sad. In short, I have seen The Future and it's heartbreaking."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 40,
      "summary": "As an unsparing portrait of disaffection among the small-paycheck, faux-creative class, The Future is rather astute … which isn't to say it isn't also bang-your-head-on-the-wall annoying."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 40,
      "summary": "Sometimes these characters say things worth hearing. But too often, and in contrast to her first feature, \"Me and You and Everyone We Know,\" July's calculated delivery doesn't reveal the profundity required to elevate it beyond a self-conscious deadpan."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 38,
      "summary": "Of all the vaguely philosophical, calculatedly left-of-center dialogue that peppers Miranda July's The Future, no line is more telling than the writer/director/star's late-film declaration, in the guise of her character Sophie, that \"I'm saying okay to nothing.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Any audience member who has seen a previous Miranda July film knows what they are in for if they go to another one.  July loves silly and awkward conversations which spring out of thin air and make her characters seem quirky.  If you love quirky and oddball then Miranda July is the filmmaker for you.  However, July is one of those filmmakers who do not have much a gray area when it comes to reactions.  Movie goers either love her or cannot stand her.  Julyâ",
      "total_reactions": 1,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "I liked 'You and Me' (prior film) pretty well, the kids were likable. This film starts out great and quietly warm and quirky and then derails into a sad, sad tale of adult characters who are doing nothing much except act badly in the face of a made-up deadline. The original idea started out quite funny, how could this thing have gone so wrong and needlessly humorless? This writer has obviously found quite a sympathetic audience since the user ratings here are high for a film that mainstream viewers will almost certainly abandon before it's finished. I am usually a fan of slow, quirky, indie films, but there has to be someone in there to like! I'll give it a 3 for an original opening premise and I like the actors, but otherwise, there is no there there.",
      "total_reactions": 1,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "A breathtaking and unbelievably innovating movie, truly some of the most creative and original storylines of modern cinema. Very philosophical, it will make you drop all of your ideas to the floor and rise them back up to the roof. All of this around an adorable love story that will make yourself question what love truly is. Inspires deep reflection and very mind blowing, a movie that will leave you thinking for days. Alongside with a very detailed artistic production, a story to remember.",
      "total_reactions": 1,
      "user": "AoKuroiRaccoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Most everyone seeing this movie in my theater (except me) was laughing at the movie. Not with it - AT it.  I was too bored to laugh.  Sure, it's a little cute, but it's a massive waste of time. There are better films to see.  Go pay money for them.  Even July's last film was far superior to, and more thought-provoking than, this one. I\"m a little surprised that the critics were so intrigued by this film.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I love Miranda July and her work (after falling in love with You and Me and Everyone We Know), and was nervous going into her second film with such high expectations.  About three quarters of the way through the film I was delightfully enchanted by the film's quirkiness and turns of plot, but I figured I knew where it was going.  And then the movie took a marvelous unexpected leap, and it took my breath away.  If you are expecting a film that will give you the story line, this is not the one.  But if you want an unconventional look at a generation of adults coming of age in an unconventional way, this is definitely for you.  And while I love Miranda July, Hamish Linklater really steals this film.  At that moment I was talking about, he takes the film to a whole new level.  It was beautiful.",
      "total_reactions": 1,
      "user": "SusanS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "What an awful flim. The most sympathetic character was by far the cat. I grew so tired of looking at Miranda July in her miniskirts in just about each and every scene. Any viewer with half a brain knew she was hopelessly insecure did we really need to watch her gracelessly flail about in her tights over and over again. The only redeeming factor in this film was the score and the soundtrack very good, rest of the fllm very bad.",
      "total_reactions": 0,
      "user": "frani"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Was this as good as her first? No. It would have been almost impossible to be better than her debut, which was one of the best movies of the last decade. This is a spectacular film though, and the writing is superb. I thought it was so intriguing, and beautiful, and I really appreciated the bits of surrealism that were there. This is like a cinematic/visual poem, (which is also what her debut was), so I understand its not being for everyone. I found it pretty remarkable though. Miranda July is very possibly my favorite modern filmmaker.",
      "total_reactions": 0,
      "user": "jeremologyy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "This is one unusual film. I stayed with it, was a little tossed about, lost my sense of time, and was a little confused. It's made up of  documentary, reality, fantasy, science fiction, performance art. I very much was enthralled by Ms July and Mr Linklater and had to see where they were going. I had much distaste for Mr Warshofsky's character but perhaps i was supposed to. At first I thought I might just fast forward just to see what happens. But the characters moved me. I'm not sure how I really feel only watching it once, but I think it's worth a screening so it receives my lowest recommended rating B-, a 6 here.",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "I don't exactly know how to review this because I'm still thinking about the movie and what everything means! I haven't been watching as many movies as I used to but damn this has to be one of the weirdest movies of the past few years. The first half has kind of boring dialogue that sorta seem to drag one but, in my opinion, this movie makes up for it in just a 5 minute part or so.  I don't want to ruin anything but the part when he actually stops time, that affected me more than anything else in this movie. Overall super strange and I'm not sure why some of the things happened in the movie but it was definitely interesting to say the least.",
      "total_reactions": 0,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "maybe i had really high expectations for it, but i kind of felt let down. i think the only character that i actually liked was the cat, and all the other jerk characters screwed that up too. it could have been a lot worse, and really i thought the first 20-30 minutes were great, but from there it was a slippery slope down.",
      "total_reactions": 0,
      "user": "remm-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I spent the whole of this film waiting for this dopey couple to adopt the cat.  I felt upset and angry when the cat was euthanised.  I strongly feel that the whole issue of cats in shelters in America (and lets face it its a huge issue) was completely trivialised.  I mean what was the point?  Why would a director focus so much on the wait that this cat had?  The same wait that thousands of cats have every day.  Quite frankly I was sickened by this film.",
      "total_reactions": 0,
      "user": "Ratters"
    }
  ],
  "metascore": 67,
  "name": "The Future",
  "num_weekends": 15,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 29,
    "month": 7,
    "year": 2011
  },
  "opening_weekend_income": 27137,
  "opening_weekend_income_currency": "$",
  "rating": 6.2,
  "rating_count": 7116,
  "rating_freq": {
    "1": 338,
    "10": 426,
    "2": 232,
    "3": 284,
    "4": 481,
    "5": 811,
    "6": 1267,
    "7": 1529,
    "8": 1261,
    "9": 487
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 63,
  "votes_per_demo": {
    "aged_18-29": 2002,
    "aged_30-44": 3267,
    "aged_45+": 1115,
    "aged_under_18": 3,
    "females": 1838,
    "females_aged_18-29": 748,
    "females_aged_30-44": 799,
    "females_aged_45+": 244,
    "females_under_18": 2,
    "imdb_staff": 1,
    "imdb_users": 7116,
    "males": 4606,
    "males_aged_18-29": 1227,
    "males_aged_30-44": 2430,
    "males_aged_45+": 858,
    "males_under_18": 1,
    "non-us_users": 3866,
    "top_1000_voters": 146,
    "us_users": 1860
  },
  "year": 2011
}