{
  "avg_rating_per_demo": {
    "aged_18-29": 4.9,
    "aged_30-44": 4.8,
    "aged_45+": 5.2,
    "aged_under_18": 5.2,
    "females": 5.1,
    "females_aged_18-29": 5.1,
    "females_aged_30-44": 5.0,
    "females_aged_45+": 5.5,
    "females_under_18": 5.1,
    "imdb_staff": 5.0,
    "imdb_users": 4.9,
    "males": 4.9,
    "males_aged_18-29": 4.9,
    "males_aged_30-44": 4.8,
    "males_aged_45+": 5.2,
    "males_under_18": 5.3,
    "non-us_users": 4.8,
    "top_1000_voters": 4.7,
    "us_users": 5.0
  },
  "avg_screens": 864.8,
  "budget": 30000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 24,
    "month": 2,
    "year": 2012
  },
  "critic_review_count": 194,
  "duration": 89,
  "genres": [
    "action",
    "adventure",
    "horror"
  ],
  "gross_income": 21426805,
  "max_screens": 2327,
  "mc_avg_user_score": 5.2,
  "mc_metascore": 16,
  "mc_mixed_rating_frequency": 50,
  "mc_movie_name": "The Darkest Hour",
  "mc_negative_rating_frequency": 61,
  "mc_positive_rating_frequency": 57,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "The Darkest Hour turns out to be a modestly inventive and involving variation on a standard-issue sci-fi doomsday scenario."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 40,
      "summary": "Capable and compelling performers like Hirsch and Thirlby seem left to their own devices to make some connection with the material. The idea of semi-invisible aliens, an unseen enemy, should mean the film has a lingering sense of paranoid abstraction (not unlike \"Right at Your Door\"), but Darkest Hour never gets beyond rote efficiency."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 33,
      "summary": "You should be rooting for the humans, but you might as well be rooting for the blobs. Most likely, though, you'll just be rooting for the credits."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 30,
      "summary": "An alien invasion flick that evidently expects dramatic shots of a depopulated Red Square to make up for a flatlining screenplay and the absence of even a single compelling character."
    },
    {
      "critic": "Joel Brown",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 25,
      "summary": "Once upon a time, you'd go to see a grade-C genre movie like this willing to trade consistency and artfulness for a few stray thrills or oddball charm. But Darkest Hour doesn't have even as much character as those Discover commercials."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 20,
      "summary": "This is exactly the sort of film I wasn't expecting from either Gorak or his producers. In many too-obvious ways this is just a formulaic riff on Spielberg's \"War of the Worlds.\""
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 20,
      "summary": "Really, how slovenly is it to use invisible aliens? If you're going to tease us with nothing but pinwheels of light for three-quarters of the film, you'd better have one heck of a reveal up your sleeve."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "summary": "The Darkest Hour isn't just a dark horse contender for the year's biggest joke, it's the darkest."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "summary": "Not since Mark Wahlberg trembled in fear beside a menacing houseplant in \"The Happening\" has a film tried to provoke terror with such an unlikely object of menace."
    },
    {
      "critic": "Budd Wilkins",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "summary": "In a year-end season stacked deep with worthwhile films, what possible incentive could there be for submitting to The Darkest Hour's utter pointlessness?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Acting universally on the \"new actor\" side of the scale...even the dog was no Rin Tin Tin... Think somewhere between Nick Jr. And ABC Family.  I went with really low expectations invoking my motto that \"bad sci-fi is better than no sci-fi\" As a result? It was a solid 4.5.  And I saw it in 3D ...if you can release your inner MST3K? You'll enjoy it more.  Otherwise the darkest hour will be last 60 minutes of the film.",
      "total_reactions": 3,
      "user": "hollyv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "I went to see this film with some friends and we all agreed that this film was AWFUL! Bad acting, pathetic speeches and a just awful storyline. Some giant blobs just appear in the sky kill everyone one by one and tge two main characters fall in love which is all too predictable! Stupid and rubbish! Never again!",
      "total_reactions": 3,
      "user": "hollyvictoria19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Stupid movie with stupid setting with stupid characters and stupid story. As you can tell I did not like the movie AT all the only reason why I gave it a 3 is for the special effects and the design in the alien creature I sought of liked it. Nothing really happens in the film basically they're just running away, running away, running away nothing really answered thats just about it",
      "total_reactions": 1,
      "user": "LordOFlibertY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "The Darkest Hour is pure sci-fi crap. I like the trailer more often than the movie itself because I don't even care about alien movies anymore. I just always watch Independence Day and Mars Attacks! I like Emile Hirsch when he was Speed Racer, but the characters from The Darkest Hour is more stupider than Jack and Jill was and they don't even know what they say. The action of the movie is wasted too much time in about a minute or so and the script is a mess. Who needs Battle Los Angeles when you need 'em? Forget about renting on DVD or crappy 3-D versions, this is an absurd title with a made-for-TV monologue. \"The Darkest Hour\" is pretty dark and pretty damn boring. One of the worst movies of the year. They had their hour, but when the lights are out, it's game over!",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "The movie was fake. I didn't like the ending and I didn't like how it was moving so fast. There is no way the rest of the world would have tons of surviors if Moscow was totally wiped out for the most part. I should have seen Devil Inside.",
      "total_reactions": 1,
      "user": "movielovey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "I thought the movie was awesome but it isn't. Good visual effect doesn't make up for a crappy storyline. This movie is one of the worst movie I've watched.",
      "total_reactions": 1,
      "user": "sirky004"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "\"The Darkest Hour\" (2011) is a horror and science fiction movie about",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "The film is really terrible, awful, stupid, we watching much times the alien movies, the only different is that they take Rusia, and is the only different. Cast, story, all in The Darkest Hour is horrible. Awful movie.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "It could have been better. But a more developed character and storyline would have made this a good movie. This movie has decent special effects, and a some Russian freedom fighters, which was pretty awesome :P",
      "total_reactions": 1,
      "user": "ChronoJase"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "The plot: aliens invade, everybody dies, some survive and find way to fight back, the end. So not much story there, it is 'explained' very shortly why the aliens are there but it's one of the classic reasons so not much creativity in the plot. The 'novelty' here is that the aliens are invisible (a bit like those in Final Fantasy - Spirits Within) but power up electric stuff as they pass it (lamps, cars, cellphones,...) so our heros have to move by night instead of day (inverse of zombie flicks). If the aliens kill someone they evaporate to dust (like in War of the Worlds) and the night look of the film reminds me somewhat of Cloverfield. So they stole from a lot of other good movies but it's not nearly as good as any of them. Some of the heros die, but you won't care much coz the acting isn't great. The VFX are okay for it's budget but we've all seen better. With all that said, it's not as bad a movie as you would think. If found it enjoyable as light entertainment so if you set your expectations low enough you can give your brain 90 mins of braindead fun.",
      "total_reactions": 1,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "An alien movie with good special effects.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "I would rate this film one star and that would be generous. The characters were one dimensional and you knew who was going to get killed a mile off. The special effects were on the level of a made-for-TV-movie on the sci-fi channel. The 3D was needless because there was nothing enhanced since the special effects and the aliens were practically non-existent. I would advise to save your money and time and stay home and watch a good sci-fi dvd. This movie would have appealed to children from 10-15 years old, with absolutely no knowledge of what constituents a good movie experience, plot or special effects. When it was finally over, I wished that I could have gotten my time and/or money back.",
      "total_reactions": 6,
      "user": "pogodog7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "This movie was pretty darn awful. There never really seems like any point in the movie where there is any sort of legitimate drive beyond \"lets go this way\". And even then, they rarely answer the question \"why\". \"let's go this way, because this that and the other\"... and why does that matter? And beyond that, it didn't even spend that time developing any of the 5-6 main characters more than \"I have a family somewhere else in the world who I'm wondering if survived!\" and, about the special effects stuff, the only thing it really had to offer, were some cool death scenes, and one or two cool landscapes (the one involving the airplane was rather cool). Everything else was either dull or silly looking... If you are absolutely dying to see this movie, wait until it's on Netflix so the only thing you're wasting is the hour and a half spent watching the movie. :P",
      "total_reactions": 15,
      "user": "Neefu"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Before you freak out and judge my review by the number, relax, i know this movie was terrible, but you have to realize, the makers of this movie definitely weren't going for oscar material. The acting was laughable and there was one cheesy speech after another, but my dad and i watch the primetime scifi channel movies every saturday night, so we have experience with these movies, and we love them. I really enjoyed this movie because i went into it with the right mindset. Expect it to be terrible and still give it a slight chance and you won't be disappointed. They definitely did the whole invisible alien concept really well, and the special effects were pretty nice at times, but as always with a cheesy scifi flick, like i said before the acting was a complete joke, but i enjoyed this movie. If you go into the theater expecting a really good alien invasion film with suspense and terror and a solid cast, then don't bother, but if you enjoy a laughable and cheesy film, then this is a must-see, i enjoyed myself. 6.5/10",
      "total_reactions": 18,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "This movie borrows heavily from a Russian science fiction story story called a Roadside Picnic, not very well known in the west but it's pretty much a force in Russian storytelling equal to America's Lord of the Rings or Star Wars. This translates into a movie that might just be different and strange enough to keep westerners engaged even though the movie has some pretty weak parts. Character development does'nt always make sense, there were a few people that seemed interesting and worthwhile at the beginning that just lose all speaking lines at a certain point and simply hang around making stupid decisions until the inevitable death. The unmasked aliens look pretty ridiculous.",
      "total_reactions": 9,
      "user": "Gene"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Its not extremely bad like everybody says. Its just an okay scary film that makes good use of the few ideas it has. Nothing special here, but slightly entertaining.",
      "total_reactions": 2,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "The Darkest Hour is the story of five young people who find themselves stranded in Moscow, fighting to survive in the wake of a devastating alien attack. The 3D thriller highlights the classic beauty of Moscow alongside mind-blowing special effects.",
      "total_reactions": 2,
      "user": "allmovies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "not bad but arent there any proper ending??==",
      "total_reactions": 2,
      "user": "secretcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "I've only one advice. Don't watch this movie. Terrible script , acting & story line. I don't know why I spent 10 bucks on this movie in the cinema. Although I had a feeling that this movie will suck, I didn't know that it will be THIS bad. It's so bad I want to cry.",
      "total_reactions": 2,
      "user": "jzme"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "This movie is powered by decent special effects, terrible acting, no character development, and the stupidest storyline ever. Oscar or Not? DO I EVEN NEED TO ASK THAT QUESTION!!!???",
      "total_reactions": 7,
      "user": "OscarOrNot"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "Really, invisible aliens? never before have I seen such a stupid attempt a t an action movie. Very disappointed. Check my profile for the most updated movie reviews.",
      "total_reactions": 7,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "**** you darkest hour... **** you... this movie was awful,, characters are boring, try's to be dramatic but lacks everything it needs to make it work. the aliens look awful.",
      "total_reactions": 5,
      "user": "Pivot1022"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "I saw the previews for this might go and see it at the movies depends what else is on or might just wait it for dvd...I have to say this all I could think of after seeing this preview was final fantasy spirits within invisible enemies, cities wiped to the ground, people being vaporised if been killed but the aliens..",
      "total_reactions": 3,
      "user": "wulfenstein"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Very good in concept. Poorly executed. I'm putting a 10 to balance the score. It wasn't AWFUL. At the same time, it wasn't AWESOME. There was definitely room for improvement.",
      "total_reactions": 6,
      "user": "GenuineOpinion"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I do not know about that one here but I put 10 for an alien invasion to Russia .. there is certainly something to work, but Bekmambetov ... and other producers and directors will come with time. And alien beings under an electric field rather amusing. And the whole movie as a movie. I liked .. and do not regret it one little bit that I went to watch it and then by mistake:) He planned to watch Mission Impossible-4 \"Phantom of the Protocol\" and simply got on Phantom: DD",
      "total_reactions": 1,
      "user": "Nickmen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "I saw this film with my partner tonight, and I just couldn't understand the concept. If the aliens seriously used electrical powers to \"microwave\" people, as they put it.. Why on EARTH didn't they just have full rubber suits on and just walked through it. Completely stupid film, acting was terrible.. Got to the point that you couldn't even understand their voices by the end! Muttering, staggering even sometimes, the ending itself was just bad. This'll be the best film, when drunk.",
      "total_reactions": 1,
      "user": "Balthamos"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "me and my mate went to see this instead of a biology lesson at College so compared to that it's great!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "HIH"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "That movie has the perfect title The Darkest,so dark that is impossible to be seeing.Acting performances are lame,cast is even worse than any other,visual effects saves the day,but that's not enough for this movie it's a totally waste of money and time, i'd rather watch Saw",
      "total_reactions": 2,
      "user": "Mr-K05"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Yes, it's cheesy as all hell, but, lets face it, it is one of the better sci-fi flicks of 2011, it's actually quite inventive without just plagiarizing familiar sci-fi conventions, (skyline, anyone?), and it is a lot of fun to watch... don't trust the critics on this one...",
      "total_reactions": 1,
      "user": "CuriousStranger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Cool movie.",
      "total_reactions": 1,
      "user": "oswaldferrera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "I liked the idea behind this movie, and did try to be a little different at first. But, like most movies of its kind, it falls into a generic plot outcome that meant to entertain the lowest common denominator. Acting is OK, and the effects (when you could see them) were decent, however invisible aliens did feel a little bit of cheap way out. Had they replaced the aliens with ghosts, it wouldn't have made no difference.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "I saw the trailors for this when it came to DVD and thought \"well this looks like a fun movie\" well boy was i wrong . The plot is dumb , the pacing is slugish , the acting is sub par , the special effects are ok . It feels like a Micheal Bay Film but with a twist of Lame , Dull , and pointless just it make i suck alittle bit more then a Bay film should . If you want to see a film with people fighting aliens in it see james camrons Aliens flick. Avoid this smelly turd at all cost.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "The Darkest Hour is a science-fiction film starring Emilie Hirsch, Olivia Thirlby, Max Minghella, Rachael Taylor, and Joel Kinnaman as five people who are fighting off a species of aliens who attack them while in Moscow. And, I know you're thinking that this sounds kind of dumb and unoriginal. Well, what were you expecting? There were many missed opportunities with The Darkest Hour. Not only was this venture unsuccessful, but it's also uninteresting, and has some pretty awful acting.",
      "total_reactions": 0,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "I am giving this movie a10, just to Balance the score out. It was a good movie . Rating movies doesnt make sense at all. To Film up the space i also add that Emile Hirsch is really Hot.",
      "total_reactions": 0,
      "user": "madmad90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed this movie. It wasn't what I would call a \"good\" movie by any stretch of the imagination, but it was entertaining. The acting was on the low side of mediocre, but I wasn't going to see this movie for good acting, I was going to see a movie about an alien invasion. I thought it was in interesting twist that humans couldn't really see the aliens and some of the action scenes that this results in were actually pretty cool. All that being said, I wouldn't ignore the critic ratings. If you're looking for an entertaining, relatively unusual alien invasion flick then I would certainly give this movie a shot.  But what do I know, I liked \"Dinner for Schmucks\"",
      "total_reactions": 0,
      "user": "KUJOtheSLOTHMAN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Despite what the critics say, this isn't a bad film. In fact, it's pretty good. But what I must point out is the length of film is always important to note - I felt it was too short to hold my attention. I wanted to know more. As it was quite short, it is also useful to illustrate the pacing, as it realised it had to skip certain areas, rushing in order to make the 85-90 minute time limit. The beginning normally needs to either fill us in properly on background detail or give us time to develop it during the disaster. Although this did happen throughout the film, we did get a little background detail of some of the main characters. What made this film not sink into bad territory was the continued update of the journey to escape from the electric creatures, which I thought were awesome. It was quite courageous to use them as the mainspring in this film, as it was obvious in this situation that it was a devastating attack. It was amazing to see the characters start to rely on each other in such dire need and that rescue came when it was most needed.",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Poor movie, poor acting, this movie is just terrible, bad effects, everything is wrong and messed up in this movie, now I notice that I waste my time watching this movie.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "After seeing this film, I've decided that I don't like Timur Bekmabetov that much (who is acting as Producer here).  The Russian wunderkind may be the best in his home country, but his films so far, to put it lightly, feels second rate.    The critics seemed to like him so much, heaping praise for his 'innovation'.  However, his higher budgeted pictures felt amateurish at best.  The Darkest Hour started pretty good, but felt so unsatisfying and derivative of every Alien invasion film that you felt cheated in the end.   If you want an Indie genre director that really delivers, wait for Neil Blonkamp's (District 9's) next features.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was way better than I thought it would be going in. The idea alone is fairly unique and the plot plays out in a not-so-cliche fashion. Also, the cast is outstanding. Emile Hirsch is one of the most underrated young actors in all of Hollywood and Olivia Thirlby holds her own. And I'm a huge fan of Rachael Taylor. I hope she gets more and more chances to shine because she could be the next Cameron Diaz. She was great in the short-lived remake of Charlie's Angels and I see she's going to have a new show on TV this fall. As for the actual aliens, I actually really liked the concept used in this film. It wasn't the same old regurgitated idea from every other alien-invasion film before it. It uses a refreshing idea that creates an enemy that rivals any in terms of hopelessness. There were some plot holes and some aspects that were because of low-budget issues but overall, this film was very good and doesn't deserve the shortsighted criticisms many people have given it.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Not nearly as bad as the critics make out, this sci-fi fluff is actually quite entertaining, if more than a little outlandish.  The Moscow setting adds welcome change to aliens always attacking America and Emile Hirsch carries things as well as he can, but he is no leading man.  Director Chirs Gorak instills some flourish with the special effects and overall style but 'The Darkest Hour' never transcends unintentional B-movie territory.",
      "total_reactions": 0,
      "user": "neoncritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "This movie is pretty damn okay, but disappointing . I love the plot of why and how they're there. The Russian setting is very original, and interesting. Though the whole plot it's self seems like fan-fiction you'd find on \"Mibba\". But it's interesting in a way. I don't like the choosing of characters they left at the end, it's too ironic.. Long story short, it's a good movie. Nothing you'd mention again after you watch it.",
      "total_reactions": 0,
      "user": "Zonbi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "The Darkest Hour is a bad film: besides decent visuals, the film does not really have anything else to offer, apart from plenty of unintentionally hilarious moments that make the film a joy to watch.",
      "total_reactions": 0,
      "user": "BBonasera15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "At first I thought this was a pretty good movie with some great special effects and I thought it would have a really in depth storyline. After a while though, I noticed the acting wasn't the best and just when I'd gotten over that then the credits started rolling. They came much too soon to the point where you wonder whether the company had a time limit and had just run out. It's not as bad as some people are saying it is, but personally I just couldn't get over the abrupt ending.",
      "total_reactions": 0,
      "user": "Dafster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "Is this a movie or a joke? Definitely has to go in the bottom 10 of movies I've seen. The plot is virtually non-existent. Characters are introduced, developed for 5 min. and then killed. 90 minutes of people running away from invisible forces and in the end there's absolutely no resolution. I don't know how this movie even made it into production...",
      "total_reactions": 0,
      "user": "xtoph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "What a great idea for a film! The concept is the best thing about this movie that covers quite a few genres. Having Moscow as the setting was also something new as I haven't seen many films shot there. The cast is likable as are the young actors playing the characters, lead by Emile Hirsch. It's not flawless and I can kind of see why the critics weren't huge fans of it, but I enjoyed it and thought it was a fresh new idea that was convicted very well! Overall it's well worth a look :)",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2017
      },
      "score": 4,
      "text": "When the electric mist from the sky struck down.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "It has a really good story, but a little bit bad presented, but it is really good, case I like the genre of survival HORROR, overall a really good time, with good 3D!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "The Darkest Hour is a visually ugly, predictable and not even emotionally engaging. It's definitely cliche, with poor characters who fail to be cared. The idea seemed potentially good, but it's poorly executed. Shortly, this movie is terrible. (Final Score: 2.75)",
      "total_reactions": 0,
      "user": "DaEagle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "The film is superior on all levels to the swathe of special effects apocalyptic adventures and the serial aliens in metal suits or green men with odd heads against the US military films. The electric-force aliens had us all guessing. Hooray for a Russian setting, expendable ensemble cast  the aliens are so evil they kill good people and not just baddies (duh), and hooray for a film that does not glorify war or US patriotism. I'm looking at you 'Battleship'. No burrito references in sight either. No tit-fest for 15 year old boys. Clever female protagonists. Inventive and a breath of fresh air in the most tired and cliche ridden of US genres. A low budget film shows how it might be done if LA studios only had a brain. The various online critics have clearly been weaned from their usual dumb-ass fodder. Better than average and far more imaginative and inventive for probably the cost of a Hollywood catering budget for similar alien films.",
      "total_reactions": 0,
      "user": "DarloGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "Promising film with an interesting premise, taxed by an unwanted, unconvincing and uninteresting ending. Some good scifi effects, and it was great that most of the characters died.",
      "total_reactions": 0,
      "user": "xolve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "I had high expectation and the movie turns out to be one lame ass movie.The special effects were good and the story was original but the movie was bad executed and the acting was far from good.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "It's refreshing to see someplace besides Manhattan, Tokyo or L.A. getting the destruction-from-space treatment.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 16,
  "name": "The Darkest Hour",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 23,
    "month": 12,
    "year": 2011
  },
  "opening_weekend_income": 3000000,
  "opening_weekend_income_currency": "$",
  "rating": 4.9,
  "rating_count": 50492,
  "rating_freq": {
    "1": 3198,
    "10": 2312,
    "2": 3110,
    "3": 5211,
    "4": 7804,
    "5": 10743,
    "6": 9533,
    "7": 5358,
    "8": 2317,
    "9": 906
  },
  "release_day": 25,
  "release_month": "December",
  "release_year": 2011,
  "user_review_count": 215,
  "votes_per_demo": {
    "aged_18-29": 16828,
    "aged_30-44": 22221,
    "aged_45+": 5303,
    "aged_under_18": 84,
    "females": 6527,
    "females_aged_18-29": 3075,
    "females_aged_30-44": 2582,
    "females_aged_45+": 593,
    "females_under_18": 14,
    "imdb_staff": 4,
    "imdb_users": 50492,
    "males": 38849,
    "males_aged_18-29": 13575,
    "males_aged_30-44": 19331,
    "males_aged_45+": 4623,
    "males_under_18": 70,
    "non-us_users": 28115,
    "top_1000_voters": 394,
    "us_users": 8007
  },
  "year": 2011
}