{
  "avg_rating_per_demo": {
    "aged_18-29": 6.3,
    "aged_30-44": 6.1,
    "aged_45+": 6.3,
    "aged_under_18": 6.2,
    "females": 6.1,
    "females_aged_18-29": 6.2,
    "females_aged_30-44": 6.1,
    "females_aged_45+": 6.3,
    "females_under_18": 5.9,
    "imdb_staff": 7.0,
    "imdb_users": 6.2,
    "males": 6.2,
    "males_aged_18-29": 6.4,
    "males_aged_30-44": 6.1,
    "males_aged_45+": 6.3,
    "males_under_18": 6.3,
    "non-us_users": 6.2,
    "top_1000_voters": 5.8,
    "us_users": 6.3
  },
  "avg_screens": 6.0,
  "budget": null,
  "budget_currency": null,
  "closing_date": {
    "__type__": "datetime.date",
    "day": 19,
    "month": 12,
    "year": 2014
  },
  "critic_review_count": 196,
  "duration": 96,
  "genres": [
    "romance",
    "thriller"
  ],
  "gross_income": 506067,
  "max_screens": 6,
  "mc_avg_user_score": 6.4,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 18,
  "mc_movie_name": "The Two Faces of January",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 20,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "This is Highsmith, and so things do not go as planned for her protagonists. The Two Faces of January - drop-dead gorgeous to behold - is not a merry tale, but a murderous one. Murderously good."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2014
      },
      "score": 88,
      "summary": "Carefully directed and gorgeous to look at, with haunting performances and maximum suspense."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "There’s a mystery here, some thrills and blood, but mostly there are beautiful people and the kind of human hunger that devours everything and everyone in sight."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "Amini has a powerful acting triumvirate in Mortensen, Dunst and Isaac to help him deal with the capricious nature of this particular tangled web."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 80,
      "summary": "Dunst handles her sidekick role with a mature ease that’s new to her, but it’s the men you remember: Mortensen in psychological freefall and Isaac always tough to read and hiding something behind a handsome, controlled exterior. It’s a gentle and smart blast from the past."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "A superior directorial debut for a smart, literate screenwriter delivers both first-class character drama and edge-of-your-seat suspense."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 80,
      "summary": "Best known as the screenwriter of such subtext-rich adaptations as “The Wings of the Dove” and “Drive,” Amini excels at conveying the subtle, unspoken tensions between characters, selecting a tightrope-risky example with which to make his directorial debut and orchestrating it with aplomb."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 80,
      "summary": "It’s an elegantly pleasurable period thriller, a film of tidy precision and class."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "This is an unusual role for Mortensen, but after you’ve played a thinking woman’s hunk so long and so well, what else is there?"
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "That Hossein Amini, in his first outing as a director, kept all three of these well-known actors in perfect balance suggests a filmmaker who knows how to steer a performance."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "A pleasant entertainment, the term Graham Greene used for his thrillers, but slips away from memory as quickly as a summer evening."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "It’s Mortensen and his smokes that seal the deal. Puffing away, he is dangerously sexy and morally dubious, the latter of which makes perfect sense as we are in Patricia Highsmith territory."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "Mortensen and Isaac, expertly exchanging the faces of loyalty and betrayal, are both outstanding. Is the film too old-school for short attention spans? Maybe. Rest assured that Amini's shuddery endgame is well worth the wait."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "A subtle, underplayed psychological drama with terrific work by all three actors."
    },
    {
      "critic": "Sam Weisberg",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "Mortensen is a pro at the slow burn, and he adds genuinely frightening layers of impulsiveness to this tempest-in-a-teapot scenario. The freshest twist is that each man has a notable advantage over the other."
    },
    {
      "critic": "Deborah Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 70,
      "summary": "On his first trip behind the camera, the British-Iranian Amini shows his skill at working with actors and sensing the way they can fill out literary characters. His screenplay generally feels more naturalistic than Highsmith, the dialogue less spare."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2014
      },
      "score": 67,
      "summary": "January skirts by on its tastefulness and appreciation for the source material, however single-minded. It’s a movie of small pleasures: slow-burn suspense; period flavor, with an emphasis on the textures, clothes, and luggage; an effective score by Pedro Almodovar’s regular composer, Alberto Iglesias."
    },
    {
      "critic": "Tara Karajica",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 67,
      "summary": "Amini's directorial debut is a quiet and graceful achievement that suffers from a number of shortcomings but still works on its own terms."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 63,
      "summary": "A sun-splashed noir that loses its appeal in the last act."
    },
    {
      "critic": "Clayton Dillard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2014
      },
      "score": 63,
      "summary": "Superbly acted and sporadically intriguing thriller, yet it has a difficult time locating more stringent meaning and significance beyond its outward narrative of duplicitous actions and veiled motivations."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "If you wait for the grift, you’ll only be disappointed. There are no jolting twists or shocking reveals. The reward lies mostly in accepting each character on his or her terms."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "For a first-time director, Amini demonstrates considerable skill both with actors and with the camera, giving the film a pungent balance of visual elegance and moral seediness."
    },
    {
      "critic": "Steve Rose",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "There are many attractive parts to this thriller – handsome leads, a meaty Patricia Highsmith plot, Mediterranean sunlight on cream linen suits – but it's no greater than the sum of them."
    },
    {
      "critic": "Philip Kemp",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "Amini’s film offers elegant pleasures and holds the interest – but it never grips as it should."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 58,
      "summary": "It's a sterile affair, no ambiguity, no ambivalence, just people doing one thing and then another."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "The movie is not uninteresting, but a viewer isn't breathlessly waiting to see how things will wrap up, either. By the third act, you even start to get impatient with the characters. That's not exactly a ringing endorsement."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "You should see it just for Chester — the adventurous sham, running ever deeper into a maze of his own devising."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "It’s a case of diminishing returns: gorgeous, occasionally evocative, but, in the end, mostly dull."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "All the pieces would seem to be in place for an effective film, but the direction is zestless, the pace is more often laggardly than leisurely, and the lead performances are surprisingly lifeless, although Mr. Isaac manages to make a virtue of his scammer's deliberate vagueness."
    },
    {
      "critic": "Daniel Green",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "Amini has proven his narrative acumen before and will undoubtedly do so again, but his inaugural stint behind the camera offers only fleeting glimpses of Highsmith's seductive, satirical prose that old hands such as Clément, Hitchcock and Minghella have so notably put to good use."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Pretty interesting film with a good (although not so original) story where the actors shine the most. You have the brilliant Oscar Isaac and also Viggo Mortensen and Kirsten Dunst all of them doing a very good job. The biggest flaw would be that the pace is a little bit slow for the most impatient viewers. But overall the film makes you feel satisfied by the moment it ends. See it!",
      "total_reactions": 1,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Drags a bit.",
      "total_reactions": 1,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Based on the novel by Patricia Highsmith this suspenseful mystery drama is of the same high calibre that distinguished 'The Talented Mr Ripley' another adaptation with the same classy pedigree. This film is elevated by three compellingly nuanced performances even it's the men who steal the show. Kirsten Dunst with less screen time is still very good, but it is the chemistry between Viggo Mortenson and Oscar Isaac that makes the material zing. Watching them play the cat and mouse games afforded them by the serpentine twists and turns of a very impressive screenplay makes for enthralling viewing. Director Hussein Amir keeps his camera in close creating an edgy claustrophobic atmosphere, whilst not allowing the gorgeous Greek and Turkish locations to distract from the main drama. This may be a low key film, but it is one of high quality. Smooth editing and luminous camera work add to the distinctive achievement. My only misgiving is with the title, the meaning of which completely eludes me.",
      "total_reactions": 3,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "As it often happens, this film features top notch cinematography and all-in-all good acting, but lacks the plot elements to make it completely intriguing, given the genre. In fact, there were a few flaws that impeded thorough enjoyment: Isaac's character is just too creepy and too little mysterious, and Kirsten Dunst is a bit gray, almost stuck in a film school persona; the mixture between mystery and thriller leans well towards thriller, while failing to deliver a thriller's thrills. Also, the psychological profiling isn't handled very carefully, with Mortensen going from a \"Oh-what-have-I-done\" kind of guy to a ruthless, cold calculator in a matter of minutes.",
      "total_reactions": 2,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Weak plot, boring and no grip from beginning to end. My expectation was high but I was totally disappointed. The only positive is the heart felt acting of Mr.Viggo Mortensen",
      "total_reactions": 3,
      "user": "MuratBaykurt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "A suspenseful look at a not-so-traditional few days in Greece during the 1960s. The Two Faces of January has a certain aesthetic which draws you in. Most of the time, you are craving for more.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "La película tenía buenos actores y una trama en principio interesante. Lástima que pronto todo se vuelve muy plano y monótono hasta que la intriga prácticamente desaparece. La lucha entre los dos protagonistas se vuelve tediosa y el papel de Dunst es casi anecdótico. Una película un poco pobre.",
      "total_reactions": 4,
      "user": "CPD98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Almost resembling a documentary show of stranded tourists from Nat Geo channel, The Two Faces of January has a deceptively quaint atmosphere for a thriller. Characters are manipulative, morally ambiguous and have pathology tendency for deceit. However, it's irritatingly slow on creating tension and the script is rather thin even for the average runtime of the movie. The flamboyant visual is just barely enough to keep interest till the end.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "As a whole, The Two Faces of January is a pretty good film. It is a touch slow, but I never thought its pacing was particularly bad or anything, plus the reward, to me, was ultimately worth it. Though, even if the ending was not as good as it was, it still would have been worth it due to the stellar cinematography in this one, as well as the great acting from Viggo Mortensen, Kirsten Dunst, and Oscar Isaac. In regard to the former, it really is a very sleek and sexy film to look at, true eye candy. I just loved the look and feel of this one and it was beautifully crafted. The writing was alright, nothing to write home about, but it certainly got the job done. At times, it certainly feels like a watered down film from Alfred Hitchcock and if this one had a bit more about it, it would have been better, but as it stands, I did enjoy it and thought it was a solid little film.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "The writing doesn't quite fully flesh out the characters, or make us care enough, for the suspense to be meaningful. Competently shot and has more promise in the beginning than the end.",
      "total_reactions": 0,
      "user": "zurnzurn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Joao gerundo : This is one of Mortensen's best performances, and \"The Two Faces of January\" is one gorgeously rendered old-school feature.",
      "total_reactions": 0,
      "user": "joaogerundo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "The Two Faces of January is a psychological thriller adapted from a novel by American writer Patricia Highsmith. Previous adaptations of her work include Strangers On A Train (1951) by Alfred Hitchcock, and The Talented Mr. Ripley (1999) by the late Academy Award winner Anthony Minghella. After a significant but fluctuating career as screenwriter (The Four Feathers, Drive, Snow White And The Huntsman), Hossein Amini takes on a challenging task for his directorial debut, proving that his skills can compete with Minghella’s and with the Master of Supense’s himself. Amini conveys the complex aspects of human behaviour typical of the finest thrillers in a surprisingly powerful way: he sharply outlines atmospheres, characters and situations, harmoniously blending them together in a remarkable, intriguing drama.",
      "total_reactions": 0,
      "user": "Devilmath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "A handsome thriller with plot twists that don't always make sense, \"The Two Faces of January,\" moves slowly, but ultimately entertains.",
      "total_reactions": 0,
      "user": "inamor417"
    }
  ],
  "metascore": 66,
  "name": "The Two Faces of January",
  "num_weekends": 1,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 26,
    "month": 9,
    "year": 2014
  },
  "opening_weekend_income": 43116,
  "opening_weekend_income_currency": "$",
  "rating": 6.2,
  "rating_count": 23732,
  "rating_freq": {
    "1": 256,
    "10": 622,
    "2": 267,
    "3": 511,
    "4": 1256,
    "5": 3610,
    "6": 7628,
    "7": 6601,
    "8": 2358,
    "9": 623
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 94,
  "votes_per_demo": {
    "aged_18-29": 6534,
    "aged_30-44": 9686,
    "aged_45+": 3671,
    "aged_under_18": 42,
    "females": 4185,
    "females_aged_18-29": 1597,
    "females_aged_30-44": 1713,
    "females_aged_45+": 640,
    "females_under_18": 12,
    "imdb_staff": 3,
    "imdb_users": 23732,
    "males": 16386,
    "males_aged_18-29": 4855,
    "males_aged_30-44": 7815,
    "males_aged_45+": 2971,
    "males_under_18": 30,
    "non-us_users": 14248,
    "top_1000_voters": 251,
    "us_users": 2611
  },
  "year": 2014
}