{
  "avg_rating_per_demo": {
    "aged_18-29": 6.8,
    "aged_30-44": 6.5,
    "aged_45+": 6.3,
    "aged_under_18": 7.2,
    "females": 6.7,
    "females_aged_18-29": 6.8,
    "females_aged_30-44": 6.6,
    "females_aged_45+": 6.5,
    "females_under_18": 7.8,
    "imdb_staff": 6.7,
    "imdb_users": 6.7,
    "males": 6.6,
    "males_aged_18-29": 6.8,
    "males_aged_30-44": 6.5,
    "males_aged_45+": 6.3,
    "males_under_18": 7.0,
    "non-us_users": 6.6,
    "top_1000_voters": 5.5,
    "us_users": 6.5
  },
  "avg_screens": 1247.75,
  "budget": 23000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 3,
    "month": 4,
    "year": 2015
  },
  "critic_review_count": 119,
  "duration": 101,
  "genres": [
    "comedy"
  ],
  "gross_income": 64460211,
  "max_screens": 3003,
  "mc_avg_user_score": 3.0,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "The Wedding Ringer",
  "mc_negative_rating_frequency": 101,
  "mc_positive_rating_frequency": 44,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "If we can’t believe these characters could really be friends, we can live for 101 minutes in a world where they do."
    },
    {
      "critic": "Michael Ordona",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 75,
      "summary": "Respect is not something viewers will find much of in The Wedding Ringer, nor propriety, nor any of those things that make for respectable family viewing. It’s just a funny, impolite, very not-for-kids romp that goes there."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 70,
      "summary": "Hart rants, Gad fidgets, and together this pair barrels through the plot, shaping between them a surprisingly potent friendship."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 67,
      "summary": "An affably crude bromantic comedy with an appealing set of bros."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "The Wedding Ringer is imperfect but its imperfections are tolerable because they're accompanied by a dollop of drama, a measure of laughter, and an oversized helping of Kevin Hart."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "There’s not much new here. But a savvy, sassy script, smart casting and genuine “I feel sorry for this white boy” chemistry between Hart and Gad make Wedding Ringer an R-rated bromance that will touch you as often as it tickles you."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 53,
      "summary": "While The Wedding Ringer isn’t the total waste of time that its painful trailer (and January release date) threatens, it’s also a movie whose occasional good ideas are ultimately drowned out by sloppy, contrived screenwriting."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "A mostly disposable, occasionally quite funny bromance distinguished at times by its earnestness."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "Vaguely more tolerable than you might expect – enjoyable, even, in sporadic bursts."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The predictable script lulls you into laughing at some very tired gags, but at least Hart refrains from screaming through the whole thing."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "The plot’s old, the title’s borrowed and the jokes are blue – but there’s nothing remotely new in this wearying bromantic comedy."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "The manic energy of Kevin Hart is, surprisingly, toned down in The Wedding Ringer. Which may account for almost the entire first half of this wannabe-raucous buddy movie being laugh-free."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "It's not quite a match made in heaven, but there is considerable comic chemistry between the high-octane Kevin Hart and the energy-conserving Josh Gad. A good thing since theirs is the only relationship worth watching in The Wedding Ringer."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "A well-cast but clumsily assembled buddy-for-hire comedy that increasingly smacks of desperation as it approaches its big-day climax."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "Despite the considerable charisma of Kevin Hart and Josh Gad and a strong supporting cast, The Wedding Ringer has only one or two genuinely inspired bits of comedy, a few dopey moments when you laugh in spite of yourself — and long, long stretches of pointless montages, loud and unfunny physical shtick and far too much reliance on gay “humor.\""
    },
    {
      "critic": "Drew Hunt",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "This big, brash, occasionally clever, but mostly dumb comedy is so gallingly derivative that watching it feels like playing a game of basic-cable bingo."
    },
    {
      "critic": "Jen Chaney",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 37,
      "summary": "What’s truly regrettable about The Wedding Ringer is that, at certain moments, it almost succeeds as a heartfelt comedy about male friendship in which its two stars, Josh Gad and Kevin Hart, get to demonstrate that they can act."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "Mr. Hart tells wild tales, Mr. Gad is humiliated, and most everyone else gets to dish out or receive abuse. But the laughs are not a sure thing."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "Director and co-writer Jeremy Garelick doesn't even reach high enough to pick the low-hanging fruit, opting instead to gather half-rotted, fly-infested jokes off the ground and expect Kevin Hart to make them funny by virtue of being Kevin Hart. Only grudgingly will I acknowledge that he sometimes does."
    },
    {
      "critic": "Jon Frosch",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "A certain derivative, deja-vu quality isn’t the only sin this lazy, numbingly routine, very occasionally amusing comedy commits."
    },
    {
      "critic": "Jason Clark",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "The Wedding Ringer is such a crudely edited, slapdash affair it often forgets about the characters it has introduced — especially the women."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "The Wedding Ringer has so many gay jokes that some of them apparently didn’t even make the final cut."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "The Wedding Ringer is not so much a rom-com as an anatomy lesson. And the lesson is this: Men have balls. They must have them, or grow them, otherwise they are not men. They are little girls."
    },
    {
      "critic": "Rupert Hawksley",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "The Wedding Ringer is offensive, insincere and far, far too long. Oh, and there is not a single funny moment. In short, it has all the charm of a catastrophic best man’s speech."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "The film is so flat and tired it really doesn’t deserve the vehemence of this review. It’s like chastising a completely airless tire for not rolling."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "The film’s lazy reliance on distraction extends to keeping its female lead underwritten and unsympathetic."
    },
    {
      "critic": "Kiva Reardon",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "summary": "This so-called comedy unfolds with embarrassing desperation and mind-numbing vulgarity."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Kevin Hart said before the release of the Wedding Ringer that the film was his best work yet and after watching it I agree with him. Hart shows that he is an excellent leading man in a comedy film. Josh Gad is also great, I think that Hart and Gad may be sustainable comedy stars for years to come. The movie is very funny but its also a heartwarming movie that make you realize how much you appreciate the friends in your own life. The Wedding Ringer is what you get when to add I Love You, Man and Wedding Crashers and the result is a film that will likely headline the best comedies of 2015.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "The Wedding Ringer was hands down one of my favorite comedy movies in years and I honestly didn't expect that at all. From trailers I thought this was going to be the least original comedy possible, merging Hitch and The Weddings Crashers into a cheesy, generic plot. After actually watching the movie, while it does have some of the elements from those films, it feels authentic and original throughout. The cast is all fantastic, with Josh Gad and Kevin Hart not having to carry the film but delivering roles that could've if required. The laughs weren't as abundant as I hoped but the film doesn't rely on them in place of content. The movie is rich with content so it doesn't use cheap laughs as a crutch the way most comedies do. Instead, it builds the humor and then truly delivers incredible comedy when it wants to. The emotions in the movie feel legitimate and the plot and characters develop in a way that makes them seem real... like if you know them and can see this taking place. Bottom line, it's difficult to explain why this movie translates so well. The critics proves once again that they don't understand humor but the actual viewer reviews seem rather positive, which is where I would suggest looking to in determining whether or not to watch the movie. For me, the refreshing take on comedy, where content doesn't take a backseat to laughter but doesn't replace it either, made for a great movie worth watching.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "\"The Wedding Ringer\" 10 Scale Rating: 7.0 (Good) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I couldn't stop laughing the whole time. Felt like an instant classic. I would re-watch it again just to try to pick up on the jokes that I may have missed while I was laughing. Had some very unique situations.",
      "total_reactions": 1,
      "user": "DragonArmy12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "This movie here is a rare one. Its overall a very funny film that was making everyone in the cinema laugh out load countless times throughout. But I do have to say sometimes the film crossed the line from extremely funny to slightly gross at times. It was a great buddy movie and I highly recommended you go into it expecting a lot of laughs from you and the other folks in the cinema.",
      "total_reactions": 1,
      "user": "fishpaste"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I went to see this with four friends and we laughed the whole way through the film. While the overall storyline and ending was predictable, Kevin Hart and Josh Gad work well together as a comedic duo. A feel-good buddy comedy!",
      "total_reactions": 1,
      "user": "CiaraMurphy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "It's funny and smart. The Wedding Ringer may be one of my favorite Kevin Hart movies. Great step up after Ride Along. Kevin Hart is sure worth your time and this movie proves it.",
      "total_reactions": 1,
      "user": "ImaginaryCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "A fairly plain generic comedy that lacks the laughs.  I can't say anyone is terrible here.  All the actors seem to care about their performance, but they lack the script to succeed.  C-",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "If you go to see this movie knowing this is not Oscars material you will have a GREAT time, there were a couple of moments I literally couldn't breathe because how hard I was laughing. If you want to laugh for an hour and a half give it a try, it's worth it.",
      "total_reactions": 3,
      "user": "weirdcryo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "An unrestrained wacky fun comedy with comical performances from Kevin Hart and Josh Gad, it's not better than Hart's other film About Last Night but Hart shines and this is his funniest movie. Gad has ebullience and is humorous as this funny like able character, and is more funnier than Olaf from Frozen. Josh Gad plays Doug Harris he's socially awkward and is two weeks away from marrying the girl of his dreams Gretchen (Kaley Cuoco-Sweeting), but he has a problem Doug can't find any groomsmen, running out of time Doug calls Jimmy Callahan (Kevin Hart) owner and operator at Best Man Inc, Jimmy helps friendless grooms. As Doug tries to makes this con work, an unexpected bromance sparkles between Jimmy and Doug. It's not that painfully predictable but the film makes it work, Hart once again is funny and talented even though if the material is bad Hart makes it work, he has this zest and this film shows that's he more than the hyper active character you seen in Scary Movie or Think Like A Man. Grade A-",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "If you have seen movies like Wedding Crashers or other Marriage themed comedy you've pretty much seen The Wedding Ringer. It's a fairly semitropical Wedding movie featuring Kevin Heart and Josh Gad who do a great job with their characters. Sadly the rest of the film feels fairly plain and dull other than a few monuments. The dull plot aside there are a fair amount of good jokes and funny scenes to the movie that are slightly redeeming but not enough to save the film. The concept of the film is original, Kevin Hearts character is paid to be the best man for many peoples weddings and makes quite a living out of it but at the same time complicates his day to day life...surprised no one has tried this in real life yet.",
      "total_reactions": 2,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "First, full disclosure here...I don't like Kevin Hart and I don't think he's funny. I do like Josh Gad, especially when he's playing a fat snowman who can sing. I'm not sure who figured that these two would work out together in this film. It's the ultimate example of Hollywood trying to play formula mixer. This just doesn't work and even though it has a great supporting cast it's just all over the place. I should have really trusted my gut instinct and passed on this one.",
      "total_reactions": 2,
      "user": "WJS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "While it's hard to say I was thoroughly entertained by the movie or even laughed during it, I can't say it was a bad film. Other than the occasional \"You put the weed in the coconut\" singalong me and some of my friends join in on randomly, this is a very forgettable movie that could barely hold it's own. It's a lowest-common-denominator comedy that will spew out predictable jokes and go along it's predictable story path, however the chemistry between the two leads did show some hope. If you're looking for a cheap comedy on a Friday night with some pals, this isn't a bad choice. However, you have been warned that this is not a great film, nor is it a bad one.",
      "total_reactions": 2,
      "user": "JaketheClicker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Very funny buddy comedy. Originally written in 2002 and  although it shows it might be dated writing, I still think it fulfilled all my  standards for a solid buddy comedy.",
      "total_reactions": 2,
      "user": "uprightciti"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "I simply do not understand the reviews of this movie! I watched it and I'm very pleased with it. Kevin Hart gave the audience a heart attack of comedy. The Wedding Ringer isn't supposed to smash Box Offices but provide the viewer with a mix of humor, good plot, and non-cliches. This movie has simply done that and above for me. Now if you're comparing this movie to any other movies like Avatar, Chappie, or Kingsman, Than you already lost the comparison. My advice is to at least get this movie on DVD or Blu-Ray if you're a humorous individual. Don't forget to look for the\" Lost\" reference at the end of the film as well!",
      "total_reactions": 2,
      "user": "Kortazy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Is it high art? No. But I enjoyed a toned down Kevin Hart, and despite some cheap low-brow humor there were some clever and inspired one-liners and monologues. If you like Hart then you'll like this movie, and if you just want a breezy, likeable film in the middle of trashy January, you'll appreciate this film.",
      "total_reactions": 3,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "The first hour of \"The Wedding Ringer\" is a funny buddy comedy but as soon as it hits the hour mark, gets sleaze down by cheap humour which gathers no laughs.",
      "total_reactions": 3,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "This is a horrible comedy with one of the worst plots i have ever seen. when the opening joke is Josh gad falling through a glass table you know the writers are desperate. also this has been the film to make Kevin Heart another one of my comedians i expect to make bad movies along with Will Farrell and Adam Sandler. the jokes are seriously not funny and done in a way that is incredibly mean spirited, which in itself isn't a negative but the way is written is so bad i just couldn't laugh at anything",
      "total_reactions": 3,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "My audience laughed their asses off in this film, and it even got a round of applause at the end.  So, for what it's worth, it's an entertaining movie.  I just wish that the volume had been higher because Kevin Hart tends to walk over his laugh lines, and when the audience busts into laughter, you miss next joke coming in rapid-fire fashion.  The chemistry between Hart and Gad is solid.  The true weak point of the movie?  Kelly Cuoco. She brought virtually nothing to the table, and she's completely overshadowed by the Olivia Thirlby in the much smarter role.",
      "total_reactions": 5,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Josh Gad plays a friendless nerd who's about to be married and hires Kevin Hart to be his best man and provide all the groomsmen. The only real reason to see this movie is for Hart's manic-mouth comic comments. The plot is painfully predictable, except when it veers off into absurd sequences that are supposed to provide outrageous laffs, but just fall flat. There are a few funny moments, but without Hart's energy this jumbled mess turns into a Hollywood hybrid of too many farces that did it better.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Co-writer and director Jeremy Garelick uses the movies premise to deliver a series of random gags and a tale of friendship. The problem is that even with all of the crazy scenarios that take place there's not much humor to be found. There are some clever one-liners and some amusing physical humor, but overall it's not a funny film. A big shock considering it has Kevin Hart as one of it's two leads. Even as a huge fan of his I found myself wanting so much more.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Good premise of a movie it seemed and fair story telling to keep the movie going-although running long. Hart made this movie funny, or this would have been TERRIBLE. Is he an actor, no. But neither is Gad. He reminds me of a less talented, pre-weightloss Jonah Hill and plays that playful, loser type character. Nonetheless it had a few good laughs, but I feel the promising premise wasn't full developed in regard of all the things that could spin out of control/fun factor stuff. Good for a watch, not to keep.",
      "total_reactions": 2,
      "user": "geedup"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "A comedy about to pull off the first ever Golden Tux.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Some laughs aside, The Wedding Ringer is a mediocre movie at the cheesy writing and mind boggling story. Its a movie that could have been a nice flick, but despite Kevin Hart at his best and the bromance of Josh Gad and Hart is so good, it may be the best since 22 Jump Street. Give it a rental watch, for the bromance, laughs and Kevin Hart.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Overall, \"The Wedding Ringer\" is partly a funny comedy and partly a banal mess that shines and stinks at equal measure. The chemistry between the leads is a grace while the supporting cast is unmemorable.",
      "total_reactions": 2,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "The fact that I sawed this movie back in January and now I'm reviewing it that because I couldn't give a living **** about this movie and I didn't want to watch it, but since I force myself to watch these bloated Hollywood movies that I have zone interest in just because I'm a movie reviewer. So for now on when you see one of my reviews and I don't go into deep detail to them pretty much means that I don't want to talk about the film at all because I simple do not care about that movie.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "This movie was a typical R-rated comedy. There was nothing spectacular about it in a cinematic sense, but where other comedies usually succeed, this film failed to be consistently funny. For the first half, I was extremely disappointed. I only laughed a couple of times, but when Kevin Hart and Josh Gad got to their antics, it remained funny from there. This is a sub-par comedy, but it can be worth a check on Redbox.",
      "total_reactions": 1,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "That moment when there are more negative ratings, but there are more positive and neutral (mostly neutral) reviews. I was expecting a lot more negative reviews, but I just got 3 (now 4 because of this review) reviews. Nonetheless, the Wedding Ringer is something you've seen before, but just make it worse and add clichés to it.",
      "total_reactions": 2,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "I watched The Wedding Ringer, for the first time; several days ago.",
      "total_reactions": 1,
      "user": "robinsense"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "The wedding ringer is a stupid movie.But it does have some enjoyable moments.This movie is fun and Kevin hart and Josh gud Make a pretty good team.But the jokes are not funny,It was kind of lazy and Sometimes Kevin hart and Josh gud act stupid.So I give this movie a 4.6/10",
      "total_reactions": 0,
      "user": "shadowguy654"
    }
  ],
  "metascore": 35,
  "name": "The Wedding Ringer",
  "num_weekends": 12,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 16,
    "month": 1,
    "year": 2015
  },
  "opening_weekend_income": 24500000,
  "opening_weekend_income_currency": "$",
  "rating": 6.7,
  "rating_count": 57447,
  "rating_freq": {
    "1": 766,
    "10": 4738,
    "2": 484,
    "3": 969,
    "4": 1842,
    "5": 4722,
    "6": 12384,
    "7": 18012,
    "8": 9797,
    "9": 3733
  },
  "release_day": 16,
  "release_month": "January",
  "release_year": 2015,
  "user_review_count": 113,
  "votes_per_demo": {
    "aged_18-29": 23475,
    "aged_30-44": 16889,
    "aged_45+": 2990,
    "aged_under_18": 302,
    "females": 10215,
    "females_aged_18-29": 5809,
    "females_aged_30-44": 2912,
    "females_aged_45+": 552,
    "females_under_18": 90,
    "imdb_staff": 3,
    "imdb_users": 57447,
    "males": 36324,
    "males_aged_18-29": 17402,
    "males_aged_30-44": 13791,
    "males_aged_45+": 2383,
    "males_under_18": 210,
    "non-us_users": 25106,
    "top_1000_voters": 254,
    "us_users": 7941
  },
  "year": 2015
}