{
  "avg_rating_per_demo": {
    "aged_18-29": 2.4,
    "aged_30-44": 2.8,
    "aged_45+": 3.0,
    "aged_under_18": 1.8,
    "females": 4.4,
    "females_aged_18-29": 4.6,
    "females_aged_30-44": 4.7,
    "females_aged_45+": 4.2,
    "females_under_18": 1.0,
    "imdb_users": 6.5,
    "males": 2.2,
    "males_aged_18-29": 1.9,
    "males_aged_30-44": 2.5,
    "males_aged_45+": 2.7,
    "males_under_18": 2.2,
    "non-us_users": 2.3,
    "top_1000_voters": 3.0,
    "us_users": 2.0
  },
  "avg_screens": 816.3333333333334,
  "budget": 20000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 9,
    "year": 2012
  },
  "critic_review_count": 26,
  "duration": 88,
  "genres": [
    "adventure",
    "family",
    "fantasy"
  ],
  "gross_income": 1064277,
  "max_screens": 2160,
  "mc_avg_user_score": 7.5,
  "mc_metascore": 32,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "The Oogieloves in the Big Balloon Adventure",
  "mc_negative_rating_frequency": 28,
  "mc_positive_rating_frequency": 85,
  "mc_pro_critic_reviews": [
    {
      "critic": "Abby West",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 91,
      "summary": "Parents who have had to sit through a myriad of mindless kids movies will appreciate a chance for their kids to be themselves at the theater and to be silly right alongside them. On the whole, it can serve as a good introduction to the movie-going experience."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "The song and dance interaction of kids hollering advice during Blue's Clues happens here on the big screen, which is meant to transform the movie into a social event of sorts."
    },
    {
      "critic": "Sherilyn Connelly",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "If today's youngsters grow up thinking of Christopher Lloyd as the old guy with the bongos from The Oogieloves in the Big Balloon Adventure, at least they'll be thinking of Christopher Lloyd at all."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 30,
      "summary": "If the target audience for this film were any younger, they'd be embryos."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "The low-budget production feels chintzy and impossibly square, even by tyke standards."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "Hallie's dad said it was Rocky Horror for toddlers whatever that is. Me and Hallie are 7 and we thought it was for babies."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "For the sake of the children, The Oogieloves in the Big Balloon Adventure should be allowed to quietly float away."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "The whole thing runs about an hour too long: It should have been a TV show. The adventure's too big for the kids who would love it the most."
    },
    {
      "critic": "Loren King",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "Will your preschoolers enjoy it? Perhaps. Is it worth 88 minutes of their lives, or yours? Not in a world where \"Sesame Street\" is on TV every day. Not even in a world where \"Sesame Street\" didn't exist."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 20,
      "summary": "If only the movie could live up to its own potential. Instead, we're stuck with blandly unappealing costumed characters meandering through a boring quest to find some lost balloons."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 12,
      "summary": "Enduring this brainless kid's film is akin to witnessing the end of the world."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "There are very few movies I have given a 0 to. The only other being Project X. But this one deserves it. It's by far my least pleasant viewing experience since... Project X. But, this one just made me rub my head and go, '' what am I doing with my life?\" I wanted to see this movie JUST to see how awful it was. And it was pretty sh!tty. This movie made me lose countless brain cells by the minute, and seriously made me have the urge to go on a rampage. When people say stuff like The Room, or Plan 9 are the worst films ever made, I will point to 'The Oogieloves in the Big Balloon Adventure\" and go, what's the worst movie of all time again?",
      "total_reactions": 4,
      "user": "loophole572"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "Hooray! It got a new milestone. Now that The Oogieloves is now a box office bomb and becomes the best dubious honor any horrible kids movie can make. The Worst Box Office Opening of All Time. As it turns out, they already beat the 2008 big bomb, Delgo, in at least 2,000 movie theaters worldwide with only $445,000 at the sluggish summer box office, the worst since 1993 and last year. They should've made it to DVD for kids and not on Blu-Ray. It's from the same studio that brought us bad movies like the Uwe Boil flim-flam movie BloodRayne. It's more like those boring kids shows on PBS that children are too tired of watching Barney and Friends and the infamous Twinkie-Winkie from Teletubbies. Turns out kids should interact a back-to-school prank on the movie. One thing's for sure, boy these Oogieloves should get the award for Worst Picture at next year's Razzies. Maybe they'll have a party and drink some beer (just like in Blades of Glory).",
      "total_reactions": 2,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "If you want a better bonding experience with your kids, go watch something else instead or play in your backyard. This one served more of a farce to children's cinema rather than as something worth of a family-friendly adventure.",
      "total_reactions": 2,
      "user": "HuckleberryPie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Ya I saw it. It was so stupid I threw up. Worthless. Director should be dead. I can't believe that someone would like this. It really kinda scared me in a way. I thought they were honna pull out a knife and kill themselves cause theyre so flipping weird",
      "total_reactions": 1,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "text": "Awful movie, is really terrible and stupid, don't have any good. The Oogieloves in the Big Balloon Adventure is a fail, stupid, silly and awful movie, no more.",
      "total_reactions": 4,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "JK they suck.",
      "total_reactions": 3,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Do not trust any of positive reviews below, which have clearly been posted on the same date by people that have not done anything else and clearly have the same kind of enthusiasm. These are the same bots created to raise the score on Flixster and the IMDb, which are currently at very positive scores, more positive than they should be. It's not my opinion that matters here, my opinion being that it's an aimless piece of drivel, but it damages the reputation of everything resembling the IMDb.",
      "total_reactions": 3,
      "user": "Maximillion93"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a cool twist on a children’s movie, calling for audience participation. Seems very “now” and my kids thoroughly enjoyed following the Oogieloves on their adventures. No surprise, given that we are in the generation of “WII”, the only thing I want to know it why it took so long for something like this to come out? I would recommend this film for parents who are sick of seeing the same old films, either under different names or under the guise of sequels. This is a unique film—love it or hate it, its not your typical Disney fare.",
      "total_reactions": 4,
      "user": "KatieChapman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventures is the store of a group of friends who go around town (Lovelyloveville), exploring the world around them, talking to people, and trying to find lost balloons for their friend’s surprise party.",
      "total_reactions": 4,
      "user": "TitoChapman"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventures is a great summer film. The songs are happy and help drive the plot forward, and also show off some of its cast’s great singing abilities. The sets are cool, clearly thought out to be visually interesting with the character’s costumes. And the characters themselves are also cool, and each have their own thing going on behind the stage, such as J. Edgar’s crush on Windy. Ah, love!",
      "total_reactions": 6,
      "user": "RahameLindo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventures is a great summer film. The songs are happy and help drive the plot forward, and also show off some of its cast’s great singing abilities. The sets are cool, clearly thought out to be visually interesting with the character’s costumes. And the characters themselves are also cool, and each have their own thing going on behind the stage, such as J. Edgar’s crush on Windy. Ah, love!",
      "total_reactions": 3,
      "user": "andyeucebio"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My family saw",
      "total_reactions": 3,
      "user": "CeesarTeveez"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was really cool to see in theaters since everyone got up and danced. At home its nice, because mommy can really join in without worrying about looking silly!",
      "total_reactions": 3,
      "user": "johnnycerini"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventures is a sweet film for the summer. It has cool songs, a cool concept (being interactive and all) and star power (Toni Braxton and Christopher Lloyd). All in all, something for everyone. Worth seeing also just to understand all the hype!",
      "total_reactions": 3,
      "user": "BrandonOrtiz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My kids are quite active and normally hate going to the movies since they would much rather be running around outside. However, summer storms and heat waves happen, so I am glad there is a film like this out there! Even my children, who normally do not like films, like dancing and singing along with the oogieloves! If your kids are like mine, I strongly suggest getting your hands on this film.",
      "total_reactions": 3,
      "user": "KateiWalsh1"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventures follows three friends around as they scout out missing balloons. There is Zoozie, a cute red head with a love for languages, Goobie, a green science lover, and the bold Toofie, who may just have a mohalk (its unclear). Together, they form the Oogieloves, who act as tourguides throughout the film of Lovelyloveville. We meet more friends and visit cool places, and I couldn’t help but root for the oogieloves to find their missing balloons—which they do (spoiler alert), just in the nick of time.",
      "total_reactions": 7,
      "user": "sdf4rfdf"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a film you should add to your video collection. Toni Braxton and a great cast, catchy songs and a peppy goldfish: good time guaranteed for all!",
      "total_reactions": 3,
      "user": "erasfghyu"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is the story of three friends who go on a series of adventures to find some special balloons that were inadvertently lost by a kind-hearted but clumsy friend. In the film, your kids will meet some awesome characters—a talking mirror, a beautiful Toni Braxton, a vacuum cleaner guardian, a shy pillow.",
      "total_reactions": 3,
      "user": "er34fdfg"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is the story of three friends who go on a series of adventures to find some special balloons that were inadvertently lost by a kind-hearted but clumsy friend. In the film, your kids will meet some awesome characters—a talking mirror, a beautiful Toni Braxton, a vacuum cleaner guardian, a shy pillow.",
      "total_reactions": 3,
      "user": "trreeee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My family just got this movie on DVD. We were never able to see it in theaters, for whatever reason, but really enjoy owning it. When my kids have a playdate, their friends always want to watch it, even multiple times in one sitting! Very cute to watch my little ones wiggle around and sing along.",
      "total_reactions": 3,
      "user": "ytadsv"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I would suggest Oogieloves in the Big Balloon Adventure for anyone who is tired of seeing another Disney/ pixar film…like me and my family!!! Seriously, I don’t know how much more I could have taken of the same old stuff.",
      "total_reactions": 3,
      "user": "tooof"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a great escape from the humdrum of everyday life! Ok, I guess that could be said about much of children’s entertainment, but Oogieloves felt exciting and different, kind of the way I think other people must have felt when telitubs first came out… Oogieloves look different from a lot of other characters out there, and the sets are very creative and interactive looking—like things are always changing, so you have to keep an eye out for any little changes (like the mirror’s drapes!) My kids and I loved watching for every little change, and this is what keeps the film exciting after repeated viewings—that, and the fact that the songs just get better with age!",
      "total_reactions": 6,
      "user": "sithi44"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a simple, cute film. In an hour and a half, your family will meet the Oogieloves and their friends, tour Lovelyloveville and learn some snazzy dance moves/ catchy songs. All in all, not too shabby!!!!!! I watched this movie with my whole family. My two cute babies also loved it.",
      "total_reactions": 3,
      "user": "rdeeesv"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "One of my children (age 6) saw this for a friend’s birthday party (which in itself is interesting since the film is about several friends throwing a birthday party for another friend). He said how much fun he had and came home singing/ dancing. He BEGGED me to take him to see the film again, and soon his sister did too! But I read all the bad reviews and couldn’t bear to spend $50 on a crappy family movie night!",
      "total_reactions": 3,
      "user": "ilokkfds"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure came out last year and according to Wikipedia was a super huge box office flop. It also has received a lot of bad reviews, really mean ones too! I can’t really tell you why people are getting so angry about it… Oogieloves was a sweet film. My family borrowed a copy from a friend, and liked it so much we shortly went out to buy a copy of our own. Its fun to dance and sing too, though quite frankly I don’t dance as much as I should! Still, my kids like it and that’s what matters. At such a great price too, if your kids ask for it, why not just buy it and be supermommy for a day?",
      "total_reactions": 3,
      "user": "imanni"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Who is the singer? Her voice is greMy daughter raves about this film! She is just five, but somehow her love of this film has spread throughout her kindergarden class. Her friends come over and they just want to watch this film! I happily oblige and put it on—great family entertainment, a lot better than a lot of the other drudge that is on tv.at!",
      "total_reactions": 3,
      "user": "sithi4554"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Booging with the Oogieloves is a great way to spend the summer. Last year, I took my three children to see it in theaters and we had a great time to see it. When the movie came out on DVD, my kids begged and begged for me to buy it, which I didn’t at the time  (I hate begging). Anyway, after months and months, I decided to buy it as a surprise present for them and they were ecstatic! Everyone is a year older, but they still all dig the movie. The songs are great for any age group too!",
      "total_reactions": 2,
      "user": "KandiMiller"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a nice flick to watch on a rainy or super hot day. Pop the dvd in the player, tell your kids you have a surprise for them, tell them you have a surprise or a special movie to show them, and then let the games begin! Even in the generation of Dora the Explorer, WII and touch screens, I can bet your kids will have never seen something like this before! Sit back and see how they react.",
      "total_reactions": 3,
      "user": "DaquanHargrove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a nice film to watch with your family if you have young kids. It might not have the all-ages appeal of other children’s movies, but your children will love it and it is always good to try something new, especially when the film comes out on DVD for a fraction of the cost of seeing it in theaters!",
      "total_reactions": 3,
      "user": "KimikoSchneide"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Check out Oogieloves in the Big Balloon Adventure this summer! A quirky, interactive film that lets you sing along. The songs are so catchy you won’t be able to stop yourself, and the story is about friends helping friends, which is always a good moral to pass on to your family.",
      "total_reactions": 2,
      "user": "LucyTran"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "I saw Oogieloves in the Big Balloon Adventure last year with my children. They immediately fell in love with it and couldn’t stop dancing the dances or singing the songs or staying how they wanted to see it again!!! We almost did go back even, that is how much we loved it, but in this economy we decided to wait till it came out on DVD to save some money.",
      "total_reactions": 2,
      "user": "CharlesNixon7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure has something for everyone—music, dancing, great costumes and funky sets.Unlike most of these reviews, I actually didn’t love the songs in the movie, although Rosie Rosebud, played by Grammy winner Toni Braxton, sure has some pipes on her. I should mention that my kids liked the songs. But for me, I stayed to watch because of the clever characters—a fashion forward mirror, a paternal vacuum cleaner, the awesome staff at the cow diner. I would recommend this to a family with young kids looking for a nice film to watch together.",
      "total_reactions": 2,
      "user": "MangalaGowri"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My kids and I kind of randomly happened upon Oogieloves in the Big Balloon Adventure in the store. My oldest (aged 6) liked the bring packaging—she loves colors and saw that one of the characters had glasses, like her. We bought the film and took it home and watched it that evening. My two kids really enjoyed Lovelyloveville and getting a chance to explore a new place and learn new songs. In that way, it really was an adventure!",
      "total_reactions": 2,
      "user": "MargeryTettert"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a nice film to take young kids to see. A cute mix of the teletubies, Dora the Explorer and karaoke… My family would see it again today!",
      "total_reactions": 2,
      "user": "rrreerr10"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My child saw this Oogieloves in the Big Balloon Adventure at a friend’s house and loved it. He came home singing the songs, and I soon went out and bought it for him to. He loves watching it with friends. One suggestion: my son is the only young child in the family, so I would suggest it for families with more than one little one just because the film is interactive/ social, so it is much more fun to do with others.",
      "total_reactions": 2,
      "user": "ArthurAlves"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a nice film to watch with your family. In it, the 3 main characters, Goobie, Zoozie and Toofie (the Oogieloves) go on an adventure to recover 5 missing balloons which their clumsy (and in my opinion, frustrating but well-intention friend/ caretaker) J Edgar lost in the film’s beginning. One of my favorite characters is Windy, the magical mirror (and J. Edgar’s love interest) who can show the Oogieloves whatever they want, including the balloons being lost. We also meet Ruffy, the charmingly grumpy goldfish.",
      "total_reactions": 2,
      "user": "JoelCabrera"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a sing-a-long, move-a-long children’s film, with “echoes” of the teletubies and Dora the Explorer. In certain ways, the Oggieloves also reminded me of movies and television shows from my childhood since each character seemed to be well thoughtout. Today, in movies for adults and kids alike, I can’t help but feel like everything is special effects driven. Plot and characters often go out the window, especially in Hollywood blockbusters.",
      "total_reactions": 6,
      "user": "PaulBailey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventures is a decent children’s film with something for everyone. I would recommend it to parents with children in different age groups or grades (which is most of us).",
      "total_reactions": 2,
      "user": "JonathanRodrig"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure came out last year to poor reviews, so I never took my kids to see it, even though they wanted to and had heard it was good from their friends. I just couldn’t stand the thought of another bad movie, especially since it costs so much nowadays to see a movie in theaters.",
      "total_reactions": 2,
      "user": "gilbertos"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Oogieloves in the Big Balloon Adventure is a must-see movie. I have taken my children to basically every children’s film, and I can tell you that Oogieloves is special. The film’s plot is simple: when magical balloons—the last 5 in Lovelyloveville, the Oogieloves’ very special hometown—are lost by the Oogieloves’ caretaker/ friend, the Oogieloves themselves—Zoozie, Toofie and Goobie—go on a quest to find the balloons and meet some cool characters like Lola Sombrero, Marvin Milkshake and Rosalie Rosebud (none other than Grammy Award winner Toni Braxton). The songs and dances are also simple but cheerful, as are the sets. The film’s magic somehow lies in all of these elements coming together, plus the fact that the audience can/should/ is expected to interact to make a special film with massive appeal and tons of originality.",
      "total_reactions": 2,
      "user": "dooler"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Plot summary. All in all, Oogieloves in the Big Balloon Adventure is a nice film, with great heart and great rhythm. It is a great film to see with your family when you crave nothing less than a great adventure movie.",
      "total_reactions": 2,
      "user": "EmadKhalaf"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Oogieloves in the Big Balloon Adventure is a story about good intentions gone (ever so slightly) wrong, and the power of friendship and teamwork. Magic of Lovelyloveville. Plot summary. Great moral.",
      "total_reactions": 2,
      "user": "KevinRodriguez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "This film is different, and perhaps isn’t for everyone. And that is OK. Great to be able to sing and dance along in a movie theater without being thrown out.This film appeals to young kids: it is short, but they can participate and move along. It is also good because it displays the songs’ lyrics, so even though its not a book, your kids will still be exposed to letters and words.",
      "total_reactions": 1,
      "user": "JoshKaplan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Oogielovesin the Big Balloon Adventure is about three Oogieloves (Goobie, Zoozie, and Toofie) who are organizing a surprise birthday party of their friend. Of course, as can be expected in a children’s movie, nothing goes to plan and soon the Oogieloves are searching for magical balloons for the party which had been lost.",
      "total_reactions": 2,
      "user": "ElaineMetaxas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My children (all under the age of 6) had a great time dancing along to this movie. They are normally not “indoors” children—they love being outside and running around, and even in preschool they love prefer outdoor play and shun the reading corner. Not surprisingly, an interactive film like this which tells them to get out of their seats was a big hit with them. They loved moving around and I loved that the film was a healthy way for them to get all of their energy out!",
      "total_reactions": 2,
      "user": "Jasonfowns4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "My kids had a great time seeing this in theaters and dancing along. Little kids are definitely the film’s target audience because they dance so freely, without worrying that they look silly or strange, unlike adults. Because of this, watching the movie at home, it is even better because I can join them and dance as crazily as I want, without worrying about looking weird!",
      "total_reactions": 2,
      "user": "gggjkkllll"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a one-of-a-kind film about three oogieloves who dance and sing their way around Lovelyloveville, their home village. The Oogieloves include Toofie, who seems to have a Mohawk which in the logic of kids films makes him the “bad boy” and maybe even the heart throb! Zoozie is a redhead who can speak to all different things in the Loveloveville kingdom since she is fluent in so many languages. And Goobie is a science genius in the making, who, with his big, round spectacles will make glasses-wearing kids feel ok.",
      "total_reactions": 2,
      "user": "AndrewWam"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "What makes Oogieloves so special is that it is interactive—the audience has to participate in the film, instead of just hiding between a big bucket of popcorn. It also has a great cast, including Grammy-winner Toni Braxton and the wonderful Christopher Lloyd.",
      "total_reactions": 5,
      "user": "ZachRolf"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a mix of a Broadway musical, the teletubies and a WII dancing game, combining the cheerful songs of a musical, the aesthetic of the Teletubbies (albeit brighter) and the interactive qualities of WII.Oogieloves combines all these elements to make a happy children’s film that your kids will want to see again and again.",
      "total_reactions": 2,
      "user": "Samaabur"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is one of the most controversial children’s films that has come out in the last few years. Whatever other people may say, for me and my family, Oogieloves in the Big Balloon Adventure is a simple film, short and sweet and perfect for young kids, think pre-school or kindergarten.",
      "total_reactions": 2,
      "user": "ChutzaMings"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Oogieloves in the Big Balloon Adventure is a classic children’s film in the making. In it, the Oogieloves (Goobie, Zoozie, and Toofie) retrieve magical balloons that J. Edgar, their friend, mistakenly lost. Instead of getting mad at him, they go about Lovelyloveville to find them and meet some cool folks along the way and have the adventure of a lifetime. Your children will have a great time too, accompanying them on all the ups and downs and surprising twists of their journey. This is a sweet film for 2-5 year olds, just bright and flashy enough, with original characters that come baring the perfect balance of personality and pizzazz to bring a smile to your little one’s faces.",
      "total_reactions": 2,
      "user": "Dianinejad"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Your children will also like the film’s interactivity, which calls for the audience to dance and sing along. Even if your kids don’t get out of their seats, they will still enjoy the idea of something different.",
      "total_reactions": 2,
      "user": "VictorAcker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This film is the story of Lovelyloveville, the beautiful, charming and intriguing home of the Oogieloves. Like the Oogieloves themselves, Lovelyloveville is original, bright and intriguing, as well as a character in its own right. It is home to the Sombrero duo, a grouchy goldfish, a magical mirror and a retro diner, all of which your children will get to interact with.",
      "total_reactions": 2,
      "user": "AmandaBell"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Mix of a Broadway musical, the Teletubbies and a WII dancing game which combine to create a film little children will want to see again and again. Great for play dates. DVD inexpensive treat for little children.",
      "total_reactions": 6,
      "user": "Mikeeaggi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "Move over Quentin Tarantino, the new master of plot, characterizarion, and oh im crying thinking about it. I HAVE NEVER BEEN SO ATTATCHGED TO THESE CHARACTERS, and",
      "total_reactions": 2,
      "user": "alexo774"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "I r8 8/8 m8 no deb8 h8 b8 not! Best Movie in 420 Years! \"429/69\" -IGN LOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOL",
      "total_reactions": 1,
      "user": "LOLIDONT9999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "oogieloves is the best movie I have ever seen in my entire life. I can't believe I've gone so long without seeing it! Movies such as Pulp Fiction and The Shawshank Redemption fall short of this beloved classic. I highly recommend this to any human on this planet. What a brilliant work of art.",
      "total_reactions": 0,
      "user": "Colinator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "good stuff this is. real good. features oggyloafs the best loves to ever oogie. great plot, deep characters. n ow I need 151 characters so this is here",
      "total_reactions": 0,
      "user": "memers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "Anyone who gives this movie a positive review has NEVER been near a kid or has been one in their lives, and I would HATE to see how dumb kids would get under their care.",
      "total_reactions": 0,
      "user": "TheSpacecat"
    }
  ],
  "metascore": 32,
  "name": "The Oogieloves in the Big Balloon Adventure",
  "num_weekends": 3,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 31,
    "month": 8,
    "year": 2012
  },
  "opening_weekend_income": 443901,
  "opening_weekend_income_currency": "$",
  "rating": 6.5,
  "rating_count": 14233,
  "rating_freq": {
    "1": 1649,
    "10": 11990,
    "2": 143,
    "3": 54,
    "4": 36,
    "5": 22,
    "6": 23,
    "7": 40,
    "8": 38,
    "9": 238
  },
  "release_day": 29,
  "release_month": "August",
  "release_year": 2012,
  "user_review_count": 85,
  "votes_per_demo": {
    "aged_18-29": 1295,
    "aged_30-44": 787,
    "aged_45+": 245,
    "aged_under_18": 42,
    "females": 608,
    "females_aged_18-29": 384,
    "females_aged_30-44": 148,
    "females_aged_45+": 52,
    "females_under_18": 12,
    "imdb_users": 14233,
    "males": 1824,
    "males_aged_18-29": 905,
    "males_aged_30-44": 627,
    "males_aged_45+": 191,
    "males_under_18": 30,
    "non-us_users": 579,
    "top_1000_voters": 65,
    "us_users": 982
  },
  "year": 2012
}