{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.7,
    "aged_45+": 6.5,
    "aged_under_18": 7.3,
    "females": 6.5,
    "females_aged_18-29": 6.6,
    "females_aged_30-44": 6.4,
    "females_aged_45+": 6.5,
    "females_under_18": 7.2,
    "imdb_staff": 6.4,
    "imdb_users": 6.8,
    "males": 6.8,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.7,
    "males_aged_45+": 6.5,
    "males_under_18": 7.4,
    "non-us_users": 6.7,
    "top_1000_voters": 6.5,
    "us_users": 6.9
  },
  "avg_screens": 1316.6,
  "budget": 25000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 6,
    "month": 4,
    "year": 2012
  },
  "critic_review_count": 410,
  "duration": 117,
  "genres": [
    "action",
    "adventure",
    "drama"
  ],
  "gross_income": 51533608,
  "max_screens": 3207,
  "mc_avg_user_score": 6.9,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 94,
  "mc_movie_name": "The Grey",
  "mc_negative_rating_frequency": 45,
  "mc_positive_rating_frequency": 283,
  "mc_pro_critic_reviews": [
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 90,
      "summary": "It's a fine, tough little movie, technically assured and brutally efficient, with a simple story that ventures into some profound existential territory without making a big fuss about it."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 88,
      "summary": "Sit through the entire credits. There's one more shot still to come. Not that you wouldn't be content without it."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 83,
      "summary": "Genre movies are often mere excuses for shows of gore and tricked-up suspense, and while The Grey should satisfy anyone who seeks only that there's something more profound and pure at its heart, making it a genuinely entertaining thriller that puts a chill through you in more ways than one."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "I pretty much loved this movie from start to finish - risible implausibilities, insufficiently explained premise and all. An admirably spare survival thriller, The Grey (nice title!) abounds in qualities that are rare in movies of its type. It's quiet, contemplative, and almost haiku-like in its simplicity."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "What is surprising is how poetic the movie is, partly thanks to its high-lonesome sound design and the desolate beauty of its visuals, but mostly because of its star, Liam Neeson."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "The gristle inside this movie is one of the things that save it from being simply a series of challenges."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "Like Anthony Mann's \"The Naked Spur\" (1953) or \"Man of the West\" (1958), the movie draws on the terrifying beauty of the natural world and generates tension from the volatile dynamics of a carefully observed group."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 78,
      "summary": "The film is an intelligent study of the will to live. It's so strong that even a suicidal man rises to the occasion."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "There's an almost poetic quality to the way things develop, with characters becoming increasingly introspective."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Forsaken in a cruel wilderness, a man looks to God and pleads for help. Receiving no answer, he says, \"F- -k, I'll do it myself.\""
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "The setting and fatalistic musings of The Grey invite comparison to Sean Penn's stirring 2007 ad­ven­ture \"Into the Wild\"; in its more metaphysical moments, told in impressionistic flashbacks, it recalls last year's \"The Tree of Life.\""
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "A terrifically exciting, deeply unsettling survivalist epic."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Call The Grey \"Deliverance\" Lite, with snow, and wolves. And call it a solid January surprise."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "The Grey avoids smug clichés, takes you to places you least expect and settles for no comfortable solutions, while it explores the dark shadows of the male psyche and finds more emotional fragility there than you find in the usual phony macho myths from Hollywood."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "There's little in Joe Carnahan's previous films, marked by their frenetic, fanboy-friendly overindulgences, to predict the cold blast of The Grey, an old-fashioned, neatly arrayed survival story that almost reads like a reaction to the excesses of his past work."
    },
    {
      "critic": "John Anderson",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Mr. Carnahan has till now been pigeonholed, and rightly, by comedy shoot-'em-ups like \"Smokin' Aces\" and \"The A-Team.\" But here he is with The Grey - certainly an adventure film but one with a spiritual ingredient that is both surprising and fiercely resonant."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "True to its grim prospectus, The Grey dwells in haunted machismo to the very end."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Don't be mistaken -- this isn't an artsy thriller. It is still, at heart, men vs. wolves, and the wolves definitely have the home-court advantage."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "The Grey, a man's-man of a genre picture that will satisfy the action audience while reminding more discerning viewers what they saw in director Joe Carnahan's decade-old breakthrough, \"Narc.\""
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 65,
      "summary": "The movie might not be a vengeance-driven wolf-man cage fight, but in subverting those escapist expectations, it sinks its teeth far deeper and more memorably."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "The film sustains some suspense and brooding atmosphere for its first half, but eventually the clichés of character and dialogue drag it struggling to ground."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "The Grey, whose clipped title, grim swagger, and lost-in-the-outback themes conjure up visions of that Alec Baldwin/Anthony Hopkins classic, \"The Edge,\" devolves into a predictable man-against-nature, and man-against-fellow man, affair."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "At times, the animatronic effects used to create the wolves are too obvious, and the one-by-one kill-off plotline employed in so many horror films gives The Grey a plodding predictability. At nearly two hours, it's also too long."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 60,
      "summary": "Moment to moment, the film is gripping and beautiful to behold (props to cinematographer Masanobu Takayanagi for the mesmerizingly grainy, achromatic visuals). But caveat emptor to those expecting a hinterlands gloss on \"Taken\" with rapacious curs in place of nefarious Albanians."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 58,
      "summary": "Neeson brings gravitas to the table, acting as a legitimizing counterweight to the overwrought dialogue and flesh-tearing lupine hysteria. But in a scenario this persistently ludicrous, he can only do so much."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 58,
      "summary": "You see the pattern here? Winter-release slot + travel budget + Liam Neeson = slightly preposterous, routinely violent, apparently lucrative action movie in which the Irish-born star signals inner emotional conflict with his handsomely mashed boxer's face while settling outer physical conflict with his boxer's fists."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Neeson's gravity elevates the action, and there's a fine, prickly performance by an actor new to me, Frank Grillo, as the asshole of the group. But The Grey, despite moments of sublimity, is as predictable as a funeral. When Ottway angrily calls out to God, the nonanswer is sadly redundant."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The computer-generated wolves have more personality than any of the dull characters in The Grey."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "It's cheap the way The Grey wants to be both a Liam Neeson \"Quit Taking My Stuff'' movie and an existential thriller about survival."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The picture's dialogue-heavy stretches and ambiguous finale could leave ticketbuyers impatient for less chatter and more chomping."
    },
    {
      "critic": "Brian Miller",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "There's too much Jack London, and, as they systematically pick off the stragglers, too many CGI wolves go unpunched."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "This is admirably ambitious, but Carnahan's not nearly good enough a writer or director to pull it off: the results are portentous, muddled and not nearly as entertaining as Neeson's usual face-punching antics."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "A handsome but gabby take on the standard survivalist thriller that's more concerned with lofty metaphysics than which poor blockhead is about to bite it next."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "Carnahan didn't make a movie unfit for mankind but it certainly isn't worth mankind's money."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "Neeson is always compelling, even in a movie as ridiculous as The Grey."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Closer examination of this movie seems to indicate that it is an analogy. It is really about man facing his God and his fear of death in a dignified fashion...which is what Liam Nesson does. As proof I offer the 4 line poem the main character's father wrote and posted on his wall. It is repeated several times so you can't miss it...you're not supposed to. It is the last thing Liam Neeson's character thinks of before....well you know. The message is quite clear. Live to fight another day, die with honor, strength, bravery and above all dignity. I think the movie was beautifully done and superbly acted.",
      "total_reactions": 21,
      "user": "BlueRick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "It's a fun, competently shot and directed movie that makes a few missteps. First off, this is a survival movie, but NOT a nature survival movie. The wolves aren't really killing for food or survival, there's a bunch of pompous exposition about them organizing and taunting the survivors and other crap. The wolves don't even bother eating some of the kills, the characters might as well be fighting the hillbillies from Deliverance, this is NOT a nature movie. Second, some really wonky physics towards the end, from improbably jump angles off of clips to improbable getting feet stuck between rocks. Good acting and decent existential statements though, worth the time it took to watch it.",
      "total_reactions": 2,
      "user": "Gene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Loved this movie. It had something for everyone. Action lover? Its got that, and if u love story, and drama, its got abit of that. Unlike 80% of all movies, it is completely unpredictable. Things twist, and happen at random alot.. Also very bloody. Im sure you have heard alot of griping about the end. Forget it. But you have to watch the credits. All those who gripe didnt.... And even then, many werent satisfied with the ending. I was, and just leave an open mind about the ending. Once agian, it was great.",
      "total_reactions": 2,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "This movie was fantastic. The actors all portrayed their respective characters quite well, and although a tad bit predictable at times, there were enough surprises and thrills to push you to the edge of your seat and care if the characters lived or died. It was a bit heavy on the existential angst that was sometimes out of place, but overall it just helped develop the characters and give a meaningful back story in between the action packed escape scenes through the tundra. The wolves, though unrealistically vicious, were necessarily so, in order to provide more danger and excitement. Overall, an action-packed thriller with sufficient character development and surprises to keep you interested.",
      "total_reactions": 1,
      "user": "Jman4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "I appreciate the spare, gritty look and feel of the movie. No, the wolves didn't look 100% realistic with Jurassic Park-style CGI, but it doesn't matter. What's here is certainly convincing enough. The relationships between the men, they way each of them reacts to the crisis, and their journey have a very real texture to them. In some way that I can't specifically articulate, it reminds me a bit of Meek's Cutoff (a film I don't care for), though this film is much more entertaining. The characters are a bit flat, and given the way that some of the dialogue was written, it also reminds me of more off-the-cuff, found-footage films like Blair Witch and Paranormal 3. Which worked for me - it all sounds very natural.  And as Ebert suggests, you have to sit through the credits if you want to see the final shot of the film.",
      "total_reactions": 7,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I know its only a month into the new year, but The Grey is hands down the best movie of 2012 so far and its going to be VERY hard to beat. Liam Neeson needs to be recognized as one of the best actors out there. Absolute powerful performance in a very powerful movie. The Grey will grip you and toss you around for 2 terrifying, gut wrenching, and heart pounding hours. You will love and hate every minute of this movie, it's that powerful. This is the most suspenseful and terrifying movie i have seen in a long time. You will grow to have a major fear of wolves after this movie, I sure did. Plus i just have to say it, it was great to hear Liam Neeson quote \"I'm going to start beating the s**t out of you in about 5 seconds\" Just one of the few comedic relief moments in this amazing film. Go see this movie now, its money well spent. Just a warning, it will create a fear of wolves and potential fear of flying, but don't let that shy you away because this is a VERY good movie. 10/10",
      "total_reactions": 6,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This is by far the best film I've seen yet in 2012. The Grey is emotionally riveting, terrifying and utterly philosophical. Where a film like \"The Edge\" starring Anthony Hopkins and Alec Baldwin was about man VS. Nature, The Grey is more about man accepting Nature. The performances are terrific and the cinematography makes you feel like you're there. The surround sound and big screen make a difference at the cinema. It's rare films like The Grey make it to the theatre. Do yourself a favour and go see it. Be warned; it's not for the faint of heart. AS WELL, there is an important, albeit very short scene after the credits.",
      "total_reactions": 3,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Although depressing, I never got bored.  Like most survival films, it has the stereotypical cast of characters, especially the annoying one that argues constantly with the others.  They never seem to be the ones that die initially.  The performances are solid, but the run time seems a little long for an intense movie.  For me it doesn't have the repeatability factor - I have no desire to ever see the film again, but it is well made.  The plane crash seems realistic, the weather makes you feel chilly, and the wolves give you goose bumps.  It just seemed like I've seen it all before.",
      "total_reactions": 4,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I have experienced things in life that taught me to never say \"can not be worse than that!\" Because I know that in general a fan of horror movies knows can.Every they see. If you confuse what happens in movies like \"things that never happen to me\", well, you learn.",
      "total_reactions": 4,
      "user": "Ginqs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "After a harrowing plane crash a group of men (lead by Liam Neeson) is stranded in the middle of a frozen wasteland. They struggle to survive against extreme weather, physical injuries and a pack of wolves. The action is swift and jarring, without being too graphic. Unlike what you'd expect, the tension actually slows as the film progresses. Too much time is spent creating sympathetic characters, when all we care about is who's next to die and how. Still, it's thoroughly involving and damn suspenseful.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "The Grey is a very well shot, minimalist-written survivalist story where some very good actors face the Alaskan Wilderness and CGI wolves. Joe Carnahan gives the movie an existential edge, where the fierce weather serves as a back drop for some high integrity acting and metaphysical contemplation when a team of Oil Workers survive a plane crash only to face a pack of wolves. Poetic, Romantic, Contemplative - and in most sequences, a lot of fun. The weakest thing in the movie is the wolves.",
      "total_reactions": 2,
      "user": "SirEddieCook"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "THE CONS Wolves just don't LOOK or behave like that. Period.  The process of suspending my disbelief was continuously interrupted by these wolves on steroids.  Kept waiting to learn they were the progeny of some escaped military experiment. That would have actually been more believable. Please stop maligning our hapless wolves (the REAL ones)! Only Neeson saved this from being a silly fairy tale. I was very highly upset by the abrupt ending.   I mean, we expect to be rewarded for tagging along on a perilous journey with the characters of a suspenseful story in the first place, right?  THE PROS *Great performances. Neeson at his best, as usual. *Awe-inspiring visuals of misty mountain ranges. *Crash seemed horrifically realistic.",
      "total_reactions": 11,
      "user": "noseoutagood1"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "While this movie isn't as bad as I thought it would be, it still wasn't very good. The main problem with the movie is that it was unrealistic and unconvincing. The wolves were made to be much smarter and bloodthirsty than they are in reality, and for some reason they would appear and disappear at random points in the movie. If you've ever seen Frozen, you know what I mean. The random disappearance/appearance lead to more than a couple plot holes as the movie went on. And then there's the fact that a man somehow jumps across a 50 foot gap.... how? The second problem is the editing. While not terrible, throughout the movie there are flashbacks that just don't seem to make sense as to where they're placed. It felt clumsy and pretty awkward. And finally, there's the ending. While it could have been worse, it still is just not good. While cliffhangers can totally be appropriate in some cases, a survival thriller is not one genre it works particularly well for. This is one ending that will more than likely make you frustrated. There are a few positive things about this movie. The acting was fine (much to my surprise), and for the most part the script wasn't bad, minus a few absolutely absurd conversations that happen throughout the film. Think of this one as Poseidon in Alaska, though this one isn't quite as bad as Poseidon. It isn't a great movie. The Grey is a pretty bland, and even laughable at a few parts.",
      "total_reactions": 7,
      "user": "jredekop"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "Boring, tedious, slow, long, inconsistent, gray, and again boring, tedious, slow, long, inconsistent and gray. From Taken, Liam Neeson lost his way in his career",
      "total_reactions": 9,
      "user": "norbertosica"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Awful!  A Hollywood studio obviously stamped Neeson's name on this one to guarantee covering it's  costs. Glad it was a red box! Unrealistic from start to finish. What a waste of money and resources. No knife edge survival of the fittest drama, just lots of very uninspiring metaphors and cliche melancholy. Come on Liam your better than this. Who are these film critics giving The Grey a 6.6 anyway???",
      "total_reactions": 6,
      "user": "MullerHowth"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "This was a very entertaining movie.  One of my favorites so far this year.  Great story, cinematography, and just enough violence to keep your juices flowing...",
      "total_reactions": 3,
      "user": "pete409"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "One of the best films of the year! Liam Nesson, in one of his best roles to date, plays a rough, hard-nosed, scrappy, tough, kick-ass and yet subdued role in this film. He is quiet and focused exactly when he needs to be. All the performances are good and the cinematography is awe-inspiring. There is not a dull moment in this film. It exhibits truth and the harsh reality of these men coming to terms with their lives in one of the most harsh climates man has ever seen. The wolves are truly terrifying, and they are certainly an integral part of this story.",
      "total_reactions": 3,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Great movie about survival and how harsh nature really is. The lack of Liam Neeson kicking @$$ and taking names and the lack of over CGIed scenes is extremely refreshing in an industry that has been overrun with thrillers. This is not an action movie like a lot of Liam's recent films. The Grey is a somewhat survival horror movie with a lot of drama. You will be surprised and you will most likely cry at many points in this film. My only complaint about this movie is the fact that the wolves sort of act out of character from what I know about wolves, their habits might seem inconsistent to some survival experts, but that is such a minor complaint it really doesn't matter. Enjoy the film because it's really good.",
      "total_reactions": 4,
      "user": "SacrificAbomina"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "Horrible movie with no understanding of how wolves act, how planes crash, how people act, how humans live in sub zero temperatures and possibly the worst sound in the history of recorded sound.  There isn't one redeeming quality to this unless maybe if it was on a screen and provided you with light in a dark room.",
      "total_reactions": 4,
      "user": "mustard_tiger"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "I will give this movie a 2/10 because I'm sure if I think hard enough I could bring to mind worse movies. There simply were no redeeming qualities to this movie. Inconceivable plot where one almost feels that the writer just gave up and went to another scene. This movie was a money making scheme. Built around a decent trailer, the whole plot was a mishmash of nonsense. Anybody who thought this was a good movie is either a philistine or they can suspend their disbelief far beyond anything I'm capable of.",
      "total_reactions": 5,
      "user": "ajaxanon"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Thought any Liam Neeson film would be a good action movie!  Very depressing, They all should have been frozen to death with the light clothing they wore in the very cold climate!  If you decide to go and watch all hunted and eaten by giant wolves, be sure you stay to see the secret scene after all the credits roll off the screen.  Seems there could be a sequel after all, since maybe one of them actually survived the ordeal!  It there is a sequel, I will certainly wait for it to hit the dollar movie or the dollar Redbox rental for fear it would be as sorry a movie as this one was! .........  You would think they would be required to provide free popcorn and drinks for all who sit through this movie so you might come close to getting your money's worth!  Sorry Liam!  I've seen you in some good movies but this is certainly not one of them!",
      "total_reactions": 5,
      "user": "AlaMovieNut"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "This movie started out seeming like it could actually take you somewhere. That instantly turned out to not be true. This movie had absolutely not story line or plot, it was just people running away from unrealistic wolves with no real goal in mind besides to keep running. The script for this movie could easy be fit on three pages. Other issues was there was no getting to know characters and the movie had no build but with a terrible ending.",
      "total_reactions": 6,
      "user": "wilson2020"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "I don't care that the wolves were unbelievable, but I can see how people might have wanted something more authentic given the \"grounded in reality\" feel from the beginning. I take issue with the time devoted to showing Nesson's poetic, self loathing suicidal inner monologues. I swear there's 20 minutes of the same shot of -him in bed, then starring at the damn suicide note, then starring at a wolf- about 4 times in the movie. The ending is letdown, I'm sure the people making the movie thought it was epic, but he's fighting against wolves, not the English Army.",
      "total_reactions": 6,
      "user": "wheelzr"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Absolutely no credibility...in a movie that was supposed to be realistic. Everyone in the theater left stunned at the abrupt end, but happy it was over. I can't even light my fireplace, yet these arctic plane-wreck victims had ever-ready tiki torches and found perfectly cut wood for \"spears\" at their disposal. One jumped over a river ravine into a tree on the opposite bank to string a line  for the rest to shimmy across. They're in a blizzard, and then the sun's out an all of them are fine. Liam 's drenched in a river and soon after appears dry, let alone not frozen! And, why would they ever leave the plane to walk the vast wilderness of Alaska like needles in a huge haystack. Hunker down boys, build a little hut so those wolves don't get you, pile up the bodies and eat them if need be. Seems more prudent. Remember you had all that jet fuel so easily accessible (another ridiculous moment) at the crash site to help heat, eat and keep those wolves at bay. After all, the wolves were EVERYWHERE in the end. A lot ventured, nothing gained... on the screen and for viewers. PLEASE...just ridiculous in every respect!â",
      "total_reactions": 6,
      "user": "nanasays"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Nothwithstanding its attempts to manifest itself atypically from others before it, \"The Grey\" simply relies too heavily on the shallow shoulders of its \"spear-carriers,\" whose only raison d' etre is to dispense egregiously daft and ribald prattling upon barren expressions, while the camera spotlights Neeson and mewls for support. What one experiences is a cinematographic waste of astounding, achromatic transcendental visuals, hampered by the dragging sense of directorial indecisiveness and subpar writing. Aside from Neeson's valiant efforts to egress from his enslaved character, the film enthralls with its surprisingly fresh metaphysical overtones, and adhesive tie-ins toward the latter-half. As a result, \"The Grey\" is a brimmingly stern philosophical survival thriller, laden with sporadic moments of jocosity and adrenaline, yet suppressed with a taste of dissatisfied chagrin.",
      "total_reactions": 7,
      "user": "FDT44"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "When the wolves had a 'personal vendetta' against the survivors i knew this was going to be one of those movies. They should have suspended all belief and make them vampire wolves.",
      "total_reactions": 7,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "The Grey was absolutely not entertaining.  Someone owes me two hours of my life back....because this movie sucked.  The only good part was when the guys jumped off the cliff into the trees.  As I'm writing this I feel as though there's something missing.....oh, yea....a good movie....because this just wasn't it.",
      "total_reactions": 7,
      "user": "averagejoe"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Dark and depressing movie with no redemptive value. Focuses on suicide and hopelessness with no answers forthcoming. I have no idea why they made this movie. The folks in the audience where I saw the movie couldn't wait to leave when the movie ended. I never saw an audience clear out so quickly. This movie makes you want to relate to the wolves rather then the trespassing humans who argue and stumble to their grisly deaths. Only good aspect is the nice scenery...",
      "total_reactions": 7,
      "user": "moviemavin"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "This movie had absolutely no redeeming qualities.  I would say the fact that the movie ended would have risen my rating to a 1.  However the ending was so terrible that a point had to be negated.  I debated farting in the theater and walking out, but stuck through to the end only to endure the utter disappointment.",
      "total_reactions": 8,
      "user": "bushkill"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "Terrible. How can any filmmaker present this to an audience ? I knew after 15 seconds that this would be a sucker, the initial fight in the bar was so badly acted, you knew it could get only worse. I know nothing about wolves, but I know that wolves ALWAYS attack in packs, so the initial scene where he kills a lone wolf is absolutely ridiculous. The entire plane crash was completely out of this world: how could he just walk away without even a scratch ? In addition, do producers never learn that reflective moments should be used extremely sparse, if at all ? Because they put you asleep...",
      "total_reactions": 5,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Great survival movie and Liam Neeson gives brilliant performance. Gritty and tough to watch in places but has a great message about what drives people to survive in bad situations. About keeping memories of those we love with us no matter what. However if you don't want to read too much into the movie there are lots of tense scenes to keep you entertained.",
      "total_reactions": 2,
      "user": "allystew"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This was an amazing movie!  Every character played their part admirably, and watching them as they struggled together and interacted with each other really made me care for these characters.  Some people may complain about the lack of a plot, but what they're missing is that this movie is about survival - finding a way out of that frozen hell and escaping the wolves.  I cried some serious manly tears at the end.  My only complaint is that the wolves seemed somewhat fake at times, but if you can suspend your disbelief for those short periods, get ready for an amazing ride.",
      "total_reactions": 1,
      "user": "CaptainPJShark"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "Extremely disappointed with this movie. Very few times do I feel the urge to write a review. There were a lot of inconsistencies with the plot. Jumping into a tree? COME ON!  A lot of build up in this movie to a weak ending. I was deceived into thinking this was \"Taken\" with wolves. I didn't relate with any of the characters in the movie and was glad as the wolves picked them off one by one. Also I find it hard to believe that a band of rednecks couldn't find any weapons or defend themselves. Even Sarah Palin kills wolves. A movie like this does not make me shed a tear about wolf conservation. A classic survival film with a satisfying ending would be, \" The Edge\". Anthony Hopkins and Alec Baldwin survive and KILL A GRIZZLY! Come on Neeson! The Grey made me want to chokeslam a wolf, but then I thought about how humans bred the wolf to make the chihuahua breed and that made me smile.",
      "total_reactions": 8,
      "user": "Geritol961"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "The Grey is a movie like nothing I've ever seen before.  It's gritty and dark and the movie portrays the overall dismal tone very well through: character conversations, setting, and suspense.  The movie is very well done, with only the blemish being the CGI wolves that seem to feel cheap.  Other than that, the movie is great.  Dialog conveys most of the story, although what is told is short and vague, it manages to give you an overarching background to the characters that is mostly complete.  The movie does a really good job of pulling you in and keeping your interest until the conclusion.  The characters were somewhat stereotypical, but not over-the-top.  The language was controlled and wasn't overdone, and I didn't feel like their was random expletives added for laughs.  The survival aspect was very cool, and Liam Neeson's character is Oscar-worthy.  This movie deserves to be nominated as best movie, best character, and best sound design.  Although, it wouldn't be nominated for best CGI; it wasn't the worst I have seen.  Overall, a great story with spotty CGI and amazing setting.  The setup to the final scene is perfect, and the way the movie ends (maybe will disappoint some), was just perfect in my opinion.  First movie to WOW me in 2012.",
      "total_reactions": 1,
      "user": "Billyheel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Acting: 10- Neeson was at his best. One of the finest performances of his career. Story: 10- I was on the edge the whole movie. This movie is not a Taken. It is a methodical story about humans surviving for nothing other than just to survive. Very deep, dark, and haunting. Cinematography: 10- This movie is well shot. The plane sequence is one of the best. I honestly loved the scenes of the Alaskan wilderness. If you are a movie buff or enjoy Neeson's great acting. This is a movie to see ASAP.",
      "total_reactions": 2,
      "user": "IIIAchillesIII"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "This movie is the wolf version of Jaws. The wolves were unrealistic which is the biggest flaw in the movie but the film is so tense and feels so powerful that it was worth the watch. The acting was amazing and the cinematography was stellar as well. Overall, get ready for the most intense movie in years.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "From the trailer, this movie puts itself out there as a man vs. beast thriller. However, when watching this movie at least to me, it felt like it was a strict character study of men and the challenges that a man faces not only against something natural, but mainly emotional. Liam Neeson does a fantastic job but I felt like he was trying for his Will Smith \"I am Legend\" moment. I mean you were Qui-Gon Ginn and in Schindler's, a little less acting and more raw emotion would have sufficed. With that being said, the visuals and sets were great. Actions sequences were well done and at points you almost forgot how you were sitting in a theater.",
      "total_reactions": 1,
      "user": "Olidegu2012"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Easily one of the most depressing films I have seen for a long time .Neeson does what Neeson does best-stoic and heroic - and the Wolves do what they do best .Cinematography is good(not difficult given the landscape).Wolves 1 Neeson 0.",
      "total_reactions": 8,
      "user": "stroudy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "A lot of potential to be better, but a solid movie overall. Great Performance by Liam Neeson. The plot & dramatic scenes definitely pull at the heart. My only criticism was the movie did seem to drag on a little longer and the unnatural feeling of the wolves, took away from how good this movie could have been.",
      "total_reactions": 1,
      "user": "JL082"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Although the story has been told by many movie makers, this rendition is SO superbly filmed and acted, it would stand up to any that went before it. The similarity to most of its predecessors ends, however, at the richness and depth of its dialog. Great effort by the cast and crew!",
      "total_reactions": 1,
      "user": "OnTrust"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I'm curious why the wolf \"experts\" went to see this movie in the first place. Hadn't they seen the trailer in which Neeson is shown taping a knife and small broken bottles to his hands in preparation for hand-to-paw combat with a wolf? Wasn't that enough of a clue to indicate that, er, it's a movie? You know, the type of mass media where entertainment usually takes precedent over fact? Not for a minute did I believe what I was seeing was an accurate representation of wolf behavior, nor did I leave the theater hating wolves. On the contrary, I left the theater feeling highly entertained, and with a heightened curiosity about natural wolf behavior. Subsequently I learned that although there are recorded incidents of wolves attacking humans, they are negligible. Wolves are naturally shy of humans. But I didn't go to the theater thinking I was about to see a National Geographic special either. Neeson was terrific playing a very sympathetic character trying to deal with the great sadness in his life. The slow unraveling of the truth behind his deep sadness is one of the strengths of the movie. But what I loved best about this movie was the fact that it did not turn out to be the kind of macho guys' movie the trailer led you to believe. There are some very moving scenes in the movie. Neeson helping a victim of the plane crash deal with the inevitable result of his horrific injuries was for me was quite moving. And the plane crash itself was all too realistic. Yeah, it was pretty riveting. And you'll be surprised to learn of the significance of the scene in which Neeson faces off with the wolf. Finally, don't stay for the extra scene you get after the credits roll. That extra scene, which lasts only several-seconds, is an unnecessary smear on a perfectly finished movie canvas.",
      "total_reactions": 2,
      "user": "KnowNothing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "A movie where you feel completely entertained the whole time and actually feel for the characters sounds like a pretty good one to me. the landscape shots and tenseness you feel throughout made it worth the price of admission.",
      "total_reactions": 1,
      "user": "billyspleen13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Liam Neeson's Best Movie.... Cinematography is Some of the Best in Any Movie to Date.... Stay to the Very End After the Credits.... for Extra Footage.",
      "total_reactions": 1,
      "user": "ec90004"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Liam Neeson may be the oldest white actor capable of playing the tough guy without being the old tough guy. Throughout The Grey he does what he can to lead plane crash survivors through the frozen tundra of Alaska, and no one questions his age. Director Joe Carnahan takes the audience into a bleak lifestyle amid the Alaskan pipeline. Ottway (Neeson) makes it through with flashbacks of his wife and a chilling voice over. The crash is shown from within the plane and avoids many of the common theatrics. No one is clearly shown being sucked out. For that matter most of the visual effects cast a less than ideal lighting circumstance, which drives home the motif. Injuries, freezing winds, and a lack of food are enough foes for any survivors, but our heroes are being pursued by wolfs. I'm not suggesting that it's impossible, but the behavior of these creatures puts on quite the show. They've certainly seen Halloween. Credulity is also being pushed to limits when the standards line such as \"who made you the leader\" have to be muttered and one hothead fancies a brawl. Of course Neeson's dominance of the narrative makes him a safe bet, and his buddies a risk. As the film wears on I wanted to buy these blokes more time. Despite how simple the premise I'm sure I could have been entertained for 3 hours. Maybe if the other guys had more spotlight scenes they wouldn't feel so much like Ottway's human shields. The story is simple enough that a big reveal at the end is somehow more effective for the sake that no one was waiting for it. This isn't mystery. What The Grey manages to do with the underexplored is leave the viewer with less question and more statements. The Grey is a man's movie. Fatigue and despair translate with the same forceful impact of the physical blows the survivors endure. It's also a perfect example as to why one should wait for the monk's reward at the end of the credits.",
      "total_reactions": 1,
      "user": "WanderingShadow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "a very dissapointing story of survival..its dissapointing to the sense that for less than 2 hours of watching it is pointless though good acting for Liam Neeson...depressing movie",
      "total_reactions": 1,
      "user": "zidroj2008"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is brilliant. I want to get that statement out of the way because it is, quite simply, the most succinct way to say it.  This film is intense, poetic, harsh, and gritty. It deals with beautiful themes in a very thoughtful and sensitive way - faith, death, despair, love. I have seen it twice and it moved me even more the second time. The soundtrack underlines the story in a heartfelt and beautiful way - kudos to Marc Streitenfeld.  Liam Neeson's acting is at an all-time high. Most people appreciate the genius behind this man's acting but here he takes it to a new level. Cannot recommend this movie highly enough.",
      "total_reactions": 1,
      "user": "samooh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "My best friend, my girlfriend, and myself all came to see this together.  Luckily for us, we were in an empty theater, so we got to talk and jab at each other like the jerks that we are.  While we did occasionally giggle at each other about certain silly things in the movie (\"Suddenly, wolves!\" chomp), I myself did actually find myself immersed in the suspense of the movie.  There are, as is expected, a few jump scares here and there, but thankfully, there are also some subtle scares as well.  As an example, a wolf may just jump out from off camera and make a loud noise and attack, or the the camera may slowly pan to reveal that a wolf stalking close behind a character, just before he attacks.  While it is pretty plain to see that the behavior of the wolves is pretty unrealistic, I don't think it really HAS to be 100%, because at its core, that is not what the movie is about.  These wolves don't act like real ones, they're more like large monsters (I am reminded of the Worgs from Lord of the Rings).  These wolves act as the \"slasher villain\" for the movie.  The movie is mostly about the death, in itself.  Nearly all the characters  (other than the few nameless slasher victims) do in some way have a revelation about dying, and dealing with their or their friends inevitable deaths.  The movie is told from Liam Neeson's perspective, and so you feel how he is feeling the most.  I really did enjoy this movie, and unlike most people I've heard from, I enjoyed the ending a lot.  It's the only one that makes sense, really (unless you actually want a scene of Neeson fist fighting a wolf like it was straight out of Taken).  Anything else might have come off as silly.  And as a side note, Neeson's on-and-off Irish accent got a little distracting (for the first ten minutes I wondered if he even had one).",
      "total_reactions": 1,
      "user": "Mezurya"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "Very boring in addition to a poorly written script were the characters make a series of incredibly stupid decisions. The atheistic underpinnings only served to further detract from the film.",
      "total_reactions": 2,
      "user": "Jectos"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I thought the movie was terrible. The first scene is a bar and everyone is fighting seems to me that this crew is supposed to be full of people who know how to handle themselves. When these wolves attack no doubt they are outnumbered most of the time. BUt who walks farther into the darkness to take a pis right after seeing fifteen wolves wanting to kill you. And then when getting attacked does not even make a sound to let people know he needs some help. This movie was more disappointing the more I watched. My recommendation go see the vow.",
      "total_reactions": 1,
      "user": "jj7878"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Ottway (Liam Neeson) lingers in the frozen wilderness that are the oil fields of Northern Alaska. He protects the workers from the dangers that present themselves. Beneath the solid exterior of Ottway's demeanor lies a man that is lost: his wife is no longer in his life, he sees no good in what he does for the world, he sees no purpose left. He has only a day left until he flies back to Anchorage.",
      "total_reactions": 1,
      "user": "nevermindpopfil"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is just amazing!!! I went to watch it thinking it would be a popcorn thriller, but from the beginning of the movie my perspective changed. It has beautiful photography, and a good story. It also has all the essentials of a thriller. It ends with something unexpected and makes you feel good about it.",
      "total_reactions": 1,
      "user": "Gonzalol3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Thank God my advance screening tickets were free.. this was SUCH a stinker. Those animatronic wolves with eyelights blinking on in the darkness, slathering and snarling in anticipation of human flesh but never hanging around to eat it, and the dumb victim humans wandering off from the crash site to who-knows-where, yet with a ready supply of dry timber to burn at every pause. I would love to hear what a wolf behaviorist has to say about this film. Except for perhaps the crash sequence, probably the most unrealistic and sappiest psychological script I've experienced in a long, long time.",
      "total_reactions": 2,
      "user": "oohl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "First off, I see Liam Neeson as a total badass. Taken and Unknown really hit it off for him as an actor if you ask me. After hearing that he'd be fighting wolves with broken glass bottles, I was definitely on board. I sat down in the theater and was prepared to see this action take place. So it starts off with him in his character as John Ottway, his job? Killing wolves with a high powered rifle to protect the workers of an oil drilling team. Some self narration involved I was taken, shushing my friends in order to pay attention. After a short while, it shows him penning a note to his wife and then shortly after putting his rifle to his mouth and almost pulls the trigger then hears a wolf howl in the background. I guess this was the jump start he needed that stops him. Upon completion of his job, him and another crew are packing up on a little plane to go home. As most could guess, this flight can't withstand the weather and goes down, leaving John and a small group of men stranded in the middle of nowhere, Alaska. As they regroup, what seems like the longest time they spend near the plane's remnants, making fires and collecting the dead's wallets as memorials to bring home if they ever made it to society. As the embark on their journey, they start to die one by one, some more honorable and sad than others as the wolves pick them off. Finally we get down to the nitty gritty of the movie and we wonder what could possibly happen, well...that's what the movie leaves you off with, even a little scene that takes place after the credits just leaves you with a bunch of thoughts of what could've happened. A great movie for topic choice, and plenty that left me wondering if Bear Grylls would've done the same, they just forgot to drink their own piss. Plenty of action and drama to be called a Liam Neeson film.  An 8 out of 10.",
      "total_reactions": 1,
      "user": "JeffieD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "A depressing essay about a man's Dark (grey) Night of Soul - from which he never emerges.    Riddled with mind numbing inconsistencies:",
      "total_reactions": 1,
      "user": "jcalberta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Now this movie was really cool. Stranded in the wilderness and trying to stay alive. The wolves thing was interesting but did take away from some of the realism on the viewer's side but it didn't really feel too over the top. Look at it as if you were in the wild alone and felt a pack of wolves was after you. You'd probably exaggerate their ferocity too. But overall great movie. See it when you get the chance on dvd or if it's still around in theaters near you.",
      "total_reactions": 1,
      "user": "theoffice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "A rather depressing movie. More of a rant at God than anything else in my opinion. I think the message that it was trying to deliver shot itself in its foot. It portrayed a group of men, thrown into a terrible and life threatening situation, with the odds stacked against them (throw a couple of super, mutated wolves into the mix ^^). Each one of these seven plain crash survivors die horrific and brutal deaths...nature was truly unforgiving to them. The suffering these characters endured can well be related to what people experience everyday, but can be dealt with differently, and this I think is where the movie fails miserably. Liam Neeson's character comes to the conclusion that because God doesn't help him in his horrible situation, therefore God doesn't exist and life, suffering, and ultimate death is all meaningless. From humanities limited and finite understanding, this is a reasonable evaluation and mindset BUT on the other hand, very juvenile and naive as humanity does not have all the answers. In light of the latter point, selling God short as portrayed in this movie was ignorant and cheap shot in the philosophical ring. What is suffering in a finite period of time, compared to ETERNAL joy and happiness? It is but a mere flicker in time. The two cannot be compared, especially over a divine plan. Perhaps Liam Neeson's character should have pulled the trigger in the beginning. It would have saved me from watching the most depressing movie ever made.",
      "total_reactions": 2,
      "user": "Gonejackal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "Weird movie, and by weird i mean a movie that make no freaking sense at all no matter how you slice it, the wolves are completely unnatural and have superpowers",
      "total_reactions": 1,
      "user": "vence"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Good flick. I wasn't really expecting what I got.... and I'm totally okay with that. This was a thinking man's action movie. It provided more than enough suspense and also had moments of great insight. The cinematography alone was worth price of admission (check it out on netflix). Overall, A very pleasant surprise.",
      "total_reactions": 0,
      "user": "cables"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "This is a darkly told and darkly shot story about the fate of survivors of an air crash in Alsaka hunted by wolves. Only one of them is an expert at wolves and hunting (LIam Neeson, of course) so he becomes the alpha male, after putting down all challenges. Yep it's a metaphor, and it predicts the ending. He's  suicidal and depressed, and recently widowered, but the survival trek gives him a goal. The wolf attacks are often lighning fast and full of ear splitting growling and snarling which serve to keep the audience awake. The director teases by making the attacks occur randomly and unpredicably, and for a change the ending is unpredictable (although I did predict accurately the 2 last survivors, I couldn't rest on my laurels). If you want to enjoy the movie don't ask yourself if the wolves behavior is accurate.",
      "total_reactions": 0,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "People trying to escape from a pack of wolves through extreme weather conditions are great ingredients for a nailbiting thriller and produce surpisingly beautiful cinematography.  117 minutes of people being chased by a pack of wolves in extreme difficult weather conditions give plenty of time for the suspense to wear off and become fed up with the cinematography.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Good movie, the wolves created a good deal of suspense. A real survival story that borders on the super-natural. I would of stayed with the plane though. The could of forged weapons from the debris of the plane.",
      "total_reactions": 0,
      "user": "phillyjeff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "A fantastic movie about man's will and fight to survive. The acting is top notch and believable, the characters are fleshed out, and the cast is fantastic. The story is grim from the very beginning, and your introduced to Neeson's character who is an extremely depressed man. Honestly that's all I want to say as I don't want to spoil anything, I do however want to recommend you watching this. I do have complaints, at times it's slightly predictable, and do to my religious views I'm not cool with the main character openly cursing God, and how the movie predicts God as not being there, but again that is just do to my religious views, and I honestly can't say that if I had been through what he had been through I wouldn't have done the exact same thing. But I still highly enjoyed the movie and do recommend. It's truly outstanding and unlike anything I've ever watched before.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The Grey is an interesting survival film about a group of oil drillers crash landing in the mountains. People familiar with Alien, The Descent or The Edge will know how situations play out. Lian Neeson is great as always and there is extra kudos for a more tangible emotional feel than most 'monster' movies. But that ending... Talk about leaving unsatisfied!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "While the first fifteen minutes of this grim tale are adequate, the film quickly",
      "total_reactions": 0,
      "user": "Benarden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Rotten Tomatoes said that The Grey is an exciting tale of survival, populated with fleshed-out characters and a surprising philosophical agenda. But I don't think so or survival thing is not my agenda?",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "While the plot development and dialogue can be cheesy at times, Liam Neeson does the best acting I've ever seen out of it.  I don't have any preference with Neeson; I've liked him in some movies and....well Taken 3 exists, guys.  Come on now.",
      "total_reactions": 0,
      "user": "Metalsand"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "If this plane had crashed in Finland, they'd have had five bars on every cell phone, and been surrounded by reindeer.  It's all about location, location, location!  Liam's his charming/gritty/quiet tough guy self leading a batch of plane crash survivors onward... The \"keep moving\" philosophy always seems like a good idea even if it doesn't play out that way.  Scary wolves. Beautiful scenery. And enough substance to fuel a variety of post movie conversations about what you would do in similar circumstances.",
      "total_reactions": 0,
      "user": "hollyv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Congratulations for creating a film which demonised an animal that is already been persecuted. Pricks...",
      "total_reactions": 0,
      "user": "TheReaper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "rolled my eyes a few times.  it actually hurt, i rolled them really hard.  started talking about god and stuff.   ehh....no real deep powerful insights on that front.  i'd prefer if the dialogue hadn't ventured into its shallow metaphysical depths.  lots of cliches.",
      "total_reactions": 0,
      "user": "ZenRobot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "The grey is a film that may have gone over the heads of most people that watched it.  Particularly when you look at the completely silly reviews that refer to the wolves behavior as being \"unrealistic.\"  Well you couldn't have missed the point of the film harder if you tried.  The Grey is a metaphor, how men deal with that shattering loss of others and themselves.  How death is unfair, how it can come without any warning, and how even a strong willed person eventually succumbs to it no matter what they do to fight it off.  The men in the story are all powerful characters who struggle to survive and live, its not about barbaric serial killer-like wolves in a frozen tundra wasteland hell hole chasing them down one by one.  The wolves are symbolic.  Each man faced a different death and their is some theories that suggest that they all died in the plane crash, which suggests that they were in a kind of purgatory as well.  It is one of those films that really makes you wonder and even ask yourself:  \"Why?\"  Its a painful film, full of merciless deaths, some men are able to come to terms with their end, while others have their lives stolen away by the elements almost without meaning or reason.  Even the main character, a man with the strongest will amongst all of them can't save the men under his command or himself from inevitable death.  It is a bleak film, with wonderful cinematography, brutally violent imagery, wonderful performances, and yet a real message embedded within its ambiguous ending sequence.  You can fight death with every last strength in your body, but eventually it will win.  I feel that it was a film most audiences had trouble relating to, understanding, and perhaps it may have not appealed as a philosophical piece simply because of its morbid content alone.  In years to come, I hope its revisited and given its proper place as one of the best films of this decade.",
      "total_reactions": 0,
      "user": "llamayarmybar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "The grey is a powerful, gut wrenching examination of existence. If the images weren't so tantalising the themes wouldn't be so affecting. The film constantly thrills drawing you away from certain of it's flaws.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "This is a movie worth watching ... but don't spend the time and money at the movies. Once it is out for home consumption, and you haven't got anything else driving you crazy to watch, then this will be worth your time. The story is good, although a little disappointing at the very end. It is in some ways a fatalistic movie, but manages to inspire you as well. See it, but when the time is right.",
      "total_reactions": 0,
      "user": "shimano6000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Spoilers.",
      "total_reactions": 0,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "I believe The Grey was actually a really good film and that the critics were a little to harsh.",
      "total_reactions": 0,
      "user": "silentshade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Simply awesome.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Liam Neeson's performance is decent. The plot of the movie in the long run becomes repetitive and the film loses entertainment, but a sufficient movie that shows the more sensitive side of humanity.",
      "total_reactions": 0,
      "user": "rydermusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Slightly different than his usual role of delivering much pain to random dudes, Liam Neeson's portrayal of Bear Grllys on Winter Man vs Wild is awkwardly commendable. Creating improvised armaments and battling harsh terrain without resorting to consume his own bodily fluid prove to be quite a challenge even for the seasoned veteran. Yes, this is a joke, I just need something to keep you interested. The Grey is actually a story about plane crash survivor trying to escape cruel whip of mother nature.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "The Grey may have only been an average movie if it weren't for the amazing performance of Liam Neeson.  This was probably his best role since Schindler's List, it was that good.  Overall the movie has good intensity, and it lets the viewer connect with the other characters.  Technically, the movie has some great editing, sound effects, and cinematography.  My biggest complaint is the design of the wolves, which looked pretty fake and way to big.  But overall, Liam Neeson carries this movie and he does it in a good way.",
      "total_reactions": 0,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "This is true alpha male wolf pack film...Testosterone adrenaline all over the place. About survival of fittest. Liam Nesson takes control and is in control as the leading man as usual. This has Mens Only Club sign.",
      "total_reactions": 0,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "My very first film of 2012 starts with this snow wilderness wolf-grapple thriller in the local multiplex, which stars the career-rebooting matinÃ©e action idol Liam Neeson (who has established a singularly bankable esteem in the genre which used to be Harrison Fordâ",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Angels:  I know nothing about wolves. Therefore, it did not matter to me whether their behavior  was realistic or not.  My sweetheart and I decided not to see 'the Woman in Black' too much wasted angst, dread, & apprehension.  But, as my sweetheart said we ended up seeing a horror movie with wolves! However,  the angst, dread and apprehension were not wasted. (Sweetheart put her hands over her eyes when she anticipated something nasty. She had her hands over her eyes a lot. )  The wolves were like hounds of the Baskervilles-scary. I love Liam, the voice of Aslan.  He has a warmth, and rugged honesty about him, and the soft, purring voice of the benign God.  This may be Liam's defining role as an older actor.  It may be for Liam what the Book of Eli is for Denzel. The movie was exciting.  Liam owned it, but the other actors were good.  I felt the bone chilling cold, the exhaustion, the hunger, the terror,  the hopelessness, and the absolute inscrutability of the Almighty. Yes, there was a spiritual/existential aspect to the movie.  But what was strongest to me (beside the wolf horror) was the beauty of human relationship, the sustaining warmth of memories of love and loved ones. The characters that you liked most held their loved ones ever-present in their hearts.  And Liam's memories were so tender; his emotion so genuine. My sweetheart said that maybe his acting was informed by his own life.  I won't say any more. Angels sing softly to me.",
      "total_reactions": 0,
      "user": "sesostris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "A great performance from Liam Neeson. However that isn't enough to make up for a lot of loose ends and pitfalls in the film. I love the story idea and in many parts it really got your heart pumping. There are parts where it seems the effects department was under a strict budget and had to make cut backs. Parts also left you thinking why didn't they/he do something else. Finally to the ending which i personally saw happening early on but didn't want to happen. I got to the last fight then just ended before anything happened. I understand why they ended it there and it wasn't a bad choice but i would have preferred to see the final fight and what ever happened then this ending.",
      "total_reactions": 0,
      "user": "dts7714"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Intense and sad. A dog gets eaten. Liam Neeson is great, as usual, and, like most movies nowadays, he's in it. Joe Carnahan's best film since \"The A-Team.\"",
      "total_reactions": 0,
      "user": "JLLoren"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "I'm struggling with this movie. I wanted to like it, I really do, but there were so many reasons not to. I should begin with the good stuff though. Liam Neeson, like usual, is one bad ass human being. I can't think of a movie where he has failed to disappoint. It seems like he is one of the few actors in Hollywood that actually cares about acting and cares about his fans. But my love for Liam Neeson can only go so far in a movie like 'The Grey'. There were some scenes where I was gripping my seat and wanted more, but my wish never came true. The wolves were impeccable, though. You might feel a connection with the overall meaning of the film, but it simply was not enough. The movie was way too long. Two hours was definitely unnecessary for a film like this one. I was sitting in my seat wondering when it was going to be over and then when it ended, I was still upset.  There were little stories within the bigger picture, but once the movie ended, you realized it was just filler and the writers couldn't think of anything else. The audio was really annoying. Yes, we get it. Just because they are walking through a blizzard, doesn't mean you can crank the wind sound. Oh and when you transition between loud noises to silence, it's best to actually transition and not cut.",
      "total_reactions": 0,
      "user": "chrisv39"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "It wasnt bad but its wasnt good either. It was pretty bland. And if you actually notice, most movies that liam neeson acts in are normally consist a simple plot and he ends up dead. although he is quite an admirable actor, and he does fairly well here, its not enough to save this movie. the ending was wayward disappointing as it was building up to the climax very well. i expected more from it and somehow it falls short.",
      "total_reactions": 0,
      "user": "Boozerx7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Okay, some action scenes make no sense and a few plot developments  will leave you scratching your head. Nothing major. The rest of the film is awesome. A truly beautiful film, with an outstanding performance by Mr Neeson. Its one to watch. It can work as a great action film, or with its heart a great date film. You need to see this film for a lot of reasons, but they are better to be seen rather than written. Great job all round on this film. Must see.",
      "total_reactions": 0,
      "user": "TruAlbino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "This movie is quite misunderstood i believe. The producer sent a message in yhe movie which wasn't neccesarily what viewers were looking for. The movie overall was fantastic and kept me on the edge of my seat jumping constantly. One of my favorite things of the movie is the wolfpack. People complain they were unrealistic however i read before watching this that they were based on a legend of a siberian superpack. You have to stay till the ends of the credits or you will be furious with the end. This movie wasn't perfect but it was still amazing!",
      "total_reactions": 0,
      "user": "Unbiased26"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "The Grey is, to my mind, the best film to be released in 2012 thus far. It was incredibly forceful and had a high degree of profundity that I wasn't expecting from it. The ever-reliable Liam Neeson is fine as Ottaway, the disenchanted protagonist whom purges himself of suicidal contemplation after he and a motley group of oil workers fine themselves stranded in the Alaskan wilderness after a airplane crash. After initial worry about hypothermia and the scarcity of food pervades the group of survivors, these qualms are hastily superseded by a much more malignant force- that of a pack of marauding wolves. What follows is a suspenseful, emotional and poignant story that is essentially a mediation on mortality and the extent man will go to in order to survive against all odds. Taut direction and a highly effective score further benefit The Grey, a truly excellent film.",
      "total_reactions": 0,
      "user": "JacobDunstan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "An average to below average movie. Where to start, I love Liam Neeson's acting and he has been quite badass in most films he's in. The disappointing thing about The Grey is that he threatens to be badass and then quite simply isn't. sure he threatens a guy and stabs one wolf while it is trying to shred someone up but honestly disappointing. It really didn't go anywhere story wise for mine, I left thinking \"this movie was pointless\", the person I went with shared this thought. Don't get me started on some of the silly and sometimes totally avoidable deaths. For a movie that is supposedly about people being hunted by wolves there is too much fudging about and not enough wolves trying to kill people, in summary I thought it was quite boring and also completely pointless, the acting however was good, let down by a poor script that went nowhere.",
      "total_reactions": 0,
      "user": "Johnny123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Fate made it so I went with my family to see The Grey and was I surprised?  Yes I was.  I donâ",
      "total_reactions": 0,
      "user": "ctaman101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Impeccably acted with absolutely breathtaking cinematography, The Grey is a haunting, exhilarating and unforgettable thriller with a lot more substance than one might expect.",
      "total_reactions": 0,
      "user": "DavidT_Williams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Intense and thrilling, The Grey rounds out to be one of the more surprising films. Portrayed as a straight up man vs. wild survival epic, it turns to a more thoughtful and philosophical film unto showing how people face the closeness of death at every moment. Fits to be a good movie to see if you want to think and be thrilled at the same time.",
      "total_reactions": 0,
      "user": "racketracer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "This is not the best work of Liam Neeson, i was expecting more of this one. It taste like cliche to me, but the fight between the characters and the wolfs is very impressive.",
      "total_reactions": 0,
      "user": "GabrielaRodB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "After the plane crash you can turn the movie off because besides that the movie is not at all what you expect it to be. Its more about these guys battling themselves more than the wolves or really cool winter settings. Its tries to be too clever, with dumb flashbacks and epic monologues of Liam talking about crap you could care less about. Too many night scenes and unlikeable characters outside of Liam Neison who even still grow sick of with his macho leadership skills. Definitely hoped for a great action flick in the snowy tundra but ended up with great plane crash, terrible wolves, and a movie that thought it was a deeper than it really was.",
      "total_reactions": 0,
      "user": "SeanMcGunnigle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "It's an entertaining and thoughtful movie. Not great but certainly interesting enough to see. There are some quibbles: i found the wolf attacks to be too quick: their shockingness because of the surprise vs emphasizing the actual terror of something biting into you...which i think would have been a stronger choice; the cinematography is good but the blurriness, and grainy quality got in the way of the movie. I suspect budget may have forced their hand on these... Neesson carries the movie and the other roles are well done; the conclusion nicely ties the narrative arc with the repeated references of his wife, his Dad's poem and his own desires/fears...that made me find this to be a very powerful experience.",
      "total_reactions": 0,
      "user": "DougStewart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "No one wants to die, well I suppose there are those few, but most do not. Even more than that, there are those few ways that most would not wish to die from. These ways would include death by fire, or by a pool of acid, slow intricate torture, but one in particular is death by slow painful ripping and tearing of your own flesh and bones. The fear of this is what fuels the fears and the suspense of stories about zombies, or sharks, or in The Grey's case, wolves. I wouldn't say the film is one of those niche fear films that targets those with particular phobias regarding wolves, but if you have such a phobia, good luck! I came into watching this film with average to poor expectations of the movie and left feeling quite good about it. I think both the story and the acting were well done. One thing I will note regarding the CGI, or visual effects, used to make the wolves is I think in a few years they will look rather funny and off. While watching, they already seemed overly soft and dark. They had an almost blurred look to them at times. Certain movies like, Jurassic Park, or The Thing(the original) may not look fantastic these days, but still look pretty darn good compared to the aging of computer special effects. But hey! Maybe I will be wrong, luckily either way, the CGI is not what made this film. In all, I would recommend this film to family and friends who haven't seen it yet, and I hope anyone who reads this may go out and watch it as well. For my full review, visit http://visuallyimpairedreviews.blogspot.com/2012/03/grey.html",
      "total_reactions": 0,
      "user": "KostersK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "My opinion on it is mixed.  on the one hand Liam Neeson played, well, Liam Neeson.  And he was just as brilliant as ever.  It depressing, but lets face it that was the point, and it did do it well.  The harrowing struggle came across and easily left an emotional impact.  In saying that though the deeper level of Neeson's battle with faith and the pseudo-psychological importance of the poems felt a bit tacked on and could have perhaps been integrated a bit better.  The wolves appearance was a bit weak, but I felt that that was forgiveable.  I wasn't sold on the ending, it was the only real ending that they could have had I suppose, but that wasn't enough for me to like it.  I choose to remember the ending differently, the only other possible ending for it - Obama parachutes in armed with a flame-thrower and missile launcher, deals with the wolves and hi-fives with Neeson, all done  to the theme of team america and saves the day.  That's how I chose to remember it.",
      "total_reactions": 0,
      "user": "Lutharo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "The trailer for this movie lies.  If you expect an action movie that involves Liam Neeson with broken glass on his hands fighting wolves, boy will you be pissed.  Set all that aside, and you might actually enjoy this patient, paced, thoughtful movie.  It is a drama, not action, and a reasonably enjoyable one.",
      "total_reactions": 0,
      "user": "weddingsinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "It's hard to say something bad about this movie - so well done. From the actors, to the stunt work, it all came together so well. The plot was very well paced and had a great twist. As long as you are wanting a happy ending, this is a must see!",
      "total_reactions": 0,
      "user": "LynnHardy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "This movie was really good. The story was good and Niam Neeson is still awesome. Wolfs are not as bloodthirsty or as smart as real life wolfs. If your looking for a movie to buy, buy The Grey. The Grey 7.6/10",
      "total_reactions": 0,
      "user": "watithink123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Crude oil workers in Alaska are heading home for a 2-week vacation, after working grueling shifts. On their way home, they encounter a vicious storm that brings their plane crashing down in the Alaskan tundra. 8 survivors must find their way to civilization. They are hampered by mysterious wolves. http://www.gruesomehertzoggpodcast.org/2012/04/grey-2011.html",
      "total_reactions": 0,
      "user": "Geiter68"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Survival of fittest and just flat out doing what you need to do to survive considering the circumstances.  Who not better to lead you acroos the arctic other than Liam Niessen. His rugged and gritty personality and fine faith for something better in ths world kept him alive until the end.........or did it............",
      "total_reactions": 0,
      "user": "plainbrains"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "I have to praise Ian Mackenzie Jeffers and Joe Carnahan for a terrific script as well as the latter for a fine piece of directing. I like much of his work and have seen most of what he's written and or directed in recent years; he is versatile and happily, in this movie, he has shown us he can do excellent character development work. I can hardly think of anyone better than Liam Neeson for the lead role. The premise of the movie is rather straightforward: A sharpshooter, Neeson, hired to protect roughnecks working at an oil facility in Alaska, from local wildlife, boards with them on a plane as they set off for their periodic break; a storm hits the plane hard and it crashes, killing most aboard. The remaining group of survivors attempt to make out of the tundra, with wolves at their heels.",
      "total_reactions": 0,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 2,
      "text": "Repetitive and disappointing.  Predictable.  Cliche'd horror-like-B-movie death of characters picked off one by one by pore CGI wolves.  To boot, and most unsatisfying, it was  concluded with fade-to-black anticlimactic and severely premature ending.  Not worth your time.....",
      "total_reactions": 0,
      "user": "Jimsharon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "A movie that's more about the relationship between the survivalist and the main character's spiritual problems than the means of survival. The wolves are incredibly intelligent and overwhelming. You can guess, soon the survivalist group ripped apart by the wolves (and for some, natural hazards), ultimately at the end, leaving the main character, Ottway, alone. It's the kind of movie that's not for everyone, but for some, you'll find yourselves a new poem to recite (you'll get my meaning once you watched the whole movie).",
      "total_reactions": 0,
      "user": "Calciferus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Bit too obvious outcome. The ending was revealed like 15 min into the film. Only thing that makes this movie watchable is Liam Neason. Everything that guy touches turns to gold. So it could have been allot better if the story line wasn't given in the beginning.",
      "total_reactions": 0,
      "user": "SlubbertKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "If you are looking for an epic Liam Neeson film, I don't recommend this one. I chose to give this film a 7, because it's the first time that I have seen Liam Neeson portray such a deep character (besides in Schindler's List, ofcorse). I personally enjoy Neeson's films where he plays these kinds of rolls..where we can actually see him act. Don't get me wrong, Star Wars and Taken were great movies, but in this film you get to witness Neeson taking on every day life issues that many of us face: fear of death. Neeson is tested in his strength, knowledge, and faith as he battles the bitter freezing cold in Alaska after his plane crashes. I would watch it again, but I would not pay for it again. Great movie to see if you truly love Liam Neeson.",
      "total_reactions": 0,
      "user": "critic1915"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "The film is an obvious metaphor for God's existence and whether or not these so called criminals and bad guys can get a second chance. First off it explains how this area are for only tough oil riggers, you assume that Liam Neeson's character must be one of them. Everyone else has some type of bad baggage and you are lead to think Liam Neeson must to. Then the plane crashes and the men must fight for their second chance. The wolves are the final test for these men to prove themselves worthy, in a sense. Blaintantly, it raised the question is God real? If Liam Neeson fights off these wolves, then God is real, as he gave him a second chance. If he dies, then God is not real. The movie is definite food for thought packed with action scenes and some emotionally tolling sequences.",
      "total_reactions": 0,
      "user": "KoalaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "The feel bad movie of the year. While I would never dislike a movie based on it being depressing alone, I never feel like The Grey earns the emotional punches that it throws. This film is well acted and shot very well, you may actually feel cold while watching this film there is such a strong sense of atmosphere. While I understand that the wolves are meant to mirror a lot of the themes in this film, I ultimately feel that everything they contribute could be done by simply using the elements. The reason this matters to me is because most of the havoc that the wolves are causing ring false to me and take away from the characters who need to be fleshed out much more than they ever are. In the end I think that is what keeps this movie that is trying to say a lot about life from saying much of anything at all.",
      "total_reactions": 0,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Start was good, but than- directors show that they are complete idiots, go and explore nature you **** good movie. ask hunters or people who live in farms, wolfs never do that things witch you can see in movie. i'm hunter and know that.  i was disappointed.",
      "total_reactions": 0,
      "user": "JRid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I love Liam Neeson, great movie    .",
      "total_reactions": 0,
      "user": "anothercoolguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "The best movie ever, I just loved it, Its great! Great work by Liam Neeson and i get scared by those wolves Just the best movie of all times",
      "total_reactions": 0,
      "user": "pkgadersons"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I saw Jon Stewart interview Liam Neeson for this film, and he wisely avoided talking about this terrible film. The wolves are evil cartoons, any 14 year old would know their behavior is completely unrealistic. The dialogue is written at a grade 5 level (who could possibly write such drivel?). I kept waiting for the story I had hoped for, a Jack London yarn of Alaska in winter, or a Farley Mowatt fable of men lost in the barren lands. Instead I was served a film that seems to have had no script, no plot, and no plan, and a complete disregard for the characters and the audience.",
      "total_reactions": 0,
      "user": "davidl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Really good    .",
      "total_reactions": 0,
      "user": "john24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "I expect a lot when I hear see Liam Neeson's name in a film but this film was very slow-paced and boring at some points. It couldn't gather my attention nor there were any horrifying moments when it comes to survival thrillers. Main theme was very good, like the plane crashing and being stuck in the middle of nowhere, but this film could not generate that charm.",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "While The Grey doesn't provide us with all-too-interesting characters, it does deliver filmgoers a good survival yarn filled with gripping title-referential cinematography and the chance to see Liam Neeson punch wolves. I also felt that the philosophical tones went along surprisingly well and without them The Grey wouldn't have been as distinctive (It isn't very without them, though). The film has a troubling start until the wolves arrive and it suffers from a very slow middle act. It also doesn't have characters that we like, believe, or care about, but we still hope that the idea of these men as a group could make it. On the positive side, there's Neeson, dealing out effortlessly cool machismo vibes with a hint of doggedly tired age. He is worth a glance here. Plus, as I already said, he gets to punch wolves.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Without a doubt the worst movie I've seen this year.  In this scify epic, Liam Nesson takes on a planet infested with ultra-smart superwolves while contemplating the philosophical meaning of death.  The wolves demonstrate their ability to ambush in flawless battle-line formations, make an incredible ammount of noise in the woods, repell down clifs and viciously seek human blood with historically uncharacteristic flair.  A 12 year old child with acceas to Animal Planet could point out the shockingly unrealistic portrayal of wolves here.",
      "total_reactions": 0,
      "user": "AurelTristen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "The Grey is directed by Joe Carnahan with style. This is one of the best survival films I",
      "total_reactions": 0,
      "user": "BryceHoogland"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Personally, I did not really notice nor care for what I did notice when it came to the \"philosophical\" element of this one. Truth be told, it felt like they were reaching to try and make what is a pretty typical survival drama hit home and be more profound than it truly is. Any claims to the contrary can be supported because, well, it's a survival drama. I see some reviews commenting on how this one is a study of the will to live, which to me is nonsense and is not a topic that needs to be discussed in film, if this is truly what this film is going for. No duh people want to survive, there is nothing profound to be in that topic. Hell, *SPOILER* one guy just gives up. How is that evident of the will to live? *END SPOILER* Ultimately, Liam Neeson and the rest of the cast are quite strong, the film is well shot, and well told. Throughout, it is very compelling and is a very good survival film. Sadly, the forced in \"profound\" moments that are anything but that try to hint at the film being more symbolic than it really is, do ruin the movie to an extent. Luckily, the film's intensity and well developed characters make up for it.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Oh man, was this movie depressing. But, it was fantastic. A movie about facing death, and how it can come at any moment. The movie teaches us to cherish one very important thing: Life itself.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Awsome movie, loved it but i dont get it why the wolves didnt group up and didnt attack them right away they were like some supernatural monsters who secretly killed them one by one.",
      "total_reactions": 0,
      "user": "Xgashh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "It shows exactly, exactly what is real. When Liam asked God for help, he meant that. However, nothing happened. That's exactly what happens in real. God doesn't do miracles. You have to do it yourself. That's my best part of this movie.",
      "total_reactions": 0,
      "user": "kinghridoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Not what i was expecting. The trailers for this movie hinted at 'Taken' or 'Unknown' in the wilderness, but this film is nothing like your general hollywood liam neeson action movie. Its slow, gritty, and has a decidedly 'indie' feel to it, almost meditative at times, but not as bad as a Terence Malick flick. The director Joe carnahan has a knack for making very human films out of well worn territory and this is no exception. The film starts very slowly, almost dreamlike, but follows with a very real plane crash and its aftermath, neeson and co. then have to trek through the wilderness avoiding the wolves that seem to be tracking them. The film lulls slightly here but picks up in the second half and gradually draws you in, credit to carnahan for making the situation very real and believable, with a harshness that runs right through to the end. The film has a lot of minor quibbles and is definitely not a regular mainstream watch, but caught in the right mood it has some interesting things to say and says them very well indeed.",
      "total_reactions": 0,
      "user": "Goodfella"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Much better than average. This movie is too good for anyone who gives it a low score. Get a clue of what real story, real character is about. If the wolves aren't realistic there's a reason for that, which makes everything more haunting, more freakish, more alive than in a straight action movie.",
      "total_reactions": 0,
      "user": "a-hole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Non",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was great everything was great.everyone performance was great.the story was great but i didn't understood what happened in the end so i am recommending on seeing this movie",
      "total_reactions": 0,
      "user": "idohaker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "\"The Grey\" is a 2012 movie directed by Joe Carnahan and starring Liam Neeson. The film is about a oil rigging team that tries to survive the harsh Alaskan wildlife after their plane crashes. Let me start off by saying that Joe Carnahan has been a hit or miss director for me. He usually specializes in high octane and stylized action flicks. Movies like \"The A-Team\", and \"Smokin' Aces\" look cool, but they fail to impress me on an intellectual level. Now, here we have \"The Grey\". This movie is a departure from Joe Carnahan's style. . .in a good way. This movie is toned down to a much more believable level and it has substance. A great script that has not only great dialogue and characters, but this movie's script possesses very deep philosophical and poignant moments. I walked into this film feeling that my heart strings wouldn't be threatened. This movie tugged at them up a great deal. Liam Neeson gives the best performance I've ever seen him give. I honestly thought that Neeson would be the typical badarse he's been fond of playing as of late, but his character (and all of the other as well) is so multi-dimensional, complex, and most importantly, real. The soundtrack is as touching as it is chilling. Joe Carnahan proved me wrong. This movie is a phenomenally entertaining, moving, thrilling piece of cinema. I implore everyone to go see it.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "\"The Grey\" is an absolutely fantastic film - as beautiful and poetic as it is grim and unforgiving. Liam Neeson leads a group of survivors after their plane crashes in the middle of the Alaskan wilderness, and before long they find themselves in a brutal struggle against a clan of relentless wolves. This was marketed mostly as an action survival picture, which is highly misleading - it is neither action nor survival, but rather an existential portrait. It showcases a small band of engaging and sometimes mysterious characters, and as time progresses and their numbers dwindle, the cloud of death looms ever darker above them, and they must each in their own way confront it. Their responses range from heartfelt, to tragic, to calm acceptance, and is quite the graceful psychological study. Of course, the movie's ultimate tale is of a man who goes down fighting, even though he has absolutely nothing left to fight for, and is an incredibly moving testament to how important life and existence themselves are to us, and that even in our darkest hours, there is still a darker hour before us that we might fear above all else. It's as an inspiring film as it is depressing, and a truly wonderful gem that well deserves a good long look.",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "If anyone had had tried to convince me to watch a film about a group of men fighting for survival after a plane crash in the dead of winter in Alaska while a pack of wolves were on the hunt, I would have laughed in their face. With that being said, I thought this was a really good film! Thrilling, emotional, well-written, solid performances, action, humor, tonal cinematography, The Grey delivered! Also, it was surprisingly deep and had some interesting characters. Many people will likely hate the ending, but I actually thought it was perfect.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "The grey is a decently executed survival movie which initially promises the possibility of a masterpiece with early scenes but becomes too uneven along the way.  Like many critics have said, the movie can be very poetic and introspective, and the cinematography is very pretty.  The wolf attacks start out being pretty scary.  They're brutal and fill the film with undeniable tension, but eventually they start being presented in a cleche way.  The attacks become too often, and the wolves themselves are used too much like Hollywood monsters.  This starts to compete with the higher, more artistic sensibilities in the movie instead of enhancing them.  This is also definitely one of the bleakest films I have ever seen, with a nihilistic agenda I absolutely disagree with.  However, Liam Nieson gives a great performance as always, and I can't deny that overall it's a gritty, gripping movie which is way better than most movies that come out in January.  In fact, it might be one of the best January releases ever.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The Grey was a somewhat memorable and unique movie that left me felling deflated. I found the premise (attempting to survive against all odds) and setting (a barren cold wasteland) interesting. However, the overall execution was a little underwhelming for me. I was also disappointed in the ending, even though I can understand why some people might like it. The movie succeeded in getting me to wonder how they were going to make it out of their ordeal. However, the overall tone of their struggle left me with a negative tension throughout.",
      "total_reactions": 0,
      "user": "krnology"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "The Grey is very very brutal, which makes this film a good white knuckle thriller. Liam Neeson is tremendously good and the plot is very thrilling as it thickens but the film does have some Cliches story wise. The story wasn't compelling to any other film, which is good but The Grey needed some help in story writing. Overall, this taunt thriller is good for a Friday night.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Now I was going to give this movie a 7 but I realized the ending was good and every time I think of this movie I like it more and those are good movies the ones every time you think about it it gets better so watch heck buy it on blu ray",
      "total_reactions": 0,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "absolutely loved this painfully beautiful exposition on facing fear and death. The elemental earth of wind snow and fire. The power of human society over the individual, however the acknowledgement that we are to face death alone although fortified by the few we have loved.The music is scored wonderfully appropriately adding a foreboding to the beautifully bleak vistas of Arctic Canada. Liam Neeson has the gravitas. Brought me to tears, the heroism in this film, but not mindless, hard earned and with fear.",
      "total_reactions": 0,
      "user": "Countvontrollio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Definitely not for young children. I saw this movie and I freaked out myself.  I barely got to have my eyes open. A plane crashes in the middle of Alaska right in the middle of the gray wolf's hunting zone.one by one someone got eaten. honestly i did not understand this movie because instead of going to get out of the hunting zone they walked farther into it which is more dangerous. you never know when the wolves will come so its one of those all of the sudden someone is dead.",
      "total_reactions": 0,
      "user": "Imastormtrooper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Not how I was expecting at all. I went in assuming it was another badass Liam Neeson Taken sort of movie but it was far from that. In a lot of ways it felt close to being a horror movie which to me is not at all a complaint but got me into it more. It is very well acted and the cinematography is fantastic. I really felt as if this was actually happening and these people were really in great danger. One of Liam Neesons best performances in my books. Highly recommended.",
      "total_reactions": 0,
      "user": "Longo12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "The story is really interesting and the acting is really good.There is not a lot of action but the story and the characters are really interesting and that's why we can watch it without getting bored.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "The best movie I have ever seen. At first I thought that this movie was going to be your average survivor movie, I couldn't have been more wrong. The movie's engaging plot, incredible music and fantastic dialogue complete engulf you this movie. With one of my personal favorite endings this movie leaves you thinking  but completely satisfied. In my  opinion this is truly the best movie of all time.",
      "total_reactions": 0,
      "user": "NateL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "I Have to stop reviewing these outrageously awful movies. I don't know where to start.",
      "total_reactions": 0,
      "user": "iplayandwatch"
    }
  ],
  "metascore": 64,
  "name": "The Grey",
  "num_weekends": 10,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 27,
    "month": 1,
    "year": 2012
  },
  "opening_weekend_income": 19665101,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 208974,
  "rating_freq": {
    "1": 3719,
    "10": 14938,
    "2": 2673,
    "3": 4215,
    "4": 8265,
    "5": 18110,
    "6": 40488,
    "7": 60596,
    "8": 39967,
    "9": 16003
  },
  "release_day": 27,
  "release_month": "January",
  "release_year": 2012,
  "user_review_count": 761,
  "votes_per_demo": {
    "aged_18-29": 78235,
    "aged_30-44": 81796,
    "aged_45+": 15603,
    "aged_under_18": 349,
    "females": 20884,
    "females_aged_18-29": 8861,
    "females_aged_30-44": 8729,
    "females_aged_45+": 2147,
    "females_under_18": 47,
    "imdb_staff": 9,
    "imdb_users": 208974,
    "males": 161383,
    "males_aged_18-29": 68639,
    "males_aged_30-44": 72101,
    "males_aged_45+": 13225,
    "males_under_18": 298,
    "non-us_users": 107860,
    "top_1000_voters": 557,
    "us_users": 33919
  },
  "year": 2011
}