{
  "avg_rating_per_demo": {
    "aged_18-29": 7.3,
    "aged_30-44": 6.9,
    "aged_45+": 6.9,
    "aged_under_18": 7.4,
    "females": 7.1,
    "females_aged_18-29": 7.3,
    "females_aged_30-44": 6.8,
    "females_aged_45+": 7.0,
    "females_under_18": 7.2,
    "imdb_staff": 6.7,
    "imdb_users": 7.1,
    "males": 7.0,
    "males_aged_18-29": 7.3,
    "males_aged_30-44": 6.9,
    "males_aged_45+": 6.8,
    "males_under_18": 7.6,
    "non-us_users": 7.0,
    "top_1000_voters": 5.7,
    "us_users": 6.7
  },
  "avg_screens": 1781.75,
  "budget": 6000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 28,
    "month": 9,
    "year": 2012
  },
  "critic_review_count": 214,
  "duration": 102,
  "genres": [
    "drama",
    "mystery",
    "romance"
  ],
  "gross_income": 11434867,
  "max_screens": 2801,
  "mc_avg_user_score": 6.9,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "The Words",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 51,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Amazingly, though, Brian Klugman and Lee Sternthal, cowriters and codirectors of The Words, have the audacity - and the skill sets - to pull this all off. They wrest emotional truth out of hokum. They also wrest intelligent, nuanced performances from their cast."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "The performances, excepting perhaps Olivia Wilde's odd turn, are solid, and the central story never loses our attention, but there's a lingering aftertaste of vague dissatisfaction."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "It's more or less a grown-up picture, and not bad at that, though its muted and patient style has both its merits and its drawbacks. Still, as I say: not bad."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "The Words founders on a spurious dichotomy between love and art. Which is a pity, because the movie is smart and persuasive on the casually incremental way in which plagiarism becomes an option for people like Rory - and perhaps for anyone."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "A clever, entertaining yarn that doesn't bear close scrutiny."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "A lush but fumbling literary melodrama outfitted with an attractive, generations-spanning cast and a puzzle box of three competing narratives."
    },
    {
      "critic": "Adam Litovitz",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The Words suggests that a story, whether true or not, can help get us through, if we believe it enough. Though this film can't quite pull it off, a good enough thief can get away with it."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "In the end - and every story needs one - The Words is a decent, ambitious, unoriginal film about a decent, ambitious, unoriginal writer. Both aim for greatness. Both fall short."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Ironically, the dialogue in The Words is its chief failing."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The Words aspires to depths greater than the sex we never see these two have. There's nothing for the eye to do while the ear fills with the banalities of two streams of narration, one by Dennis Quaid, the other by Jeremy Irons, all of it built around a lie."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The fatal flaw of this screenwriting term paper is that Cooper's character is a boring jerk we're supposed to regard as a nice guy who made an honest mistake."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Watching the movie, I enjoyed the settings, the periods and the acting. I can't go so far as to say I cared about the story, particularly after it became clear that its structure was too clever by half."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "The Words fails to surpass dramatically the bland lack of specificity in its title while still offering a solid roundup of performances from its talented ensemble cast."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "A literary film that stands to work best for those who don't read, The Words is a slick, superficially clever compendium of stories about authors of uncertain talent and varying success."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "Unfolds like the slow-motion dismantling of the world's most boring matryoshka."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "It's a snooze."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "Though Cooper deserves credit for pushing beyond his comfort zone, he's clearly miscast in a role better suited to a young unknown."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "It's not atrocious, but it borders on it, thanks to Dennis Quaid's annoying narration and his even more irritating portrait of the self-loathing writer whose presence bookends the two main storylines."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "For a tale of thieving, The Words plods along. Not that a literary heist is as exciting as a bank robbery, but there's a remarkable lack of tension in this story."
    },
    {
      "critic": "A. A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "The connections among the film's various plot strands are painfully obvious; by the time a grizzled Jeremy Irons saunters in, ready to dole out a comeuppance, perceptive viewers will have mentally flipped to the last page."
    },
    {
      "critic": "Ray Greene",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "The Words is a movie for people who buy their novels at Starbucks, made by people who write their novels at Starbucks."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 38,
      "summary": "A well-acted but narratively limp indie that's undermined by a failure to connect emotionally with its audience."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 33,
      "summary": "Cooper, who looks appealingly wolfish in his expensively tailored suits, plays the whole thing with a dutiful, earnest expression lacquered on his face, his eyes misting on cue at the exact same moments yours will be rolling into the back of your head."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 30,
      "summary": "Hoariest of all are the exhortations to make distinctions between \"fiction\" and \"life.\""
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 30,
      "summary": "The movie, written and directed by Brian Klugman and Lee Sternthal, is desultory when it's not inept, but the set-up is so good that you can't help sticking it out to the (unforgivable) end."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "The acting, script and direction - not to mention the syrupy score - conspire to make this a perfect storm of a hoot that will find its most appreciative audience among renters who have had a few glasses of wine beforehand."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "A nitwit story about a nitwit author who has written a nitwit novel about a nitwit author who has published a nitwit novel which, in fact, he has stolen wholecloth from another writer whose personal behavior, as fictionalized in the novel-within-the-novel-within-the-film, can charitably be described as...nitwit."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "Even the story-within-a-story structure doesn't pay off. This material needed more substance and ideas - and less flash and sumptuous production values."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "The film folds narratives on top of narratives in a vain attempt to mask the fact that there's nothing to read between its graceless lines."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 16,
      "summary": "The idiotic melodrama The Words is a maddening contradiction: a film about the publishing industry and a great literary fraud that doesn't have a literary bone in its body or a thought in its pretty, empty little head."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "My wife and I saw the \"The Words\" today.  There are no sex scenes, no fantastic chase scenes, no animation, no cutseu little kids.  None of these...just a great story, with great dialog and characters so real they came out of the screen to share the popcorn.  Bradley Cooper, Jeremy Irons, Dennis Quaid, Olivia Wilde, and Bradley Cooper, Jeremy Irons, Dennis Quaid, Olivia Wilde, and Zoe Saldana earned every dime they were paid for bringing these characters, and this story to life.",
      "total_reactions": 4,
      "user": "Bobby64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "These people are out of their minds. This movie was hands down one of the best films to come in a long time, without use of special effects or fancy gimmicks...pure genius storywriting. As an avid reader and film watcher, I have to say anyone who didn't give this at least an 8 has the attention span of a 5 year old.",
      "total_reactions": 2,
      "user": "Iamthejuan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "It was an intelligent movie that only someone like Brad Cooper could put off as lead role.  Such a relief from the mindless hollywood dumb-you-down movies that kept me in suspense.  I didn't want the movie to end.  We need more movies like these.....",
      "total_reactions": 2,
      "user": "Meech990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Definitely deserves a positive review. Is this movie a blockbuster or meant for all audiences? No. Is it an artistic portrayal of a writer's life and a drama about deceit and choices and consequences? Absolutely. I would not recommend this movie to the everyday viewer, but I do recommend for those who like it when the art of storytelling meshes with film-making. The movie will also stay in your mind for quite a while after viewing it and I would recommend the movie for movie groups and those who discuss movies afterwards.",
      "total_reactions": 1,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "A very greatly performed movie. Saldana acts on this one with finese and spectacle, yet the sudden and quickly short boredom the movie brings in the middle is not to be ignored, it costed it two less points. But apart from that, it's pretty cool.",
      "total_reactions": 1,
      "user": "jetpackulley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "OMFG  Critics give 37% to this film  Just 3 good critics ...",
      "total_reactions": 1,
      "user": "Expectoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "The Words is a story of three authors which one wrote a story of another. It is a smart and interesting plot with a combination of great actors. Zoe Saldana and Bradley Cooper gave a great performance to that film. It had a great atmosphere and what was happening on the film was overall interesting. I didn't get bored and watching The Words will make you feel sad, happy and proud in a strange way that you will enjoy that film. I can't understand the bad reviews again. This film was a quality drama with a qualified and skillful cast. Thumbs up!",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "This is a film with high pretensions and almost no content.  It brings up issues of honesty, plagiarism, moral responsibility and finally has nothing to say about them.  It's all gift wrapping and no content.  The actors are all fine (Zoe Saldana is irresistible), but they are working in a vacuum.  The ending, like that of Arbitrage, is annoyingly inconclusive, but so is everything else.",
      "total_reactions": 3,
      "user": "amboy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Interesting premise: unpublished writer steals someone's novel, passes it off as his own, and gets away with it until the original author shows up. But giving this to us as a story within a story within a story makes for at least one story too many. Plus, there are elements in the film that simply defy credibility. The original author dashed off the novel in two weeks and the book made it into print without a rewrite? I don't think so. I also find it hard to believe that an author would spend what seems like two hours reading from his book to an audience without taking questions afterwards.",
      "total_reactions": 4,
      "user": "JoeCalgary"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "This is one of the worst films I have ever seen.  I had to watch it to the end to see how bad it would be and it really was terrible.  Not one of the portrayals rang true.  Every major player looked like they were out for an easy payday.  The post war locales in France were laughable.  The storyline was totally unbelievable.  All of the players have done some fine work in the past, but this really stinks.",
      "total_reactions": 5,
      "user": "jwalshct"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "\"The Words\" is by no means a great film, but it is not a dreadful film either. It tells the story of a struggling writer (Bradley Cooper), who is faced with the choice to pass off another writer's novel as his own.  Because so much of the story rests on the writer's thoughts and not on his external actions, the material does not lend itself well to a visual medium like film.  Also in a day and age where publishing is dominated by nonfiction, novelizations of movies and genre fiction, it's hard to image someone risking so much in the pursuit of wealth and fame as a novelist of literary fiction. Rather than pass a novel as his own, more likely someone would use a novel as the basis for a screenplay, where it could be potentially sold for a substantial amount of money. With rare exceptions, the goal from the sale of literary fiction would more realistically lead to a professorship at a prestigious university.",
      "total_reactions": 1,
      "user": "Indiefilmlover"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Finally",
      "total_reactions": 1,
      "user": "sayitaintso"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Tedious and melodramatic with an unnecessary multilayered storyline and ambiguous ending that thinks its more clever than it really is. -MN",
      "total_reactions": 1,
      "user": "2DudesReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Emotionally Gut ranching and magnificently written. A cast full of A listers transforms The Words into one of the smartest and engaging films. The Words is worth all your time.",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Panned by critics, I didn't hold out much hope for The Words, a three generation story filled with nuanced characters and some truly great dialogue that brings out a wonderfully creative story that may make you cringe from time to time but mainly it will make you ponder how moral you really think you are. When an acclaimed author Clay  (Dennis Quaid) is introduced to Daniella (Olivia Wilde), a young woman who wants to hear his latest story about a down on his luck writer Rory  Bradley Cooper) who steals an old man (Jeremy Irons) story and must deal with the consequences, Daniella and Clay must decide what lives they want to live and who they want to be moving forward. An in depth look into love and obsession but most of all the power of admiration and the lengths we will take to give and receive it. The Words is understandably obsessed with paying tribute to the power of the written word and the great words that come from writers with something to say and maybe that's why the script by Brian Klugman and Lee Sternthal is so good as every story has a personality while they play into each other. The performances are mostly great except for the constantly awful Zoe Saldana as Rory's irritating partner. The standouts are Quiad and Irons as two haunted men, one wrapped up in his own guilt and success, the other mourning the life he once had and failed to find again. It's a complex story that is filled with emotion, some overplayed but most of it hitting the mark making for a wonderful, if not a little upsetting movie that really gets to the centre of peoples wants and desires as it tells us its alright to dream of becoming more.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "The marketing machinery behind this film would have you believe this is some kind of romantic film. And they are right as far as the \"some kind\" is concerned. However this is much more than the simple premise of love amongst people.",
      "total_reactions": 0,
      "user": "SantiagoMAKiiNA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "The romaticization of the struggling author is perhaps the most captivating aspect of The Words. Although there is a deeper, psychological facet that the film seems to try to convey, the most intriguing part is the process in which Rory Jansen",
      "total_reactions": 0,
      "user": "OneManCrowd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "A weak 6 not a strong one. It has the worst ending in Hollywood history! You are sitting there mildly enjoying this movie and then barf! The movie just stops. This movie has one redeeming quality that maintains my attention and makes this movie worth watching. That is the Dennis Quaid factor. That man is the worst actor I have ever seen! I just love watching his movies just like I like watching train wrecks. I have seen that man march across frozen tundra, get punched by schizophrenic aliens, even get eaten by Jaws. I can surely watch him do what he does best... stand up in front of a podium like a stiff board and read from a teleprompter.",
      "total_reactions": 0,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Clayton Hammond (Dennis Quaid), a famous author, attends a public reading of his new book, The Words, centered on Rory Jansen (Bradley Cooper), an aspiring writer who lives in New York City with his girlfriend, Dora (Zoe Saldana). With the help of his father (J. K. Simmons), Rory gets a job as a mail supervisor in a literary agency and attempts to sell his first novel, which is repeatedly rejected by publishers.",
      "total_reactions": 0,
      "user": "AlbertHarutyun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "The Words opens with a muddled plot and confusing flashbacks, but eventually by the middle it all gets sorted out. However, the movie just never seems to work out, even with a great performance by Jeremy Irons and an okay but decidedly unfulfilled performance from Cooper. The main failure is how the movie has a sense of false confidence and thinks it's more clever than it is. Ironic to the story and hypocritical to its message, The Words feels like elements in its story are plagiarized from so many previous movies.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "'The Words' takes your breath away especially if you are attuned to the",
      "total_reactions": 0,
      "user": "kamyfc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "I think the critics are harsh ..the movie was very deep and beautiful, Bradley cooper, Jeremy Irons, Dennis Quaid acted very beautifully ..but the end what about it ?! i didn't know for sure is that a twist in the ending or what ,is clay (Dennis Quaid) is himself Rory (cooper) and the old man is just made up so clay can relief himself and think that's okay and live with his choice ? i don't know actually but it is a great film indeed ...i loved the scene when Rory tell Dora that his life is not right and he was not satisfied about his life \"after they were in a restaurant \" this scene touched me",
      "total_reactions": 0,
      "user": "NayeraFaisal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Хороший фильм. Довольно интересный фильм с атмосферным сюжетом которыц заставляет задуматься о многом. Слова - это фильм который оставит после себя сногт впечатлений. Просто 8/10",
      "total_reactions": 0,
      "user": "Kenanman"
    }
  ],
  "metascore": 37,
  "name": "The Words",
  "num_weekends": 4,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 7,
    "month": 9,
    "year": 2012
  },
  "opening_weekend_income": 4750894,
  "opening_weekend_income_currency": "$",
  "rating": 7.1,
  "rating_count": 62364,
  "rating_freq": {
    "1": 537,
    "10": 6096,
    "2": 356,
    "3": 683,
    "4": 1430,
    "5": 3653,
    "6": 9810,
    "7": 19061,
    "8": 14432,
    "9": 6306
  },
  "release_day": 7,
  "release_month": "September",
  "release_year": 2012,
  "user_review_count": 138,
  "votes_per_demo": {
    "aged_18-29": 24667,
    "aged_30-44": 21764,
    "aged_45+": 5258,
    "aged_under_18": 75,
    "females": 17786,
    "females_aged_18-29": 9603,
    "females_aged_30-44": 5730,
    "females_aged_45+": 1367,
    "females_under_18": 35,
    "imdb_staff": 9,
    "imdb_users": 62364,
    "males": 36099,
    "males_aged_18-29": 14814,
    "males_aged_30-44": 15710,
    "males_aged_45+": 3791,
    "males_under_18": 37,
    "non-us_users": 32615,
    "top_1000_voters": 279,
    "us_users": 7714
  },
  "year": 2012
}