{
  "avg_rating_per_demo": {
    "aged_18-29": 4.1,
    "aged_30-44": 4.0,
    "aged_45+": 4.3,
    "aged_under_18": 4.3,
    "females": 4.2,
    "females_aged_18-29": 4.2,
    "females_aged_30-44": 4.0,
    "females_aged_45+": 4.3,
    "females_under_18": 3.8,
    "imdb_staff": 3.0,
    "imdb_users": 4.1,
    "males": 4.0,
    "males_aged_18-29": 4.0,
    "males_aged_30-44": 4.0,
    "males_aged_45+": 4.3,
    "males_under_18": 4.6,
    "non-us_users": 4.1,
    "top_1000_voters": 3.7,
    "us_users": 3.9
  },
  "avg_screens": 300.2857142857143,
  "budget": 17000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 5,
    "month": 10,
    "year": 2012
  },
  "critic_review_count": 143,
  "duration": 83,
  "genres": [
    "horror",
    "thriller"
  ],
  "gross_income": 4930798,
  "max_screens": 810,
  "mc_avg_user_score": 3.7,
  "mc_metascore": 18,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "The Apparition",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 11,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "The soulless-ness of their empty plot of track homes and super-store existence invokes both \"Poltergeist\" and \"Employee of the Month.\""
    },
    {
      "critic": "Mark Feeney",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "To those of us in the audience who might be strangers in paranormal precincts, it looks suspiciously like a séance."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "The Apparition is not a great or even good haunted-house movie, but it does have the advantage of a memorable setting."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "At one point Ben helpfully looks under the house to see what might be causing the ruckus. \"Watch out for spiders!\" Kelly says. Actually, Ben - and the filmmakers - have a lot more to worry about."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "Lincoln's script has no knack for the pacing of cinematic exorcisms, and the truncated climax he does offer is short on action and scares."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "An incomprehensibly garbled, derivative attempt at a horror flick from first-time writer-director Todd Lincoln."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "A plodding, undercooked, and old-fashioned (not in a good way, either) chiller that will bore you to tears instead of scare you to death."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "It's a potentially creepy setting that would give an innovative director a chance to do a lot with a little. Unfortunately, Lincoln isn't one of those."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 20,
      "summary": "This enervating muddle of paranormal nonsense manages the difficult feat of seeming frenzied and lethargic all at once, while building toward the sort of ludicrous cop-out climax that often incites die-hard genre fans to shout rude things at the screen."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 20,
      "summary": "The Apparition turns out to be nothing more than a series of feebly constructed \"Boo!\" scenes tacked together to achieve (barely) feature length."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 16,
      "summary": "With more telegraphed scares than Samuel Morse on Halloween, it still might give you a restless night, but only because you fell asleep in the theater."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 12,
      "summary": "The story is a worthy one, but the film lacks any daring expressive touches that might have made it, at the very least, noteworthy."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 0,
      "summary": "Come to think of it, it's a lot like the departed shade of a better, longer movie, hovering in tatters before us, vanishing when we blink. When you look into this abyss, it yawns back at you."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "The Apparition is the worst kind of bad horror movie--the kind that's not good enough to enjoy, but not bad enough to make fun of.  It's bland, like over-chewed gum that's long since lost its flavor.  It's uninspired, incoherent, and overall inept.    The story can't make up its mind who the ghost is, how many ghosts there are, or whether they're ghosts or something else.  There's so much babble standing in for dialog about psychic bomb shelters and spectral beacons that confuses the story rather than clarifying it.  Greene's performance ranges from swimsuit to naughty nightie.    Nothing works in The Apparition.  The actors struggle with their roles, the parts are underwritten, the story is underpopulated, scenes go nowhere, the score is synthetic and intrusive, the editing is too busy, and The Apparition has nothing to say.  The Apparition does not deserve a theatrical release, but should haunt the $5 bins at Wal-Mart for all eternity.",
      "total_reactions": 6,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "The Apparition, a new horror movie. What happen? A Completely disaster. The trama sounds cool, and that have the oportunity to scare all the people. But the development of the story is really terrible, boring and with much really much cliches. The performances of Ashley Greene, Sebastian Stan, Tom Felton and the rest of the cast are really terrible. Funny in some moments, but is an awful movie. One of the worst movies of this year.",
      "total_reactions": 5,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "I enjoyed this movie, it was good and it had a interesting plot! Everyone go see this. It's intelligent and involves plenty of elements that are scary and will cause you to jump a lot.",
      "total_reactions": 5,
      "user": "harlotjonny"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "the apparition sufre de clichés innecesarios  una abundante falta de sustos  una trama mal diseñada en fin se pueden decir muchas cosas de the apparition pero en si esta pelicula es una pesima entrada para un director primeriso",
      "total_reactions": 1,
      "user": "diego9901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "The Apparition is a horror movie without any horror. It has a setting and idea that could have proven to be terrifying but in the end the scariest thing about it is how bad it is. Because the movie isn't scary it ends up being nothing more than a boring waste of time, and we all know how valuable you time is so just skip this movie. Also helping bring the movie down is the weak script and bad acting. Only one good thing can be said about this movie and that's that Ashley Greene is super hot, but no matter how hot she is this movie is still a waste of time.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "The cinematography may be quite good and the film itself may be good looking, but the film itself is not good at all; The story, though attempting to bring forward an interesting premise, ends up being an unoriginal and generic ghost film. The acting is absolutely horrible and lazy, therefore making a less serious viewing experience. The script is (sadly) dreadful and is a mess; from bad (not bad, horrible) dialogue to a messy and dumb story arch. It also has an incredibly short runtime and a really bland and unsuitable soundtrack. Yes, yes, The Apparition is a bad film, but it does have it's cool moments and even one or two creepy moments and I do like what director/screenwriter Todd Lincoln is trying to do, but in this case, he fails badly and it makes me worrying for his future as a filmmaker.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Ashley Greene is the only thing keeping me from giving this 0. Not that she can act at all, but she is beautiful and is scantily clad for a good portion of this horrendous movie. I was so bored watching this that I literally missed most of it doing other things. The ending was ridiculous and the only thing I found scary was that someone thought this was a movie worth making. Ashley acts about as well as her Twilight costars but in my humble opinion is hot enough to give her another chance in another movie.",
      "total_reactions": 0,
      "user": "XerSMMack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Would rate a 7 if not for the terrible soundtrack.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "The tagline for this movie is \"Once You Believe, You Die.\"  They also show one of the characters saying \"Once you believe in him.. he kills you\" in the preview, and some girl saying \"It's not real, it's not real, it's not real\" as arms wrap around her.  From the preview, it looks like a half-decent movie...  However, none of that actually happens in the movie.  That \"Once you believe, you die\" thing?  It's not a part of the plot.  At all.  I'm serious, we thought we had rented the wrong movie - but, nope, it's just THAT bad.  Also, the acting was terrible.  They should be ashamed of themselves for promoting this movie the way they did.",
      "total_reactions": 0,
      "user": "BlueRaja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "The biggest damage done to \"The Apparition\" is done before you even watch the movie - the marketing. This movie is sold boldly advertising the movie's very final frame, which was even at the end of the trailer, thus ruining any shock or surprise value their last and biggest card could have possibly held. Outside of that, I'm surprised to see such low ratings here - it's really nowhere near that bad a film. Yeah, it's pretty unsurprising - but on the other hand, the characters aren't written as laughable cardboard cutouts who can't hope to pull off a believable person. The characters here are likeable and genuine, and even though the ending wasn't what I was looking for, the rest of the movie to a lesser degree was sort of what I wanted to see. It doesn't rely on cheap scares or gore to pretend to frighten us - it relies on PG-13, if not cliched, images and suspense tactics that are decent, if not \"seen before\". Overall, I rate it only slightly above a 5 for giving me some real characters for once.",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I admit the acting wasn't great. Come on though, the story is very original and very entertaining. The execution was also great. I thought this was a great start for Todd Lincoln's directorial debut. I can't wait to see what he's going to direct in the future.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "This movie is terrible, the trailer is lies! The concept of dying when you believe is not in the movie! The scares are also very terrible, they are done very poorly and they are the special effects are laughable, but not in a good way. This movie was torture to watch despite the short run time. Whatever you do, stay away from this disgrace!",
      "total_reactions": 0,
      "user": "Johnluna1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "The Story Sucks, The Characters Sucks, The Pacing Sucks, And 34% Of You Guys Like This Movie Why, Why? Thank Goodness There Ain't Gonna Be A Sequel Watch this Movie At Your Own Risk",
      "total_reactions": 0,
      "user": "MrEpic012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "With untalented acting performances and a seen-it-before storyline and lacking any type of depth or focus, 'The Apparition' is overwhelmingly boring and  despite its unusually short run time of 82 minutes  seems prolonged due to its complete lack of frightening scenes.",
      "total_reactions": 0,
      "user": "nickrovert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Total hunk of crap. Didn't make sense, bad acting, no story, lots of \"Huh?\" moments, no logic, the best moments were the clichéd \"sexy woman undressing and in her sexy underwear\" shots. Total hunk of crap.",
      "total_reactions": 0,
      "user": "ally1009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "The Apparition is underdeveloped, short and straight to the point using the routine formula of what every ghost movie use. Despite, the movie on is on its own terms, creating good looking shots, some fresh paranormal, and some likable but underdeveloped, cardboard characters. The film at some parts is not really intense, at other parts it is interesting and surprisingly chilling, but those parts are unfortunately brief and fade away very quickly, because most of this film despite some cool effects, is boring, ineffective and really not that scary.",
      "total_reactions": 0,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Didn't offend me as much as I thought it would. It had some interesting ideas that never really flourished, sadly, but there were one or two really cool and creepy scenes. The scene in the hotel was a good one, and there's another scene were the main chick is nailing a door shut, but the camera pans back, and we see that she's actually inside the locked door with the ghost/demon/whatever. The rest was pretty mediocre. The first thirty minutes were painfully boring, but if you can get past that, it's a good way to waste a night with a friend or two.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "\"The Apparition\" was an extremely bad movie, with a predictable script, bad performances although the plot seems interesting, did not get a good scare at all, and the ending was more predictable than the whole story, and it's just another movie about Tormented spirits, and paranormal events.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    }
  ],
  "metascore": 18,
  "name": "The Apparition",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 24,
    "month": 8,
    "year": 2012
  },
  "opening_weekend_income": 2955000,
  "opening_weekend_income_currency": "$",
  "rating": 4.1,
  "rating_count": 16714,
  "rating_freq": {
    "1": 1941,
    "10": 994,
    "2": 1779,
    "3": 2468,
    "4": 3217,
    "5": 2809,
    "6": 1851,
    "7": 896,
    "8": 515,
    "9": 244
  },
  "release_day": 24,
  "release_month": "August",
  "release_year": 2012,
  "user_review_count": 108,
  "votes_per_demo": {
    "aged_18-29": 6032,
    "aged_30-44": 6666,
    "aged_45+": 1618,
    "aged_under_18": 33,
    "females": 4315,
    "females_aged_18-29": 2227,
    "females_aged_30-44": 1535,
    "females_aged_45+": 319,
    "females_under_18": 15,
    "imdb_staff": 2,
    "imdb_users": 16714,
    "males": 10536,
    "males_aged_18-29": 3745,
    "males_aged_30-44": 5039,
    "males_aged_45+": 1272,
    "males_under_18": 18,
    "non-us_users": 7881,
    "top_1000_voters": 220,
    "us_users": 3549
  },
  "year": 2012
}