{
  "avg_rating_per_demo": {
    "aged_18-29": 6.3,
    "aged_30-44": 6.0,
    "aged_45+": 6.0,
    "aged_under_18": 7.0,
    "females": 6.4,
    "females_aged_18-29": 6.4,
    "females_aged_30-44": 6.2,
    "females_aged_45+": 6.6,
    "females_under_18": 7.7,
    "imdb_staff": 6.2,
    "imdb_users": 6.1,
    "males": 6.1,
    "males_aged_18-29": 6.2,
    "males_aged_30-44": 6.0,
    "males_aged_45+": 5.9,
    "males_under_18": 6.9,
    "non-us_users": 6.0,
    "top_1000_voters": 5.5,
    "us_users": 6.2
  },
  "avg_screens": 1142.3333333333333,
  "budget": 10000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 28,
    "month": 12,
    "year": 2012
  },
  "critic_review_count": 146,
  "duration": 82,
  "genres": [
    "horror"
  ],
  "gross_income": 6842058,
  "max_screens": 1403,
  "mc_avg_user_score": 6.7,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "The Collection",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 41,
  "mc_pro_critic_reviews": [
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Whereas the later \"Saw\" films were hampered by bloated backstory, various ostentatious agendas, and self-satisfied sadism, The Collection feels utterly unburdened by anything but its lean, fleet-footed plot."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 67,
      "summary": "Remarkably, the result manages to be both more preposterous and more efficient than its predecessor, with a couple of deaths occurring so swiftly they border on the subliminal."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "Genre aficionados are likely to revel in every crunched bone, gratuitous decapitation and slow-motion iron-maiden impaling."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 50,
      "summary": "The Collection doesn't have much to recommend it beyond a first-reel bloodbath rivaling \"Blade\" and \"Death Ship.\""
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "The Collection is an honest title. The movie is just a lot of other people's greatest hits."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Unfortunately, the Collector simply isn't a very interesting screen villain. Clad in a black mask that reveals only his eyes and mouth, he mainly communicates by heavy breathing. It makes one yearn for the perversely witty chatter of Jigsaw."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "An energetic but utterly weightless exercise in slice-and-dice cinema. This sequel to 2009 chiller \"The Collector\" is in many ways bigger (more characters, more locations, more carnage), but in no way better than its predecessor."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 42,
      "summary": "The whole thing is a fairly yawn-a-rific affair until the vengeful prologue establishes a wicked role reversal, hinting at the better movie that filmmakers more interested in storytelling would have made."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 42,
      "summary": "It also has enough nutty energy and oddball touches - \"The Wire's\" Andre Royo shows up as a gun-toting, faux-hawk-sporting badass - that it's never boring. Dumb, gross, gratuitous, and overly familiar, sure. But never boring."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "The movie's a smorgasbord of horror, and, ironically, that takes the teeth out of it. We're not really in this villain's world, because we don't know what his world is, or what he is, or what he's trying to even do. It's like a nightmare designed by someone who's heard a lot about nightmares but has never actually had one."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "Melton and Dunstan have created little more than a hollow shell for an empty box."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 38,
      "summary": "Dull and repetitive, even by the standards of an already repetitive genre."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 20,
      "summary": "An exercise in pure sadism, The Collection moves at a clip that leaps over plot holes in its race to elicit fright."
    },
    {
      "critic": "Nicole Herrington",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 20,
      "summary": "A pointless exercise in sadism."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "summary": "The Collection is bloody, disgusting and ridiculous, but the one thing it's not is horror, not real horror, not in the sense of tense or scary. It's not cinema, either. It's not even fun."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "The Collection is an above par horror sequel that isn't just better than the first, but also delivers an ending that rarely any horror films nowadays deliver.",
      "total_reactions": 4,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "a worthy sequel that sufficiently carves out its own identity, dunstan once again proves to be an energetic and devoted director/writer, though there are much less developed characters this time around, in every other respect, it is bigger, and most certainly better, than the first film, even if you haven't seen the first, this is still great as a standalone film so please, if you love horror movies, you will find plenty to enjoy here.",
      "total_reactions": 4,
      "user": "mickelwick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "the collection is almost, A L M O S T, as good as the original, but unfortunately, most of the characters are not traditionally likeable, or understandable, because, and this is not really a spoiler, but they're mercenaries who coerce arkin to bring them to the collector's hideout, like i said, not that likeable, only one manages to redeem himself (however remotely), and elena is not given much development, but i digress, in all other respects, this is bigger, more developed, than the original, though it maintains the refreshing simplicity that made the original so good, from the plot, (i explained it), to the traps, (what's simpler than sharp things and blunt things attached to a tripwire?), it effectively continues arkin's story with a more than ominous conclusion, this risky idea blossoms under dunstan's devoted and effective direction/writing, and it becomes something fans of the first film, (me included), are going to love and cherish - samarathenymph xoxo (happy doomsday)",
      "total_reactions": 3,
      "user": "samarathenymph"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "absolutely epic, tense, frenetic, scary, ultra-gory and action-packed on a much larger scale than the collector, the collection is everything horror fans could hope for, and there are still surprises to be had.",
      "total_reactions": 6,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "better than the original, tense, scary, fast-paced, and ultra-ultra-ultraviolent, the collection is a real gem for any self-respecting horror aficionado.",
      "total_reactions": 3,
      "user": "emilypyre"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "Went into it with high hopes because of the epic original and it was just a total let down. They did nothing to really advance the original story and it seems like they just went more for shock gore than the psychological torture the first one had.",
      "total_reactions": 3,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "You know that wonderful spine tingling, edge of your seat feeling you had when watching The Ring, that's not going to happen here. In fact quite the opposite. I fidgeted through the movie. I know studios have a certain quota of films they feel like they have to make, but really? The story is just out there and dumb. If you want blood and guts go to a slaughterhouse, at least that is real. If you want to be scared, watch the evening news. If you want to get your date in the mood, try alcohol. This movie does seem to hit any of the marks. If you are young and want to watch a \"messed up\" movie, put A Clockwork Orange in your Netflix queue. Otherwise, paying for this movie only further enables the studio's to make more mindless garbage.",
      "total_reactions": 7,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Once again, another piece of crap spit out. I dont know how these guys get the funding to put out such garbage. The only cool scene is at the rave/dance when they all got mutilated (which also makes zero sense for the rest of the film). Nobody knows what a good horror/thriller is anymore, its all retarded scenarios. Dont waste your time on this trash.",
      "total_reactions": 4,
      "user": "badbrad51"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "\"As far as the horror genre goes, The Collection is top of the line. Gruesome, sadistic and completely and utterly disgusting! This is the film horror nuts need in their lives. While all the same being a well made sequel worthy of more than one viewing.\"  B+",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "This was an impressive sequel that was certainly better than the first. An explosive opening sequence sets the mood for the rest of the film as its very fast paced and there's always something going on! Arkin is back which is great and we pick up from where the first one finished. This sequel did borrow elements from the Saw series just like the first one did, but was most similar to the second Saw film. Overall Horror fans are in for a treat with this film and its one not to be missed!",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Epic, Amazing, Scary, Breathtaking, Nerve trespasser, I enjoyed every half a second of it, this is what I call a gruesome Horror, not SAW **** this one is highly recommended",
      "total_reactions": 1,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Awesome! It was intense the way the first ended, leaving the viewer dangling!! Then there was the three-year wait for the sequel! It was worth it! I did not foresee the role-reversal, very masterful!! I did not expect this movie to be as good as it is, it shocked me!! Lovers of the genre know well that typically sequels are never as good as the first; this one manages to be a blood-soaked, terrifying good time!! I highly recommend these movies! If you can get through the torture and gore, it is well worth it!",
      "total_reactions": 1,
      "user": "fashionstar9"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2014
      },
      "score": 1,
      "text": "A foolish movie, does not make any sense. Waste of money n time . uusafhjaksafhklafkasjahfjhsfasfsasafssfsafsfsfsfsfsfsffsfsfsddfsadjfdsadfdjsahfjdksahdfsjah",
      "total_reactions": 1,
      "user": "AnkitSingh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "\"The Collection\" 10 Scale Rating: 1.5 (Terrible) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "This sequel to 2009's \"The Collector\" continues the trend of using \"Saw\" style traps to let audiences revel in blood and gore. If you enjoy torture-porn flicks then you will like this and know what to expect. Horror movie fans might find themselves alienated do to the lack of any sort of scares and a focus gruesome and bloody kills. That being said the movie is still highly watchable, it just has some issues that keep it from being considered a great movie. Just like its predecessor \"The Collection\" is basically just one intense game of cat and mouse. It's entertaining enough to keep you watching, but lacks any sort of meaningful plot. For instance we get to see the killer do all sorts of sick and twisted things, but we never get any sort of reasoning as to why he does what he does. This clearly shows that the focus is on the blood and gore, but it would have been nice to know what made the killer tick, and what pushed him over the edge. Still if you go into this just expecting to see some gruesome deaths and wont mind a lackluster plot then \"The Collection\" might entertain. Just keep in mind that it's not the greatest flick out there.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "The Collection starts off right where 2009's The Collector leaves off. The former was such a popular direct-to-video rental, that it's sequel actually wound up on the big screen, and how it avoided an NC-17 rating is beyond me. I've seen a ton of Horror movies, it's one of my favorite genres, so I can say, without hesitation that The Collection is one of the creepiest, goriest, and most clever Horror films I have ever seen. This crazed man in a mask is looking to collect certain types of people and if they pass his test, they can join his collection. If they fail, they become experiments in human suffering. In the first film, we see career criminal, Arkin O'Brien, fighting for his life. In the sequel, we see Arkin escape and lead a band of mercenaries back to the Collectors hideout, in order to rescue a captured rich girl. Of course once they get there, they find a maze of terror that rivals any film you've ever seen. I thought some of the machines in the Saw films were clever, but until you see this film, you haven't seen anything yet! How people come up with these things is beyond rational thought. Of all the ways to torture people, to come up with machines and techniques that exceed everything we've seen before is just sick...sick and very cool. The cast is the same as in every Horror movies, a bunch of dumb, no named actors, following a couple of smart people in order to stay alive as long as they can. What's special here is the story, the affects, and the level of depravity. The Collection is one of the most violent and gruesome Horror films to come along in years. It's the first step in the evolution of Horror that fans have been waiting for for years.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "meh I was definatly hoping for this movie to be better thn it was yet it wasn't a total disappointment. It didn't live up to the original in that it had a few unintentionally cheesy moments but it still upped the gore level.",
      "total_reactions": 0,
      "user": "McCorpse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "This movie was different.  If you are expecting a Saw type movie, you will be disappointed.  It does, however, bring that well thought out feeling that you got from the Saw movies.  It is just that the believabliltiy factor is a zero. From hundreds of deaths and kidnappings, you would figure the police might just consider getting involved.  You would think that the one guy who gets away wouldn't be so easily convinced to go back to the hell hole from which he escaped, but he does.  It is at that point where the movie becomes a cliche' horror movie where you see people die one by one until the villian gets his in the end, only to create the possibility for more sequels in the future.  Rent this if Redbox is all out of real movies and you will be entertained, but I wouldn't put this at the top of the list.",
      "total_reactions": 0,
      "user": "hgtrainer74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "I actually liked this movie. It was thrilling, gory and the beginning of the movie was pretty amazing. I haven't watched any horror movies, or gore movies in years now, but  I liked the premise of this one and decided to watch, glad I did. I  would recommend it to others who like movies that are a little bit gory and are more of shock value, then the psychology thrillers (used to be my favorite!).",
      "total_reactions": 0,
      "user": "natisx21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "The Saw similarities make it nothing new, (it was intended to be a Saw prequel, so, come on) but this film works by keeping the suspense going and making a genuinely creepy character out of the Collector that makes you want to keep watching.",
      "total_reactions": 0,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "The Collection was an epic film! It is a semi-typical horror film with jump scares, but it differs from other horror films I have seen. This film is definitely a nail-biting, tense film that is easy to enjoy if you love gore and death. This film can be watched numerous times without getting bored. One of my top horror films, and  I believe everyone should see this, despite what they hear.",
      "total_reactions": 0,
      "user": "FordFanatic19"
    }
  ],
  "metascore": 36,
  "name": "The Collection",
  "num_weekends": 3,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 30,
    "month": 11,
    "year": 2012
  },
  "opening_weekend_income": 3104269,
  "opening_weekend_income_currency": "$",
  "rating": 6.1,
  "rating_count": 37326,
  "rating_freq": {
    "1": 1041,
    "10": 3256,
    "2": 859,
    "3": 1439,
    "4": 2551,
    "5": 5052,
    "6": 8855,
    "7": 8029,
    "8": 4428,
    "9": 1816
  },
  "release_day": 30,
  "release_month": "November",
  "release_year": 2012,
  "user_review_count": 100,
  "votes_per_demo": {
    "aged_18-29": 14360,
    "aged_30-44": 14490,
    "aged_45+": 2530,
    "aged_under_18": 65,
    "females": 6164,
    "females_aged_18-29": 3171,
    "females_aged_30-44": 2185,
    "females_aged_45+": 399,
    "females_under_18": 19,
    "imdb_staff": 5,
    "imdb_users": 37326,
    "males": 26590,
    "males_aged_18-29": 11071,
    "males_aged_30-44": 12134,
    "males_aged_45+": 2078,
    "males_under_18": 45,
    "non-us_users": 17983,
    "top_1000_voters": 301,
    "us_users": 6953
  },
  "year": 2012
}