{
  "avg_rating_per_demo": {
    "aged_18-29": 7.2,
    "aged_30-44": 6.7,
    "aged_45+": 6.8,
    "aged_under_18": 8.1,
    "females": 7.3,
    "females_aged_18-29": 7.4,
    "females_aged_30-44": 7.1,
    "females_aged_45+": 7.2,
    "females_under_18": 8.3,
    "imdb_staff": 6.8,
    "imdb_users": 7.1,
    "males": 6.8,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.7,
    "males_under_18": 7.4,
    "non-us_users": 6.9,
    "top_1000_voters": 5.5,
    "us_users": 6.8
  },
  "avg_screens": 1545.5555555555557,
  "budget": 34000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 26,
    "month": 6,
    "year": 2015
  },
  "critic_review_count": 118,
  "duration": 123,
  "genres": [
    "drama",
    "romance"
  ],
  "gross_income": 37432299,
  "max_screens": 3371,
  "mc_avg_user_score": 5.1,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "The Longest Ride",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 31,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kat Halstead",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "However contrived this tenth Sparks-to-screen becomes, the emotions and chemistry outweigh the bull."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "\"I didn't hate it\" isn't a high watermark for praise, but when it comes to most Sparks adaptations, it's practically as good as winning an Oscar."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "A good romance can make us endure an implausible plot as long as the leads have heat. Luke and Sophia's connection feels true. Who cares about the mechanics? By the time The Longest Ride runs right off a cliff, we're already strapped in to the passenger seat. Give in and enjoy the plunge."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 58,
      "summary": "Overall, The Longest Ride feels cloying and contrived; the only time it’s unpredictable is when the plot takes a turn so utterly unbelievable that, admittedly, no one would see it coming."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "The Longest Ride is actually one of the more competent Sparks films in some years — a far cry from the creaky noir of \"Safe Haven,\" the awkwardly backloaded melodrama of \"The Best of Me,\" or the phony brooding of \"The Lucky One.\" It goes down smoothly, if blandly, like an air-flavored milkshake."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Everything in the movie is suffused by a vision of life that is resoundingly and evidently false, but as this vision is not repulsive, but is intended to reassure, the lies don’t produce anger or frustration. No, they bring on the laughs."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Coming down too hard on this load of schmaltz — as I said when reviewing my first Sparks adaptation back in 2002 — feels like taking a baseball bat to a sack full of newborn kittens."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Even when Eastwood and Robertson, pleasant enough company, threaten to float off the screen, The Longest Ride glides along and delivers its reheated comfort food by the ton."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "The Longest Ride” treats us to a twist that’s so ridiculous I think we’re almost supposed to laugh. It’s not quite on the “Are you KIDDING ME!?” level of awfulness as the big reveal in “Safe Haven,” but it’s close. It’s close."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Despite undermining its own better qualities, The Longest Ride still qualifies as one of the best Sparks films by virtue of not including any love-ghosts or destructive misinformation about how Alzheimer’s works."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 42,
      "summary": "It would not surprise me if most reviews for this film are openly hostile. It is a wretched piece of writing, and an absurd final product. It almost seems pointless to pile on, though. The audience who loves Sparks is going to go see this film and they'll no doubt walk away satisfied."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Someone put together a listicle! That’s the kind of criticism this brand was made for."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Sparks has to rely on exterior plot machinations because his characters lack any inner life."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "As a romance, a drama, or even a sports movie, The Longest Ride never reaches a satisfying destination."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "The two-hour-plus “Ride,” No. 10 in the series, at least offers a few intriguing new variations on the usual Sparks formula of pretty bland people falling in love against a backdrop of verdantly green landscapes most often located in coastal North Carolina."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "It tries to bridge the gap between pop culture and cultural elitism, between high art and the common commodity that everyone else buys tickets to see. A worthy goal, but it results in a movie that has none of the virtues of either."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "Slavishly follows the well-worn and soggy Sparks path."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "Merely adding an older generation of lovers to a love story does not make your romance one for the ages. Doesn’t even make it \"The Notebook.\""
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "The moment that first letter is opened and its trite, moony expressions of love and pointless (in a love letter) pages of exposition are narrated, the movie turns Sparks insipid."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 37,
      "summary": "People don’t go to Sparks movies for subtlety; they go to warm their hearts by bearing witness to true love. Of course, that requires a story that rings true. In The Longest Ride, authenticity is in short supply."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "The two-plus hours is mostly marked by an emptiness born of scene after scene designed to blatantly manipulate emotions rather than trigger them."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "There’s little here to convince the audience of boy and girl’s special chemistry, and nothing to attach the audience to them, either."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "Just as the basic plot points are hard to swallow, even the most rudimentary aspects of the characters' interactions feel forced, artificial and unspontaneous."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "The Longest Ride plays like cynical fan service to Sparks’ readers, who, it is assumed, will be content to sit back and enjoy a cheap tearjerker, no matter how mouldy its execution is."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "Appealing performances by a trio of second- and third-generation Hollywood kids keep this three-hankie twaddle more bearable than it deserves."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "Eventful, polished, and knuckle-bitingly dull, the 10th film adapted from a novel by Nicholas Sparks, combines fate, bull riding and some powerful Hollywood bloodlines among its young cast."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "There's little doubt where Cormac McCarthy-bashing Sparks's allegiances lie. The Longest Ride is truly no country for old ambiguity."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "If this is your particular poison, it won’t kill you. But anyone averse to Sparks’ sappy touch may get sick from all the bull."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "This is the film’s grossest crime. It’s dumb, it’s long, it’s dull, but it isn’t quite bad enough to be camp."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "summary": "In the 1980 movie “Urban Cowboy,” John Travolta rode a mechanical bull. In The Longest Ride, Scott Eastwood rides real bulls, but everything else is mechanical."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Another inferior and joyless romance by has been critically acclaimed author Nicholas Sparks its always that his crappy scripts are still be sold to hollywood another poorly directed flick with more god awful dialogue ad sucky plot depth",
      "total_reactions": 2,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "The Longest Ride is another UN-NICHOLAS SPARKS romance, even though it is cascaded as one. Just like The Best Of Me. This movie is just The Best Of Me, with Cowboys, ranches and rodeos. It starts comforting, and girly, with Scott Eastwood's Luke seeing Brit Robinson and falls in love with her. But this romance turns into a bore fest for 2 hours. The director didn't need to stretch the movie that long, just because he can throw in a war sequence. The whole movie is a mess, Eastwood and Robinson are lifeless and the direction is horrible. I think The Longest Ride and The Best Of Me are both on my worst romantic Sparks movies ever made list.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "It is boring. A total demonstration of desperation. The film sucks, the only thing I liked about it was Brittany Robertson. That's it.",
      "total_reactions": 3,
      "user": "AdrianUrbina"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "When watching this movie it had a good beginning (and that's kinda of odd since this a Nicholas Spark adaptation). But how many times is Sparks going to use the same formula that he writes books and same films?  despite that Britt Robertson and Scott Eastwood (Clint Eastwood's son which do not know why in this movie.), give some decent performances. So far i was blown away by the storytelling  but here's the problem, the script is convoluted the stereotype girl cliche's just don't film work. Alan Alda performance only makes the film glorious and emotional. Positives:the film keeps the story going which makes the audience impressed and amazed. Number two: girls can cry their **** eyes out and enjoy it. It was boring sometimes. Grade B+",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "Boring, sappy, and one of, if not the worst, Nicholas Sparks movies. characters are lifeless and pointless, this is an anti-romance. There struggles don't feel important enough to warrant a movie about them there romance feels dry and passionless, more centered around sexual attraction then a deep seeded love for each other- I just didn't buy it.",
      "total_reactions": 2,
      "user": "caityshe"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "I was born with, raised on and spent the first 20 years of my life living with, and believing, in Hollywood movies. I believed all young male lovers were handsome (and hairless) and all young female lovers were pretty and both had beautiful, usually blue eyes. Their stories consisted of meeting, falling in love, having something come along to break them up and, most important of all, everyone lived happily ever after. I knew all older folks were played by first class character actors and everything took place in beautiful towns, cities, counties, States and countries.",
      "total_reactions": 7,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "It's a nice sappy movie, perfect for those of us who want the fairy tale ending instead of the real life ending we usually get. The parallel love stories didn't seem to match at all until the end when the true love lesson is learned. We did like the love story of the couple in the past better than the couple's story of the present. But whatever, love is love anyway couples have it.",
      "total_reactions": 3,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "Utterly USELESS sappy and slightly racist melodrama:",
      "total_reactions": 1,
      "user": "MelancholicAlc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Romance chato e fraco, feito para adolescente, uma enorme perda de tempo para se assistir, falta um pouco mais de tempero na história para ficar mais intrigante.",
      "total_reactions": 1,
      "user": "GuilhermeLeme13"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "The Longest Ride is an astonishing romance-drama movie directed by George Tillman Jr. and the source by the novel with the same name from the famous author Nicholas Spark.",
      "total_reactions": 3,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Great film, & cast. I try too see a film a week, first time critic. Some of the best of films get unjust rating, this is for sure another one. Scott Eastwood, was the first time I've seen him act, Dad must be proud. Britt Robertson is on the go.",
      "total_reactions": 1,
      "user": "Mo-Pix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "What a beautiful movie. I loved the ending. Great chick flick!",
      "total_reactions": 1,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "As most romantic movies, this is somewhat predictable at a certain point, but still pleasant. For those who enjoy romance and drama, this is a really nice show that will bring you to tears.",
      "total_reactions": 0,
      "user": "Dudlei"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "Would you let your dream go for the sake of love of your life!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "“Love requires sacrifice…always”.",
      "total_reactions": 0,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "It's not the best romance movie out there but hey, it's a Nicholas Sparks movie. The movie is very very long and sometimes way too boring , but there is romance which is very important. Definitely better than The Best of Me and is sometimes watchable.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "The Longest Ride was one of my favourite Nicholas Sparks novels. It was extremely well written, coming together quite nicely at the end, it was a page turner and I was excited for the movie. However, I have never been more disappointed with the execution of a film like I have with this.",
      "total_reactions": 0,
      "user": "semirachan"
    }
  ],
  "metascore": 33,
  "name": "The Longest Ride",
  "num_weekends": 9,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 10,
    "month": 4,
    "year": 2015
  },
  "opening_weekend_income": 13019686,
  "opening_weekend_income_currency": "$",
  "rating": 7.1,
  "rating_count": 56331,
  "rating_freq": {
    "1": 827,
    "10": 9289,
    "2": 432,
    "3": 799,
    "4": 1496,
    "5": 3312,
    "6": 7865,
    "7": 14203,
    "8": 11886,
    "9": 6222
  },
  "release_day": 10,
  "release_month": "April",
  "release_year": 2015,
  "user_review_count": 120,
  "votes_per_demo": {
    "aged_18-29": 23688,
    "aged_30-44": 12364,
    "aged_45+": 3339,
    "aged_under_18": 590,
    "females": 21446,
    "females_aged_18-29": 13368,
    "females_aged_30-44": 4784,
    "females_aged_45+": 1025,
    "females_under_18": 451,
    "imdb_staff": 4,
    "imdb_users": 56331,
    "males": 21304,
    "males_aged_18-29": 10064,
    "males_aged_30-44": 7391,
    "males_aged_45+": 2260,
    "males_under_18": 132,
    "non-us_users": 22865,
    "top_1000_voters": 227,
    "us_users": 5482
  },
  "year": 2015
}