{
  "avg_rating_per_demo": {
    "aged_18-29": 5.5,
    "aged_30-44": 5.3,
    "aged_45+": 5.3,
    "aged_under_18": 5.3,
    "females": 5.4,
    "females_aged_18-29": 5.5,
    "females_aged_30-44": 5.2,
    "females_aged_45+": 5.4,
    "females_under_18": 7.0,
    "imdb_staff": 4.5,
    "imdb_users": 5.4,
    "males": 5.4,
    "males_aged_18-29": 5.5,
    "males_aged_30-44": 5.3,
    "males_aged_45+": 5.2,
    "males_under_18": 5.4,
    "non-us_users": 5.3,
    "top_1000_voters": 5.0,
    "us_users": 5.5
  },
  "avg_screens": 759.2857142857143,
  "budget": 15000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 12,
    "year": 2012
  },
  "critic_review_count": 206,
  "duration": 95,
  "genres": [
    "action"
  ],
  "gross_income": 15608545,
  "max_screens": 1872,
  "mc_avg_user_score": 5.6,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "The Man with the Iron Fists",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 43,
  "mc_pro_critic_reviews": [
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The Man With The Iron Fists has the same advantages of many musical debuts. It's the product of a man who has been storing up ideas, setpieces, characters, and gags for a lifetime, in preparation for the magic moment when he'd be able to unleash his full vision on the big screen."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "If Iron Fists is sometimes badly made, it is refreshingly badly made. It has a homemade charm that comes from a sense of having gestated in a lifelong obsession."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "A wildly whirling martial arts spectacle with an endless array of exotic knives, a penchant for Zen philosophizing and an unquenchable thirst for blood. It may just be one of the best bad movies ever."
    },
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "It's a real film, and a fun one, made with gonzo good humor and plenty of action from the opening brutal battle over which the sound of The Wu-Tang Clan's 1993 single \"Shame on a N***a\" roars."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "It's all sufficiently well done and amusing enough to satisfy the appetites of fans who mainline this sort of thing, but it also sports a concocted, second-hand feel common to this sort of throwback homage."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 67,
      "summary": "Makes sense as a picture focused on spectacle. The story almost seems secondary to the flights of fancy."
    },
    {
      "critic": "Owen Williams",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 60,
      "summary": "Don't let the 'Quentin Tarantino Presents' tag deceive you, this is a mixed bag of lumpen dialogue and martial-arts magic that never quite coalesces into the delirious mayhem we'd hoped for."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "Grisly and goofy, this ode to the Shaw Brothers' '70s-era kung fu epics serves up 96 minutes of murder and mutilation and not a lot else. Sweet soundtrack, though."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "The movie plays things relatively straight, acknowledging clichés without the winking irony in which modern homages usually indulge. As such, it's giddy fun - a well-made genre picture that sends up its influences even as it clearly reveres them."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "As endearing as it is exhausting, The Man With the Iron Fists bears strong resemblance to a hyperactive puppy: sloppy, scatterbrained, manic and migraine-inducing, but possessing an earnest sense of excitement."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "As erratically enjoyable as it is consistently ridiculous, the martial arts pastiche The Man With the Iron Fists is the latest evidence that the vogue for neo-exploitation cinema shows no sign of flagging."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Let the brilliant, epic silliness of The Man With the Iron Fists engulf you in a tsunami of crimson cheese and you, like I, will have a super-happy-fun-big-smile-crazy-face-monkey-time."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "The chop-socky wire-fu scenes are beautifully choreographed, but pretty crudely edited; despite its gourmet neo-grindhouse trappings, the film won't bring the heat like you've never seen before."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "Both the martial arts and the slightly dull narrative patchwork are too choppily edited to gain much of a foothold."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 38,
      "summary": "RZA's directorial debut is heavy on bloody kung fu action...and light on just about everything else."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 33,
      "summary": "The movie wants to be deadly cool, but mostly it's just deadly."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 25,
      "summary": "At 96 minutes it is exactly 93 1/2 minutes too long. If they're going to put this artifact in theaters, they'd better charge 1973 grindhouse prices: a dollar a ticket."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 20,
      "summary": "It's leaden, boorish and dull."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "From the opening scene, The Man with the Iron Fists feels at once familiar, and strange. It has the ridiculous hair of the eighties, various fighting styles that defy logic, and a soundtrack to match, but TMIF strikes a fine balance of genre's that somehow works. A rare specimen, TMIF may not be for everyone, but it's destined to become a cult classic, at the very least!",
      "total_reactions": 1,
      "user": "Draithis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Good old school Kung-Fu flick.  If you remember when kung-fu movies used to come on Sunday afternoons this a  that type of movie.  The \"Kill Bill\" soundtracks forced the Rza to go all  \"mainstream\" with his creativity, thankfully we don't have those issues here.  It is a mix of funk, jazz, rock, & bluegrass.  The story is easy to follow and get you right into the action.  Great movie cant wait to see more from the Rza!",
      "total_reactions": 4,
      "user": "OMM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Kill Bill style action movie. Nothing you have not seen before but a lot of stuff you liked when you saw it in other movies. If you are in the mood for sword fighting, fantasy blood spewing, eyeball flying fun this will satisfy your appetite. Batista does a good job. Soundtrack lyrics have nothing to do with the movie? Not too long like so many other movies made this year.",
      "total_reactions": 4,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Kill Bill action. That's Ll you need to know. It's not for the story or anything, just awesome kill bill action. What else do you need to know? If you love cheesey blood, gore, and action, this is the movie for you and it won't disappoint.",
      "total_reactions": 3,
      "user": "EvilShadowX11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "This movie was terrible.. it tried to be Tarantino and failed.. it tried to be a campy Kung-Fu movie and failed... It really just didn't do anything well. Sure, it had action, but it was so poorly directed it made me feel bad for the time and effort put in to this movie.",
      "total_reactions": 3,
      "user": "RalexOzein"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "An homage to the Kung Fu Theatre movies we watched as kids, but suffers from actually taking itself too seriously.  RZA needs to learn more than two facial expressions if he wants to be a professional actor.  Action was top notch but a couple of the long fight sequences are actually missing the rap music soundtrack which is supposed to be what sets this movie apart.  All in all, makes you actually miss badly dubbed English over Chinese:  here we just get bad English period.  Russell Crowe steals the show as a womanizing assassin.  Good for some modernized nostalgia if nothing else.",
      "total_reactions": 2,
      "user": "BrahmaBull"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "One of the worst movies I have seen in a long time. I have no idea what Crowe and Liu were thinking when they signed up to \"star\" in this piece of junk.. The fight scenes were over the top Kill Bill type of fights without any of the \"Kill Bill\" cleverness.  This movie reminded me of vintage Kung Fu movies where the sound effects were all wrong. I have no idea what Tarentino's role in this film was other then lending his name to help a friend. Maybe this movie was suppose to be a  spoof of Kung Fu movies, if that was its purpose it wasn't even a good spoof.   Sae your money, this should have been a straight to DVD movie sold in 7 Elevens",
      "total_reactions": 3,
      "user": "ppag"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "To correct vpkraja, this movie is not chinese made, it just has asian actors. Anyway, if you're like him and have never seen a movie like it, don't go see it, go rent some old school kung fu movies and see if you like them before you give up the 11 dollars to see this.",
      "total_reactions": 1,
      "user": "Tpoe"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "Chinese made poor quality sold out  American brand actors movie. Horrible sound track from beginning to end.  Very cheaply made movie .The highest expense would have been the money paid to the couple of main actors . Chinese trying to sell movies like their products . They just want floating population and initial days to make the money out . It is a shame for the Hollywood(universal studios) . It is cheating the movie viewers.These kind of cheap movie will reduce the regular movie viewers. I really wanted to get out of the theater after few minutes . I have never seen  any movie like this.",
      "total_reactions": 11,
      "user": "vpkraja"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I like QT, RZA, Kill Bill Etc... but this movie was HORRIBLE.  I literally walked out after wasting an hour... my popcorn was the best part.  The movie had a great trailer... fooled again!",
      "total_reactions": 2,
      "user": "moviebuff24"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Fun, cool, stylised, in grindhouse/ploitation fashion . I understand why Tarantino put his name on this,  for the reasons previous. If being a fan of this genre would probably appreciate this film and keep in your collection. Having some very credible names to make good on its style. This was this directors first work and while it could have used a better polish in places, it certainly had appeal throughout.  I never felt this film intended to be realistic, but rather it was made to stylised, and in line with its genre of which it certainly delivered. Old dirty B's and the WU Tang rap, awesome. Need I say more, but cool.",
      "total_reactions": 3,
      "user": "Bo33y"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Metacritic really should have a way to delete reviews​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​.",
      "total_reactions": 0,
      "user": "Hedja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "It is not a bad movie altough it has to many CGI Effects and the gore elements are to excessively but it still knows how to entertain you.",
      "total_reactions": 0,
      "user": "Caestus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "If you have a hankering for some 60's and 70's Asian cinema, then this is the movie for you.  I really have nothing bad to say about this movie.  All of the actors performances went extremely well with the source material.  Even Bautista can act, was very surprised about that.  Just a fun, crazy, awesome action epic that never at any point takes itself too seriously.  It really seems like everyone had a blast masking this one.",
      "total_reactions": 0,
      "user": "Filmaholic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "RZA did a decent job with this one. There were some good fight scenes, however, many were too short. In my opinion, there were way too many important people to be trying to focus the film on. The Blacksmith's history was very irrelevant as well as many other people's bits of history. He should have focused on one or two main characters and developed it that way to make the plot more sensible, connective, and strong.",
      "total_reactions": 0,
      "user": "AllAroundGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Not a picture to be taken seriously, but Rza has made a pretty good homage to the old Kung Fu films by the Shaw brothers.  It's a genre mix-up that works surprisingly well, kung fu with hip hop? Who would have known?  Produced by Quentin Tarantino, with a surprisingly robust cast for a film of this type.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "high class ****",
      "total_reactions": 0,
      "user": "mazzilli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Awesome fight scenes cant make up for a horrible shallow plot with elements that does not make sense, characters and settings that would offend anyone (such as myself) from a Chinese background and overuse of over-the-top violent kills that will make anyone, even those who want blood and guts, to flinch. This lack everything that made Tarantino's flick great and tries to be a westernized Wushia movie but ultimately fails on every level except for the at times decent fight scenes (however even these fall flat at times with horrible CG effects e.g arrows. blood, stuff breaking apart). With the exception of Russell Crowe and Lucy Liu, every other actor in this movie just fails on all levels of acting. There's a difference between knowing that its cheesy and bad and going for it vs being cheesy and bad but takes itself way too seriously. This movie is the latter and really, there are so many moments, especially the sexual scenes involving Crowe (dont get excited boys...no nudity here and no sex at all. Just connotations) which felt unecessary and do nothing to the plot. All-in-all, once you overlook these factors, you may enjoy Man with the Iron Fists when the blood starts spilling but overall, its is a horrible, Tarantino-wannabe movie that lacks art and class, and would more then offend anyone with Chinese ancestry or with a good knowledge of Chinese Wushia films. People who find this to be exciting and engrossing seriously need a reality check and are certainly young, ignorant, non-Asian douchebags with a lack of experience with Chinese Wushia films. It's like going to those made-for-White-people Chinese restaurants that only non-Chinese people go to: you know, those mediocre places where you never see any Asians dine there (there's a good restaurant tip right there) and the menu is cliche' as hell (fried rice, sweet&sour; pork, spring rolls zzz) with customers ordering the same dish almost everytime as opposed to dining in a high class, popular restaurant known by all the Chinese locals for great authentic dishes. Many people will get tricked by its action and some reviews on metacritic by ignorant people who dont know better. If you are curious, watch it when you're drunk and bored with some mates. Otherwise, unlike you're really an ignorant, non-Asian douchebag who dont know better, go right ahead and buy it. It's made for minorities like you. Enjoy your",
      "total_reactions": 0,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I think the critics who gave low scores to this movie don't really know what a Kung-Fu movie is supposed to be. This was a pleasant surprise and follows the mold of those that came before it. If you like Kung-Fu movies this is a movie for you, if you don't know the genre, you probably won't get it.",
      "total_reactions": 0,
      "user": "taygor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "If the name \"Shaw Brothers\" doesn't mean anything to you, you probably aren't going to like this movie.  The Man With The Iron Fists was made with a very specific audience in mind.  It isn't likely to win any Oscars, or be remembered as an enduring achievement in the art of film making, and it probably won't grow to the same cult status as many of the movies that inspired it.  Frankly, it has some pretty cringe-worthy acting, occasionally goofy dialogue, and spends a little too much time on exposition and not enough on kung fu.  That said, if you are a fan of RZA or old school kung fu movies, you will still get a kick (see what I did there?) out of this.",
      "total_reactions": 0,
      "user": "agentjones"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "As others have said, this movie is a nice rehashing of the old Kung Fu films.  The plot is threadbare, but did you really expect more?  The imaginative weaponry and choreography is where this film really shines.  Go in expecting violence (there is a lot) and enjoy the ride.",
      "total_reactions": 0,
      "user": "jball359"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I like the old school martial arts movies and you can tell that RZA is a huge fan of them.  The good are the visuals, the fight scenes and (some of) the music. I was a little perplexed with a \"reggaesque\" track during one fight sequence...not sure it worked.  What's bad are the writing, the acting and did I say writing. There was too much RZA in the movie.  Bad move.",
      "total_reactions": 0,
      "user": "bgirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "The action goes from well-choreographed to cluttered and messy, a sign of a first time director. Overall, incredibly uneven. But the one constant is that outstanding soundtrack.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "I saw this film and was impressed with the imagery, camera angles and most of the limited action. I expected more action and was not impressed with the story line and/or dialogue. I'm proud of RZA but he should have casted someone else in his place. Maybe Michael Jai White. Otherwise I supported this film because I'm a fan of the Wu along with QT!",
      "total_reactions": 0,
      "user": "Skibolive"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "I went to see this because of two(2) misapprehensions. 1. I thought it was written by Quentin. It isn't. Written by RZA. 2. I am a Shaw Brothers fan, have most of their movies on HDD, thought this would be a return to that campy/violent goodness. First 5-7 minutes of the film was exactly that, even had exposed tendons. After that...just f#$5ing BORING.",
      "total_reactions": 0,
      "user": "hatesgames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "The fight scenes are insane and well choreographed, the blood and gore are astounding and it has an amazing soundtrack featuring music from artists like Wu-Tang Clan and Kanye West but some thing's missing. Oh yeah, the story and plot make no sense. Also, the editing was a little too rubbish. See it though, even if just for the action scenes.",
      "total_reactions": 0,
      "user": "Motherbleepers2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "I have occasionally enjoyed this wave of grindhouse pictures, like--\"Planet Terror\" and \"Hobo with a Shotgun.\" But a lot of them have been disappointments. I'm talking about the boring and overwritten \"Death Proof\" and the oh-so-irreverent \"Machete.\" \"The Man with the Iron Fists\"--Wu-Tang Clan member RZA's first shot behind the camera, is an exercise in visual and structural ineptitude. The RZA, starring alongside an obese Russell Crowe, in this rather poor grindhouse homage to old Kung Fu movies, narrates the simplistic story of a black blacksmith (RZA) who must protect his village from a deadly band of assassins. Not even a halfway decent final battle sequence, (if you can make it that far), can compensate the insurmountable problems that makes this so laborious to watch. Truthfully, I wanted to enjoy the movie for what it is--an over-top-bloody, action sequence extravaganza--but couldn't. The movie tries to maintain a edginess throughout---graphic fight scenes, blood spatter, etc. but falls short. Levels of debauchery that are simply unpleasant at times (including a disturbingly obese Russell Crowe ripping anal beads from out a prostitute in a bath tub) for example. The last half of the film takes place inside the brothel, and there is not a single shred of female nudity in the film. The film was entirely filmed in China, and whose original duration exceeded four hours. The RZA suggested dividing the work into two films, however, and not surprisingly, his proposal did not receive any support, thus forced to reduce its length to just over an hour and a half. Therefore, when you remove 145 minutes of a 240 minute film, the first thing that suffers is the story itself. What's left of the story is a mess and no real sense of direction. Characters are in and out of the story line so quickly, the audience doesn't have a chance to be clear on their motivations and alignments.The martial arts sequences consist of a saturation of close-ups  cables, and computer generated effects, that denies the viewer the chance to appreciate the exchange of martial techniques. Considering the background and motivations of the director--and his talented cast--such a waste of unused talent is incomprehensible.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "I as well went to see this as i thought it was a Quentin Tarantino directed movie ( not produced).  RZA did his gangster hood rat narrating. WTF was that, hard to take that seriously. I should have left after the first 10 minutes and demanded a refund. Instead i wasted 90 min of my life that i will never get back. I was with a 7yr old so i was their with good intentions, to show him a cool Kung-Fu action movie. Unfortunately after the horrible taste it left in my mouth after leaving i couldn't help but throw up. Not even the Asian's spoke Asian. If it was not narrated by RZA and  had subtitles when the Asians spoke. I could have stomached it  a lot more.  If your reading this and have not seen it yet, save you $.",
      "total_reactions": 0,
      "user": "movieOverlord"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "The Man With The Iron Fists, is just not that good. It's sleek but really gory. The RZA sucks at making movies. Don't let the Queten Tarantino Presents logo fool you. 4/10 because of some cool scenes. Worse than A good day to die hard.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "This is a goofy yet serious kung-fu genre film. I'm not entirely sure of what RZA's influences were, however, I got the sense that he was going for a hyper real anime feel to the film. Love it or hate it I was entertained. Definately for those who enjoyed ninja scroll, kill bill, or even Charlies Angels. The last Is the easiest to compare this too, it's like the Charlies Angels with the Wu tang, asians, and Mr. Fighting around the world Russel Crowe.",
      "total_reactions": 0,
      "user": "mrkillface"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "For RZA's directorial debut it is well written and executed. The fight scenes were definitely a highlight of this movie. Though the plot could have been better Russell Crowe did a good job and RZA was decent. All in all it's not that bad but people won't watch this movie for the acting. I wouldn't recommend it unless you like Kung Fu movies or mindless action.",
      "total_reactions": 0,
      "user": "soren40"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "Anyone that dare to give this movie a more than 4 is an idiot. The WORST movie I ever since. The Story, the Action, the Special effect, everything is Nonsense. Can't stand watching this.",
      "total_reactions": 0,
      "user": "besttuanlong"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Movie was pretty good.  Accomplished what it set out to do, which was to emulate the classic 70s cheesy martial arts films.  I don't get why people are criticizing it for not \"expanding\" or \"innovating\" on the genre.  Gimme a break, what do you expect?  Also the soundtrack was great..",
      "total_reactions": 0,
      "user": "pkarapan77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "An outstanding action movie with all the right nods to the kung fu classics of the 70's - excellent set pieces and great fun. The music is somewhat incongruous but somehow it all fits, and Russell Crowe seems to be having the time of his life.",
      "total_reactions": 0,
      "user": "royphishooh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "This movie is for those who want to experience ridiculous fight choreography while still getting everything a martial arts film generally has to offer with a touch of romance. I love my man RZA, and the soundtrack to this movie is bumpin yet awkward in a movie set in ancient China. The story is straightforward as it can be but analyzing this solely as an action flick, it's got what you crave.",
      "total_reactions": 0,
      "user": "acaiberry"
    }
  ],
  "metascore": 51,
  "name": "The Man with the Iron Fists",
  "num_weekends": 7,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 2,
    "month": 11,
    "year": 2012
  },
  "opening_weekend_income": 7910980,
  "opening_weekend_income_currency": "$",
  "rating": 5.4,
  "rating_count": 54564,
  "rating_freq": {
    "1": 3139,
    "10": 3132,
    "2": 2331,
    "3": 3692,
    "4": 6259,
    "5": 10201,
    "6": 12153,
    "7": 8268,
    "8": 3946,
    "9": 1443
  },
  "release_day": 2,
  "release_month": "November",
  "release_year": 2012,
  "user_review_count": 223,
  "votes_per_demo": {
    "aged_18-29": 17935,
    "aged_30-44": 23905,
    "aged_45+": 4396,
    "aged_under_18": 32,
    "females": 3937,
    "females_aged_18-29": 1529,
    "females_aged_30-44": 1694,
    "females_aged_45+": 430,
    "females_under_18": 3,
    "imdb_staff": 4,
    "imdb_users": 54564,
    "males": 44269,
    "males_aged_18-29": 16213,
    "males_aged_30-44": 21903,
    "males_aged_45+": 3893,
    "males_under_18": 27,
    "non-us_users": 27987,
    "top_1000_voters": 337,
    "us_users": 9189
  },
  "year": 2012
}