{
  "avg_rating_per_demo": {
    "aged_18-29": 7.7,
    "aged_30-44": 7.3,
    "aged_45+": 7.6,
    "aged_under_18": 8.0,
    "females": 7.9,
    "females_aged_18-29": 8.0,
    "females_aged_30-44": 7.7,
    "females_aged_45+": 8.0,
    "females_under_18": 8.4,
    "imdb_staff": 6.8,
    "imdb_users": 7.6,
    "males": 7.4,
    "males_aged_18-29": 7.6,
    "males_aged_30-44": 7.2,
    "males_aged_45+": 7.5,
    "males_under_18": 7.7,
    "non-us_users": 7.5,
    "top_1000_voters": 6.5,
    "us_users": 7.6
  },
  "avg_screens": 308.22727272727275,
  "budget": 19000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 4,
    "month": 4,
    "year": 2014
  },
  "critic_review_count": 253,
  "duration": 131,
  "genres": [
    "drama",
    "war"
  ],
  "gross_income": 21483154,
  "max_screens": 1316,
  "mc_avg_user_score": 7.3,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 37,
  "mc_movie_name": "The Book Thief",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 103,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 100,
      "summary": "This is one of the best movies of the year, featuring one of the most perfect endings of any movie in recent memory."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "The resulting film has some wrong notes and touches of preciousness, but mostly it's a moving and effective presentation of life under Nazism, as seen from an unusual angle."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "The simplicity of Michael Petroni’s script seems a drawback at first. But skilled director Brian Percival (Downton Abbey) slowly, effectively tightens the vise as evil intrudes into the life of this child."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "Overall, it’s engaging and serves its young audience well — a rare Holocaust movie that doesn’t strain to become Oscar bait."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "Books themselves become the story's key symbol, representing the past and future, loss and possibility, of a place that's ground zero for some of history's darkest days."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 70,
      "summary": "The children may tug at the heartstrings, but it’s the adults who give the film its heart."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "The Book Thief has been brought to the screen with quiet effectiveness and scrupulous taste by director Brian Percival and writer Michael Petroni."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 67,
      "summary": "It’s respectable, safe, intelligent – and a bit dull."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 67,
      "summary": "\"Life Is Beautiful\" may or may not have set a benchmark for tackiness in Holocaust cinema, but The Book Thief offers a hypothetical way in which the former might have been worse: At least it wasn’t narrated by Death."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 67,
      "summary": "It would make for a pretty ghastly pageant if not for smart, understated turns by Watson and Geoffrey Rush as the charmingly Teutonic couple who rescue both Liesel and a stranded Jew (Ben Schnezter) — not to mention the movie itself — with honorable matter-of-factness."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "Then Death feels the need to intrude again. And again. If his accent weren't so charming, his voice so resonant, it would be depressing, all this meddling and mortality."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "Anchoring the story is 9-year-old Liesel Meminger (Sophie Nélisse), whose first scenes are riveting."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 63,
      "summary": "The Book Thief has its moments of brilliance, thanks in large part to an adept cast. But the movie about a girl adopted by a German couple during World War II also crystallizes the perils of book adaptations."
    },
    {
      "critic": "Ian Freer",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 60,
      "summary": "Some good performances, impeccable craft and good intentions can’t compensate for a lack of dramatic urgency and emotional heft. The Book Thief is effective, but not effective enough."
    },
    {
      "critic": "Paul Bradshaw",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s hard not to be moved by the story, but it’s only a handful of great performances that save it from underwhelming. Steal the book instead."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "You may come away more impressed by the intentions than by the achievements."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "The movie’s strong sense of empathy, enhanced by several noteworthy performances, ought to engage most viewers."
    },
    {
      "critic": "Jamie S. Rich",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "The Book Thief renders a dark history in the most bland and inoffensive hues. Most of its success relies on our foreknowledge of history. Its own efforts are hollow, squandering a good cast on lazy writing."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "The film is unobjectionable, sentimental, and not a little dull."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "It relays an uplifting story that, ill-advisedly, is not so much Holocaust-era as Holocaust-adjacent, determined to steer clear of too much discomfort."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "As a showcase for accomplished performers tugging heart strings in a holiday awards season, it's perfectly serviceable."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "Directed by Brian Percival, best known for his work on \"Downton Abbey,\" the film has the similar quality of a well-appointed historical soap opera."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "The Book Thief covers a large span of time, but the film's episodic nature, often moving from one incident to the next with little time to pause or reflect, often obscures that fact and hinders an evocation of the cumulative effect the war has on the psyche of not just the Hubermanns, but their neighbors, too."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "An embarrassing gut-punch of unfiltered schmaltz, but its sympathy for the devil-style humanism is well-meaning."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "The Book Thief crams story after story into such a small space that it can’t realize any of them in depth."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 40,
      "summary": "Where the book had a kernel of intellectual irony to it — words betray a nation — this drama goes shamelessly for the heart."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "A misfire in far too many meaningful aspects, The Book Thief is so bad that it's tough to decide whether it's better used as a sleep aid or watched while under the influence as an object of derision."
    },
    {
      "critic": "Godfrey Cheshire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 38,
      "summary": "In the end, there's a distinct air of solipsism to this tale."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 30,
      "summary": "On the not-much-of-a-plus side, at over two hours long, sitting through The Book Thief engenders in the viewer some serious sympathy for the interminable plight of poor, sickly Max, concealed below stairs in a dank, dark corner of the house on Himmelstrasse."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 30,
      "summary": "The Book Thief is just too tidy to have much impact."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 20,
      "summary": "The Book Thief is a shameless piece of Oscar-seeking Holocaust kitsch."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "The Book Thief is one of the best books I've read, and thankfully, the same can be said for the film adaptation. The Book Thief mainly succeeds thanks to its acting. Each actor nails it as their characters perfectly, and delivers the perfect amount of emotion and dialogue. It's some of the best acting I've ever seen in a film. the writing does a great job of sticking to the book. While there are obviously differences, and things outright taken out, the majority of the writing keeps true to the book. Even though I don't deduct points for accuracy, I was impressed with how well it did towards the original novel. Even without the book accuracy, the writing and script were excellent. When it comes down to it, my only problems with the film is the safe approach and inconsistency. The film does decent with its Nazi Germany setting, but plays with it way too safely. It seems like they tried not too mess with such a setting, and because of it, it feels like the Nazi setting is approached a bit too brightly, except for a select few scenes. But the biggest problem is the inconsistency. Death narrates the movie, just like he does the book, but the problem here is that he's used a few times, and at random. It makes me wonder what the point of bringing Death into the film was, because his random use feels seriously off. Aside from this problem, The Book Thief does excellent thanks to its strong acting and great direction, and I'd definitely recommend you see it.",
      "total_reactions": 4,
      "user": "Aquaris475"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "An air of artifice hangs over 'The Book Thief' like a heavy fog and not even seasoned pro's like Emily Watson and Geoffrey Rush can save it from being a stultifying bore. This Second World War story is based on a best selling novel but its adaptation here is protracted and bloodless and must be classed a major disappointment. Young Sophie Nelisse, as the titular character, looks the part but her line delivery at times comes over as phonetic. The production itself looks immaculate, but again this is also a big problem. as everything is just so pristine. At one point Emily Watson berates the girl as being 'filthy' when in fact she looks as if she is on her way to a photo shoot. A bogus in-authenticity pervades and prevents the film from generating any true emotion or pathos. John Williams' pretty score adds to the detrimental effect and actually feels as if it belongs to another type of movie in another era. A couple of scenes do ignite. The cellar search grabs one's attention temporarily and the ending, coming as it does from left field, causes one to stir in a way that the rest of the film never does. I also have to mention that the scene where Geoffrey Rush plays his accordion whilst everyone is hiding in an air raid shelter, made me think that the cast were going to start singing Oom Pah Pah a la Carol Reed's musical Oliver!  One thing I did like was the unusual narrative device which is intrigueingly employed at the beginning and used to devastating effect at the end.",
      "total_reactions": 2,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Markus Zusak in my opinion is one of the better modern novelists. I've read most of his books, out of all of them, no question, my favorite is The Book Thief. I often recommend this book to almost every book-lover, so it's to no one's surprise that I was looking forward to this movie, because out of what I had seen in the trailers, it seemed fine. However, after seeing it, I still recommend the book, because if you only see the movie, you will be simply missing out.",
      "total_reactions": 2,
      "user": "stako"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "I normally read books before watching their film adaptations. My family, however, forced me watch this before I had the chance, so I cannot compare the movie to the book. But judging the movie by itself, it was thoroughly entertaining, mature, and artistic. In my opinion, it is better than most movies I have seen in quite some time. My favorite thing about it is that it did not need to resort to graphic violence or overly pompous special effects to create a memorable experience. Although the story can be a little too predictable and trite at times, it still delivers a strong impact and generates much sympathy for the characters. I loved the atmosphere; it felt so authentic and harked back to a feeling of closeness with one's family that seems to have been lost in today's society. Overall, this movie is good, not superb, but definitely worth a watch.",
      "total_reactions": 1,
      "user": "Blackthorne20"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "This movie did not look like any fictional tale, but was very realistic, that happened back in the 40s. It was based on a book of the same name. The filmmakers given soul to the movie with a great adaptation. This children's movie was awesome to watch if you are a fan of this genre. It was set in the backdrop of world war two in Germany, which chronicles a 8 year old girl’s life during those times.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "The Book Thief is a slow paced emotional masterpiece that delivers a quality script and cast. A setting which has been use over and over this time stands from the pack and will leave you satisfied after the credit begin to role. The Book thief is a excellent movie to begin 2014 and will defiantly be one to remember.",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "Loved to watch this movie , with brilliant acting, lots of emotion . Very nice surprise. Overall, this movie is very good, not superb, but definitely worth a watch.",
      "total_reactions": 1,
      "user": "nfernandes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Surprisingly, The Book Thief doesn't dissapoint the fans of the books and moviegoers. The film set entirely in WWII is very kinetic and full of joyous activities. Brian Percival has done a good job directing the film and writing the script. In the end, not a film for the squeamish but certainly scary, fun and inspiring- The Book Thief is the only film that represents a book by its merits.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "I'll try and write in English, I apologize if I make mistakes. I actually had great expectations about this movie, I had heard of the book a long time ago. It disappointed me. It's unreal, and fake. The girl reacts in a very artificial way to the things that happen to her, it tastes like lie. The movie is full of empty speeches, that sound good but mean nothing at all. The characters are cursory. You get the sensation the director is trying to tell you something, but in the end he's just saying obvious stuff like it's amazing. They say \"We have to. We're people\" or something like that all the time. I was like: don't you say? Don't get me wrong, it's a good start for a reflection when it goes with other information. It's a cliché, in all senses. But it entertains you.",
      "total_reactions": 4,
      "user": "ecojuliase"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "What a charming and engaging movie. Thought the acting was superb and the storyline very well written. I was in a large, completely packed theater, and I don't think there was a dry eye in there. It is sad to see reviews by those that claim to be experts put this movie down; it just shows their prejudice in my opinion. I thought this movie was MUCH better than Gravity, at least the \"Book Thief\" is a plausible story!",
      "total_reactions": 3,
      "user": "Qadosh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "The acting is what raised my grade a whole point. Rush and Nelisse are perfectly cast with Nelisse shining above all others. The story is heartwarming and showcases character development at its finest. And the ending was basically just perfect. I just walked away feeling like something was missing and that it could have been better. Overall I'm impressed and can't wait to see what Nelisse has to show us next.",
      "total_reactions": 3,
      "user": "JCouch777"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "This was a very good film. I think the critics are judging this way too hard. The acting was very good by the entire cast and especially Sophie Nélisse as Liesel, very refreshing.",
      "total_reactions": 3,
      "user": "sparkvark111"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "I was pleasantly surprised by this film. A keeper for sure because some of its messages will always be applicable. Don't let the meager earnings ($568,500) fool you or lousy overpaid critics.",
      "total_reactions": 4,
      "user": "ZenFury"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "The film is unfortunately tame in some areas, oddly edited and has a somewhat melodramatic finale, but the flaws have been made up for with a nice tone, realistic set designs, a fantastic original score by John Williams, great performances and a heart-warming and emotional narrative. The novel is certainly better, but this adaptation certainly comes close to achieving the same success as the novel.",
      "total_reactions": 2,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is an embarrassing thing. First off, the title, \"The Book Thief\" doesn't even really apply to the movie at all. She steals books on 2 occasions but that's it. I don't even know what the story is. They're so many events going on and NONE OF THEM ARE IMPORTANT TO THE STORY LINE WHATSOEVER. The book thievery happens in a 15 minute span of the whole 2 hour movie. As a historian, it pains me to view their feeble attempt to cover WW2. The chronology of the war is all screwed up. They had Germans still deporting Jews in 1942, which all deportation had been dealt with. Lezeil and Rudy's fathers had been drafted into the war. Let us take the time to note these two gentlemen are in their late 60s or 70s. Now men like this were drafted into the war, but later in the war like 1944/45. The drafting for these men happens in 41. The movie tries to give the viewer a notion of time passing, BUT ALL THE CHARACTERS LOOK AND ACT THE SAME AS THEY DID IN THE BEGINNING OF THE FILM. All in all this is a pitiful movie, with weak to no apparent story line, pathetic acting, and a time line that went to ****",
      "total_reactions": 2,
      "user": "AlexSoderlund"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "This is one of those trying-to-be-touching stories about a child growing up during war. This time it's a 9 year-old girl, who is adopted by new parents (Geoffrey Rush & Emily Watson) in Nazi Germany. She develops a love of books and shares it with the Jew hidden in the basement (isn't there always one?). The deliberate pacing means that it often takes too long for scenes to develop. There's a constant sense of dread, but never much real drama. So many plot points are predictable and the whole things feels manipulative in a Hallmark Movie of the Week style. While it's competently made, it's slight on emotional impact. On a side note: It also observes one of those silly Hollywood traditions. The people are all supposed to be German, but they speak English with a German accent (and a few actual German words are sprinkled about).",
      "total_reactions": 5,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "There are movies that can be put in a category appropriately labelled ‘Oscar bait’; and if there is one film that exemplifies that best this year, it is The Book Thief. Just like any cold or flu, ‘Oscar bait’ films have very clear symptoms. For starters, setting the film during The Academy Awards’ favourite time in history, World War II is a must; having a young lead performance is another; previous academy award winners and nominees within the cast (in this case the illustrious Geoffrey Rush and the always impressive Emily Watson) always helps; and finally, the icing on the cake is the heavy-handed and manipulating (to the point of distracting) forced drama (in this case, a completely unnecessary voice-over). Put all those factors together and you have one of the most formulaic and familiar films during Oscar season this year. Read more!",
      "total_reactions": 2,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Not a perfect film, thus it is compelling and effective. The story of Lisel is one of the few that stay with you. Beautiful score & lovable characters. The whole story is bold & courageous.",
      "total_reactions": 1,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "It`s not a bad movie, but also does`t have anything that would make it a great movie. It includes good actors like Geoffrey Rush and Emily Watson but they are not even close to their bests.",
      "total_reactions": 2,
      "user": "mvoelcker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "i  found the book thief  depressing  , interesting , and very creative . this is one of the most inspiring , sole surviving movie i had ever seen .  But its just sad for me .",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "I have no idea how this film got such low critic reviews, its so much better than a lot of the rubbish that Hollywood produces. I haven't read the book so cant compare how the movie compares to the book, but I thoroughly enjoyed the film. The acting, particularly by the lead characters, id superb, the story is engaging and interesting and the pace of the film is just right. There wasn't anything I disliked about the film, I think some of the critics are judging this film far too harshly.",
      "total_reactions": 0,
      "user": "djnicey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "I like many others was caught off guard by this film.  I expected on thing and got an entirely different film.  There was the envitable fear quotient in the film but it's wasn't a film about fear so much as it was a film about hope and living.  It's was a welcome relief to not have to relive the horrors we usually witness in films that are about this time period and instead watch something that dramatically played out but basically played out quietly.  This film suceeded for me where 12 Years a Slave failed because the director and the writers made me care about the characters who were truly brought to life by the actors.  Yes it's sentimental but we live in a time where sentimentality seems to go against the grain of sex and violence in film.  Not a single shot of nudity.  No sex scenes.  No real violence.  Nicely done.",
      "total_reactions": 0,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "If you loved the book, as I did, then avoid this movie because it's a complete disappointment.  The novel draws you in and keeps you turning the pages; the film seems endless.  One of the biggest flaws is just how terrible the child actors are.",
      "total_reactions": 0,
      "user": "dylan111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "The Book Thief  , based on the novel by Markus Zusac, is a 2013 film directed by Brian Percival with Geoffrey Rush, Emily Watson and Sophie Nelisse .",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "I honestly am siding with the critics this time. It had a lot to say, and all of it's messages are kind of lost within each other that at the end you go \"Okay, I get it. But, is that it?\". A lot of people are talking about how faithfully the film sticks to the book. Maybe that's the problem. It's definitely not a must-watch IMO. I'm actually a bit disappointed to be honest.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "To my surprise this was a nice film which covered a lot of emotional content and giving us a fictional yet believable story of ordinary people in Germany during WW2.",
      "total_reactions": 0,
      "user": "bm2759"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "Been a while since I saw this but when i went to the cinema I thought it would be a haunting and character driven story that would be enchanting to watch. Instead, I got a serious of random instances to \"develop\" characters along with predictable story lines and an emotionless feel to all characters; I conceded no empathy for them. The film was bland and ends on a skewed note. A real snore fest to be frank, and the positive user feedback is truly bewildering.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "I think this is a particularly difficult storyline to try and translate to the big screen. For me, the appeal of the novel was the sublime use of language and imagery, as well as Death as narrator.  So I had pretty low expectations for this film. It was much better than I anticipated, but there were still some parts that didn't work for me. Overall, the performances were top notch. I was particularly pleased by Geoffrey Rush and the actor who played Rudy.  I felt Roger Allam was wrong as the narrator; something about his tone and delivery seemed off, maybe too polished. All the key relationships were handled well, and I think the film depicts Liesel's growing awareness of the horrors around her beautifully. This is a quiet film, that at times became a tad too quiet. However I do give them props for giving it a crack and not making a total hash of it.",
      "total_reactions": 0,
      "user": "KezSchmez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Despite developing in the holocaust, it manages to make a really good story, in which the war plays secondary role. Really good acting and direction. A must see!",
      "total_reactions": 0,
      "user": "Christian0205"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "I viewed The Book Thief with great anticipation at the beginning, but unfortunately my attention flagged halfway through.  There was little new in the story line and I wasn't convinced by Emily Watson's performance as a harsh, Germanic foster mother with a heart of gold.  The acting was fair, in my opinion, and the film plodded along without any great surprises.  There were no heart-stopping moments - nothing to make me laugh or cry - so I am sad to say that I felt this movie was just average and a waste of Geoffrey Rush's talents.  I hated the insertion of German phrases with American accents.  Either English or German - or sub-titles please.  Everything seemed forced and formulaic.  Nice try, but I wouldn't recommend it.",
      "total_reactions": 0,
      "user": "Gooduklady"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "The problem with The Book Thief is that it feels as though Brian Percival (known for his work on Downton Abbey) has narrowed the whole story to the confinements of a stage play. Okay, one can still make staging methods effective (take Dial M for Murder), but the way the camera moves, the actors enter right to left, the design shuffles as time goes by, all feels robotic and even oppressive. There is a great war going on outside, agreed this film isn’t directly intended to expose the war effort, but to signify the unconceivable act of the Nazis in true force one might need to dampen the glamorization of this storytelling.",
      "total_reactions": 0,
      "user": "charliebury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "I always feel somewhat inadequate writing about movies with a massive understanding of their place and time. Perhaps it's an inferiority complex I carry around with me, questioning my own ability to pass judgement (such as it is) on a subject I am never going to fully appreciate and, if we're honest, have no right to pass comment on whatsoever. How very dare I sit, critically finger-pointing, at something that I have absolutely no comprehension of? It's like asking my ten-year-old to judge figure skating at the winter olympics.",
      "total_reactions": 0,
      "user": "choc_raisins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "While this film definitely had it's flaws, it was enjoyable and worth watching. The first flaw is that it the entire movie was fairly slow, which may or may not actually be a bad thing. The main flaw is how they leave so many details out as well as some of the aesthetic details. More than a few years progress in the story and yet the only thing that changes in the main character is her hair style ans maybe a bit of makeup. Many story details are left unresolved such Max's story and the girl's mother.",
      "total_reactions": 0,
      "user": "SodaPopLuva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Surprisingly, its quite good. It has some pretty heavy political commentary throughout, but really, the story of Lisel, her foster parents, and her friends is an interesting and engaging one. Its moving from time to time, and equally enjoyable. If you like this sort of movie, WW2 movies not focuses on the fighting, then this one is a must-watch, If your looking for something to watch with your parents, or your kids, then the same applies. Just don't go in expecting the best movie in the world.",
      "total_reactions": 0,
      "user": "Garfoodle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "The Book Thief, is a whimsical sort of film that I thought was going to have magic in it, I kept waiting for something to happen, besides the usual Western vibe of THIS IS BAD/THIS IS GOOD!",
      "total_reactions": 0,
      "user": "clayscottbrown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "I had never read the book before and honestly, I wish I had.  This film was beautiful from start to finish.  The acting was incredible and the story was literally an emotional rollercoasters with constant ups and downs!  This film showed that you do not need cgi to make a film worth watching.  If the story is good...which it was...and the acting is exceptional then naturally us as audience members will enjoy the ride.  I highly recommend everyone of all ages to watch this masterpiece.",
      "total_reactions": 0,
      "user": "FusionNFire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Brian Percival's flimsy portrayal of the horrors of World War II is masterfully concealed by superb acting and a warm, touching tale of war visualized through the eyes of a child.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "The book thief is a war drama based on a bestseller. It is warm story about a girl who live during WW2. It makes you wonder about who we are.... how can people became so evil and so blind... what makes us do the things that will hurt others beyond repair. It is definitely movie to watch again. You will not find answer to those questions, but you will think and ask yourself the same things over and over again.. it is also a movie about unconditionally love and good in the evil times of the third Reich. At the time of fear their is a love, laughter, joke, people who don't judge others by religion, skin color.  There is an light of hope for humans. I will definitely read a book. :)",
      "total_reactions": 0,
      "user": "mbelizec"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "\"A Menina Que Roubava Livros\" é impressionante. Ótima fotografia, intérpretes impressionantes e uma história de arrepiar. Emocionante e muito bem feito, tiro o chapéu pra essa obra-prima.",
      "total_reactions": 0,
      "user": "FSimmer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This is clearly a film aimed at a younger audience and it sticks to this throughout. They have told the story through the childs eyes hence the lack of blood and gore some critics crave. Sophie nelisse will be a major player in the film industry in the future, demonstrating a natural talent for the big screen, appearing to carry her role with seemingly effortless ease. It was not my type of film as i prefer a more gritty, hard hitting retelling of world war 2. It is aimed at children and for that i believe it was perfectly produced and entirely believable.",
      "total_reactions": 0,
      "user": "blupac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This is one of the best movies I have watched in my life and it left a positive impression on me. Amazing characters with a compelling narrative. You can't help but be drawn into  the world of the characters. It forces you to see the world through their own eyes and leaves you a better person. I haven't read the book but the movie left me itching for it. I highly recommend this movie.",
      "total_reactions": 0,
      "user": "slimbill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "'The Book Thief' means well, it's an innocent film depicting a little girl's point of view of the war, so that means we will not be seeing a graphic view of the combat and violence of these horrific events that take place.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "I had to read The Book Thief for class and it is one assigned book which was surprisingly enjoyable.  The movie was just as enjoyable and followed all the book's key themes very well.  The ending is honestly the best scene, the emotions and feelings are almost tangible, and though I cried, it was worth it to see that scene played out.  A strong, moving film that I highly recommend.",
      "total_reactions": 0,
      "user": "kat267"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "The film-making style seems disconcertingly glossy given the downbeat themes.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Um dos melhores filmes que eu já assisti. Mesmo cortando algumas partes, o filme foi bem fiel ao livro o tanto quanto pode. Contou verdadeiramente a história de Liesel, que sua paixão com os livros começou com a morte de seu irmão. Emocionante, ele reflete bem o que o regime nazista fez com os alemães. Maravilhoso!",
      "total_reactions": 0,
      "user": "CharlieBetterIs"
    }
  ],
  "metascore": 53,
  "name": "The Book Thief",
  "num_weekends": 22,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 8,
    "month": 11,
    "year": 2013
  },
  "opening_weekend_income": 105005,
  "opening_weekend_income_currency": "$",
  "rating": 7.6,
  "rating_count": 104231,
  "rating_freq": {
    "1": 735,
    "10": 15488,
    "2": 324,
    "3": 702,
    "4": 1333,
    "5": 3706,
    "6": 9877,
    "7": 23531,
    "8": 31430,
    "9": 17105
  },
  "release_day": 27,
  "release_month": "November",
  "release_year": 2013,
  "user_review_count": 241,
  "votes_per_demo": {
    "aged_18-29": 40808,
    "aged_30-44": 30502,
    "aged_45+": 9689,
    "aged_under_18": 554,
    "females": 28564,
    "females_aged_18-29": 16329,
    "females_aged_30-44": 7366,
    "females_aged_45+": 2304,
    "females_under_18": 317,
    "imdb_staff": 7,
    "imdb_users": 104231,
    "males": 57714,
    "males_aged_18-29": 24026,
    "males_aged_30-44": 22665,
    "males_aged_45+": 7215,
    "males_under_18": 232,
    "non-us_users": 50997,
    "top_1000_voters": 376,
    "us_users": 10561
  },
  "year": 2013
}