{
  "avg_rating_per_demo": {
    "aged_18-29": 5.5,
    "aged_30-44": 5.2,
    "aged_45+": 5.3,
    "aged_under_18": 5.8,
    "females": 5.4,
    "females_aged_18-29": 5.6,
    "females_aged_30-44": 5.2,
    "females_aged_45+": 5.4,
    "females_under_18": 5.5,
    "imdb_staff": 6.0,
    "imdb_users": 5.3,
    "males": 5.3,
    "males_aged_18-29": 5.4,
    "males_aged_30-44": 5.2,
    "males_aged_45+": 5.3,
    "males_under_18": 5.9,
    "non-us_users": 5.3,
    "top_1000_voters": 4.8,
    "us_users": 5.2
  },
  "avg_screens": 10.0,
  "budget": 35000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 10,
    "year": 2011
  },
  "critic_review_count": 129,
  "duration": 91,
  "genres": [
    "crime",
    "thriller"
  ],
  "gross_income": 16816,
  "max_screens": 10,
  "mc_avg_user_score": 6.2,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 19,
  "mc_movie_name": "Trespass",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 26,
  "mc_pro_critic_reviews": [
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "A home-invasion flick that grabs viewers by the throat and only stops squeezing long enough to wipe sweat from its palms."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2011
      },
      "score": 70,
      "summary": "Helmer Joel Schumacher and a game cast headed by Nicolas Cage and Nicole Kidman do their damnedest to build and sustain suspense while trying, with some degree of success, to breathe fresh life into a formulaic, even generic scenario."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 63,
      "summary": "Trespass is at least a suitable rest stop for his (Cage) anguish. An unapologetic B-movie that comes with lots of flashbacks, gunplay and shouting, it can easily be savoured and forgotten inside 90 minutes."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 58,
      "summary": "Trespass begins loopy and mounts in craziness until it's frothing-at-the-mouth insane. It's hard to sustain that level of inspired lunacy over the course of 90 minutes, but Trespass is up to the challenge. As always, it's foolish to underestimate the appeal of Cage at his most agreeably unhinged."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Trespass is best received as an almost viable B-movie that just happens to have A-list leads."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "Trespass never advances beyond being a grand manipulation."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "In the end, Trespass steps all over its own genre strengths."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "A home invasion thriller that may set a record for the number of times the characters point loaded pistols at one another's heads. First we're afraid somebody will get shot. Then we're afraid nobody will be."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "A home-invasion movie as instantly forgettable as its title, Trespass is not without disturbing images: namely, Nicolas Cage and Nicole Kidman as spouses."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "It's never boring but the relentless twists do get a bit tedious."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Trespass is assembly-line product through and through - unabashedly mediocre and instantly forgettable. A Joel Schumacher joint, in other words."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 38,
      "summary": "Trespass is a home invasion movie, but not a clever, taut one; it's sloppy and obvious, with curves so un-serpentine they might as well be straightaways."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 30,
      "summary": "So why? Why would stars of the magnitude of Mr. Cage and Ms. Kidman sign on to a project whose screenplay is so inept that the movie, even if profitable, will stand as a career-impeding setback? Can't they read?"
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "One of those movies that an audience knows is terrible the minute it starts."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "An astoundingly senseless thriller."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "How many ways can a film go wrong? Too many to list, and Trespass finds them all."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 25,
      "summary": "A jerky, clamorous domestic thriller that attempts, with nonsense and expletives turned up to full volume, to say something thrillingly profound about the depths of misery one can reach while doing financial damage control."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 20,
      "summary": "Can someone explain what Nicolas Cage and Nicole Kidman are doing in a chaotic and sadistic home-invasion thriller, shot in digital colors so radioactive they appear to have leaked out of the Fukushima nuclear plant?"
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2011
      },
      "score": 12,
      "summary": "Cage and director Joel Schumacher, who has fallen so far from the A-list that he provokes a demand for new letters of the alphabet after Z, have each found their cinematic soulmates."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "Well, the signs were not very good, when Millennium Entertainment decided to shoot straight for Blu-Ray and  On-Demand with only 9 theatres showing \"Trespass.\" And, the fears have been confirmed: the film is an utter disaster. It is really the last thing either Kidman or Cage needed, but they got it. The screenplay is atrocious, with so many twists and turns it makes you sick. None of it is original - don't be fooled. The film goes for quantity instead of quality, hence the attempt to look \"smart\" while shifting plot lines like it's no one's business. Nicholas Cage (whom I usually take to be a rather good actor) is simply horrid, as is pretty much everyone else in the cast. I love Nicole Kidman, but she just ended up screaming and giving scared looks throughout most of the film. Then again, she couldn't do much with such thinly written characters. She at least looked stunningly beautiful, and it was rather nice to see her lips be regular shape and volume again, after much fuss over her face and plastic surgery/botox stuff. But, to get back to the point - Trespass is stunningly annoying, with horrible, cheesy dialogue, unnecessary and improbable plot changes, and lame editing. Overall, I would not pay even the \"On-Demand\" price for it, since it's not worth it. To be honest, though, I never expected much from the director of \"Batman Forever\" in the first place, so I'm not even surprised.",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "Lets start with why I went to see Trespass - because of Nicolas Cage, whom I try not to miss, ever! And then there was the bonus - Nicole Kidman as well, plus an experienced Thriller movie maker Joel Silver. But all that punched into the equation - the movie couldn't reach where it aimed. It's a hostage-at-house movie, where the family members & the goons are all hiding something from each other. Nicolas Cage is a diamond agent, with a huge mansion for his wife Nicole Kidman to sit around alone, as her husband is out of town making money and her teenage daughter is out partying. One of those rare days, when the whole family is home, becomes far from pleasant, when a gang of masked people barge into their house, taking the family hostage. Though the gang seem to have a lot of information about Nicolas & his family, the heist doesn't go as planned as people start revealing head-spinning secrets one by one. A cat & mouse game ensues, as the family constantly tries to escape while everybody involved try to figure out who betrayed who.",
      "total_reactions": 0,
      "user": "Sharit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "Who said Home Invasions movies are dull and cumbersome? Well, Joel Schumacher, Nicolas Cage and Nicole Kidman have proven that they are. Trespass is labeled as Psychological Thriller, but it should have been put under Patience Tester, itâ",
      "total_reactions": 0,
      "user": "Mediocre_Soul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "I've gotta wonder how many times more would I got suckered watching a movie that has Nicholas Cage on it. \"Hey, at least it has Nicole Kidman on it,\" I thought to myself. She didn't help much though. Trespass is a thriller movie a la Panic Room, and not as good. It's often needlessly noisy, tiresome and slightly over-the-top. Imagine trapped inside a house and there are continuous shouting between the robbers and the victims, \"I'll shoot!\", \"Please don't!\", \"I want your money, wife and daughter.\" repeated all over again.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "The movie is of course nothing that hasn't been done before, but I did enjoy the constant suspense and good acting. Unfortunately I couldn't stand the crack-head woman in it. I'm not sure why it's always female characters that ruin movies - but she was awful. It was like they put her in for nothing more than a tiny bit of nudity. Aside from that, it was a decent watch but nothing original. Cherry Tree Lane still remains to be my favourite hostage-in-my-own-home movie.",
      "total_reactions": 0,
      "user": "mako_psy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Script-4/10",
      "total_reactions": 0,
      "user": "Arefin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "Schumacher succeeds only in adding yet another un-watchable film to his portfolio. 'Trepass' is flawed to such an extent that you wonder how it got made in the first place.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Acting was solid, Constant suspense kept you on your toes but it never really went any where. Very anti-climactic ending that was like a spit to the face of anyone who sat through it. It wasn't a bad movie, I enjoyed it, and I did not feel it deserved as low of a critic score as it got because I have sat through far worst. I just wish the ending was better.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This film was not that bad. It annoys me that great and famous actors are playing in films only for money. The plot is good though and the action of the movie is good too. It keeps you but it's not a film that you would recomend to someone else as there are other much funnier and better home invasion films",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "All right, let's start with the positive. \"Trespass\" has some decent cinematography and editing. Now, let's move on to the negatives. The movie's script, dialogue, story and a large portion of the acting are trash. It's like the movie's storyline are put together in a couple of weeks. Definitely not a recommendation.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Has Nicholas Cage ever made a bad movie? Granted that some haven't been as good as Trespass, but when you see Nicholas Cage's name, you know you're always going to be entertained. Teaming up with famed Director Joel Schumacher and the always intense Nicole Kidman, Cage stars in a type of film we've all seen before. Trespass has a common storyline, but it's done in an unexpected way, with an ending that will leave you speechless. Kyle Miller (Nicholas Cage) is a wealthy diamond merchant, who has finally built the mansion he's always wanted. It has also made him a target for a sophisticated team of thieves, who want their share. Surprised at home one night, the Miller family is held hostage. Positive that if he gives them what he wants his family is dead, Kyle refuses their demands, leading to an epic standoff. Nicholas Cage shows a different side in Trespass, as he's not the cunning hero that saves the day, but rather a family man, trying to protect his family. He's paired with Nicole Kidman, who while being a terrific actress, usually makes films I have no interest in seeing. An action thriller is also something out of the norm for her, but she handled it like a pro and her chemistry with Nicholas Cage was outstanding! Finally, the cast is rounded out by OC star and teen heartthrob Cam Gigandet. I've made it clear that I feel a lot of these \"heartthrobs\" only get jobs because of their looks, and if that's the rule, Gigandet is the exception. Playing both sides in the conflict, the young star does an outstanding job. Gigandet's character is easily the most complex, having to play the good and the bad guy. It's his role and the twist associated with it that makes the whole film rise above similar films like Panic Room. On the surface Trespass is just another copycat, but the story turns out to be far more complex than a home invasion. A unique cast of characters with terrific chemistry, combined with one of my favorite Directors, make for what can only be called a must see movie!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Trespass\" 10 Scale Rating: 3.5 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Trespass looks like a bad movie but,with the acting,the story and the cliché characters,this is just your average thriller/drama.Overall the movie surprises me because it was really not that bad.",
      "total_reactions": 0,
      "user": "Meth-dude"
    }
  ],
  "metascore": 37,
  "name": "Trespass",
  "num_weekends": 1,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 10,
    "year": 2011
  },
  "opening_weekend_income": 16816,
  "opening_weekend_income_currency": "$",
  "rating": 5.3,
  "rating_count": 35419,
  "rating_freq": {
    "1": 1518,
    "10": 1456,
    "2": 1446,
    "3": 2454,
    "4": 4406,
    "5": 8076,
    "6": 8756,
    "7": 4815,
    "8": 1859,
    "9": 633
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 123,
  "votes_per_demo": {
    "aged_18-29": 11060,
    "aged_30-44": 16129,
    "aged_45+": 4021,
    "aged_under_18": 43,
    "females": 5027,
    "females_aged_18-29": 2106,
    "females_aged_30-44": 2180,
    "females_aged_45+": 529,
    "females_under_18": 12,
    "imdb_staff": 2,
    "imdb_users": 35419,
    "males": 26845,
    "males_aged_18-29": 8844,
    "males_aged_30-44": 13735,
    "males_aged_45+": 3422,
    "males_under_18": 30,
    "non-us_users": 21801,
    "top_1000_voters": 352,
    "us_users": 4482
  },
  "year": 2011
}