{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.8,
    "aged_45+": 6.9,
    "aged_under_18": 7.2,
    "females": 6.9,
    "females_aged_18-29": 7.0,
    "females_aged_30-44": 6.8,
    "females_aged_45+": 7.0,
    "females_under_18": 7.9,
    "imdb_staff": 6.9,
    "imdb_users": 6.9,
    "males": 6.9,
    "males_aged_18-29": 7.0,
    "males_aged_30-44": 6.8,
    "males_aged_45+": 6.9,
    "males_under_18": 7.1,
    "non-us_users": 6.9,
    "top_1000_voters": 6.6,
    "us_users": 6.7
  },
  "avg_screens": 2540.6,
  "budget": 30000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 18,
    "month": 3,
    "year": 2011
  },
  "critic_review_count": 351,
  "duration": 113,
  "genres": [
    "action",
    "mystery",
    "thriller"
  ],
  "gross_income": 61094903,
  "max_screens": 3043,
  "mc_avg_user_score": 6.6,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 94,
  "mc_movie_name": "Unknown",
  "mc_negative_rating_frequency": 29,
  "mc_positive_rating_frequency": 168,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 90,
      "summary": "A stylish and muscular thriller with some nifty twists and turns, a wicked sense of humor, several terrific performances and not one or even two but three of the best car chases in recent action-flick history."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "It works as designed."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Unknown actually has enough of a sense of humor to admit what it is: hybrid corn. But it's been crossbred from Hitchcockian stock."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Neeson has a way of getting upset - a frantic purposefulness - that fills viewers with both empathy and anticipation: He's so miserable that we care."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "The weakest link in Unknown - okay, other than the utter preposterousness of its entire premise - is Jones, who as a modern-day version of Hitch's ice queens can't hold her own with the likes of Kim Novak, Grace Kelly and Eva Marie Saint."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "It's all very Hitchcockian, at least for a while. And clever and exciting, too, even if the convergences begin to strain credulity, and, when you think about it, defy logic, too."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Sleek and, until a stupidly violent climax, very entertaining, Unknown is the opposite of \"Memento.\""
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Unknown is finely tuned pulp filmmaking, a dumb movie with a smart veneer, which is nothing to sneeze at."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "Though cinematographer Flavio Labiano turns the city into an alien maze of steel and glass, his chilling work is undercut by a script with more logical craters than Martin's."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "You could do worse than this fast-paced, cheerfully ridiculous, generally satisfying romp."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "Despite its A-movie aspirations, as the chases continue and the plot holes widen, Unknown quickly settles into the familiar B-movie comfort zone."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "A nifty international thriller of the \"what if?\" variety."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "Jones delivers her line readings so robotically that even her truths sound like lies. She's got the look of a Hitchcock blonde, and the movements of a deer in the headlights. Even her kisses look fake."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "Director Jaume Collet-Serra provides a steady flow of suspense and a very Polanski-esque feeling of paranoia."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "On a minute-to-minute level, it's an engaging mystery, the kind that rewards our participation with eye candy and adrenaline shots. But when we pull back for an overview, we see that it's flat and that pieces are missing."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "Neeson is much better suited to the loneliness and self-doubt of Martin's crisis than he was for the thuggery of the previous movie."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "Unknown is never boring, and Collet-Serra mostly keeps up a lively pace, but he doesn't do the movie any favors with the flat, dull way he films the scene in which we finally learn what's going on."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "It is the rare conspiracy thriller that ripens as the villains' organization and motives are gradually revealed."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Twisty, engaging thriller."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Unknown is probably the movie \"The Tourist\" wanted to be, if it had a pulse. Its sheer momentum makes Neeson and Kruger more attractive than even Johnny Depp and Angelina Jolie."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 58,
      "summary": "Framed as a cautionary thriller about the perils of high-stakes terrorism, but I took away a different message from it: Don't forget your briefcase at the airport."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 58,
      "summary": "The movie whips up a big old puree of ingredients borrowed from other cinematic recipes."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Not even Neeson, with his strength and his wounded-giant vulnerability, can prevent our interest in Unknown from sliding into contempt."
    },
    {
      "critic": "Michael Wilmington",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The snow and haze that Spanish director Jaume Collet-Serra (Orphan) keeps pumping into the street scenes seem to have drifted into the script as well."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The art of the classic Hitchcockian thriller is about style, pace and misdirection – and though Unknown is occasionally baffling and involves running and car chases, the film rarely manages to thrill."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "ignore the pileup of implausibilities and Unknown becomes a diabolically entertaining con game. Does it jerk you around? Yes. Suck it up. The ride's worth it."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Yes, Unknown is preposterous. That in and of itself is not a reason to avoid the movie. The problems lie in the way the absurdity is presented and the manner in which the screenplay resolves once the \"truth\" is revealed."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Tacked onto a perfectly respectable thriller, Unknown's mass of unlikely turns and implausible reveals make the whole film seem retroactively less sophisticated."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "I confess I felt involved in Unknown until it pulled one too many rabbits out of its hat. At some point, a thriller has to play fair."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a solid, engrossing thriller, but a slack one."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Beyond the occasional plot frissons and juicy supporting turns, it's an emotionally and psychologically threadbare exercise."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "As with its protagonist, Unknown boasts tantalizing issues buried deep beneath its frantic exterior, but little idea how to unlock or address them."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "This is no more (but no less?) than what we have rather oddly come to expect from Neeson in his late period (Taken, The A-Team)."
    },
    {
      "critic": "Elvis Mitchell",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "That's eventually what Unknown is - violent, impersonal and comforting."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "There are a couple of intriguing ideas floating around here and there, but that's all they do - float around, unmoored by any sense of reality and, thus, suspense."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "Trying to decipher all the convoluted pathways could drive you mad. Mostly, though, it is so ludicrous that it will unintentionally inspire laughter."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 30,
      "summary": "All of the nonsense piled on nonsense does provide some measure of pleasure. Unknown gets better by getting worse."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Unknown makes no sense at all, so you not only worry about Liam Neeson's judgment in movies, but you begin to wonder if he's forgotten how to read."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Bosnian women are bad drivers. They can't avert refrigerators that fall off delivery trucks without their taxi cabs careening off a bridge and into the icy depths of the river. Luckily for the passenger's sake, Gina is strong, every bit a man's equal in an emergency. With no time to waste, the cabbie frees herself from the sinking car and somehow has the presence of mind to save her wayfarer, Dr. Martin Harris, a botanist, who is in Berlin for a biotechnology conference, but at the moment of impact, is in a heap of trouble. As the Spree River diversifies its body into the rapidly-filling cab, Gina, going all Lou Ferrigno on us, bashes in the rear window with a car jack and pulls the doctor out of the reappropriated vehicle, then carries him to the surface despite being, undoubtedly, dazes herself from the crash, and considerably smaller than her hulk-ish fare. The rescue has such an over-the-top quality, it borders on wishful thinking, perhaps, a psychical emanation pouring out of the drowning botanist's mind. Maybe Martin is dead; maybe he never escapes his watery grave, a narrative ploy used to great effect in Herk Harvey's 1962 cult classic \"Carnival of Souls\", where a young woman emerges from the muddy waters on her own volition without realizing that she's dead. People see Martin, accepting the man as corporeal, just as people saw Mary Henry, with the exception that she's the right woman, whereas he's the wrong man. Like the church organist, could he be dead, as well? The moviegoer doesn't quite know what to think when Martin is deemed unrecognizable by his trophy wife and made to be non-existent with the presence of a replacement, also named Martin Harris, who has the nametag to prove it. Is Martin A in a parallel universe, or quite possibly, an amnesiac sitting in a padded cell at some mental institution, concocting a thriller of his own making? Throughout \"Carnival of Souls\", Mary is hounded by \"The Man\", an apparition seen through her eyes alone, and likewise, in \"Unknown\", an undefined man pursues Martin, making his first appearance in the tube, and the moviegoer can't know for certain if this slow-footed attacker really exists. At the hospital, Martin's stalker violently disposes of his kindly nurse(the doctor is killed off-screen), but maybe the bespectacled killer is a man-made manifestation, maybe \"Unknown\" is a \"Fight Club for Botanists\". What are the rules of the film, we ask. It's not until Gina can account for the hitman's tangibility, in which he and another hired man descend on her \"quaint\" apartment, do we start to rule out the notion that Martin suffers from a malady of the discognitive sort. He's sane, we think. It's not him, after all, it's them; they're responsible for this pell-mell, so in light of Martin's sanity being confirmed through a second pair of eyes, the man at the biotech symposium claiming to be Dr. Martin Harris must certainly be an impostor, right? Yes, but neither is \"Martin\" the preeminent science, a revelation that arrives later than it ought to, because the medical staff, Gina, and especially Ernst Jurgen, an ex-Stasi agent, who must know a thing or two about stringent interrogations, never ask Martin any questions, relative to his professional or personal life, that would expedite the so-called scientist's progress on the road to self-discovery. Good as the scene between Ganz and Frank Langella may be, it has a gravitas that the comparably lightweight thriller doesn't really deserve, in which the resumed rivalry among the opposing coldwar era communist superpower stalwarts almost comes out of left field. To me, the centerpiece scene should involve your star, but instead of sparring with words, Neeson's big turn isn't an acting one, but instead, is action-based when he goes mano-a-mano with a barely recognizable Aidan Quinn. \"I didn't forget everything. I remember how to kill you,\" Martin A tells Martin B, but in fact, he does forget quite a lot. Although this man and woman aren't husband and wife, they are quite in love, cold-blooded assassins with tender feelings for each other. When our Martin calls the other Martin in the Eisenhower Suite(in the 2003 Didier Van Cauwelaert novel \"Out of My Head\", it's his home), we see Liz in the background, lounging on the bed, without a second pillow, indicating that she and this new guy are sleeping in different rooms. She's monogamous. The sequence that takes us from the airport to the hotel where the assassins masquerade as a loving couple, to a great extent, is no masquerade, at all. Our nowhere man forgets this. At the museum, the hired man receives the hired woman's kiss because he feels obliged to, believing Liz to be his lawful wedded wife. He's acting; she's not. She says, \"I love you.\" It's not part of the script. Nobody is watching them. One day, when this man fully recovers his memory, he'll realize, in hindsight, that the feeling was mutual.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "I honestly don't understand the negative reviews for this film.  It is a very good thriller, and although the plot is 'out there', it is fully credible.  Plus, the casting was great, the twists and turns were unexpected, and the reveals were both shocking and fun.  Liam was very good, as was January Jones.  It was nice to see her in a deeper role than her Betty Draper role on Mad Men, plus it was fun to watch the depth of her role progress as more was revealed. Great Job.  Those who panned this may well have a genetic flaw.",
      "total_reactions": 1,
      "user": "lkusa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Very intelligent movie. It kept me thinking what will happen next. I was so into it that I wanted so badly to see the ending. Liam Neeson delivered a great performance and he was awesome. There were some twists in the plot that surprised me, which I haven't saw for a long time in a movie. But I still feel like there's something missing in the movie, I'm not sure what. Anyway, it's a good one.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "emm good movie not the best, the worst movie either, entertaining but not memorable ... I found it a good movie in the end of normal, it reminded me Burn trilogy .. only highlight is the dismal performance of January Jones",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "A cross-breed of \"Taken\" meets 'Bourne' who later meets \"Seven Pounds\" are the array of sorts we see from this conspiracy theory/psychological thriller that keeps you on pace for so long, diverts, returns, then leaves you guessing again til the last 15 minutes. \"Unknown\" is packed with surprising depth that leaves the viewer in shambles, and back to the drawing board in making sense of it all. Even more fascinating, minutes after watching, lies a dark, sulleness that lingers in the film's ambiance; the reliance and fragility of our own identity. The film makes it seem all the more plausible.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "It has a surprising and interesting way of revealing the plot, but it's one of those cases where you say: great idea, if it hasn't been done before. Let's just say it's a clever \"update\" on Bourne Identity. What is bad about it are the unconvincing attitudes of the characters: spies are highly trained, they don't simply do very dumb things unadvertedly. Anyways, the cliche-types of CIA agents are all there and after the first hour it goes down and somewhere we've already been in.",
      "total_reactions": 1,
      "user": "sergioltf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "The ending is unsatisfying, the pacing is off at points, and there is a lack of excitement to some degree, but Unknown's strong cast, including Liam Neeson, thrilling action, and second half to make up for some of its shortcomings. This movie is recommendable, but only a very small recommendation.",
      "total_reactions": 1,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Stylish, sexy and witty, till you realize \"Hey, I've seen this before\"",
      "total_reactions": 1,
      "user": "Nadim_Basna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I went to see the acting of Liam Neesom.  He never disappoints.  However, he cannot write or direct, so the movie is really mostly enjoyable if you are a fan of the lead actor.  The direction does throw a nice curve ball towards the end, and there are some supporting character actors that do nicely.  However, January Jones doesn't impress at all, in an ice queen Grace Kelly type role.  The girl cab driver role played by Diane Kruger is memorable as is an old man who assists Neesom and a couple of men in the villain roles.  Some good acting and a nice twist but not enough to be successful because of the writing makes the story leave you with too many questions.  Not very realistic or believable.",
      "total_reactions": 1,
      "user": "2PIN-1STIN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "diane kruger was great in this movie.  she did her accent very well.",
      "total_reactions": 1,
      "user": "helpsos"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Don't listen to critics. I dont know why they think they are right about every film. This movie is terrific entertainment. The twist wasn't complicated and the action was well done. Its only meant to be a action movie. Its not trying to be an academy award winner",
      "total_reactions": 1,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Well that was a terrible hybrid of the Bourne Identity, Inception and the Fugitive. Extremely disappointing and highly convoluted. The special effects finishing was poor enough that it made me wonder if they had run out of budget for the right level of post production",
      "total_reactions": 4,
      "user": "Redhotone"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Very entertaining movie.  Lots of action but not overdone and good plot.  I went in thinking the plot was going to be ridiculous but it wasn't, it was reasonable.  Enjoyable actors to watch.  Overall a fun time at a movie.",
      "total_reactions": 7,
      "user": "Bama72"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Enjoyed the movie until the ending. Not as much action for something that is advertised as action packed. Had more then one occasion where moments that should have been surprising were not. Diane Kruger kicked more butt then Neeson. Spoilers:",
      "total_reactions": 6,
      "user": "Alfred"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Was a very good movie with suspense that really made you think hard to figure out what was going on. The movie started out very slow and dull, but made up for the slow start with an overall great showing of events. I highly recommend this film to anyone who likes suspenseful movies with an interesting story.",
      "total_reactions": 3,
      "user": "Justp94"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I do not expect this movie to win any awards.   However, this movie was very entertaining.   It kept my attention from start to finish.  The acting was good.  The plot was interesting.  There were several \"twists\" in the story that were interesting and understandable.    It is my opinion that a few of the \"action\" scenes were exorbitant, but in 2011 it is probably expected by a majority of the audience.  I recommend this film.",
      "total_reactions": 13,
      "user": "ajs101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Man, what a disappointment. You think you're going to see the first awesome movie of the year ands you just come out with wasted potential. At the start of the movie, I was really into it. The opening scenes were very well done and I thought e would finally be in for a great movie. But alas, I was wrong. Once were about a third into the movie, it goes from being an intense mystery/thriller to Michael Bay impossible crap. Seriously there was one scene that just made me shake my head and let me asking \"Why did they have to ruin the build up like that?\" Then towards the end it goes back to being a good, intense movie(except for the twist, but more on that later). Liam Neeson was the shining point in what was an otherwise really bad movie. He elevates every scene he's in to awesome. I mean come on he's nearly 60 and still kicking ass! What more can you ask for? The rest of the cast is fine, but nothing special. Now, onto the twist. This is the thing that kills the movie. Not only was it lackluster, but I(like many) saw it coming from a mile away. Also, there was no build up to it. They found Liam and basically just told it to him. Then the movie just went from there, almost like it didn't even matter. The only good thing to come from the twist was that it led to a really cool(albeit dark) action scene. Hands down best scene of the movie. So overall, Unknown falls far below expectations, is decently acted, has great action sequences, and a horrible twist. This year just continues to be mediocre.",
      "total_reactions": 5,
      "user": "sh831994"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "I rarely bother to post a review, but this movie was so terrible I felt obligated to try to help other people avoid wasting their money.",
      "total_reactions": 5,
      "user": "markscarls"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I can see now that I will never be a professional movie reviewer. The pros have lost the simple pleasure of just being a spectator and taking the ride. I suppose the premise was a bit unbelievable but not beyond plausibility. The action was intense but largely within the bounds of Newtonian physics. Hero's hanging off helicopters by one pinky toe while curving bullets is a sure way to suspend my suspension of disbelief. I don't recall a single instance during Unknown that triggered my b.s. alarm. (And it has a hair trigger!) Like the cabbies bumper sticker says \"get in, shut up, hang on... and enjoy the ride.\" I did and am grateful for the experience.",
      "total_reactions": 7,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I thought the twists we're good, and it was very suspenseful. I cant really see why the critics have given this movie such a bad rating, it makes absolutely no sense at all. Take a look at true grit...... it was incredibly boring, plot lacking, etc,etc. Critics gave that one an +80% rating, while this movie which kept me entertained, and actually did its job as a movie got atrocious reviews. I don't really see where Unknown failed, its plausibility of story line? Thats not what makes a great film.... Everything was very well put, and i had the same feeling i got from watching the Bourne series, which somehow also got bad reviews. Ive come to realize that if avatar can get a ridiculously high score, while having a recycled plot line, that the reviewing system is broken. Reviewers have lost touch in what makes movies very good. The true reviews come from the users which are the ones who actually experience the cinema unbiased. This movie gets a 9/10 from based on entrainment, suspense, twists, and action..... F movie critics.",
      "total_reactions": 7,
      "user": "xishnik100"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Really? This movies had an interesting idea, but failed to execute in every way. The plot stalled for 30 minutes and then in 1 minute it would accelerate illogically fast and make the most unrealistic sense. The camera shots during fights were awful. During fights, the camera would basically have a seizure, and the action would blur, and somehow somebody would be dead on the floor. The actors seemed to stop acting in the middle of the film",
      "total_reactions": 6,
      "user": "theBIGkBUNS"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "DUM DUM DUM.  This movie is ridiculous, an insult to intelligence.  Phoney Bosnian, Jamaican, German accents, 2 dumb bimbo blondes.  What is Liam thinking?",
      "total_reactions": 6,
      "user": "Eden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Liam continues his awesome Taken streak of total action in this movie. The suspense lasts through out the whole move and the car chases are extreme! I can easily say one of the best actions movies in a long time! I rarely get any time to relax or do anything recreational, and I can easily say- this was time well invested. I highly recommend this movie to anyone who likes any kind of action movie, Mercedes car chases, and intense suspense!",
      "total_reactions": 2,
      "user": "dianadonna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Very poorly conceived plot with gaping holes and poor dialogue.  It had all the required car chases, assassins, etc. but not worth the celluloid in the end.",
      "total_reactions": 2,
      "user": "churtonhills"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "This movie is nothing more than a poorly executed Bourne Identity knock off. On top of throwing in every generic action movie cliche, including a bomb with a digital countdown clock and an over the top car chase scene, it was also full of plot holes, and the characters were so flat I couldn't be bothered to care about them in the slightest. The ending scene was fairly cool, but other than that, this was just another bland action movie. Sad to see an actor as good as Liam taking roles like this.",
      "total_reactions": 2,
      "user": "em872011"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "\"Unknown\" presents a profound problem to its subject, a man whose life was stolen; how can you claim that you yourself is you? The question molds the movie into somewhat a french noir for the moment, but it ends up as a action movie with a decent plot twist. However I'm surprised that Liam Neeson, a man whose almost 60 now, can still be a (tall) badass with a pistol fighting with skills. Meh, he'll get old soon. R) 5.4",
      "total_reactions": 2,
      "user": "AKoreanCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Unknown looks extremely awesome and Liam Neeson could kick any ass in the movie,since Taken which is okay. But this epic thriller looks groundbreaking clever film that is so dark and deeply suspenseful.",
      "total_reactions": 7,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Excellent cerebral movie with good character building, story & action. Perfectly acted though a few times predictable outcome. Would go see again just to make sure I didn't miss anything.",
      "total_reactions": 5,
      "user": "FLCricket"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This film was decent until the first chase scene then it imploded into the preposterous. The second half was so convoluted that it insulted me. The only insult they did not deliver to the viewer was Liam making love to the young girl. Still, it was better than tv on a Sunday night.",
      "total_reactions": 8,
      "user": "JamesL"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "You all know because of the trailers that there's a man how is a doctor",
      "total_reactions": 6,
      "user": "Malasawas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Liam Neeson stars as an American doctor in Berlin for a meeting, who's in a splashy accident. That's only the beginning of his troubles. He discovers that his wife doesn't recognize him and his identity has been usurped. Needless to say, paranoia, violence and car chases ensue. While it's acceptably intriguing, nothing about the suspense or action is particularly distinctive. Basically, it's a mild imitation of ****",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Didn't see anything wrong with it, good twist along with good acting.",
      "total_reactions": 3,
      "user": "MatthewXploder"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I agree that the movie was overblown at times and there were too many \"coincidences\" and episodes where the bad guys seemed to know where everyone was going to be at all times, but much of that makes sense at the end when we discover the true history of the Liam Neeson character.  I thought it was fun guessing at the motivations of the characters and the action sequences were  filmed in a way that put you right in the middle of the action.  So, I'm usually a tougher critic, but I think it was an entertaining couple of hours.",
      "total_reactions": 3,
      "user": "bonniej55"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "The movie is not only ridiculous but a typical anti capitalist, \"progressive\" propaganda piece.  If your politics lean toward the communist, socialist agenda then you most likely will enjoy this movie even though it is so incredibly ridiculous that it should have your eyes rolling on a number of occasions.  If you lean more toward conservative views then I would imagine you will hate it.  I don't know what would be considered a spoiler here but I do have to mention...how does one stick a device next to a powered down laptop in a briefcase and manage to magically access the hard drive???  Can anyone ape that ridiculous premise for me?  I'm an electronic technician and was thinking maybe there is some fm way of accessing a hard drive on a powered down computer.  Just one example of stupid, improbably things peppered throughout the movie.  If you liked Ghostwriter then maybe you'll like this too.  I hated both.",
      "total_reactions": 13,
      "user": "mrkeys1962"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "The movie kept the audience on the edge of its seat until the last 15 minutes.  The ending is so preposterous and disjointed that it ruins everything you saw before.  You leave the theater shaking your head in disbelief because nothing makes any sense.  Without providing any specific spoilers in the details - the guy you thought was a humbel good guy is really a bad guy.  And just like in professional wrestling he now turns good guy, but for what reason?  And he just waltzes away past the authorities without a care in the wold although they have pictures of him?  C'mon!  What the hell was the director thinking?",
      "total_reactions": 4,
      "user": "fantasy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "It manages to not be boring, but very little else. It's rare a movie this dumb this itself this seriously. There isn't a grain of camp or even a slight chuckle to counter the serious insipidness.",
      "total_reactions": 1,
      "user": "supersigy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 3,
      "text": "\"Unknown for what it is .. is a decent not so thrilling adventure .. with a flawless plot twist. Liam Neeson does not feel well suited for this role. More or less a disappointing but somewhat satisfying thriller .which is not saying much\" .. C-",
      "total_reactions": 3,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "I'm giving this movie a pass because it held my attention the entire movie and I enjoyed the Berlin setting.  It is not a perfect movie, however.  There are too many unbelievable coincidences that will make you roll your eyes in disbelief.  The action sequences were filmed very poorly (over-edited so badly you couldn't tell what was going on, especially the man-to-man combats).  However, Liem Neeson was very good and I liked the \"twist\" when we find out about his confusion over his identification.  I actually did not guess what the twist would be and I enjoyed it.  I liked \"Taken\" better than this one, but still liked \"Unknown\" enough to recommend it.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Please if you want to read good reviews go to CriticSpot - http://criticspot.blogspot.com.",
      "total_reactions": 2,
      "user": "2GUI2"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "entertaining, interesting, keeps your attention. critics suck because they pay attention to things that don't matter. if you want to watch a movie that's fun and fast paced, this is a good one. it's not earth shattering but it's definitely worth your time if you like action thrillers.",
      "total_reactions": 3,
      "user": "shaunmed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "An average movie, with an average plot, average characters, and average acting. Frank Langella shows up halfway through to steal some scenes, but it isn't enough to lift the rest of the film up.",
      "total_reactions": 1,
      "user": "Bancho"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "RECYCLING IN HOLLYWOOD, in a industry that should be cutting edge new. This movie takes old suspense plots, dialogues and contrived twists, to churn out a UNUSABLE product.  Like a bad pick up line in a bar!  OH! by the way good looking babe, 20 years younger that me,\" I am really a super talented secret agent, but have lost my memory, but am really a good guy, with a soft side. Can you help me?\"> Whatever dude! The acting started out good for the first 5 minutes, then lost all continuity as the recycling process began to churn.   AND the major plot holes, with all the supposed pre-planning, his blown cover, the inept police, no passport, and customs agents that hand over a bag with explosives, Liam goes around the city, as if he had a free pass to anything. Another one man Rambo ego movie that can take on the world. REALLY?  The Final Insult!  All that to prevent some scientist  from giving the world a strain of corn to feed the hungry nations.  If he really wanted to give the world a new corn strain, just post it on the net and all the rest is just mute, we wouldn't have to sit through another pile of rotting corn husk!",
      "total_reactions": 1,
      "user": "Kivoric"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Nice little action movie. Entertaining. Not memorable. It was ok. It is not Taken. I believe Taken was better, unpretentious. You could wait to rent it.",
      "total_reactions": 1,
      "user": "Guillo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Is snuff real?  The guys at Renegade certainly treat it as it is. Do yo ureally want to know?  This is some of the most scary stuff out there. Find out at renegade dot cm. You can also find their videos on youtube -- you need to search for renegade snuff movie.",
      "total_reactions": 1,
      "user": "OCClown"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Good movie! The plot seemed similar to Arnold Schwarzenegger's 1990 science - fiction action movie, Total Recall. If you were to change sci-fi action thriller to foreign intrigued mystery action thriller, change locations, Mars to Berlin, change Ronny Cox to Frank Langella, change free oxygen for all on Mars to lower cost corn development on Earth and change revolutionary hero, Quato to revolutionary scientist, Dr. Bessler.  As for Unknown.....the plot is so full of huge holes it simply falls apart, but if you are not a keen viewer; you would simple enjoy whats going on... and in the end I still enjoy it and can quote \"Good thriller, but don't go in expecting more than Taken\"",
      "total_reactions": 1,
      "user": "moviekretik"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "This is alot like Taken, but in my opinion not as good.  If you liked Taken you will like Unknown, and vise-versa.",
      "total_reactions": 1,
      "user": "aggiefanatic95"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "A very entertaining thriller that keeps you guessing about motives until the very end. Liam Neeson puts in a fine performance and there is enough action to keep just about every movie goer amused.",
      "total_reactions": 1,
      "user": "jgzeger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "I can't help but feeling that this film was made to cash in the success of \"Taken\".  And although there were elements to make it interesting, in isolation this film would seem less significant.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Very well made with some very slick editing keeping the pace pretty high all the way through. It did feel a little like a travelogue in parts, giving us all the iconic views of Berlin whenever the plot brings the action outside. To be fair though, there are a few seedier parts of the city shown as well. All the main cast played their parts well with Liam Neeson and Diane Kruger standing out. I also enjoyed the performance of Bruno Ganz as the ageing former Stazi agent and it was nice to see Frank Langella as Martin",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "I really enjoyed this movie. If you like the \"Bourne\" series or \"Taken\" with a bit less action then this is for you. I don't understand why it has not got higher ratings. The story starts well then goes a bit slower in the middle but I enjoyed the twists and the ending. Liam Neeson is again on form and its worth watching for his performance alone.",
      "total_reactions": 0,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "An interesting yet intriguing film. Having seen how tremendous Taken turned out to be and how superb Liam Neeson was I had high expectations heading into Unknown. The plot was enticing - Doctor Martin Harris (Neeson) awakes from a coma having been in a car crash only to discover that his wife (January Jones) doesn't recognize him and that another man has assumed his identity. A clever idea and one which initially plays out pretty well. Harris on the search to find out exactly who he is and what happened. This builds up the intense and mystery elements within the film. Along the way Diane Krugers character Gina becomes more involved and her performance is fantastic as an illegal immegrant caught up amongst Harris' troubles. Unfortunately the work done to add the mystery and intense side become overshadowed as the film loses its way at times and there are some sequences that just don't quite fit in with the way the film was planning out. The ending for me was rather cheap in what what overall a fairly decent thriller. It made it into yet another conspiracy theory with a secret organization but somewhat confusing given the fact that Neeson's character hadn't shown any signs or had any incline to believe he was an assassin, it was trying to pull a Bourne Identity on the viewer and i'm sure I wasn't the only person left feeling disappointed with the ending. Overall, Unknown is by no means a bad film its an enjoyable and interesting film that starts off promising good things but gradually loses its way and even Liam Neeson at his best at times cannot get away from the disappointment it was a missed oppertunity.",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Who writes screenplays like this? Excited 12-year olds? It tried to be the Bourne Identity but ended up being a mix of every clichÃ© from every 'tough guy against the world' movie ever made. The fight sequences were dull and involved the camera moving more than the fighters. The car chases were dull and unbelievable - you can't keep driving down crowded pavements and never hit anyone. Well, unless they are trained stunt people who keep flamboyantly diving out of the way!",
      "total_reactions": 0,
      "user": "WillWong"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "The mystery and suspense is there but it takes a backseat to random action. Clues are given randomly and huge gaps in story line are treated with explosions and gun fights to continue the viewers interest. Overall this film is just trying to hard to be TAKEN and the plot just isn't as good.",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "First off, Iâ",
      "total_reactions": 0,
      "user": "CavyAmador"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "I thought Unknown was a fairly good film and one that definitely retained the atmosphere one would come to expect associated with an action thriller starring Liam Neeson. Although not as engaging as Taken, the film still managed to deliver in most departments. The action and suspense had me entertained to the very end, which did not leave me disappointed. The storyline was relatively solid and the twists just as much so. This film is yet another positive example of modern action thriller, and in saying so I recommend it to fans of the genre in general.",
      "total_reactions": 0,
      "user": "Alexander_N"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "While not Liam Neeson's best, the role does suit him well. A mysterious thriller movie, I definitely was pretty stunned by the outcome of the conflict. The movie did a great job of keeping details skewed enough but not too vague in order to keep the watcher hooked. Although some of the details didn't add up once the secret was revealed, most of the movie was actually pretty believable. Definitely recommend watching at least once.",
      "total_reactions": 0,
      "user": "harlthegr8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Very entertaining movie. The filming reminds me of the movie ''Taken'' (also with Liam Neeson). Very intriguing plot with superb actor screenplay. Do not expect the movie of the year but it's worth the listening.",
      "total_reactions": 0,
      "user": "Kallins3122"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Unknown is an alright film. The story can be interesting and some scens are really cool. Problems with this film is alot of things in the film didnt really make senese at all and there are films that ive seen that are better then this. I would give this film a high rental.",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "I created a user name just to speak publicly about a movie that, I feel, is a cheap and mindless pile of garbage.  The \"Unknown\" viewing experience goes like this: Liam Neeson flails around Berlin for about 1.5 hours telling everyone within five feet that he is who he says he his, then there is 0.5 hours worth of mildly discernible plot, then the movie ends.  While those things happen, we hear Neeson deliver lines like \"I'M DOCTOR MARTIN HARRIS\" and \"THIS MAN IS NOT DOCTOR MARTIN HARRIS\" and \"I remember how to kill you, ****  We watch Frank Langella play Frank Langella.  We watch January Jones use her brain to create sound with her throat and mouth, then explode (the highlight of the film, far and away, is watching January Jones explode).  It's a crappy movie!  Rating: Not Very Good!",
      "total_reactions": 0,
      "user": "jollies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "This film is yet another story of how a well made trailer can trick you into thinking itâ",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "It was awesome ! Liam Neeson did it again ! A suspense full thriller just as i thought it would be ! The whole movie is a combination of every thing what a film needs . Story was good , directing was very good , acting was Top class . Diane did a very good job . and Liam was like always !  Story : 1.6/2 [Good story]",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Il est dommage de faire la comparaison avec Jason Bourne dÃ¨s la bande-annonce, tant ce dÃ©tail peut gÃ¢cher le suspense. Et bien qu'il soit infÃ©rieur Ã  la trilogie et Ã  Taken, Sans IdentitÃ© s'en sort quand mÃªme avec un scÃ©nario dÃ©jÃ  vu (pour les grosses ficelles) mais intelligent, prenant et palpitant; de bons acteurs et surtout une mise en scÃ¨ne dynamique.",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Haven't seen a good movie like this in a while. Regardless of the amount of plot twisting, it still keeps you on track and everything is explained smoothly. Definitely a movie worth watching!",
      "total_reactions": 0,
      "user": "iAGR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "While Unknown ultimately relies on several action movie cliches to make its way to the conclusion, it also manages to become less of a cliche than most action films being produced today. Slick and interesting camera angles, terrific use of different colors and lighting schemes to perfectly match the tone, and all around outstanding special effects bring some of the most thrilling car chases and most expertly edited flashback scenes in recent memory. With a grand performance by Liam Neesson, this film is a rare treat: an action movie that is more than just cheap thrills, but dramatic and character oriented with a wonderful twist ending to boot.",
      "total_reactions": 0,
      "user": "Alexander_Fred"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "Liam Neeson has a very particular set of skills and instead of using them to save his family, this time he's using them to save himself. Dr. Martin Harris (Neeson) has gone to Berlin, with his wife, for a medical conference, when an accident has left him in a coma. Upon awaking, no one knows who he is, not even his wife, but worse than that, there is another person walking around claiming to be Martin Harris. I don't know about you, but after three Taken movies and a handful of similar film, all starring Liam Neeson, playing the same type of character in the same type of situations, I've gotten pretty tired of him and his particular set of skills. At least the Taken movies moved at a reasonable pace and had more than a narrow focus, the same can't be said for Unknown. Parts of this film are as slow as can be, featuring Neeson and company sitting around talking about what could be going on and what to do before they show them doing it. They story is also so narrowly focused, that it leaves little flexibility for anything else. This film is as serious as it gets, it is a hundred percent focused on the story at all times, and Liam Neeson is as dry as the banks of the Colorado River. The chase scenes were cool, the conspiracy around everything was well written, but all in all this film feels very long and moves way too slowly for an action thriller, not to mention, I think I speak for everyone when I say we've had more than enough of Liam Neeson in these type of films.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "In my opinion this is a good movie, but nothing more than that. The beginning of the film goes perfect, it has a great flow, but that flow dissapears after a while. The story seemed to be new, original, but it didn't have a surprising end which I regret badly. Ofcourse there isn't much to say about the actors. A top cast, good playing, especially January Jones. I guess she will be seen often in the future. I really liked the music, it suited the film perfectly, lifted up the tempo when needed. Despite the fact that the plot is a litte bit clichÃ©, this film, is quite good.",
      "total_reactions": 0,
      "user": "Dongangstar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "God awful drag of a movie.  Slow, static, one dimensional characters you don't care about.  2 hours I'll never get back.  I read a critic called this film stylish too.  What?  Stylish like a European Hooker?",
      "total_reactions": 0,
      "user": "Hyperbole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "A poor Bourne rip off, with bad writing, weak plot and generally cheesy acting.",
      "total_reactions": 0,
      "user": "nascent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "An interesting plot, and a somewhat original delivery in what I expected to be a standard action-thriller.  Liam Neeson is as good as ever, but in all honesty I unwound the plot in my head within the first 15 minutes.  Without intending to demean intelligence, but if you are a very logical thinker you probably will have a similar experience as I did.  Other people may enjoy this movie, if only once.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Unknown is a cleaver thrill ride that makes you think and keeps you entertained from start to finish. The key to these kinds of movies is the explanation, can't be to extreme and can't be stupid. I say Unknown sits right in the middle.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "The movie was solid up until the ending which I was dissatisfied with.  I enjoyed the characters. It was one of the much better mystery suspense thrillers I have seen though.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Thriller muy interesante, en el que se mantiene en todo momento el interés por saber por qué Liam Nesson está siendo engañado. Historia muy bien construída. Nos enseña el poder de la mente, y cómo nuestra ética puede cambiar cuando nuestra mente no nos dirige. Buenos personajes, Nesson, su esposa, la taxista, el detective, los \"malos\".",
      "total_reactions": 0,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "A great thriller that will have you intrigued until the end.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "America seems pretty hellbent on watching Liam Neeson kill foreigners. This thriller doesn't have any thrills, that's for sure. What it does have is an incoherent plot worsened by sloppy execution.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Even the eternally awesome Liam Neeson only just saves this pretty pointless film and its eventual disappoint of a twist from complete failure.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "I really liked this. After Liam Neeson's work in Taken, I was excited for his next action movie...he's become quite the action star. Unknown did not disappoint, even despite some annoying flaws. There are really only 3 things that bothered me about this film: 1) January Jones cannot act. She's as wooden as a board in every scene...same as her role X-Men First Class. 2) Some of the things Neeson's character forgets and remembers is silly and \"convenient\" for my taste. I get that he had memory loss, but I don't like it when films take advantage of that fact to force an interesting plot. 3) The ending was a bit much...if I can forgive a \"convenient\" story line, the least you can do is give me a strong, original ending. I've seen it before. Other than those things I thoroughly enjoyed this film. The action was great; the locations were great. I liked most of the actors. A pretty solid action thriller...I recommend it!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Unknown takes some ludicrous turns on its way to the final act, but because Neeson's so totally convincing as this amnesiac desperately searching for the truth, you can overlook a lot of the illogical leaps taken along the way. Add in director Jaume Collet-Serra's staging of the action scenes (including one of the most impressive car chases of the past few years), some particularly brutal fight sequences, and the atmosphere provided by actually filming in and around Berlin, and Unknown's a fairly intriguing and well-paced thriller.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Liam Nesson e Diane Kruger arrasam no seus papeís, um bom roteiro,com boas cenas de ação. Jaume Collet Serra entra perfeitamente no gênero suspense de ação.",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The trailer seemed good. The movie was Ok. I didn't really like the ending. It was predictable and it didn't really make any sense. That's sad as the plot is not that bad( expect the ending)",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"Unknown\" is a stylish galvanize thriller that shocks you by it's twists and turns, while Liam Neeson uses strength as this vigilante, wounded-giant character under the direction by Jaume Collet-Serra (Orphan). Doctor Martin Harris (played by Neeson) an American Bio-technologist, arrives in Berlin, with his blonde wife Elizabeth (January Jones) to attend a biotechnology presentation. On reaching the hotel he finds out his luggage is missing, he takes a cab and goes straight back to the airport to get it, before he can inform his wife the cab meets for accident and falls into a bridge. The female cab driver (Diane Kruger) saves him. Then, Dr. Harris is taken to a hospital spent four days suffering a coma and finally regains consensus. He also recovers amnesia remembers his wife also why he is there. He leaves the hospital and tries to unite with his wife, but when he is there at the hotel he tries to the security to arrange for a meeting with his wife. He believes his identity was stolen and token by someone else, even his own wife refuses to recognizes him. Now his only hope is his taxi driver named Gina, who is the only witness of the car accident can help him. Him and Gina set out to prove who he really is. When the big finale was finally revealed it was silly and it was confusing, as it finally revealed I said to myself \"really? I spent two hours waiting for this?\". The film did lose points for a reckless finale but the screenplay was thought provoking and the performances were great. Grade B",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Well… Liam Neeson did not gave his best performance but it was still decent.This is not the biggest action movie you will find but it's still entertaining.The movie is pretty good even though the overused of CGI for the car crash was absolutely horrible.Overall a good decent movie that will entertain you but nothing really impressive.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Unknown is the first of three unrelated collaborations between Liam Neeson and Jaume Collet-Serra. I have to say that this is the weakest of the three. Unknown draws you in during the first half and really makes you think but its easy for a few points to go by unnoticed that become more important as the movie goes on. I like that Liam Neeson is basically a normal person to start out the film so he's easier to get behind and you don't feel like he is invincible. My big problem with Unknown is that there is just too much going on and its easy to get lost.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Liam Neeson is Dr. Martin Harris, a man who has a very particular set of memories he has acquired over a very long career in biochemistry.  Or is he?  After arriving in Berlin with his wife – played by Betty from Mad Men – for a biotechnology conference, he’s involved in a car crash and gets a bonk on the head.  After staggering back to the hotel he left his wife in, he finds her at a drinks reception for the conference with some sciencey types and a man who is not played by Liam Neeson, but yet claims to be Dr. Martin Harris.  Two Martin Harrises, buuuhhhh?",
      "total_reactions": 0,
      "user": "ponderflix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "\"Unknown\" was a slightly exciting movie because this killer plot , cast , more or less , for action and suspense is what is left , but entertainment is missing.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "Entertaining thriller that took some turns I did not expect. It seems very standard for the Liam-Neeson-action-movie genre, so it's a lot of fun if that's what you want to see!",
      "total_reactions": 0,
      "user": "tethysdust"
    }
  ],
  "metascore": 56,
  "name": "Unknown",
  "num_weekends": 5,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 18,
    "month": 2,
    "year": 2011
  },
  "opening_weekend_income": 25453015,
  "opening_weekend_income_currency": "$",
  "rating": 6.9,
  "rating_count": 216495,
  "rating_freq": {
    "1": 1042,
    "10": 12226,
    "2": 944,
    "3": 1974,
    "4": 4977,
    "5": 14689,
    "6": 43994,
    "7": 79101,
    "8": 43478,
    "9": 14070
  },
  "release_day": 18,
  "release_month": "February",
  "release_year": 2011,
  "user_review_count": 331,
  "votes_per_demo": {
    "aged_18-29": 84535,
    "aged_30-44": 84506,
    "aged_45+": 16322,
    "aged_under_18": 341,
    "females": 26346,
    "females_aged_18-29": 12721,
    "females_aged_30-44": 10286,
    "females_aged_45+": 2269,
    "females_under_18": 53,
    "imdb_staff": 17,
    "imdb_users": 216495,
    "males": 164146,
    "males_aged_18-29": 71119,
    "males_aged_30-44": 73241,
    "males_aged_45+": 13809,
    "males_under_18": 287,
    "non-us_users": 125685,
    "top_1000_voters": 621,
    "us_users": 27817
  },
  "year": 2011
}