{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.6,
    "aged_45+": 6.1,
    "aged_under_18": 7.2,
    "females": 6.6,
    "females_aged_18-29": 6.7,
    "females_aged_30-44": 6.4,
    "females_aged_45+": 6.5,
    "females_under_18": 6.2,
    "imdb_staff": 7.4,
    "imdb_users": 6.8,
    "males": 6.7,
    "males_aged_18-29": 7.1,
    "males_aged_30-44": 6.6,
    "males_aged_45+": 6.0,
    "males_under_18": 7.3,
    "non-us_users": 6.5,
    "top_1000_voters": 5.6,
    "us_users": 7.1
  },
  "avg_screens": 23.75,
  "budget": 50000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 17,
    "month": 5,
    "year": 2013
  },
  "critic_review_count": 261,
  "duration": 96,
  "genres": [
    "drama",
    "sci-fi"
  ],
  "gross_income": 415067,
  "max_screens": 43,
  "mc_avg_user_score": 6.9,
  "mc_metascore": 81,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Upstream Color",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 82,
  "mc_pro_critic_reviews": [
    {
      "critic": "Trevor Johnston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "If you’ve ever sat at your desk wondering whether there’s more to life, or been kept awake by an insidious hum in the darkness, this will speak to your soul – even as its enveloping, disturbing, uplifting story sends your mind reeling with giddy possibilities."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "Part science fiction scare movie, part offbeat romance, part completely unclassifiable, \"Color\" is also one-man filmmaking of a remarkable sort."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 100,
      "summary": "It might be fair to argue that the resonances of Upstream Color are too obscure and internal — many viewers have and will be baffled by it — but it’s the type of art that inspires curiosity and obsession, like some beautiful object whose meaning remains tantalizingly out of reach."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 100,
      "summary": "You may not be able to figure it out, but that's part of the point of this sensually-directed, sensory-laden experiential (and experimental) piece of art that washes over you like a sonorous bath of beguiling visuals, ambient sounds and corporeal textures."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 91,
      "summary": "Upstream Color culminates in a wordless final act that is among the most transcendent passages of pure cinema in memory."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 91,
      "summary": "Upstream Color is routinely confusing but not oppressively so; its final exquisite moments explain little yet still manage to invite you in."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 90,
      "summary": "It’s all a neat trick. Or exercise. Or brain-teaser. Whatever you want to call it, Upstream Color is like nothing you’ve ever seen before. But once you have seen it, once isn’t going to be enough"
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 88,
      "summary": "Dense, richly textured, and emotionally fraught - uplifting and devastating in equal parts - Shane Carruth's masterful sophomore effort is an abstract, elusive, but emotionally engaging love story that's more tone poem than drama."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "Henry David Thoreau plays an enigmatic role in Shane Carruth’s hypnotic thriller — an oxymoronic term to describe a film that is truly sui generis."
    },
    {
      "critic": "Simon Abrams",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 88,
      "summary": "A romance, a thriller, and a science-fiction drama, Upstream Color tantalizes viewers with an open-ended narrative about overcoming personal loss."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 88,
      "summary": "Upstream Color is lush, rhythmic, and deeply sensual, a film of exceptional beauty."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "As willfully oblique as his first film was densely foreboding, a rumination on the perils and pleasures of interpersonal connection that would seem to refuse any easy connection with even the most curious of audiences."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "It is invigoratingly freaky and strange, with a Death-Valley-dry sense of humour somewhere underneath — though a little derivative sometimes. More than once, Carruth gives us a close-up on a hand ruminatively stroking a surface: very Malick. And the shots of creepy creatures swarming under the skin are very Cronenberg."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "How to sum up? You have to make synapse-spark connections, interpret events to your own satisfaction, pick up visual cues (a long stretch of the film is dialogue-free) and be happy with not knowing all the answers (you know, like in life — but not in most motion pictures). A perfectly judged, strikingly beautiful film, but also a lunatic enterprise which invites — even welcomes — befuddlement as much as wonder. A true original."
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Carruth’s furiously elusive second film skirts the line between nonsense and near-masterpiece, like Terrence Malick filleting \"Eternal Sunshine Of The Spotless Mind.\""
    },
    {
      "critic": "David Gritten",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "Carruth creates a wholly compelling world. And despite my irritation with his deliberate obscurity, my immediate desire when it ended was to stay in my seat and watch it all the way through again."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "So Upstream Color is defiantly pitched in its own idiosyncratic key, but it bears the unmistakable influence of Carruth’s fellow Texan Terrence Malick and also of Steven Soderbergh’s early films."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "With its fragmentation and mysteries, Upstream Color offers itself up as a puzzle as well as a philosophical toy that you can spin and spin until the cafe closes and kicks you into the night."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 80,
      "summary": "I’ve seen Upstream Color twice and liked it enormously while never being certain of anything."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Upstream Colors certainly is something to see if you’re into brilliant technique, expressive editing, oblique storytelling, obscuritanist speculative fiction or discovering a significant new actress."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "This is a warmer, less foreboding picture than \"Primer,\" not moving in any conventional sense, but suffused with emotion all the same."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Shane Carruth’s Upstream Color is a deliberate exercise in swooning obscurity. You either go with its considerable sensory powers or you scratch a groove on your head."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 67,
      "summary": "Meticulous and abstruse, Shane Carruth’s Upstream Color is an idiosyncratic film that invites explication but defies total understanding."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 63,
      "summary": "This enigma-delivery system from a sharp mind has enthralling moments but becomes a bit enervating in its self-seriousness. By the end, the whole thing feels more academic than mind-bending."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Upstream Color is weird, but it’s worth the time."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "To be bewildered by Upstream Color is to be human; the story is obtuse by design, though the filmmaking is X-Acto precise. But it's a bloodless movie, and its ideas aren't as tricky or complex as Carruth's arch, mannered approach might suggest."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "No one is going to explain any of this for you — and the slightly snobby implication of Upstream Color is that explanations are for suckers."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "The film was visually stunning, the storytelling was very inventive, and the acting was superb. It was unlike any film I've ever seen before. It is definitely one of my favorite films of the year.",
      "total_reactions": 3,
      "user": "mitcherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "I think the most disturbing thing about this site is probably seen in the reaction to movies like this.  I could see how this would be a divisive movie.  It is not traditional, it feels long (even if it's only 90 minutes), it is oblique, etc.  So if this received a number of diverse reviews from critics, that would be understandable.  Of course, it hasn't received anything like a diverse reaction.  There are currently 27 critic reviews, and not a single one is negative (at least to be judged by the color red).  That is odd.  Really odd.  And I don't think it's unnatural that a lot of users have questioned why that is.  There is obviously something that is causing reviewers to give this movie a pass.  It should at least be divisive, but not amongst the critics, I guess.  I like to maybe believe that it's because critics have seen so many movies that anything different is appreciated even when the different on display is not necessarily good.  That said, I think a lot of darker explanations are probably more on point.",
      "total_reactions": 3,
      "user": "AJones"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Sometimes I think the less movie critics understand a movie the higher their ratings will be.",
      "total_reactions": 11,
      "user": "netflic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Yes, it's a polarizing film, 4 people walked out 30 mins in,  but it's a worthy successor to Carruth's debut, \"Primer\" and one of the best films in this early year. This reminds me of \"The Tree of Life\" in how many reviews bloat a \"head-scratching\" plot. However, it's really not that difficult. The elliptical editing  similar to what Carruth achieved in his first, \"Primer\"  warrants more time to fully understand the plot, but it's by no means, impossible. After first viewing, it's a telling tale of deception and retribution, a complex story of theft while tracking down those involved (however loosely) and creating a life from the wreckage the deceit involved. It's worth the investment and is different from anything from a major studio you'll ever see  partially why it's self-distributed (by the director). Writer/director Shane Carruth, because of his stories' complexities and the depth at which his stories take viewers, including his willingness to self-distribute titles makes him one of the most important American directors  even with only 2 films under his belt. See this film, so you can watch again to fully understand the plot.",
      "total_reactions": 11,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "A dull non-narrative film that attempts to lure you into hidden depths which are shallow and unsatisfying.  Plot threads are presented and abandoned.  The characters are undeveloped, unsympathetic victims of a situation that neither they nor the audience understand.",
      "total_reactions": 10,
      "user": "delusionn"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This is an absolutely amazing movie. If you've seen and liked Primer, you'll like this too. The true greatness of the writing is evident when 45 minutes in, you're still wondering what's going on, and you haven't gotten bored. I put a lot of movies back after 20 minutes, because there's no hook in the writing. But this has a hook. It's ethereal. It's emotional. It's beautiful.",
      "total_reactions": 8,
      "user": "Gerbus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "This movie has a lot of mixed reviews.  The critics love it because of its esoteric nature, and a lot of viewers hate it for how difficult it is to sit through, how little dialogue there is, and the difficulty of interpretation.",
      "total_reactions": 4,
      "user": "coyotemoon722"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "Anyone who rates this pretentious garbage above 0 is a brainwashed idiot. This movie is a huge waste of time with no character development, terrible acting, and annoying music and sound effects. DON'T EVEN BOTHER!",
      "total_reactions": 4,
      "user": "killingspree"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "The achievements of a filmmaker should not be measured by the amount of headscratching he is able to generate among his viewers, and yet this seems to be the criterium according to which most critics (with the laudably honest exception of Stephanie Zacharek) are willing to grant Carruth the benefit of the doubt. Upstream Color is, for all its putative ambition, shallowly developed, indiscriminately written, portentously paced, cast ridiculously and acted woefully. You won't spend two more irksome hours in front of a screen, small or large, anytime soon.",
      "total_reactions": 20,
      "user": "audiovision78"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "A beautifully-shot, challenging ,and outstanding film.  I'm going to check out Primer as soon as possible, and I'll try to catch this one again before it's theatrical run has concluded.  I agree with most critics that trying to nail down the specific plot details is unnecessary to intuitively understanding and enjoying this film. Amy Seimetz is fantastic, and she plays well with Carruth.  The elegant visuals, coupled with the very interesting score, make this a film like no other I've seen in a long while. Here's hoping that we'll see many more films from Carruth in the not-too-distant future.",
      "total_reactions": 7,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "I would say this is the worst film i've seen this year, except that it isn't really a film at all, at least not by the usual definition.  There is no real plot, close to zero acting on display, and is almost as interesting as watching paint dry.  Have you ever wondered what it would be like to collect a bunch of film clips of the same people, sometimes doing familiar things, and at other times doing strange things that make no sense and string them together in a random array such that any hope of an audience actually following something akin to a story would be impossible?  Yeah, me neither.  Do yourself a favor, skip this one.",
      "total_reactions": 13,
      "user": "MeanJoeGreen"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "The last shot of this film? Breathtaking, amazing, heartwarming--you name it. Loved this film a lot, (even though I might not fully understand what the actual hell was happening half the time).",
      "total_reactions": 8,
      "user": "BlackfuryRises"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Most critics have missed the symbolism. It's an allegory for the dictatorial control writers and directors have over their characters, and the problems that can arise because of it. But if anything this perception makes the movie worse. It highlights how much is truly arbitrary.",
      "total_reactions": 6,
      "user": "filmviewer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "I LOVED Primer. It was brilliant. This is an unwatchable mess. Dude's been reading his press clippings and believing he's the great genius of independent American cinema. DO NOT waste your time and money renting this thing.",
      "total_reactions": 6,
      "user": "DudefromTulsa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "This is innovation of cinema  A beautiful film, a unique film. The soundtrack  the cinematography, all is completely beautiful, i see it like an experience. A Incredible experience.",
      "total_reactions": 3,
      "user": "indiegalaxy10"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Upstream Color is a hostile film, one that presents you with puzzling events and unsettling imagery and seemingly hopes that curiosity will keep you watching. The problem is that, in my opinion, it really doesn't do much to build that curiosity in the first place. The viewer literally gets about five minutes to get to know Kris before she gets abducted, which really isn't enough to establish any sort of identification or compassion. Add to that annoying five-second cuts and that terrible, terrible synopsis and you get the feeling that Carruth is flashing the troll face when you're not looking. Perhaps critics do get the joke, but I certainly don't.",
      "total_reactions": 10,
      "user": "Bestpony"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Almost a decade ago, Shane Carruth created \"Primer,\" a low-budget sci-fi flick that developed a cult following for its complex ambiguity. This new one has a better quality look, arty even. It's edited with short cuts to keep it moving. But…the plot is totally obtuse. A man and woman have been part of some kind of enigmatic experiment involving a worm. There's also a guy who walks around recording sounds and tending to pigs. And \"Walden.\" If you like to feel hip and love to dig deep for meaning, you're liable to find it perfect. Otherwise, there's lots of interesting imagery with no easy payoff.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "Don't be fooled by the high critic reviews, this movie is pretentious dribble. Very dull and no plot. Awful. It is also curious how EVERY review by critics on metacritic is positive. A simple search shows that there are negative critical reviews but metacritic doesn't publish these, why? Metacritic has a review from the guardian but another reviewer from the guardian wrote \"(Upstream color) turned out to be a baffling, opaque mess\" and gave it 2/5. That is curiously not mentioned on this cite and instead the movie has \"universal acclaim\". See: http://www.theguardian.com/film/2013/jan/23/sundance-festival-upstream-color-first-look-review .",
      "total_reactions": 4,
      "user": "Honest-reviews"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Shane Carruth's second film \"Upstream Color\" is just as obtuse and bewildering as \"Primer\". This guy is never going mainstream with this style; when most people  including me  have to spend nearly as much time as the film in Reddit (or Slate or io9) trying to understand it then that's a failed film style. It's as if he films a story that makes sense then edits out all the connective pieces, the essentials that tie one scene to another. We understand cause and effect, but in his films he removes or distorts the cause and you're just left with effects. I.don't.like.that.  Good luck if you attempt to watch",
      "total_reactions": 10,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Short version: Upstream Color is a good-but-flawed, puzzling, poetical, unusual movie.  It's not easy to watch or digest, but will give you plenty to think and feel.",
      "total_reactions": 5,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Read my review of Upstream Color here: http://briansfinas.com/review-of-shane-carruths-upstream-color/",
      "total_reactions": 4,
      "user": "BrianSfinas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "A real filmmaker with original vision, Carruth has followed up the brilliant \"Primer\" with an equally perplexing, intriguing and captivating film. What T. Malick tried with horrible results to create in \"Tree of Life,\" Carruth has succeeded in, particularly by being a man of science rather than a man of faith (nods to \"Lost.\").",
      "total_reactions": 2,
      "user": "briefly"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Writing a review about Upstream Color implies I have gotten as much as I possibly want from the film out of it but that couldn't be further from the truth as truly understanding this stream of conscious thought would take more than a few watches and honestly I don't think my wallet can take the enlightenment. When Kris (Amy Seimetz) is accosted by a mysterious stranger and implanted with a mind altering parasite, her ideal life is upended and the only thing that seems to return her to a modicome of normalcy is Jeff (Shane Carruth), a man who has been through a similar experience that she meets on a train. While the film does demand you fill in the films many plot holes with your own imagination, it isn't the same lazy storytelling technique that made Only God Forgives so intolerably stupid. The film sets a framework for the viewer, one that we must populate with our own thoughts, our own ideas about what it all means. Without our input and our sense of self this film wouldn't work. It's a special picture because no one sees the same thing or comes to the same conclusion. The connection Kris makes with this creature is a way of discussing not only the natural cycle of things on this planet but the concept of symbiosis, the coming together of two organisms and the bond the two form as they work with each other. This is something interpreted by Kris and Jeff's importance to each other but also through Kris' relationship to the parasite, something she cannot see but she knows somehow is there. Seimetz proves herself one to watch as she brings out so much in a dialogue light script. Her actions tell a wealth of story while leaving as much to self interpretation as possible. It's an exercise in expanding your mind but also in letting go and enjoying a trippy but complex love story between not only a man and a woman but a woman and a parasite.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "One of the weirdest movies I have ever seen  Highly influenced by terrance malick's  technique  the director creates a world to be lost  in. You may not understand all of what you see  Ain't life like that too   but it surrounds you with its meticulous direction and naturalism  The movie is a sci fi movie but unlike generic modern sci fi movies that depend only on visual effects  this one stimulate your brain and your senses as well",
      "total_reactions": 0,
      "user": "ashraf3812"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "After 9 years from his first directional venture, 'Primer' director came up with this challenging concept in science fiction theme. I think it is an underrated movie of the year. Good story but a little confusing to understand the story flow like the movie 'The Tree of Life'. Sometime it is hard to know which comes first and what portions fit where. Especially I am still not able to get how the shooting at the end takes place.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Almost a decade after his befuddling debut PRIMER (2004, 6/10), UPSTREAM COLOR, the jack-of-all-trades Shane Carruth’s greatly anticipated second film arrives with a splashy strut to renounce himself as a flash in the pan because it is a more ambitious, mythological and introspective dissection of a preternatural communications among life forms (in particular, human, pigs, grubs and lilies).",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Shane Carruth's sophomore full length features tops his debut, in Primer,  with a beautiful mystery.   One not bogged down with pricey actors and CGI effects.  Money well spent in an industry where the profits of success are often misused.  Intense and puzzling but with just enough bread crumbs to lead you back home.  Looking forward to more from Carruth.  The man knows how to utilize his resources better than any newer director.  Also a big tip of the hat to the editing squad, especially in the audio department.",
      "total_reactions": 0,
      "user": "RMckay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "A gorgeous film that engenders little \"headscratching.\" This is not a cerebral film. This is an emotional one. It's as simple as that. It's the evolution of a relationship torn asunder, repaired, torn and repair again by forces they can't really see or understand. It's not asking you to understand. It's asking you to feel.",
      "total_reactions": 0,
      "user": "loganchance"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "If you found Shane Carruth's first film, Primer, a tough watch prepare to be completely bamboozled by his second feature. The plot is...well unexplainable! It involves strange maggots, operations on pigs, hypnotic states and an unorthodox love affair. For most this will induce frustration and confusion and many aren't going to make it to the end, others will delight in its offbeat, hallucinatory structure. There is no doubt cart is a filmmaker of talent but if he gets any more obtuse he risks disappearing up his own arthouse orifice.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "There is more \"A Topiary\" than \"Primer\" in \"Upstream Color\", but one of the wonderful things about Shane Carruth is that he is as original as he is resourceful, so there is nothing retreaded in anything he does… other than time, I guess. When \"A Topiary\" was cancelled, those watching for it on the horizon were sorely disappointed. Was it his \"Don Quixote\"? His \"Dune\"? It’s kind of hard to tell from the script. What we can say about the movie we did get is that it’s good, no magnum opus, no revolution, but good and really **** interesting. The main problem with Carruth runs counter to the scifi status quo. Most scifi creators share a frontal lobe brain disease that impinges their self-control around neat ideas to the extent that they cannot help but blow their creative loads on a concept by drowning it in unimportant and superficial details. Mostly people create fantasy, in space; or, in the future; or, on scorched earth. Ideas remain childish, their greater implications self-consciously mapped in awkward pseudo-science soliloquies or outright ignored because the scifi elements are just there for pageantry. Carruth, conversely, has a frustrating level of self-control. With \"Upstream Color\" he introduces like nine different amazing scifi elements, each worthy of its own film or TV show, but then completely walks away from any attempt to explain them or milk them for thrills. It’s an amazing and infuriating talent. The movie itself is a meditation on ideas like cyclical and interdependent systems, individuality and memory, evolution and community, good **** It does this with careful pacing and wonderful attention to both the auditory and visual experiences of the viewer, and it leaves you stewing on all that indefinitely, because there are no definites in any part of this film.",
      "total_reactions": 0,
      "user": "StatlerWaldorf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "Warning, this review will be very critical so read at your own discretion.",
      "total_reactions": 0,
      "user": "Renovatia"
    }
  ],
  "metascore": 81,
  "name": "Upstream Color",
  "num_weekends": 4,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 5,
    "month": 4,
    "year": 2013
  },
  "opening_weekend_income": 28649,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 24064,
  "rating_freq": {
    "1": 967,
    "10": 2263,
    "2": 653,
    "3": 821,
    "4": 1216,
    "5": 2007,
    "6": 3154,
    "7": 5025,
    "8": 4929,
    "9": 3029
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 141,
  "votes_per_demo": {
    "aged_18-29": 8984,
    "aged_30-44": 9252,
    "aged_45+": 2104,
    "aged_under_18": 61,
    "females": 2900,
    "females_aged_18-29": 1452,
    "females_aged_30-44": 1018,
    "females_aged_45+": 295,
    "females_under_18": 9,
    "imdb_staff": 6,
    "imdb_users": 24064,
    "males": 17959,
    "males_aged_18-29": 7411,
    "males_aged_30-44": 8101,
    "males_aged_45+": 1776,
    "males_under_18": 51,
    "non-us_users": 11812,
    "top_1000_voters": 215,
    "us_users": 5688
  },
  "year": 2013
}