{
  "avg_rating_per_demo": {
    "aged_18-29": 7.1,
    "aged_30-44": 6.6,
    "aged_45+": 6.4,
    "aged_under_18": 7.2,
    "females": 7.5,
    "females_aged_18-29": 7.6,
    "females_aged_30-44": 7.4,
    "females_aged_45+": 7.2,
    "females_under_18": 7.5,
    "imdb_staff": 6.4,
    "imdb_users": 6.8,
    "males": 6.5,
    "males_aged_18-29": 6.8,
    "males_aged_30-44": 6.3,
    "males_aged_45+": 6.2,
    "males_under_18": 6.8,
    "non-us_users": 6.6,
    "top_1000_voters": 6.2,
    "us_users": 7.2
  },
  "avg_screens": 160.0,
  "budget": 6000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 18,
    "month": 4,
    "year": 2014
  },
  "critic_review_count": 181,
  "duration": 107,
  "genres": [
    "crime",
    "drama",
    "mystery"
  ],
  "gross_income": 3319109,
  "max_screens": 347,
  "mc_avg_user_score": 7.6,
  "mc_metascore": 62,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Veronica Mars",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 94,
  "mc_pro_critic_reviews": [
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 88,
      "summary": "I can't imagine anyone who liked the show not enjoying this film, even though the first half is stronger than the second, which spirals into a frenzy of double- and triple-crossing that's  less engaging than watching the characters reconnect, awkwardly but with feeling."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 83,
      "summary": "As someone who enjoyed the show enormously while it was on the air, I am relieved to report that the film felt to me like it successfully recaptured the spirit of the show's first season."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "The mystery isn't the reason to watch the film. Bell is. She's the perfect vehicle for Thomas' sharp, sassy writing, able to deliver a pop-culture-infused put-down with ease. And yet she is also vulnerable, something her relationship with her father drives home."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "It’s so much fun you may want to put a few bucks aside for a sequel."
    },
    {
      "critic": "Catherine Simpson",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "An emotionally rewarding reunion tour for established fans and a taut, sharp-tongued, character-driven thriller for all, Veronica Mars makes a compelling case for its heroine’s continued existence."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "A film noir detective story that works for both devotees of the series and the uninitiated."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "For the most part, Veronica Mars plays like a very solid episode of the series, the kind unlikely to rank among fan favorites. It could, however, serve as fine fuel for a sequel, one that wouldn’t find Veronica resisting — for half of her time on screen — the urge to do what she does best. Keep your hearts (and wallets) open, marshmallows."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "As directed by series creator Rob Thomas, the movie, like the show, is entertainingly fast-talking in a tidy, faux-serious way. Kristen Bell, if anything, has only gained in appeal."
    },
    {
      "critic": "Abhimanyu Das",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "For all its references to the show's history, the film never panders. It's an evolution of the core concept as opposed to a nostalgia-tinged reproduction, and is all the better for it."
    },
    {
      "critic": "Jette Kernion ",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Thomas and his co-writer Diane Ruggiero have penned a self-avowed love letter to the fans of the series, but grounded it in a solid thriller with compelling characters and bright comic moments."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "As pithy and sharp-witted as the screenplay is ... the direction by series creator Rob Thomas ... is oftentimes flat and visually dull. ... And so the movie, is more than anything, a bold and breathless work of fan service, configured by the creators of the original series for the maximum enjoyment of the fans of the original series."
    },
    {
      "critic": "Margaret Lyons",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "Somehow, miraculously, the Veronica Mars movie is definitely not bad. It's pretty damn good, actually."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "It is clear in every frame that the filmmakers and actors really appreciate that loyalty. It doesn't make for a particularly ambitious film, but it is a satisfying one as it moves easy, breezy over familiar terrain."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "While the Veronica Mars film feels a bit small and closed-off by big-screen standards, it will no doubt be big and welcoming enough to those who love the series."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "If you've never seen the show, it's a great excuse for binge-watching. And if you loved the show, the movie is a welcome homecoming. It has the feeling of a story that has been, against all odds, loved into existence. Probably because that's exactly what it is."
    },
    {
      "critic": "Jenni Miller",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "The winks and nods to fans are deliciously satisfying."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 67,
      "summary": "Marshmallow nation, you may now exhale: Rob Thomas did ya right."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "Veronica Mars is a great deal more than a bonus episode, but slightly less than a movie."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "The movie lacks some of the verve and chemistry that made the series a must-see. I guess that makes the movie more of a good-to-see."
    },
    {
      "critic": "Carl Wilson",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "As a moviegoer, I have to say that that broader success isn’t earned here. You are much better off getting the Season 1 DVD to understand why many of us invested emotionally and financially in this tiny, annoying blonde, whose sparky banter is just a counterweight to her vertigo in a world forever upside down."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "Kristen Bell shines as Veronica, playing the character as a more mature version of her TV persona."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "It's Bell – riding high with the Disney-animated \"Frozen\" and Showtime's carnal-fixated \"House of Lies\" – you want to follow anywhere. Bell is irresistible, and she makes us care."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "For all its fun flourishes and tepid over familiarity, fans are going to dig this. It is, after all, the movie they paid for. They’re the folks who “like this sort of thing.” The rest of us can be forgiven for waiting for it to show up on Netflix — on TV."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "There’s something rather bland about Veronica Mars – even the murderers have neat hair and nice clothes – and the largely forgettable cast don’t help. But the one-liners are sharp, the plot unpredictable and the whole thing ticks along with a minimum of fuss."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "Anyone who has ever loved a television show can see that Thomas and his crew are working overtime to give VM aficionados everything they want."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "Thomas’ direction, especially of the villainous roles, gives a lot of the action a self-conscious, not-quite-real quality. Some aspects of the movie’s intentional artifice work better than others."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "It plays less like a meaty mystery than an extended thank-you to the fans who breathed it into existence. Still, it’s smooth and engaging enough on its own compromised terms, clearly informed by Thomas’ genre-savvy storytelling and unpretentious craftsmanship, and not without a certain self-deprecating sense of humor about its own immodest origins."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "A likable, unmemorable, feature-length footnote to the admired television series."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "As a movie, Veronica Mars looks and feels, well, like a glorified TV movie, with just decent production values, mostly unexceptional performances and ridiculous plot developments no more innovative than you’d see on a dozen network TV detective shows."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "They’re calling it a movie, but no matter how you squint at it it’s a TV show."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "Most of the clues in Veronica Mars pertain either to Internet sex tapes or the various surveillance uses of the latest tablets. Anybody who works in tech support will probably enjoy the film a tad more than I did."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "Although most of the actors beyond Bell aren't big film stars, Jamie Lee Curtis gets a few minutes of screen time, and James Franco makes a spectacularly self-deprecating cameo. Whatever they contributed to the Kickstarter campaign, it was worth every cent."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "The best parts of this awkwardly paced film are Bell’s scenes with Enrico Colantoni, who returns as her private investigator dad, concerned she’s throwing away a bright future by getting sucked back into her old life."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2014
      },
      "score": 42,
      "summary": "Veronica Mars, the movie, plays like a two-parter without commercials. Its uninspired framing and static action suits a TV screen better than a multiplex's."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Proves more footnote than fresh start."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "My main issue with this movie is that it seemed like one not so special additional episode of the TV series. I watched every episode when they were originally aired years ago and I enjoyed them. Despite the enthusiasm of the kick starter campaign it seems that the actors were simply going through the motions this time around. I never thought I would say this but Kristen Bell is much better as her character in house of lies than she is as the older Veronica Mars. And what the hell happened to Logan Echols? He either looked like a little boy or a shrunken headed bodybuilder in that Navy uniform.  I will say that it was cool seeing Veronica's dad and weevil back in action. This is absolutely one for the fans only. If you haven't seen the show skip it.",
      "total_reactions": 1,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "As a huge fan of the TV series, I am disappointed on a whole new level in this movie and I think people who have never seen the TV show would be even more bored and disappointed in this movie. It just feels really lame, it was extremely boring and it seems a too forced. I would liken it to the 9th season of scrubs - actually it's significantly worse than that. I wouldn't recommend this to anyone - especially fans of the show.",
      "total_reactions": 1,
      "user": "cheesecakeporn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "While dong a great job of offering a nostalgic experience for fans, the Veronica Mars movie fails to be a good movie or even a good Veronica Mars episode.  The focus seemed primarily on reintroducing old characters and cameos who had very little to do with the plot. The plot that was there was overly simple and not up to the usual Veronica Mars quality.",
      "total_reactions": 1,
      "user": "aberthin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Great Movie. As a fan of the tv series I am more than Satisfied. Veronica Mars is back. It's the perfect series finale, that the tv show didn't have. The movie is entertaining, interesting and suspenseful. For a stranger viewer is still a great thriller to watch with a lot of unexpectd plot twist and funny quotes. Kristen Bell and Rob Thomas at their best.",
      "total_reactions": 3,
      "user": "fra92"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Veronica Mars is back! Not sure how I'd view the film if I hadn't seen the series, but as a film made for fans I think it's pretty awesome.",
      "total_reactions": 2,
      "user": "andremp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Just saw the movie on Amazon, as the movie wasn't playing in Hawaii; cheaper at $6.99 anyway too.  Great movie; just like the TV show series; same great characters; good storyline with Logan.  I like the relationship between Veronica and her dad; that adds to the movie.  I wish they would bring back the series.   They never closed out the end of season 3.  If CW doesn't pick it up again, maybe USA, as they have some similar great shows on there as well?!  :)",
      "total_reactions": 1,
      "user": "rranger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "A love letter to fans for sure.  And exactly the movie that needed to be made to kickstart - pardon the pun - this show back in gear.  I hope that this is what is needed to keep the story of Veronica, family and friends going.",
      "total_reactions": 1,
      "user": "LeahAndNic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "I never watched the television series in which this movie influenced. So had no faint idea about the movie and its theme. All I know is that the movie borrowed most of the cast and crew from the original as the movie database says. The story that revolves around a mysterious death and its investigation. The Puzzled characters which leaves us to keep guessing what might have happened.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "For a movie, Veronica Mars seems a lot like an extra-long TV show. Fortunately, that's exactly what the fans wanted. For devotees of the much loved series, this long-awaited Veronica Mars feature film is a five-star proposition. For everyone else, Veronica Mars is a pleasant diversion. (And you need know nothing about the young sleuth or her past exploits on TV to like it.) The film is a charming exercise in contemporary girl power, with mystery and romance thrown in for good measure. Kristen Bell puts her approachable persona to good use in the role of Veronica, a semi-outcast from Neptune, Calif., who never ran with the cool kids in high school. Still, it was made clear she'd outstrip them all eventually. And she has. The movie opens with Veronica being interviewed for a top job with a New York law firm. A brief voiceover from the title character fills in most of the past, explaining her need to get out of corrupt little Neptune and make a life for herself. Veronica has walked away from Neptune, sleuthing, and her rocky relationship with Logan Echolls (Jason Dohring), building a new life as a fledgling lawyer on the opposite coast and dating her college boyfriend (Chris Lowell). Brisk and clever (and often very funny), Veronica Mars has a terrific ensemble cast that includes a couple of stand-outs: Krysten Ritter, back as Gia Goodman, for example, and Gaby Hoffman, who turns up as a character named Ruby Jetson. The story also has a handful of cameos and inside jokes, including a bit with James Franco; there's a general irreverence to the writing that's one of the movie's best features. The uninitiated can be assured that Veronica Mars is entertaining from start to finish.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "A great cast returns to this film reboot of one of my favourite film series. Unfortunately the myriad of characters sometimes bogs down the mystery, which at times feels a bit light. The TV series pushed the boundaries on humour in detective work while solving homicides, while the movie feels more nostalgic than fresh. I would have liked to have seen more twists and turns, however Kristen Bell and Jason Dohrings performances are excellent.",
      "total_reactions": 1,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Veronica Mars deserves a marshmallow on top of an awesome movie. I have to admit, even though a based-on-a-television-series movie seems like a bad idea, Veronica Mars shines as a feature film. The storyline was great, the charm that Kristen Bell brought to the character was absolutely fantastic, and I like the fact that the writers threw in some humor in this thrilling mystery drama. I wasn't a fan of the series before watching the movie and now it makes me want to watch all 3 seasons of the series. Job well done Rob Thomas.",
      "total_reactions": 1,
      "user": "twerk-king"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Awesome movie. This is the finale fans had been waiting for. All of the main characters are back and while they may not get too much on screen time it feels we are back in Neptune of yester- years where things may have changed but the sense of familiarity is till there,.",
      "total_reactions": 0,
      "user": "Sapient2k7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Swan song for the cult series...with budget raised through a 'Kick-starter' campaign. Kristen Bell is back in the role that made her a pop culture mainstay and she's as good as ever. The bad thing about this flick is that it feels like a double episode of its original series. But it's entertaining and funny..one of the hidden gems this year.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "From the very beginning you sense that time has stopped and this is a fresh new episode of the tv show. A long, self contained episode.",
      "total_reactions": 0,
      "user": "firstevil87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Veronica Mars has one of the most boring openings to a movie I have seen in a long time. The movie seems lazy and is very uneven in the way it is told. It is like a very long T.V show that sucks.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "After an underwhelming first half, the movie then kicks into high gear with an interesting and funny story that ultimately delivers. It had potential to be much better, but I enjoyed it.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "While I was a fan of the TV series, this movie is a lame re-interpretation of that.  The investigation is very lame, the writers continue to stick Veronica with that idiot Logan, and overall it was a waste of a couple hours.  Come to think of it, the TV series went downhill in season 2, recovered a bit in season 3, and this movie tops it off with a total crash.",
      "total_reactions": 0,
      "user": "Vegas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Boring, wholly unnecessary, and irritating, most filmgoers who are not fans of the hit TV Show will find Veronica Mars a less than entertaining experience.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "I enjoyed this. Straight-forward murder mystery set against a Big Chill reunion of characters from the original series. I must admit that I never watched the TV series and knew little about the characters going in, but that didn't deter my enjoyment of the film one bit.",
      "total_reactions": 0,
      "user": "brohug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "The fan support for this movie was really unprecedented. Those supporters will likely be pleased. The story advances the timeline, brings back almost all of the characters, and reprises the twisty, mildly provocative mystery plotting and snappy dialogue of the show. There's even a joking reference to the fan support that nudges the fourth wall.",
      "total_reactions": 0,
      "user": "ahnehnois"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "\"a mysterious action packed movie full of mystery , comedy and turns it out a die hard fun mystery\".......................................................................................",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "It is GREAT MOVIE! Yeah, they messed up an entire investigation, but is still was so Veronica Mars, so clear, so dramatic, so good. I really liked it, although i'd prefer to see her in the NYC rather than having job at MI. Also i am one of these guys who's sad about Piz(",
      "total_reactions": 0,
      "user": "woohoo_off"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Veronica Mars es una película simple, pero brillante al mismo tiempo, logra enfocar su historia en un buen punto para que luego todo colisione y haga del resultado del film una muy buen destello.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "If you are a fan of the television series, then this movie is the closure you need. With a kickstarter reaching 5.9 million dollars from donations world wide, just goes to show that the fans, want more. The Veronica Mars movie, coming back to the town of Neptune to help her old friend friend, 'Lachlan' because he is framed for murder. Or course he is! Watching this made me think about the series again, you get to see older characters, what has become of their lives, and what has changed since Veronica's departure to the 'Big Apple' to become a big time lawyer. But the voices of Neptune call her back for one last stand. For a Kickstarter of 5.9 million, i have to say that this is amazing, the script has been in the making for a few years now, and you can tell that it was well thought out. The voice over narration of Veronica brought back memories from the TV Show and was urging me to watch it again. Surely there are things that would be plainly obvious to happen (just like every part of the TV Show) but that is what i think makes VM so attractable, we know what is going to happen, we just don't know how she is going to get out of it. If you are a fan, watch it, if you are not a fan, watch it. It is good fun to watch, but still at the same time there will be reunions so you might want to read up on those relationships which is shown to be the downfall to TV series to sequel movies.",
      "total_reactions": 0,
      "user": "ThatLostGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "Loyalty and what may be construed as blinkered enthusiasm have been the catalysts for many things. Here, this crowd-funded Kickstarter project gathered enough momentum from lovers of the original television series of the same name to get it across the finish line and get the film greenlit. People power. Don't you just love it?",
      "total_reactions": 0,
      "user": "choc_raisins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "Should I start with I didn't feel comfortable for Kristen Bell's voice as a narrator? \"Veronica Mars\" sounds good and delightful, but not original.",
      "total_reactions": 0,
      "user": "NizarEzzeddine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "I am a massive fan of the show but this movie has little of any worth in it. It reintroduces us to all the characters for old times sake, and sure it is nice to see them again, but the rest of the film is really lacking. The story is dull as dish water and the writing was fairly poor. It lacked all of the charm and wit of the original show and simply wrapped a bunch of lame cameos around a story that was impossible to care about. Only worth your time if you're a fan of the show and even then it's questionable. I can't say I've made up my own mind of whether it was worthwhile seeing this.",
      "total_reactions": 0,
      "user": "ArcticPorkPie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Imagine myself being a fan of Veronica Mars back when the show first aired in 2004. I would be 7 years old by that year but let's just say I am quite older than 7. Like 17 years old, my current age. Anyway, I would have no idea what the show will have in store for the next three seasons. Murder, potential incest, a deadly bus crash, frame, rape, adultery, corruption and the list goes on in Neptune, California. I would be intrigued with the show because of the titular character. The way she deals with the mysteries despite her difficult personal life is amazing for a teenager and I get to experience that with many other fans tuning-in",
      "total_reactions": 0,
      "user": "OpinionatedGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is so clearly a love letter to the fans, it hit as many possible fan-desired things as it could in the time constraint.  Do I wish there had been more Wallace and Mac and Dick and Keith... of course.  Am I sad to not know more about the Weevil transformation story?  Yes.  But the movie held the spirit of a beloved show with gusto.  No complaints.",
      "total_reactions": 0,
      "user": "VicWaltz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "4/5★ For fans of the series (myself included) and for mystery noir enthusiasts, Veronica Mars the movie offers more of what made the show great and throws out references and Easter eggs galore. We return to the characters and places we remember and see how they have, or haven't changed.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "Okay, I know nothing about the show, but if you're in it for laughs this movie is ideal.  Where to start with the wonky editing and story inconsistencies.  Seriously, very, very funny to watch for the \"Oh my gosh, this just gets more and more corny with every passing frame!\" moments.  I have no idea if this was supposed to be taken seriously, but oh, brother, that was some funny, plot-convenience-warehouse stuff.  Everything JUST SO HAPPENS to be EXACTLY where it needs to be to solve the crime. The fact that there are so many loose ends addressed, but never vetted out in the end leads me to believe that either the writers went off on wild tangents while writing this, or they truly believe there will be one or several other follow up films.  Oh, man, this is so bad I am almost hoping that's the case. I think I'd start a drinking game if they did.  Me giving it 3 stars is because, even if just for laughs, this movie WILL.NOT.DATE.WELL.  I mean, it just won't. No one in 20 years is going to revive this thing as a classic thriller or cult comedy or whatever. But it was funny tonight, I tell ya.",
      "total_reactions": 0,
      "user": "OregonJayBird"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "While this movie brings those outside of the Veronica Mars fan club up to speed in the first 5 minutes, it's appeal is mostly to fans that  have watched the whole series up to that point. It gives the die-hard fans what they want, but as a stand alone film Veronica Mars falls a bit short. Essentially an entire 22 episode season's worth of sleuthing, thinking and problem solving were crammed into a little more than an hour and a half movie. However, it retains enough charisma and Veronica Mars charm to keep fans of the series entertained the whole time.",
      "total_reactions": 0,
      "user": "Pocketchange"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Veronica herself is such a breath of fresh air as a strong female character: smart, secure, resourceful, loyal, funny and not the slightest bit chickish.",
      "total_reactions": 0,
      "user": "tonimiller417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "Overall, a very dull and poorly written film with an overly confusing plot. I guess for followers of the original TV series there is some appeal here - I remember several scenes which didn't further the story, but instead seemed to revel in providing forced-feeling fan service. Although, to be honest, I found most of the characters Veronica was reunited with more irritating than entertaining. A fan of the show recommended the film to me, and I've certainly seen a lot worse, but for those unfamiliar with Veronica's TV escapades I would recommend avoiding this movie adaptation.",
      "total_reactions": 0,
      "user": "dc203"
    }
  ],
  "metascore": 62,
  "name": "Veronica Mars",
  "num_weekends": 6,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 14,
    "month": 3,
    "year": 2014
  },
  "opening_weekend_income": 1988351,
  "opening_weekend_income_currency": "$",
  "rating": 6.8,
  "rating_count": 42997,
  "rating_freq": {
    "1": 915,
    "10": 6683,
    "2": 527,
    "3": 837,
    "4": 1640,
    "5": 3639,
    "6": 7570,
    "7": 9851,
    "8": 7231,
    "9": 4104
  },
  "release_day": null,
  "release_month": null,
  "release_year": null,
  "user_review_count": 134,
  "votes_per_demo": {
    "aged_18-29": 15377,
    "aged_30-44": 15976,
    "aged_45+": 3956,
    "aged_under_18": 69,
    "females": 13859,
    "females_aged_18-29": 7329,
    "females_aged_30-44": 4787,
    "females_aged_45+": 903,
    "females_under_18": 36,
    "imdb_staff": 8,
    "imdb_users": 42997,
    "males": 22807,
    "males_aged_18-29": 7875,
    "males_aged_30-44": 10988,
    "males_aged_45+": 2995,
    "males_under_18": 32,
    "non-us_users": 20944,
    "top_1000_voters": 306,
    "us_users": 8027
  },
  "year": 2014
}