{
  "avg_rating_per_demo": {
    "aged_18-29": 7.0,
    "aged_30-44": 6.7,
    "aged_45+": 6.8,
    "aged_under_18": 7.5,
    "females": 7.2,
    "females_aged_18-29": 7.2,
    "females_aged_30-44": 7.1,
    "females_aged_45+": 7.3,
    "females_under_18": 7.8,
    "imdb_staff": 6.7,
    "imdb_users": 6.9,
    "males": 6.8,
    "males_aged_18-29": 6.9,
    "males_aged_30-44": 6.7,
    "males_aged_45+": 6.8,
    "males_under_18": 7.2,
    "non-us_users": 6.8,
    "top_1000_voters": 6.5,
    "us_users": 7.0
  },
  "avg_screens": 1199.7857142857142,
  "budget": 35000000,
  "budget_currency": "$",
  "closing_date": {
    "__type__": "datetime.date",
    "day": 3,
    "month": 5,
    "year": 2013
  },
  "critic_review_count": 453,
  "duration": 98,
  "genres": [
    "comedy",
    "horror",
    "romance"
  ],
  "gross_income": 66359959,
  "max_screens": 3009,
  "mc_avg_user_score": 6.9,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 72,
  "mc_movie_name": "Warm Bodies",
  "mc_negative_rating_frequency": 33,
  "mc_positive_rating_frequency": 222,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 88,
      "summary": "A well-paced, nicely directed, post-apocalyptic love story with a terrific sense of humor and the, um, guts to be unabashedly romantic and unapologetically optimistic."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "Levine – whose last picture was the intriguing, if only partly effective, cancer comedy “50/50” — is going for something more here, exploring what makes us human by contrasting it with a character who has lost all the basics and is desperate to get them back."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Warm Bodies is the first movie worth paying to see in theaters this year. It’s an inventive charmer that visits all the typical movie scenarios of young love amid chaos and disaster, but with a new dimension: one of the romantic leads is a zombie."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Somewhere between the pop-culture deconstruction of \"Zombieland\" and the skewed romance of \"(500) Days Of Summer,\" this manages to make the apocalypse seem charming. Warm is the right word."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "In doing a little genre bending of romantic schmaltz and horror cheese - some fundamental zombie mythology is turned on its head - the film breathes amusing new life into both."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "There isn't a cynical bone in this film's achingly sincere body.  And it's not really a horror movie, unless the \"horror\" in question is the all-consuming awkwardness of young love."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "Hoping to do for flesh-eaters what \"The Twilight Saga\" did for vampires, albeit on a smaller scale, writer-director Jonathan Levine spins Isaac Marion's novel into a broadly appealing date movie about a zombified Romeo and his lively Juliet."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 78,
      "summary": "With \"50/50,\" his last stint in the director's chair, Levine upended convention to make a feel-good cancer movie. He's still defying expectations: In animating the inner workings of the undead, he's made a movie that is both clever and heartfelt."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "At this point in the actor's career, it is pretty well impossible to tell when Malkovich is camping it up, or just being John Malkovich. Under the end-of-civilization circumstances of Warm Bodies, he's just the right guy for the job."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "An enjoyably clever and cartoonishly gory rom-zom-com."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "What Levine does have is a gently gruesome way of amusing us, converting the uneasiness of a wooer from another species into the everyday anxieties of a young man around a girl he likes."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "I don't know if the first zombie date flick is a step forward or backward for civilization as a whole, but I can say that Warm Bodies pulls off a pretty impressive trick: It has its \"Twilight\" and goofs on it too."
    },
    {
      "critic": "Richard Larson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 75,
      "summary": "It flouts convention in a number of ways in service of its genre-mash-up agenda while still contributing something original to the tradition of the zombie film."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "Warm Bodies is an improbable romance sweetened with appealing performances and buoyed by one of the better cute meets in recent romantic comedy."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "There's not a lot of gore - or even suspense - in Warm Bodies, and the script plays fast and loose with the zombie rules invented by \"Night of the Living Dead\" creator George Romero. But director Jonathan Levine's area of expertise is confused-young-men comedies like \"The Wackness\" and \"50/50,\" so he really gets this hero's predicament."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 70,
      "summary": "The low gore quotient and emphasis on young love might disappoint genre purists, but for those open to the idea of a gently goofy mash-up, the film is strong on atmosphere and offers likably low-key, if somewhat bland, charms."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 67,
      "summary": "It's got a big heart and high spirits on a low budget and actors who refuse to phone it in."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "Warm Bodies is for audiences who prefer stories about mending hearts to munching brains, and ideally, for girls who aren't quite sure yet if they want a slightly scary boyfriend, or a living doll they can dress up."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "It wants to be funny, charming, scary, and dramatic. It ends up being a little of each but not successful as any one."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "Zombie lore doesn't allow for redemption, only head shots, and Levine's film, amusing though it may be, is never gory enough to truly become a classic zombie movie. It also ignores the one basic necessity of monster films, even the funny ones: It really ought to be creepy or scary or gross, at least once or twice."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "Levine has a strong instinct as a packager of moments, ladling on the alt-rock just so before ladling on another ladle's worth."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 63,
      "summary": "Jonathan \"50/50\" Levine has turned Isaac Marion's teen romance novel into an often amusing tongue-in-cheek romantic comedy - tongue in cheek, and brains in teeth. Chewy, tasty brains."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Zombie-ism in the movies is traditionally inspected for metaphorical qualities. Here it could simply be that we males are emotionally dead … until love revives us."
    },
    {
      "critic": "Rosie Fletcher",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "A Frankenstein’s monster of comedy, romance and horror that’s less than its parts, Warm Bodies entertains but underwhelms."
    },
    {
      "critic": "Miriam Bale",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 60,
      "summary": "Hoult's genuinely awkward charm and Palmer's tomboyish wholesomeness disarm an audience overfamiliar with this story. The two ably communicate the primitive and irrational feelings of falling in love."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Warm Bodies is more a mild-mannered, emo-flavored romcom than a zombie movie. It has some tepid action scenes, a few swatches of genuine humor and a general spirit of cheerfulness, especially considering it depicts a future in which civilization has been destroyed."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The script is too primly PG-13 to really go for it. Warm Bodies even suggests that true love can help the right zombie grow a new heart. That's a con job that makes Bodies lukewarm at best."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "There's one really good idea at work in Warm Bodies, which is to take \"Romeo and Juliet\" and mash it up with a zombie movie."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Geared for teens who perhaps found the Twilight series too profound, Warm Bodies is an unabashed homage to that wildly successful franchise. One of its stars, Teresa Palmer, is even done up to be a carbon copy of Kristen Stewart, the anchor of the vampire series."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "The leads are likeable enough, but the script reanimates \"Buffy the Vampire Slayer\" tactics - a monster story supposedly made hilarious by being told by a savvy high schooler. These lines aren't even jokes, though, they're just collisions of the brutal and the banal."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Though it's about a pair of lovers whose passion is strong enough to break down the barriers between life and death, this mildly amusing, sort-of-sweet comedy is strangely sexless and passion-free-these bodies, whether human or zombie, feel room-temperature at best."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "If you're a zombie purist or a fan of \"The Walking Dead,\" Warm Bodies is not for you."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "For a movie about a love so powerful that it brings people back from the dead, it's curiously tepid. In spite of its repeated, overwrought image of grey, dead zombie hearts flushing and throbbing with new life, it lacks a beating heart of its own."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "Playing with genre is fine, but if you're going to create new rules, you have to play by them too, but unfortunately Warm Bodies continually subverts its own internal logic and basic, believable character motivation to keep pushing the movie along."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Warm Bodies wants us to believe in the transformative power of love, but what of Julie's poor, devoured boyfriend? There's Stockholm syndrome, and then there's cozying up to the monster who ate your sweetheart."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 37,
      "summary": "Cute without being especially clever, Warm Bodies is almost as pallid and as brain-dead as its zombie antihero."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "For all of R’s allegedly humorous observations about the wasteland of the undead through which he walks, they feel tacked on — like somebody decided to turn this thing into a comedy at the last second."
    },
    {
      "critic": "Chris Packham ",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "The film's intentions are way too good for its own good, producing bloodless romance and more shamefully bloodless carnage."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "This is an extremely unique movie, something i'd never expected to exist, and it was very well executed here. The apocalyptic setting is convincing, the romance is absolutely believable, and the humor is enjoyable.",
      "total_reactions": 5,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "I saw this flick with my girlfriend a few days ago and it was much better then i was expecting  interesting;even though slightly cliché plot that moves at a good pace The characters were nicely developed too, the small cast still held the movie high, but the female leads best friend (Analeigh Tipton) wasn't too great. Now even though this movie had heart and was decently funny, it does have zombies in it  and since it was rated PG-13 here in Canada  the movie would of been more believable if it had more gore in it  maybe not as intense as amc's the walking dead but more would be nice  i also would of gave it a higher rating if  incorporated  more action in the plot  especially near the end  but as the credit's rolled  the decent mix of romance and horror with a dash of action and comedy,  me and my girlfriend left the theatre enjoyed and received our moneys worth.",
      "total_reactions": 5,
      "user": "EvanXER"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Warm Bodies is riveting and fascinating, with tender romance and pleasant good time. It is absorbing, original, full of heart and sweet tale of unusual love between a zombie and a human being. This is a perfect movie for me to enjoy.",
      "total_reactions": 3,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Ever thought Romeo and Juliet was a bit stuffy, a little too formal and hard to relate to? Warm Bodies finds the perfect remedy, Zombies of course. R (Nicholas Hoult), a zombie who is remarkably verbose in his own head falls for Julie (Theresa Palmer), a human he saves when his pack of zombies attacks her and her friends who are scavenging supplies. The two begin to bond and realise that R is not like your conventional zombie and he could hold the key to reversing the apocalypse. Unlike any other zombie film including Zombieland, Warm Bodies has a powerful sense of emotion and understands one of the most important concepts/themes from all zombie films, the loss of humanity. The idea that its not just the zombies that lose who they used to be but the humans as well. This is something that is expertly handled in 28 days later and its surprising how Director Johnathon Levine manages to display this basic tenet of zombie lore just as well but in a completely different way. The use of flashbacks in the film is impressive as it does it in an original way while also giving the film a much needed back story  for Julie, a girl who is unintentionally soured by the apocalypse yet still has a light and beauty befitting a modern day Juliet, the Juliet Levine envisioned. R on the other hand is fleshed out through his own inner monologue, Levine's version of Shakespeare's soliloquies. This voice over gives a good impression not just zombie R but human R. However the monologuing gets irritating after a while as you become more invested in what he does instead of what he thinks, one of the main problems with Romeo and Juliet as a play as well. R spouts some great comic lines in his head but much of the comedy comes from his utterly uncomfortable actions in trying to become Julie's friend. The chemistry between Hoult and Palmer is good and overall Palmer is very impressive which came as a pleasant surprise for someone who watched I Am Number Four. Overall the film has very few flaws but even without flaws it doesn't wow in the way I thought it would or expected from the director of 50/50, one of the best films of 2011. Also the ending is incredibly rushed even though the film could have done with an extra few minutes to make the conclusion seem even remotely plausible. In fact the film just kind of ends, like this....",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "It won't slake your yearning for the next season of \"The Walking Dead,\" but \"Warm Bodies\" is a fun, quirky addition to the zombie genre. I admit that part of my interest was curiosity about what ever happened to that kid from \"About a Boy.\" (He's now tall & handsome, but retains that endearing quality.) The movie is kind of sweet, too, as it explores whether the undead are truly doomed. Not terribly profound  and not crazy/wacky  like \"Zombieland\"  but enjoyable in its way.",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "By any mean not a masterpiece not even close, I'd say barely decent at best. But, but, for what it is I thought it played its strength well with a very likable cast and a silly but cute story. It reminded me of Silver Linings Playbook because its message which is basically the same thing: it's never too late to come back from the \"dead\" and be happy, in this case literally.",
      "total_reactions": 1,
      "user": "Demorase"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "Warm Bodies is a charming take on the romantic comedy formula with a nice soundtrack and two likeable leads and, sadly, not much else. It's mostly entertaining but there's a real lack of pace to the first half of the film. It shifts unevenly between trying to be (somewhat) deep and being absolutely candyfloss. Some characters are played seriously and others are super wacky. Considering the zombie threat the world is suffering, its amazing how quickly the girls come round to R being safe.",
      "total_reactions": 1,
      "user": "reddave2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Very touching and emotional lovestory, finally not set in a fairytale world like every other love movie. Hidden social hints and black humour throughout the film make it a very enjoyable experience, especially for couples!!!",
      "total_reactions": 1,
      "user": "TECfilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "What a surprise this film was. So charming. Warm Bodies benefits from two excellent lead performances from Nicholas Hoult and Teresa Palmer; they carry this film nicely, but it's really the strong direction from Jonathan Levine (50/50) that makes the film work. Had someone else helmed the picture I don't think it would have been as effective as Levine's WB. Using concepts popularized by the likes of Twilight and The Walking Dead, Warm Bodies takes pieces of those projects to make a film that's highly entertaining and satisfying to a diverse audience.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "This movie is really great compared to other recent teen movies with the same unusual love story like the host or the twilight series, this one is way to better runs up to the top of your heart very quickly, fast paced with chilling scenes and great romance, but as a movie not compared to anything it is very good and funny, entertaining but not great.",
      "total_reactions": 1,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "This is an above average rom com that is actually more self-aware than people give it credit for. A lot of reviews reference twilight, but few seem to really understand that this movie is in a lot of ways a tongue-in-cheek criticism of the whole twilight saga. Specifically, it's a direct jab at the ridiculousness of making the undead a love interest. Just look at the poster  the one with the female lead holding the male lead from behind. It even looks like a twilight poster!",
      "total_reactions": 1,
      "user": "LonePiper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "Warm Bodies is great fun, not only for Zombie fans but for any film lover. The film is very good on the pace of R an unusual zombie who lost his way. The film is very sweet and tangy, the middle of this juicy film the pace slows down and violence starts popping up. Then the sweet deal comes up, everything goes boom and the film hangs the viewers. But, dont be feisty- the film is really good.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "My 19 yr old daughter and I saw this last yesterday and we both loved it!  It was an original take on an old horror concept.  And as a self-proclaimed Zombieholic, I couldn't stay away!  Definately a fun movie for teenagers who haven't been conditioned to only enjoy blood, cuts and torture themed movies.",
      "total_reactions": 1,
      "user": "Sireen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Yes this movie has plot holes and there are certain things that just don't make sense, but I gotta say it was a good time.  It worked for me mainly because director Jonathan Levine who made the outstanding film 50/50 is able to make me believe in the romance between R and Julie.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "It's pretty cute, and the message is very endearing. Although it may be a bit unorthodox as a date movie, it's definitely one of the better romantic films to come out recently.",
      "total_reactions": 1,
      "user": "Hedilio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Warm Bodies is a brilliantly original zombie story. I was afraid it wouldn't be as good, but as far as the storyline and the humor play-in together, it's really a warm-hearted love story that is perfect for the valentine's season, unless your girlfriend is terrified of zombies.",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Jokes aside this thing eats twilights brains. Its a compelling and cute zombie flick. Little bit of everything here. Horror comedy and romance. Give it a shot it isnt a 2 hour time sink like some movies.",
      "total_reactions": 1,
      "user": "kitejr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Turning zombies back into human beings as the healing power of pure human emotions. Simple skin deep symbolism in action. Soft watching. In any ways, it was the great pleasure for creators to shoot this movie.",
      "total_reactions": 1,
      "user": "teodante"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I liked this movie, thought it had action, romance, and some comedy although I wish they would have cured the zombies earlier so we could have seen Nicholas Hoult as a human longer but all in all it was good.",
      "total_reactions": 1,
      "user": "Paranormalfreak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Please don't take the rating of a 6 to be a bad thing, just compared to other films I have watched a 6 feels just about right for this film, which is good! it is brilliant for couples that want to sit back and watch a film. It has some real funny moments and quite a cool story. There were a few parts that got me abit bored, but it wasn't often. Overall, it's a good film and I recommend to watch it!",
      "total_reactions": 1,
      "user": "DanielWesoly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Warm bodies is a interesting take on a zombie flick me myself was kinda output by how they could have thought and become human again. Then i opened to the idea a bit and saw this was a cool take on zombies but if your a zombie movie watcher like zombie land or shuan of the dead you wont like this movie much but as i watched i learned that there are reasons behind there mindless killing and i kinda liked the idea and then we come to the romance in the movie its kinda weird to see it in a zombie movie but its more comedy so it works in the flow of it but one thing i have to say is it keeps you there till its overall conculsion and i even went back to watch the movie again so its a zombie movie with a new take and overall good story i didnt have any gripes with it besides the bonies they just seemed like minecraft skeletons on steroids and there are a few Why the  moments but still the movie was good",
      "total_reactions": 1,
      "user": "IndecisiveGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This is a great zombie love story. I do not think I have heard of this unique combination. The movie had a wonderful mix of love, humor, horror, and action.",
      "total_reactions": 1,
      "user": "meganahernandez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "This movie isn't Twilight, in fact, it is better in so many ways, Warm Bodies is one of a kind, but is Warm Bodies perfect?! Almost. The Acting is way too better and the story scenes are really good, as a movie in whole. Absolutely YES!",
      "total_reactions": 1,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Not as bad as I thought it would be. The movie sported a charming cast that really made the silliness quite acceptable. Even if you don't particularly enjoy zombie movies, like moi, you will still mildly enjoy this one. There isn't much of a comprehensible storyline, but that's probably not what movie-goers are looking for in this film.",
      "total_reactions": 1,
      "user": "film_bug"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "I'm surprised. The movie doesn't focus on the girl, like all the other pictures have done, this film represents the supremacy of love, and heart changing, it's funny, enjoyable and touching.",
      "total_reactions": 5,
      "user": "BrunoZrZr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "I went into this film with high expectations and was not disappointed. It gives us a good mix of Comedy/Horror/Romance to make a new genre! ZomRomCom! Nicholas Hoult is outstanding as R, who slowly starts to become human again. There is such a nice mix of the three genres to have something for everyone to enjoy, and you are more than thoroughly entertained the entire time you're watching. Overall I was more than impressed and will highly recommend it to anyone up for a quality film this year!",
      "total_reactions": 4,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "A cheesy, predicable, zombie love story. That actually works! funny as that sounds. But the movie, has this its own charm. Pleasant to watch, likable characters. I enjoyed watching it!",
      "total_reactions": 3,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Honestly better than expected...I usually rely on Metacritic faithfully but I saw this one anyone. It definitely deserves at least a 70 rating on here, its a fresh twist on an otherwise worn down subject (walking dead, twilight, etc). The acting wasn't superb, but the narration really kept the movie and the comedy flowing. Not to mention, the soundtrack was one of the best I've heard in a while.",
      "total_reactions": 13,
      "user": "vmd1020"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "This movie was good.  Certainly not one that people will be talking about for years to come, or even anything that necessitates a second watching.  It was entertaining, and really, what else do you need?",
      "total_reactions": 6,
      "user": "BryanDominik"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Are all zombies cursed with lock-in syndrome, or is it just R., a jarringly articulate walking corpse, whose interior monologue indicates a cognitive ability to love that belies the grunting and monosyllabism? Wandering aimlessly through an airport that has long-past outlived its usefulness, R.'s inner voicings of alienation(\"Why can't I connect?\") and self-loathing(\"...so pale.\") uncannily echoes Charlie Kaufman in Adaptation, whose opening can be gleaned in Warm Bodies. The word \"adaptation\", here, is applicable in the biological sense, referring to the existential struggle of transitioning from life into death(heretofore only implied in Dawn of the Dead, where the zombies faintly recall the consumer culture of the living, converging on a shopping mall in parodic imitation of their former selves) and the angst that comes with post-death, whereas in Adaptation, it's a literary term: Kaufman's fruitless attempt to transform words into images from a non-fiction work about flowers. Guided by Charlie's tortured agency, the film's conceit that his screenplay and resulting film are occurring concurrently, gets thrown into chaos, when Kaufman's identical twin hijacks the narrative and turns Adaptation into some cheesy action picture. Donald is a hack, a Robert McKee disciple, whose tenets are a counterintuitive affront to Charlie's iconoclastic-minded psyche for non-formulaic screenwriting. Similarly, in Warm Bodies, despite the film's lack of self-reflexivity, two zombie narratives: one that demonstrates fidelity to the genre, and the other, while not the work of a maverick by any means, does humanize a historically malevolent monster whose inner life has rarely, if ever been explored, seem to emanate from two sensibilities at odds. A \"bony\", on one hand, is your standard issue zombie, engaged in the singular activity of unrepentant cannibalism, but R., conversely, while sharing the bonies' overriding appetite for human flesh, is a corpse with scruples, a corpse who feels conflicted about his bloodthirsty nature. Akin to Charlie attending a McKee seminar on screenwriting, selling out his guiding principles so he can finish adapting The Orchid Thief, R. watches a zombie, his compatriot, turn into a bony, ripping the flesh right off the bone: a two-fold adaptation that first, shows how taxing a conscience can be, as the decomposing man gives up on the idea of being nearly human, and second, on an intertextual level, like Adaptation, kinesis takes precedence over languor, or rather, Warm Bodies grows increasingly Hollywood in form and content. A bony, after all, is a zombie who adapts to the concept of death; it desires none of the earthly pleasures, but to eat. As a filmic metaphor, the self-mutilating zombie can be reconstructed as a Charlie figure, tearing himself apart as penance for using Donald's ideas to finish his shooting script. Charlie, in essence, is a zombie, sad and alone, more dead than alive. When R. intones, \"Don't be creepy. Don't be creepy,\" as he approaches Julie, the girl he keeps captive in his tarmac-situated home, a converted airplane, the moviegoer can imagine the hoody-cladded young man's analog, the bipolar writer, chanting the same mantra as he flirts with the diner waitress whom he wrongly invites to an orchid show. R., however, wins Julie over, in due part because he eats her boyfriend's brains. Here, the film borrows from another Kaufman/Jones collaboration, Being John Malkovich. On a subconscious level, Julie can sense Dave's presence behind R.'s eyes, just like how Maxine would know whenever Lottie was occupying the famous actor's body. By snacking on the dead beau's grey matter, R. collects his memories, thoughts, and feelings, which makes the zombie more like Dave than himself. So strong is Dave's aura, Julie allows R. to occupy the same bedroom in an abandoned suburban house. If Julie gave necrophilia a go, would R. stand for \"rapist\", since the faux Romeo, unbeknownst to the girl, is a conduit for Dave's ghost. Nevertheless, R. is a zombie in love, signified by his heart turning red, the same hue perceived by an ideologically pure boy from a 1950s television series, who discerns the rose's true color after having just made love to a real girl. Arguably, Pleasantville is a zombie film, a latent one. In the aftermath of the girl's mother experiencing sexual pleasure for the first time, she hides in the kitchen, embarrassed by her flesh tones and ruby lips. Afraid of what her monochromatic husband may think, with Bud's help, she acts in a reactionary manner, using black and white makeup to conceal the newfangled vividness. But she's alive, like R. is alive. Contextually speaking, you can't go back to Night of the Living Dead, the 1968 George Romero original, whose zombies now seem one-note and monotonous, just like a sitcom housewife of yesteryear. To answer R.'s friend's question, the mother feels it. Life after death.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Otherwise known as Romeo and Juliet in Zombie Apocalypse, also despite the overwhelming Twilight vibe oozing from it, Warm Bodies is a funny undead flick and quiet charming in its wordless execution. Its self-aware lightly toned comedy composes lay back youthful attitude in the form of a zombie's monologues and his deficit on vocabulary. The antique plot may seem rigidly predictable, fortunately it has some freedom on delivery, making it a fresh tongue-in-cheek dystopian humor since Shaun of the Dead and Zombieland.",
      "total_reactions": 2,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Although it is nearly brought down by a significant amount of plot-holes and some inconsistent tonality, \"Warm Bodies\" endures as a delightful and amusing twist on the classic horror subgenre thanks to a few resolute performances, some interesting stylistic techniques, and a mostly enjoyable story at its center.",
      "total_reactions": 2,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "\"Warm Bodies\" is a nicely directed post-apocalyptic love story--that is at the very least--a fresh approach to a zombie film that is fully realized, and flushed out to satisfaction. \"Warm Bodies\" is a light comedy, which is often witty and consistently enjoyable. Levine's latest is well shot and possesses impressive production values. The film lacks any real thrills or major conflicts, but the romantic and comedic aspects are pleasant and effectively delivered with fine all around performances, while Jonathan Levine exhibits his skillful abilities behind the camera.",
      "total_reactions": 2,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "This movie makes Twilight seem like Citizen Kane. Easily in the top 10 worst movies I have ever seen. How did this script even get the 'green light' to get produced? How on Earth did the critics rate this about the same as The Hobbit? Just as one example of how inane this movie is. .it starts off with the Zombies being unable to talk or communicate other than grunts and rare single words, but suddenly they are all chatting it up with full sentences spoken slowly with broken English, including Rob Cordry and the lead actor. Also, the Zombies can smells humans inside buildings, but when it comes to the female lead, as long as she acts like a Zombie, she can walk amongst them if she is with her Zombie boyfriend. An intellectually offensive movie.",
      "total_reactions": 16,
      "user": "Switters"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "It is a masterpiece mixed with a critical social very hidden. I loved and how many will love too. One of the best movie of the year.  The film has a nice pace, with a bit of romance and a lot of action. Is just surprising. Exceeded my expectations",
      "total_reactions": 23,
      "user": "rylanddie"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "Maybe I missed the point of the movie, but this sends a terrible message. Sort of like Forrest Gump with its advocacy of stupidity. I'm sorry but its not okay to be a moron. Just like the silly Twilight junk, we have another case of a dumb young girl and a boy who is wrong for her, not just wrong but biologically wrong, like science and stuff. Of course, for the children who run Hollywood, that is ok. Sure why don't we all hook up with zombies...nothing bad can happen then. I'd tell my daughter, \"Yes, I'm sure he's a nice boy but don't let him eat your brain on the first date. Save that for Marriage.\"",
      "total_reactions": 14,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Going into Jonathan Levine's (50/50, The Wackness) new film Warm Bodies, I was intrigued. I didn't know quite what I was going to get as the concept was fresh and unique.",
      "total_reactions": 7,
      "user": "weallwantsome1"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Nicholas Hoult gives a charming, career-making performance as a zombie dude who falls for a human woman. The post-apocalyptic world is populated by the undead. The humans hide behind a big wall, except for one blonde who gets trapped on the wrong side. Houllt's blank comic manner and sweet charisma combine with his cuteness to create a lovable character. The script has plenty of humor and only drags for a few moments. Jonathan Levine, who succeeded in combining cancer with comedy in \"50/50,\" shows a knack for staging offbeat jokes. This is a romantic comedy, not a horror film, but its charms make it a DEADpan delight.",
      "total_reactions": 7,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "Warm Bodies was a huge disappointment.  It was another film I went into with low expectations, and was still let down.  The trailer is very cute and perhaps if this were a 60 min tv show on MTV it could have been more bearable.  It had some cute moments, but again, not enough to warrant the hefty ticket price.",
      "total_reactions": 19,
      "user": "marco34la"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Extraordinarily slow and weak.  It's the type movie that is squarely in my wheelhouse  I should have liked this. A waste of Malkovich.  And the bonies?  Check out Tom Chick and crews's rundown at Quarter to Three  they encapsulate to the gist of my feelings on this film. Even Rob Cordry can't get it done here.  They break all the zombie rules, and in doing so, it becomes ridiculous.",
      "total_reactions": 10,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Something for everyone. Took my teenage daughter and her friend and we all really enjoyed it. There is comedy, action, horror, drama, romance. It entertains on all fronts. Was it some serious critically acclaimed masterpiece that will pull in all the awards?... no. Who cares? Enjoy it for the good time it is.",
      "total_reactions": 5,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "I've seen many great zombie comedy movies like Zombieland and Shaun of the Dead, but Warm Bodies is definitely one of the best movies of 2013. The movie was awesome. I was like I have to wait for the new Die Hard movie instead of watching another flop from any Expendable lead actors (Stallone, Schwarzenegger, and Statham). But now as the Super Bowl is about to begin, Warm Bodies may be the better Super Bowl movie than last year's Chronicle. I wish I was a lonely zombie like R (I don't know what R stands for in his name, probably like Robert as in Robert Pattinson). But I would love to see more zombie rom-coms in the future. I love Warm Bodies.",
      "total_reactions": 8,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "A movie has to do something extraordinary to get a 10 or something completely abysmal to get a 0, so while I can't give Warm Bodies a 10, it definitely deserves a 9. I think critics are way too hard on this movie, as it seems they are with most movies. The movie is a witty, warm, heartfelt movie that provides a small amount of action, a decent amount of comedy and a good amount of romance. It's unique and fun to watch how everything plays out, and it's well acted all around. Nicolas Hoult, Teresa Palmer and Rob Corddroy played the roles well. Overall, it's a great movie and I wouldn't give these critics half a listen anymore.",
      "total_reactions": 8,
      "user": "L4DLegend91"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "A fantastic and freash take on the entire Zombie genre as a whole, it exposes a more human side to the life of the walking dead. When one of them refuses to give up their last ounce of humanity, they discover love in the ranks of their enemies.",
      "total_reactions": 8,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "This movie is the zombie version of Twilight. The mythical view of vampires have been ruined and now the same fate has bestowed zombies. Do not let the high user scores fool you. They will most likely be from the adolescent female crowd of Twilight fans.",
      "total_reactions": 11,
      "user": "Ecko69x"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Good performances, good scenes, and sometimes, funny, good pace and a great social critic, makes the film one of the biggest films of this year. I gave this note (10) by a combination of factors that made ​​the movie. The soundtrack was one of the best in years and may ,or not, be well praised by all. The movie will surprises everyone. That's what I say.",
      "total_reactions": 9,
      "user": "ryland"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "I've registered just to say how horrible is this movie. It's the worst movie I've ever seen, it doesn't even make sense. The bad acting make It completely awful.",
      "total_reactions": 6,
      "user": "davidrdlo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Even after pushing to seal up plot holes the story broke itself again and again. How did the knife wound in his chest not destroy his heart  when he came back to life? Why are bonies stronger without skin or muscles? This on top of mediocre acting and cringe-worthy CG scenes ruin what is a cool idea for a different kind of zombie movie.",
      "total_reactions": 6,
      "user": "RealManta"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Warm Bodies is a movie carry so much expectancy. I had been waiting for it since a month ago. In fact, almost all people who have watched the trailer are fascinated by it and await it’s showing. Well, except those who hate creepy zombies or only have relish for incomprehensible literary films. But Gosh! I am an ordinary girl who loves handsome British guys and melting romance! It is just for me when the two essential factors mix with fresh plot and powerful producing team. I fell in love with the guy during the film but fall in love with the movie later.",
      "total_reactions": 3,
      "user": "LynnShen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "I do not believe this film deserves a 10. But, I believe it's a shame that so many are giving it 1s or 0s when that's definitely what it deserves either. I give this movie an 8 out of 10, mostly for it's originality.",
      "total_reactions": 3,
      "user": "alwauconda"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "A freakin awesome movie that's worth watching. A cool concept that one could never imagine. It got wits that u would have never guessed a horror movie would have. One would just love this movie and would enjoy it",
      "total_reactions": 4,
      "user": "Frankie121"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "This is a girl movie with Zombies.  I enjoyed it, my wife liked it a little better than I did.  It was humorous and easy watching.  Some of the negative views seem to be based on how much someone paid to see it.  Not a good way to judge movies.  These are not George Romano's zombie's or Walking Dead zombies.  Get over that and you have an enjoyable movie.  It is slow in parts, the Teresa Palmer's character does do some really stupid things.  You have to really stretch your view on reality, even zombie reality, to allow for some things that happen and that's why I gave it a 6.",
      "total_reactions": 4,
      "user": "Zarchon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Thank you for making a different kind of zombie movie! This movie will satisfy any and all! It will make you laugh, startled and give your girlfriend some romance. Go see it!",
      "total_reactions": 4,
      "user": "applejackmomo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "Honestly this is one of the worst movies I have ever scene, well besides Rubber. What ever happened to rotting flesh and ripping obnoxious  faces off? For one the make up is pathetic; Honestly my 6 year old cousin could of done a better job on those veins then a professional. Two who the hell did beginners photo shop on those “Bonnies”,  Syfy could of make better skeletons then that. Thirdly The camera shots were horrific. The whole movie shouldn’t be blurry, what happened to making everyone look fat in HD, gotta boost the American fat people organization’s hopes somehow. Now that we have the basic’s said and done let’s start digging on the bigger picture  ZOMBIES. Their not supposed to beat people up, their supposed to rip you apart, and when did they get so strong? They’re supposed to be fragile morons like the average teenage girl, and not some scrawnie white boy like Edward Cullen. Also they’re not even meant  talk, like really now it’s called growling and mumbling not saying words like”hungry” and “safe”, they’re not two year old’s learning their first words. The fith bad thing about this horrible  romantic comedy” is nothing really fit’s  together it’s put in randomly like a freshman’s first thesis essay. Marcus is not supposed to blurt out some huge paragraph of word’s at “R” without some back ground information, and what made him tell R that he had a dream about some breakfast food what ever happened to his true love? Also i’m pretty sure that some plot twist’s would of helped. The movie in it’s self if a good concept but honestly someone else should of directed it.  I would of love to of seen R start to turn into some Bonnie when Julie broke his heart in the bed room, then had to have Marcus come save the day again by having to track Julie down and get her to find some way to get him to not rebel against everything to  make him have a flack back of the brain he enjoyed oh-so very much’ or something stupid like that.) Honestly they should make a second movie with this concept, but please make the zombies LOOK LIKE ZOMBIES! And not some white trash punk that rolled around in a pig pen.",
      "total_reactions": 4,
      "user": "haleyamber77"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Boy is dead.  Dead boy meets girl after eating her boyfriend's brains.  Dead boy falls for girl.  Girl fall for dead boy.  Paramilitary dad lightens up and relents.  No so dead boy and girl live happily everafter.  Dead boy is cute, teen girls everywhere let out a collective sigh.",
      "total_reactions": 6,
      "user": "mehki"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "A not-quite-heartfelt enough romantic comedy that's not quite funny enough. Warm Bodies needed to ramp up on one, the other, or both, but ends up idling on most of the time.",
      "total_reactions": 7,
      "user": "justinwalker"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "i really liked actually is awesome i could say 10 of 10 it was almost the same as the book i and liked even more than twilight i going to the cinema to see it again",
      "total_reactions": 7,
      "user": "chuylrueda"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "A competent romantic comedy that leans more towards romantic than comedy. It's good if you don't think too hard about it, but that's a criticism you could level at basically any zombie movie. This film is nothing like Twilight, by the way: it's actually good.",
      "total_reactions": 2,
      "user": "Deleran"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "mildly interesting for first 5 minutes of the movie and then it takes Rome  Juliet to new levels of low by taking this sort of script seriously. It would have been more interesting to see if  Romeo was a vibrator with all the grunting that is happening instead of dialogue.",
      "total_reactions": 6,
      "user": "asdasd33a"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "What can I honestly say? I went into this movie after watching the trailers, thinking \"This'll probably suck.\" So I was surprised to find it wasn't all that bad. The main character is likable, although I thought it was a pretty dead role (badum-tish). But in all seriousness, the acting was good for the most part, and I almost laughed at some parts. Then it fell into the whole \"Love conquers all\" rut. The movie tried to be funny in places, but I never found myself truly amused by the attempted humor. It also had a few major plot holes I couldn't shake off, so by the end of the movie I was annoyed when the questions I had went unanswered.",
      "total_reactions": 2,
      "user": "SolarFlicker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I really enjoyed the movie, as silly as the movie is.  It's a very good twist on classic love tales as well as the currently over popular zombie genre.  I am not sure why other people compare this movie to Twilight, it has nothing in common with it.  The movie had tons of surprises which is nice in the predictable world of younger age targeted movies.",
      "total_reactions": 2,
      "user": "Scornholio"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "So I guess zombies are where we draw the line with young love. Going in I didn't expect much from this movies and I was right. I didn't expect this movie to have a good story line, decent acting or realistic graphics and they delivered. I feel like the whole movie was made to follow the trend of paranormal love and it just didn't work out. Despite few scenes where I was woken up by the sound of people leaving, I was a sleep the whole time. An I never fall a sleep in a zombie movie.",
      "total_reactions": 2,
      "user": "RealScript"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Honestly, this movie seemed pretty good when I saw the commercials, but obviously, I was wrong. I watched the whole thing hoping it would pick up at one point, but it never did. It was boring, and not funny at all (except for like maybe 3 little jokes, which still were not that funny). Huge disappointment.",
      "total_reactions": 1,
      "user": "thefreeman140"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "A film worst than i expected. It was better than twillight but it was still a bad film. The plot is really uninteresting and there is nothing going on in the movie. The ending is really predictable and the whole movie was over the average. Such a shame",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "I didn't expect much out of this film yet I was disapointed. The movie offers a very cheesy message that \"love saved the zombies\". I laugh at the idea that this movie is was a comedy. The jokes this movie had to offer were really stupid. Any copy of this movie should burn in a fire.",
      "total_reactions": 2,
      "user": "FirePumpkins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "The only thing I knew before seeing this movie was that it had something to do with zombies, and that the movie got fairly decent reviews. My expectations weren't too high, and to be completely honest, I ended up really enjoying the movie.",
      "total_reactions": 1,
      "user": "rrtson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Appart from the horrible CGI effects and the lack of blood, this zombie comedy is actually very watchable.The acting was good, the action scenes were well made and the movie was entertaining.Overall,it was a good movie.Nothing more,nothing less.",
      "total_reactions": 1,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "The film has some cool ideas. The setting is interesting, the kind of zombie story being told is interesting, and I enjoy the main character. What prevents this movie from being anything spectacular is the romance. The love in this movie is not well written, cheesy, and takes what could have been an interesting movie and turns it into a teen fantasy. If you are a girl who loves  teen romance stories you will enjoy this movie. If you think this going to be an amazing film think again. It’s an eh film with some good ideas that is ruined by an excessive and poorly written love story. A shame too considering this movie looked promising. Who knows maybe the book is better.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "A fun, different take on the zombie genre, well-acted performances, a few laughs here and there, great soundtrack, and the result is a pretty cool movie.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This movie has everything; And ironic soundtrack.",
      "total_reactions": 0,
      "user": "DragonFax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Warm Bodies is a surprisingly entertaining movie from beginning to end. I think these writers need to get with the program. Making serious, dark zombie movies just doesn't work. The best zombie movies have been light-hearted movies that don't take themselves too seriously like this one and Zombieland. This film had plenty of humor, some solid acting, and a unique twist on the cliched zombie apocalypse concept. Here we have a zombie, played very well by Nicholas Hoult, who for some reason is drawn to human things and not just because he wants to eat their brains. This takes a turn when he sees Teresa Palmer's character and somehow falls in love. Looking at her it's easy to see why. She looks like a combination of Hayden Panettiere and Kristen Stewart but more attractive than either one. I truly hope she gets more roles because the camera loves her almost as much as R did. Back to the movie, throughout the rest of the film she essentially reteaches R how to be human and he begins to adapt over time. When this phenomenon begins to spread, the human population has an interesting situation on their hands. Overall, was this movie realistic at all? Of course not, but it's a zombie movie. Analyzing the film for plot holes or anything like that would be just silly. If you want a fun movie-watching experience, however, it's worth checking out.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Love comes into play in almost every feature film you will ever see. It comes in many forms and often times, entire movies are centered on it. Those are basically the film that I loath, but Warm Bodies was different for the simple fact that it has everything! From love and romance to apocalyptic Science Fiction, this film has something for everyone! In this world, a virus has spread and left the world in ruins. Several human settlements still exist, but they are the food source and they are surrounded. The film begins with a group of teenagers traveling into the danger zone in order to find medicine for their settlement, when they are attacked. It looks like they're all done for, when a zombie named R sees one of the girls and decides to save her instead of eat her. For some reason this girl evoked emotion in R, which led to memories. Soon the other zombies in R's group start having memories and decide to convince the humans that they are changing. Are they really changing though or is it a ploy? Love is the cure is kind of a hoke concept, but it is our most powerful emotion and it seemed plausible that this feeling could evoke memories. Nicholas Hoult (forever known as that kid from About A Boy) stars as R and is terrific. It might not take a lot of talent to play a zombie, but to play one that is learning to be human again is no easy task. Hoult plays the part perfectly and is the reason this film is believable. John Malkovich is also in Warm Bodies and while he's not playing a hilarious bad guy, he still adds a different dynamic to the film, getting involved in much of the action sequences. Warm Bodies is a refreshingly unique story that will appeal to a large audience. The Walking Dead it's not, but it still has enough bite to keep the audience that's not into all the classic romantic stuff. To be honest, I thought it might be good for a few laughs, but I never thought this film would be as good as it was. It has a message and makes an impact, while being a funny, edge of your seat thriller. This was really not something I would usually go for, but my recent Walking Dead inspired zombie craze put it on my radar and it was an amazing ride.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "Warm Bodies might have a bunch of lifeless zombies walking around but the movie is anything but. Its absorbing, funny, original, and full of heart, which is refreshing in this day age of stupid teenage boy girl love stories",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "A nice touch to all the zombie craziness circulating the movies these days. Funny, original, and sincere. This movie proves just how useful a soundtrack can add to a movie.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Although not quite gore for some, Warm Bodies is an optimistic, heartwarming, funny love story about a zombie and a human that makes Twilight fans feel bad about themselves for loving its terrible saga.",
      "total_reactions": 0,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Warm Bodies is an excellent post apocalyptic retelling of the classic Romeo & Juliet story, with a few twists of course.",
      "total_reactions": 0,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Watched with my 19=year old daughter.  We agreed that this was one of the best mixed of Zombie, loved, and comedy movies i\"ve ever watched. I didn't expect but the story-line and actor's  performance gradually become intrigued.",
      "total_reactions": 0,
      "user": "Kcsurfpapa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "We all know what a zombie is right? Those moaning dead things that wander around eating humans? Yeah, well Warm Bodies says a human girl and a zombie can fall in love. That's a con job.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "This is a decent horror-comedy that is enjoyable to watch. At first glance this movie might come across as Twilight with zombies, and for the most part it kind of is. But the humor and the unique perspective of the movie is what sets it apart, and keeps it from being the teen angst movie that Twilight was.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Fun, cleverly written and very funny. Warm Bodies is the best zom-rom-com since Shaun of the Dead. Nicholas Hoult and John Malkovich are the standout performances providing great entertainment in the midst of all the satisfactory scenes and average plot twists.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "First off, I didn't read the book, which is why I gave this movie a two (If I would have read the book, it probably would have dropped to a zero).",
      "total_reactions": 0,
      "user": "Nostalgic9tails"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was a refreshing take on a zombie apocalypse. It combines romance and comedy into a genre that does not see much of either and does it rather nicely. I liked the fact that it showed the apocalypse primarily from the zombies' point of view rather than the humans' and that it showed the zombies as creatures capable of thoughts and emotions rather than just mindless enemies to the humans. I rate this ten out of ten because it was a new, unique, and refreshing take on a genre that had been played out as action and horror so many times it was starting to become a bit boring. I'm glad this movie presented a new idea to liven up the undead genre.",
      "total_reactions": 0,
      "user": "Rainshadow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "I don't remember at first place why I watched this, and if you watch it maybe you don't remember it, I think that's all I can say about this weirdo project.",
      "total_reactions": 0,
      "user": "chepod8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "a really sweet  different movie and really talks about how important  the basic human feelings in life are. I thought it was just another zombie movie but turned out to be so great",
      "total_reactions": 0,
      "user": "nikritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Originally, I was expecting this to be a Twilight rip-off with zombies and I was thinking to myself, \"who in their right minds would want to rip-off something so unbelievably horrid?!\"",
      "total_reactions": 0,
      "user": "Epicluko"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "It doesn't take itself serious at all, knocks on some zombie flicks too. Love conquers all, loved the premise.  With some action, drama but above all if you don't take it too serious, you will enjoy it, the comedic moments were awesome.  Definitely not a disappointment at all.",
      "total_reactions": 0,
      "user": "dbad73"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Sappy but cute.  I consider this a guilty pleasure.  Definitely worth the redbox $1.24.  Teresa Palmer and Nicholas Hoult have enough chemistry to pull off a really silly premise.",
      "total_reactions": 0,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Zombie Type: Both slow-walking and fast-running undead",
      "total_reactions": 0,
      "user": "SecretAsianMann"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Warm Bodies is one of the most funny and interesting movies of this year, the cast is great, and the performances of all (Nicholas Hoult, Teresa Palmer, John Malkovich, Analeigh Tipton, Dave Franco and the rest) are really cool. Maybe is not the best movie of the genre, but Warm Bodies is extremely funny.",
      "total_reactions": 0,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Warm Bodies is a neat little horror movie now playing over the Internet.  \"Cute\", \"sweet\" and \"funny\" are not words I normally associate with zombie movies. \"Gross\", \"disgusting\" and \"gore\" are the ones I use. But this movie, directed by novice filmmaker Jonathan Levine, surprised me. I don't know if it's a new trend in zombie entertainment, but a nice zombie-human love story is a positive one.",
      "total_reactions": 0,
      "user": "Timothymayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "It vampires all over again-- Basically it Twilight but with zombies. The plot is nothing special and is a rip of of Undying Love by Hattori Mitsuru. The character were not memorable and their personalities were god awful; I would give the characters a 4 out of ten. It would have been really cool if they start explaining why the zombies hearts are beating again but the movie failed in that aspect as well. Also why did only R come back to life while the others didn`t; it was a massive plot hole. The actor were excellent but were the only thing going for the movie. 8 out of ten for that. I must say the movie was better than I expected since I read the book and it was better than that piece of crap. Now why did the girl R fall in love with kiss a walking corspe? Put it simple, would you kiss someone who has eaten your boyfriends brain?",
      "total_reactions": 0,
      "user": "Kenato"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "While its villains are weak and dialogue cheesy at times, Warm Bodies compensates by its sweet romance, energetic soundtrack, steady pacing and heart.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "First, I would like to say if you enjoy good films and/or zombies, please consider checking out Warm Bodies. The scores are kind of mixed about this movie even though it has a generally good score, I believe it should be higher, and let me say the only reason why the scores are lower is because either A) They are too dumb to understand this movie (p.s. it doesn't require a genius IQ to understand it.), B) They think zombies are a real entity and this movie didn't represent \"true zombie lore\", or C) They passed up the movie 5 minutes in or didn't even watch it because they thought it was akin to the likes of Twilight (it's not!). I loved this film and it was near perfect with its insights on modern society, the perception of a zombie apocalypse from the eyes of zombies, and the infusion of Romeo and Juliet archetype was done excellently. Ultimately, the conflict between zombies, bonies, and humans revolving around R and Julie make for a refreshing and enjoyable movie.",
      "total_reactions": 0,
      "user": "ComradeBanana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "a zombie movie should not have love . But the kicking zombies ass while love it is okay i guess but it is not something i expected . Grade B+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "It is a very unique movie. It is the first time I heard zombie being the good guy. I really enjoy this movie. It deliver much more than what I expected. I also loved the romance and the comedy presented in this movie. The plot really interest me and there is some plot twist, not much though. Acting is good. Probably lack of action if you expect it to be an extremely action-packed movie but I think it is enough. It is very outstanding. It stood out among all those crappy zombie movie released this year.",
      "total_reactions": 0,
      "user": "AdrianChan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "While its villains are weak and dialogue cheesy at times, Warm Bodies compensates by its sweet romance, energetic soundtrack, steady pacing and heart.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I am stunned, this movie is for kids! not bad? but my husband who is 49 bought this show, kinda weird when he makes fun of Real of Housewives..lol But since his girlfriend who is 26 now loves it, I guess it is Great....",
      "total_reactions": 0,
      "user": "wowow1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "I absolutely love this movie I just enjoy that not like your normal  zombie movie way better than Twilight. I would rate the movie  a 9. Why because  it was a twist  that turn in o to a romantic movie .one part that made me a little   confused was when the  black crazy looking things   that was control  the zombies. I really   didn't understand  what  were  they come   from .where they  people   at one  point  of did they just come from   hell.other then that i love the movie it was funny how the zombie  looking  people was  smarter  then ever.",
      "total_reactions": 0,
      "user": "Candygirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "I watched about 40 minutes and just couldn't take any more of it.  I'm thinking the target audience must be teenage girls who want to indulge with the fantasy that love conquers all, even the zombie apocalypse.  The problem with that is that the zombies here aren't actual zombies, not when they start more resembling the living than the dead, which makes the film seem like a fraud.  Also, the \"comedy\" isn't particularly funny and the \"romance\" isn't especially romantic.  Why there are still electric lights burning at the airport I don't know, since this is apparently some years after the apocalypse, but I'll take a wild guess and assume that no one wanted to bother coming up with an alternate source of illumination that might make some actual sense.  OK, the bony CGI zombies are kind of interesting, but not interesting enough to keep me watching.  Yawn.  Fear the Walking Dead season one tops this by a mile.  So does Quarantine, on a $12 mill budget.",
      "total_reactions": 0,
      "user": "HotelCentral"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Una vez más el título para Latinoamérica te mata la película. Con ese nombre ni a la esquina. Pero estaba John Malkovich en el reparto. Algo de esperanza había y no fue tiempo perdido. La trama pasa desde el punto de vista de un joven zombie y sus depresivos días caminando y gimiendo de aquí para allá. Es un manifiesto al derecho de un zombie a rehabilitarse, como los de cualquier humano. Entretenida. No tan idiota como su título sugiere. A los fan de Walking Dead los humanizará.",
      "total_reactions": 0,
      "user": "PabloUrbina"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Warm Bodies is an ingenious hybrid that, at its best, manages to be funny, lyrical and gruesome.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ],
  "metascore": 59,
  "name": "Warm Bodies",
  "num_weekends": 14,
  "opening_weekend_date": {
    "__type__": "datetime.date",
    "day": 1,
    "month": 2,
    "year": 2013
  },
  "opening_weekend_income": 20353967,
  "opening_weekend_income_currency": "$",
  "rating": 6.9,
  "rating_count": 191244,
  "rating_freq": {
    "1": 2979,
    "10": 20726,
    "2": 1762,
    "3": 2942,
    "4": 5640,
    "5": 13032,
    "6": 31653,
    "7": 56811,
    "8": 39391,
    "9": 16308
  },
  "release_day": 1,
  "release_month": "February",
  "release_year": 2013,
  "user_review_count": 329,
  "votes_per_demo": {
    "aged_18-29": 83674,
    "aged_30-44": 57628,
    "aged_45+": 10234,
    "aged_under_18": 880,
    "females": 52092,
    "females_aged_18-29": 31742,
    "females_aged_30-44": 13238,
    "females_aged_45+": 2246,
    "females_under_18": 577,
    "imdb_staff": 21,
    "imdb_users": 191244,
    "males": 109251,
    "males_aged_18-29": 51040,
    "males_aged_30-44": 43630,
    "males_aged_45+": 7820,
    "males_under_18": 293,
    "non-us_users": 86341,
    "top_1000_voters": 502,
    "us_users": 30380
  },
  "year": 2013
}