{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 44,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "13 Sins",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 23,
  "mc_pro_critic_reviews": [
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "Darkly funny and deeply twisted, 13 Sins grabs you from its startling opening sequence and doesn’t let go."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Creepy enough to get the job done, but not sufficiently extreme to fulfill the initial setup."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "[Webber's] performance is crazy good, and so emotionally charged that viewers may be forgiving of a finale overloaded with silly twists."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "13 Sins is occasionally inventive but mostly uninvolving."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "The horror flick 13 Sins is passable enough when it comes to dialing up the suspense, but the “Saw” formula of a mysterious voice guiding our hero through a series of depravities has gone a bit stale."
    },
    {
      "critic": "Nick Prigge",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Daniel Stamm's film is solidly helmed, if expectedly over-reliant on unnecessarily grisly comeuppances that leave nothing to the imagination."
    },
    {
      "critic": "Nikola Grozdanovic",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "This is one of those mind games that lean too heavily on the mindless to be thoroughly enjoyable, turning sadistic pleasure into harmless boredom."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "When the fly trapped in the spider's web is as clueless and selfish as the sap played by Mark Webber in 13 Sins, it's hard to muster much sympathy."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "This ultimately isn’t a film about human fallibility, but about high-concept grotesquerie for its own sake."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Achieves a modest degree of tension and dark humor before tilting into gory overkill, while its diffuse central ideas — about materialism, the dangers of playing God and the latent human capacity for violence — never really take plausible shape."
    },
    {
      "critic": "Martin Tsai",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "A \"Saw\" knockoff without the torture porn."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "It really bothers me when I like a film that is clearly a rip off of another film. 13 Sins is nothing more than a horror writers take on 12 Rounds. There are no wrestlers in this one, although I'm pretty sure Ron Perlman would have made a great one. This film is about a game, millionaires have played for decades, a game that has become more prolific and a lot more fun, with the advent of modern technology. A seemingly random person receives a call telling them that they've been selected for a game show. The subject completes simple tasks and starts earning money, but as the prize goes up, so does the danger. Once the subject is a wanted felon, they must finish the game and earn the grand prize or they could be spending the rest of their lives behind bars. Veteran character actor, Mark Webber, stars in 13 Sins and he was a very odd choice for a leading man. Webber is this small nerdy guy, who seems like he wouldn't be the type to play this game, no matter the reward. Like many others, Webber is suckered in an soon becomes a wanted man, he is being chased by a local detective, played by Ron Perlman. The casting created a very awkward dynamic, as the \"good guy\" is this huge scary guy, and the \"bad guy\" is this little nerdy guy, but somehow it works. 13 Sins is certainly more horrific and crazy than 12 Rounds was, however the similarities between the two are so similar that I'm surprised WWE Films didn't attempt to halt it's release. I loved the idea of 12 Rounds and 13 Sins is just taking the same idea to an extreme, but despite the clear similarities, and the odd choice of casting, it's still a thrilling film that was definitely entertaining.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "A fairly entertaining movie however not in the least bit original. The other problem with this film is that the ending leaves everything unresolved. In typical horror movie fashion it leaves it open for sequels but at the same time the movie doesn't really leave you wanting more.",
      "total_reactions": 1,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "This is what someone would make if Saw and Chess were together. That's what 13 Sins is. The movie starts out slow and ends slow as well. But the entertaining plot and the strong performances make it more than just a bargain theatre horror porn. When I mean this movie is crazy, it's super crazy. Plot twists, direction and story is done really well. This one really is much more than its aiming for. Providing great action scenes, awesome plot twists and a bloody 70s game show style- 13 Sins is one of the best VOD movies of the year, it's scary, twisted and bloody fun.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Positives: The performances are solid, early parts kept my interest",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "The acting wasn't terrible, in fact, looking like it would have been cheaply made, you'd assume a bit of cheap acting. I thought the performances were strong, well thought out script for the most part.",
      "total_reactions": 1,
      "user": "MsDefibrillator"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "13 Sins is brutal, mainstream terror. I watched it online and I not only was hooked all the way to the end, but also thinking of what a hell of an idea. Well done performances from all the actors and the there is likable characters too. Every film has its SINS, this movie just becomes a bit boring and repetitive an hour in and it is disappointing. However, you have to see 13 Sins, it is highly recommended!",
      "total_reactions": 4,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "A silly, dumb pile of garbage. The movie isn't clever enough and  becomes even more unrealistic and corny as time goes by. It wasn't thrilling or scary.",
      "total_reactions": 4,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "The quick money does not come from easy way!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "probably one of the better movies I've seen on Netflix lately and a nice decent horror/crime movie to watch ...its smart , suspenseful and keeps you on the edge of your seat.",
      "total_reactions": 0,
      "user": "david1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "With a plot that never seems to die down, 13 Sins brings a new level of horror that overtakes many psychological monster films, especially when the monster is you-- doing anything and everything it takes for money.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "I saw this at a bargain house because all the other movies were still all the Oscar nominations and I had already seen all those, so I thought I would give it a shot. The plot sounded interesting.  I’m glad I saw it. It turned out to be pretty entertaining. I like going to these movies where you haven’t really seen any previews of them and don’t really don’t what they are about. It’s a nice surprise when they turn out to be good like this. I never got bored and there were parts in the movie that made me sit up and bite my nails and even on the edge of my seat a little. It’s about a guy who’s down on his luck who gets contacted by “someone” to play a Game where he can profit greatly. I know you’ve heard this type of concept before like “The Game” and “The Box”. Even though this was a lower budget movie, I actually liked this better than those. I think it gave you just enough info to intrigue you unlike “The Box” where I didn’t really get it at the end and “The Game” that wrapped everything up to neat and tidy. You have enough questions to keep you talking about it after wards, but not so many questions where you give up on it. It has Ron Pearlman in it and Rutina Wesley from “True Blood too”. There was one scene where I almost covered my eyes and another where my friend said it was almost to gross for him to look at. Maybe not one you’d see in a theater over Noah and Captain America, but definitely rent this one or see it in a bargain theater.",
      "total_reactions": 0,
      "user": "thelizcass"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "I loved the performance of the cast, the story is good. I missed something in the script,  in the general is good. I wasn't expecting something Rated R, but it's alright.",
      "total_reactions": 0,
      "user": "Adson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "If nothing else, this movie certainly has balls. It's darkly comedic and highly entertaining, but at times it does feel like the writers bit off more than they can chew.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "The premise of the movie was quite interesting and exciting to watch - you didn't know what to expect and so on and in the end it turned out that the game the main character is playing is actually something which has been around for decades. The idea is that you get a chance to win millions of dollars if you go through 13 phases of a game, which start quite simple, like killing a bug or eating it and end up with you having to kill actual people. Now while I get all that, I didn't like how the movie ended, I mean, the guy ended up killing his brother and decided to turn down the money in the end. It didn't seem like it would happen in reality - I mean, he just went through a lot, killed his brother, his father died etc, and he is having a kid soon with his wife. I think he should've at least taken the money for all he went through. I mean not for him but for his new family. Otherwise it all really was for nothing.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "What you have here is a good Thriller come Horror movie with strong acting and decent direction.  Though the story is a slightly familiar one there are enough changes to give it a fresh feel.  There are many films of this ilk so cliches are included, though the way they are handled makes them less discernible.  Worth a watch.",
      "total_reactions": 0,
      "user": "S1r-R34l"
    }
  ]
}