{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 48,
  "mc_mixed_rating_frequency": 58,
  "mc_movie_name": "17 Again",
  "mc_negative_rating_frequency": 26,
  "mc_positive_rating_frequency": 80,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "After seeing both HSM and Hairspray, I thought Efron was some pretty boy singer, I came into this movie with low expectations but I was plesently surprised with what I saw. I never knew Efron could do comedy like this.Thomas Lennon steals the show as his rich but nerdy best friend who pretends to be his father. Matthew Perry still shows the same attitude as his character Chandler friends and Leslie Mann is a Darling in this film showing that she is more than someone in a Judd Apatow comedy. while it's not up there with other great comedy films, it's not at the bottom of the barrel Rob Schnider type of comedy either.",
      "total_reactions": 2,
      "user": "Tranquilbez22"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "A Zac Efron movie?! Now you know it's gonna suck!.....THAT's what you think when you hear about this movie, but if you actually see it, it's an absoloute friggin' MASTERPIECE! :D It's actually one of the best movies I've ever seen, and this portrays Zac Efron in a new light and shows us that he can actually act! :) Plus, Judd Apatow's wife Leslie Mann is in this, so that's an extra bonus! :D!",
      "total_reactions": 5,
      "user": "Cartoonfreak95"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Surprisingly great, great acting, likable characters, and a good sense of humor make this movie shine, while it does have some flaws here and there with the conclusion (as you never see how he makes things right between him and his kids) as long as you don't over think it, you'll find this an extremely enjoyable comedy.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Zac Efron says he doesn't want to be stereotyped as a high school student. But with his performance in this film, he may want to stick with it. The film is a sidesplitting comedy/drama fest. With a funny cast and highly-alive screenplay, everybody who grew up on movies like this will want to be 17 again.",
      "total_reactions": 1,
      "user": "buellerbueller"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "My fiance drug me to the theater to see this one and suprisingly, I was impressed! This is a good comedy with a pretty darn good performance from Efron! Give it a try and if you like it, great! If not, move on! I enjoyed it when I expected otherwise.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "17 Again (B-) - Normally I am pretty harsh on these teen romantic comedies - And no, its not original, but the acting was solid and it was fun and funny enough to make it enjoyable.",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "A largely unfunny and unoriginal out-of-body comedy, with an important message to send to Hollywood: You can surround a cast with as many comedy pros as you want, but none of them are going help Zac Efron go down any easier.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "An awesome film about Mike O'Donnell (Zac efron) getting to be 17 again as he has wasted his teenage life, and wanted to re-do this particular part of his life. I absolutely loved this film, and it hilarious in some bits, especially Ned, who is Mike's best mate since they were small. 10/10 :)",
      "total_reactions": 0,
      "user": "Smileylivvie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "The first minutes of \"17 Again\" are proud to present a shirtless and sweaty Zac Efron. Now observe yourself. Observe yourself, real hard. How did that first sentence made you feel? Did it excite you? Discouraged you? Made you laugh? Anything? I ask you this because that feeling will most likely stay with you for the rest of the film.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "The Plot Is So Unoriginal! The Script Is A Copy Of A Copy..",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I had no expectations when I saw this film but this is a phenomenal film. Maybe I am just at the right age for it (I was 17 when I saw this) but it is hilarious. Zac Efron is surprisingly likable, possibly aided by the fact he is meant to be a lot older. Matthew Perry is funny when he partakes in different scenes but Thomas Lennon steals the show with fantastic expressions and just simple comedic timing.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "This movie seems to embrace how utterly cliche it is. Man has family with wife, daughter, and son. Kids don't love him, wife wants a divorce, blah, blah, blah. We've all seen it a hundred times before so I don't think I need to explain it further. But for literally no reason at all, the main character Mike apparently has some kind of fairy godmother who takes the form of a janitor (this is never really explained... ever). This eventually leads to him falling off of a bridge into a magical whirlpool and then turning...You guessed it... 17 again. Anyone who has ever seen a movie before in their entire life can guess how it ends, so If I gave away the ending, it wouldn't really be a spoiler. There aren't any twists or surprises whatsoever. I knew how it was going to end before I even started watching it.",
      "total_reactions": 0,
      "user": "TragicShow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Without Matthew Perry, i would've given this movie lower score! But even though the story has flaws, i think its worth a watch... fun but decent! 5/10",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Otro Troy tengo un primo que no aguanta tener un polvazo con el protagonista que trabajo en peliculas Gays ay dios mio ayudenme que asco de pelicula nada que decir de este pedazo de basura",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "This is not a movie about humans, it's about machines, I can't find it funny nor dramatically. If life would be that easy, no one could ever reflect on a mistake and there will be no regrets to think about, almost everyone will just do the same mistakes or worst again and again for like 17 times, until they just get bored and die.",
      "total_reactions": 0,
      "user": "AndreiC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "This film is very entertaining and Zac Efron surprised me with his acting and comedy skills.  I thought he was very likable and I really liked the original story idea.  This film is hilarious and heart warming, and I enjoyed it a lot.",
      "total_reactions": 0,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "It's slight entertainment, something that you wont remember in a long time, but it still has its laughs and heart, which for a teen comedy, isnt it all that matters?",
      "total_reactions": 0,
      "user": "ryanneevman"
    }
  ]
}