{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 49,
  "mc_mixed_rating_frequency": 204,
  "mc_movie_name": "2012",
  "mc_negative_rating_frequency": 175,
  "mc_positive_rating_frequency": 250,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Here we have an example of how to make a disaster movie. The formula is simple: add a boring plot that is completely science-fiction; slap on dull, uninteresting characters; and finally, make the story so ridiculously predictable that you can tell what is going to happen at the end during the first 40 minutes. While the special effects are incredible (easily some of the best I've seen in a movie), it suffers from bad characters, a dull story, and it's overly long length.",
      "total_reactions": 1,
      "user": "BlogDog123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "This movie is brain damage on a projector screen. The special effects were clumsily misused so that rather than making something intense and interesting - it's boring and predictable. Cut the special effects from this movie and you are left with very little. But blaming the film makers is simple minded, it's the retarded adult movie goers who are to blame by watching and then letting these film makers get away with this rubbish. We actual could have a better film industry with better movies if people had bigger minds and weren't so easily entertained by this laughable joke. LAME.",
      "total_reactions": 1,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "I have to admit that it was kinda fun to watch **** be destroyed in this movie and all that, but besides that it's nothing more nor nothing less than one big mess of special effects. The story is way to predictable, it overuses close calls way to damn much. But i do have to admit that some parts in this movie actually managed to surprise me. Besides all of this, this movie still delivers what it promises, it's stupid and all, but all in all it's still one hell of a joy ride.",
      "total_reactions": 1,
      "user": "SnafuFrank"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is exactly what's wrong with most CGI-driven blockbusters. There is no character development, the acting and dialogue stink, there isn't a single original idea in the whole movie and it relied too much on bad science moments. Unimpressed to put it lightly.",
      "total_reactions": 1,
      "user": "jos95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "Although 2012 is very visually impressive, the film is very scientific incorrect and is very far fetched. The film many consists on SFX and BS moments instead of a good story.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "A movie where you find yourself laughing where you shouldn't have been laughing. It's in the film that you find yourself laughing at parts that are unintentionally hilarious, due to sloppy writing and the usual special effects driven trash. There's almost nothing in this movie to review, it was just a 2 hour coma, occasionally interrupted by a couple of special effects sequences, all of which are ridiculous in nature, and all of which look less and less impressive each time we are shown them. The characters are painfully bland and uninteresting, no depth to them whatsoever. Emerich's previous film in the disaster category; The Day After Tomorrow, should have been a clear indicator that the guy can't write inspired disaster films very well.There is far, far too much emphasis on special effects in this film. One thing that also intensely grated me was when I watched a trailer for this film, with the bold assertion on a title card \"It could really happen\". Sorry, Emerich, but when science and the Mayans themselves attach no special significance to 2012, don't try and think you can market your film as being scientifically supported and expect me to swallow the kind of **** you're selling. You did the same with The Day After Tomorrow, I didn't fall for it then, don't expect me to this time. Try making good films, Emerich, you might learn something.",
      "total_reactions": 1,
      "user": "pauljohnson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "(January 14, 2010)",
      "total_reactions": 1,
      "user": "T-rAv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Well, people justify a positive review by comparing this film with common movies made in Hollywood, and recently baked ones. Exactly, presently made in Hollywood. Except the universe is not Hollywood neither cinema was born today. If you still believe cinema was created a few years ago and you think the film industry gravitates Hollywood, well, you're wrong and you probably ate too much popcorn. You'll love this one if that's the case. Not in case, you'll only taste a synthetic audience statistics bombastic and orgasmic glutton of a C series packed with good actors. That's all, you'll be hungry few minutes after you've seen this rubbish, and when you get home you'll be pissed for wasting your money, believing in fairy promotional cultural religious tales. But as you said, it's Hollywood!",
      "total_reactions": 1,
      "user": "ZeTomes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "So, John Cusack, Oliver Platt and Zlatko Buric are total dabblers in acting and Roland Emmerich is completely untalented in terms of writing. But  2012 is no 0-points-movie. There are some nice actors in this box-office-success and when the German director is making whole LA drown, it is impressive. But this movie is just unfavorable. This so damn overlong film is fully packed with buildings crumbling, waves overflooding great areas, earthquakes destroying whole cities and CGI everywhere. Too much of that, Mr. Emmerich! I have to grant him that he managed to put emotion in it with the family stuff surrounding John Cusack's role. This guy totally sucks at acting and his movie kids relegated him when they were playing together, but this one particular scene at the end of the movie touched me. But for all that it's not really hard to make such a scene emotional when you've got a nice soundtrack and a near-death-experience with a family as the story. So, is 2012 worth watching? Not really, because the FX aren't that good to make you enjoy the movie (I just overthought the movie and I get that you can never really enjoy a movie with such a plot!) and the dialogues are plain stupid. However, it's not that bad because of some nice actors and good editing, score and cinematography stuff.",
      "total_reactions": 1,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "\"2012\" is a disastrous movie that you wouldn't want happening to you. Think about it; Decent CGI buildings following down with cliched people running around with limousines and hiding inside **** arks. Hell, I don't want that happening....",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Way too long and actually uninteresting. Predictable and terribly scripted, too with way too little self-aware comedy. No emotion and only one bright spot being Woody Harrelson",
      "total_reactions": 5,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "The film was nothing more than another Hollywood publicity stunt driven by special effects. And the effects weren't spectacular anyway. The effects looked cheap, rushed, and was the only thing that was keeping this movie alive. The major downfall of this movie is that it was made to begin with. Not even great actors like Danny Glover could save this movie. Spending the entire time in a russian plane trying to escape disaster? Get real.",
      "total_reactions": 6,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "The worst film i watched! I am not believe in stories about the end of the world and I think that director of this film is an idiot! Don't spend your time and your many on such stuped film!",
      "total_reactions": 2,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "I definitely can't say that it was the best movie I had ever seen, but it was still a great watch! I don't know what's up with the other reviewers saying that it is \"total crap,\" but, everyone's got their opinions. Great special effects, and a good story. All the humor put into the movie made it better. Although, the acting was ok. Not terrible, but it was good. And, of course, the movie is totally unrealistic. Just like any other Sci-Fi/Fantasy movie. Unless you believe in 2012... But, I don't so... Again, pretty good movie. 9/10 from me.",
      "total_reactions": 3,
      "user": "SwitSwat"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "2012 is the nice movies. It describes the thing thay may come to us in 21-12-2012, it has earthquake, tsunami, volcano. It has nice effect,, but the story is just to familiar",
      "total_reactions": 4,
      "user": "hacmiu36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Perhaps the biggest fault of 2012 is that it takes itself so seriously. This is the most over-the-top, stupid, and ridiculous movie I have ever seen, and at times it almost feels as if it would have fared better as a comedy, because I almost couldn't stop myself from laughing at times. All that said, the special effects are absolutely stunning, and seeing this on the big screen will blow your mind. Everything else about the movie is lackluster and poorly thought out. The only reason you should really consider watching this movie is if you want to see special effects done right, because damn, they are done right in 2012.",
      "total_reactions": 1,
      "user": "Air"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Roland Emmerich is very good at making a movie that has something to do with the end of the world in 2012 according to the mayan calendar, but its not going to happen.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "One of the worst movies I've seen in a while. Giving it a five is being generous. It was as if they through everything together really fast with not much planning. There was negative character development, leaving them bland. The movie was laaaaaaaame, I don't know what else to say. And then they just hoped on a boat and THE END!",
      "total_reactions": 1,
      "user": "Sixella"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "2012 is possibly the single most impressive CGI epic ever released in recent years. As the title obviously states, the movie is about the end of the world and it does a damn good job of portraying it. Sure, the acting and all that other stuff is bad but even if you hated Independence Day you have at least got to appreciate the CGI in this one. Its so good that I have given this movie a perfect 10 simply based on the effects.",
      "total_reactions": 3,
      "user": "TheNewSpielberg"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "2012 is a disaster movie of 2009 directed by Roland Emmerich. The plot is about Adrian Helmesey, a geologist at the White House in 2009, with the help of his Indian friend, he finds that solar storms are heating up the earth's core liquefying the outer casing. Thus began a plan to save humanity, while in 2012 a writer Jackson Curtis discovered by chance this plan and will do anything to rescue his family. Although in the film there is a criticism of the people in power, 2012 is a fun movie and entertainment thanks to the spectacular special effects, exaggerated but well used. The only flaw in the film are the script too simple and the theory that they used to end the world.",
      "total_reactions": 2,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "The idea of the film is well made, but it is a movie that appeals to you.",
      "total_reactions": 2,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "For all the glorious visual effects it offers up, 2012 is a dud. The script is trash, but if you're familiar with the rest of Emmerich's work, then you probably know that's a given.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "It's one of Roland Emmerich's better films, but it's not exactly intelligent in any sense of the word.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "\"2012\" is another high-tech disaster epic from the always-enjoyable Roland Emmerich, and this time he pulls no punches as he delivers onscreen the literal end of the world, based upon the conspiracy theory of the Mayan calendar. Though this doesn't carry the emotional weight or strength of characters found in \"The Day After Tomorrow\" or \"Independence Day\", this is a purely visual powerhouse. The special effects are breathtaking, and particularly the scenes in Yellowstone and Las Angeles are fantastically exciting. It does drag a bit through the second act, but when it gets to the climax, Emmerich gives us a formulaic (and absolutely delightful) extended climax in the spirit of all great disaster movies - one where almost anything that can go wrong, does go wrong, and they survive a plethora of close cuts and scrapes by the skin of their teeth. Is it realistic? Hell no, but that's not why you watch a disaster movie. Is it Emmerich's best? Certainly not. But it is nonetheless a very fun ride.",
      "total_reactions": 1,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Not the best movie i've ever seen but to not the worst. The special effects are nice and there was lot of action in it. The cast isn't the worst but to not the best.",
      "total_reactions": 1,
      "user": "Wiesy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "2012 is a great disaster movie showing all the possible endings of the world. Unlike the other crap disaster movies like Apocalypse now or something this delivers great graphics, top quality voicing and even a lot of real life aspects ( Ferrari and Bentley in the plane) and lots of famous brands ( Coco-Pop can be seen when the supermarket grows a sinkhole). This also introduces new technology to us and has been great at showing that not all the end of the world movies are set in USA ( The ending takes place in China) and lots of emotional moments. If you are a fan of disaster flicks this should be watched.",
      "total_reactions": 1,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Good story line and movie in general but to me there wasnt enough violence. By violence I mean people attacking other people with knives, guns etc. not natural disasters. The ending was the only bad part to me, it lasted way too long otherwise I would have given the movie a 10.",
      "total_reactions": 1,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the best documentaries I've ever seen, second only to Zoo. It really captures the bravery of the heroes that allowed humanity to survive to this day. Okay, now I gotta get back to work. There's a lot of things in the ark that need fixing!",
      "total_reactions": 2,
      "user": "BakaHaram"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Typical disaster movie, yet still entertaining. The destruction of Los Angeles is beautiful. There is no really deep characters. Once you get used to the destruction, its a meh movie. But I was still entertained to the end. But if you want to watch destruction that forces you into the moment, watch until they team up with the russian dude.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "After all these disaster films that Emmerich has thrown at us, he closes with an unsurprisingly stupid encore that is 2012 and yes this is the last disaster film he's going to throw at us, thank god. Like all the previous disaster films he made, lets list the obvious stupid: Lots of plot holes, inconsideration with factual science,  tacky acting and the ability to make you look stupid. Since this film tackles the issue or at least try to of the survival of the human race, it is done so hypocritically and insensitively that you completely have no sympathy whatsoever. The main character is pretty much indestructible while the supporting characters are either death chowder or  annoying plot devices and has completely no shame in thinking that the audiences are dumbasses. Upside; Effects look quite good. 'Nuff said.",
      "total_reactions": 0,
      "user": "muzziklover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "Just when I thought that Transformers 2 was the epitome of ridiculous movies, Columbia Pictures once again distributes a ludicrous film with 2012. Films are at times meant to create an alternate world for the audience to experience, but in this case, it does not apply to situations that are purely coincidental to the point of inanity. Roland Emmerich's 2012, is a speculation of what will occur on the infamous date of December 12, 2012.  The film focuses on Jackson Curtis (John Cusack), a failed writer who has recently gone through a divorce and is attempting to reestablish his family relationships.  Meanwhile, the government is trying to cover up the pending apocalyptic event in order to save a select few individuals by building indestructible ships. When the earth-ending event occurs, Jackson Curtis tries to save his family in unbelievable and idiotic ways to reach China, the location of the modern day \"Noah's Arc\".",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "After watching this movie I wanted to world to end. I was so mad about wasting my money on this instead of waiting for it to come to cable (probably in the year 2012 haha). Only a good movie if you want to see special effects and things crumbling down.",
      "total_reactions": 0,
      "user": "Tubie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "I must confess to being a little confused by this doomsday themed movie. Whilst obviously a cleverly constructed and well shot sequel, it appears to have picked up almost none of the story threads, none of the characters, and certainly none of the actors, from the movie that started the franchise. It's a fast-paced narrative, set 11 years after the end of the first movie, and introduced to a small group of new characters, led by the always reliable John Cusack, who confront a number of omens foretelling imminent cataclysmic events. As expected, they are soon struggling with a rapidly escalating series of natural disasters, always escaping with seconds to spare. In common with the first movie, there is a major plot-line involving contact with an alien race, but it is a completely new race of beings, at a very different stage of technological development, and with their own set of reasons for journeying to earth and assisting the human race. There is no doubting the craft and skill that has gone into the convincing creation of this chaotic world, and yet, I kept feeling shortchanged by the apparent abandonment of the storyline from the original movie. The glossing over of this discontinuity detracted from the spectacle, and I found myself wishing for more emotional substance to the story. Perhaps just a few scenes with the original movie's main characters David Bowman and Frank Poole would have provided this, not to mention some more time with the apes. On the plus side, it's filled with stunning scenes of destruction and mayhem, and who isn't excited by that kind of stuff? People scream and flee for their lives. Buildings crumple and crunch and snap. It's all very satisfying in the usual disaster movie way. There are frequent shots of cities and towns suddenly transforming into vistas of mass death and suffering, and who doesn't like to gorge on that kind of imagery? Clearly, it's a crowd-pleaser. Grab some popcorn, and go see it.",
      "total_reactions": 0,
      "user": "DKaasbraden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "2012 is a pity. It could honestly be such a great movie, and at times it shows that potential. But marring with the amazing sight of a private plane barely soaring over a crumbling Las Vegas is the horribly shallow characters and the paper-thin plot line. The movie talks about a family and how they are able to magically survive disasters that kill billions of other people. Of course, the stepfather just received a pilot's license yet can navigate through narrow gaps between falling pieces of earth during a massive earthquake, why shouldn't he be able to? Even worse than the main characters were the secondary characters; you don't learn really anything about the Russian guy except that he has two kids and a wife. The worst part is near the end, when they throw away the stepfather and forget about him as if he never existed. If you want some amazing setpieces, this movie is for you. If you don't, then just forget about it.",
      "total_reactions": 0,
      "user": "Frostbite"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "great movie for the family. the best disaster movie ever made, special affects one the best of 2009. The acting sucks but thats not why i went to go see it i went because this does what hollwood is supposed to do entertain me. so if you have nothing to do on the weekend go but or rent 2012 and enjoy yourself.",
      "total_reactions": 0,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "The effects are well done and it does ooze the panic you expect from a disaster movie like this. With all of that there isn't much of a reason to care. The characters are developed, but only a little bit. If you can switch off your brain for 2 hours, you too can survive and smile at the glaring mistakes to physics.",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "woow i can not believe how stupid and dumb this movie is, and i can not believe that many people liked it and if anyone gives a score above 4 must be a retard for real. 1 point for special effects, nothing else. this movie is like the disaster that happened in the actual scenes.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I went into the theater not expecting much of this movie - and was positively surprised.",
      "total_reactions": 0,
      "user": "xShayne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "It was basically the \"Dude Wheres My Car\" of disaster movies, plus it was too long, they could have chopped off 50 minutes and it still would have made sense.",
      "total_reactions": 0,
      "user": "NickJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "It's a good movie. The special effects were just unreal. But it's a little repetitive because of the movie The Day After Tomorrow. Still it's an awesome movie and I would recommend this to anyone.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "2012 like I predicted before, It will be a controversial movie. If we talked about the end of the world, issue about some religions was avoidable. Thiz movie itself started with a major box office world-wide. People came to the theaters wanted to know how the world ends. Thiz is totally just theme-victory. The Director is Roland Emmerich, who I called The Master of Apocalypse. Before 2012, Emmerich often brings the topic about the end of the world, such as: â",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "**** ****!1 ****!!!!!!!!!!!11 This movie well not scare the hell of me. Y'know this movie contains absurdities and cheesiness, multi-layerred cheesines.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "2012 barely even catch the main theme, thinking that the world is going to be affected by natural disasters grabs my attention , but for a performance that mix's funny moments, exaggerated moments that feels unbelievable  ( okay no movie is true of course ) . 2012 needed more realism and  taking care of seriousness. Wait for 2013 people",
      "total_reactions": 0,
      "user": "Watermelon789"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "A visual spectacular of Earth-shattering events! Lots of fun to watch, but ultimately turns to pure cheese in the third act making me say to myself, \"No way! Whatever!\" This film could have been great, but that third act forces it inevitably into the good category. Still worth a look to see the world ripped to pieces!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "2012 is certainly not a \"WOW\" movie but it is just a \"good to average\" movie. The special effects were the shining part of the movie. But still, there are flaws which makes 2012 an inconsistent movie. There are also scenes which are predictable especially the death scenes and there are scenes that are great, more like 70%- predictable scenes, 30%- great scenes, I wanted to be more surprised and shocked with the movie. But I must say that overall, it does not deserve bad ratings because of the stellar special effects and the good flow of the story. Great concept but they didn't quite hit on the execution...",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "If you ask me, this movie isn't all that bad. It's actually one of my favorites. I don't understand why it's getting so much crap. The special effects were some of the best I have ever seen and are great for 2009 and just this time. I saw it in theaters and it astonished me at how our film industry has evolved computer animation. the part in the film where John cusack and his family are escaping L.A. in the plane and in the limo is just spectacular and in a strange way, beautiful (even though the earth was crumbling around them). But enough about that, the storyline I thought was good too. It wasn't the best but still kept my attention throughout the whole movie. I was on the edge of my seat when the action began and stayed that way. It seemed scientifically accurate but I'm not a scientist or anything so that's not for me to judge. It was funny at times and just plain awesome. But every movie has it's ups and downs. The storyline was good, trust me, but kinda empty and stale. A divorced father trying to get a better understanding of his kids who don't exactly like him (especially his son) and then begins a race with time to save his family after he gets inside knowledge from a crazy radio show host (Woody Harrelson) that the world is going to end on the date of 12/21/12 which the Mayans prophecized of millions of years ago. So the storyline isn't the best part of the film, also some parts of the film made you just shake your head. But not every movie is perfect, right? So this movie is not the worst movie ever made and if you ask me, one of the best. Well, not the best but you know what I'm getting at.",
      "total_reactions": 0,
      "user": "JAM123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Well, it is not difficult to talk about Emmerich's \"2012\". Basically, it follows the same pattern formula of other tragedy pictures: brainless action, bland characters and excellent visual effects. But seriously, by now they should have realized that emotional attachment to the protagonists creates more impact than the unstoppable destruction that we see here.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Actually I'll just wait for the day that supposedly the world will end, to make my criticism, then I'll have more critics where to get the facts. For now leave this brief message to remember.",
      "total_reactions": 0,
      "user": "JoseRochaPT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This movie was a joy to watch. However it didn't have the best plot/story. It didn't have a proper story to it really, apart from the world ending. You get to meet some interesting characters along the way, but there's no real emotional connection with them like you do with characters in other movies. The CGI and visual effects are stunning, unlike anything I've seen before. Most of the movie was done digitally and most of the landscapes they were on were computer generated. The ending was okay, and the action scenes were stunning. It shows the true force of mother nature at her worst and just how easy it can tear apart a single planet.",
      "total_reactions": 0,
      "user": "MediaCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "2012 was a nice movie, maybe there were a few elements that need to be fixed but other than that no. The plot maybe needed some fixing but visual effects and the script were mostly fine. The movie is stil a movie worth watching for a quick entertainment fix so it may have flaws but it is still worth watching.",
      "total_reactions": 0,
      "user": "Sachi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "I particularly did not see any fun in this film is a kind of story that has been widely Wears and if you are not in order to see a movie \"Everything is running out to save yourself if you can\" again, then do not watch this movie.",
      "total_reactions": 0,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "I get the feeling that people give this film bad ratings because they are scared of 2012. Don't give it bad ratings unless you think its really a bad movie, not because you are scared of the year 2012. This disaster movie is pretty chaotic with the effects and there is quite a bit of character development, even if the story is a tad bit wobbly.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "First and foremost, to the critics and users who 'awarded' this film a one or two, what did you honestly expect? It's a disaster feature directed by the master of doomful movies, Roland Emmerich. He's been making these type of flicks for quite a while now and his style and overall substance hasn't changed much over the years. Yes, '2012' has cheesy acting, modest screenwriting and an absurdly nonsense plot but again I ask the question - were you expecting something different. As far as cataclysmic pictures are rated, this is average.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I went into the theater not expecting much of this movie - and was positively surprised.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "As Americans, we have long been drawn to the concept of the end of the world. This time around, Roland Emmerich uses realistic themes from the Bible and tells a story of inter-changing lives throughout the world. There are memorable points; however, the film suffers from an extended run and should have been edited and reduced substantially.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "2012 is the ultimate disaster movie. Some people will hate that and some will not. I found it fascinating. Definitely predictable but i don't care. Forgettable",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Good special effects but the overall plot is pretty rediculous. Tsunamis as high as Mt. Everest is pretty over the top if you ask me. It kind of has a similar approach to the movie Day After Tomorrow; good effects but an exaggerated plot.",
      "total_reactions": 0,
      "user": "000Tuld000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "\"2012\", just like \"The Day After Tomorrow\", has spectacular visuals and excellent use of CGI, but the script is very weak. Roland Emmerich, who helmed both movies, never quite seem to understand his mistakes.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Another movie about the end of the world ... Roland, and not get bored of the same? Now talking about the movie is good, only that it is good already. The only thing that can boast are the effects that are very well made. Mr. Roland, and stop making films about disasters please!",
      "total_reactions": 0,
      "user": "iKevin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "An alright film which won't really gain favourable reviews in comparison to The Day After Tomorrow. Still as a stand alone film, it is one which was watchable but didn't really break any barriers. Some of the ideas are quite good whilst other parts are just juvenile.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "What an utter CGI crap. No story, lame characters with no depth, unbelievable action sequences. As bad as any other cheap \"B\" class catastrophe movie, just with a big budget. Avoid it",
      "total_reactions": 0,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "2012 falls short on character like most disaster movies do, but the sequences of tsunamis, earthquakes and other natural disasters are amazingly well realized and very intense. If you want a big, fun, popcorn flick to kick back and enjoy then 2012 was made for that - even if it is a bit long.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Ruim",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Boring. This movie was boring. Even with all the effects, and all the visuals it just seemed to drag on forever. After an hour in I thought it felt like the end of the movie, but no. An hour and a half to go! Ugghh!",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Well I can say that this wasn't the best movie, but it was entertaining. The plot is basic world ending trying to get family to safety. The thing that drives the film are the effetcs which were good and believable. Other then that its  boring. For the main part the acting was good especially the scene's between father-son and dad-son. Other then those two things the film would be nothing without the flashy special effects.I do feel comfortable saying that it is the best disaster film ever, but others might not. I do however think The Day After Tomorrow was better and written more clever. Watch if your bored or just want to see the world end in a clever way. [I appologize if any thing is messed up the space botton on the computeris messed up]",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "Boy is Roland Emmerich a pro when it comes to disaster movies, and this one is no exception. This is probably one of his worse disaster movies, then again, they don't call it \"disaster\" for nothing. The storyline may be exciting, but when you put the rest of the elements in this storyline, you lose that perfect disaster movie you've been looking for. The story is a mess. It goes just all over the place. There are really some characters that you don't need to have in this movie (pretty much the Russian characters). As far as characters go, they're the worst part of the movie. They really make this movie sag and lose its feel. Honestly, I think this movie could have used a much better cast. Overall, this is the perfect example of a disaster movie.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "This movie is dumb and funny... that is just funny",
      "total_reactions": 0,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Bueno es tal vez algo pero algo tan impredecible queda como una teoría inconclusa en donde muchas personas se salvaron para reprovarla tal vez falta algo mas de credibilidad en la pelicula",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "(sigh) oh look 2012, its about the world ending. This is like the 200th movie about the end of the world. So I saw the movie and it was really disappointing. Who wants to go to the movies to see a disturbing un joyful movie? I waited for the movie to come out on redbox because the movie looked like sh*t! This movie on the other hand was a waste of millions of dollars for universal and the producers, etc. I wasn't surprised of what i saw. Yes i have to admit it kept you wondering what's going to happen next. But overall not so great film 3.9 out of the 10. A pointless movie...",
      "total_reactions": 0,
      "user": "CriticGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "If you went into this film expecting academy performances and a compelling script, blame yourself.  This is a popcorn film that gives you just what you'd expect, action, thrills, and adventure and campy one liners.",
      "total_reactions": 0,
      "user": "AlexanderLuthor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Oh, dearie, dearie me....I knew there was going to be questionable science, but I thought I would put that aside for a nice couple of hours of fun; I was wrong.",
      "total_reactions": 0,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "The visuals dazzle, the acting is pretty good- but the escapism gets old after about the tenth getaway.  It just starts to get blah.  But the action still entertains and dazzles, but the story just starts to get tired and runs out of ideas.",
      "total_reactions": 0,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "Full of clichés, bad acting and headache inducing cgi.",
      "total_reactions": 0,
      "user": "OpFreeMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "This movie \"2012\" is one of the cruelest I´ve ever seen. It´s unrealistic, the effects and the actors are bad, it´s sad and the plot is extremely poor.",
      "total_reactions": 0,
      "user": "Thuzzwoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "2012 is a great disaster movie, and will keep you entertained the whole time. The CGI and effects in this movie are amazing, and everything that Emmerich shows you on the silver screen is gold.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "A film arise and prosper only expressing a story, an idea or even just a vision...",
      "total_reactions": 0,
      "user": "Corwin86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "In 2012, two things constantly coexist: exquisite special effects, and poor and undeveloped stories that end up enclosing tedious clichés and obvious solutions. Sometimes you forget the flaws and just get overwhelmed by the standouts; sometimes the opposite happens. At the end, you get as lost as the characters in the new world, without knowing how to feel: whether pleased or very disappointed.",
      "total_reactions": 0,
      "user": "jotaeseche"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "I like this. Not the best catastrophic film but good special effects, good acting and the plot is good, too. It's not simple to make a catastrophic film without making it seems stupid or unreal. This is unreal in some moments (first of all the protagonists are too lucky) but i like that they tried to give a sense to the facts that happen.",
      "total_reactions": 0,
      "user": "Jimbei"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "This movie is so painstakingly bad it was almost hurt to watch it. How Roland Emmerich has a job in hollywood is probably one of the best questions anyone could ask after seeing this movie, the plot is boring and almost has no accountability to it, i mean the Chinese making the Arks at the end of the movie was clever but seriously? Arks? John Cusack, Danny Glover, and Woody Harrellson are wasted in this movie by being cast as dull and totally uninteresting characters that show no reasonable amount of chemestry with eachother. The special effects and CGI make this movie watchable and at the very least entertaining but it suffers from a dumb plot, poor direction and half-assed characters.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Ah yes the beautiful director from Independence Day (1996), and The Day After Tomorrow (2004) comes in with a beaiutiful face-slapping and gut wrenching heart of special effects. 2012 is one of my favorite movies of all time and the one of the best disaster films in the book. It wasn't so hard to do, Roland Emmerich is the king of destruction without a doubt. \"2012\" is the literal end of the world where a family struggles to survive as the world everywhere crumbles . Earthquakes, Volcano's , the ultimate tsunami's, land shifting here and there. Its pretty much a crumble and crunching time here and there but the movie isn't just that, its much more.",
      "total_reactions": 0,
      "user": "SyFyMovieGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "2012: 8 out of 10: I love disaster movies. I love “good” disaster movies such as The Towering Inferno and The Poseidon Adventure. I love “bad” disaster movies such as The Swarm and Independence Day. I even enjoy, if not love, “Horrible” disaster movies such as Syfy channel stalwarts Megafault and Magma: Volcanic Disaster.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Great visual effects and interesting storyline couldn't pull 2012 through the disaster that it was , its characters were generic and at times this film was cliché.",
      "total_reactions": 0,
      "user": "zperry-20"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "It feels like the real story of this movie is that \"Humanity can do anything it puts its mind to but there will always be hangers on that drag you down.\" How many people almost drowned because a single family tried to sneak on board that arc at the end? They wouldn't even be in that situation if the doctor didn't have the captain open the doors and let the stragglers in. How many people were already on board the arcs, hundreds of thousands? For the sake of the few people waiting to get on they endangered every single person on board.",
      "total_reactions": 0,
      "user": "JadeRegent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Very good effects especially during the Los Angeles earthquake! The volcano eruption in Wyoming is amazing and very realistic. Roland Emmerich never let's me down!",
      "total_reactions": 0,
      "user": "ricky1121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Una aventura ridícula y aburrida. 2012 solo puede presumir los efectos especiales (no son excelentes, pero cumplen) pero el guion y la trama es tan lenta, nada interesante que lo único sorprendente es que la termines de ver.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Visually breathtaking in every shape and form, indeed, but the film's lack of impact and delivery combined with the lengthy duration doesn't capture the audience attention and fear of extinction.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "They were making a movie about doomsday and not really happened ?, that crap that from 2009 to 2012 turned out good . and after the December 21, 2012 has absolutely nothing happened , and today is 2015 and commented that this movie is crap but the argument ( before real, now fictitious ) is good.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "You know a disaster movie is bad when disasters become a part of the main story. Here, the false-predictable 2012 had its moments before the disasters start striking. After we see the first disaster striking by the shop, that's where you know you have to quit watching it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "The movie was very disappointing. While, the special effects were good, the acting was horrid. John Cusack played a man estranged from his wife, but once again is reunited with her after the disaster, and her new boyfriend is brutally killed. The part in Wyoming was good, but really didn't make sense. HOW THE HECK DID CUSACK MAKE IT OUT OF THAT?!?! After they make it out of Wyoming, we get to see the destroyed Las Vegas, but how are people still here? Then on the plane, we see Honolulu, which is burning due to volcanic eruptions. The film leaves a lot to be desired, populated by forgettable characters, I forgot ALL their names (well, except for the Russian dude, Yuri), the special effects are good, but not the best. This is a solid D-movie, if that is even a thing. I give it a 3/10.",
      "total_reactions": 0,
      "user": "RickyReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "God forgive me, but I enjoyed the nerve-racking silliness of this newest, loudest exercise in destruction. (And God help us all, now more than ever I think cities could crumble and oceans could rise.) Emmerich is, of course, an old hand at bangs, a manipulator who thinks whimpers are for sissies: Aliens tore up the place in Independence Day, an irradiated lizard stomped through Godzilla, global warming ruined everyone’s plans in The Day After Tomorrow, and you don’t want to know all the troubles the prehistoric hero known as D’Leh done seen in 10,000 BC. This time, as the story opens in 2009, the earth’s core is heating up and acting all wonky, alarming an earnest U.S. government geologist (Chiwetel Ejiofor). He rushes to inform the White House chief of staff (Oliver Platt), who rushes to inform the President (Danny Glover), who eventually confides the news? to his tremulous daughter (Thandie Newton). Cut to three years later, and a California Everyman named Jackson Curtis (John Cusack) picks up his cute son and daughter (Liam James and Morgan Lily) at the home of his ex-wife (Amanda Peet) and her new guy (Tom McCarthy). Jackson takes the kids camping at Yellowstone, where he meets a useful mountaintop crazyman (Woody Harrelson) who predicts the end of days.",
      "total_reactions": 0,
      "user": "TheFilmDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "The first half of this movie is very good, then the second half looses it. The ending climax of the movie is just ridiculous. It becomes such a joke that goes on for far too long.",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The notion of playing God is implicit in the job of a film director, and rarely has the sense of a wrathful, vengeful deity at the helm, albeit a pagan one, been so comprehensively felt as in “2012.” For demolition maestro Roland Emmerich, “Independence Day,” “Godzilla” and “The Day After Tomorrow” were mere appetizers for the lip-smacking smorgasbord of global annihilation laid out here.",
      "total_reactions": 0,
      "user": "FilmClub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The notion of playing God is implicit in the job of a film director, and rarely has the sense of a wrathful, vengeful deity at the helm, albeit a pagan one, been so comprehensively felt as in “2012.” For demolition maestro Roland Emmerich, “Independence Day,” “Godzilla” and “The Day After Tomorrow” were mere appetizers for the lip-smacking smorgasbord of global annihilation laid out here.",
      "total_reactions": 0,
      "user": "DoctorFilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "I loved every second of this over the top completely ridiculous movie. But then again I like end of the world flicks.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Deutsche Review - Kritik",
      "total_reactions": 0,
      "user": "KayVen17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "Though filled with dazzling special effects, 2012 stands-out more for its cheesy direction, cliched characters,  lack of heart and humor, and, overall, lack of a story-line or plot.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2016
      },
      "score": 4,
      "text": "But what? I did not understand the part that said that the film is açao or drama, an optimal image with exelente game camera, but lacked WHAT? was the performance of the actors, when it comes to film, it is not to act as if in a movie but reality go to the public, did not see tears of dessespero, not seen drama.",
      "total_reactions": 0,
      "user": "Jumpnion2536"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "Le film-catastrophe hollywoodien dans toute sa \"splendeur\"... des millions (des milliards ?) de gens crèvent mais les cabots survivent. Et les girafes aussi. Toute la planète part à vau-l'eau (c'est le cas de le dire) mais les téléphones portables marchent toujours, d'ailleurs on se passe un coup de fil avant de mourir : \"eh c'est moi, un tsunami de sa race arrive, c'est juste pour faire un petit coucou... beuaaargh...\"",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}