{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "20 Feet from Stardom",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "Yes, for every star there are five more also-rans and maybe-next-times. But there is honor and glory in being part of the blend. And, at the film's midpoint, when Clayton talks about the late-night recording session in 1969 of \"Gimme Shelter,\" the memory takes on the glow of myth."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "20 Feet From Stardom may possibly be the happiest time you’ll have at the movies all summer, but it comes with a heavy load of frustration. The joy...is in the sound of women singing their big, beautiful hearts out. The pain comes from the anonymity they’ve spent their lives working under and fighting against."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "I have rarely seen a movie that better expressed the revivifying nature of music. (Many of the women, not surprisingly, grew up singing gospel in church choirs and had preachers for parents.)"
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 91,
      "summary": "20 Feet From Stardom spends time as well with Claudia Lennear, Táta Vega and Lisa Fischer. None of the three ever found much success as a solo artist, but you probably can't listen to a classic-rock radio station for a half-hour without hearing one of them backing up Joe Cocker, David Bowie, Tina Turner or the Rolling Stones."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 90,
      "summary": "A moving and joyous behind-the-scenes documentary about a world filled with big, bold personalities and the music they make."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 90,
      "summary": "Neville unearths a treasure trove of archival TV, concert and film footage featuring many of these vocalists in their heyday, balancing the material with perfectly-lit contemporary studio interviews and performances shot in pristine digital cinematography, supplemented by more informal scenes depicting the frequent challenges of these musicians' careers."
    },
    {
      "critic": "Dave Hoekstra",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "From front to back stage, 20 Feet From Stardom is a compelling look at the spirit of these giving artists as they navigated the rapid musical and social change of the 1960s, ’70s and ’80s."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "Audiences meet the most memorable voices in the world of backup singers. They perform with world-famous musical acts, but theirs are not household names. Their stories, however, are inspiring, heartbreaking and enthralling."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 88,
      "summary": "Sometimes it's racism; sometimes bum luck; sometimes it's producer Phil Spector putting Love's voice in another singer's mouth. You watch. You hear the gospel spoken in the voices of these women. And you marvel."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 85,
      "summary": "A well-polished production with a remarkable soundtrack."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 83,
      "summary": "Twenty Feet From Stardom touches on fascinating issues, but too often it does no more than that."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "A crowdpleaser that also tells an important story about showbiz, it’s fab. You’ll come out singing."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "A crowd-pleaser, through and through."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "This is one of those moving, tragic and triumphant secret histories of American culture where the biggest surprise is that no one’s told it before."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "20 Feet From Stardom is frequently sad and frustrating. But while there’s heartbreak aplenty, the film doesn’t function as a pitying paean to unmined talent — it’s ultimately a celebration of the unsung."
    },
    {
      "critic": null,
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "This generous, fascinating documentary about the careers of backup singers, most of them African-American women, seeks to rewrite the history of pop music by focusing attention on voices at once marginal and vital."
    },
    {
      "critic": "Ernest Hardy",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "It does what the most powerful films and music have always done, which is to spark contemplation of our own lives and choices, and our place in the world, while also stoking compassion and empathy for lives far removed from our own."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 80,
      "summary": "The sisterhood who have made this an art form mostly remain unsung heroes, as it were, of the hit parade. Their collective bow is long overdue."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "For most of its running time, this personality-packed docu is nothing short of absorbing as it recaps the essential role African-American background singers played in shaping the sound of 20th-century pop music."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "At times, these singers’ versatility has kept them both regularly employed and deliberately anonymous."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s a story of standing out and blending in, sometimes at the same time."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "In a film that’s often sad but not without its triumphs, director Morgan Neville smartly explores the complex role that ego and self-promotion play in this profession."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s still a welcome, entertaining and overdue delivery of credit where credit was and is due."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 75,
      "summary": "This joyous documentary leaves us wanting to immediately seek out the incredible, sometimes unfamiliar music we've just heard."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 70,
      "summary": "You gasp at the ecstatic convergence of lung power and spirit."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This fascinating documentary focuses on the singing careers of 4 or 5 fabulous African American backup singers.  Most of them started in the 1960s and were backup singers on some of the most famous records of all time.  In a couple of instances, they even sang the lead on some hits but the credit was given to other singers who did not sing on the record at all.  These women are legendary within the music industry and certainly have the talent to be stars, but why haven't they?  The documentary tries to answer this question by interviewing big named stars that have used these ladies on their own records over the years.  The film features a lot of great music, and it makes you think about how many extremely talented people there are in the music industry and yet never become stars, and yet many of the pop stars of today can't sing at all and have to lip sync when they perform.  Highly recommended.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "This doc looks at the women who sing backup for rock and soul acts. There are profiles of some of the greats (Darlene Love, Merry Clayton, Lisa Fischer) and interviews with lots of women who've joined them. A few rock stars (Springsteen, Jagger, Sting) offer their comments. It's fascinating to learn about the history and influence of these amazing vocalists. It's fun to hear them riff effortlessly and reminisce about the past. When the focus turns to their failed attempts at moving to the front of the stage, the energy turns dark and drags on too long. Still, it's remarkable to get the chance to appreciate what these amazing women can do.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "A fascinating documentary focussing on a group of backing singers who were ubiquitous in the 60's and 70's on some of the biggest tracks of all times. An interesting look at why these powerhouse singers were always in the background and never made it big in their own right it could have been improved by widening its scope somewhat.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Another music industry-related feature-length documentary Oscar winner, after last years’ SEARCHING FOR SUGAR MAN (2012, 7/10), 20 FEET FROM STARDOM homes in on back singers, from the esteemed Darlene Love, a recent Rock-N-Roll Hall of Fame recipient; Lisa Fischer, the diva of the line of work, a Grammy winner for her only studio album in 1992; to lesser known veterans like Merry Clayton, Táta Vega, Claudia Lennear, The Waters, till up-and-coming young blood, spearheaded by Judith Hill who is still striving for her breakthrough as a solo artist, a THE VOICE contender last year, her debut album is in the offing.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "This Oscar winning documentary is both engrossing and fun highlighting as it does the careers and importance of some of the most famous backing singers in the business. Interviews with the likes of Bette Midler, Mick Jagger and Bruce Springsteen are full of praise for what the likes of Darlene Love, Tata Vega and Lisa Fischer (amongst others) have contributed to the major bands and pop stars over the years. These afore mentioned backing artists, and others, share with us their frustrations, disappointments and the love for what they do. And let's not forget their talent. In many instances they are vocally superior to many of the lead entertainers that they support. However, as Sting so concisely puts it, 'It's not always about the talent'. Circumstances, opportunity and a little bit of luck can play an enormously important part in the transition from background to foreground to star!",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I am not that aware of the artists from the old days, but I recognize them by some of hit tracks I know. Since I don't know much about the musics of before 80s, I just enjoyed the stories they told in this documentary. This movie is about the back-up singers and their's life with achievements and struggles.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "I didn't see 20 FEET FROM STARDOM in the theater because I thought it would be just a lame VH-1 type doc. And guess what, it is! I finally saw it because it has such Oscar buzz. It's a pretty lame unfocused mess. Nice to see so many talented \"background\" singers but the film can't contain itself when it comes to fame and the big time. So lame. These women deserve to be celebrated for what they brought to music. The film does but then it veers all over the place. Just a big nothing.",
      "total_reactions": 0,
      "user": "LowbrowCinema"
    }
  ]
}