{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 113,
  "mc_movie_name": "21 Jump Street",
  "mc_negative_rating_frequency": 37,
  "mc_positive_rating_frequency": 775,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 91,
      "summary": "Underneath, 21 Jump Street is a riot of risks that pay off, the biggest of which might be handing Tatum funny business."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 90,
      "summary": "Jonah Hill is masterful at delivering an absurd story with so much sweetness, the nonsense ceases to get in the way."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "The funniest movie I've seen in more than a year."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "We have lots of terminology for what happens when two male stars appear to have the platonic hots for each other. The genre is called bromance. The feelings are bromantic. The orientation is bromosexuality. What Jonah Hill and Channing Tatum have in 21 Jump Street scrambles, transcends, and explodes all of that."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "This is the rare breed of Hollywood studio production that has the brash spirit of an independent picture and the sharp wit of a stand-up comic."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 83,
      "summary": "This movie embraces everything that should make it lousy, calling out itself for aping the source's bad ideas then flipping the script with meta precision."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "In its outrageous way, 21 Jump Street has real laughs."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "Miller and Lord clearly understand the push-and-pull and hyper-competitiveness that make guy friendships both complex and stupid. That it comes to life so fully in 21 Jump Street is what gives the film an endearing, punch-you-in-the-arm-because-I-like-you-man charm."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "Without a doubt, stupid, but it's willfully stupid, built in the comic style of \"The Hangover\" and \"Due Date.\" Better yet, it also is genuinely funny, which is the point."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "21 Jump Street has that \"Anchorman\" experimental-chaos vibe, with all the hit-and-miss moments that implies. It's completely lunatic and sort of a mess. It's also the funniest high-school comedy to come out of Hollywood in ages."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "Not since Will Ferrell and Mark Wahlberg teamed up in \"The Other Guys\" has an onscreen pairing proved as comically rewarding as the inspired partnership of Jonah Hill and Channing Tatum."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "This film is even better if you come in with no spoilers and low expectations."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "He's not in Mark Wahlberg's league, and 21 Jump Street isn't quite as funny as \"The Other Guys,\" but by lampooning himself here, Tatum has bought himself a grace period to grow in."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "The dialogue is fast-paced and full of pop-culture references. It all makes for an entertaining blend of buddy-cop action and irreverent teen-comedy satire."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Like Marilyn Monroe and Judy Holliday before him, Tatum is sublime at playing dumb (as a dim pretty boy, he seems to be channeling Brad Pitt in \"Burn After Reading\"), just as Hill shrewdly deploys his body mass for maximum physical comedy (even slimmed down, with an Oscar nomination under that tightened belt, he carries himself with a fat man's comically elephantine grace)."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Are we always still in high school in our heads? 21 Jump Street thinks so. And Hill and Tatum are just the crazy-ass comedy team to prove it."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Whatever you call 21 Jump Street, this potty-mouthed and drug-laced reimagining of the 1980s TV show has one of the highest laughs-per-minute ratios since the \"Naked Gun\" films."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "The drug humor in 21 Jump Street carries its own distinction, in that it's actually humor."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "The movie has entertaining cameos, too, especially one by Holly Robinson Peete. At 23, she played Officer Judy Hoffs on the TV show. At 48, she plays … Officer Judy Hoffs, the oldest undercover cop on Jump Street. Absurd? Of course. But pretty funny, too."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "One of the pleasures of 21 Jump Street is that the screenplay by Michael Bacall and Jonah Hill is happy to point out all of its improbabilities; the premise is preposterous to begin with, and they run with that."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Like many almost-great comedies, 21 Jump Street is frontloaded with the best go-for-broke gags and lines."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "The devil-may-care attitude is what makes 21 Jump Street so entertaining."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "21 Jump Street isn't a wild, fresh reinvention of the movie-cliché-spoofing genre - this isn't \"Airplane!\" we're talking about - but it's also not a drearily overfamiliar retread of it."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "It wants to be fun and, to a perhaps surprising extent, it is. Largely forsaking the sweet multiculturalism of the original for white-dude bromance, and completely abandoning earnest teenagers-in-crisis melodrama in favor of crude, aggressive comedy, this 21 Jump Street is an example of how formula-driven entertainment can succeed."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "The project loses traction toward the end, as the picture strains to become a full-blooded action film - the very thing it spends the rest of its time mocking. And yet 21 Jump Street earns my genial nod because of its limber, 120-IQ take on the whole notion of movie revivals."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "For now, 21 Jump Street is a small puff of fresh air simply because it's not, like umpteen other releases coming down the pike, based on a comic-book series."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "Directors Phil Lord and Chris Miller get nearly everything -- the tone, the self-referential nods to the shoe and the dead-solid-perfect surprises -- just right."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "It has a bad, slapstick first act but by midpoint becomes strangely compelling, tapping into the fantasy of reliving one's high-school years (which did a number on us all) and getting it right."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "By casting Jonah Hill and Channing Tatum as fish-out-of-water buffoons, the irreverent result feels fresher than most '80s-show reboots, effectively flipping the address Johnny Depp made famous."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 67,
      "summary": "It's a deeply uneven film that can't decide if it's a satire, a joke, a thriller or a heartstring-tugger, and in dithering in its tone and its aims it ultimately turns out to be none of the above."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 67,
      "summary": "It's more consistently amusing and inspired than an adaptation of an '80s TV show has any right to be."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "Some of the funniest scenes belong to Ice Cube's \"angry black captain\" who goes on profane rants that would make Samuel L. Jackson proud."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "With Hill on co-scripting duties with Scott Pilgrim scribe Michael Bacall, 21 Jump Street was always going to live or die by its gags. Fortunately, it boasts that sweet-yet-dirty comedy that Hill revels in."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "This cheerfully chaotic, gleefully vulgar action-comedy retread of the old television series has box-office success written all over it, and where's the harm? It's irresistibly funny until it isn't."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Through it all, Tatum and Hill are totally winning."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "The longer this \"Abbott and Costello's Lethal Weapon\" goes on, the more the fun dissipates - until a queasily violent climax, which, naturally, fully embraces genre stereotypes rather than dismantling them."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Though these mismatched cops bounce well off each other, Tatum, in his first comedic lead role, is the better performer, both more riotous and affecting."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Directors Phil Lord and Chris Miller (Cloudy With a Chance of Meatballs) seem to be after the gentle irreverence of David Gordon Green's buddy flick \"Pineapple Express,\" but without his sensitivity and attention to character the movie quickly grows monotonous."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Look for a cameo by a movie star whose initials are J.D."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "A try-anything, fitfully amusing muddle that wears its mocking cynicism a bit too proudly."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Not that anyone was asking for a reboot of the series that is perhaps best remembered as the launching pad for Johnny Depp's career, but here it comes anyway. The film will probably gain several points on the likability scale for its sheer unexpectedness and modest ambitions."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 7,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Loved it. Ridiculous and over the top, silly fun.  Channing and Jonah are a surprisingly entertaining comedic team.  A bit heavy on the profanity and a couple of senseless gross out scenes but worth a trip to the movie theatre for this one.  Audience during my midnight screening laughed throughout the movie.",
      "total_reactions": 23,
      "user": "LISTEN2ME"
    },
    {
      "neg_reactions": 30,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Walking out on a movie is a rarity for me, but I left within about 30 minutes of the start of this one. I thought it was both abysmal and juvenile, though I admit that my age (72) probably made the latter reaction inevitable. I found the relentless shower of gratuitous obscenities both grating and wearisome, and lest someone cite my age as a reason, I was in the Navy for 20 years and am intimately familiar with every obscene word ever coined. But here the effect is just plain boring. It's as if the writers were trying to meet a quota for Carlinesque words. Finally, I am baffled by the number of sterling reviews of this dog, but I guess I must finally be outside what passes for humor in mainstream comedic cinema.",
      "total_reactions": 45,
      "user": "nautico"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "My honest opinion was that the film is generically funny at times, but overall to raunchy for my tastes. I support vulgar comedy but when used poorly, it sounds like somebody constantly talking out of their ass. The juxtaposition of Hill and Tatum is its only saving grace, and Ice Cube. Otherwise I could have been off well without this movie made.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Wasn't impressed.",
      "total_reactions": 1,
      "user": "Jacobron"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is really awesome, it's difficult to me to laugh watching a movie, but this movie, can do it ... And I'm very surprised, and I loved it... WATCH.. You're going to laugh since the start, until the end of the movie..",
      "total_reactions": 4,
      "user": "Nicholasandrew"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "21 Jump Street goes for a lot of laughs, and most of the gags hit their mark.  The film satisfies as wish fulfillment; the chance to go to high school and gain acceptance from the in-crowd, and pass all the hard classes to feel smart.   There's also an element of schadenfreude watching the once-popular Jenko--who was a jerk to Schmidt--get his comeuppance as he lives as a social outcast, while Schmidt gets much of the glory in their detective work.    Where 21 Jump Street stumbles is in its storytelling.  A subplot about Jenko's flirty chemistry teacher doesn't pay off because it gets dropped midway through (the conclusion, and footage during the end credits suggest there's more to it).  It should also be mentioned that the action sequences aren't exciting, and a fight scene is shot too close in that blasted Shaky-Cam that's making its rounds as of late.  However, such considerations are in some ways moot.  21 Jump Street is a class clown of a movie, just trying to get a laugh.  Full review on my blog.",
      "total_reactions": 9,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "Couldn't even finish watching this over hyped crap. Ice Cube in his role is not believable and just because Jonah was funny in a few movies, he doesn't translate in this one. Cliches abound, absent of originality and literally no parallels to the original 21 Jump Street-which was the reason I wanted to see this in the first place.",
      "total_reactions": 6,
      "user": "geedup"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "I really didn't see much in 21 Jump Street from the ads so I didn't go see it in theaters. Even when family rented it from redbox I still wasn't interested in watching it. It took my girlfriend to ask me to watch it with her  and to pick it up to get it because her sister told her it was hilarious. Well we watched through it and I can say my thoughts on it were to be true that it was just another comedy to be released for the summer.",
      "total_reactions": 3,
      "user": "BIGWHIT425"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I must say, I was skeptical at first, but now .. wow. I'm in love. Truly amazing. Just so very heart warming, especially the friendship between the two. I mean such a funny, lovely, sweet and action packed film. The very point of it all, the reason why I liked this movie as much as I did is that it's not your every day movie. It contains parts and aspects that you can't see ahead. Really different and interesting. I suggest you find time and see this unbelievable movie. Hope you like it.",
      "total_reactions": 15,
      "user": "WhySoScared"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "As witty as it is funny, 21 Jump Street manages to fire on all cylinders throughout.  Satisfying comedy fans and action fans, this film transcends genres very well.  A well crafted story as well as a cast that rivals any movie in Hollywood, and you have a winning combination.  Besides the beginning sequence, the movie is well paced and allows you to follow every joke and punchline without any trouble.  The comedy is clever and the acting is handled extremely well.  This is a rare movie that had me laughing all the way through and one that I wouldn't mind seeing again in theaters.  I recommend it to anybody that wants a laugh and is looking for a good movie to see with your significant other or friends.  Classic comedy that will be referenced for years to come!",
      "total_reactions": 10,
      "user": "Billyheel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "Id give this movie a score of 4 out of 10, but becasuse some people gave it 10 out of 10 (up there with Shindlers List, Saving Private Ryan, Star Wars, Jaws, Psycho, The Shining, Lord Of The Rings etc) im going to score it 1 out of 10. Obviously it must be a life changing moronic movie for morons.",
      "total_reactions": 5,
      "user": "chazwozzer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Really bad movie I was really disappointed since I loved the original series, the y put too much comedy and it was really not that funny. It seems that Is really hard to make a great movie from a hit tv series, I think this series are best leave in the past, because you expect a lot from a movie based on a really good TV series and for me it was a really bad copy from the original series....",
      "total_reactions": 5,
      "user": "seni09"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 1,
      "text": "Wow! This movie was pretty bad.... it did contain some funny parts but not a lot. The cute one/the tall one did a GREAT job on acting, but everything else stunk!",
      "total_reactions": 5,
      "user": "April717"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "Maybe im just too mature, or maybe just need to lower my standars when going to the movies, because this film did not make me laguh one bit. Like it was ok but in this day and age i just need to give up the fact that Hollywood is never going to produce a memorable comedy, or movie for tht matter. Too each their own I GUESS.",
      "total_reactions": 13,
      "user": "Jbrizzy"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Awful. We walked out after 45 minutes - That's how long we gave it the benefit of the doubt. What a waste of time and money. Jonah Hill is funnier than that (not to call 21 Jump Street funny at all), and Channing Tatum is....I dunno, a beefcake or whatever. What the **** is with all the green (critic AND user)? Don't tell me this passes for funny. For me it passed for Are We There Yet? It even had Ice Cube! Ice Cube is a thespian of the highest caliber and should be showered with statues. There, I said it.",
      "total_reactions": 16,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Comedy classic for me.  Everything works.  I was surprised at how funny ice cube and channing were.  Didnt think they could handle comedy that good, but they both pulled it off with flying colors.  This is non-stop laughter from beginning to end.  In the same vein as 40year old virgin, pinapple express raunchy comedies.",
      "total_reactions": 10,
      "user": "rahstar2003"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Yow! What a piece of junk!  Why on earth was this movie made?  21 Jump Street wallows in so many movie cliches that I had to look at the walls of the movie theater to keep from being embarrassed at times.  Absolutely nothing new or clever about it.  One of those flicks that you know the endings of each scenario during the first line of their development.  Like a bad teen film.  Gave it a one for a chuckle or two.  I really just want to slap whoever greenlit this stinkbomb.",
      "total_reactions": 8,
      "user": "Scraper"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "I hate R rated debauchery  with no redeeming value. So why did I go see this, because every once in a while a movie like 40 Year Old Virgin or The Hangover come along that make you thing good comedy can come form this genre. 21 Jump Street is not that movie. Stay away.",
      "total_reactions": 4,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "Insipid. Mind-numbingly boring. This movie isn't anything like the great little TV series that some of us grew up with. The people rating this a 10 are probably doing bath salts.",
      "total_reactions": 4,
      "user": "Eyse"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Please make a plan with your friends to go see this movie. Your friends and you will spend watching this great movie! Is great! Not only because of the funny moments, but it is original and fun!",
      "total_reactions": 4,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "The guys in the movie are not funny, are only really stupid !!! So, all these make the movie a stupid movie.",
      "total_reactions": 4,
      "user": "cilincescu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "I was very disappointed by this movie. It has some funny parts, but nothing hysterical. I always give movies their full length to impress me, but this just got worse and worse and worse and worse. The characters are very unrealistic and the story even more. I do not recommend this to anyone. Why this movie received four-stars I will never understand. Again, don't waste your time on the ridiculously, dull, predictable movie.",
      "total_reactions": 4,
      "user": "WillDefrangesco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Not a complete waste of downtime, but you don't have to look hard to find funnier stuff on television.  I think they said it all early in the film when Captain Ice Cube tells everybody to \"Embrace their stereotypes\".  Once you accept that as the measure of the film's wisdom then you can pretty much coast through the rest of it with the appropriate level of expectation.  If you're bored and don't feel like focusing too hard, you can watch this while surfing the web and not miss a single plot point or laugh.",
      "total_reactions": 2,
      "user": "skantea"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "From a teen perspective who i'm sure the film is targeted towards i found this film both entertaining and hilarious. I deem it the perfect 'friends night in' film, if your friends, like mine, enjoy a mix of  'laugh out loud' humour and an interesting, at times immature (but still very real) narrative. I don't like seeing that both users and critics have slated this film. This film never claims to try to be a serious film in the slightest so don't take it as one. Whilst the film doesn't offer seriousness, it offers great humour, good story line and good acting. Go watch it.",
      "total_reactions": 2,
      "user": "JackKelly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "\"21 Jump Street\" is amazing, hilarious and clever, it has action sequences, laugh out loud parts, with a great cast and an original story, this movie is just so great.",
      "total_reactions": 2,
      "user": "AReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "As I sat in the theatre with the popcorn to my left and a Mountain Dew to my right, I couldn’t help but be mesmerized by a comedy that should be named movie of the year. 21 Jump Street, starring Jonah Hill and Channing Tatum, is a flick that can be enjoyed by adult viewers everywhere. With random jokes, and a well-picked cast, directors Chris Miller and Phil Lord have built up an idea that could be made into a hit sequel sometime in the next few years.",
      "total_reactions": 2,
      "user": "JPort"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Great movie, if you liked Superbad, you will most likely love this movie just as much. You can tell they put alot of research into it and inside jokes about Hollywood are hilarious!",
      "total_reactions": 11,
      "user": "Heaviermetal"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "I must admit that I am baffled by the high marks the users of this website are giving this movie. Has everyone had a drink of the Kool-Aid except for me?  This wasn't the worst film I've seen, but it ranks pretty high on my list!  The script is a mess.  It felt as if they allowed a group of very immature 13-year-old boys write an R-rated script.  The terrible and witless dialog was laced with gratuitous obscenities that were so awkward and painful to listen to that I could hear my heart groaning and moaning.  If it weren't for the friends I was with I would've left long before the end of this movie.  If the theater had a dental office I would have chosen to have root canal rather than sit through another minute of this bile!  What happened to the \"character development\"?   What happened to continuity?  The filmmaker couldn't decide what kind of movie he wanted to make...was this a drama with bits of comedy?   Was this a slapstick comedy with \"heart\"?   Was this a cartoon?  They wanted to capture the essence of \"Kick-Ass\" but missed completely!",
      "total_reactions": 18,
      "user": "CincinnatiDave"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "21 Jump Street: Awful pacing, unfunny dialog, clichÃ©-ridden film that fails to stand out with anything original.",
      "total_reactions": 9,
      "user": "nascent"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Loved it too as I laughed out loud.  If you are looking for a fun popcorn movie this is it.  Everyone did an outstanding job.  Just don't take it too seriously and you will have lots of fun.",
      "total_reactions": 7,
      "user": "fantasy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was an all out romp! The best movie Jonah has done since Superbad, and it was surprising to say that after this movie, Channing is on my comedy movie radar! The movie is **** hilarious and takes a surprisingly violent twist at the end! Amazing!",
      "total_reactions": 7,
      "user": "Deadsarow"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Honestly, I think 21 Jump Street is the first really must see movie of the year. There have been some other good movies so far this year (Chronicle, The Lorax, Jeff Who Lives at Home) but this is the first great movie. I didn't expect too much from this film, which is usually a great indicator for a potentially great movie. It's a great blend of action, comedy and a decent story. Obviously with guys like Jonah Hill and Channing Tatum starring, you'll be getting a bit more comedy than action, and really that works out just fine. Of course, the humor isn't for everyone, obviously some people don't have a funny bone in their body and will find this movie to be \"childish\" and \"immature\" but really, it's exactly the kind of movie needed.",
      "total_reactions": 7,
      "user": "L4DLegend91"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was a winner. The movie 'Super Bad' was a surprisingly funny flick and if you enjoy that genre then you will really enjoy this lighthearted humor.  After dealing with stress at work all week this movie really worked for me. Casting was very strong and the timing was spot on!",
      "total_reactions": 7,
      "user": "Moviepix"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Maybe it was my fault for being a boring person, but this didn't make me laugh once in the entire movie. Jonah was ok, but Channing, stick to drama please.",
      "total_reactions": 15,
      "user": "dudu_95"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Thanks to this movie, I now believe that there is confidence to be had in the movies of 2012. The laugh-out-loud action comedy \"21 Jump Street\" is the best film I have seen since \"The Girl with the Dragon Tattoo.\" The raunchy humor, the \"bromance\" of the two leads, the co-stars/cameos, I laughed throughout the entire film. Another thing I would like to point out is that it shows how much the youth has changed in the past 10 years and how that works out great for the film. Go see this movie in theaters now, or buy it on DVD. This is a must watch film",
      "total_reactions": 5,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "First and foremost I came into this movie kind of biased. I borderline hate Channing Tatum, although I very much like Jonah Hill and I have never seen one episode of the original show. Some may argune that bromance comedies are happening too frequently now but I think as long as it is entertaining who cares? I liked the dynamic between the two and also some of the Easter eggs for fans of the series was nice as well. Definitely a movie worth seeing, though I don't see myself ever really wanting to see it more than once.",
      "total_reactions": 5,
      "user": "Oblivion"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "One of the greatest comedies I've seen in a while. Great acting by Jonah and Channing, great supporting cast (Ice Cube, Johnny Depp, etc.), and very true to the TV show. Well done.",
      "total_reactions": 5,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "It's a movie with some fun parts but i wouldn't encourage anyone to watch it. This movie would be good for younger age groups but older people like 20+ with a good taste for movies it wouldn't be a a good movie to watch and would rather be a waste of time.",
      "total_reactions": 13,
      "user": "deamonhunter"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Perhaps too sketchy, and even more satirical, \"21 Jump Street\" is a bro-comedy that, despite its leads' efforts, loiters in its own mocking pool; it soaks up some pop-culture residual, expells it with self-mimickry, and simpers back at the audience for having taken a swim in it. Though Hill and Tatum offer moments of begetting 80's nostalgia, as well as a vaguely remembered muck of a TV-show--laden with car chases, well-worn high school scenarios (awkward proms, dopey faculty and staff, etc.) and predictable, slipshod dialogue and one-liners--the film resorts to much of the same, though out of parody, and its blatant, self-fulfilling, mocking cynicism becomes increasingly intolerant as it progresses. Moreover, the subject inevitably ends with recycled debris left over from, where else, the the \"80's.\" Directed by Phil Lord and Chris Miller (the animated \"Cloudy With a Chance of Meatballs\"), \"21 Jump Street,\" is not all foolheaded bufoonery. A slimmer Hill (playing Schmidt) is funny as ever, reprising his usual rambling, neurotically-charged, verbose self, sticking to his \"Superbad\" character. Though, even more entertaining, not to mention surprising, is Tatum, who, unlike his usual unsupply, numb and ligneous expression and acting ability (\"Step-Up,\" \"Fighting,\" \"G.I.Joe: Rise of the Cobra,\" \"Dear John,\" \"The Vow,\" etc.) he feels loose and unrestrained, and even comfortable as his character, Jenko. Towards the end, though, the film ultimately looses any effect it initially had to reel viewers in with, especially during the police training sequences, and, with the interpolation of all too-familiar, genre-specific penile and homosexual references, as well as a 8-10 minute preview of \"Project X,\" featuring a chaotic teen party, thanks to screenwriter Michael Baccall (who also worked on 'X'), and a hackneyed prom night-meets-gun-fight close, \"21 Jump Street\" is the raunchy, filth-filled refuse that many, if not all of the Youtube-generation and reality-TV aficionados alike, will be applauding and praising for months to come. Then, one day once the dust has settled, and the diapers have been changed, will be relived again, only this time on 'F-X' reruns and 'TBS' \"Dinner-and-a-Movies.\" It's funny, just not, \"that\" funny. Call me when grown men flirting with under-age high school adolescents is hilarious...wait....this world is getting there.",
      "total_reactions": 6,
      "user": "FDT44"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Very funny movie, would watch it again in a heartbeat, I took my mom and dad out to the show and they laughed Real hard. Must see movie.  Very good twists and character development.  Go see this flick.",
      "total_reactions": 6,
      "user": "TheAwesomer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I went into this not expecting too much. A remake of an 80s series that isn't very well in todays world. I was shocked to find a gem of a movie. It's neo-humor about it being a remake and performances that really deliver much needed heart to the movie, will leave you happy with the finished product. Yes, it is not Shakespeare, but what you get is a fun 90-minute action-comedy in the vein of Rush Hour or Pineapple Express. Well worth a viewing. I am sure there was a lot of unused footage, that I look forward to viewing on an extended blu-ray release. Highly recommended.",
      "total_reactions": 6,
      "user": "TruAlbino"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "very funny movie. if you have watched the trailers it may seem like a stupid comedy that put its best material into a commercial, but this time it didn't. Can be even funnier to stoners/kids in school. i still loved this movie 10/10.",
      "total_reactions": 6,
      "user": "thedirtywizard"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "So funny! I loved this! it wasn't one of those movies where the trailer was only funny. But this movie was hilarious the entire way through. it was stupid humour and I loved it!",
      "total_reactions": 6,
      "user": "orchid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "\"They hate me.\" In the director's cut of Almost Famous, we find out how much. On a high school marquee, in black caps, the message of the day reads: \"William Miller is too young to drive or f***.\" The other students are pitiless toward the victim of this practical joke, but William manages a brief smile as he traverses the parking lot, alone, armed with a copy of Creem. Music makes him strong. During class, we see the boy's shrine, a blue portfolio covered with the names of his heroes in a graffiti-esque collage created with Bic ink. It's a work in progress, as we glimpse the starry-eyed child putting the final touches on the \"n\". William may love Led Zeppelin, but he's smart enough not to emulate Robert Plant. His hair is decidedly un-golden god-like. Over the hills and far away, in another high school, another generation, Schmidt, with his close-cropped bleached do, and bling, cultivates, none too successfully, the Eminem look. By embodying the machismo of the rapper, Schmidt works up the courage to approach a girl about the upcoming prom. Before the official invite is issued, though, the hottie stops him. That's because Schmidt is not Slim Shady; he's a nerd, and not even slim. Five years later, when the rookie cop and his buff partner go undercover as students, Schmidt's eventual transformation into a popular kid, retroactively, casts Fast Times at Ridgemont High as a sort of sequel to Almost Famous, because when Cameron Crowe returned to school as an investigative journalist, he was fully-formed, no longer the naive hero, the alter-ego of his bildungsroman, but actually somebody who was cool enough to infiltrate the cliques that mattered, after years of covering bands that mattered. In the Amy Heckerling film, Crowe doesn't have a stand-in; he's the omniscient student who knows Linda, the queen bee, well enough, apparently, to learn about her best friend Stacy, who ends up at an abortion clinic after a series of flings. Crowe's fictional self, while no longer a stranger to sex, due to the adult education he receives from the \"Band-Aids\" during a stopover in Greenville as a RS correspondent covering Stillwater, the then-screenwriter, despite being privy to an up close and personal look at the debauched lives of the rich and famous, nevertheless, still must have flinched like the rest of us, as Linda and Stacey talked graphically about sex in the cafeteria. Being 23, the scribe could only fantasize about Linda(like Brad), who in the film, emerges from the pool in a red bikini. Whose dream was that really? Because Crowe is unseen, the ethos of the film never gets addressed, like it does in 21 Jump Street, when Sgt. Dickson warns the cops about being chaste while on assignment, faintly echoing the advice given by Lester Bangs to his protege. When bridging the two films together(Almost Famous & Fast Times...), it's easy to imagine Crowe refashioning his mentor's words into something along the lines of \"don't make friends with the high school girls.\" \"Doug\", the track star and theater brat, keeps a professional distance, but barely, when he comes perilously close to kissing Molly, at the moment that their prom plans get verified. She is Wendy to his Peter Pan, akin to Crowe and Ann Wilson(of Heart). As a point of reference, Schmidt fulfills his Eminem dreams of yesteryear by singing \"I've Gotta CROW\", rhyming like Mary Martin circa 1955. The \"real Slim Shady\" stands up. He's a romantic. The film's greatest irony is that Doug becomes popular by being himself, not a gangsta, even though 21 Jump Street pays homage to Donnie Brasco, none more cleverly than when the cop calls Molly on the phone, and nearly blows his cover. Whereas Joe Pistone learns that a wise guy never carries a wallet, Doug, in so many words, is told to text-message like any savvy teenager living in the digital age. Lefty Ruggiero represents the FBI agent, giving \"Donnie\" the credibility he needs to pervade the inner sanctum of a mafia crew. To his chagrin, Joe becomes Sonny Black's right-hand man. Similarly, Eric, a drug dealer, takes a shine to Doug(angering \"Brad\"), and introduces him to his supplier. Both men, in the process, lose themselves in the subculture, crossing the line from observer to participant, in which they find their humanity and attudinization melding into one. For the cop, this embarkation begins at a house party, where he gets stabbed during a melee between rival high school drug factions. The experience imprints him. In that instant, he becomes a stud. Likewise, Joe's metamorphosis into Donnie is inaugurated at a Japanese restaurant, where a waiter nearly gets pummeled to death in the bathroom, after the niceties of culture nearly blows his cover. Later, a lesson in mass vivisection pushes Joe to the brink. In Schmidt's case, it's a college application he plans on filling out. For Crowe, it could have been the moment that Linda sticks the carrot in her mouth.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Amazing movie . It so funny and the story was really really great . Jonah & Channing duo was so perfect . The were funny and awesome . The story was good , so was the direction . The movie started amazingly and went through superbly . Only the last  Limousine was too much . It would be more good it the last scene would take place at the prom floor . Except for the the whole film was maybe the funniest movie of  2012 so far !",
      "total_reactions": 3,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "I was going into this move just thinking it was something to watch. But WOW this movie is hysterical. I couldn't stop laughing the entire movie. Not only is Jonah Hill as funny as I thought he would be but Channing Tatum put up some really funny moments. Not only is this a must see its a must Buy. You will not be disappointed with this movie. NOT for young kids.",
      "total_reactions": 3,
      "user": "Veritas34"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Really funny movie with some outrageous moments. Two opposite characters and actors worked quite well together. It is nothing serious. It is just a silly movie that leaves you with a lot of laughs.",
      "total_reactions": 3,
      "user": "Trev29"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Why is the movie good? Because it doesn't take itself seriously. People who took it seriously, like nautico the hard marine, have no sense of humor.  Anyway, I give this movie a 6, and nautico a 10 out of 10 in \"boring\".",
      "total_reactions": 3,
      "user": "jim109109"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "I actually wanted to see 22 Jump Street but after reading it was a sequel I went and watched this instead. It was a complete waste of my time, humor is immature and pathetic and acting is bad. At least I know not to waste my time on the sequel.",
      "total_reactions": 3,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This is definitely one of those movies where the trailer looks awful and then the movie totally redeems itself when you see it. Jonah Hill has never been funnier although Channing Tatum is even better than him. He's hilarious in this. It's got so many cliches in it, but that doesn't matter because the jokes are still pretty original even though some of the situations may seem familiar. If you are 30+ you probably won't find it as funny, but there are still a lot of good jokes in it for everyone. I'm sure everyone who has seen the movie has one scene in mind that everyone in the theatre was dying from laughter. I won't give it away, but you'll know it when you see it. I haven't laughed so hard in a while. Heck of a flick",
      "total_reactions": 8,
      "user": "Indiekid39"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I haven't laughed this hard at a movie in a long time. A very funny, and very entertaining movie.  Sort of turned into an action movie at the end, but was still funny as it went along. See it in theatres if possible",
      "total_reactions": 4,
      "user": "vern"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was great for me because it took risks in many ways, and most comedies haven't been doing that lately, or doing it too much. 21 Jump Street did it perfectly. It did the classic tv show justice, but is certainly different. The plot was decent, the comedy was awesome, and little things kept people on their toes. Also, I would like to point out a great performance by James Franco's brother. I personally have no qualms with this film and plan on buying it soon. A must have for comedy fans.",
      "total_reactions": 4,
      "user": "Dufflad"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Irrelevant and cheesy at times, the uproarious jokes in 21 Jump Street makes it so you don't even care about the unoriginal plot lines. Reminiscent of Superbad, 21 Jump Street will have you laughing throughout the movie as Jonah Hill and Channing Tatum deliver comedic performances beyond what I thought they were capable of. With the mix of Ice Cube, Johnny Depp cameo, and a very witty script, 21 Jump Street turns into a hilarious comedy not seen since Bridesmaids.",
      "total_reactions": 4,
      "user": "racketracer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "First things first, this may be hard to believe but Channing Tatum is actually genuinely good in this film. He shows an adeptness for comedy that many would not expect. Perhaps his performance is in part due to his role, as the dumb jock of the pair, being naturally made for him. On the flip side, Jonah Hill plays the intelligent nerd of the pair, again a natural persona, and also delivers a strong script consistently packed with gags. Although the film treads the familiar path of 80's buddy movies with a plot reminiscent of Bad Boys, it does so with a strong sense of self-parody mixed in to the hilarious gross-out humour. At no point is this clearer than when the police chief revives the defunct undercover programme and comments that nobody has any original ideas anymore so all that is left to do is lazily repeat previous work, a fun poke at the films 80's TV series origin of the same name and similar plot. The films final third drags on slightly, with a few drawn out action sequences displacing the fun for marginally too long but all things considered 21 Jump Street is a good value laugh out loud comedy. In one line, Superbad meets Bad Boys.",
      "total_reactions": 4,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "The high rating is really disappointing. I have a fairly versatile sense of humor...I thought Superbad was funny mostly etc. and some of the newer things to come out...but this movie was just...not that funny imho. Considering the shape our country is in along with all the idiots who support a spineless gutless person in the WH...it's not a shock to see that a \"comedy\" like this is deemed actually funny to some. All the low IQ folks who thinks stupidity and non funny occurances will enjoy it.",
      "total_reactions": 10,
      "user": "wardad71"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "It was an ok movie it had a few funny points but not  a lot. The plot was ridiculous, and the movies was filled with stupid cliches that weren't even funny. Do not recommend.",
      "total_reactions": 10,
      "user": "pepsens"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Hill and Tatum have excellent chemistry - would love to see them in a Lethal-Weapon-like sequel. And the teachers, Ice Cube, and Hill's love interest are all funny as hell.  The self-aware jokes and humility in the script give it an endearing sweetness. It just seemed like the action sequences toward the middle and end of the film ran long - I found myself getting a hair bored at times.  If they trimmed maybe 15 minutes of the fat, it would have been stronger.  And lest I forget, little brother Franco has a real future in the biz.",
      "total_reactions": 5,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I just wish they had tone down the profanity a tad bit, sometimes it kills the flow of the movie, simply because it gets overwhelmingly vulgar, this film was obviously catered to teen high-schoolers",
      "total_reactions": 5,
      "user": "cell989"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I haven't watched the old Johnny Depp days on \"21 Jump Street.\" Ever since the FOX network debuted in the late 80's, I saw some great moments from the show and I finally rent the series on Netflix. Now I've heard that they make a big 21 Jump Street the same title as the TV series did, and it was great. I saw the trailer and it looked like a retrospective homage to \"Buffy the Vampire Slayer\" meets \"Fast Times at Richmond High,\" But it's one of the best TV adaptations turned into a movie since \"Charlie's Angels.\" Jonah Hill and Channing Tatum were incredibly funny, Ice Cube is hillarious, I might check it out this week. I wish the old 21 Jump Street could be bringing back on TV for re-runs.",
      "total_reactions": 5,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "As soon as the movie starts it a non-stop joy -ride. As soon as you see Jonah Hill dressed like Eminem (Rapper), you will laugh you head off. As soon as you see Tatum in long hair you will laugh even harder.",
      "total_reactions": 5,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "A movie is great only if the audience enjoy it. This one is funny and funny only. If you would like to watch a comedy show with no agenda involved. You would definitely like it if you are expecting a funny movie which can keep you laughing till the end.",
      "total_reactions": 6,
      "user": "Merdocx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "21 Jump Street can be cliché and unfunny at times especially in the last third but that does not stop it from being an enjoyable film. There is some great comedy in this movie and some hilarious moments. Also, there are some likeable characters some of which I wish had more focus. I’d recommend this film to anyone in high school or college they’ll probably love it. It’s a great high school movie that will give you lots of laughs.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "The TV hit goes for laughs with Channing Tatum and Jonah Hill as two hapless cops who go undercover to bust a high school drug ring. Although there sly one-liners and a bouncy comic energy, the overall effect is more upbeat than hilarious. Tatum has been funnier and Hill does his usual shtick. The supporting cast could have been populated with zany types, but most of them add little to the comic development (except for 2 fun cameos). This is an example of how average writing translates into an average comedy.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Without a doubt the funniest comedy I have watched in a very long time. Channing Tatum and Jonah Hill are an absolute laugh riot here and work perfectly together. Honestly the whole movie is just one non-stop laugh fest. The humor is basically what you would expect from a modern R-rated comedy but only a thousand times smarter. Truly one of the best comedies I have ever seen and I highly recommend it to anyone who is looking for laughs and doesn't mind the profane and crude humor this movie often offers.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "21 Jump Street was super funny. It was light, frothy, foul-mouthed and very strange... But in a good way. Even Channing Tatum is good. Yes, I know! That's a miracle! Great stuff all the way around.",
      "total_reactions": 1,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "21 Jump Street is hilarious. I found it very entertaining but it's not really special for me, well it's offer many good laughs. Johny Depp's cameo was pretty unpredictable, and it has pretty cool music too. Miss high school?",
      "total_reactions": 1,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I liked this a lot more than I thought I would. It's not really my sort of film, so it took a while to grow on me, but once it did there were some good laughs and a clever cameo or two. Jonah Hill does his thing and Channing Tatum is surprisingly quite good too. Nick Offerman and Brie Larson bring a bit of spark to their roles also. In the end it's all a bit predictable, but enjoyable enough.",
      "total_reactions": 1,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "A fantastically funny action-comedy! 21 Jump Street is without doubt the best comedy i've saw in a while. Granted, it's ridiculously over the top, but it's immensly entertaining and wonderfully witty and the pairing of  Channing Tatum and Jonah Hill has proved to be a winning combination. I myself didn't see the original but the decision to reboot the tv show and bring it to the big screen was a brilliant one! The premise is simple enough two rookie cops (Tatum & Hill) are sent back to high school, undercover charged with the task of finding a new synthetic drug and locate the supplier. Ice Cube is awesome as their captain and seems a natural in the role but the bromance between Jonah Hill and Channing Tatum is terrific and they have a cracking chimstry to work of each other providing endless entertainment throughout as well as some hugely hilarious moments that are funny frequently throughout, the film also has the icing on the top with a cameo appearance from one Johnny Depp from the original. All in all i throuroughly enjoyed 21 Jump Street! It was a genuinely funny film that provided awesome entertainment and plenty of LOL moments. Comedy gold, dynamite movie!",
      "total_reactions": 3,
      "user": "Rosco"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "There is so much that could have gone wrong with this movie, but thanks to everyone involved, and especially Jonah Hill, (who co-wrote the intelligent script) make it a memorable gem. Honestly I haven't seen a film that had me laughing this much for years. Balancing whip-smart satire and meta-comedy with the immaturity of high school lets '21 Jump Street' transcend it's genre. This worth seeing in theatres for the audience participation, (it had the packed theatre in stitches and clapping during the funniest parts), and worth seeing in general for the great script. In addition, Jonah Hill and Channing Tatum are one of the funniest comedy teams in years, Jonah Hill plays a reversal of most of his roles while Tatum plays the deadpan delivery for some of the biggest laughs in the movie. Tatum may have just found a new genre for himself, and proves he's a better actor than his typical fare has led us to believe, and returns to the glory of his \"Stop-Loss\" performance. Overall, \"21 Jump Street\" is original, hilarious and continually surprising.",
      "total_reactions": 4,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I loved this movie and so did everyone else I brought with me. From the sound of it, most of the theater we were in loved it as well. Channing and Jonah were a good funny combo. Without a doubt, this is one of the funniest movies I have seen in a long time. Don't go in expecting a brilliant cop drama with some humor. This is dumb entertainment that several times makes fun of itself and similar movies.",
      "total_reactions": 4,
      "user": "GoodForge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Based on an 80’s TV show that not many people will remember 21 Jump Street sees police academy graduates Schmidt and Jenko sent undercover to a local high school to infiltrate a local drugs ring. As the film happily admits during an early scene the US has hardly had a shortage of remakes in recent time but, while it perhaps tries a little too hard to be outrageous on occasions, 21 Jump Street has enough clever ideas and laugh out loud moments to ensure fans of films such as The Hangover will not be disappointed.",
      "total_reactions": 1,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "First off, i was impressed with this movie. I didn't think this movie would be good when i first saw the trailer. Yeah it had its funny parts (in the trailer) but i truly felt like i watched the entire movie from the theatrical trailer. I was wrong. This movie was hilarious and it had a good plot to it as well. This is very unusual once it comes to comedies nowadays. Movies like Project X are just stupid because its alllll about teen partying, whereas in 21 jump street, you have multiple plots going on at once. This movie actually made you care about the characters which almost never happens in comedies today. 21 jump street had a very good story, very good acting by Channing Tatum (who i usually don't like at all) and from Jonah Hill who i think (excluding the sitter) has really stepped up his acting since his award worthy performance in Moneyball. This movie was of course, absolutely hilarious. Ice cubes character was small but memorable because he was just plain awesome. The film gets a bit cheesy with drama and such at some points but thats about the only flaw. This is the funniest movie of the year and one of the funniest in a very long time. I'll give 21 Jump Street an 8/10",
      "total_reactions": 3,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Back in 1987, the fledgling Fox Network debuted, offering entertainment on Saturday and Sunday evenings aimed at a younger audience. One of the networkâ",
      "total_reactions": 4,
      "user": "garethvk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "I absolutely loved this movie. It was a great comedy with great character development, and plenty of dirty sex jokes. I was actually quite surprised when I saw this. With most comedies, what they show in the trailer is the only funny parts of the movie. With this, I was laughing my butt off the whole way through. My only problem was the fact that it was a very predictable movie and the ending can be guessed correctly very early in the show. Highly recommend!",
      "total_reactions": 4,
      "user": "slsoccer7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Never did like Channing Tatum or Jonah Hill but in this movie, their not bad. Jonah Hill was actually funny and Channing Tatum was actually acting. The storyline was somewhat close to the orginial TV show and even had the orginial guys do a cameo, which was really cool. The movie did have me at time laughing and feeling for the characters for it really spoke to me. So for that I would recommend all to go catch a matinee and have some fun!",
      "total_reactions": 2,
      "user": "frugalDonnie"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "There is not a single dull moment. It is funny throughout and as offensive as it may be, who the hell cares? This is a lot better than recent comedies.",
      "total_reactions": 5,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Every bit as entertaining as the previews, if not more. The only reason my score is not a 10 is because I had to suffer through Channing Tatum's horrendous acting. Jonah Hill did well in this movie because it's in his wheelhouse. This has to be one of the more successful comedies i have seen. Not to mention the easter egg was hilarious!",
      "total_reactions": 3,
      "user": "WintersLMJ"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "I had a free ticket to the movie theater that was about to expire, so I decided to use it on 21 Jump Street. That decision turned out to be a great one. I really didn't know what to expect from 21 Jump street, and it appealed to me almost instantly. I have always enjoyed those bromance comedies like I Love you, Man and Role Models, so 21 Jump Street was a movie I expected to like, but I didn't know I would love it! I was really surprised how much I enjoyed the casting, especially Channing Tatum. This was a role that he usually doesn't take on, but he ended up doing exceptionally well. This movie was hilarious and very well made. Everybody needs to see this movie at some point in their lives.",
      "total_reactions": 3,
      "user": "dh3rsh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "In a time where remakes and long time are becoming more and more of a expectation, 21 Jump Street delivers a surprisingly fresh and hilarious take on the TV show of the same name, and contrary to popular belief, this is in fact a sequel to the show, continuing with the same arc.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "21 Jump Street is a hilarious, well written, intelligent, heartfelt story of friendship. Featuring surprisingly incredible performances from the two leads and hilarious cameos this is a wonderful comedy. I give this movie 90%.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "To tell you all the truth I've never even heard of the television show before of this movie and to tell you all the truth I don't really care about that, because my lack of knowledge never hindered my enjoyment of this movie one bit. This is a weird comedy in the sense that there are so many jokes, ranging from slapstick to stupidly weird, that obviously some don't work but a lot actually do. You'll find yourself laughing at things that don't actually make much sense but they're funny all the same. The depiction of high school is also very different...that is actually intelligent. Its not the same old high school with the same stereotypes this one actually makes sense. Even though the comedy is first class, the plot is a bit of a mess. Its not bad but it gets distracted on a number of occasions. The leads are also weird they are so mismatched that they actually work....Tantum gives a great performance and Hill is in his environment but its the relationship that shines.",
      "total_reactions": 1,
      "user": "Jefflyn90"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Relentlessly brash and grossly witty, 21 Jump Street is a pleasant surprise. It's an honest mockery of stereotype teen movie with relevant content caters for this generation of youth. While some scenes might get over-ridiculous, it never felt tedious and I admit I've never laughed that hard in the cinema. The script is bluntly creative, often bordering on absurdity but in a fresh way far from cheesy teeny clichÃ©s. It proves that clever writing doesn't have to be fancy literature, it can also be **** hilarious ****",
      "total_reactions": 3,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "I really wasn't expecting much from this movie because the trailers looked pretty bad, but it was actually good, and very funny.  Both Channing Tatum and Jonah Hill are perfect for the roles they played.  My only complaint is that it stuck a little too close to the formula for these types of movies.",
      "total_reactions": 2,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was absolutely hilarious. More than just cheap laughs though, the movie was very unique. I know, \"How can it be unique if it's a rip-off of an 80's show?\" Well, outside the movie title and a cameo appearance in the end, this movie feels nothing at all like the Johnny Depp show from way back when. From the plot to the character dynamic to clever mocking of stereotypes (not just individual persons but pop culture as well), this movie is a fun watch. Jonah Hill and Channing Tatum are both outstanding as well. Tatum gets a lot of hate for his \"lack of acting chops\" but I think he has continued to improve with each role. Overall, it wasn't the funniest movie from beginning to end but it's definitely an entertaining movie that's going to deliver tons of laughs.",
      "total_reactions": 2,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I used to watch the TV show 21 Jump Street, and while it was clever, I didn't think it was anything special. When I heard they were making a movie, it peeked my interest, but the previews made it look like it would be God awful, in one of the worst marketing campaigns for a film I've ever seen. After hearing some good things from friends and being that it had a good cast, I decided to give the film a shot and it far exceeded my expectations. Two of the dumbest and most immature cops on the force are sent on an undercover mission to infiltrate a local High School and find out where a new designer drug is coming from. Right from the start you could tell the film would lean more to the comedic side as opposed to the show, which was more dramatic. Going the comedic way, especially with the cast they had, was the right way to go, but much of the film was still unbelievable. Anyone who believes that either Jonah Hill or Channing Tatum could even come close to passing for High School student are completely out of their minds. Also, the speed in which these two idiots went from being the worst cops on the force to celebrated heroes was ridiculous. It would have been far more enjoyable if these guys just sorta stumbled into solving the crime, rather than all of a sudden becoming great cops. As for the cast, Jonah Hill continues to be the most underrated comedic actor in Hollywood. I have yet to see this guy do a bad movie. Channing Tatum was pretty good too, he's known more for his looks than his talent, but he fit his role extremely well. It was probably written specifically for his persona, similar to his role in Magic Mike, but he still is very good. Finally, the cast is rounded out by Dave Franco, the younger and better looking brother of James Franco, who for the very first time shows that he is more than just a kid, getting work because of his brother. He was very solid and perhaps the most believable and likeable character in this film. 21 Jump Street is nothing new, it's another cop movie that blends comedy and action, like almost every other Lethal Weapon wannabe. The story isn't better than the rest, but it is funnier than most of the other films and it has some terrific cameos.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "what a classic comedy this movie made me laugh to the point where Dr.pepper came out of my nose. Jonah hill has been a comedy genius for a long time and this movie was his best since Take him to the greek",
      "total_reactions": 4,
      "user": "RonaldOVOXO"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Angels: This week I became a movie God-I saw 3 movies! And, the best of the lot was 21 Jump street.  It was a very good comedy, up there with 'the hangover', 'horrible bosses', 'blades of glory' and 'white chicks' though not quite as good as say 'A Fish Called Wanda'.  The plot was clever, and the characterization was first-rate. I am not a Jonah Hill fan, but he was funny, and as one of the writers, he may have more talent as a comic writer than as a comic actor.  And young Channing Tatum.  What can I say? I have seen him in a dance movie, an action movie, a romantic comedy, and now a comedy, and he has the physical appeal (he is a dreamboat) and the acting skill to shine in each category. It was also good to see Ice Cube who has more comedic acting talent than he is credited for.  I only give  this movie a 9 because of the  plethora (abundance) of curse words. Now,  I am not a prude. Growing up in a big city, i used 'industrial' language as much as the next person. However, sometimes bad language is a substitute for funny dialog. And occasionally that is what I though here.  (That is why 'A Fish Called Wanda' is so good.  Funny dialog with few curse words.)  Anyway, 21 Jump Street is a very funny, very enjoyable movie.( My honey, who hates cursing, nevertheless really enjoyed the movie.)",
      "total_reactions": 4,
      "user": "sesostris"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "I thought this movie would be terrible when I saw the first previews months ago, but I gave the movie a shot and was pleasantly surprised.  I couldn't imagine Channing Tatum being funny, but his chemistry with Jonah Hill is perfect.  The movie is pretty over the top, but it works.  For every scene that is ridiculous, there is a scene that brings the movie back down to Earth.  Essentially this movie boils down to Hill and Tatum reliving their high school years, but it somehow doesn't come across as being too cliche despite the millions of high school movies out there.  The movie even gets more entertaining as it goes on.  Ice Cube plays their angry black captain and is pretty damn funny, although he doesn't come close to being as funny as P. Diddy in Get Him to the Greek.  Is this movie a classic?  No.  However, it's been a long time since I've seen a movie as funny as this so it deserves a lot of credit.  Comedies are on the decline, and 21 Jump Street just re-raised the bar for the genre.",
      "total_reactions": 3,
      "user": "keep_yr_bias"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Interesting film, 21 Jump Street is a bigger sorprise, I think that can be a disaster, but is same like the remake of Footloose. This film is amazing.",
      "total_reactions": 6,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I haven't really laughed this much at a movie in a very long, but thanks to channing tatum and johnah hill this movie actually give some hope that 2012 will be a good year for movies, best comedy move in awhile",
      "total_reactions": 4,
      "user": "AwesomeGamer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "The reason I liked this movie was because it wasn't afraid to make fun of itself and other \"teen\" movie stereotypes along the way.  It wasn't outrageously funny, but it wasn't dull either.  It kept a nice lighthearted pace with some belly laughs in between.  If I had laughed more, I would have gone up in my rating, but it's a solid movie that is worth seeing.",
      "total_reactions": 4,
      "user": "Buddah"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I'm not one for comedic movies, but I have to admit this one was pretty entertaining.  This is new territory for Tatum and he clearly shines in the role, and Jonah Hill is as steady as always.  It's over the top, loud, outrageous, and clever.  My only complaint is the beginning of the film is somewhat dry; few laughs and not much going on.  The remaining 80% lives up to the hype.",
      "total_reactions": 4,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Basic rules for this movie.  If you like risquÃ© jokes, inappropriate humor, crude jokes...you'll love this. If you don't, you won't like this movie.  Funny, fast-paced and a great storyline...I absolutely loved this one.",
      "total_reactions": 3,
      "user": "Liquid_Blue7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Not as bad as everyone is making it out to be. The movie had several very funny scenes esp. when they run into the teacher in the hallway. Deff. see it",
      "total_reactions": 3,
      "user": "Fgcboss"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Best Comedy ever watch for the start of 2012. Channing and Jonah had me on a roll from start to finish. Thumbs up to my man Channing. Ice Cube also hit if off, Can't wait for a sequel and going this weekend to see it again :)",
      "total_reactions": 3,
      "user": "Eliza70"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Could've been a lot worse but a surprisingly fun time with Hill and Tatum in this ridiculous buddy cop movie. Definitely not a comedy that you have to see or rent out, but its a decent one for a bored Friday night.",
      "total_reactions": 1,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I haven't cried and laughed this hard in a long time. Absolutely amazing.  I can't believe how low the rating is on this movie.  The entire theater was laughing non-stop.",
      "total_reactions": 3,
      "user": "elemental"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This comedy snuck up on my ad I'd heard almost nothing about it before release, but I have to say I was pleasantly surprised. People claiming Channing Tatum as a breath of fresh air to the comedy scene are slightly over selling it though. While he does an adequate job, most of the amusement in the film is thanks to Jonah Hill and the supporting cast. While not a classic, this movie is well worth a watch and I would recommend it to anyone looking for a light hearted comedy.",
      "total_reactions": 3,
      "user": "VizualDze"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "21 Jump Street is an over the top comedy with language like no other. Most of the time unnecessary Also there are characters that are flat ridiculous ( ice Cube). It has its  funny moments but nothing that will knock your socks off. Just don't take it too seriously and you will should enjoy it.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Good comedy overall but some parts of the plot was just stupid and had nothing to do with the movies overall plot. Channing supprised me by his comidic skills and johnah never stops impressing me.",
      "total_reactions": 3,
      "user": "mmadbzfan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "First off: quite hilarious, with a variety of jokes. A lot of self-aware references, with a good deal of potty humor, mixed in with mistaken identity/situational sitcom jokes make some humor for everyone. The action isnt anything special, and serves more as a plot device. The emotional situations are pretty shallow. If you want a pure comedy, this will be a 10.",
      "total_reactions": 3,
      "user": "Doomyoshi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Movie was OK. I found that it drags on at times and some of the jokes are pretty cheesy. But good acting all around. One thing I thought was kind of weird was how a guy 7 years out of high school would fall in love with a high school senior... yeah... But it's still a decent movie with plenty of laughs if you're looking for a way to spend the afternoon or evening.",
      "total_reactions": 3,
      "user": "theoffice"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Hilarious, but overrated. \"21 Jump Street\" got its charisma, but some of the jokes were undeniably overused and quite boring (not to mention the overplayed trailer). To say that \"21 Jump Street\" is the male version of \"Bridesmaid\" is disagreeable.",
      "total_reactions": 4,
      "user": "200Millions"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "21 Jump Street is one of the funniest films I have seen for a long time.  Jonah Hill and Channing Tatum is one of the strangest comedy double acts Iâ",
      "total_reactions": 3,
      "user": "d_griffindor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Loved this movie! I consider myself to be somewhat of a snob when Im expecting to watch a serious movie. However, this doesnt mean I cant enjoy something I expect to be totally ridiculous and stupid. And I got what I came for in the best way ever! Hill/Tatum were a suprisingly dynamite comedic pair. Perfect for a date night! Great mix of stupidity and over the top gags that will have you laughing the whole ride back home.",
      "total_reactions": 2,
      "user": "SeanMcG"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I really liked this movie. It was very funny and over the top with some cringy moments. The only thing that let it down in some parts was that it was slightly over juvenile and blunt .",
      "total_reactions": 2,
      "user": "Dodger"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Great movie! I may not recommend going to theatres to see it, but definitely pick it up on DVD or Blu Ray. Channing was surprisingly funny and Jonah Hill did well in his own right. Not as much emphasis on drugs as I would have thought, but still a good watch nonetheless.",
      "total_reactions": 2,
      "user": "Vorch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Fun movie, don't go in to it looking for anything too serious. Gave it a 6 due to the excessive swearing, which wasn't really needed. The R Rating is definitely earned.",
      "total_reactions": 1,
      "user": "taygor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Great movie. There were some points when I laughed out loud, but they weren't the moments I expected to be laughing at. There were many failed jokes in the movie but what I was happy about was that this movie was a comedy film, with an actual story. And just a stupid story. The movie was funny, entertaining, and it had Jonah Hill so of course its awesome.",
      "total_reactions": 2,
      "user": "Tall_But_Short"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "By far one of the funniest movies I have watched in a long time. So funny in fact that I'm most likely going to buy it when it comes out on blu-ray. The teamwork of Hill and Tatum is ingeniously combined to create a great film that succeeds in both storyline and humor. The company of the theater and I enjoyed endless amounts of laughter, and when I say endless, I mean endless. In conclusion 21 Jump Street is a great film that delivered in every category, that is why I give it a solid 10.",
      "total_reactions": 2,
      "user": "JackAttack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "\"21 Jump Street,\" this yearâ",
      "total_reactions": 2,
      "user": "EmptyFilmStock"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "At times the story struggles, but the comedic combination of Hill and Tatum is surprisingly competent.  Went in expecting a 4/10, far exceeded expectations.  An instant classic.",
      "total_reactions": 2,
      "user": "JW00042"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Funny & Smart..",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Well made, ,,21 Jump Street'' is more like satire over the comedy movies and their cliche. Is not extremely funny, but does its job in a soft way, by simple jokes and goofs, just like the comedy genre had used to became, but still remains one of 2012 best comedies",
      "total_reactions": 2,
      "user": "Sorry15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "To quote a character from this film: 'We're reviving a canceled undercover project from the '80s and revamping it for modern times. The people behind this lack creativity and they've run out of ideas, so what they do now is just recycle **** from the past and hope that nobody will notice'. That's true for this film but actualy coz they poke fun at themselves and the classic buddy movie stereotypes and clichés it's actualy enjoyable and sometimes even funny. Yes, they also have some of those obligatory awkward scenes but not too many. Don't get me wrong, this is not a 'good' film like e.g. Hot Fuzz but as good as it gets for American comedies these days.",
      "total_reactions": 2,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "This film was a genuine surprise, proved to be better than I expected. Jonah Hill proved himself to be a great actor and a good screenplay writer once again. Watching Channing Tatum doing comedy was great, I liked the performances by both of them. Moving on to the film, there were a few boring scenes, I agree but there were some hilarious ones as well. The plot of the film was good, something different and enjoyable and the use of bizarre graphics made it look more ridiculous. Thumbs up to Chris Miller and Phil Lord for making a good, funny film that I can watch again and laugh like I am watching it for the first time.",
      "total_reactions": 2,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "So far, the funniest movie of the year, and one of the best I have seen in a long time. Tatum gives a surprisingly genuine (that is the word, here) comedic performance and Hill is typically freakin' hilarious. There is a real sense of brotherhood (if based somewhat off of stupidity) captured between the two characters that is endlessly watchable and the banter between everyone in the film is deliciously hilarious. Ice Cube in particular deserves props for every word he speaks throughout. There is a quality of self-awareness that, without, the film would have not stayed afloat and the same kind of hyper-zany energy that Lord and Miller captured in their first animated feature translates even better to foul mouthed live action. An endlessly quotable action comedy by means of a raunchier 'The Other Guys' that I highly recommend.",
      "total_reactions": 2,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "I went into 21 Jump Street with moderately high expectations because of what my friends were telling me about it. This is by far one of the best comedies to come out in the past couple of years. I",
      "total_reactions": 1,
      "user": "BryceHoogland"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This was a very funny film. Jonah Hill and Channing Tatum were hilarious in their roles, and Johnny Depp made a hilarious cameo appearance. Sometimes there was a little too much going on, but mostly it was a very funny and suprisingly action-savvy romp.",
      "total_reactions": 1,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "This was your average comedy movie. Funny idea and a ridiculous execution made this film entertaining with enough laughs, yet it was predictable plot wise and very forgettable. For once I actually didn't mind Channing as an actor and was able to enjoy the movie without thinking how i disliked him. If you don't expect too much from this film and are prepared to laugh and not take things seriously you can easily enjoy this film with friends and family.",
      "total_reactions": 1,
      "user": "b3_"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "I found the film absolutely hilarious. Tatum and Hill never cease to get into situations that would provide comic relief to all types of audiences. It's definitely worth watching.",
      "total_reactions": 1,
      "user": "iVaughtTV"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Don't listen to what other people are saying that you need to be brain dead or fourteen years old in junior high to enjoy this movie. This movie is simply for people that enjoy raunchy jokes or for people that have a sense of humour that disturbs others in the non-violent sense. What jokes you may ask? The kind that centre around awkward sexual themes, faeces, hipsters you hate, drugs and other jokes that shouldn't be said at the table. For what it's worth, I rarely laugh out loud to\"normal jokes\" as they just don't cut it...this movie actually made my movie experience a \"laughing in my seat spilling pop-corn\" instead of \"walking outside of the theatre thinking about the CGI scenes and how the script was not believable for a movie that tried coming across as real\". Watch it with your friends and have some food.",
      "total_reactions": 1,
      "user": "alfaalex101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "How this movie can score so highly on both critics and users is beyond me, (sherlock holmes 2 anyone?) I admit i was a fan of the eighties original, but understand this was remade as a comedy and came in with zero expectations. It starts off ok, all bright and breezy and quite funny, but then it just runs out of ideas and more crucially, jokes. The two leads are likeable and do a good job, infact the whole movie is ok, but thats the point, its just ok, not really bad, but not particularly good either, even the main two guys who cameo from the original just feel wedged in without any thought or originality (or even funny). All in all, not a bad film but surely one of the most overrated films of the year.",
      "total_reactions": 2,
      "user": "Goodfella"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "The two leads are great, and the direction even greater. I love how the movie was self-aware of what it was while never taking you too out of the experience.  21 Jump Street isn't just one of the funniest movies of 2012, but a also a smart satire of the times, and one of the best buddy-cop movies I've ever seen.",
      "total_reactions": 2,
      "user": "travispipes"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "21 Jump Street, is a moving portrait of this generations attitudes. All the cheeky humor to nonchalantly fist pummeling students this movie was harshly humorous and in my perspective world wide correct.",
      "total_reactions": 2,
      "user": "Greggerz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "This film doesn't have any serious or strong messages and won't ever be mistaken for a major cinematic achievement, but it may just be the funniest movie I've seen in years, as I haven't laughed that hard in a long time.",
      "total_reactions": 2,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Funny as HE$$.  Loved it.  Jonah Hill is here to stay!!  The slim shady reference at the beginning is funny so pay attention.  The ending was a bit too action-packed for me, but I guess it was necessary for this franchise (i.e., 21 Jump Street).",
      "total_reactions": 2,
      "user": "thejoker_5"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "There are some funny jokes (like main character an Eminem-wannabe or making fun of hipsters) and one cool easter egg. But overall the movie is average.",
      "total_reactions": 1,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "The comedy is definitely something you wouldn't want your young son or daughter to see considering all of the vulgar and explicit language. But in today's time, that language is what makes comedies sell. The producers related the situations to high schools very well. Not only do high schools have drugs going around, there are kids picking on other kids, and the typical stero typed groups, which the producers incorporated in the movie .to make it more relatable. I believe the movie was well written, had the right actors, and was over all a good laugh.",
      "total_reactions": 1,
      "user": "shelbyreiff"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Jonah Hill and Channing Tatum have perfect comedic chemistry. Jump Street is flat out funny from start to finish. It just makes a good buddy movie, you know?",
      "total_reactions": 2,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "This was pretty funny, I`m glad I watched it cause I didn`t expect much frm it. No point in watching this if you have no sense of humor, I`m jughing this as a comedy movie not trying to compare this to Action movies.",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Almost unendingly hilarious, \"21 Jump Street\" is that strange kind of worthwhile comedy that presents a healthy dose of satire and nostalgia.",
      "total_reactions": 2,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Hilarious film. Jonah Hill and Ice Cube are both good here, as is Channing Tatum who is having a great year. Sure to be one of the best comedies of 2012.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I was really surprised at just how good this movie was. While it isn't anything we haven't seen before, it also adds something fresh to a very tired genre. Tatum is surprisingly good at comedy?! Who'd have thought?! Overall: A very good comedy that is well worth watching, even if you think it isn't for you.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "2 THUMBS UP! It's actually a funny, badass movie. Ridiculous and over the top, silly fun. Channing and Jonah has a great chemistry together in this movie. A hilarious, addicting movie, haven't laugh that much before. It's a great, great, great movie!",
      "total_reactions": 3,
      "user": "Khen01"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Ridiculously funny and bizarre. Best comedy of 2012. The most I´ve laughed in a long time watching a movie. Both leading actors are good in their roles and even the supporting ones are nice to watch. There were a couple of moments I laughed out loud for several seconds, which is very rare in my case. The biggest props should go to the script and the hilarious situations it creates. Good stuff.",
      "total_reactions": 1,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "[7.4] This movie is the best kind of stupid: a mind numbing, completely self-conscious, ridiculous, and somehow smart stupid. It's consistently funny, clever, and as long as you go into expecting what you would normally expect from Jonah Hill, you'll be more than happy.",
      "total_reactions": 1,
      "user": "ncstatemike"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I personally loved this movie and you should too. It was one of the funniest movies I've ever seen if not the BEST movie. Although i will say the end is a bit gross but still funny and one heck of a great movie!",
      "total_reactions": 1,
      "user": "bradtheman123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "You don't have to watch the old tv show to see if its going to be good. Because it's not anything like the show, but it's still enjoyable to watch. It interesting to turn an old tv drama into a new a hip comedy. The movie was hilarious. Channing Tatum and Jonah Hill work perfectly together, but honestly, Channing's character was much more hilarious than Jonah's (which is kind of unexpected). The storyline is fairly average and ununique. But combining the comedy gold makes this movie work. The biggest part was the Johnney Depp and Peter Deluise cameo from the old \"21 Jump Street\" tv show. Especially when they got shot. It was an unexpected cameo with an unexpected twist, but was one of the best moments of the movie. The story does stretch at times, but overall, it's a fun action-comedy that you'll never forget.",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "At first I believed Channing Tatum could not deliver on the comedic side, but after seeing 21 Jump Street, I am convinced otherwise. But this however does not save for the fact that it does not stray too far from the original, and it loses value due to some flat jokes and a lame plotline. Generic, but surely watchable come a few laughs.",
      "total_reactions": 1,
      "user": "Rem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "This film tries to make you laugh. And it achieves that. The cast is hilarious and probably the best for that movie. This film has an intelligent plot and It was an interesting film. You won't get bored and you will laugh in many points and scenes in that movie. Thumbs up!",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "A movie that has a lot of comedy. Jonah Hill plays a essential role in this film; brings out a lot of the gags, that make this film funny. although, surprisingly Tatum is also turns on the comedy, which shows these two as a great duo that are both extremely entertaining. Overall a great movie that is well written, purposefully for laughs, that work well.",
      "total_reactions": 1,
      "user": "turbulentmaniac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "funny as crap and definantally a movie that will never be forgotten with the legendary cast of ice cube Jonah hill channing tatum    ps way better than the old tv show",
      "total_reactions": 1,
      "user": "spearspitter65"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "I came with some very low expectations to this film, and was pleasantly surprised.",
      "total_reactions": 1,
      "user": "SchnitzelPoof"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "\" We're reviving a canceled undercover police program from the '80s and revamping it for modern times. You see the guys in charge of this stuff lack creativity and are completely out of ideas, so all they do now is recycle **** from the past and expect us all not to notice.\"",
      "total_reactions": 1,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "If you want to see a somewhat funny movie with lots of jokes, parties, and pretty people, but has nothing to offer, than watch 21 Jump Street. It'll satisfy your Friday night of boredom and leave you with memories of when you were in high school. It doesn't have a message to offer other than don't become a cop to act like these two knuckleheads.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "This film is funny in a way that teenagers will understand meaning it's audience will last forever and parents will show it to their children when they grow up, i believe this will be a classic.",
      "total_reactions": 1,
      "user": "applesandorange"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Like an off-the-hook blend of Breaking Bad and Superbad, 21 Jump Street delivers a combination of action and hilarity, but it doesn't do it in a very memorable way.",
      "total_reactions": 1,
      "user": "KaptainHutchino"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Jonah Hill and Channing Tatum are hilarious together, although neither actor seems to be able to transition from  comedy to drama in a single movie. The punch lines are good, although when they move to a more serious part, it seems unauthentic and just odd to watch. Overall the movie is funny and is not supposed to be taken too seriously as a remake or sequel. Bringing back characters from the original series, was a good touch and shows that they felt the movie was good enough representation for them to be in it.",
      "total_reactions": 1,
      "user": "kw36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "I don't know why there are so many bad reviews. I loved the first part of the movie, it was hilarious to me. However the second half of the movie was downright boring and I just couldn't wait for it to be over.",
      "total_reactions": 1,
      "user": "goopyGoop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I really enjoyed this movie , we were laughing a lot , it has a lot of funny moments , just don't take this movie too seriously . I was surprised - I didn't expect so much fun from it !",
      "total_reactions": 1,
      "user": "icealex19"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "One of my favourite comedy movies of all time. It is hilarious, Jonah Hills character in this movie is so funny and says so many funny jokes. I enjoy him more in this movie than Superbad. This movie is funny the whole time from the beginning to the end with out ever letting up. The best comedy movie of 2012 and one of my all time favourite comedy's.",
      "total_reactions": 1,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Surprisingly fun! this film is one of the funniest movies I have ever seen. Channing and Jonnah are absolutely hysterical. The script is hilarious and just all around impressive! cant wait for the sequel!",
      "total_reactions": 1,
      "user": "AaronWasserman2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I like everything about 21 Jump Street. Maybe it's my favorite movie! lol I've watched it several times and I still laugh at the jokes. Channing and Jonah have a lot of chemistry on screen!",
      "total_reactions": 1,
      "user": "gustavomelo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "It's the worse version of The Departed, and the lack of ''My name is Jeff'' was also disappointing.",
      "total_reactions": 4,
      "user": "FreakieFan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I loved this movie. It took me a long time to see it because it just looked like another generic buddy-cop comedy and I couldnt be bothered but after being pressured to see (and trust me I had loooooow expectations) it I found myself really enjoying it. It was smart and funny and all acting was top notch. Give it a watch, you might be pleasantly surprised.",
      "total_reactions": 0,
      "user": "djrussell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"21 Jump Street\" is a delightful joy as the unusually strong pair-up between Jonah Hill and Channing Tatum will make you jump up and down and roll on the floor with laughter.",
      "total_reactions": 0,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "A really solid and smart comedy. The \"action\" scenes are goofy without being too over the top. The jokes and fish-out-of-water stuff works well. Unlike most movies I end up seeing (sci-fi or crime stuff), I could generally say that most people should see this to unwind.",
      "total_reactions": 0,
      "user": "Lokathor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "A surprisingly dynamic duo--Channing Tatum and Jonah Hill are great together. 21 Jump Street is a fun take on undercover work in the police force. Occasionally heavy on profanity, but in this case, it often works.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "For 3/4 of this movie, I was truly shocked this was as funny as it was and 21 Jump Street is absolutely hysterical. But, it ruins it with the ending, in particular the part with Rob Riggle. The movie just could not help itself. That being said, this rest is very good, but that ending...oh my. Jonah Hill, Channing Tatum, and Brie Larson, are fantastic and Hill and Tatum have a great chemistry with one another. The film flows really well and is a great modern teen comedy blended with classic tropes of the genre. Additionally, I loved the unexpected cameo towards the end of the film from another undercover duo. It was super unexpected and hilarious. Honestly, the whole movie is quite well-written and well-directed, which I was not expecting at all. While fun and incredibly entertaining, 21 Jump Street manages to be a film that is somewhat mature throughout, but shoots itself in the crotch at the very end.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Interesting premise and a hilarious effort from both Channing Tatum and Jonah Hill. These two definitely have a great on-screen chemistry as partners-in-crime/bros. Ridiculous and silly, this movie is worth a watch for some good laughs and entertainment.",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Cussing is not a substitute for emoting.  I've never heard anyone actually talk like the people in this movie.  It's like they think they can manually inject some emotion into their shattered souls with profanity.  If you want to watch stupid kids be stupid kids for two hours, go see this movie.  Be prepared for a sprinkling of nightmarish images that are played off as jokes.  It's all right, you're an expert at repressing that stuff.  They got a script written by someone who didn't know what they wanted to say, and a group of people who don't care about acting or film, but are just dishonest enough to pretend like they do.  The one ray of hope, I guess, is the nerd crowd, but they got precious little screen time, and, if they had gotten more, it probably would have just been to show them 'loosening up' and doing something horrible, thereby gaining acceptance so we can all sing coombaya and realize we're not so different after all.  I can say the editing was good, and there were one or two actual laughs from me, but I wish I hadn't watched it",
      "total_reactions": 0,
      "user": "displeased"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "I don't know how I was dragged into watching this movie, perhaps I thought it was going to pass off as an acceptable one. Since my first run-through, I have not had any intention of returning to it. Partially funny, when it's not forced, and even then, no more then a chuckle. It's dull humor at it's finest, and thus I can see why it would appeal to the masses. Unfortunately, I would walk away from my TV set if it came on. With the promise of not returning for it's sequel.",
      "total_reactions": 0,
      "user": "Mudgee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "I just watched this on iTunes, tricked into believing that it was a good movie by the Tomatometer, its Average Rating and the good Metacritic score... and I have once again lost faith in all of these aggregate ratings. There were a few good jokes in this movie, but that's really the only positive thing I can think of. The movie is largely predictable, and when it's not that's only because of a) a ridiculously unbelievable turn of events, or b) a huge plot hole. The writing is just plain stupid and infantile. Unfortunately the acting is bad too - with Brie Larson as Molly being the _only_ exception, but she hardly gets any screen time.",
      "total_reactions": 0,
      "user": "Markusnl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "21 Jump Street succeeds because it is very funny and the chemistry between the two stars (Channing Tatum and Jonah Hill) is great. Ice Cube delivers a hilarious performance as their police superior and it is all very fun. Would recommend.",
      "total_reactions": 0,
      "user": "NShep53"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "\" Jonah Hill and Channing Tatum are the kings of comedy\". This is an outraging comedy with full of laughter that Hill and Tatum has provided for us \" 21 jump street fans\". Its very funny to be honest , with loud music + good laughter = Having the best time of your life watching this film. Grade A , ( hill and tatum are perfect with out directors phil lord and christopher miller ).",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is probably one of the funniest i have ever seen.The jokes are stupid and there is a lot of action,If you don't like this it's probably because you don't have any sense of humour.The only bad thing about 21 jump street is the plot,he's too predictable.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Un claro ejemplo de película americana que no hace ninguna gracia. Solo funcionan algunas escenas puntuales de Jonah Hill, el resto es una basura. Tatum nunca es gracioso (los guapos nunca hacen gracia, es así), la trama es aburrida, Ice Cube está exagerado y cansa, el final es absurdo.",
      "total_reactions": 0,
      "user": "CPD98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "21 Jump Street just seemed to surprise when it was released. No one expected a film based on an average (at best) television series could ever be converted into a hilarious film. Jonah Hill and Channing Tatum made themselves mega stars in a risk well worth taking. 21 Jump Street is one of the best comedy movies that have been released in the past decade.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It is an interesting movie. Even I have not shaved for a while in a comedy film. I think it's one of the best films. I recommend it.******************",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "It's a well made comedy with an easy, non-forceful pace, and it has two guys who do good together. It is a good film, but the comedy is where it surprisingly struggles at.",
      "total_reactions": 0,
      "user": "ryanneevman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Buenísima !!. Una película para reír, nada serio pero se lleva un par de puntos por romper con lo clásico visto en escuelas, el enfoque New Age de los estudiantes esta muy bueno !",
      "total_reactions": 0,
      "user": "realnostok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "At the first begining my impressions wore totally negative, just more one high school movie full of clichés, but as it went straight to the point it suprised me, how Chris Miller was able to choose a so generic subject about high school and police but produce a great and different comedy from it. There's some kind of forced comedy in it, but that's ok, another great work from Chris Miller.",
      "total_reactions": 0,
      "user": "SillyClassyNerd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Pick a generic and overused context and bring it with a different and modern view is something meritorious and hard-worked, 21 Jump Street is fun without being immature or appealing, with a nice story and a great cast combination, it enjoyed me by the first begining to the last ending, an easy 80/100.",
      "total_reactions": 0,
      "user": "UShallntPASS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Schmidt and Jenko are more than ready to leave their adolescent problems behind. Joining the police force and the secret Jump Street unit, they use their youthful appearances to go undercover in a local high school. As they trade in their guns and badges for backpacks, Schmidt and Jenko risk their lives to investigate a violent and dangerous drug ring. But they find that high school is nothing like they left it just a few years earlier ­and neither expects that they will have to confront the terror and anxiety of being a teenager again and all the issues they thought they had left behind.",
      "total_reactions": 0,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "A worth watching movie. I mean Comedy is superb and action is cool as well. I bet you will not get bored from begining till end watching this movie. Overall I give it 9/10.",
      "total_reactions": 0,
      "user": "xenbaloch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "Вполне хорошая комедия на вечерок, смешная и эпичная, но имеет просто кучу клише и штампов - это относится к сюжетным поворотам и к некоторым шуткам.",
      "total_reactions": 0,
      "user": "russiangamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Total surprise what a fun time this movie is. I was honestly going to just wait to rent it but I heard good things and was so glad I changed my mind and saw it in theaters",
      "total_reactions": 0,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "At first, I was suspicious at this movie. It reeked of unoriginality and cliches. But then I kinda liked it. Quite a bit. \"21 Jump Street\" proves that a comedy can actually still be good just by following the good old structure that's been used since forever.",
      "total_reactions": 0,
      "user": "PetitBikini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "21 Jump Street goes for a lot of laughs, and most of the gags hit their mark. The film satisfies as wish fulfillment; the chance to go to high school and gain acceptance from the in-crowd, and pass all the hard classes to feel smart. There's also an element of schadenfreude watching the once-popular Jenko--who was a jerk to Schmidt--get his comeuppance as he lives as a social outcast, while Schmidt gets much of the glory in their detective work. Where 21 Jump Street stumbles is in its storytelling. A subplot about Jenko's flirty chemistry teacher doesn't pay off because it gets dropped midway through (the conclusion, and footage during the end credits suggest there's more to it). It should also be mentioned that the action sequences aren't exciting, and a fight scene is shot too close in that blasted Shaky-Cam that's making its rounds as of late. However, such considerations are in some ways moot. 21 Jump Street is a class clown of a movie, just trying to get a laugh.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "21 Jump Street is jumping to get insanely mad. It's not 20 anymore, it's 21 (please no 9 + 10 jokes). You're going to love 21 Jump Street hard as you wanted to love it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "The title 21 Jump Street probably means very little to most people under 30, particularly in Britain, where the 1980s Johnny Depp-starring cop show, in which patently adult police officers posed as teenagers to solve crime, never caught on in quite the way it did in America. Certainly it’s no cultural touchstone for ‘The Kids’, who make up much of the target audience for this. Honestly, it doesn’t really matter if you’ve never even heard the name before. Nostalgic familiarity is of very minor importance in enjoying a film that is often inspired, frequently insane and always very, very funny.",
      "total_reactions": 0,
      "user": "TheFilmDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Blown away! No expectations what so ever. I wasn't even born when the old series was out and this movie puts a flip on the old show. An includes a hilarious cameo!",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "21 Jump Street has brilliant casting of Jonah Hill and Channing Tatum. The directing and writing are also top notch making this one of my all time favourite comedies. I would recommend this movie to all.",
      "total_reactions": 0,
      "user": "MasterRiley"
    }
  ]
}