{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "3 Days to Kill",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 41,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 75,
      "summary": "Without Costner’s movie star equity, this thing could have fallen apart in the first 30 minutes. He keeps us involved, even as we’re thinking: Wait, WHAT just happened?"
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 67,
      "summary": "3 Days to Kill might not be art, but it's better than most of the overtly violent action fare that litters the multiplexes these days, thanks largely to the fact that its heart is almost as big as its explosions."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 63,
      "summary": "Like Liam Neeson's \"Taken\" series, Costner's 3 Days to Kill finds its absentee-dad action hero facing off against hordes of goons and gorillas - not to rescue his loved ones, but to prove himself to them, and maybe get a little extra quality time, too."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 63,
      "summary": "Daft and sloppy as it is, 3 Days rarely fails to entertain."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s all absurd in a way that is typical Besson. But it’s also undeniably entertaining, and it marks a relatively pain-free way to kill, if not three days, at least a couple of hours."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 58,
      "summary": "The film’s tone is wildly uneven."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "Of course, the movie doesn't work. But Costner does. No matter now nonsensical and uneven 3 Days to Kill gets, he's miraculously consistent."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "If the movie had been content to replicate the Taken formula, and left the fatherhood angle as a subtext, it would be easier to take. Instead, even for Costner admirers, it’s a hard 2 hours to kill."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "Actually, the only truly obnoxious thing about 3 Days to Kill is that the violent scenes are more congenial than the family scenes, because the teenage daughter (Hailee Steinfeld) here is presented as a sour, nasty brat."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "A comic-tragic-sentimental genre hodgepodge that wants to make you feel all the feelings amid all that action spectacle. It doesn’t entirely deliver, but at times you can’t help but admire its strangeness."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "Costner responds by bringing an easy integrity and seemingly effortless humanity to his part. And hence making a messy, meandering and silly movie rather more watchable than it deserves to be."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "3 Days to Kill is a comic variation on the \"Taken\" movies, which Besson also co-wrote and produced, starring Liam Neeson as a daughter-rescuing spy."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "The film is helped by Costner's self-deprecating, aw-shucks charm. The actor is game whether he's being asked to fight off truculent teens or treacherous terrorists."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "By any reasonable standard, 3 Days to Kill is a terrible movie: incoherent, crudely brutal, dumbly retrograde in its geo- and gender politics. But it is also, as much because of as in spite of these failings, kind of fun."
    },
    {
      "critic": "Alan Jones",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "McG may strip down his approach and serve up a variety of slick, well-paced shoot-outs and car chases, but his technical skill can't quite overcome the story's lazy sense of humor and incomprehensible account of international espionage."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "Although it’s not impossible to mix humor and violence, as “Midnight Run” proves, it isn’t easy — as 3 Days to Kill proves. Points for effort all the way around, and welcome back, Costner. Let’s hope things get better from here."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 42,
      "summary": "The movie never finds a way to blend the emotional and the rat-a-tat-tat into one seamless package the way that Besson did in his one and only good movie, The Professional (1994)."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 40,
      "summary": "Psychologists would doubtless have a field day with the film’s lumpy brew of semi-incestuous paternal angst, midlife machismo, all-American dick-swinging and moderate racism, but we imagine most of them are too busy to waste two hours on this sludge."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2014
      },
      "score": 40,
      "summary": "The central conceit in 3 Days to Kill – the family man moonlighting as a gun-for-hire – is hardly a fresh one. It worked in films released 10 or 20 years ago (see True Lies or Mr. and Mrs. Smith), but here it feels played out, clichéd."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 40,
      "summary": "The end result is still not a very good film, but it is one that boasts some enjoyable moments -- but only if you find yourself with two hours to kill."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 38,
      "summary": "It’s artificial, annoying, and boring."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 38,
      "summary": "The result is a convoluted mess that has one good twist and two good car chases. But it's hardly enough to bring this spy flick in from the cold."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 37,
      "summary": "3 Days to Kill feels like two very different movies, neither of which is particularly good."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "It’s many different films at once—all muddled, all unsatisfying, and all crying out for Liam Neeson’s participation."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "The lukewarm family dynamics sit awkwardly alongside equally underwhelming action sequences."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "It's a movie that's races from no place to get nowhere."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "Costner, by contrast, is too laidback to intimidate; he seems less battle-wearied than simply weary, nailing only half of the profitable “aging ass-kicker” equation. Firefights and car chases just don’t suit this movie star of advancing years."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "3 Days to Kill is pretty terrible, but it’s not really Kevin Costner’s fault."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "Besson provided the story and co-wrote the screenplay for a film directed by McG, who does his usual McGhastly job with action and is McGruesome when it comes to comedy."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 20,
      "summary": "It only comes alive when the star briefly shows the casual looseness that once was his calling card."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "I don't know what's good for Luc Besson, even though Kevin Costner might've saved his comeback for another Oscar run. But it seems to me like he wants to take a page out of Liam Neeson's \"Taken\" scoresheet on becoming the bad ass that he is today. 3 Days to Kill is like Blown Away ripped off by Die Hard as to joining a member of the AARP special agents club. The acting is great, but the story is boring and not enough gas in the tank for McG (you know, the guy 5 years ago killed the Terminator series into oblivion in Salvation) and Besson to copy what's left of \"Taken.\" But on the good side, the action scenes were pretty good. So I'm not so sure about this film, but I'll have to wait for \"Non-Stop\" instead. Rent \"3 Days To Kill.\"",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "3 Days To Kill was promoted in a very misleading way. The previews, the description, even the cover of the DVD make it sound like an exciting thriller. They even manipulated the name of the film, to make it seem like one thing, when it really meant another. The story centers around Ethan Renner, (Kevin Costner) a man who has spent his entire life killing people for the CIA. Renner has found that he only has a short time to live and wants to spend his remaining time with the family he's largely abandoned. His retirement is short lived however, as his old bosses at the CIA promise to help with his medical care if he'll do one last job, a job he doesn't want his family to know about. 3 Days To Kill was made to look like the dying agent had 3 Days To Kill his target, but that's not true at all. The title refers to him spending 3 days with the daughter he hasn't seen in 10 years. Like everyone else, I was fooled by the films promotion and decided to see it, even though Kevin Costner stars. I forgot the fact that Costner hasn't made a decent film in about fifteen years, and assumed that 3 Days To Kill would lead him away from romantic films and be a return to what made him a star, but it wasn't. The action and intensity of a CIA thriller is a back story, to a film about a dying man reconnecting with his family. It wasn't as boring or depressing as a full on drama, following a similar storyline, but it wasn't far off. Much of the hunt for his target was used as comedy to break up the monotony of watching Renner teaching his daughter to dance and ride a bicycle. To be honest, the film really is just a whole mix of things, none of which work. The cast is dreadful, the story is all over the place, and the film is just ridiculous. 3 Days To Kill was a horrible experience, and not only did I hate this film, I feel like I was tricked into watching it, by some clever marketing people, who knew the film was **** You can decide for yourself, but if you could use an extra two hours to do something you've been putting off, I'd skip this movie and get it done.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "So 3 Days to Kill was a complete waste of 2 hours, i wouldn't even call this a action movie because the little action there is beyond bland and generic as hell. Plus the fact that over half of the film is Kevin Costner dealing with trying to rebuild a relationship with his family which was really annoying. I would say that it overshadows the action side of the story but see thats the thing the whole thing, the action part was so horribly underwritten that i consider this a drama more then anything else. Also the film is cliche after cliche with the whole father daughter aspect, like he teaches her how to ride a bike, teaches her how to dance, trying to be nice to her boyfriend, saves her from being molested by a bunch of dudes just your typical father/daughter crap. I was thinking maybe Costner could make a comeback with this movie but sadly not, i really like the guy but he has been making crap movies as of late. Amber Heard was the best part of the movie and see wasn't in it all that much anyways she looked absolutely gorgeous, Hailee Steinfeld was \"Meh\" unfortunately. McG has made several movies the only two worth watching are We Are Marshall and Terminator Salvation and those and those two are just average movies.",
      "total_reactions": 1,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "It's time to once again slam director McG. 3 DAYS TO A KILL has a witty script, game cast, and fun locales, all undermined by tepid and incoherent direction. Everything is wrong and it is the director's fault. At least let's cut out 20 minutes. That would make for a mildly satisfying B-movie.",
      "total_reactions": 1,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "I was pleasantly surprised with this flick. I expected complete awfulness, but what I got was satisfying enough for me to give 3 Days to Kill this score. It's extremely far from perfect, but it has elements I loved that I will talk about in the review. When you first see this movie at the RedBox (which is where I got it), you probably will think it's an action movie. That would be wrong. While it does have scenes of action, at the core of the movie, it is a drama that deals with family, getting the job done, and other subjects like that. I'm glad that it was a drama because the action didn't impress me much except for the first scene. The character development in the drama is extremely good, and while the acting isn't extraordinary, I really liked Ethan's (Kevin Costner) daughter as an actress. You will care about the characters, too. There are mainly 2 plot points in the film, one for the action, and one for the drama. The action one has to do with him pretty much just trying to kill or torture these men he has to hunt down. It was generic. The drama one was refreshing for this genre, though. It has to do with him becoming a dad again and regaining the love from his daughter. Everything in this film is nothing groundbreaking or extremely ambitious. For what it was though, I really enjoyed it, and the drama in it is worth a watch indeed.",
      "total_reactions": 1,
      "user": "SimpleReviewz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "\"3 Days to Kill\" 10 Scale Rating: 4.5 (Mediocre) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "Without a doubt, one of the worst films of 2014. The first thing I noticed was the cinematography, which was awful. It had this terrible combination of a sunny day, but with a grey color correction that just made it look muddy. The plot is nonsensical and some moments were just hilariously bad. The actors did a fairly good job, especially Kevin Costner, who was probably the only good thing out of this film. The editing is clunky, with some scenes that just felt illogically put together. I've pretty much given up on MCG. Aside from some well made action sequences and a charming Kevin Costner as the main character, it's terrible. DON'T WATCH IT.",
      "total_reactions": 1,
      "user": "KENXAVI"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "3 Days to Kill is the kind of \"Taken\"-like action movie-thriller that is implausible as hell but still manages to capture our attention and at the same time be entertaining.",
      "total_reactions": 5,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "Kevin Costner is making a comeback and he's just as hot as ever. This movie was action filled and fun to watch, that you ignore some of the unrealistic parts. Definitely worth the watch in the theater.",
      "total_reactions": 5,
      "user": "StevenLane"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "3 Days to Kill is by no means a bad movie - I'm surprised it's currently getting a red score from the critics.  It's just a hair bloated for a McG / Besson film.  If you're thinking about seeing the film because you're a huge Amber Heard fan, don't bother.  She's probably in a grand total of 10 minutes of this film.  It's all Costner (who is quite good) and Hailee Steinfeld (who is excellent as the rebellious teenager). It's almost as if they overlayed  this assassin story on a family drama/comedy, though they're selling it as the opposite.  You could see much worse this time of year, believe me.",
      "total_reactions": 4,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "Stealing a discarded page from Liam Neeson’s action hero playbook, which began with 2008’s Taken and continues next week with the airplane thriller Non-Stop, Costner stars as a badass old dude kicking butt in 3 Days to Kill. It wouldn’t be so bad if Costner didn’t take the material so seriously. He scowls and grimaces in many of the scenes he’s in. And I’ll admit there are brief flashes that remind us how good he was once upon a time in The Untouchables, Dances with Wolves, A Perfect World and The Bodyguard.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I just saw this movie, taking some care to check it out first.   I have always like Kevin Costner films.  I personally found the movie entertaining.  Anyone who has had challenges in their own family will feel heartwarming connections in the movie.  I gave it an eight, perhaps it is more like a 7.5.  I certainly do not regret sitting for almost two hours.  Hey…what's wrong with happy endings ?",
      "total_reactions": 4,
      "user": "jamessherman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "With all the young hero types filling the tights of comic book characters, Hollywood has turned to middle-aged men to handle reality-based action. Kevin Costner plays a \"cleaner\" for the CIA, who retires so he can salvage his relationship with his daughter (Hailee Steinfeld). He's also got cancer with a 3-month death sentence, until an operative (Amber Heard in a succession of over-the-top glamour poses) promises a cure in exchange for one last job. Luc Besson penned the story, so it’s got interesting developments on the personal and action sides. Director McG has managed to balance both angles with warmth and some inventive fights. While it's in not way unique, it's passable entertainment and Costner manages to carry the burden effectively.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "A boring, and cliched poor man's version of Taken, only with no cool action, a non-sensical plot, and Kevin Costner instead of Liam Nesson, and directed by McG the director of Charlie's Angels, and the man who killed the Terminator franchise with the god-awful Terminator Salvation, with nothing good to offer this should  be avoided.",
      "total_reactions": 2,
      "user": "Leo9127"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "Two things you don’t want in an action/drama/thriller are absurdity and mundanity. Unfortunately, 3 Days to Kill has plenty of both, and both rear their crazy, boring heads during the opening gambit.",
      "total_reactions": 2,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "While it is filled with plenty of secret agent/spy movie cliches, as well as an overly familiar father trying to reconnect with his estranged daughter story, there's enough entertaining action and humor here to make it worth a watch. It manages to stay entertaining throughout, and that's more than I can say about lot of other similar movies. So while Costner won't make you forget about Neeson anytime soon, he manages to keep the movie entertaining enough to make it worth a rental. It might not take the genre to any new heights, or reach a lot of the old ones, but it can be a fun watch.",
      "total_reactions": 3,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "This movie could have easily been called, \"two hours to kill\". Because it was a complete waste of time. Even as a long time Kevin Costner fan the only thing that kept me watching this movie was to see if it could get any worse. Absolutely his worst movie, this is the kind of movie that ends careers. All I can say is I hope he got paid lots of money for this want to be action thriller. If I could given this movie a negative rating I would. If the airline was playing this movie on the plane I'd jump out.",
      "total_reactions": 3,
      "user": "kabala"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Just saw the movie, I loved it. I thought its going to be another Liam Neeson type movie but it wasnt. The plot was flawlessly mixed with family drama, this is great entertainment.",
      "total_reactions": 4,
      "user": "arsalanweb"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "I wasn't really a fan of this movie. When I first heard of it I thought I would really enjoy it but upon reading the story line of it I thought it was stupid and pointless",
      "total_reactions": 7,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "This was the latest action-crime movie from the director of 'This Means War'. It was more like a French thriller and should have been a French movie as well, but Hollywood borrowed it from a famous French filmmaker. This cast and crew team was great so expectation will be there like always. In this 2 hour movie everyone did not get fair screen presence except Kevin Costner. It was not long ago I saw the little girl in the movie 'True Grit', now she has all grown up here. Good to see her, hope the future will shape up well for her.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I think many critics failed to recognize that this film was intentionally camp.  This was a highly enjoyable film if you do not take it too seriously.",
      "total_reactions": 1,
      "user": "AlexanderLuthor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Directed by McG, written by Luc Besson, lead acting by Kevin Costner...perfect combination!!!  It was a thriller not in the usual Hollywood formula.  The lead character shows weakness and major flaws, but is a full and well rounded person.  Of course the plot line is implausible, but the dialogue and pace of the the movie kept it engaging!  I don't see any steals from the movie \"Taken\".  Instead, there's alot of originality in the movie.  Plus, the soundtrack fits the movie perfectly, especially the song \"Love it or Leave it\".  This movie is full of surprises, that only Luc Besson can do.  The editing is superb.",
      "total_reactions": 1,
      "user": "chevita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "This film has quite an unusual mix of action, violence, comedy and schmaltz. Its not great but I found it entertaining and it held my interest for the entire time. Its a film that doesn't take itself seriously and has some funny moments. Its a different twist on the usual action movies and I liked it for being a bit different to the norm.",
      "total_reactions": 0,
      "user": "djnicey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "A slightly different twist on \"a veteran agent goes on a killing spree in Europe\" plot, 3 Days to Kill is incredibly predictable and not without cheesy plot in every turn. Kevin Costner is a retired terminally-ill agent recruited back as a black ops assassin, by a seductive spy lady no less, to kill elusive marks in exchange for a magical drug that might or might not save his life. Here lies the biggest problem, while it may be true he's desperate enough to resort to the extremes, note that a dying man is no way in shape or form qualified to hunt down an international fugitive, because he's dying.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "I believe this movie's a bit underrated, so I decided to write a little something in its defense. In 3 Days to Kill, basically, Kevin Costner plays Liam Neeson and the movie sits in the \"Middle-aged guy has to go and kill a bunch of people for that last time\" genre.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "\"3 Days To Kill\" is Archer without the humor and style - just silly and unbelievable action scenes.  A complete waste of time.  I expected so much more from Luc Besson and McG.",
      "total_reactions": 0,
      "user": "Grymlore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "There is no question that Kevin Costner is back, but unfortunately McG's still the same.  Costner does his best to make this movie work and if it wasn't for a script and a director that gets in his way he might have just pulled it off.  C",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "The family drama and action doesn't blend well at all, but 3 Days to Kill soars due to Kevin Conster's fantastic performance and the level of entertainment it provides however implausible it is.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "while the action scenes are very fun to watch and kevin Costner gives a good performance as a bad ass ..3 days to kill is sure a messy movie that's keeps you entertain throughout the movie even when its far from perfect.",
      "total_reactions": 0,
      "user": "david1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Overall, this really is not all that bad a movie.  There are plenty of flaws and I hated the main CIA leader who was largely a joke.  There are many good elements as well.  Basically, this film is worth $1.25 at Redbox or a boring evening watch on cable.",
      "total_reactions": 0,
      "user": "MagicManRAW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "In this heart pounding action-thriller, Kevin Costner is a dangerous international spy, who is determined to give up his high stakes life to finally build a closer relationship with his estranged wife and daughter, whom he's previously kept at arm's length to keep out of danger. But first, he must complete one last mission- even if it means juggling the two toughest assignments yet: hunting down the world's most ruthless terrorist and looking after his teenage daughter for the first time in ten years, while his wife is out of town. (c) Relativity",
      "total_reactions": 0,
      "user": "Altrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "The family drama and action doesn't blend well at all, but 3 Days to Kill soars due to Kevin Costner's fantastic performance and the level of entertainment it provides however implausible it is.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "To call this a good movie is far from what is it, 3 Days to Kill is one of the just plain dumb movies of the year, it's so stupid but it's so entertaining at times. This is complete garbage and I shouldn't like it, yet at the same time I did end up enjoying it.",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Even though Kevin Costner gives a great performance and there is some decently entertaining stuff here and there, the movie suffers from not knowing what it wants to be and generally just being a mess.",
      "total_reactions": 0,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I liked the extended cut of this movie not the theatrical one. The extended is more of an R rated version than the PG-13 one. It has a harder edge to it. With that said the script by Adi Hasak is still terrible but this is the best movie McG has directed. Doesn't hurt that he used Luc Besson's crew. The cinematography by Thierry Arbogast, as always, is very good. The movie is fast paced and uses great locations in Paris. The cast is a mixed bag. Connie Nielson is completely wasted and Kevin Costner is miscast. The best performances are from Amber Heard and Hailee Steinfeld.  Best scene in the movie (extended cut) is courtesy of the hot twins Alizee & Ilyana Delaruelle",
      "total_reactions": 0,
      "user": "BBBoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "French filmmaker Luc Besson continues to combine family themes with intense violence (see Taken), but at least this film has a wry sense of humour about it.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "How did 3 Days to Kill, which doesn’t have the worst imaginable premise, turn out this bad? The problem starts with the screenplay, co-credited to Adi Hasak and over-the-top action aficionado Luc Besson. Still, although the more serious aspects of the script, especially the cliché-riddled fractious father/daughter relationship, lack flair, the writing on the whole isn’t terrible. Besson in particular knows how to mix genres and never takes things too seriously. It’s pretty evident he intended 3 Days to Kill to be a comedy thriller. Unfortunately, single-moniker director McG (Charlie’s Angels) didn’t get the memo.",
      "total_reactions": 0,
      "user": "TheFilmDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Luc Besson recruits McG and Kevin Costner for a fatally compromised tale of an American spy in Paris.",
      "total_reactions": 0,
      "user": "FilmClub"
    }
  ]
}