{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 9,
  "mc_mixed_rating_frequency": 0,
  "mc_movie_name": "3 Geezers!",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 4,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rob Humanick",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The convoluted mockumentary setup indicates that this is all meant to be taken as a meta exercise in Hollywood-insider rib-nudging, although the proceedings rarely rise to the occasion."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "It is a remarkably unattractive-looking movie. I don’t know when people voted that the seasick look of an iPhone video is now a desirable style."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "summary": "Barely managing to fill its brief running time despite its surfeit of smuttily vulgar gags, 3 Geezers! proves a less than subtle argument for euthanasia."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "summary": "3 Geezers is painful."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "summary": "This is one terrible movie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Very funny movie. Critics are nuts, stuck up fools! They must have an issue with growing old themselves, or have absolutely no sense of humour. I found it refreshingly different.",
      "total_reactions": 0,
      "user": "Okokokrfd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "After J.K Simmons won the Academy Award for best supporting actor, I made the huge mistake of delving to far into his filmography. Initially I though the shenanigans of the elderly was kinda cute, but that wore off quickly as the humor quickly turned annoying and disgusting like many other terrible comedies. Everything feels tired about the movie. The acting in particular comes across like none of them want to be there. Most of the funny moments come from how the \"geezers\" banter with people, but the jokes become drawn out and repetitive. Half way through you will feel like you are watching terrible sketch comedy. The thing about movies without any real plot is you will become extremely bored real quick. Living in a retirement home sounds more fun than watching this again. This movie proves that old people and gross out humor don't go together. I laughed a couple times, but not enough to present the movie from feeling like it is 4 hours. Old people walking across the street move faster than this movie. I know the movie makers anted to have a fun whimsical atmosphere with the elderly people, but it gets old really quick.",
      "total_reactions": 0,
      "user": "nathanbo"
    }
  ]
}