{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 55,
  "mc_movie_name": "9",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 158,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "It was very nice animation, the characters were average nothing special, and a story that came out of nowhere, this last part might be the best part of the movie, an original story but predictable at the same time.",
      "total_reactions": 2,
      "user": "kublay0880"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "The movie shows a post-apocalyptic/post-human place after the last of the humans has died in a war against their own machines. The film criticizes the abuse of science for the development of warfare - in this case especially artificial intelligence and biological warfare. Eventually, after our self-destruction, the forces of nature will wash away all the dirt we left behind. However, now that we are still here it is on us to keep our planet livable and beautiful. \"9\" has an intelligent story, an okay screenplay, and some beautiful moments. It is worth watching but loses some of its magic after the first viewing.",
      "total_reactions": 1,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "9 is not a casual film. This isn't the kind of movie where you invite a bunch of friends over, expecting an \"awesome\" movie. That's not to say it's a bad movie, it's quite good in fact. It's just not a typical film. It's bleak, it's eerie, and even the action, though strong, has a lot of symbolic meaning. I don't often watch films like 9, nor do I want to. 9 offers only a few smiles, and no laughs. Rule #1 for me, it has to have humor. I don't mind serious films, but a little humor can go a long way in helping me remember the film, and enjoy it. 9 manages to entertain without laughs. But 9 has a lot of emotion anyway. Fear certainly comes to mind, as does sadness. The PG-13 rating was not earned from language or sexual content. Part of it comes from the bloodless, yet intense violence. The more protruding part comes from the darkness. Despite it's limited inappropriate content, this is not a film for kids. It's dark themes may even challenge older ones. The story isn't all that sophisticated, to be honest. And there's more than a few cliches. There are plot points we've seen before, and characters that may evoke a sense of deja vu. But that's okay, because the movie is strong. The animation is incredible. The musical score, though a little run of the mill, is appropriately creepy, and it knows when to keep quiet. The voice cast is filled with stars that shine, but don't distract. Of course, you didn't come to see any of that. Depending on who you are, you came for one of two things; an intellectual film, and thought provoking themes, or epic machine vs. rag doll fights. If action is what you came for, you shouldn't be disappointed. There are plenty of, I shouldn't say duels, but fights between the stitch dolls, and the mechanical beasts. This film is not made up of action throughout, so teens coming ONLY for the action will surely be disappointed, but there's enough action to thrill and excite. If you came for intellectual stimulation, you will have to wait for after the film to enjoy that bit. During the movie, you will have to do little thinking. This is the kind of flick that inspires conversation after viewing. As the film runs, you simply have to sit back and enjoy. 9 is a wonderful movie. It's by no means, one for the ages, but it's a thought-provoking, heart pounding little flick, that can surely be enjoyed by any one who wants to try something, a little new.",
      "total_reactions": 1,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "I have to give 9 credit for having me great heart at its core, but I refuse to give it credit for much else. The voice acting, though better than terrible, was not convincing enough to make me truly care about the characters. Worse still, the characters, in particular 9, are of the type that good voice acting is needed in order to bring in sympathy for them. Therefore, the tragic and ultimately bittersweet story was touching only so much as its actual plot. However, this plot, despite its terrible pacing, is the movie's only saving grace, and the only reason I will not say it is not worth watching. Honestly though, if you are a fan of Tim Burton-style animation (Corpse Bride, The Nightmare Before Christmas), the visuals will probably be worth it by themselves, since they are quite impressive.",
      "total_reactions": 1,
      "user": "XavierBlaq"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "The story just seemed a little incomplete to me, it was one of those movies where when it ended you were like \"what, it's over?\" so that was one of the only complaints I had about it. Otherwise a great movie.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "I can't give \"9\" a 9, but it still is a rewarding movie that portrays lovely, grim visuals.",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "Dull story and soulless characters. Decent animation. This is a film that doesn't know if it wants to be a children's movie or a dark, adult mystery, so it chooses to be neither, and that is its biggest failing.",
      "total_reactions": 2,
      "user": "DeVr33z"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "The only reason I watched this movie in the first place was because of Tim Burton, and I'm being nice by saying it was horrible. One of the worst movies ever.",
      "total_reactions": 3,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Set in a post apocalyptic world where all life on Earth has been wiped out by machines, or rather one machine in particular. This film focuses on the efforts of a group of inventions, numbered 1 to 9, who try to redeem the scientist who made both them and the machine that destroyed the world. The machine has been dormant for many years, but one of its progeny, a mechanical cat-like creature protects its lair and takes anything that moves into itâ",
      "total_reactions": 1,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "A huge disappointment the trailers made it look better than it actually was, it turned out to be a boring mess with lame characters, the good things are that it was unique and could have been a good horror movie, but I still can't recommend it.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "I dont know whats wrong with this movie. At first watch I thought it was cool but the voices just ruin it for me. I love how they make the movies like this but the characters just didnt do it for me, thought the movie was just boring and I love animation type movies but maybe this one just feel off the radar for me.",
      "total_reactions": 1,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "An excellent animated film with a lot more depth than movies like UP or WALL-E, yet because of its adult themes/visuals and apparent older target audience, it subjects itself to greater scrutiny, and comparisons with more complex adult-apocolypse type films.",
      "total_reactions": 1,
      "user": "cmanthomas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Very well directed. The plot is very unique and \"9\" has great attention to details. The screenplay was simply fantastic. I would recommend this movie to almost all ages.",
      "total_reactions": 1,
      "user": "Paul2552"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "A stellar voice cast, and a truly amazing piece of work to look at. 9 portrays and incredibly bleak and desolate world through almost 'little big planet' PS3 game style sack people and their unfolding story.",
      "total_reactions": 0,
      "user": "StephenScott"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "The film may look good, but it plays out like cut scenes to a video game. The voice acting is decent, but it isn't really key to our plot, which is pretty thread bare. See this for the visuals, not for the content.",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Although 9 doesn't run for very long, and the plot may not seem there at times, it's still worth the time, with its visuals that are on par with Blue Sky and an amazing voice cast that includes Elijah Wood and John C. Reilly.",
      "total_reactions": 0,
      "user": "TheAnti360Fox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "My only complaint? It was far too short. A universe like this can't be contained in an hour and 12 minutes. I would have liked to have seen more expansion on certain characters who, as a direct result of the limited length, got only a few lines in before dying.",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 4,
      "text": "9 is an absolute mess of a film. Expanded from a short, 9 appears to have run out of ideas on how to expand on its original length and just tosses in filler. The end result is a poorly paced, poorly edited, and wholly disjointed mess of a film from beginning to end. The character development is poor at best and the film does an awful job of world building. All of this said though, the original premise is very good and the film does have its moments of brilliance. The animation is fantastic, as is the general look and feel of the film. I do wish 9 turned out better and the foundation is certainly there, but the film just lacks general cohesion and scenes just smash into one another. However, I did enjoy it a bit in spite of these faults and I do wish the film turned out better from any aspect aside from visuals and animation. Sadly, this is not the case and instead, 9 brings interesting visuals and an interesting postapocalyptic premise, yet falls apart when it runs out of ideas after the 20th minute.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "\"9\" is brilliant, gloomy, but short. In all honesty, I thought the movie could have been a bit longer. But, looking back, I now realize that it was a great movie and that there really wasn't any need for \"extra footage.\" The dark theme of the movie was really well put into the story. Plenty of \"Mild Horror\" kept the film going smoothly for the target audience. Though, plenty of disturbing images, it was still a nice, little, well put together movie that, ironically, receives a 9 from me.",
      "total_reactions": 0,
      "user": "SwitSwat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Action packed animation movie with decent voice-acting. But what really stands out is the post-apocalyptic and beautifully detailed environments. Nice and original story of grief, friendship and heroism. The grim style which 'll definitely show Tim Burton's cooperation works really well. The movie sometimes feels like a high-quality cut-scene from an action-RPG game but who cares! This movie 'll bring you 80 minutes of solid action and fun. I want to give this movie a 9 very badly but it's just not THAT good. Though without a doubt, this movie is a worthy contestant for being my favorite animation movie in years.",
      "total_reactions": 0,
      "user": "Paultergeist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Wonderful story line accompanied by gifted actors.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "This Movie touched me because of the story and setting and its a great movie to watch with a friend if he's a Tim Burton fan and from the inspired short from 2005 from the director and the all star cast you should see it for your self and if they make a prequel or sequel i would love to watch it.",
      "total_reactions": 0,
      "user": "gambit21xd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Man I got to tell ya it is so nice to see something different that has the intensity of a mature movie yet lies within the realm of the animated world. Every scene was beautifully done and you can literally hang every frame up on a wall if you so choose to. The story was great, the suspense was amazing. Who ever complained about it not having a story, tell that to the crowd I saw jumping every so often from the intense confrontations. What I also liked about it was the hidden parts of the story. They give you enough information to enjoy the film but yet you can extract more of the back ground thought that went into what we saw in the completed film. For the first time ever I saw half of the audience stay behind after the credits role to not just see who worked on the movie but to debate back and forth about what they thought of it, what the characters represented, what happen in this or that scene, and of course the animation style and technique and how it moved them. Never seen anyone ever do that after watching a movie.",
      "total_reactions": 0,
      "user": "morfil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "9 is one of those throwaway kid's movies that the kids never want to watch; it ends up being shown on a small TV in hospital ER's because they need some \"entertainment\" in there. The story, characters, and animation are all lacking; other similar movies trump \"9\" any day.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "It's a film that's not afraid to look at the big budget, happy and colourful blockbuster animation films and proudly announce its bleak pallet and constantly foreboding themes of loss and struggle with perfection.",
      "total_reactions": 0,
      "user": "Aijixe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "That's one surprisingly good movie.There is a lot of action and the story is original.The story is kinda dark and the characters are interesting even though they are stereotyped.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "Прекрасная атмосфера пост-апокалипсиса. Сюжет интересный, но его немного портят некоторые клише. Так же порадовало наличие морали, концовка довольно трогательная. Экшен, которого тут немало, очень крутой. Графика не Pixar, но на уровне. Практически абсолютный шедевр.",
      "total_reactions": 0,
      "user": "russiangamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "It's not everyday you see flick like 9 bring a incredible and unique performance to the table, it's animation was decent for time it was released and it's actors and actress gave great performances for their characters. The story really counted, if you had seen the original Oscar nominated short film, you'd understand what all really about.",
      "total_reactions": 0,
      "user": "Th3GreenHorne7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "9 is a 9 flipped upside down. 9 doesn't bring anything interesting, but it did bought us a nice story to look at over and over again. Looking for and at 9  and how you'll love 9 depends on your taste in opinions.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "Though lacking the complex narrative that some might hope for, Shane Acker's 9 has an incredible attention to detail, and its visual style is helpful when attracting viewers to its strange world.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2017
      },
      "score": 4,
      "text": "Etrange film d'animation avec ses petites créatures rigolotes plongées dans un monde post-apocalyptique où seuls les restes (ou presque) d'une guerre infernale ont survécu, c'est-à-dire les décombres...",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}