{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "A Christmas Carol",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 107,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I have heard the story of A Christmas Carol numerous times, but this adaption of the story is the greatest by far. It is darker than you would expect.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "\"A Christmas Carol\" is a exhilarating Christmas movie that  joyful remakes the original book into a marvelous interpretation.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "its way too dark and scary for kids, but to be fair, its not a bad movie. Jim Carrey and the other actors were decent and the visuals were good.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "This movie visually and script-wise is just a little too creepy to be a good adaptation of A Christmas Carol, although it does show some exceptional voice acting from Carey and Oldman.",
      "total_reactions": 3,
      "user": "CRL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "The story is a christmas classic and it sports amazing visuals, but the visuals seem to overwhelm the movie so it can be a bit tiresome and overlong.  2/4 stars.",
      "total_reactions": 1,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Excellent Animated retelling of the Dickens classic,The 3D Immerses you into the faithful recreation of Dickens's world,and travels you along at breakneck speed,a modern day Christmas Classic",
      "total_reactions": 0,
      "user": "Gareth1979"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "It was good. The 3D was 10/10 but I was bored at times.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I can sum this up in one short phrase: \"PG rated horror film.\" Let me make this clear, this is not a film for kids under 10, or really anyone that's easily frightened (or nauseated for that matter). I'm not saying it's a bad film, but this is not a film for small children. This adaption of the Christmas Carol captures and fleshes out the creepy parts of the tale, leaving the warm and fuzzy parts a little under cooked. The creepy take on this classic is unique, and enjoyable. It's the kind of film that can be enjoyed by a wider audience than if this story had been left to the generic fuzzy ending that so many films have adopted. The story sports more style than previous adaptions. More pizazz, more depth, and more scares. I won't lie, there were times when something startled me; this film is full of GOOD scares, not the silly excuse for jolts that are in so many kid's movies these days. Even though this movie is over two years old, and motion capture has gotten significantly better (Tintin, anyone?), the animation looks great. Everything is well detailed, and everything feels real. However, there's still some stiffness in the moving, and there's one dance scene where gravity and physics are defied so many times, there's no doubt that even kids (kids that can take the scares) will point them out. I mentioned earlier that this is like a PG rated horror film. I liked this unique aspect, but I thought you might like to know what's ahead of you: a pretty creepy scene where a talking corpse (in translucent ghost form) has a conversation with Scrooge, for one. The scene is surprisingly scary, and at one point, the corpse' jaw becomes disconnected when he screams. There's no gore, but it's pretty icky anyway. In addition to this, we see another corpse (it's played as a surprise for laughs), an old wrinkled head, a fat man who's skin blows off him like dust, and two vicious goblin creatures who are very reminiscent of Lord of the Rings. The score is appropriately Christmasy, but it's not outstanding. It does a good job of setting the mood of each scene, though, but I've heard much better Christmas scores. Jim Carrey does a hilarious job as Scrooge. He's grumpy and despicable, but because you recognize him as Carrey, you can't take him seriously. This isn't really a bad thing, but it might irritate die-hard Dickens fans. There's also one boring, tedious, and completely unnecessary chase scene, that makes little sense, which was most likely added for the benefit of any kids in the audience (who, as I've made a point of mentioning, are brave enough to take the scares). Also, the ending is incredibly corny (though we get the feeling that Carrey was overdoing it for his own entertainment), and little Timmy barely gets any mentioning. Overall, this is an entertaining flick and even though flawed, is a fun and creepy delight. I recommend this film to anyone who likes Jim Carrey, The Christmas Carol, motion capture, or the creeps.",
      "total_reactions": 0,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "The thing that astounded me about this movie was how faithful it was to the original book. That was something I did not expect. But this is one of the most faithful adaptations yet made, it even keeps the Dickensian dialog intact instead of updating it for modern ears, which is something even highly regarded versions have done. In fact aside from a poorly conceived action sequence near the end of the film, it is almost a word for word recreation of the book. Visually the movie is stunning, Dicken's London has been brought to life in a way never before seen. It is dark, atmospheric and captivating. The characters themselves are works of art, all beautifully brought to life by some brilliant motion capture and voice acting.",
      "total_reactions": 0,
      "user": "Commander_Jim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "In 3D version it looks very truthfully. Ebenezer Scrooge was egotist and after visit of ghost is very nice and friendly man. One of the best remakes of this book.",
      "total_reactions": 0,
      "user": "DBreez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Considering it's probably the most cinematically-adapted story in history, any new treatment of \"A Christmas Carol\" might easily be overlooked due to sheer exhaustion. By now, we've all got our favorite versions, and most of them really are pretty much the same. Still, Robert Zemeckis's high-flying rendition of Dickens' immortal tale is easily one to add to the list of seasonal viewings - it's colorful, it's wild, it's fun, it's heartfelt. There's several small things in this version - such as Scrooge walking in on the simile game at the end - that give it some strong marks in my book, and just the amount of fun Zemeckis has with the animation and story while still staying faithful gives it plenty of its own identity. Carrey's performance as the penny-pinching humbug is actually quite convincing, and is likely my second-favorite treatment of the character to date, and the design of the ghost of Christmas future is really cool and unique. It's just a lot of fun to watch, and a very solid treatment. What else can I say? God bless the Christmas Carols, every one.",
      "total_reactions": 0,
      "user": "WriteFilmLive21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "As much as I felt that 2009 was a great year for movies (mostly because of nostalgia. I was 11 and would always get excited for new movies in 2009), I've been finding that 2009 has been home to some insanely polarizing films, especially towards the end of the year. As I mentioned in my review mere hours ago, \"Where the Wild Things Are\" wowed me with its portrayal of childhood, but some people were either bored or weirded out by it. Fast forward less than a month later, and Disney has graced us with the motion-capture adaptation of the classic Charles Dickens book \"A Christmas Carol,\" yet another wildly polarizing film released in 2009. Some of us loved it for its visual splendor, acting and thrills, while some of us believed it to be a classic case of \"style over substance.\" As for me? Well, I'm in the former camp. I understand the \"style over substance\" argument, but I found that the film was entertaining, visually thrilling, well-acted and exciting to watch. Obviously, the film isn't for everyone, but it's still a great adventure and a worthy retelling of the classic Dickens story.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "A Christmas Carol is beautifully average.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Very nice film. There is a lot of special effects, some humor, some dramatization, and mostly old words in the 1500's. However there is always the same thing, the plot and story goes the same thing. Scrooge asked the present ghost about the little boy about death. The future ghost haunts Scrooge, no words. The past reminds Scrooge about his poor life (etc.). But, overall the film is good and Disney really done it. Great job!",
      "total_reactions": 0,
      "user": "wow560"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "i remember when i watch this movie in theatres the joy on my face was lighting like a Christmas tree, when i saw this  animated movie. Yes we have seen the same versions of the christmas carol remake movies over over over; But this movies stars Jim Carey as Scrooge who would enjoy that? also this movie is directed by Robert Zemeckis the guy who  brought us Back to the future trilogy, Forrest Gump , Polar Express and now this? Epic , This movie has a lot of heart amazing soul directing that zemeckis does when he directs animated feature to Charles Dicken's novel.",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Not a bad film by any means! One of the best takes on Charles Dickens' story that provides a slightly realistic touch with the amazing special effects. The acting is some of the best the Christmas films have ever seen.",
      "total_reactions": 0,
      "user": "DBPirate1129"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "A Christmas Carol was an amazing story ever told in the world, and when it has the domain of Robert Zemeckis , and its amazing 3D animation , good role of Jim Carrey, and also the movie but a bit boring , it's interesting.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    }
  ]
}