{
  "mc_avg_user_score": 4.6,
  "mc_metascore": 31,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "A Dark Truth",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "A self-serious eco-thriller assembled with a competent but heavy hand, A Dark Truth decries corporate corruption and Third World oppression in an all-too-obvious manner."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 40,
      "summary": "Interweaving clumsily staged action sequences with endless pontificating about evil mega-corporations privatizing public resources, the mediocre environmental-themed thriller A Dark Truth wears its good intentions on its sleeve."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 38,
      "summary": "A lightweight flick about a heavy-duty subject, A Dark Truth plays like a TV movie back in the days when TV wasn't worth watching."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "For all the attempted intrigue and mayhem, the film is dullsville, mired by a poky script, unremarkable action and, the hard-working Garcia aside, uninspired performances."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "The film's heart is in exactly the right place, but there's not a brain in its pretty little head."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 25,
      "summary": "A Dark Truth is one of those unfortunate projects whose component parts are immediately at odds with one another."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "I completely disagree with the few critics who have been cited in MetaCrtiic. \"A Dark Truth\" reminds me in a good way of the spy films and political thrillers of the '70s and '80s, without being heavy-handed. It does not feel like a television movie. What it does do successfully is force us to take seriously the water privatization issue. Why is it that so often in American cinema, when a film is actually about something that matters, and challenges the mainstream corporate-CIA narrative of good vs. evil, right vs. wrong, the critics or the public, or both, are reluctant to hear the message? The performances of Andy Garcia, Kim Coates and Deborah Kara Unger are noteworthy, though Forest Whitaker is somewhat lackluster in this role, as if he could not quite commit to the part. I give \"A Dark Truth\" high marks, as a capable thriller that is actually about something, and not just another shoot 'em up.",
      "total_reactions": 2,
      "user": "JordanElgrably"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "I'm only 13 minutes into A Dark Truth and I am already gagging on the anti-capitalist, Communist propaganda. Hollywood is in full \"we hate America\" mode these days. How sad. This movie even mentions \"change\" in the first 5 minutes. Barf. Hey Hollywood. You do understand after 5 years of Hope and Change Communism by the Democrats that today's US Labor force participation rate is LOWEST since 1979? You do understand that Communism has failed everywhere it's ever been tried on the face of the planet, don't you? Many Americans can no longer stomach the garbage that comes out of Hollywood these days. Get OUT of politics. Get back to making movies again, not Communist propaganda...",
      "total_reactions": 1,
      "user": "Patriot9811"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "Decent little film about evil corporate interests buying up the water in the world (it's really starting to happen). Most of the focus is on Andy Garcia & Forest Whitaker, and Deborah Kara Unger & Kim Coates (Kevin Durand is great in a supporting role). They play off of each other well, the plot has serious weight, and the single big action set-piece (near the end) has good tension and camera work (though the film is generally slow-moving until that point). Perhaps a little heavy-handed with its message, but still worth a watch because it highlights an issue (water rights) that I think not many people know or care about.",
      "total_reactions": 0,
      "user": "AbeMC"
    }
  ]
}