{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "A Glimpse Inside the Mind of Charles Swan III",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 14,
  "mc_pro_critic_reviews": [
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 67,
      "summary": "As the anticipated follow-up to Roman Coppola’s marvelous 2001 film “CQ,” this is something of a letdown, but as a breezy romp it could be far, far worse."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 67,
      "summary": "A film of surface pleasures, even joys, but those joys seem to be longing for a central idea around which to coalesce."
    },
    {
      "critic": "Joel Arnold",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "The moody picture even swings toward hopeful in its final minutes, as it tries to celebrate Charles as the man he is, faults and all. It's enough to leave you wondering whether even a glimpse inside this mind is too much."
    },
    {
      "critic": "Boyd van Hoeij",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Swan is more of a doodle than a fully formed idea, though not necessarily less enjoyable for it, since it was clearly intended to be an undisciplined, anything-goes kinda story."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "No less sweet for being unoriginal: A guy (Charlie Sheen) mourns a bad breakup with the woman he loves (Katheryn Winnick). The execution, on the other hand, is perilously self-absorbed."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The earnest passages mostly just lie there; the film works best on its frilly, exuberant surface, as a valentine to Streamline Moderne, Pop Art and L.A."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "As the film progresses, the actor fails to progress with it: As Charles Swan seems to become more aware of his loneliness, Charlie Sheen seems to become more protective of his Charlie Sheen–ness."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "All this eye candy is ultimately only about as engaging as watching kids at play, which is what Sheen and Schwartzman seem to be doing. I can’t argue that this isn’t an accurate glimpse inside some man’s mind — perhaps Austin Powers?"
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "With neither the moral bite of satire nor a voluptuary surrender that really basks in shallowness, this is a vague, unsatisfying work."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Fellini used to get away with such slender crises, but he had Marcello Mastrioanni behind the shades, as well as a more vivid penchant for psychosexual fantasy. Coppola and Swan are stuck in their obsessions with dorky album art and old-man cocktails at Musso & Frank. A precious, arid thing, Glimpse arrives pinned to Styrofoam like a prize arthropod."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "The actor/walking disaster known as Charlie Sheen gives a perfectly credible performance here. It’s the rest of the film that tries your patience."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "A Glimpse Inside the Mind of Charles Swan III is a curious mess, a movie that doesn’t really seem to have any reason to exist, other than maybe to give writer and director Roman Coppola and star Charlie Sheen something to do for a few weeks."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "For all its visual pizazz A Glimpse Inside the Mind of Charles Swan III has the jerky momentum of a collection of disconnected skits loosely thrown together with only the vaguest notion of where it’s heading or what it all means. At best it is a mildly diverting goof with a charmless lead performance. Its underlying misogyny leaves a sour taste."
    },
    {
      "critic": "Deborah Young",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 30,
      "summary": "With such an in-house cast of extended Coppola family sparklers, one would think things couldn’t go too wrong in the comedy department, but they have little chance to oil the wheels of a creaky script written around Sheen."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "That was probably writer-director Roman Coppola's main responsibility in \"Charles Swan,\" to give the audience a character worth watching. Get that right, and everything else falls into place. Get that wrong, and the audience finds out just how long 84 minutes can be. The answer: really long."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "A film is a terrible thing to waste. For Roman Coppola to waste one on A Glimpse Inside the Mind of Charles Swan III is a sad sight to behold. I'll go further. For Charlie Sheen to waste a role in it is also a great pity. I stop not: For Bill Murray to occupy his time in this dreck sandwich is a calamity."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 25,
      "summary": "So feeble it fails even as train-wreck exploitation. I’d be unkind, but not entirely inaccurate, to label Coppola’s sophomoric, er, sophomore effort as a director an offer you can refuse."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "The film speeds ahead with almost gleeful disinterest in dealing with the narrative challenges it sets up before resolving them in the most perfunctory ways imaginable."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 20,
      "summary": "Swan is so eager to be a trippy comic lark that it ends up resembling a clown trying to fit through a pea-shooter."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 20,
      "summary": "Seriously, this is one of the strangest and most painful films in recent memory."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "It isn’t a movie so much as a feature-length perfume commercial for a Charlie Sheen signature cologne with gorgeous packaging and absolutely nothing inside."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "The co-writer of Moonrise Kingdom and relative of one of the best directors ever (Francis Ford Coppola) disappoints everyone with this poorly directed and written comedy not to mention a terrible performance by Charlie Sheen. I expected more.",
      "total_reactions": 2,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "i was hoping this would be good but it was just a weird documentary on the life of Charlie Sheen which no one is interested in. Billy Murray i know you only do films because your pal Wes Anderson makes them but you should of sat this one out.",
      "total_reactions": 2,
      "user": "kyleazoney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "i thought it was amazing, really funny, heartfelt, and incredibly good to look at, those visuals are incredible, the cast does a good job, and i don't think i've laughed harder at crazy feminists flatout attacking charlie sheen...",
      "total_reactions": 1,
      "user": "emilypyre"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "i enjoyed this movie a lot, i still don't know why, but hell, i guess i'm a massive charlie sheen fanboy, it has a tasteful visual style, some good performances, and militarized feminists... need i say more?",
      "total_reactions": 3,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "this movie was a bust.  great cast, bad script, confusing, and not in a good way.  much more could have been done with this movie to have made it good at least.  better luck next time Roman",
      "total_reactions": 3,
      "user": "frankenstone420"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "This film has been flying under the radar and/or may be the target of a Charlie Sheen backlash. Either way, it's got a pretty good pedigree. Sheen plays a graphic designer who's suffering over a breakup. Bill Murray and Jason Schwartzman deliver amusing comic turns and director Roman Coppola gives the whole thing a lighthearted touch. This could have been called \"The Mind of Charlie Kaufman,\" because the flimsy narrative detours thru several fantasy sequences. Also, scenes end abruptly and a score by Liam Hayes often takes focus. This is a small, bouncy \"glimpse,\" but it not without charm and occasional humor. The closing \"credit\" scene is pretty cool.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 3,
      "user": "epicmorganguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "The script-writing was brilliant, the acting was solid, and this highly imaginative narrative told a story both fantastical and true-to-life. The visuals appeased my eyes and the unique characters spoke directly to me. Not to mention the film was funny as all-get-out.",
      "total_reactions": 1,
      "user": "BlakeWolfsSN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "If you want to watch this movie because of visionary director Roman Coppola, don't even bother. AGITMOCS is just time waste garbage. And yes this is a 84 min film. But 84 minutes can be this long and tiring.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "it's well acted, it looks good, it's strange, but it isn't too funny, i'm afraid, and it makes little sense, but it's a good night out if you're drunk, i'd recommend renting it and watching it with some friends, preferably wasted.",
      "total_reactions": 0,
      "user": "mickelwick"
    }
  ]
}