{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 20,
  "mc_mixed_rating_frequency": 39,
  "mc_movie_name": "A Haunted House",
  "mc_negative_rating_frequency": 52,
  "mc_positive_rating_frequency": 65,
  "mc_pro_critic_reviews": [
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 67,
      "summary": "If the result features around 1,783 too many fart gags, to be fair, it also boasts a couple of genuine minor scares. Although there's no doubt that the film's most horrible sight is a way-too-long shot of Swardson's naked rump."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 50,
      "summary": "The film similarly boxes itself in when it feels the need to mimic the third-act occurrences of \"Paranormal Activity\" when it's obvious that improv had the film going in an entirely less predictable direction, clearly pointing out the fallacy of A Haunted House: you can't parody something and also try to emulate it as well."
    },
    {
      "critic": "Emma Morgan",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The moments where you feel the cast are off-script and riffing are fun if not actually funny, but the most horrific thing on offer here is misogyny."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 33,
      "summary": "If the sluggishly paced, virtually laugh-free Haunted House is Wayans' conception of a passion-fueled labor of love, it's horrifying to ponder what he'd consider a mercenary cash-grab."
    },
    {
      "critic": "Sherilyn Connelly",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "Are the movie's half-dozen genuine laughs there just to tease the audience? What can we do to keep \"A Haunted House 2\" from happening?"
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "Too often settles for raunchiness instead of wit."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 30,
      "summary": "The hit-to-miss ratio is less than impressive throughout A Haunted House, a frenetic and freewheeling satirical comedy that only sporadically scores a bull's-eye while aiming at easy targets."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "For 85 rude and raunchy minutes, he does his best to drive a comical stake through the heart of horror's hottest franchise and the \"found footage\" genre.  He doesn't exactly succeed."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 25,
      "summary": "Never one to shrink from the challenge of parodying the already parodic, along comes Marlon Wayans to do in A Haunted House what he once did in \"Scary Movie.\" And do it much, much worse."
    },
    {
      "critic": "Joe Cunningham",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "Dreadful."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "This exceedingly lazy comedy is just the first of two \"Paranormal Activity\" parodies being crammed down our throats this year. The horror!"
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 20,
      "summary": "If the opening gag in your R-rated movie is an extended flatulence joke you should reconsider whether you're qualified to make such a movie. Not that flatulence jokes aren't funny; 8-year-olds love them. The thing is, not many 8-year-olds go to R-rated movies."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 12,
      "summary": "If you're wondering why A Haunted House exists alongside the upcoming Scary Movie 5 rather than instead of it, you may already have given the subject more thought than Marlon Wayans had hoped."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "summary": "No-holds-barred comedy is one thing, hurtful thoughtlessness is something else entirely. An ostensible comedy shouldn't have so many moments that feel so ugly."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "A Haunted House, its despicable bigotry aside, is also a not-very-good comedy."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "summary": "By eliminating the winking, broad strokes of the filmmakers' more successful spoofs, they've made a film that is not only dumb, but dull. It's like watching a snuff film, only it's the audience who's dying inside."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "The writers for this film put no effort and time into this script so I will do the same for my review. This movie is nothing but fart, poop, piss, racist and gay jokes. It is garbage. Plain and simple.",
      "total_reactions": 3,
      "user": "RalphsReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was terrible as i thought when i first time glance down on the poster.Not a single human been would laugh for this movie ,unless their brain damaged.This type of movies are insult to black community in  USA.",
      "total_reactions": 2,
      "user": "Smee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "I went into this movie expecting stupidity, but was hoping that there might be some comedic value to be found. Alas, I was disappointed. This movie just wasn't funny at all. Individually, I find many of the actors humorous if not even truly gifted in their approach to comedy, but this film just missed all the marks. Spoofs s a genre are getting more and more tiresome as filmmakers rely solely on gags and physical humor. Actually, I was offended by just how stupid Hollywood must think I am.",
      "total_reactions": 2,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "To be quite honest with you all I think 2/10 was generous. This film is a lost cause. I know it's a film parodying 'Paranormal Activity', but in some scenes it is basically just ripping it off completely without working up to a joke. A ridiculous film with absolutely no reason for making it other than money.",
      "total_reactions": 2,
      "user": "charlotteydwi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "This movie mistook vulgarity for humor.  It was nasty and disgusting.  Even when there was a laugh it was based on some silly premise such as a fart, or having sex with stuffed animals (yes really!).  Of all the movies I have seen the last 5 years this was the worst!",
      "total_reactions": 2,
      "user": "StarWatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Oh. My. God. I was prepared for this movie to be bad, but the enjoyable type of bad, that you can still laugh at. I could've written this script, and I have the comic wit of a paper towel. It starts off with Marlon's character humping two stuffed animals for probably over a minute straight. Then, there is a series of fart jokes followed by a maid going crazy and hitting people, and a grown man screaming like a little girl. Basically, it's all the things people under the age of five think is funny, except this is for adults. Nick Swardson comes in to unintentionally mock the entire homosexual community, in a way that is more offensive than if it were intentional. I wish I were making this up. I mean, they don't even make the effort to use cliche jokes that have used in every single sitcom since the 50's, like most bad comedies do. It's just a series of people doing stupid, over-the-top, things for a laugh; things that have all been done before, and weren't funny then either. I do have to say that the performances are generally pretty good. The actors do their best to revive a horrible script, but the best comedic actors of all time could not have saved this movie. Not good. Not good.",
      "total_reactions": 1,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Marlon Wayans needs to stop polluting the entertainment industry. This garbage is so rotten it makes me mad that there was a distributor that signed off on releasing this immature, worthless, incomprehensible, pile of dingo dung. Marlon, the next time you have the urge to film you and your friends' pet projects; upload the video to YouTube like the rest of us. For you to have thought a film of you and your friends messing around was so good that people should pay to see it requires severe detachment from reality.",
      "total_reactions": 1,
      "user": "lahonda_99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Sorry to say that this was not a good movie. It had funny moments but those were few and far between. It really could have been great. I'm really surprised this made it to theaters.",
      "total_reactions": 1,
      "user": "mizzhoney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "There's only one problem with this movie, it's horrible. So many fart gags and perverted jokes with almost zero laughs. I was really surprised that not even Marlon Wayans who did such a great job with the Scary Movie franchise could pull this off. It could have been hilarious but I only laughed like maybe twice in the whole runtime and both of those laughs came from Nick Swardson. What a major disappointment. Since their already going to make a sequel, I really hope they correct and improve the huge problems they had with this one.",
      "total_reactions": 1,
      "user": "mds03"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "I have only walked out of 4 movies in my life and this was one of them. It sucked.",
      "total_reactions": 8,
      "user": "60ish"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "\"A Haunted House\" (a [poor] parody of the \"Paranormal\" franchise) will only appeal to those with the most juvenile of humor, mainly for pre-teens which is odd since it's rated R. This film was a waste of my time, not recommended.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "There's really nothing *wrong* with this movie, it's just so recycled. It really relies on fart jokes too much and I really think it would work better as a series of SNL skits rather than a movie (seeing as the whole film is one unrelated skit after another). Better than the last 2 Scary Movies, and maybe that's cuz Wayans wasn't involved.",
      "total_reactions": 3,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Wow that was bad.",
      "total_reactions": 5,
      "user": "TheGeographer52"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "If you want a REAL good laugh - go and see this movie. I don't  understand why there are so many negative comments about this movie. It was made to poke some fun at the movie \"Paranormal Activity\" and they did a good job too. Only thing I would say - this movie is not appropriate for children under 17. I agree with Melinda -  when the DVD comes out I would definitely buy it... don't listen to the critics -  go and see it - you wont regret it!",
      "total_reactions": 16,
      "user": "GHeaden"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "I'm not really sure what people are expecting when going to see a \"scary movie\" parody starring Marlan Wayans.  If you can appreciate stupid humor and constant fart jokes this movie is absolutely hilarious...  I was a huge fan of the \"Scary Movie\" series especially the 2nd and 3rd one, and while this movie has a different feel then that franchise, it still managed to make me laugh uncontrollably for a good portion of the movie.  Yes, there were some parts where the writing was sub par but the critics reviews of this movie, like most comedies, is completely unfair. IF YOU LIKE TO LAUGH, GO SEE THIS!!",
      "total_reactions": 10,
      "user": "Anthony1010"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Don't listen to the \"expert\" movie critics trashing this movie. My gf and I went to see this over the weekend in a packed theater and the entire room was in hysterics. A hilarious movie that does exactly what the director and writers wanted it to do...make you laugh. Plus, it has a couple of scenes in it that will make you jump at first then laugh immediately after. Probably one of the better parody films to come out in recent memory.",
      "total_reactions": 7,
      "user": "DatHotness"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "this movie is funny crazy funny i laughed for a long time like the whole movie i havent seen a movie that made me laugh this hard in a long time watch it",
      "total_reactions": 4,
      "user": "MrThehammer171"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "I\"m stunned by the reviews this movie got. This was/is by far the funniest movie I've seen in a long time. If your looking for a good laugh mixed with a couple scary parts this is your movie. The whole theater was packed everyone was laughing the whole way thru. A must see. I will certainly be buying this movie when it comes out on DVD.",
      "total_reactions": 9,
      "user": "Melinda"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "By far the greatest movie I have ever watched. The plot was amazing, the characters were absolutely stunning and the jokes and script were flawless. This movie truly defines the generation of technology we live in and if you disagree you're gay.",
      "total_reactions": 14,
      "user": "DanMcMan"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "For what it was, it got a lot done right. It was funny and did a great job at making fun of cliche found footage movies. Was it stupid at times? Yes it was. Was it sloppy? Yes it was. However was it funny? Oh, yeah. It was.",
      "total_reactions": 5,
      "user": "TheGamingSofa"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "We rented this movie expecting to laugh and enjoy our movie night. I was so embarrassed and completely appalled by all the sex references. I made my teenagers leave the room. My husband should have read the contents first. We didn't even watch the entire movie. It was disturbing and not funny. The previews show all the funny parts. I usually like the Wayans' movies, but they went too far on this one.",
      "total_reactions": 5,
      "user": "DeeDub"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "\"Say what you will about me. A Haunted House was actually outrageously funny. That spoofs the genre almost perfectly. Marlon Waynes has crafted a worthy film to and It's that rare parody every ten or so years that actually works and makes you laugh.\"  B",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "This is a funny movie, with some hilarious scenes.  It is definitely stale and slow between jokes, but the comparison needs to be made to the travesty that is has become the Scary Movie franchise and similar \"satire\" films.  WAY better.",
      "total_reactions": 2,
      "user": "ScrawnyPunk"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Yes the movie is dumb but that was exactly what I was expecting. I definitely laughed a lot and there were even a couple of scares. I'm not saying anyone should rush out and see this movie but if you're looking for a good popcorn movi I'd recommend this one.",
      "total_reactions": 3,
      "user": "cdk222"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "This is not a movie that you watch because you want to watch a good movie - it's a movie you watch to laugh about with your friends. Of course, the acting is bad at times, the story is stupid, but it is hilarious, if you can appreciate the humour. Now, I fall right into the target audience of this movie - perhaps slightly immature high school kids who laugh at fart jokes. If you are someone who can appreciate a good fart joke, then you will enjoy this movie. Don't watch it because it's good, but watch it because it's fun.",
      "total_reactions": 4,
      "user": "Navelpluis1337"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "Surprisingly this film wasn't even as good as most of the Scary Movies. Like those films, this was yet another spoof comedy mocking one or more horror flicks. A Haunted House mostly was a spoof on Paranormal Activity. While there were certainly some funny parts and Marlon Wayans is his typical funny self, the movie was mostly just stupid, which was to be expected. What was disappointing was that none of the cameos were all that funny. Cedric the Entertainer was stupid and Nick Swardson was too gay.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "its about an average move lol I would give it a 5.5 but metacritic doesn't have that score lol overall though haunted house was not a bad movie; I got a couple laughs in this movie, here and there and I did laugh heartily a good couple times; for the most part though about a good half of the jokes failed; I was expecting more out of this movie since the wayans were in this but yeahhh it didn't live up to the hype; maybe it was cause keenan wayans didn't direct this or maybe it was cause shawn wayans wasn't in this but all in all this movie lost some of the magic wayans films are known for; I would say though that I did get entertainment out of this movie and I really I would say this film is worth it if youre watching it for free and didn't pay 20 bucks at the theatre; if you are planning on paying for it welllll theeenn, lets just hope youre rich lol",
      "total_reactions": 1,
      "user": "Orangeknockout"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Interesting to have both this and Scary Movie 5 come out around the same time and be pretty much the same movie, but I must admit I think these guys did it just a tad better. There are less pop culture refrences and it focuses more on the paranormal stuff which is what it should be doing. Some of the jokes miss the mark but not too many as some are also very funny. I wasn't expecting much from it but was pleasantly surprised when watching it so I think its at least worth checking out!",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "A really good movie and so underrated delivers good time, laughs and a look a other horror movies all in one!",
      "total_reactions": 2,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "This movie was meant to make fun of paranormal activity not win an academy award. It was funny for the most part but did get sloppy at times. Overall this movie is hilarious and is worth going to theaters to see.",
      "total_reactions": 5,
      "user": "starz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "A movie to watch with friends. The plot is obviously not much, but every scene in the film makes you laugh a lot. Can be considered a worthy successor to Scary Movie",
      "total_reactions": 3,
      "user": "Wincenty8"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "This movie has some great  moments, no doubt. However, intellectuals might find some of the humor not up to standard. It's very crude at times. It's definitely a movie that should be watched with friends that you feel comfortable around. **wouldn't take a date out to this one, fellas.  The acting was great. Every character had distinct personalities. There were some parts that were just crude, not funny, akward moments (apparently they were supposed to be funny, but the theatre rejected to laugh) assuming that it was a missed target by the story line. Overall, it was worth the watch.",
      "total_reactions": 1,
      "user": "killerbee41895"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Movie was surprisingly funny but overlong.  Cut out the last 30 minutes and it was a laugh riot with some very clever bits.  Unfortunately, it begins to fall apart with the overlong ending and the decidedly unfunny overtop performance by Cedric the Entertainer.",
      "total_reactions": 2,
      "user": "mehki"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I literally went in to see Essence because I love her and she is one of the funniest female black women alive and one of the funniest to me ever. Also because it looks better then Paranormal Activity. This film was touch and go. Little to outrageous but its made by the Waynes brothers. The funny outrageous guys. I loved Essence she was funny as hell. The male lead was touch and go. I do say this was better then all the Paranormal Activity films and the paranormal films just completely. I dont see anything scary about ghost, bumbs, things falling over. I say watch this with your friends, mainly focus on Essence and The Big Black Priest guy person he was funny just them and you'll laugh.",
      "total_reactions": 1,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "The most fun movie i watch this year. Wayans do a much better than scary movie. Not only for his fun but for all to love great comedy. Its hilarious. I lough like baby",
      "total_reactions": 3,
      "user": "JanPOl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "A Haunted House is a lot like the Scary Movie series in that it's a comedy spoofs various horror movies. In this case the \"found footage\"  horror films like Paranormal Activity and [Rec].  It can be very funny at times, downright hilarious at others. It's immature like you would not believe because it's jokes are all sex and fart related, but it still provides MANY laughs. However there are times in this movie when they take their sex related humor too far, to the point where it pushes the line of good taste WAY farther than it should (rape isn't funny people). But in the end the humor manages to keep itself up and keep you entertained even when the vulgarity reaches some insanely unfunny and downright sickening levels.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "The first half of the movie wasn't all that funny but the second half was an improvement and actually made up for the time I put into it. A few solid chuckles but no real burst out laughing moments. It's a parody but it's not a parody. It does parody the first Paranormal Activity film with the plot but other then that, It's an \"original\" comedy. Most of the scenes were improvised, that is pretty obvious, and were not all that fun. The constant run on jokes (such as the swinger couple) were not funny and actually got pretty annoying. Overall, It was an ok movie. Worth checking out if you like films like Scary Movie but other then that, I wouldn't recommend it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "One of the most unfunny and offensive movies I have ever seen. There is NOTHING of value here. Go see one of the Scary Movies not this garbage-fest. Or hell, go watch GARBAGE DAY on youtube a gajillion times more entertaining than this crapola. Also apparently they're making a second one slated for next year ALREADY. Is the world coming to an end? WHO WATCHES THIS!!??? WHY!!!??? AAAAAAAAAAAHHH!",
      "total_reactions": 0,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "What's with the bad reviews?! this is a funny movie, it's a parody (not meant to relate to the original video). showed this movie to 10 of my friends, and they laughed",
      "total_reactions": 0,
      "user": "gunboss201"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "\"A Haunted House\" lacked a sustaining gag factor. The entire movie was extremely lackluster that each comedic moment only jolted me out from falling asleep.",
      "total_reactions": 0,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Pointless and not funny at all. A Haunted House is ridiculously crass and 90% of the jokes could be thought up by a 9 year old (with a very dirty mind). However it is slightly better than the similar Scary Movie 5.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "It isn't a terrible movie but it sure isn't the next big mark in the history of movies, its just a passing film made for a low profit for different minded people. It had more dumb jokes over clever ones but it really matters on the viewer, 50% enjoy the idiocy and the other 50 chuckles beneath the references of modern-whatever. Have a spare twenty bucks lying around? Go check this movie out  Then either spam Facebook with how \"awesome\" the movie was or gloat in disappointment of wasted paper bills and spare change.",
      "total_reactions": 0,
      "user": "SecondSentry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "These films need to stop being made.  There is nothing funny here just more fart jokes and wow I had sex with a ghost jokes which we've seen in every Scary Movie.  Speaking of that I can't wait to see Scary Movie 5.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This is literally the best comedy movie I've ever watched. If you have an incredibly immature sense of humor, watch this movie. It's amazing. No flaws.",
      "total_reactions": 0,
      "user": "FladeIsCool"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "This film was wayyyyyy better than all Scary movies. Though it's stupid it is really funny and entertaining. Seriously (for the bad reviews) when you watch a film like that you know that there is not going to be some good quality. You will laugh at this movie like you've never did. If you like scary movie, epic movie etc.. You will like it. I hope the sequel is as good as this one. What was a suprise for me was that it actually only talked about paranormal activity and the devil inside. I can say that i liked very much and if you want to laugh that's good stuff",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "The worst kind of comedy. Appalling, Grotesque and plain immature. Just not funny. The people in charge of this movie need to grow up and realize that vulgarity just doesn't get laughs anymore. On par with  Scary movie v   Which also got bad reviews. This movie is a classic example of bad comedy.",
      "total_reactions": 0,
      "user": "Garrusex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "One can argue that this is a stupid, badly-acted horror movie cliché movie, but you have to admit it provides some good laughs, as well as some inappropriate scenes that add shock value.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "What to say about this one, hmmmm. I knew it was to good to be true that a brand new BluRay was $14.99. It didn't disappoint. Donating it to the library in the morning.",
      "total_reactions": 0,
      "user": "marcleach75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "This film was funny and entertaining. If you were offended by anything other than what happened to the male lead, I suggest you analyze yourself. It was made to show what this couple would do versus the typical couple often found in these situations. I couldn't stop laughing. My Irish husband couldn't either. I cannot wait to see what movies they parody in the sequel. My vote is: keep 'em coming. Especially since there isn't much to pick from in Hollywood since the early 2000's. Btw, I am not just a movie watcher, I also make them. Put yourselves in others' shoes.",
      "total_reactions": 0,
      "user": "Freakyarcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "could be better,  but its pretty funny. kids b/w ages of middle school and early college would love this. If you liked In Living Color, then you'll like this",
      "total_reactions": 0,
      "user": "DemonSoul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Ok, now I understand that the Wayans brothers like to make parodies out of movies but sometimes, they need to know that it was a step too far. That's exactly what happened in this film.",
      "total_reactions": 0,
      "user": "rafingal23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "The best paranormal activity spoof I have ever seen. There are a few boring parts but its mostly just laugh after laugh. Don't go into this movie expecting a oscar winning performance. You CAN expect tons of rude, racist, yet hilarious humor and the story ain't too shabby!",
      "total_reactions": 0,
      "user": "mishabridun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "A Haunted House really isn't even a spoof film, it only sets itself up in a horror movie spoof setting, and then makes its own stupid jokes. Seriously, the jokes and writing don't use the horror element to make it funny, but just use dumb gags. There isn't much more to say.",
      "total_reactions": 0,
      "user": "MattG_123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "There were a few good scenes in this film, and the overall film plot was under average. Apart from that, the other scenes in this film were very boring, and constantly rely on sex as humour.",
      "total_reactions": 0,
      "user": "PolisKanin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "You have to give \"A haunted house\" a chance because for me, it;s a film that gets funnier as it progresses.",
      "total_reactions": 0,
      "user": "boy_number_8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "this movie is a like one of the best horror comedy  ever . Marlon Wayans is freaking funny in this film i had a quite a good laugh in this film . here's the bad news  this film tries to be like scary movie and there copying some of it they try to have cameras   just like scary movie 5 and paranormal activity . but still it is enjoyable to watch . if you do not  like it screw you but this is a good comedy for 17 and up .  also i  can not wait to see a haunted house 2 .",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "A Haunted House es una película que se burla de varias películas de terror, tales como The Blair With Project, Paranormal Activity (en teoría, de cuatro), The Devil Inside y The Last Exorcism.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "There is too much fart jokes and this s not one of the greatest parody I have ever seen but the acting was not so bad and the movie was watchable even if the scenario was not so good.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "Sadly, there are a million spoof movies and almost 5% of them are reasonable to watch, granted you are a sensible person.  But this movie is what it is, a silly spoof. What makes it better is it is not DIRECTLY taking parts from other movies and shooting them out as fast as possible, like most spoofs after Scary Movie.",
      "total_reactions": 0,
      "user": "BeingNickDoh"
    }
  ]
}