{
  "mc_avg_user_score": 3.8,
  "mc_metascore": 17,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "A Haunted House 2",
  "mc_negative_rating_frequency": 57,
  "mc_positive_rating_frequency": 27,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "This send-up of current horror movies is a go-for-broke hoot, a hot mess of a comedy that doesn’t have a lick of sense. And knowing that going in adds to the often knee-slapping laughs."
    },
    {
      "critic": "Martin Tsai",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Some instances of impiousness work better than others."
    },
    {
      "critic": "Sherilyn Connelly",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "It may be a low bar, but Michael Tiddes's A Haunted House 2 is actually an improvement over its predecessor."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "The outcome is usually fairly tiresome, but on occasion reaches levels of moderate originality."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "There are lulls to be had here, but there is a smattering of laughs, too -- and some pretty good ones, at that. If, that is, you'll give yourself permission to laugh at Wayans and company's lowest-common-denominator antics."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 33,
      "summary": "However rubbery and manic, though, A Haunted House 2 still can’t overcome star attraction Marlon Wayans’ severely limited comic skill set."
    },
    {
      "critic": "Stephan Lee",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "You don't walk into a movie like A Haunted House 2 expecting anything remotely scary or serious, but you don't expect to walk out feeling a terrible sense of dread, either."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "A Haunted House 2 is not a movie. It is a nervous breakdown."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "If A Haunted House 2 is a step up from the previous go-round, it's either because a slightly more talented crew of comic actors are being asked to waste their time or because 2013 offered a better crop of horror films (“The Conjuring,” “Sinister,” etc.) to be lazily parodied."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "It’s certainly likely to be among the worst movies in wide release this year, but it’s far from the most hateable, and that should count for something."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 12,
      "summary": "A Haunted House 2 tones down the gay jokes but ups the streak of animal cruelty."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "summary": "Like sunrise over a steaming pile of garbage, A Haunted House 2 offers another sharp whiff of its predecessor, a Scary Movie-style spoof of the Paranormal Activity movies that makes up in volume what it lacks in invention."
    },
    {
      "critic": "Jenni Miller",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "summary": "In the running for worst film of the year... and it's only April."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "summary": "Already the franchise displays a sputtering exhaustion."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "summary": "Definitely exceeds expectations, but in the worst way possible."
    },
    {
      "critic": "John Semley",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "summary": "A Haunted House 2 is so dreadful that it demands its own category of dumbness."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Completely irreverent and mostly unfunny, A Haunted House 2 is a slight improvement on its predecessor, but is still a complete waste of time that fails to conjure more than a few guilty chuckles.",
      "total_reactions": 2,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "These films are always awful.. albeit not as awful as the those other two unmentionable 'spoof writers' (both words I use loosely) totally unfunny, nasty-edged (out of jealousy) laugh-free cringe-fests.... but YOU the public watch them... SO they make them. The first, like this sequel will, made thirty times its budget. It's mathematics. Smart people should just be thankful these types of comedies exist... in case they are incredibly stoned and stumble across it on tv in four year's time or if you just want to be reminded you are not a total moron.",
      "total_reactions": 2,
      "user": "NZCricketFan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "Now I will admit, much to my shame, that..to an extent, I did enjoy (moderately) last year's sleeper hit parody, \"A Haunted House\" from creator Marlon Waynes. For one, I saw the film initially with my two best friends, and believe me when you are with your friends anything can seem hilarious. Upon a second viewing at home, well.. let's just say, I wasn't as fond the second time around.",
      "total_reactions": 3,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "God it sucked. A Haunted House 2 was a piece of atrocious, dimwit, unfunny filmmaking. The first one sucked and so does the second one. Gosh  I thought that this would be funny, if not, just plain fun. But no, poor writing, screenplay, gags, directing, action, action was all poor. Don't go to watch this one.",
      "total_reactions": 19,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "I'm amazed this got a sequel, the first one sucked so bad that I quit midmovie. I didn't even think for a moment for a sequel yet NOW it comes. The irony is that the movie is a haunted house itself. I hope the 3rd movie comes out for our sake.",
      "total_reactions": 2,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Ya this is not The Conjuring this A Haunted House 2 ! Starring Marlon Waynes and Annabelle the Doll plus bagool from Sinister and a possessed girlfriend? I laughed throughout this movie and I mildly enjoyed it, but still it is a cinematic abomination.",
      "total_reactions": 2,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is ridiculous, wasted money ! Don't watch it w your kids - stupid sexual content.",
      "total_reactions": 2,
      "user": "Kimbo68"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "A haunted house 2 parodied Conjuring which is the best horror movie ever so as sinister . this movie bored me to death just like the lego movie. comedy was not good as the first one . this movie sucked major",
      "total_reactions": 4,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I really enjoy Marion wayans acting. He is probably my favorite male actor. It's a good sequel to a funny movie. I recommend you see the first before this one.",
      "total_reactions": 18,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "If you're going to sit through A Haunted House 2 [or any kind of parody movie like this one] and actually enjoy it, you're going to have to be the kind of person with a sense of humor that's not too sophisticated. That being said, you also must have the ability to live a little, know what's going on in the world around you, and laugh at what most people would consider incredibly stupid. Fortunately for Marlon Wayans, this formula has worked for me since the original Scary Movie, and still works like a charm to this day.",
      "total_reactions": 9,
      "user": "thatSTERLINkid"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Within the first 18 minutes of the film there were 5 sex scenes. 10/10",
      "total_reactions": 5,
      "user": "PolisKanin"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Funny movie. I watched it, loved it!!!!!!!! The way of acting was so funny. Its more like a mixture of horror and comedy. Despite the very low rating (1.7), this movie isn't that bad at all. Just watch it.",
      "total_reactions": 7,
      "user": "ZombieVR"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "This has to be the worst movie I've ever seen. Not only did it lack humor, it was also the most boring **** to sit through. I myself am a huge fan of movies and this is just terrible 10/10",
      "total_reactions": 17,
      "user": "Timurbek324"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "There are certain aspects of it that are an improvement. The sexual humor is still outrageous, but it thankfully never reaches the disgusting and downright disturbing levels the first movie did. The trade off is that the racist humor has been cranked up to 10. It's not a great trade off, but it's the only improvement this sequel makes.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "I think the main reason I like the Haunted House series so much is because Marlon Wayans knows it's a parody film so why take it seriously? If you enjoyed the Scary Movie series and other films like it then you will like A Haunted House 1 and 2 just as much. It's just mindless fun. Gotta love people who bash it and yet praise these crappy animated films that featured the same recycled plot over and over again. Anyways, Here are my thoughts on it.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "its seems all people have lost a sense a humor perhaps? this movie was hilarious. i don't care what anyone said. if you would like a good time of laughs and fun with friends then a haunted house 2 is a good one to watch. The Wayans have always been comedic geniuses and Marlyon is freaking hilarious. if you have always been a fan then you will love this movie just like me.",
      "total_reactions": 1,
      "user": "TheShaman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "It's official, the spoof genre is dead, gone. Can't come back, can't be funny. What a shame.",
      "total_reactions": 1,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is very entertaining and doesn't take itself too seriously.",
      "total_reactions": 1,
      "user": "deepgoogledream"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "A Haunted House 2, pese a ser mejor que su predecesora, también comete los mismo errores que tuvo la pasada entrega, volviéndose terriblemente estúpida por perderse en su insignificante comedia negra.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "A Haunted House 2 looked funny, but when I watched it there was nothing funny I hadn't seen before in the trailers for it. It was actually terrible, and Jaime Pressly is terrible in it.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "A Haunted House 2 is a 2014 American comedy horror film directed by Michael Tiddes and starring Marlon Wayans. The film is the sequel to the 2013 film A Haunted House. Produced by IM Global Octane and distributed by Open Road Films.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "This movie was **** atrocious. Whoever watched this movie and enjoyed it is a drooling moron. There was nothing funny, nothing creative, it was just awful. Though it was better than Scary Movie 5.",
      "total_reactions": 0,
      "user": "PyongyangMayor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "What in the name of the world did we humans to deserve this pile of crap. Ok to start things off basically the beginning is the same as A Haunted House. This movie did make me laugh a couple times but I didn't laugh so hard it was just a chuckle. This was the worst film on 2014 next to Earth to Echo. If A Haunted House 3 or Scary Movie 6 comes out I'm done, that may sound extreme but these should stop. Who wants to watch Marlyon Wayons hump an Annabelle doll for 2 minutes. Don't watch this movie even if you are trashed. A Haunted House 2 is a huge mess splattered with utter horse ****",
      "total_reactions": 0,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "Marlon wayans' attempts at comedy in HH2 might have been acceptable if it was a YouTube video or something, but calling this a movie and expecting people to go spend money on it is an insult to all movie-goers. It had a couple chuckle worthy moments but I found myself too frustrated to laugh because of all the annoying forced \"humor\" that surrounded it.",
      "total_reactions": 0,
      "user": "JasoncLong93"
    }
  ]
}