{
  "mc_avg_user_score": 4.6,
  "mc_metascore": 14,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "A Little Bit of Heaven",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 11,
  "mc_pro_critic_reviews": [
    {
      "critic": "Emma Dibdin",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "While the marriage of fluffy comedy and terminal illness was always going to be an uncomfortable one, this is an understated, genuinely poignant weepie bolstered by a top-drawer cast."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "You should know right up front that even if you realize you're being manipulated you are probably going to weep anyway."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "What's missing is honesty. It has been supplanted by artifice."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 45,
      "summary": "The tiniest bit of Hudson's wrinkly-crinkly cuteness goes a long way, and in A Little Bit of Heaven, watching her waste away becomes slow torture. She's like an adorbs Camille."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 30,
      "summary": "The movie perks up during Dinklage's scene as an escort, and screeches to a painful halt for a few conversations with God, who's played by a cloud-roosting Whoopi Goldberg. In a sophomore letdown from \"The Woodsman,\" director Nicole Kassell gives the film no energy or rhythm, while the script pushes all the pre-set buttons."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "In the long history of bad movies about bad illnesses, A Little Bit of Heaven just might be the worst."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "Unsurprisingly for a film detailing terminal disease, this is a largely solemn affair, often verging on morbidity in its elongated deathwatch."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "Bravely or stupidly, both A Little Bit Of Heaven and its heroine charge on as if the introduction of terminal cancer didn't change things that much."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 20,
      "summary": "An awkward mixture of melodrama and whimsical romantic comedy that should make the briefest of appearances in theaters before, like its main character, moving on to other planes. It might serve a valuable purpose if it at least prompts viewers to finally schedule those long delayed colonoscopies."
    },
    {
      "critic": "Mary Elizabeth Williams",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 20,
      "summary": "A moment of silence, please, for Kate Hudson's career."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 20,
      "summary": "There is nothing the slightest bit heavenly about this project, which is wrong-headed in just about every department."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 20,
      "summary": "Cringeworthy feel-good weepie, which finds Kate Hudson's vivacious ad-pitch whiz questioning her life choices after being diagnosed with terminal colon cancer."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 20,
      "summary": "An only fitfully convincing Hudson leads a strong-on-paper cast, but most of the actors look uncomfortable here, particularly Gael Garcia Bernal as her love interest."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2012
      },
      "score": 20,
      "summary": "This film is one long biopsy of pure horror: the tumours of sentimentality and bad acting metastasise everywhere, and Bernal, in particular, is horrendously bad."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 16,
      "summary": "Terminal colon cancer has never looked more fetching than in the critically ill romantic-disease comedy A Little Bit of Heaven."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "summary": "A Little Bit of Heaven demands miracles of its cast to keep proceedings from becoming grindingly mawkish and does not get them."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "summary": "Droolingly stupid weepie. Useful tip: The movie dies way quicker than she does."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "summary": "With the abysmal A Little Bit of Heaven, Kate Hudson's possibly unprecedented losing streak remains unbroken: She hasn't made a good movie since Almost Famous, 12 long years ago. Even Nicolas Cage can't say that."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "summary": "A cringe-inducing romantic comedy turned cancer tragedy turned inspirational hosanna about living in the moment, embracing your bliss and other clichés."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "summary": "As far as director Nicole Kassell and writer Gren Wells are concerned, the C in Big C must stand for cute. The film reaches into the pits of moviegoing hell when it finds Marley on a celestial white couch, ringed in billowing white curtains, communing with God. And God is embodied by Whoopi Goldberg."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "This things happen when you have a terrible idea, with a terrible director, and no great cast, A Little Bit of Heaven, is horrible, really, I like this type of movies, but this is awful. The performances of all the cast are stupid, the story boring and more, this movie is HORRIBLE!!",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Yes, this is a bad movie, though out of all the stinkers out there, I am not sure why this should merit the lowest score of anything currently in release. It fails in many ways, but is not so obviously bad at any one point that it made me finally give it up. It's just that when there's such famous actors involved on such a weighty subject, you really expect more. There is no chemistry in the leads, there is no consistency in the actions, it isn't funny (when it tries), it never develops momentum. It also seems odd to have a terminal patient feeling energetic enough to energetically do whatever they want with smiles and laughter so close to death. That aspect finally rings so untrue, I began to wonder how much better it would be to have the script and actors facing some more serious symptoms. When you find yourself wishing for more bad things to happen to a character in a film, that's a bad sign.",
      "total_reactions": 1,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "what can i say? its only the greatest mvie ever! seriously, if you love anythign with quality, then you'll absolutely adore this! it's just amazing!!!",
      "total_reactions": 6,
      "user": "1956403859"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "Kathy Bates Saves The Movie From Getting A 1 From Critics...",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "It was an excellent movie! Was a real tear jerker for me yet funny! I recommend this movie and will watch it again! I can relate with being angry with someone you love dying and there is nothing you can do to stop it! And it's hard to be happy in your life knowing someone you love so much it being taken away!!!  I give this movie a 10!!!!",
      "total_reactions": 0,
      "user": "Amy_46809"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "My wife liked this movie. That means it was bad. I hate to agree with evil left wing lunatics like those at Rolling Stoned but this movie was bad. Have I mentioned how bad this movie was? It's as bad as the current president. Wait, the credits at the end were great because that meant the movie was finally over...",
      "total_reactions": 0,
      "user": "stopthemadness"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "I'm entirely shocked by some of these reviews... I felt that this movie was incredible. It is a story of a woman who learns unfortunate information and uses humor in serious/uncomfortable situation(s). Whoopi Goldberg was a perfect \"God\" for Hudson's character, Marley. They are a perfect fit! I was extremely moved by the Bernal's performance of Dr. Goldstein, Punch's performance of Marley's friend, Sarah, etc...  I found this story very moving and personally life changing as I feel a connection with Marley. Furthermore, I now know that I will be having a Celebration of Life when my life here comes to a halt. I recommend this movie to all.",
      "total_reactions": 0,
      "user": "Littlemarms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Im surprised about the bad critics and low ranking. This is one of my favourit movie ever. It makes me cry every time I watch it. Its a deep theme that makes me think about everything Im doing with my life and how I wish things were different, so when i die I dont feel sorry for the things I haven't lived. 100% recommended.",
      "total_reactions": 0,
      "user": "LadyJesse"
    }
  ]
}