{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "A Perfect Getaway",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 55,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "For such a slow movie, 3/4 of the film really got me into this movie. There was alot of talking going on, but there was that suspence if the main characters were with the killers. This actually worked, but the movie fell apart for me. When they had the twist at the end.",
      "total_reactions": 1,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Ok, so it's not exactly a normal horror film. As a matter of fact it isn't really scary. But this film works well and produces some epic relentless action in the final 30 minutes. It takes a while to get started, but this prologue works because by the time all hell broke loose I actually cared that these characters survived. The twist isn't even as important as one makes it out to be. The film is about two unknown killers; the whole point was to determine who these killers were. That was what happened. The performances by Steve Zahn (especially during the final 30 minutes) and Olyphant are pretty good.",
      "total_reactions": 0,
      "user": "gvk123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "This movie was quite the thriller. I'm pretty uncertain if i like the twist or not, but let me tell ya, its very effective. All of the actors/actresses really did quite well. Although this plot was unoriginal, with the twist added and the execution, it came out to be the quality thriller.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Milla Jovovich.",
      "total_reactions": 0,
      "user": "VGabriele"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "This movie is good. I watch this movie so many time and i still love it. I think every one should watch this movie.his movie was surprisingly good. I love thriller movies like this. You think you know but you really don't. I think this is a must see movie. Good movie to have on blu ray and DVD. Good to add to your movie collection. i like that this movie had action thriller and some drama in it. And I like all the twist to the movie. A really good screenplay",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The first hour of this movie is pretty slow but the second half of this movie is jam packed and very interesting \"you have no idea who will live and who will die\" kind of movie best I've seen in a while.",
      "total_reactions": 0,
      "user": "lizz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Good suspense is the one where everything is shown to the viewer and only in the end he will understand how all these pieces fit together. Already fake suspense like this, cheat, and omits important scenes dialogues plant inaccurate and false. So much so that in its outcome, the director David Twohy had to do just a short cut to explain where the killers came from, and only then, showed cut scenes to circumvent the reasoning of the public. Itâ",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "I recently had a discussion about Milla Jovovich with several other film fanatics and whether or not she has a place in Hollywood after churning out quite a large volume of bad movies. I argued that her roles in films like The Fifth Element, Stone and even her minuscule part in Zoolander made up for all the bad. Many did not agree. However I find myself reaching the precipice. I understand that Jovovich loves cult material, hence her participation in the horrendous Ultraviolet, and B movie throwbacks but by this point she should at least be able to tell the difference between bad cult movies and good ones. A Perfect Getaway acts as a throwback to the B movie horror films of yesteryear but does so in a way void of both reason and logic. The plot is to put it bluntly, stupid. The film relies on pointing out film cliches like 'the red herring' to hide the fact the films red herring (you will know it when you see it) is incredibly simple minded. The dialogue between the characters however is actually quite good, the relationships built in the film feel real which says a lot in a film that is absent a coherent story. The cast is respectable with a few surprisingly good performances (Kiele Sanchez, Timothy Olyphant). However the use of both Chris Hemsworth and Marley Shelton for such small performances seems like a waste of potential. Milla Jovovich has the best character to work with but she never really takes advantage. The weak link is Steve  Zahn who's straight laced screenwriter character grates making him a dreadful lead considering most of the film follows him. The direction (by Pitch Black's David Twohy) is acceptable but never surprising or anything more than what is required. It is a soul crushingly mundane movie that never lives up to the B movies it is trying to emulate.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "This is not a bad movie, however the big twist wasn't such a surprise. It was actually really good and seemed like something different until the the last 45 minutes or so, then it got a bit more clique. Overall, fairly entertaining and worth the time.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "The plot cheats on the viewer. It is very easy to write a thriller with such a tricky and twisted argument. Kind of a movie for people who is not expecting anything but some cheap fights, suspense music and out of the hat plot answers",
      "total_reactions": 0,
      "user": "seoirse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Storyline very superficial, artificial. Dont make sense.",
      "total_reactions": 0,
      "user": "voiders"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Mystifying, A Perfect Getaway is perhaps \"a must-see\". A couple go on an adventure and discover terrible news about the strangers they meet. I enjoyed watching A Perfect Getaway. This movie was good! It has a twist at the end.",
      "total_reactions": 0,
      "user": "umOHum"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "The actors were really good and the story about a couple who meets another one who can be killers is original.The twist was predictable but the movie was effective and thats the important.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "A Perfect Getaway: 7 out of 10: For a slow moving thriller that cheats… a little, A Perfect Getaway isn't that bad. It has gorgeous cinematography and while it moves slowly, it successfully builds up tension with character development rather than relying on black cats jumping out of closets or severed body parts every ten minutes.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "A great little psychological thriller that will keep you guessing until the end.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}