{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 79,
  "mc_mixed_rating_frequency": 49,
  "mc_movie_name": "A Serious Man",
  "mc_negative_rating_frequency": 54,
  "mc_positive_rating_frequency": 165,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "What the Coen Bros created here is creative humor and the sad, grim realism of a everyday life of \"A Serious Man\". As expected, the movie will not fail you.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Another funny and excellent film from the Coens, who show off their terrific sense of Americana and memorable characters in this little gem. \"A Serious Man\" is sadly underrated and underappreciated, and I can only hope that it blossoms into a cult classic like several of their other films, namely \"Barton Fink\" and \"The Big Lebowski\".",
      "total_reactions": 2,
      "user": "nboley08"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This is actually a good movie. I like the dark humor and especially the leads. Sure it goes by slow, but it is enjoyable.  Something tells me that some people really need to see it again, since hearing all this negativity about it.",
      "total_reactions": 1,
      "user": "Ransack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "It's hard to characterise this film; very black comedy covers it i guess. There are some amusing scenes, a nice touch of the absurd, but overall I found it  just a bit too bleak",
      "total_reactions": 1,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I'm completely amazed at the negative reviews here (granted, plenty of them are also great) but especially from Coen Bros. fans... Not all movies work for everybody, sure, and if you didn't like it, so it goes. But I think this is easily one of their best films. The ending is supposed to be exactly as it is and its reasoning summarizes the movie perfectly. A shame if it feels unfinished to you. i found it deeply satisfying.",
      "total_reactions": 1,
      "user": "snazzyjer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "While typical in style of the great Coen Brothers, it hits harder than normal in it's brutal bluntness. Simply put, don't take things too seriously and wrap yourself up in worry and unnecessary stress. Whatever is going to happen, is going to happen. While most if us know this, if you don't, the Coens will smack you hard with the message.",
      "total_reactions": 1,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I for one was entirely entertained, especially by the Korean actors. They had me laughing quite a few times and the whole jewish paradigm was, in my opinion, quite ridiculous as well. Damn good comedy!",
      "total_reactions": 1,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Just another great Coens brothers movie. Their movies aren't necessarily for everybody. They generally have this dark, bruising humor that will isolate their audience.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "If you are unable to think or use your brain, walk away. This is a deep, philosophical, cynical, witty movie that answers the question we all wonder. Why do bad things happen to good people? Does God exist? Do my actions have any consequence? This movie answers them all. You really have to pay attention to the themes and hidden messages. It is a BLACK COMEDY. Meaning there are no fart jokes or people yelling penis. Worth the watch, one of my favorite movies.",
      "total_reactions": 1,
      "user": "ThinkingPanda"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "One of the worst movies I have seen in the last 5 years. The idea behind it is not bad, but the subtle humor  doesn't work. Without the humor, this movie is annoying and boring and at certain points you just cannot believe the story anymore. Nobody (even in those days) is such a pushover as the prime subject. I love the work of the Coen brothers, but this was a waste of my time.",
      "total_reactions": 4,
      "user": "Peschybear"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "This is one of those films that the critics seem to love, but most users will not.  Drama films where nothing happens should never get anything above a 50 but I see Ebert gave it a 100.  How is this possible?  The last 30 minutes weren't terrible, but that is only in comparison to the first 70 minutes which are excruciating.  I'm sure the critics will say those that don't like this film \"don't get it\".  I have a phrase for them, \"Get real\".",
      "total_reactions": 3,
      "user": "brjorge2002"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "The only time I was laughing when thinking about this movie, was thinking of how my wallet looked emptier than it deserved to be. I found the movie boring and hardly humorous at all, it was dull and just ended? Some people say that's life... that's why it ended that way, well that not why I or anyone should go watch movie, it was unilluminating, can't believe the misleading score",
      "total_reactions": 3,
      "user": "chrisfree"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "This movie sucks! Plain and simple. If I paid to see this at the movies I would have been angry. As it it, I'm angry for paying attention to Ebert. I lost 90 minutes of good living time. This jackass, Ebert, has no credibility at all. He rates every Disney movie pretty high. He was their lackey for quite some time so it should be no surprise. I guess he smooches the Coens' butts too..",
      "total_reactions": 5,
      "user": "zig16"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 3,
      "text": "I was greatly disappointed by this film and cannot see how it was a nominee for the Best Picture Oscar.  I found it neither thought provoking nor especially funny.  Perhaps I would have gained more from the viewing if I was raised in the Jewish-American tradition, where I might have related more to some of the \"commonly shared cultural experience\" points of view. >>>> My full cinema profile here: http://bit.ly/MyMovies",
      "total_reactions": 2,
      "user": "Efreet69"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Pure crap. (with a little interest) it was hard to understand what they were saying. very hard to even try to comprehend the story (especially the beginning). Shouldn't have been nominated for best pictue. and to the Cohen Brothers......COME ON.",
      "total_reactions": 2,
      "user": "Shahmeer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Is this a comedy or a drama because i don't know and for that matter i don't care either because it wouldn't have helped the movie if i knew. This movie disgust me with its boring and stupid main character. Sorry Cohen brothers but this one sucked.",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is seriously strange. It is wacky and filled with moments that feel as if they have no relation to the last. The story wasn't even interesting. Just not worth watching ever again.",
      "total_reactions": 2,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Larry Gopnik is having a good old fashioned mid-life crisis. He is a physics professor, and it is safe to say his job is not all he wants it to be. His students seem disinterested and the one that is engaged is trying to bribe him for grades. His teenage children are self involved, imagine that, so he is getting little fulfillment on that front. His wife wants a get, a divorce to us non-jews, and to top that off he had no idea anything was wrong plus she wants to marry his friend. All this seems like drama ripe for entertainment in the hands of the Coens. In my opinion there is little entertainment to be had.",
      "total_reactions": 1,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "Big fan of the Coen Brothers, but I was just not feeling this one. It simply felt too off for me. Their humor is quirky, but it usually works for me and far too many jokes fell flat. The deadpan comedy worked for the most part, but just not enough. Plus, this one was just constantly feeling like a film I would appreciate more if I were Jewish. It felt like I was constantly on the outside looking in and everybody behind the cameras kept dying of laughter and I had no idea why they kept laughing. A Serious Man, as a drama, works very well and is a very interesting take on the expectations of life, being in a downward spiral, and on the book of Job. From a religious aspect, it is very sound and an interesting take on what is expected of believers, especially when things do not work out. Sadly, it feels too distant and almost incomplete (though all their films do....to varying effectiveness) to be truly effective. A Serious Man had high expectations from me, but it fell short.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "As dark as A Serious Man can be, it's just as good. The Coen Brothers give us another one to really think on and admire. Newcomer Michael Stuhlbarg is a prime example of perfect casting.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "It's not exactly uplifting, but the Coen Bros. \"A Serious Man\" does prove to be a lovely testament to the existence of near perfect storytelling and character writing.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "The Cohen Brothers have created a movie which will sit right along side Fiddler On the Roof, The humor is subtle, but hilarious when you get it. At the same time, it questions the nature of life, Hashem, and karma.",
      "total_reactions": 0,
      "user": "Hufff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "A sophisticated and detailed, albeit bizarre, film, of which most people would find puzzling and tepid. However, I, being Jewish, have a knowledge of the culture to understand the certain depths and symbolism the film attempts to convey. The acting is sublime, significantly the lead Michael Stuhlbarg. Has an extreme ingenuity, yet a very unusual idea and message.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This movie isn't fro everybody, you're either gonna love it or hate it. But i liked it, i liked the dark humor and the character o Larry Gopnik, nice performance by the criminally underrated Michael Stulhbarg",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "A Serious Man is quite bizarre, but the Coen brothers still did a good job, and Michael Stuhlberg, Fred Melamed, and Richard Kind acted very very well.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Sy Ableman: \"I'm a serious man, Larry.\"",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Dark comedies like this are my favorite. No matter the plot, I usually find at least some enjoyment in them. A Serious Man is really no exception. The ancient European setting that the movie started out in set up the wonky way with a dybbuk of Judaism and the controlling relationship of Judith. The flashes between Larry's life and his family's (and other's) really seems to show how horrible his life is and gets. Each scene somehow complicates the circumstances more and more until he's stuck and needs a rabbi's help to provide some advice, or try to.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    }
  ]
}