{
  "mc_avg_user_score": 8.2,
  "mc_metascore": 77,
  "mc_mixed_rating_frequency": 23,
  "mc_movie_name": "A Single Man",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 166,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Love, love, love it! If you are familiar with Wong Kar Wai and love 50s era cinema recreations, this is a film for you to watch. I celebrate Tom Ford has such a detailed and suave eye for moviemaking as he does for fashion. One truly expects his second film to have the consistency of this marvelous piece, the acting is superb and the overall feel is ... sheer delight.  @cinemaquote",
      "total_reactions": 1,
      "user": "raco2046"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "A Single Man is a single pile of crap. What a totat bore this was. It is a laughable film but the problem was it wasn't  a comedy. It is stupid self- absorbing film about a gay guy. How much less interesting can it get. One of the worst pictures of the year.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "Absolutely horrible. It was so boring. I feel asleep. The replication of the early 60's was excellent but the entire plot and script were so dull. Just writing about it almost puts me to sleep.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I'll give it a 10 because Colin Firth plays a homo. I like homos. I thought Harvey Milk was great too. Also Brokeback Mountain. And let's not forget Quinten Crisp, John Hurt plays the homo, Quinten crisp. All good. Anything with homos.",
      "total_reactions": 0,
      "user": "mark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "Beautiful and tragic. The cinematography, acting, music and rhythm all help convey this regardless of the loose plot. The ending too much so for my taste.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Tom Ford 's directorial debut is definitely a surprise hit. Not something you'd expect with the man who helped turnaround Gucci when it was almost bankrupt. You'd expect the film to be a depressing, dull and painful to watch when actually it is like a beautiful, glamorous  treat for the eyes and ears. Colin Firth is marvellous as George, an English professor living in California who has lost his love of 16 years Jim (Goode). Firth brings so much more to his character and his presence is outstanding. His supporting co-star Julianne Moore is also brilliant as Charley, she doesn't have much screen time but Moore uses it wisely and cherishes every second she has on screen. The film is accompanied with a haunting score, beautiful costumes and perfect art direction. Ford's film is definitely worth a watch and will be one to remember for a long time.",
      "total_reactions": 0,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "It's funny as children, at least in my case, when we think adults have it completely together.  That don't have to deal with the day-to-day uncertainty and learning we do. That they know it all.  A Single Man is a misnomer.  Not knowing the story line, I felt as though the movie was literally about a single man.  And, yes, while he IS a single man, the reality is, this movie is rooted at perspective.  More precisely, the differences in perspective.  Male vs. female. Old vs. young.  Teacher vs. student.  Happy vs. sad.  Such a very human film, A Single Man is a rivetingly written and acted portrayal of a love unexpectedly lost.  In all its flaws and sadness, a man struggles with the sudden loss of his true love, feeling like he's supposed to move on, to live and tries very hard over a year to do so.  Yet, he realizes time doesn't heal him and the clarity he finally comes to is that death is much better than the life he's made to live without his love.  He attempts to take his life and just can't seem to do it, no matter how much he may want to.  In the end, life takes him, just as a part of him is shown a slice of being able to move forward.  Colin Firth's performance is even better than his Oscar-winning role in the King's Speech, proving he is one of the most underrated talents in film.  The key to this film though is the story and flawless direction. This one is not to be missed.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "A director with vision, with an eye for detail and and understanding of photography (Tom Ford one of the top designers for Gucci has all that in abundance) and  a strong character performance (Colin Firth delivers a potent, eloquently internalized, award winning performance) combined bring us a beautiful, stylish and emotionally charged film worth watching.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This is the best picture of 2009.  Achingly sad and wonderfully acted.  The cinematography is astonishingly romantic, full of life and death and everything in between.",
      "total_reactions": 0,
      "user": "EthanPeter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "A commanding directorial debut from Tom Ford.  The film's color literally runs out as George Falconer's (Colin Firth) life meanders toward the completion of his suicide plan.",
      "total_reactions": 0,
      "user": "DonFoster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "this movie may suffer from being too \"fabulous\" and sleek, but its heart is in the right place and Firth makes sure that nobody loses sight of that. undoubtedly a great debut for any first-time director.",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "it's one of the best movies ever.",
      "total_reactions": 0,
      "user": "stange"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Although the subject matter was tragically deep and at times truthfully poignant, the ability to execute this film as a solid narrative was a failure of first time director Tom Ford. While the writing was generally decent (Ford was also co-writer in addition to his directing role) his direction ultimately left me pining for something more real and gritty and less flashy with sprinkles of shallowness of the side . Sadly a lot of the movie itself felt like a really long perfume advert. The best thing about 'A Single Man' was simply the wonderful and divine Colin Firth.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2017
      },
      "score": 9,
      "text": "A Single Man is the first work of Tom Ford in film industry and has nothing to envy movies from well acclaimed directors. I actually got to see this picture after the tremendous success of Nocturnal Animals. As in that film, here there is a perfect blend between human drama with crude action. Interesting thing is that, the drama not only involves social relationships, but also mid-age crisis, which certainly combines with an outrageous incident, shaking the protagonist life, living him (her in Nocturnal Animals) naked and alone facing the contemporary world. These, surely, makes them doubt the present, revive the past and let the future drift. The thing with Tom Ford and what makes so unique his direction; is that without neglecting clue aspects like screenplay, music and performances (which are wit, straight to the point and superb, especially Colin Firth), some accessory features take an important part in the significance of the film, changes in illumination, costume design and make-up; all together in full coherence with the rest of the film.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "So powerfully poignant, it's sure to strike the heart of any. A Single Man explores the unique life of one man, his sexuality and his relationship with a younger version of himself. With a superb story and cast--it's a masterpiece.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Practically a prolonged advertisement for Tom Ford suits at times, A Single Man matches its stylish outer lair with a deep character study that brings plenty of substance to make it a truly perfect blend of style and substance. Colin Firth is phenomenal in the starring role as a grieving man who is dealing with the loss of his gay lover while balancing his current life. A tale of love and loss, A Single Man is blessed with fantastic cinematography that really makes its lush style come to life and gentle writing and direction from Tom Ford to give us this worthy character study that feels as if it rings entirely true. The score is also phenomenal and really takes center stage at times in this film that often feels like moving poetry. As an overall film, A Single Man is well told and incredibly well crafted turning it into a film that makes you cry because of both its story and its sheer beauty.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "fashion designer turned director/writer/producer Tom Ford provided the biggest cinematic surprise in the whole year 2009 with his debut picture A Single Man. I've always liked films about homosexuality (okay, most of them. There's rubbish in this genre as well) and this one is an absolute stand-out. Colin Firth foreshadowed his creaming off the profits for follow-up The King's Speech, with his ceaselessly realistic turn as a secretly gay college professor who grieves about the death of his long-time lover. While 2010's TKS is a such a flawless perfection of movie making, ASM's plot is more interesting and the final good is mesmerizingly artsy. Nicholas Hoult, relatively unknown by the time this film was made, impresses as the young student who comes in the life of Firth's character after his loss, and Matthew Goode makes the best out of his little screen time. I never expected that a first-time-filmmaker would be able to stun me as much as Tom Ford did with this movie. The use of colors to express emotions, the ability to turn mundane conversations into such absorbing dialogue, the knowledge of how to use the score (oh, so beautiful!) in due time, etc. It's not a movie to watch many times since it gets a bit boring then, but at first watch, you'll be overwhelmed by this movie.",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The movie shines only on parts Colin Firth has dialogues with Julianne or Nicholas. Otherwise, the entire film felt like an annoying ode to a \"boo me\" and a \"why me\" theme that was annoying and pitiful. I get the creative direction this film was trying so hard to push, but after about the 100th symbolism/ allusion to various cuts/ scenes/ gestures, the film felt like a trite message towards the snub art community.",
      "total_reactions": 0,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "One of the best movies of Firth. It is a really well told story. First of all, the topic that transcends genders, the hurt one, sad because of the lose of the love of his life. A must see",
      "total_reactions": 0,
      "user": "Christian0205"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Sensual stylish and sad",
      "total_reactions": 0,
      "user": "adamjones"
    }
  ]
}