{
  "mc_avg_user_score": 4.6,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 19,
  "mc_movie_name": "A Thousand Words",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 20,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "If A Thousand Words' formula seems familiar, that's because writer Steve Koren has tripped down this quasi-metaphysical path before in \"Bruce Almighty\" and \"Click.\""
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "While A Thousand Words features some reverent flashes and even has the potential to touch audiences (a moment involving a mother with Alzheimer's particularly hits home), it suffers from being too broad."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Before this star vehicle devolves into a soggy New Age sermon, Murphy's manic pantomiming offers a few faint flickers of the mad comic genius from 1987's \"Raw\"."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "It doesn't help that even the pratfalls in A Thousand Words look tired and recycled."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "The formulaic script by Steve Koren doesn't manage to exploit the absurd premise with any discernible wit or invention, and the star is left floundering."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "The director, Brian Robbins, perhaps as a result of his prime-time pedigree, has so carefully engineered this manipulative machine that little emotional residue remains - only a product inoffensive, unsurprising and uninspiring."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Mostly harmless, but the largely joyless exercise is a letdown after getting a glimpse of a re-energized Murphy in \"Tower Heist.\""
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "If only this Eddie Murphy flick had taken its own advice and spent a little more time being reflective instead of hyperactive, it might have overcome a trite script and awful, obvious excuses for comedy."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "The concept is unoriginal, the scenarios aren't funny, and its message is banal. Plus, Murphy alternately hams it up and phones it in."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "The poster art for A Thousand Words shows Eddie Murphy with duct tape over his mouth, which as a promotional idea ranks right up there with Fred Astaire in leg irons."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "His performance feels so disingenuous, so forced, that an otherwise perfectly acceptable high-concept comedy comes crashing down around him."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "Alas, even Murphy's largely wordless, physically adroit performance can't redeem this tortured exercise in high-concept spiritualist hokum."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "When they came in to pitch A Thousand Words, no doubt by calling it  \"Jerry Maguire\" meets \"Groundhog Day,\" a studio exec should have raised the palm of rejection and said, \"When you stop being sadly derivative and write an original idea that's as good as those two, come back.\""
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "For a comedy about the quest for inner peace, A Thousand Words reeks of desperation."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "While the ending is wretchedly fakey and predictable, Murphy in subdued mode gives it a little authentic sweetness."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "In A Thousand Words the camera stays about two inches from Murphy's hyperactive face, and you start to see the strain and desperation in the actor's eyes."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "This is the kind of colossally misguided vanity project."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 16,
      "summary": "In theory, A Thousand Words should draw on its star's abilities as a physical comedian, but Murphy, miming his order for a triple latte at Starbucks, comes off like Charlie Chaplin on crystal meth; he's strenuously unfunny to watch."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "I was sceptical about seeing this movie because, knowing the storyline, I was afraid Eddie Murphy may deliver over-the-top \"Jim Carey-isms\".  That pretty much happened.  But, I brushed that aside and watched a very interesting concept play out.  There were some disappointments, but Critic reviews seemed a little harsh.  I enjoyed this film.",
      "total_reactions": 1,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This is a classic example of a movie that should have been tested more before release as I could absolutely see the sheer brilliance and potential behind this project. I believe that the public's opinion about this film would have been much better had there been well written captioned thoughts with comedic value to match Eddie Murphy's facial expressions as that would have held viewers attentions longer and also increased the pace of the story. However, after watching the entire movie I was exceedingly happy with the overall story line and since all other aspects of the film were perfectly fitting- i.e. sound, music, lighting, editing, etc. I gave this a 9.5 (even though metacritic.com doesn't allow half points, hence the10), but never the less it's definitely worth a watch and for many out there it will be a poignant and heartfelt reminder to love your family. The ending could have used a twist as the obvious possibilities were present: I can think of 3, 2 of which could have incorporated the ending already used, but as it stands I absolutely agree that the final cut suits the mainstream audience just fine. Again, I firmly believe that having his thoughts hilariously captioned with good writing could have saved this title, but I have a good feeling that this might be a sleeper in terms of popularity for rental, cable, or streaming internet (IF they can include an alternate cut with good captions- hint hint).",
      "total_reactions": 1,
      "user": "zendoa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Terrible movie. I gave this movie a two solely because the plot was somewhat original. however everything else in the was just plain awful. Its flat, dull, painfully unfunny and the terrible jokes from good ol' funny Eddie Murphy will make you cringe. In fact this movie is just another cash in from Eddie Murphy himself, avoid this film at all costs.",
      "total_reactions": 1,
      "user": "WhoSane"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "DUD!  This movie was tired after the first 22 seconds.  There were very few moments of originality, and everything in between was flat, uninspired, dull, and painfully unfunny!  The supporting cast was awful, especially his wife (I don't want to learn her name because I want to forget everything about her).  I really wish someone in Hollywood could write an excellent script for Eddie Murphy because I want him to be successful...we keep waiting and waiting.  Should I be happy or sad that I used my free rewards movie ticket to see this drivel???  It is a bit of both for me:  I'm happy that I didn't waste a penny of my own money on it, but VERY sad I wasted a \"free ticket\".",
      "total_reactions": 10,
      "user": "CincinnatiDave"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "When Mookie asks Pino who his favorite movie star is(in Do the Right Thing), the epithet-spouting Italian-American answers, \"Eddie Murphy.\" It's a testament to Murphy's talent that even the racist son of a pizzeria owner worshipped the then-former SNL star. Given the time frame, the last film starring his screen idol which Pino probably saw in a Bedford-Stuy theater would probably have been Coming to America. For a man who resents how his Brooklyn neighborhood seems to be growing blacker by the day, the story about an African prince's mission to find a wife in Queens, should fill Pino with outrage, since Akeem, who finds work at a fast-food joint, is taking some McJob away from a white man. If the prince had \"jungle fever\", however, then maybe Pino would turn on Murphy, and see for the first time, his confused assignation of a racial double standard that exempts entertainers(he likes Magic Johnson and Prince, too) from being \"n*****\". In that scene with Lee, John Turturro mocks Al Sharpton, Jessie Jackson, and the Minister Louis Farrakhan, black men who are willing to fight back against the white establishment. And yet, in 48 Hrs., although Reggie Hammond gets called every name in the book by the cop who temporarily paroles him, the 1982 film allows the black man to retaliate, not only through off-color language, but with fisticuffs too, most memorably, in a knock-down, drag-out fight where Jack Cates takes his fair share of licks against the African-American convict. This constituted as progress, because back in the early-seventies(Sweet Sweetback's Baadasssss Song, notwithstanding), blacks weren't allowed to challenge white authority. To hit a cop, especially a racist one such as \"Popeye\" Doyle in The French Connection, where Brooklyn's finest, posing as Santa Claus, surreptitiously calls some black youths \"boy\", as in \"Have you been a good boy?\" was unthinkable. Inside the social club(whose dark-skinned patrons are the source of the lexical transference that Doyle lays on the two kids), there's movement, the surveillance pays off, when Det. Russo coaxes their target to flee, a chase that ends with police brutality, and intimidation in a back alley. It's a show of excessive force made justifiable by the bodily incision Doyle's partner suffers from the black man's knife-wielding hand. But, of course, the times as they were, the whole filmic contraption was fixed ,with The French Connection being a prime example of how black actors were either cast as criminals or entertainers. In the aforestated scene, the two stereotypes align themselves in perfect symmetry, on both sides of that bar window, in which Doyle keeps his eyes peeled for the con, while he urges the black kids into minstrelization by singing \"Jingle Bells\" to a jolly bigot, who later states, \"Never trust a n*****.\" In another bar, another drug raid, Popeye corrects a patron after he calls him Doyle without prefacing his surname with a \"Mister\". Spike Lee was just 14 at the time when the William Freidkin film won Best Picture at the Academy Awards. It would take another decade, but Sam Cooke finally made good on his word when he promised that \"A Change is Gonna Come\", during a blink and miss it moment in 48 Hrs., when a hegemonic shift in the racial hierarchy occurs after Jack's request that back him up is met with  askance. \"Now why the f*** would I do that?\" implores Reggie. In a scene that mirrors The French Connection(referring to Popeye Doyle, he says, \"When white cops came in to f*** with me and my friends, the only thing that stopped us from kicking their a*ses, they had guns and badges.\"), Murphy walks into a monochromatic-skinned bar and intimidates the clientele just like Gene Hackman did back in '71. \"There's a new sheriff in town,\" promised Murphy. Now, after countless bad movies, including A Thousand Words, you could say that Murphy put himself \"Back on the Chain Gang\". The Bodhi tree, often associated with the place that Prince Siddhartha finds enlightenment, is transmogrified in A Thousand Words, an unaware Buddhist horror movie, because Bo doesn't want Jack McCall, a literary agent, to meditate. Uh-uh. This Sacred Fig wants him dead. Pitched as a comedy, Dr. Sinja, a New Age guru whose book Jack aspires to publish, goes largely unexamined as a psychopath, since, contrary to his avowed obliviousness to the evil leaf-letting Bodhi's origin, is probably the man who directs the ficus to sprout in Jack's garden. After countless depictions of evil Christians, Dr. Sinja is that rare character in film: an evil Buddhist. The tree dictates Jack to do the right thing and choose his words wisely, which he does, but still, the Bodhi kills him. \"The fake me died,\" he says. Only then does the guru agree to work with Jack(or is it \"Jack\"). A Thousand Words is like some bizarre eastern retelling of Invasion of the Body Snatchers. Jack isn't a pod person, but rather, a Bo one.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no. no.no. no. no. no. no. no. no. no.",
      "total_reactions": 5,
      "user": "meowmeowmeow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Kind of a mixed bag. On one hand you have some very funny moments, on the other hand you have a movie that, while funny, manages to fluctuate between mature and juvenile jokes that makes it hard to find an acceptable audience. Some of the humor is too dumb for older audiences, but perfect for kids. The rest is too mature for kids but perfect for adults. The movie also features some genuine touching moments mixed with a familiar message of morals. I for one enjoyed the movie and laughed throughout, but I can't help but realize that all the familiarity of it's message and fluctuating maturity of its humor are going to turn off many. So if you're looking for a family comedy to watch with your teenage children (I recommend at least age 13) then this might be for you, depending on your taste.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Eddie murphy is os bad this movie is so bad i regret taking my friends to see this movie. Eddi disappointed me with this movie. It had some ok parts pu this movie isnt worth more than a zero",
      "total_reactions": 1,
      "user": "RonaldOVOXO"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Is it funny?  It is amusing, I'll give it that.  I smiled out of pure schadenfreude, and I chuckled several times--but did I actually laugh?  Well, there is a scene where gardeners spray insecticide on the tree, which has a drug like effect on McCall, who is at a business luncheon.  The waiter rattles off a few menu items in French.  McCall imitates the funny sounding language, and acts completely out of it, to the shock of the publishers he's meeting for a deal worth millions.  There's nothing inherently funny about Murphy on drugs, but in the context of a formal lunch meeting, it works   Other than that, there isn't a laugh to be found.  Full review on my Blog.",
      "total_reactions": 1,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "A Thousand Words, the new film of Murphy, is not bad, is not good, is regular, the story is same like other movies of the genre, the performance of Eddie is good, but not the better, is a film for watching in a day with anything to do.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "This movie, is very boring and tired. It seemed like it was thrown together, without being properly written. I expected it to be a little better than what It was, I do not like this film and I wouldn't see it again.",
      "total_reactions": 1,
      "user": "ScarTissue1990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Last year, Eddie Murphy made me laugh again in \"Tower Heist\" and it was the best films since \"Beverly Hills Cop\" and \"48 Hours.\" But this year, he was withdrew as host of the Oscars thanks to Billy Crystal and a homophobic rant from Rush Hour director Brett Ratner and therefore cost Murphy his duties. Besides, he's an Oscar-nominated actor and he hasn't hosted the awards in his career, maybe next year he could get another shot at it. \"A Thousand Words\" is a little less Murphy quality comedy just like Norbit and The Nutty Professor, but I just need a little more flavor from the film. I found the movie a little funny, but needs a lot of credibility. \"A Thousand Words\" wasn't a great movie, but I'll rent it. But Eddie needs to bring the comedy stand-up back just like in \"RAW.\"",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "beginning to watch this movie, and it's poster, and eddie murphy's recent acting career, my expectations when watching one thousand words were quite low to begin with. and, unsurprisingly, the movie has few original funny moments. surely, you laugh a couple of times, but the rest is just joking about people in awkward situations. the thing that sort of 'saves' the movie for me is the fact that the arc of the main character goes somewhere, and it is sort of interesting to see how the relationships work out in the movie. and that is what saves it from being a complete disaster, because the comedy is balls.",
      "total_reactions": 0,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "An embarrassingly unfunny, desperate attempt at building on Eddie Murphy's return to form in last year's 'Tower Heist', A Thousand Words is one of the worst films of the year, hands down. The lasting impression I get after watching it is that the only person who looked even remotely well suited for their role was Jack McBrayer as a cheery Starbucks employee (which, by the way, is heavily advertised throughout). Eddie Murphy looks really uncomfortable and why shouldn't he be? His greatest comic asset is his voice and, once taken away from him, he becomes trapped in a joyless excuse for a movie. Every single joke falls dead flat. I just want to say it again, so that you really feel it. Every single one. Perhaps it's just that I in particular am a stingy critic with an over-critical taste, I don't know, but I saw the entire film as a cloying, through-the-motions money-grabber. I feel bad for everyone involved.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "It's stupid and corny and out of date, but it's not nearly as painful as everyone is making it out to be. It's got a few laughs and a good message about living life. Still not necessarily a \"good\" movie, but not a bad one by any means.",
      "total_reactions": 0,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "Hey, i laughed. It was funny. But then, the movie, in the end, took a very, very dark path. It was no longer a comedy and it kinda killed the beginning and middle. But hey, i laughed.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Only read this if you saw the film. I give this movie a 6. When I read the title and the story I thought this would be a good film, the idea of only having a thousand words to say before you die just sounds so stupid it's actually funny. Eddie Murphy definetely played his role really well in this film, he does have some hit and misses but this one was a hit, I just felt that they ( the writers, director etc.) could have done something better with this, like Eddies' assistant in the film, who ever he was, just didn't bring it home I think, he made me feel awkward at some times, actually all the time. When the movie got near the end and it began to get 'dramatic' I also think they missed something there, now Eddies' character only has a few words left to say before he dies, I knew right then when things got heavy that he was going to have to help all of the people he ignored which kind of defeated the purpose of watching the rest of the film, I only stayed to make sure that I was right. I think only the first half of the film was worth watching, while the rest I could have guessed what was going to happen. To conclude and recap what I think, the comedy was good, the drama was not.",
      "total_reactions": 0,
      "user": "vivec2k12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 0,
      "text": "A Thousand Words had potential as a successful, meaningful comedy with a good-hearted message about the consequences of our words. But instead, Eddie Murphy screwed the whole movie. Though, it might be the script's fault as well.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "It offers good lesson and I love movies just like this. It is a nice comedy movie for every family to enjoy.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Principe génial que ces derniers mille mots avant de mourir... surtout quand le clown Eddie Murphy s'y colle. Alors à la tchatche coutumière succèdent mille grimaces désespérées et désespérantes... puis une épouvantable guimauve à la fin. Une occasion ratée pour ce bon vieux Eddie qui pédale comme un hamster de Parkinson épileptique dans sa roue bringuebalante.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}