{
  "mc_avg_user_score": 4.5,
  "mc_metascore": 25,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "Abduction",
  "mc_negative_rating_frequency": 84,
  "mc_positive_rating_frequency": 57,
  "mc_pro_critic_reviews": [
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 55,
      "summary": "As Nathan, the teenage hero of Abduction, Lautner shows he's handy with stunts, many of which he clearly and impressively performs himself, and good with a fight scene. But when it comes to exchanges of dialogue, displays of emotion or just standing around, he's stiff and manifestly uncomfortable."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Director John Singleton offers bits of suspense, but Abduction is less a movie than a piece of engineering, a glumly ludicrous cat-and-mouse blowout designed to win Lautner male fans along with his girl demo."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Abduction puts Lautner in motion and never goes very far wrong as long as he remains in motion."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Odds are John Singleton doesn't know he's made one of the funniest films of the year."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Aside from such dutiful fan service, the film is a haggardly slapdash \"Bourne Identity\" knockoff, never rising above the level of basic competence."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 42,
      "summary": "Singleton once radiated ambition and vision. These days, he seems to be aiming for mediocrity at best. Even by those extraordinarily lenient standards, the inessential, perfunctory Abduction falls short"
    },
    {
      "critic": "Glenn Whipp",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Abduction is just the third movie John Singleton has directed in the past decade, and it contains neither the passion nor the competence of his two previous genre efforts - \"2 Fast 2 Furious\" and \"Four Brothers.\""
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Singleton's action thriller has a decent sense of propulsion but, after a faintly intriguing start, the convoluted plot mechanics overwhelm everything else, making you feel you're watching a detailed blueprint for a movie, and an increasingly far-fetched one in the bargain."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "Filled with laughable dialogue, Abduction goes nowhere."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "Molina and Weaver, who, most of the time, perform brilliantly, move through Abduction as if on autopilot."
    },
    {
      "critic": "Benjamin Mercer",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "A blockhead espionage thriller from director-for-hire John Singleton."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Perhaps the only way to approach Abduction that will not result in a 105-minute boredom-induced coma is to think of it as a comedy, preferably with a drinking game attached. There are laughs to be had, although none of them are intentional."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Abduction is a crass and lowbrow attempt to cash in on a young actor's heat - an exploitation picture where the person being taken advantage of is too young to notice."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 25,
      "summary": "Taylor Lautner puts the abs in Abduction, but not much else."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "A ridiculously cheesy confection filled with unthrilling thrills, bored-looking adults and a comically overstuffed backstory."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "Twi-Hards shall attend en masse. Adults shall roll their eyes. And on our human comedy shall go."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 20,
      "summary": "A sloppy, exploitative act of star worship created (if that's the right word for cynical hackwork) around Mr. Lautner, the pouty 19-year-old heartthrob of the \"Twilight\" franchise."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 12,
      "summary": "Actual abduction may be preferable to the movie of the same name, but only if your kidnappers don't torture you by forcing you to watch it."
    },
    {
      "critic": "Todd Gilchrist",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "summary": "The new film Abduction has a lot of problems, but the biggest is the fact that no one gets abducted. Ever."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "summary": "A fourth-rate Hollywood thriller that bungles a lot of thievery from better movies, is entirely bereft of suspense or excitement and features a leading man who absolutely, positively cannot act."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "A terrible \"action flick with terrible \"acting\".",
      "total_reactions": 10,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "Like Beiber, I hope Lautner saves his money because, like most teeny boppers, he will need it after Hollywood has forgotten him. His acting consists of a pout and his angry look and  has not grown beyond his limited acting ability in the Twilight movies. The rest of the cast does a good job of walking through their roles and excepting the paycheck but there is nothing that I would want to see or experience again.",
      "total_reactions": 5,
      "user": "frelling_cute"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "It's obviously a copycat Bourne movie and Taylor Lautner is a poor copy of Matt Damon. The action sequences are below par and the storyline is full of holes. Eatch the original Bourne movies on DVD instead.",
      "total_reactions": 4,
      "user": "ezcam1944"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "I saw most of this movie when i was at the barbershop getting my haircut and i couldn't wait until the barber swiveled my chair so my back would be facing the tv. Just face it , the only reason Taylor Laughtner is big right now is because of his body that he used corto-slim to sculpt. This movie is just bad. Stay away",
      "total_reactions": 3,
      "user": "Jbrizzy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "The plot (if you can call it that) behind this movie is almost as bad as its cast. Taylor Lautner is a awkward at his best, and laughable as an action movie actor. this movie is predictable and uninteresting, don't watch it.",
      "total_reactions": 2,
      "user": "Vader452"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Worthless movie. Worst 20 Bucks (With popcorn and drinks) ive ever spent. TAylor is not a good actor he should do shows before movies. Go to like icarly or some crap",
      "total_reactions": 2,
      "user": "RonaldOVOXO"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "If you enjoy teenage dramas, terrible acting, plots that never seem to be explained and more bad acting then you'll love this movie. If not, rent Enemy of the State. It's kind of the same thing but with people who can act and isn't centred around awkward and unrealistic teenage dramas.",
      "total_reactions": 1,
      "user": "mako_psy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is awful! My girlfriend rented it because Taylor Lautner takes off his shirt. The writing and acting is terrible and unbelievable. I think she liked it... I was bored to tears...",
      "total_reactions": 1,
      "user": "nateinaction"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "They lie when they call this a movie.  A movie is supposed to ber entertaining, this drek was just teen targeted drivel.  Save your time and money and pass on this turkey.  The producer clearly thought that having a star from a twilight move was enough to carry the film, so there was no need for a script or plot.",
      "total_reactions": 14,
      "user": "Bart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "\"Abduction\" is a decent teenage Bourne movie. The main character is the 'guy who knows everything but got his memory erased and is now being chased by some weirdo government officials'. Unfortunately, the film starts out with power and dies out very simply. Don't get me wrong: Taylor Lautner was better in this movie than \"Twilight\" with all that action. However, he's still too young compared to Matt Damon or other action stars. In conclusion, my advice is you to RENT IT. R) 4.6",
      "total_reactions": 4,
      "user": "AKoreanCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "I'll be honest. \"Abduction\" is a terrible teenage action movie, but it's not THAT bad. As AKoreanCritic said, Taylor Lautner isn't that bad; he was actually pretty decent in this movie. Don't hate on Lautner guys. Just because he starred in that **** vampire movie we have no right to hate him.",
      "total_reactions": 11,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "one of the worst movies I ever seen in my life. Worst acting cast and directing. DO not see this movie it is so horrible. The storyline is horrible. It feel like they wrote this script in one hour . WIthout thinking . I knew It was going to be horrible by the beginning.",
      "total_reactions": 2,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "I don't usually like action movies but this one was really good! It was just enough to be good but not so much you feel exhausted when your done watching.  The plot wasn't so \"out there\" if you missed a sentence you were lost but there was enough suspense to keep you wondering.",
      "total_reactions": 7,
      "user": "Hallie"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "i dont understand why people are bashing this movie it kept me entertained and just because it has a guy from twilight in it everyone hates it at least he didnt put out another twilight movie",
      "total_reactions": 9,
      "user": "Inuit_Dude"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Everyone who says this movie wasn't good is just BITTER and CYNICAL!  I am a 29 year old woman, and my husband and I BOTH liked this movie a lot.  It was entertaining and definitely worth the money to see it.  In our opinion, Taylor did a great job.  Keep these movies coming!  We want a sequel!",
      "total_reactions": 10,
      "user": "CandW"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Critics are just lameheads when it comes to bashing movies, but I agree with the fans and see Taylor Lautner's \"Abduction.\" It's a great action movie and a phenomenal cast, gotta see it. It's way better than Robert Pattinson in \"Remember Me\" or Zac Effron in \"17 Again.\"",
      "total_reactions": 9,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This movie Abduction was a execptional action movie. But the problem with it is that you are only going to love it, if you are a taylor lautner fan. I am a huge taylor lautner fan. So I loved it.",
      "total_reactions": 15,
      "user": "Muhammadomer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This movie deserves at least a 7/10  I'm giving it a 10 because everyone is insulting for some stupid reason!!! Sure it was far from perfect but the ratings are just mean.",
      "total_reactions": 4,
      "user": "Gamingking007"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I Do Have To Say This Is Another Copcat Movie... But Taylor's Acting Is Verry Good Even Better Than Mat's... Altohugh Some Scenes In This Movie Arent Great... It Makes Up For It In Acting... Taylor Great Job! I Think This Movie Does Not Deserve All The Critical Comments About Taylor...",
      "total_reactions": 4,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "I didn't like the main actor pair  but the story line ;) was pretty neat. It's saddens me to see that this movie has such a bad score at the moment.",
      "total_reactions": 1,
      "user": "sYs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "If Abduction does anything, it makes the viewer laugh multiple times in a 90 minute span. Its like its building to one big punch line with little nuggets of comedy along the way. This would be a good thing if this film was a comedy. John Singleton brings an action film so terrible it crosses into spoof territory with a lead actor (Taylor Lautner) who is thoroughly repulsive (at least acting wise). Singletons desire to make a fast paced action film which calls back to older films just reminds the viewer that the older films were so much better. As his first lead role away from The Twilight Saga, Lautner flops like a fish on dry land. He fails to tell the difference between acting and annunciation. The film suffers from other things but the score pretty much says it all. Its a shambles of a movie which everyone involved should be ashamed of, especially Lautner.",
      "total_reactions": 1,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I know I have already written a review for this movie but people still are not getting my point. You know what stop being so cule. I mean seriously if you do not like Taylor Lautner then dont even go see his movies because you know you are going to hate it. So this is just me spreading the word to not be a bully in other words. Just because he is a celebrety does not mean you can talk crap about them. What the hell is wrong with you? I f you were a celebrety would you like people talking crap about? Think about it that way. He can come on this cite to see how the movie did and get hurt by what people typed in. All I am saying is to be carefull with waht you say. It could affend, hurt, and make people sad including you so just be curtiouse. Now remember that these words are coming from a ten year old but does not mean  that if you are older than me you know it all. I am not saying I know it all because I do not but what I am saying is just to be nice because I have realized that to many people these days are way to mean and have no respect for others. So when you are righting these reveiws do not just think about your self think about others also. Or go to hell because that is no way to be acting. please just be nice. That is all I am asking. Ok. Then.",
      "total_reactions": 4,
      "user": "abduction"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "mvoie is not so good but can be seen for time pass.download movie at www.tenthgalaxy.com",
      "total_reactions": 3,
      "user": "BHOPESH"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "Not very much to say, it's almost not a movie. Despite the presence of truly good actors as Sigourney Weaver, Alfred Molina, Jason Isaacs (only here for the money. I don't see other reason), it is simply boring. Taylor Lautner is the worst in the film so far (it's a kind of exceptionnal performance).",
      "total_reactions": 1,
      "user": "Hyliad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I loved the movie! It was great! More like fantastic! I wish people would stop posting negative comments about it though.",
      "total_reactions": 1,
      "user": "portia_lautner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "I have to agree with other users the movie is the teen type of movies lots of emotions and complicated looks , the story is too short to be a good movie , lovely performance from the psychiatrist .",
      "total_reactions": 1,
      "user": "awmi1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "This seems to be a popular movie to hate for the critics but those guys are pathetic so I rarely listen to any of the garbage that spews out of their mouths. They like different, not good. This movie is the exact opposite... it's good, not different. There's nothing exceptional about this film. Taylor Lautner's acting range is still very limited so I'm not sure how many more lead roles he'll get in mainstream cinema. He's still young so he could still become an impressive action star because he's got the skill set for it in terms of fighting and athletic ability but if his acting doesn't improve he'll just be another of the bunch. The rest of the cast did a solid job though and the action sequences were done well. Lautner doing his own stunts helped in that area. The story, while not necessarily unique, still developed well. Overall, this was a good but not great movie that was plenty entertaining enough for its genre.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I Really Loved This Movie! Taylor Does A Great Job, Big Jump From Twilight! This Is One Of The Best Of 2011!",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "For what it's worth, I was actually pretty entertained by this movie, flaws and all. The acting is pretty bad; Taylor Lautner is horrible, but is not just him that is bad, there are some very capable actors here that do not deliver. The fault is not on them entirely because the script is bad as well, there is some atrocious dialogue in this film. The main problem with Abduction though is the plot. There are gaping plot holes in the narrative that just leaves way too much up in the air; by the end of the movie you still won't have any clue who any of the players are, whether they were good/bad, or what their motives were. This makes for a film that has some decent action sequences that entertain, but a story that frankly makes zero logical sense.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "More like ab-DUCK-shun, because this movie is destined to follow in the footsteps of \"Howard the Duck\".  \"Abduction\" will undoubtedly be one of the worst, if not the worst movie of the year, when lists come out in December.  Taylor Lautner is impressive with his physical ability and high kicks, but the absolute painstaking part of the \"Abduction\" experience is Lautner's acting...or the lack of ability to do so.  A true alien abduction, complete with probing, would have been less painful.  I see a Razzie in Lautner's future.  I would have to say it is a sure thing.  As for the plot, not really well thought out, but who am I to say...I was too focused on Lautner, wondering if his next line may just be the one he nails.",
      "total_reactions": 0,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Not as bad as I expected. Lautner isn't as bad in this as his past films......but he isn't that good either. The presence of Weaver, Isaacs, and Molina affords this film the performance levity that it so desperately requires to be even halfway interesting. However, even those players can't make this better. It's not horrible, but we soon learn that the central topic of this film really doesn't apply at all.....just another \"on the run from the bad guys\" plot with actors that are nice to look at.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "Abduction is an extremely poor film for a number of reasons. Firstly, the lead Taylor Lautner can't act. Secondly the script is repulsively bad. Thirdly, in this film, director John Singleton demonstrates extreme technical ineptitude - the framing is clumsy, the editing heavy-handed, the pace and tone of the film inconsistent. I guess the film has one selling point - that at an alarmingly frequent rate, it is unintentionally hilarious. Despite all these basic film errors, the most shocking, most insulting thing about Abduction is the number of exceptionally talented actors (Sigourney Weaver, Alfred Molina and Jason Isaacs) who are willing to sell their souls for a pay cheque.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "What are some of these uninvolving and tedious set pieces you may ask. I donâ",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "I thought that Abduction would be boring & lame kinda thriller and hay, i was right . Its the worst thriller i have ever seen. Its was like Non fantasy version of Twilight . Everything in this movie sucks . Acting was so bad ....I mean really really bad. Its so easy to find that how bad Taylor Lautner's acting is . The story wasn't so good and the Script was really really bad . aah ! Watching Abduction  is like 106 minutes of pain .John Singleton's directional comeback after Four Brothers(which i really enjoyed) turned out to be a total failure .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "Rarely does acting take me outside the experience of a film. Poor acting is acceptable but this is just awful. It almost as if Taylor Lauten has no acting skill at all... Oh wait that's probably the case. When will Hollywood realize that it takes more than a jaw line and six pack to carry a film.  2 is generous because the direction wasn't bad and the supporting cast held their own. SKIP THIS FILM. Unless your a 14 yr old girl. Then you can probably masterbate to this for weeks.",
      "total_reactions": 0,
      "user": "sssfdg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "A movie that stumbles out of the gates, and never gets back on it's feet.  Mediocre and uneventful, the movie will leave you with a sick pit in your wallet; and the regret of paying to watch it.  The plot is ridiculous, the acting is atrocious, and the story progression is spotty and lacks substance.  One of the worst movies I have seen, and it is definitely Taylor Lautner's worst role ever.  Terrible, and nothing else.",
      "total_reactions": 0,
      "user": "Billyheel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "I personally liked the movie. I'll admit, i was expecting more but it was worth the 10$ to see it. Taylor Lautner always has a pleasing performance, and the newcomer Lily Collins didn't disappoint either. The storyline was a little jumbled, but the action was thrilling. Good premise, good plot, but i didn't love the beginning. However, it was a movie worth seeing.",
      "total_reactions": 0,
      "user": "jillmacintyre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "I don't understand how such an amazing cast could surround Taylor Lautner and still leave him looking so wooden. Completely disappointing. Gaping continuity errors.",
      "total_reactions": 0,
      "user": "JFK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Hmm im just winderring what the director thinking when make this movie,,",
      "total_reactions": 0,
      "user": "Singgihsatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Well, teen heart-throb, Taylor Lautner, finally has his own feature film, and while the story sounded pretty good, I didn't expect much. To be honest, the only thing I've seen him in were the Twilight films and I  hated them! In Abduction, Lautner shows that he's more than just a pretty face. Not only can this kid act, but he's a martial arts expert too! The story is super strong and he is supported by some great veteran character actors, like Sigourney Weaver. The story follows a boy, who while doing a school project, finds a picture of himself on a missing person website. It leads him into an unbelievable story, full of twists and turns. It's unbelievable, yes...but still good! It's an action film, with a very solid background story and some fairly big names. Don't let the big name Teen Idol starring in it, keep you away. If you love a good action film, like I do, this one's a winner!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Terrible, terrible, terrible film, is one of the worst movies that I can watch, I think that the film look like the Bourne saga can be good, but no, is a bigger disaster, is a terrible film.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 3,
      "text": "Fair enough, this movie is fun to watch, ehat with all the action sequences and fights that would most likely never happen. But in terms of critically analyzing it is awful. The script was so so bad with not a single line that actually had meaning or was good, the acting was unbelievably, the only word for it, c**p, with no emotion and when taylor lautner cries in this film it looks like hes pusing really hard to get the tears out, and the rest of the card are like watching moving wood. How this film scored the A List stars it did i will not know because this film was absolutely disgraceful,",
      "total_reactions": 0,
      "user": "charliew1820"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "You know what's the best thing about this movie? The title. \"Abduction\" is a total failure to live up to its intense-sounding title. The dialogue is silly and laughable, the acting is generally terrible, and not even Taylor Lautner can save this disaster.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Fair enough, this movie is fun to watch, what with all the action sequences and fights that would most likely never happen. But in terms of critically analysing it is awful. The script was so so bad with not a single line that actually had meaning or was good, the acting was unbelievably, the only word for it, c**p, with no emotion and when Taylor lautner cries in this film it looks like he",
      "total_reactions": 0,
      "user": "charlieW24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Abduction is your basic action film with nothing new nothing interesting nothing to really show. Taylor Lautner is a ok hard ass but the director obviously can't get the correct emotions out of his cast some very corny lines and no awesome display of action.",
      "total_reactions": 0,
      "user": "SilentHightimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Ich habe wirklich super viel gelacht.Ob der Dialoge und Handlung. Ein sehr einfach gehaltener Film der nach dem Thriller-Schema-F \"produziert\" (gefertigt wurde). Alfred Molino sieht einfach für mich immer wie ein beleidigter Junge aus. Will ihm aber noch ne Chance in seiner Karriere geben. Spannung hat der Film ja schon. Er ist eben einfach nr Handwerkskunst.",
      "total_reactions": 0,
      "user": "entertrainer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "I avoided watching this movie for some time cause I thought it might have to much teen love scenes. I found out I was right! It has some action, but nothing really good. It`s worth watching, but mostly if you don`t have other options. Also worth watching, if you love teen romance. I watched it for free on Demand I think this is why I don`t hate it as much as some other people lol If I payed for I think I would be pretty mad lol",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "A highly forgettable movie that gets most of its audience from screaming girls who love Taylor Lautner.  Unfortunately for Lautner he shows he can't be a leading man.  Not to mention the script stinks.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "In my opinion \"Abduction\" was a great movie. The main points that were the highlight of this movie was the script, the acting and the direction. The script was very well put together. The words flowed together and made the whole movie seem real. The script showed the hurt and distrust that Nathan had for everyone around him. For example, “Trust needs to be earned” was said throughout the entire movie. The script also helps the plot out by showing the intensity of the movie. You weren't really sure what was going to happen next, which was the main point of the movie I believe. For example, when Nathan finds out that the “parents” he had been living with his whole life turn out to not be his actual parents he has to find out how to deal with this. He also sets out on a mission to find out who his real parents which involved a lot of distrust of people, fighting and confusion.The acting was very well put together. The way Nathan showed his emotions helped me to respond to the movie emotionally in a way of understanding what it’s like to not know who to trust and the hurt of not knowing the truth. Also, the smaller parts of the movie helped play out the movie. For example, Nathan’s friend who helped him get the tickets to the baseball game and gave him everything else he needed was a huge part of the movie. Lastly, the direction of the film showed throughout the movie. Everything in the movie worked well together and it didn't look to me like anything was controlled or faked. I do believe that the film succeeded it’s original purpose, to be suspenseful and keep the audience on their toes.",
      "total_reactions": 0,
      "user": "AshleyMNCHS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "This film was interesting and had a little mystery in it. I have to say that i expected more but it wasn't like the worst adventure film i've ever seen. It has some good action scenes but that's all for that movie. The actors were nothing, as if they weren't there. I liked Maria Bello's appearance",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "Abduction tries to be an intelligent spy thriller, but ends up falling a bit flat at times. Taylor Lautner is a bad actor, of course, but he's not completely horrible in this movie. The plot and writing are okay, and the transitions from scene to scene aren't so awkward, but the movie misses the mark more times than not.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "The film has poor dialogue and it is obviously a rip-off of The Bourne movies,, you definitely expect more from a director of Singleton's caliber. Lautner's acting will improve in the future he's only 22.",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Lautner is just very appealing and hot in this movies. The story of the movie is simple and just fine.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}