{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 42,
  "mc_mixed_rating_frequency": 108,
  "mc_movie_name": "Abraham Lincoln: Vampire Hunter",
  "mc_negative_rating_frequency": 48,
  "mc_positive_rating_frequency": 119,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 88,
      "summary": "A blast, the best action movie of the summer."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 83,
      "summary": "When Bekmambetov is in full stride and the gore, oaths and silver bullets are flying, it's a kick.  The title may sound like a joke, but Abraham Lincoln: Vampire Hunter is serious fun."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 78,
      "summary": "Benjamin Walker, as Lincoln, may not have the gangly gravitas of Raymond Massey's \"Abe Lincoln in Illinois\" – he looks like a young Liam Neeson doing a younger Bruce Campbell, frankly – but he does have a sly, self-effacing sense of humor that feels ever so Lincoln-esque"
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Instead of getting smirky and campy and blowing out the joke in the first few scenes, Grahame-Smith and director Timur Bekmambetov straight-face it. They ask themselves, well, what would it be like if the main struggle of Lincoln's life were with vampires intent on taking over the new world? And they answer the question as realistically and soberly as they can within this loony framework."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 75,
      "summary": "Without a doubt the best film we are ever likely to see on the subject - unless there is a sequel, which is unlikely, because at the end, the Lincolns are on their way to the theater."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "There's definitely some empty-calories, summer-movie fun to be found in this ludicrous genre mashup, most of it courtesy of maniacal Russian director Timur Bekmambetov, who stages hilarious, imaginative, almost free-form action sequences like nobody in the business."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "Genre enthusiasts will lap up the mixture of action and fantasy, while history buffs who don't mind a bit of rewriting will dig into an alternative spin on the Civil War period."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 70,
      "summary": "A Civil War-era actioner of questionable taste and historical accuracy but surprisingly consistent entertainment value."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "A stylish slasher of a movie, a monster flick that does its vampires right, if not their real-life counterparts."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "Both terribly silly and a lot of fun."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "One expects a movie called Abraham Lincoln: Vampire Hunter to be rich in wit and black humor, but writer Seth Grahame-Smith and director Timur Bekmambetov opt to play things reasonably straight."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 63,
      "summary": "The script leaps forward with an absurdity almost as great as Lincoln's own strength."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Bekmambetov directs with gusto, and the forthright absurdity of the story, combined with its weirdly heartfelt self-belief is winning."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 58,
      "summary": "With so much flesh crunching and bloodletting, it could have been scary as all Walking Dead get-out. Instead, the movie plays safe by cutting every theme down the middle - a swing that's effective when splitting wood or vampire skulls, but dull when applied to filmmaking."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "It's not nearly as snappy or campy as it should be-though its self-seriousness is its own kind of entertainment."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 50,
      "summary": "It sounds fun. It's a little fun. For a while. But Bekmanbetov shoots every killing spree like an addled gamer, working that slow-down-speed-up kill-shot cliche like a maniac."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 42,
      "summary": "The training montage where Lincoln learns to twirl his axe around his body like a baton for no apparent purpose is neither the movie's first laughable sequence nor its last, but it sums up the movie's aesthetic: The filmmakers mistakenly think nothing is silly if it's done with a grim enough facial expression."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "It doesn't take long for Bekmambetov to wear out his welcome with a laundry list of generic-looking action sequences: When you've seen one vampire get stabbed in the eyeball, you've seen 'em all."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Unfortunately, there's also a certain artificiality to the whole film, both visually and narratively."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Abraham Lincoln: Vampire Hunter is such a smashing title it's too bad someone had to spoil things by making a movie to go with it."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Given the subject matter, an exercise in delicacy and restraint was unlikely, but it's too bad that the film's concept is way more entertaining than what has ended up on-screen."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "The grave tone makes it stiff and leaden, the digi-saturated look is a turn-off. Damnable and disordered."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "The problem with movies based on a single joke is that a single joke is rarely funny enough to sustain the running time of a feature-length film. And with Abraham Lincoln: Vampire Hunter, the whole joke is in the title."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Watching this is like flipping channels randomly between a Masterpiece Theatre drama and a splatter film on Cinemax. If you're like me, you'll stick with the splatter."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "Possible resulting \"fun\" is only slightly mitigated by contemplation of the wearisome decadence of American popular culture."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2012
      },
      "score": 40,
      "summary": "What [Bekmambetov] doesn't do is offer us any respite from his 3D CGI barrage, an assault on the senses that makes the bullet John Wilkes Booth fired into the real Abe's noggin seem calming by comparison."
    },
    {
      "critic": "James Adams",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 38,
      "summary": "The biggest high comes from the images evoked by the title alone, or the title in tandem with the movie poster, doesn't it?"
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 38,
      "summary": "The movie deserves a stake through the heart."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 25,
      "summary": "A pox upon history and an insult to the 16th president of the United States. It's that, of course - actually, that's the point - but this joyless, deafening cinematic headache commits a different crime. It's a sin against entertainment."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 25,
      "summary": "Other than its campy title, not much about Abraham Lincoln: Vampire Hunter is fun."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 25,
      "summary": "Enormous in its scope and colossal in its stupidity."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 20,
      "summary": "What I don't understand is why this extended piece of idiocy chose to sink its stinky teeth into our 16th president. If an axe-wielding hero was required, George Washington would have been the better choice, with the Redcoats as bloodsuckers."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 20,
      "summary": "This ludicrous CGI extravaganza, based on the comic horror novel by Seth Grahame-Smith, can stand proudly beside the best-worst of Ed Wood and Uwe Boll."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 20,
      "summary": "This insipid mashup of history lesson and monster flick takes itself semi-seriously, which is truly deadly."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "summary": "I didn't know whether to be more offended as a moviegoer or as an American, but I do know I'd rather gargle nitroglycerine than watch this again, though given that the film looks like it were buried under a log cabin for a century, I barely saw it the first time."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Jumped around from part to part way too fast and the plot in the movie deviated from the book wayy too much.  Even with these flaws there were parts that I found funny and exciting but i think with a better director and if the plot was more in line with the book it could have been a great movie",
      "total_reactions": 8,
      "user": "ORidenour"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "I actually laughed at some of the action in this movie.  Not because it was bad, but because it was so over the top ridiculous I couldn't help but be amused.  By the same director who did the bullet-bending \"Wanted,\" and if you liked that one you'll probably have fun with this.   If not, or if the trailer and concept of a revenge seeking, vampire-killing Abraham Lincoln doesn't put a smile on your face, go ahead and skip.  High art and drama is no where to be found here.  If you love a good bad action movie, you'll love it.",
      "total_reactions": 5,
      "user": "weddingsinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "I can't believe critics are complaining that this movie conflicts with history. The movie is called 'Abraham Lincoln: Vampire Hunter' what did you expect? Lmao. This is probably the second best new movie I've seen this year but that's not saying much... not much at all.",
      "total_reactions": 3,
      "user": "Subject98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "This is a very strange film, I'll start by saying I knew nothing about it before I went and was honestly expecting it to be some horror/comedy/action crossover.  It jumps about far too much and doesn't seem to know what type of film it wants to be which makes for a confusing experience. On the plus side the action scenes are unbelievable (I'm not going to spoil anything but the horse chase is something else!), the cinematography looks beautiful and the actors all play their parts very well.  It's certainly not a badly made film, but the plot really needed a bit more focus. I did have a laugh watching this film although whether that's the intention of the creators I'm not sure.",
      "total_reactions": 3,
      "user": "jordy2009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "Textbook example of a mindless blockbuster which fails to excite, breathe ANY new life in terms of its formulaic plot and avoid clichés. One of the worst films of the year!",
      "total_reactions": 2,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Timur Bekmambetov (Director of \"Wanted\") brings us a side of Abraham Lincoln we never new about. . . . in slow motion, with an axe, who kills vampires. Does the plot sound stupid? Don't let it ruin the experience. As ridiculous as the plot may sound - \"Abraham Lincoln: Vampire Hunter\" is nothin' but a bloody, vampire killing, good time. The slow motion effects may be over used at times, but hey, it's still pretty damn entertaining to see Abraham Lincoln slice up vampires with an axe. I can now say he's my new favorite president.",
      "total_reactions": 1,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Apparently Abe Lincoln and Buffy have more things in common that we thought, a reminder that vampires, much like their mythical relative, zombies, can be shoehorned into pretty much anything. Such a strange concept this was, it's bound to be silly to match a president with blood-sucking half albinos, yet there's an appeal to the axe wielding kills, a true artistic butchery prowess that I have yet to enjoy much on cinema. Yes, the justified axe murdering is the star in this confusing horror sometimes comedy flick.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "When one attends a film about a former United States President slaying unholy creatures of the night, one does not expect a beautifully written, tear-jerking, dramatic masterpiece. One expects awesomeness, which Abraham Lincoln: Vampire Hunter delivers.",
      "total_reactions": 1,
      "user": "KainLupus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is not nearly as stupid as you'd expect it to be. Its not a comedy film because I think a lot of people thought it was. This film follows a pretty accurate timeline that is essentially the same as the life of Abraham Lincoln, it just fills in all the unknowns with vampires. You really learn some things from this movie. This film may motivate some young people to learn more about Abraham Lincoln. There is no need to be upset about this if you are American.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "An amazing action flick composed of fictional history and vampire ass-kicking! Even though the film has its flaws, the over all win is the action. If you're yearning for amazing fight scenes, excellent set designs and a skilled president, this is your movie.",
      "total_reactions": 15,
      "user": "TravisFinn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Oh man, this movie... let me tell you my experience. My friends and I like to go see movies that look corny and bad (like Skyline and things of that nature) at non busy theaters in the middle of the day so that we're the only ones in the theater and do laugh-along commentary, sort of like it's MST3K. We went to this movie to do just that. It looked like a corny movie with OK action and a bad story, and reading reviews confirmed this. What did we get when we sat in that empty theater and watched it, though? We got a gripping experience with awesome action, intense excitement, awesome acting and plot. An all around awesome movie that we all left saying that it was one of the best movies we had all seen in a long time. Go see this movie. You will not be disappointed, and you will not be laughing along.",
      "total_reactions": 6,
      "user": "loungegecko"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Perspective: I have never read the book or Wiki page for that matter",
      "total_reactions": 3,
      "user": "MightyMolasses"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "While is does fall from the book on almost everything except characters and idea it was a great action movie. I was hoping that it would be the same as the book, but was still very pleased with this movie. I think people were just turned off by the whole idea of it. As a fan of action movies and alternative history I highly recommend the book and the movie a little less.",
      "total_reactions": 3,
      "user": "Gandund"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "The director couldn't be bothered setting up his characters' emotional responses.  He decided it was better to convey the characters' emotions by simply bludgeon you over the head with the dialogue.  This movie was just awful.",
      "total_reactions": 5,
      "user": "jsmith9525"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Don't expect too much from this film, it's just what the title suggests, Abe Lincoln killing vampires... with his silver ax. It delivers on that very well, abandoning all inhibitions or historical accuracy. During the film, I really found it better to leave all knowledge of the Civil War or Lincoln himself at the door and simply enjoy the fun, surprisingly well staged action movie that I was presented with. All subjects covered are grossly inaccurate but aren't quite caricatures, which is what I was afraid of. The action is fantastic, owing many shots and sequences to films like the Matrix but are kept fairly original.Benjamin Walker and his co-star Dominic Cooper give adequate to good performances for their admittedly shallow roles. Anthony Mackie, Mary Elizabeth Winstead and Jimmi Simpson all do what supporting actors should do, augment the plot and roles of the main characters, and Rufus Sewell plays a fun villain. Don't see this movie for scares; if you're looking for a dark, serious tale this really isn't it. It's more what Diehard or even The Patriot would have been like with Vampires, good (if slightly trite) action, shallow plot, great sets and atmosphere. I liked it, despite my love of historical accuracy and long shots. If you're looking for some surprisingly different fun at the cinema, you will too. Happy hunting. ^_^",
      "total_reactions": 6,
      "user": "Odin_the_Red"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Abraham Lincoln: Vampire Hunter is a wickedly-fun, over-the-top vampire slashfest that requires total suspension of disbelief.  Taken from the novel by author Seth Grahame-Smith (who also wrote the screenplay), Hunter is historical fiction on steroids, requiring total suspension of disbelief and a healthy appetite of the macabre to take it seriously.  But once those barriers are removed, Hunter is a wild ride, almost challenging its audience with such a ridiculous plot that no amount of sane historical inquiry can be applied. After witnessing the murder of his mother by his father's former slave boss Jack Barts (Csokas) when he was nine, the now-adult Abraham Lincoln (Walker) decides to exact revenge by first getting drunk at a bar.  There, he meets the European-stylized Henry (Cooper), who attempts to discourage Lincoln from carrying out such folly.  Soon, Lincoln has Barts dead on the ground, or so he thinks.  Barts is really a vampire, and the human trafficking he conducts represents food for the growing vampire population in the South.  Henry steps in to save Lincoln's life, but only with the promise that he join Henrys campaign to slay the escaped Barts and the other night crawlers.  Soon, the former rail splitter is doing just that, but not before several funny and well-done sequences with Henry 'training' Lincoln with his fists.  An unconventional man, Lincoln won't use standard weapons to kill blood-suckers, instead choosing one of a rail splitter to carry out his task.  Covered in silver, Lincoln's axe becomes the anvil for his war against those who killed his mother.  The work of a vampire hunter is a night job, and Lincoln must maintain a low profile by working as a store clerk for friend Joshua Speed (Johnson).  There, Lincoln meets Mary Todd (Winstead), quite against the wishes of Henry, who demands 'no connection, no children' from his disciple.  Courted by Senator Stephen Douglas (the uncredited Alan Tudyk), Smith interjects a bit of historical irony, as Douglas and Lincoln will eventually debate the issue of slavery throughout Illinois in 1858.  As Lincoln wins Todd's hand and begins to ascend through the ranks of political society, his vampire body count begins to rise.  This merits the attention of head vampire Adam (Sewell), who sends his assistant (supermodel Erin Wasson) to stop Lincoln.  As the Civil War begins and moves quickly to the critical Battle of Gettysburg, Lincoln must decide if he'll continue to fight Adam, protect his family, or try to save the nation from a South littered with vampires and slaveholders.",
      "total_reactions": 4,
      "user": "MattInRC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Awful movie.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Abraham Lincoln: Vampire Hunter was a fantastic film when I went to the cinema last to see it last night. The plot in my opinion was fine, revenge and kill vampires. What more do you need? Benjamin Walker did a brilliant job of portraying a young and mid-aged Lincoln who is a bad ass. This made me feel Lincoln as a president the best of all time.",
      "total_reactions": 3,
      "user": "sweexmonxx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "The movie was pretty decent. Interesting story and cool action scenes combined with a period of history I enjoy learning about. There isn't a lot to complain about. Fun summer movie to watch.",
      "total_reactions": 3,
      "user": "theoffice"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "Ok to start with I thought this movie might be alright or a least a bit of fun but straight the way vampires in the sun along with Twilight will people never learn to mess with vampire mythology its just stupid . If that was not bad enough the story was poor the acting bad and the action scenes just did not work I would keep well away from this one if your a film or vamp fan my first zero score very bad.",
      "total_reactions": 17,
      "user": "scoley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "A great example of style over substance. The action is slick and edited well and the music is great but everything in between is so banal that I couldn't keep watching it. I thought it sounded like a funny concept and maybe it could have worked..but it was just boring.",
      "total_reactions": 1,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "This could have been a good movie.  This is all action scenes, it skips over what would have been story accompanied by lots of epic orchestra music.  5 seconds of fighting skips its the future with 5 seconds of fighting and so on trough the entire movie.  The formula stays the same and it gets boring quickly.  What little shreds of story there are get minced into meaninglessness.  This reminds me of captain america, the way it is filmed and it's insincere scene-chopping is much the same.",
      "total_reactions": 1,
      "user": "SkizDriz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I figured the critic score for this movie would have bombed, but I wasn't expecting the user scores to be so lukewarm either.",
      "total_reactions": 1,
      "user": "CommandantOreo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Believe me, it's crap. The biggest mistake the film made: playing a 'ridiculous' premise completely straight. What a big disappointment. The premise is interesting but the whole thing lacks energy and believe it or not, has similar 'plot points to another 'vampire themed' film last year, 'Priest' albeit in a much different setting. If you really want to watch an Abraham Lincoln film, wait for Spielberg's effort next year.",
      "total_reactions": 2,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I had hopes that this was going to be great movie because of Tim Burton producing it but I was very wrong! Almost everything about this film was bad. Do not go see this movie",
      "total_reactions": 1,
      "user": "ZayneM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "It's a pretty well made period vampire movie, if you like that sort of thing.  But I kept wondering why Abraham Lincoln needed to be the historical figure main character and I never got an answer.  The action is mostly well done.  The history is difficult to reconcile with reality.  But it was still fun to watch, even though the movie takes itself too seriously.  But that earnestness is also in a way what saves it from being as exploitive as the title suggests.",
      "total_reactions": 0,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "First off the pacing is way too fast, as they jump from scene to scene very quickly, its hard to follow sometimes as a result. The first few vampire fights are shot sloppily as the camera cuts around so much that its hard to enjoy the fight as a result ( I heard audible \"what the f***s\" from other audience members at the showing i was at). For a movie about Abe Lincoln killing vampires, it also took itself way too seriously at parts, which would be fine if it was like that the entire movie, but just as you start to buy into it, there's a ridiculous sequence to take you out of it (horse chase sequence I'm looking at you). However the acting is surprisingly solid for a movie of this title, and everyone does a solid job, (although the old age makeup for Mary Elizabeth Winstead was awful as she still looked 20 years younger than Abe). There are a couple of standout sequences such as the plantation fight, and the train climax, and just seeing fully aged Abe killing vampires with an axe is pretty awesome. All in all, don't go into this movie expecting a masterpiece (why would you anyway?), but it does have its fun moments. Just be sure to check your brain at the door.",
      "total_reactions": 0,
      "user": "Cntomer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Now, Timur Bekmambetov is well known for the effects he uses in his movies and this is no exception. There is blood and gore all over the screen as death is meated out in many and varied ways, all in glorious slow motion. The trouble is we’ve already seen that kind of stuff before; there’s nothing new or particularly innovative here. Yes, it’s very well done; the effects guys did an excellent job; but I would have liked to have seen something different. The plot; again disappointing, it just followed well documented events in Lincoln’s life and added a narrative that meant he had to do this or that to thwart the vampire hordes. Not exactly groundbreaking either. The performances were all pretty good although nobody really stood out and nobody looked like they were really stretched either. Over all I found it pretty disappointing; not quite as bad as ‘Jonah Hex’ (2010), but heading that way.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "This history mashup follows the 16th president as he battles bloodsuckers and copes with Civil War (started by the Confederacy to keep slaves alive as food for Southern vampires). The illustrative period style is visually appealing, but the pacing is uneven. There are some dazzling, violent action sequences. I'm a huge fan of director Timur Bekmambetov and even though he manages to contribute many of this signature touches to this film, it's not his strongest effort. Overall, it's an uneven, but entertaining fantasy.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "lazy, boring, a typical movie to spend almost two hours sitting and killing time, does nothing, is a bit silly and totally lack of everything. next!!!!!",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Don't get too seriously silly, don't you read the title? Lincoln seriously as vampire hunter, no kidding. I don't have any serious problem with it although suffer confuse script, uneven pacing and boo moment. Let me get this straight, watch this movie and enjoy America gothic with Russian craziness, Don't forget to google that fake story.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "I wasn't going to see this film, but a friend really wanted to go, so I obliged him. I had no expectations for this film at all. It is a graphic novel movie adaptation, in every way. I'll start with the plot. It's preposterous, but at least it had one, which is a precious commodity these days. Much the way the Persian Army was demonized in Frank Miller's '300', we have to suspend the disbelief that the C.S.A.-era South has been infiltrated by a vampiric cult. If I was from the South, I might take objection to that characterization. We also have to believe that old honest Abe was some sort of ninja kung fu powerhouse. It's a stretch, but necessary, and shot really well in the Legendary Pictures style. The whole vampiric curse thing is bent all out of shape, where werewolf rules and daywalking are suddenly permissible. All in all, I thought the actors did a great job, considering what they had to work with. The effects were decent, although some of the action scenes are so ridiculously impossible, you can't help but laugh out loud. Ultimately, I found it to be an entertaining piece of fluff. I have no desire to watch it again, or purchase it on DVD, but it's fun once.",
      "total_reactions": 0,
      "user": "drm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "First of, even though I'm a broken record on low scores, \"this movie is, according to reviewers, worse than the Twilight Saga (write it up there in the corner and see the scores for yourself)\", and that was a must say because both use vampires in their stories and both stories change some details for their vampires as well.",
      "total_reactions": 0,
      "user": "vahn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Fantastic flic of a film. It doesn't always take itself seriously, and the fighting can be over the top, but this is a fun movie, with some very good poetic justice on the vamps, good drama scenes without becoming angsty, and is definitely worth 9 out of 10.",
      "total_reactions": 0,
      "user": "Morte"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "It's just stupid. The actors bravely plow through the senseless dialoge. Idiotic action scenes put in for the 3D effect. This could have been a great movie. Sadly it's not.",
      "total_reactions": 0,
      "user": "Lillyverona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "I read the book before going to this, and I was VERY disappointed in how off they could be. Some of the characters that are in the book AREN'T even in the movie! And the most famous quote in the book isn't that sets the twist at the end. But if you went to this blind and not have reading the book then I could see you appreciating the action and the creative story. Some of the acting was pale and emotionless, a somewhat confusing story, but had amazingly choreographed fight scenes. I enjoyed it, but I wouldn't go out of your way to see it.",
      "total_reactions": 0,
      "user": "conboydude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "I enjoyed it, if you can get over the crazy idea that Abe Lincoln hunted vampires. There are some standout great scenes in it, the train scene, the horse chase scene. It's full of action, the bad guys have some good dialogue and it's genuinely sad at one point. Abe really makes you root for the good guys. 7.5 outta 10. I say go see it.",
      "total_reactions": 0,
      "user": "Desdicado"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Abraham Lincoln: Vampire Hunter is really entertaining and features some great performances. However the film does suffer from CGI overload and relies a little too much on slow-motion.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "It's obvious to me that the makers are trying, not very successfully, to cash in on the hype around the Sherlock Holmes franchise. Some well crafted action sequences and watchable moody art direction aside, this is just a desperate attempt to literally make something out of not very much at all. The fictional story behind AL is laughable. And the reference to real life slavery and emancipation in poor taste. When you find your fast forwarding through the last half of the movie you know something's gone horribly wrong.",
      "total_reactions": 0,
      "user": "nickclarivette"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This is a better film than the movie Priest. The action is big and the plot is smart for a movie in a genre like this. Its an impressive summer movie.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "This movie knew exactly what it was: Abe Lincoln killing vampires. This movie far exceeded my expectations. It was over the top in an extremely funny way and the director knew it. This is not a great master piece of film but not every movie needs to be. I never once had my smile leave my face while I was watching this movie. It was up surd and hilarious.",
      "total_reactions": 0,
      "user": "philatisu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Didn't have high expectations (got dragged to it by a friend) but I really enjoyed the movie. Some gorgeous visuals, occasionally inventive use of 3D, and a fun overall concept. Above all I was not BORED, which is hard to say about most other movies. This is not a bad film, no matter what some people say. And I loathe fanboy crap.",
      "total_reactions": 0,
      "user": "tibzoid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "A surprisingly good film. While some people may call it overrated this film really does blend history with fantasy in a clever way. I honestly was surprised at how good the action scenes are, plus it has some great music and special effects. One of my favourite vampire films!",
      "total_reactions": 0,
      "user": "AlexFili"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Truly an amazing film in every respect. Meanwhile, I must say it was original and courageous choice to make a Lincoln Slayer. The story follows more or less the true life of the president in the midst of putting his secret life as a vampire hunter. The fun is guaranteed and there are never moments of boredom. The 3D is well done and the music can bring the viewer in action.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "There is absolutely nothing redeeming about Abraham Lincoln: Vampire Hunter.  The movie was rotten from the start when it became clear that instead of making a fun movie like the title would suggest, the filmmakers tried to sell us a very real and serious picture, something that just isn't possible considering the outlandish themes present in it.  At times the plot of the movie becomes confusing and just down right ridiculous, even for a Vampire movie.  Then, of course, there is the cast that didn't put any emotion into their characters they portrayed and seemed rather stoney for the entire duration of the movie.  All this aside, you would at least expect the visual effects to be amazing, right?  Wrong.  The effects are laughably bad, and the many fight sequences are excessively \"stylized\" with jarring transitions between slow motion and real time.  So, in summary, you shouldn't see this movie.",
      "total_reactions": 0,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "This film is based on a novel (which by the way has a different ending), and shows Abraham Lincoln, in an alternate world where he loses his mother to vampires, and fight against them in his revenge and eventually in a Civil War, where the South uses them as secret weapon. The script is mildly interesting and use historical facts, that were changed or omitted (eg the 4 children of Lincoln does not exist here), admixed with the central plot - the acting is good, but nothing worth of an Oscar. The most prominent and attractive feature is the photography of the movie that uses some cool effects (Matrix style) and color contrasts that are very interesting in several scenes. But there again: any script of other era with vampires would be cool anyway - the way the inspiration in Interview with the Vampire by Anne Rice is more than obvious to me ... uncompromising, is a good fun action movie, but a poor movie overall in other aspects. Another advise: if you will watch it in normal LED / LCD / Plasmas Television the image is very good, but you see int he scenes that it was made to watch in 3D televisions. Rating: 6.5 / 10.0.",
      "total_reactions": 0,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "This movie was a lot better than I thought after I heard the title. The story is good and it's cool how they fit it in and made it work with history. I bought the 3d Bluray edition and if you have a 3d TV it's definitely worth it the 3d is very good In this movie! Anyone who likes fictional and historical type movies is sure to like this. Highly recommended!",
      "total_reactions": 0,
      "user": "Bucs65"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Filled with action giving a amazing time in theater, but it has it's weaknesses, There are problems with acting and the myth behind vampires is mast up in it. Al the negative parts can and will be forgotten by the amazing set designed and fight scenes. Overall its an okay movie.",
      "total_reactions": 0,
      "user": "deamonhunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Four score and seven years ago our fathers brought forth on this continent a new nation, conceived in liberty, and dedicated to the proposition that all men are created equal... But they never said anything about vampires... Years before he set off to become one of our nation's greatest leaders, Abraham Lincoln stalked the night in search of the bloodthirsty vampire that took his mother's life. After discovering the dark secret that connects the slave trade to the vampires' food source, Lincoln trades in his axe for a prominent position in politics, where his words serve as a far greater weapon against his undead adversaries. ABRAHAM LINCOLN: VAMPIRE HUNTER brings Seth Grahame-Smith's historic monster mash-up to the screen in a big way, with all of the overblown action sequences and wild special effects that make for fun, over-the-top summer blockbuster. While the deadpan humor may turn off many audience members that were expecting a parody or spoof, what makes it so oddly entertaining is that it isn't a comedy. It is played perfectly straight to the point of absurdity, earning big laughs along the way as Abe twirls his axe with deadly proficiency and carries himself like the Civil War's \"Rambo.\" A finer actor couldn't have been chosen over Benjamin Walker, who puts in an excellent performance as the President. The vicious vampires are just as dark as the humor as well, although Rufus Sewell does not present a memorable villain as their leader, Adam. The main issue with the film lies in the aforementioned action sequences, which become far too grandiose for a period piece of this kind. What worked perfectly well in Timur Bekmambetov's earlier films, NIGHT WATCH and DAY WATCH, reduces the imagery on screen to an over-stylized sense of cartoon violence, where a subtler approach would have benefited the character greatly. Still, there is plenty to enjoy in the unwritten history of old Honest Abe.",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "wow what piece of crap a movie bout abraham lincoln as a vampire hunter come on this was so stupid vampire action look ok but rest of it come on who ya fooling.",
      "total_reactions": 0,
      "user": "hollowfication"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "I must say I laughed on this one way more than on most comedy movies, if one asked me to describe its genre, it'd be a trash movie, like Robert Rodriguez's Machete. While the story is absurd and quite dull, the movie shines in its action scenes. Seriously, the horses scene is so ridiculous it's even fun. Never thought I'd see a horse being thrown at Abraham Lincoln, after which he just mounts it and continues chasing the vampire with an axe. It's a nice movie, just don't take it too seriously.",
      "total_reactions": 0,
      "user": "RealMuthaF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Interesting. Obviously the whole idea of Abraham Lincoln killing vampires is hilarious, but it was shockingly serious. Not comedic. However, this movie was VERY entertaining. Overall it's defiantly worth watching.",
      "total_reactions": 0,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "AL:VH was not the movie I thought it would be. Short of a few inconsistencies with vampire/vampire hunting abilities that were probably for the sake of the action scenes this movie was surprisingly serious and well executed. The story reminds me of older mythologies that were probably at one time based on real people and events that we enjoy while never for a second believing to be true (Beowulf, King Arthur, Hercules). I found it very enjoyable as such, a sort of Neo-Mythology.",
      "total_reactions": 0,
      "user": "Funksatron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "The most captivating and enjoyable history lesson you'll ever get.  Actually, surprisingly-accurate, given the outlandish premise. Great action, characters you find yourself interested in, and solid writing (for a Timur Bekmambetov film). I was a little unsure going in, but the film pleasantly surprised me with an atmospheric tone, tintype-style cinematography, and generous helpings of appropriate CGI.",
      "total_reactions": 0,
      "user": "Equinoqs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "To be honest, when I heard Abraham Lincoln and Vampire Hunter in a same sentence, my first reaction was",
      "total_reactions": 0,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "I didn't read the book, so I went in expecting exactly what I got: a very fun, over the top cheese fest full of action!",
      "total_reactions": 0,
      "user": "slayer4174"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Abraham Linclon actually had a strong potential at the beginning, but every seconds it weakness shown which makes this movie becomes forgettable. not a memorable movie from this year.",
      "total_reactions": 0,
      "user": "Alessandro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "I actually thought this was entertaining for a vampire flick. There is a \"tongue-in-cheek\" quality to the performances which makes this absurd story a fun frolic.",
      "total_reactions": 0,
      "user": "Berney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Abraham Lincoln: Vampire Hunter tells a story about Abraham before he becomes president. Instead of frat parties with embarrassing ending, Abraham spend his awkward youth finding his place in society while fighting vampires. **Contains no spoilers**",
      "total_reactions": 0,
      "user": "Kallary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "I really wanted to like this movie, but there just really isn't much there. The action scenes are repetitive, and the basic continuity of the film is flimsy. While the book strived for historic accuracy, and followed Lincoln's life, this book really did no such thing.",
      "total_reactions": 0,
      "user": "DeathBySmiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Loved it. FANTASTIC acting IMO and the story was incredible. It is nice to also have an actual vampire movie back on the screen. It was made out to be completely believable (if vampires really existed of course) and made good ol' Honest Abe out to be pretty bad ass. Great movie for any Sci-fi fan, bad movie for closed minded people with no imagination.",
      "total_reactions": 0,
      "user": "MrTexas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "i loved this movie it was a great thriller i was a little disappointed in the ending because it wasn't how  it ended in the book but i still loved the end because it was super funny over all loved the movie and you should definitely go see it if you haven't yet",
      "total_reactions": 0,
      "user": "inuyashalover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "I am not a fan of vampire themed movies, but this movie had s..l..o...w motion so why not? I can give this movie a 6/10 only because I knew what I was going to get when entering the cinema. Reasonable action scenes and not much else. I was entertained throughout the movie, but it will soon take its place on my seen and forgotten list. I was not a fan of Dominic Cooper in this film as his character reminded me of a weak copy of R.Downey jr's characters.",
      "total_reactions": 0,
      "user": "b3_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "Just saw Abraham Lincoln: Vampire Hunter. I have lots of mixed feelings towards this movie so lets see if I can attempt to review it. First of all, one of the reasons I love film so much is because it allows us to see all of these absolutely crazy and impossible things. So President Lincoln as a kick-ass vampire slayer? Bring it on. I'm totally game for a ridiculous plot like that. But there is a difference between a ridiculous plot and the way it is executed. I think playing this movie completely straight is smart but many times the movie seemed to buy into the cheese factor, mainly with the dialog. If the movie took itself way more seriously through out the entire movie then it would have been even better. It seemed to very carefully walk that line of full-fledged movie and totally corny Sci-Fi movie. Another thing that didn't help was the pacing. It was kinda all over the place.",
      "total_reactions": 0,
      "user": "CBeckman25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This is one of the most underrated movies I have seen in quite a while.  I expected an over-the-top zombie action flick with little substance, plot, or real artistic flourish.  I experienced nearly the opposite.  Early on, the casting felt spot on and the characterizations, while not the epitome of acting, were certainly far better and more nuanced than say, the recent episode of Batman.  From an early scene where we are catapulted into the fright of a zombie attack to a beautifully creative palette of a zombie chase atop a horde of horses I was drawn further into the period.  In scenes reminiscent of the painting of that era and the landscapists of the time, the art direction was simply beautiful.",
      "total_reactions": 0,
      "user": "baronmind"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "You know this film does has its moments. But overall it is a really strange film that comes together too quickly with often ridiculous results. I won't go into detail when regarding the American civil war other than \"lolwut?\" The actions scenes are actually quite good but the measure of Abraham's strength versus a vampire is unbalanced to say the least.",
      "total_reactions": 0,
      "user": "Ervas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "I was somewhat prepared to be disappointed by this movie due to its rather bizarre title and story but to my enjoyment I wasn",
      "total_reactions": 0,
      "user": "VeryDarkJedi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I had very low expectations for this. The combination of Abraham Lincoln and vampires seemed too strange to work, however I think it was done very successfully. Although the movie was not exactly true to history, the story intertwined with vampire action was really enjoyable. It is not your ordinary action film however I would recommend watching this.",
      "total_reactions": 0,
      "user": "zuperbri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Abe Lincoln: Vampire Hunter is like Underworld, except it tries to have a plot and tell an actual story. Big mistake. Not what your target audience is looking for.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Vampires vs The President of United States? cool huh, Maybe this movie is a bit predictable because it has been the influence of most Vampire movies not only in United States but as well as foreign films. the movie goes exciting as it tackles the history plus it superb effects and as well of this full packed action that will never let you bored. In conclusion this is the father of vampire films before the others!",
      "total_reactions": 0,
      "user": "djendjan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "It`s worth watching, but it`s Abraham Lincoln playing a Vampire Hunter so it can only be so good. I give them points for being unique but I`m sure you know that before watching the movie. I`t was interesting but nothing that had me asking for a sequel.I must say it was interesting how they mixed the facts with all the Bizarre stuff.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Overall a very silly movie that really seems to have no real \"flow\" to it. Effects are decent, characters are charming  and the action is gripping. Yet, the narrative is disjointed and all over the place. Clearly a real rookie for a director. Had this been given to a more experienced director, it would likely have at least been good, not excellent, but good.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "TL;DR A good bad action movie that is hardly taking itself seriously, while featuring one of the most prominent characters in American history.",
      "total_reactions": 0,
      "user": "Sneetches"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Stupid. Dumb. Weird. But still a good laugh for comedy people. But I like mostly action. so there isnt much more to say then tat. So I guess you can watch it yourself.",
      "total_reactions": 0,
      "user": "GNR135"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "A painfully stupid, abysmally ridiculous over the top action packed movie. Exactly what you would expect from a movie named 'Abraham Lincoln: Vampire Hunter'. I am almost sure that the whole idea of the movie was to pack it with as much consecutive action and cheesiness as you can and make you cringe every now and then. Although occasional scenes seem serious and philosophical so you are basically left off wondering \"what the hell? what did they make all those scenes for?\". Also be sure to read and enjoy reviews of people doubting historical accuracy of the movie ^_^",
      "total_reactions": 0,
      "user": "Danil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "As a fan of the book I was so excited to see this was being turned into a film. I was the first one in line opening day ready to see our greatest president of all time kick some vampire ass! Unfortunately this was the absolute worst film I have ever seen in theaters. TERRIBLE CGI I literally laughed during the scene were they were jumping on horses while fighting. I get it, some films don't make logical sense, especially one feature a former US president killing vampires, but at least make it look good. Just Ugly!",
      "total_reactions": 0,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This is a surprisingly great film! I had doubts for this film, mainly because its Abraham Lincoln killing vampires, which actually sounds stupid, but I really enjoyed it. This may not have been the vampire movie we wanted, but it was a vampire film we needed! High props for this movie!",
      "total_reactions": 0,
      "user": "savagejoe444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Pure, stupid, matrix-esque vampire ass kicking by our 16th President. If you go into this expecting an Oscar worthy film you're going to have a bad time. If you go in expecting a fun action film you won't be disappointed.",
      "total_reactions": 0,
      "user": "Remember2Wipe01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "I love watching campy corn ball travesties but this movie was to abrasive to my soul. call me sad i had to take breaks to watch this. Maybe it was just me that day but it was cool but watch for ur self it was probably just me.",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "this movie was a fun twist to history with a interesting portrayal of the \"bad guys\" during the civil war. Fun action. Characters were poorly developed.",
      "total_reactions": 0,
      "user": "cheeseberger11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "I didn't expect much when I got this movie and I have to say that I was pleasantly surprised by how good this movie really was. The main actors really brought their characters to life and I really came to love Lincoln, Henry, Will and Speed. While the acting for some of the supporting characters did lack at certain times it didn't ruin the experience for me at all. The fight sequences were amazing and really gave the fell that they were fighting stronger, faster supernatural vampires. The plot twists in the film really kept me on the edge of my seat waiting to see how it would play out. I would definitely recommend this film and you will get your moneys worth out of it as long as you remember that this is a film about Abraham Lincoln killing vampires.",
      "total_reactions": 0,
      "user": "Mike212"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "It's a preposterous idea for a film, skeptic that I was I only saw it because my friends persuaded me, but it was a good film, most of the people who think otherwise seem to be overly sensitive Americans. I could understand all the bad reviews if this film claimed to be documentary but it doesn't, in retrospect it's no more ridiculous than any other vampire film",
      "total_reactions": 0,
      "user": "camo1989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "This is an unpardonable insult for anyone who loves history and bears great respect towards Abraham Lincoln, one of the greatest presidents in U.S history, as regard to his personal life. In terms of art, this f***ing sh*t is just not getting any better, far from the point at which people would forgive and forget about. Laughably acting, bad dialogues, stupid - absolutely stupid and ridiculous - makeup are the top three outstanding features that I can figure out about this SH*T. 0 points",
      "total_reactions": 0,
      "user": "PvtJackson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Kuzey Güney savaşından ve Abraham Lincoln'den vampir hikayesi çıkarmak kimin aklına gelmişse helal olsun , değişik ve oldukça başarılı bir yapım. Zor bir iş yapılmasına karşın filmde mantık hatası yok. Gözünüzü ayırmadan keyifle seyrediliyor.",
      "total_reactions": 0,
      "user": "MrBlackTron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the best movies ever made",
      "total_reactions": 0,
      "user": "atlasshrugged21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "Abraham Lincoln did not hunt vampires! or if?. the film Bekmambetov and Tim Burton was brutally impressive and frightening at times but bored as Lincoln was president, but no misstep was full of action, and very devastated in terror.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    }
  ]
}