{
  "mc_avg_user_score": 2.4,
  "mc_metascore": 20,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Accidental Love",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 2,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Accidental Love isn’t very good—and might never have been very good, judging from the general air of desperation—but much of it is identifiably Russell’s work, and its scattered best moments recall Huckabees’ inspired loopiness."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "To be fair to whoever refashioned Accidental Love from the abandoned scraps of Nailed, there’s little reason to believe that the ideal, untroubled version of the material would have been a comedic masterstroke."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "Accidental Love is mostly a mess, a curiosity for fans, and a mangled misfire you'd understand anyone hoping to omit from their CV."
    },
    {
      "critic": "Martyn Conterio",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "The film does have a few merits, not least the cast being on great form and the script is, on occasion, very funny."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Russell pulled off some outrageous moments in I Heart Huckabees, the feature he made before this film, but the evidence here suggests Nailed had issues even before the money ran out."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "The disparate tones never gel, and the movie has an airless, stop-and-go feel, as if a studio-audience laugh track were intended but never inserted."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2015
      },
      "score": 25,
      "summary": "The satire is broad and forced and unfunny, there’s no cadence to the setups and visual punch lines, and the likable cast is hopelessly lost. Some disasters should remain forgotten."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Given Russell’s involvement and a fairly solid cast that includes Jake Gyllenhaal and Catherine Keener, just how awful could it be? Really awful. Unwatchably awful. As in, “Give it the Razzie now and be done with it” awful."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 20,
      "summary": "The bastard offspring of a charmless romcom and a toothless political satire."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "It’s something of a catastrophe."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "The movie is played fast but lacks wit. The script, written by Kristin Gore — daughter of Al, and author of the book on which it’s based — mistakes frantic for funny."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "The race for the worst film of 2015 is officially on."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "So flimsily constructed, visually and narratively, that it resembles a middle-school play that's been hastily filmed on an antique camcorder."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Worst movie i have seen in years, didn't expect that at all knowing that it has an A-class cast, from Gyllenhal and Biel to Gulley and Brown Jr. I swear I did not even laugh once, was bored to my eyebrows, and the story is inexplicably stupid. The movie is even politically stupid because its message is not well delivered. Skip it while you're still alive",
      "total_reactions": 0,
      "user": "zouz123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Horribly troubled, horribly made, but horribly enjoyable, Accidental Love delivers on what it aims to be. Cinematically, the plot was cliched and offensive and the production aspects were boring, but the film had an excuse. This film was technically directed by David O. Russell (Silver Linings Playbook and American Hustle) in 2008, but he dropped his involvement in the film and much of it was reshot without him. This film made me laugh in many parts, however, and that is what this film is meant to be, a comedy. So do not watch this if you are looking for high-quality work like Russell's other films, but this is a lot of fun to watch.",
      "total_reactions": 0,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "Sloppy and forgettable. This film should never have seen the light of day. Also love the fact that the pull quote they used for the physical media packaging was taken so far out of context that the reviewer felt compelled to post a follow up article to publicly shame the media company responsible. The director had his name removed from this project for a very good reason. Do not rent it under any circumstances.",
      "total_reactions": 0,
      "user": "EricFate"
    }
  ]
}