{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Adam",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 47,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "A beautiful film about love that leaves you all warmed up inside.  Dancy is brilliant in portraying a guy suffering from Asperger's syndrome falling for the girl next door (played by Byrne who is a wonderful co-lead) who learns to love the man despite his idiosyncrasies.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This is simply one of the sweetest romantic comedies ever made. It matches When Harry Met Sally on every term of sincerity and humor. Its true-life depiction of people with real problems and how they learn to love one another in spite of them is truly inspirational. Everyone should be required to watch this movie because it simply warms your soul and makes your heart bleed. A true cinematic gem.",
      "total_reactions": 1,
      "user": "HWAS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "My nephew whose name is Adam has Asperger's so we were all able to relate.  Although the movie's Adam is much higher functioning the markers are there.  One of them we could really relate to was when Adam was explaining to Beth astronomy and sciences and she said she didn't understand.  He just started over thinking he needed to repeat himself.  It wasn't a great movie and I probably would not have liked it at all except we found it interesting because of my nephew.",
      "total_reactions": 1,
      "user": "CritiqueGirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Adam is a hilarious movie. The combination of a toy designer who has Asperger's Syndrome and his neighbor(Neither of whom understand each other)are what makes Adam the masterpiece it is. Don't miss it.",
      "total_reactions": 0,
      "user": "LeoTs3181983"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I would really like to give this movie a solid 10, as Hugh Dancy's brilliant portrayal of a guy with Aspergers Syndrome really moves me. I have aspergers and I feel I can see the AS in Adam in every single scene. I have bought more than 10 copies and given friends and familiy a copy whenever I've felt I needed them to see what its like to be me.",
      "total_reactions": 0,
      "user": "RuneOsterdal"
    }
  ]
}