{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 54,
  "mc_movie_name": "Adventureland",
  "mc_negative_rating_frequency": 31,
  "mc_positive_rating_frequency": 233,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "It's such a simple, quiet movie and that is what makes it so special. Jesse Eisenberg is James a twenties guy in need of money after his parents can't fully support him financially anymore, finds a lowly job in a shabby amusement park Adventureland filled with rigged games and fair-to-speculate-on-the-safety secondhand rides and hand-made prizes \"nobody ever wins the big ass panda\". James meets Emily and the pair hit it off and so begins the weird and wonderful story of a summer-fling. But no, there is more in Adventureland and you'll have to find out about that for yourself. Jesse Eisenberg is always the go-to-guy if you're looking for a virgin-esque quality in your leading man, he's always great, no surprises here. The real surprise for me is Kristen Stewart, there will always be the Twilight role overshadowing her career. But if you look away from Bella, she is a really good actor. Emily is very shy, funny, sweet and she'll fight for what's right. She's very smart yet very conflicted and James and Em's budding romance is really a pleasure to watch. After Twilight is over, I really hope she goes off the mainstream path and produce great small movies like this, and I'll be all over it. Bill Hader is hilarious as always with what little screen time he's given \"nobody ever wins the big ass panda\". I loved everything about Adventureland, from the cheesy 80's soundtrack, to the simple but very nostalgic amusement park setting, funny side characters also there is more to them than meets the eye. I want to live in the 80's, I want a summer job in that period of time, I wanna smoke joints man!",
      "total_reactions": 3,
      "user": "MRedzuan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "Not exactly hilarious, but it does have some funny moments. I would not class this as a comedy personally anyway, despite its comedic overtones. Adventureland is a good film, but not great.",
      "total_reactions": 1,
      "user": "Cotts1988"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "i liked this movie.   it was okay.  jesse eisenberg gives a nerdy impression again but his acting is still good. Ryan Reynolds gives a good performance.  and Kristen Stewart will get better in time.",
      "total_reactions": 1,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Eh, it was a cute indie movie that had funny side characters. It was almost about a lot more then teenaged love and then i became soap opera quality toward the end. This is nobody's best movie.",
      "total_reactions": 1,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "To consider this another teen/coming-of-age comedy would be classified as a bullshti statement. A certain, almost unique feel of nostalgia arises once you watch this. The acting - more than credible, brilliant. The writing and directing - more or less familiar. But in the sense and atmosphere where it's beyond accepted. The soundtrack - just great. Not another film in recent history has moved, entertained and created an amiable feeling than Adventureland. **** awesome doesn't begin or even begin to think of it. A close, if not actual masterpiece.",
      "total_reactions": 2,
      "user": "Justinavery7074"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "One of the most underrated movies I've ever seen. I absolutely love it. Instead of being another Superbad, it's a funny, well-acted, well written, and well directed coming of age comedy.",
      "total_reactions": 1,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Kristen Stewart is a horrible actress. She licks her lips or sticks her tongue out before she delivers almost every line. This movie was also boring as hell. There was nothing likable about this movie or any o characters in this film. Everybody is just a jerk or a waste of space. It makes me sad that Jesse Eisenberg an Ryan Reynolds were in this movie, they can do so much better. Don't waste your time.",
      "total_reactions": 1,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "From the Director who brought us Paul and Superbad, comes Adventureland, which unfortunately is just another predictable, run of the mill comedy. Jesse Eisenberg stars as a kid whose forced to get a summer job at a local amusement park with a wacky cast of characters. Of course the only other normal one working there, just happens to be the girl that he falls for. Bill Hader plays the boss and he should be writing and starring in films like this instead of playing secondary characters. Hader is one of the funniest and most underrated comedians in Hollywood and I can honestly say that he is the only reason to watch this movie, because the rest of the cast is just dull and uninspired. Eisenberg gives another flat and emotionless performance, while co-star Kristen Stewart plays along as if she were still one of the undead. I generally like most of the cast and I thought the story was decent, but overall Adventureland is just another predictable lame duck comedy. It will give you a few laughs, but don't expect too much more.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "if you think this movie is a laugh out loud COMEDY! it isn't. its a compilation of many genres. Its an 80's movie, mixed with a bit of comedy, but it is heavily romance and drama. if you wanna see this movie because it might be like\" superbad\", well then you better not watch it because there not really relate-able. i enjoyed the movie. its a nice, indie movie with a likeable cast... if you give it a chance you might enjoy it. ((quick description)):its about a guy whose parents were rich and then they turned middle class. so now he has to look for a job to pay for college. he can't find a job anywhere so he settles for a job in a fair called \"adventureland\". where he meets new co-workers/ friends. they do pot, listen to rock/80's music. and theres some relationship issues. 7/10 could of been a classic.",
      "total_reactions": 0,
      "user": "destroya1art"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Why is it that so many movies feel they NEED to say something profound or exciting in order to stay fresh or leave an impact? Why can't they just sit down, and learn what a situation can be like.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Me seems a film having simplicity humor, romance teenager and some reality than were those years 80. She looked mean \"silent\" to the movie, but still worth looking at. Very good to see an afternoon.",
      "total_reactions": 0,
      "user": "franciscomorrog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "I expected this to be a much better movie, but it seems very gloomy and only had a few very funny moments. The characters also seemed very drained, and they made the movie very difficult to sit through till the end.",
      "total_reactions": 0,
      "user": "Maxwell1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "This movie was so boring I watched it over the course of three nights and fell asleep on two of the three. When a director wants to inflict boredom to the point of pain on his audience, he calls Jesse Eisenberg. I'm quite sure I actually fell asleep twice due to the fact that my brain needed MORE stimulation. Eisenberg isn't good looking, isn't a good actor, isn't interesting so once again it evidently seems to come down to the perks of being jewish in Hollywood. If you choose to watch this movie my best advice is to brew a couple of liters of coffee for each person watching the movie.",
      "total_reactions": 0,
      "user": "metzler"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "This im watch kristen 2 nd movie,,",
      "total_reactions": 0,
      "user": "Singgihsatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "This film to put it in two words is 'stupid **** I mean you think if it has Jesse Eisenberg and Ryan Reynolds and is directed by the guy who made 'Super Bad' you'll get a funny comedy. Oh you couldn't be more wrong i started watching this with my brothers and we were like this should be good. An hour through we hadn't laughed once, not even once it felt like we were watching an endless film with **** jokes no humour, boring scenes, stupid romance and no imagination, all its about is just some guy called James (Jesse Eisenberg)",
      "total_reactions": 0,
      "user": "tedleanse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "When I saw that Kristen Stewart was in this film my heart sank, but her normal moody attitude which I find annoying to the extreme complements this film very well. A drama and a comedy but aimed towards someone slightly younger than the norm for this genre, Adverntureland gets everything right. It illustrates the hardships suffered by Eisenberg's character but also his optimism and determination. This is in some ways a feel-good film but in others a feel-bad film. Either way, it is still a great film and deserves all the accolades it receives.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "As a 22 year old heterosexual male I feel like a b*tch for saying this, but I really like movies about teen romance. That is, when they are well crafted and realistic. Adventureland is both of those things. I don't know what it is but this youthful, hopeful, adventurous, down to earth, everyday life lined with a grimy edge of raunchiness kind of film gives me a warm and fuzzy feeling inside. I would never say something like this to my friends because they would call me a fa*got then beat me to a pulp using pillowcases filled with bars of soap. But what I would say to them is that I find Kristen Stewart to be sexy in a low-down, trash-gutter, dirty little scum bag weasel kind of way. Anyway...eight stars.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Adventureland could've been a miserably bad raunch fest with a screenplay just taking us from one gag to the next. Instead, it's a good movie.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I went into this film expecting the usual crap that teen movies seem to provide, but Adventureland is not that at all. I absolutely loved it! It's a great coming of age story about making the most of life and relationships. A total surprise film. You cannot miss this!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "It's perhaps the simpler or more straightforward things that make the most sense, Adventureland doesn't try to be the greatest teen dramedy, it doesn't try to compete with other similar films. The film sets out to deliver an interesting arc of characters, one big happy yet dysfunctional family working at Adventureland theme park.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Adventureland, though slow for many viewers taste, is a brilliantly written comedic drama that is delightfully carried by a stellar cast and witty, sharp dialogue. This cathartic film allows the viewer to set back and enjoy the simple aspects of life that we so often ignore.",
      "total_reactions": 0,
      "user": "Luke_McLaughlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Watching these characters mature is a delight in of itself. Kristen Stewart sheds her bland 'Bella' (from the twilight franchise) and Jesse Eisenberg is just as likeable as he was in the major zom-com flick: Zombieland. Hader and Reynolds are increasingly funny and I just wish they had more time in the film. The movie is set up for so many surprises and plot lines that the writers could have capitalised on which is slightly disappointing. But the charm of the 80's shines through. Watching two teenagers smoking, getting high, drinking and finding love manages to be captivating. We need more coming of age movies like this one.",
      "total_reactions": 0,
      "user": "M0vieAddict"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Adventureland was a lot better film than I anticipated. The summary sounds incredibly boring, which it is. There is really no excitement or anything overly engaging about the film. However, Jesse Eisenberg, Kristen Stewart, and the rest of the cast make for an interesting story. Their characters are really well developed and how all of them mesh together during a summer of non-fun in the 1980's is intriguing. Eisenberg and Stewart play the same exact roles they do in every single film I've ever seen them in. Eisenberg is a neurotic but witty guy with self-esteem issues and Stewart is a beautiful but troubled young woman with emotional issues. They definitely don't go outside the box for their roles but they have mastered their niche archetypes. All-in-all, this isn't the most entertaining movie around but it has a certain charm to it. The characters feel real, the music takes you back in time to a more pure era, and the story is relatable to just about everyone.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Good movie. Certainly funny and provides a quirky, interesting storyline along with it. Overall, it's not fantastic, but it is certainly a good way to spend an hour and a half.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "This is NOT your typical teen comedy, and it takes a little time to get started. Good performances all around, though.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}