{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "African Cats",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 13,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 90,
      "summary": "The cinematography and editing are as superb as the film's feline stars are photogenic and heroic."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 88,
      "summary": "Almost every shot is a postcard-perfect African vista, and every animal shown in majestic close-up."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 83,
      "summary": "Not coincidentally, African Cats opens on Earth Day. Meeting these magnificent fellow creatures might be a fine way to celebrate."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "The film captures a wealth of spectacular and wrenching conflicts, and even if its ability to spin a story out of the footage falls somewhat short of the gold standard set by \"March of the Penguins,\" it's nonetheless a remarkably cohesive piece of work."
    },
    {
      "critic": "Sandie Angulo Chen",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Ultimately, this is a universal story about how these wild mothers, like their human counterparts, sacrifice again and again - all to make sure their children are happy, healthy and well fed."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "No doubt, life is tough in the wild but, this being a Disney flick, it's loving too and even comes with a kiddie-friendly narrative that's easy to summarize and hard to dispute."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Kids will love African Cats, which is full of \"aw\" moments. Their parents will appreciate that narrator Samuel L. Jackson keeps things from getting too schmaltzy in this true-life depiction of the circle of life."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "This is Disneynature's third and best release, after 2009's \"Earth\" and 2010's \"Oceans.\" With its compelling narrative of survival, it will probably be the one that most enthralls audiences."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Though African Cats is G-rated, scenes of animals chowing down on other animals are not for the faint of heart or delicate of stomach. I don't think it's suitable for those under 6, and they should be prepared for real animal behavior. But it's deeply involving and primally moving."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Despite its family-friendly trappings, \"Cats\" is largely serious stuff; deliberately paced, thematically dark and often wistfully told, with enough moments of survival-oriented tension and dread to question its G rating."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "That visual beauty helps compensate for a script that wastes no opportunity for heartstring tugging, often in the form of adorable tykes playing with each other and cuddling with their elders in close-up."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Directors Keith Scholey (who also wrote the narration) and Alastair Fothergill spent nearly three years capturing this remarkable footage, and have edited it judiciously with an eye to entertainment."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Scholey, Fothergill, and crew do impressive work, but we're also reminded that wild animals don't know from cues, marks, and scripts. That's part of what makes them so compelling."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 60,
      "summary": "It's a must see for fans of roar footage."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 55,
      "summary": "Mostly, though, African Cats is extremely tactful about the truly harsh stuff that goes down in the world of nature."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "May be Disney's most pointedly feminist effort since \"Mulan.\""
    },
    {
      "critic": "Rachel Saltz",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "At one point the lions make a meal of a lovely young zebra they've just killed. That spelled the end for the little boy sitting next to me. \"I'm too scared,\" he said, and he dragged his mom out of the theater. Sorry, kid, it's a jungle out there, even in Disneynature."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "This Earth Day release has honorable intentions, but it imbues the animals with human emotions and motives, which only muddies our understanding of these ferocious feline species."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "African Cats, while often adorable and at times gripping, is more of a TV-ready experience."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Since this is a House of Mouse production, sentimental order must inevitably be grafted onto nature's pitiless chaos. The cornball voiceover ascribes human wants and desires to the animals."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "Alright, if you want a more badass version of March of the Penguins, it has arrived. Swap cute little penguins with f*cking lions and smooth, calm Morgan Freeman with SAMUEL L. F*CKING JACKSON. In other words, you have no choice but to love it, even if you don't care about the subject.",
      "total_reactions": 1,
      "user": "akelz7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "An intriguingly intense, beautifully filmed and remarkably touching film that plays out like a live-action LION KING (minus the singing warthog, of course).  Two of my boys (ages 6 and 4) found the non-graphic and relatively bloodless hunt-for-dinner scenes a little intense but they still ended up loving it (and, most importantly, sitting still for a 90-minute documentary).  I'll celebrate Earth Day by not burning Styrofoam in my driveway if you celebrate it by taking your family to see Disneynature's AFRICAN CATS.",
      "total_reactions": 2,
      "user": "MovieGuyBrian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "This film is truly amazing.  Disney should get an award for this.  It's a true gift from disney.  Anyone who watches this film is lucky to experience the incredible close-up view of these animals in the wild.  Because I am an avid animal lover, I did have to cover my eyes once or twice.  But I know that confrontations between the animals are just the unfortunate reality of the situation.  Thank You Disney.",
      "total_reactions": 2,
      "user": "SMH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was amazing, it captivated me right from the start. I learned alot from this film. I never really realized how tough it was to live in the wild before this film. Samuel L. Jackson was a perfect narrator for this film. This movie definitely does not deserve a 61 as the critics average out on. I didn't see a negative thing about this film, it wasn't long, and it wasn't incredibly short, it got its point across and it did it well. Lions and cheetahs are beautiful creatures. This was an amazing film, disney nature keeps on delivering, Earth was great, Oceans was excellent and African Cats was captivating. I can't wait for next years Chimpanzee, monkeys are my favorite animals too haha, I give African Cats an overall 10/10. This is definitely worth a blu-ray purchase when it comes out.",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "I really enjoyed this movie. The photography is magnificent, and I learned so much new information about many different species. Plus, the proceeds from the movie's first week go to a good cause. There is a little too much personification and attributing human values to the animals, but I still found it quite entertaining.",
      "total_reactions": 0,
      "user": "rodstewart33"
    }
  ]
}