{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Aftershock",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 20,
  "mc_pro_critic_reviews": [
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 70,
      "summary": "The script by Roth, Lopez, and Lopez’s frequent collaborator, Guillermo Amoedo, giddily piles crisis upon crisis, with none of the customary mercy reserved for leading characters."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "The first, pre-'quake half hour is such a patience-testing slow burn that director Nicolás López runs the risk of extinguishing the viewer's interest altogether. But when things head (metaphorically) south they do so with an escalating, apocalyptic ferocity which continues until the very last second."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "Thankfully, as the movie goes along, he tempers his bloodlust, instead engaging in sequences that up the suspense and terror while not exclusively luxuriating in the bloodshed."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The violence is quick and occasionally inventive, with little of the attenuated nastiness that characterizes so many genre pictures, and the photography ranges from brightly sun-kissed to down-and-dirty."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "Right up until the quake, Aftershock is a bland, sub-\"Hangover\" comedy about guys on the make in South America. Then finally, blessedly, the ground swallows up these shallow idiots."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Though offering some chilling twists on the usual conventions, employing wit and restraint where otherwise the filmmakers might have relied on the contents of an abattoir, Aftershock is ultimately predictable in its litany of who lives and who dies, and doesn’t try to be too ironic or self-reflexive about it."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Aftershock then becomes a catalog of most every unpleasant way of dying you can imagine."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "A movie that tends to stick to formula, offering up minimal scares amid scattered moments of gross-out bliss."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 50,
      "summary": "Aftershock has no earth-shattering revelations to make its mayhem stand out in the wreckage."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 45,
      "summary": "At first, it’s all fun and games whenever somebody gets hurt, but that’s not enough in and of itself to sustain the movie’s tension. We’re left waiting for characters to die off without much of a vested interest in anyone’s survival."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The ending is sick enough to make it almost worth the wait.  Key word: almost."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "People become mere punch lines: fleshy avatars for the gory grist."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "It's an unrelentingly brutal movie set in an unusually scenic locale — the coastal city of Valparaiso, Chile."
    },
    {
      "critic": "Abhimanyu Das",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "There's plenty of gore, but none of it is particularly inventive, nor does it engender any visceral or emotional reactions beyond jaded disgust."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "If all this sounds outrageous, and extreme … don’t worry, it’s not. Provocation coupled with ineptitude doesn’t reveal the ugliness of humanity; it simply reveals the ugliness of the filmmakers themselves."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "A weird mash-up of disaster, horror and dystopia genre pictures, Aftershock fails to make the Earth move."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "The actual Chilean earthquake killed 300 people and turned thousands more homeless, but this movie distills everything for comic effect. Everyone gets robbed, raped, impaled, mutilated, decapitated or burned alive. But that’s not all. Crawling through the blood-drenched debris, here comes the tsunami!"
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "A lot of Aftershock predictably involves screaming or shock cuts, and the movie features a blink-and-you-miss-it cameo from Selena Gomez."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "Lopez is a middling ringmaster of doom at best. But there's so little context to the litany of ugliness — some played for laughs, some meant to shock — that it's hard to discern where the entertainment value lies in any of this."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "Aftershock is incompetently made and morally muddled, but since talent, morality, and Mr. Roth have never been on speaking terms, we're not exactly surprised."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Aftershock is the worst movie 2013, and I don't think that any movie could get worst than this movie, this movie should be frightening! But no, it has 40 MINUTES build up, and then some rape, survival horror and disturbing/vulgar elements that are surprisingly stupid and boring, poor intense, story and acting. Can this movie get worse than this?!",
      "total_reactions": 3,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Avoid this movie even if it was for free, just stupid and dumb, all seen before disaster movie with lots of blood and screams, it is awful, dull and just bad, overall very bad, can't be described. Until now, Aftershock is the worst of 2013.",
      "total_reactions": 2,
      "user": "AReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "It is cruel and so dull, also it is not entertaining or good, it is upsetting with a dumb storytelling it just nothing movie, a bad movie, nothing good in this movie except maybe special effects and that's it, it is completely bad, the acting is below average and the story is really dumb, but is it worse than The Devil Inside (the horror movie that I hate)? No",
      "total_reactions": 1,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 0,
      "text": "Aftershock is an average movie with Eli Roth. Wow. I expected it to be better. We people weren't looking for a hurricane, gore and stylized Roth powers. We were looking for a scary and gory good time. Well actually, I didn't get anything. The gory dazzle dazzle is just limited and then you get a bunch of of people falling to death. At the end, when Gringo gets out of that building, the effects are so unrealistic! The event in Chile is real but the Eli Roth and Nicolas Lopez spin off of this disaster is unrealistic! It's like Lopez and Roth were eating cake and Lopez is like- what if we made mega garbage to destroy thingamajigs and include a hell a lot of f**king gore. It didn't look like I was watching Aftershock. I looked like I was watching Finding Nemo. No story, no point and no real environments- that is why aftershock sucks. Selina Gomez sucks at acting. Really, Lopez took beggars to act in his film. Except Roth who is ruined and worst actor of the year for me. Yet. We'll see what s**t comes for us in the coming years.",
      "total_reactions": 1,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "It's fun without being stupid (mostly)",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "An awful film with no redeeming qualities.  The first thirty five minutes was just a bunch of pointless partying scenes and the rest of the film becomes a cheap slasher type horror film with some really disgusting and unnecessary shots.  This stink bomb is one of the worst of the year. F",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "The acting was not always good and some CGI effects were pretty horrible but, I can't deny that it was an actually good movie.Predictable at times, and surprising at others,Aftershock is a good movie.Not exceptionally good but not exceptionally bad.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "NO GOD PLEASE NO . What the **** is that? ridiculous movie, meaningless scenes just some calling for the blood and carnage. horrible story, characters that you want to die in the entire movie. And THAT ****ING END OF **** ****ING **** WHY THAT **** TSUNAMI CAME THAT **** THAT TIME! THIS IS NOT A SURVIVAL MOVIE, THAT IS A DEATH MOVIE !!!",
      "total_reactions": 0,
      "user": "lelouchMF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "Leave it to Eli Roth to turn this simple tale of earthquake survivors into a morbid blood bath of terror and torture porn. I only gave it one star because of the valiant attempt at earthquake effects.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Aftershock\" 10 Scale Rating: 2.5 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Love this movie...don't know why everyone is hating on Selena, she was great. Maybe it was a little hard but really? She's only 21, cut her…hahahahhahaha",
      "total_reactions": 0,
      "user": "Clubsocial"
    }
  ]
}