{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 24,
  "mc_movie_name": "Alex Cross",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 20,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Director Rob Cohen shoots believable action sequences, too. Nobody jumps the gap between skyscrapers or falls 40 feet, then gets up and runs away."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Rebooting novelist James Patterson's famous Alex Cross character for the big screen, Tyler Perry aims at new cinematic territory and scores a bullseye as the Detroit detective embroiled in a hunt for a mega-evil killer that turns personal."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Alex Cross isn't meant to be analyzed too deeply. The title character probably sums up the best strategy for appreciating the film's modest pleasures when he says, \"Don't overthink it; I'm just looking for a bad guy.\""
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "There is one thing interesting about Alex Cross, and if you miss this, you've missed the whole movie. It's not the story - it's worse than mediocre. It's not the lead actor - nothing wrong with Tyler Perry, but as an action star he's no Vin Diesel. And it's not the dialogue, which has a clunker every other scene. It's the direction. Notice the direction. Alex Cross is a good example of what a seriously talented director can do with a heaping pile of garbage."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Alex Cross is filled with accidental comedy, and while it's a mess in any traditional movie sense, it's has its moments of preposterous fun that come in the form of a nonsensical plot and a fabulously competent, scenery-gnawing villain."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "There's nothing in Alex Cross that argues another installment is warranted, but much will depend on whether Tyler Perry's audience crosses over and continues to follow him in this new, very different role."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Where Freeman was warm but enigmatic, Perry is warm but empty."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The sharpest five minutes in Alex Cross, by a considerable margin, belong to Giancarlo Esposito."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "A disjointed thriller with two many characters rattling around."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Perry must have felt it was high time for him to try his hand at playing a darker role. But starring in this badly directed, suspense-free film with its unintentionally laughable dialogue does Perry no favors."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "Miscast and underwritten, Alex Cross does not reinvent Tyler Perry, or James Patterson's character, or anything, really. The only appeal here is the sick kick of watching a franchise blow itself to bloody stumps."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The resulting film, despite its occasional outbursts of action and tension, is less an action film than a psychological thriller, although even there it fumbles the ball."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "It neglects, for one thing, to make any sense."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "It's a strange sort of film that casts Gallic tough guy Jean Reno as a clean-fingernailed mogul while employing cross-dressing comic Tyler Perry as a guy capable of hand-to-hand combat with someone called The Butcher of Sligo."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Though they lack chemistry as a team, it's gratifying to see both Perry and Burns stretching in ways they haven't before."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "You almost feel sorry for Tyler Perry, stepping out of his own universe for the first time to try to expand his range and finding himself in something as thoroughly dismal as Alex Cross."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Aside from these curious role reversals, though, Alex Cross is a mess. Drawing on every conceivable '80s B-movie action cliché and treating its beleaguered female characters like pieces of meat (literally, in one scene of butchery), director Rob Cohen squanders a surprisingly recognizable cast on a half-baked plot adapted from James Patterson's series of novels."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Nothing works. Or some of it works, but that doesn't matter because what's working is so deeply, painfully boring."
    },
    {
      "critic": "Mike DAngelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "Perry shifts into full-on badass mode... well, the best that can be said is that he's sincere. For all that, he's still less embarrassing than Lost's Matthew Fox, likewise cast against type as the film's sadistic villain."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "There's not a moment in Alex Cross that doesn't function splendidly as comedy. Which means that for all his cool-cat preening and heroic soul-searching, Tyler Perry must have felt right at home."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "What a whorish film this is: Even the serial killer lectures the detective."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 30,
      "summary": "It's a courageous but misguided move on Perry's part; he has none of Freeman's soulful, nuanced subtlety, and watching him display the gamut of emotions called for in Marc Moss and Kerry Williamson's script is like watching the Hulk attempt Swan Lake."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "In the face of such junk, the idea that Fox would proudly put himself on a punishing regime of severe diet and exercise to get prisoner-skinny-yet-crazy-muscled for the job of make-believe is vanity at best, obscenity at worst."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Instead of playing the role in drag, the erstwhile Madea simply is a drag."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Alex Cross is slipshod cinema hoping to capitalize on a star out of his orbit here."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Formulaic serial-killer crapola."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "In drag or out of it, the soft-spoken star has rarely been less convincing than when locking and loading from his home arsenal or dangling from a decaying Detroit edifice."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "A grim, dispiritingly stupid waste of time, energy, money and talent."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "The best of the Alex Cross mess suggests that as an actor, he has the talent to move beyond the world of Madea should he want to. He just needs to look for much better material."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "The cross-dressing \"Madea\" star seems out of his depth playing the hard-boiled detective made famous by Morgan Freeman in \"Along Came a Spider\" and \"Kiss the Girls.\" Even action helmer Rob Cohen (\"The Fast and the Furious,\" \"XXX\") seems to be off his game here."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2012
      },
      "score": 16,
      "summary": "The movie is stunningly perfunctory, soul-crushingly oblivious to its own lack of originality, and, to be blunt, just plain dumb."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 16,
      "summary": "Alex Cross is more boring than your average weeknight procedural, except much longer, dumber and more violent."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 12,
      "summary": "Expositional and often self-serious to the point of genuine awkwardness, the dialogue is never as haltingly unconvincing as when it's attempting to give some approximation of Alex Cross's essential looseness and good humor."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "I really don't see why this film gets such a low score it's not that bad granted it wont win any awards but it's just as enjoyable as any other film in it's kind so in my view it's worth a watch.",
      "total_reactions": 1,
      "user": "scoley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "In a departure from his previous efforts, Tyler Perry tries his hand as an action star in \"Alex Cross\" with mixed results. Playing the title role, Perry gives a credible if unremarkable performance.  Just like his previous performances in his own films in non-Medea roles, his acting lacks range, subtlety or depth. Rather than create a nuanced performance Perry indicates his character's emotional state through obvious gestures such as nose flaring and tearing of the eyes. On the story front, \"Alex Cross\" is a generic buddy cop film with Edward Burns as his partner. As typical of buddy cop films they are an exercise in contrasts. Perry is the sensitive family man that's not afraid of showing his emotional side while Burns is the macho ladies man. Much of their exchanges involve banter along predictable lines. Perhaps the best thing about the movie is Matthew Fox as the main villain. A complete sociopath, his character is the perfect antagonist for the emotional Perry. For fans of action films, Perry's Cross might be a little too much in touch with his feminine side. Also, Perry, while a big guy, lacks the athleticism to make his more physical scenes interesting. This is the most evident in a climatic fight scene. It is shot in a very stylized way as if to hide Perry's lack of brawling skills.",
      "total_reactions": 1,
      "user": "Indiefilmlover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "This one is bad. Don't think it has the class of the Morgan Freeman movies. Don't watch it. I rented it on Amazon and it was one of a handful of films that made me regret renting it within 5 minutes. It is shallow, cliche, pretentious. I had never seen Tyler Perry before and based on the trailers was willing to give this a chance. I regret that choice.",
      "total_reactions": 1,
      "user": "Jraptor59"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "Alex Cross film begins as a thriller normal but after 30 minutes of footage, it becomes tedious, heavy, sappy and predictable.",
      "total_reactions": 1,
      "user": "FilmBoyZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "Poorly acted, lazily written, and not really directed at all, Alex Cross is the most clichéd action movie of the year.",
      "total_reactions": 2,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I do not know what those people are talking about or what movie they had watched, but Alex Cross was not the worst movie of this year. You didn't like the movie Alex Cross which was a really good thrill ride, but you like the movie that's my boy, oh how mind boggling.  Argo didn't seem all that good, besides it was on the news 30 years ago. All you have to do is read a 30 year old newspaper about the story, hello!Those people do not know a really good movie if it fall right out of their ass wholes. This movie was very exciting and very thrilling. It is most certainly different from watching the same damn movie over and over. They make the same movie over and over and many people get sick and tire of seeing it. Paranormal activity is about the same as those other scary movies. About a hunted house and spooky ghost and scary monsters and people being hacked up to death and blood and body parts falling off. Alex Cross was a very thrill ride and very exciting movie. I think it was very exciting just like the book series. I really don't know what those people are talking about, because they weren't watching the same movie as I. I am so confused?",
      "total_reactions": 10,
      "user": "Lynette"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Here's my clear message to Tyler Perry:",
      "total_reactions": 3,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "For the first time Tyler Perry doesn",
      "total_reactions": 2,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "A strong candidate for dumbest film of the year ,And the year 2013 the dumbest film is gonna be the 4th movie of Carrie 2013 it's gonna be the same as Carrie 2002.  http://www.facebook.com/ElvisPresleySonElvisAaronPresleyJr",
      "total_reactions": 3,
      "user": "Dollis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "What a good tyler perry movie . the bad part is this  . Perry's comedies are just way too stupid and he always takes stupid comedy roles .  finally Perry step up his game and choose a good role . Alex Cross movie is a great mystery movie . thats why i gave this movie 6/10 . Grade B-",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "\"As a devoted fan of the beloved book series by James Patterson. Alex Cross came as no surpise that it was actually somewhat thrilling. Tyler Perry was a little cheesy at times while Matthew Fox gives one of his best on screen performances of his career.\"  B-",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "There's really just one thing to say:  Tyler Perry, you sir are no Morgan Freeman.  I really hope this doesn't become a franchise, or if it has to, that they hire some real writers to sculpt an actual suspense movie and not some summarized, cliched version of its better predecessors.  How this borderline tortureporn got a PG-13 rating is beyond me.  I felt bad for the talented actors who had to say those lines.  I look forward to seeing them in better projects in the future.",
      "total_reactions": 0,
      "user": "SusanS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "I've never read any of the Alex Cross novels by James Patterson but if they're anything like this movie, they're not worth the time. Tyler Perry is a decent enough actor but I just couldn't buy him as Alex Cross. The rest of the cast was pretty mediocre in terms of acting ability. Matthew Fox played a believable sociopath but he was about the only plus character in the film. There were also far too many plot holes for the story to be interesting or believable. A movie that could've been emotional, dramatic, intense, and intriguing was none of the above. I also thought some of the cinematic effects were below par. Overall this was just a disappointing movie in general.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "As a long time fan of James Patterson's Alex Cross novels, I thought Morgan Freeman was the perfect choice to play Cross, and I loved Kiss The Girls. I was weary of a remake, especially one done by Tyler Perry, but to my surprise he was much better than expected, unfortunately, the film was not. Alex Cross has always been about beating criminals with his mind. The forensic psychologist is best known for his ability to out think rather than over power his opponents, but you'd never know it by watching this film. Alex Cross and his team are called in on a triple homicide, but the suspect had more on his mind then just his targets, and sets his sights on Cross and the team. There is a heavy focus right from the beginning on the bad guy, who we immediately see is Matthew Fox. To me this took all the mystery right out of the story, and instead of being a who done it, the film was about how to catch the bad guy. The writers didn't do that right either, as Alex Cross is blinded by rage and goes out guns blazing to fight and kill the assailant. While this may make for an exciting action film, it's not who or what Alex Cross is all about, and despite all the novels I've read, I felt like I didn't know the characters at all. Tyler Perry stars as Cross and shows that he's more than just a comedian dressed as an old woman. Perry was very intense and likeable, under different circumstances I would have really enjoyed his performance, but again, he wasn't playing the Alex Cross I know. He's paired with Lost's Matthew Fox, who has played the bad guy before. I love Fox as an actor, but he just doesn't have the look or temperament of a killer and wasn't very believable here. Alex Cross is one of my all time favorite characters, and the first time they put him on film, they did it right. The second time, wasn't one of Patterson's better stories, but still very well done. This time, Alex Cross has turned into John McLean, and while some people will love it, to me it just emphasized everything that is wrong with Hollywood today.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "Alex Cross is one of the worst movies of this year. The trama it's a good idea, but the development is really awful, the performances are terrible, the screenplay is horrible. All the movie is a big disaster. Alex Cross is really boring",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "one of the most EPIC films of the year thus far, i was skeptical at first, but perry is amazing as the new alex cross, it's reasonably well written, and incredibly fast-paced",
      "total_reactions": 0,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "great action-thriller from rob cohen, one of the best guys in the action genre working today, the action is believable, entertaining, the characters are mostly decent, and the plot is rather cleverly done.",
      "total_reactions": 0,
      "user": "mcmanusthebrave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Slam-bang, high quality entertainment, as far as action films go, this is pretty damn epic, ignore all the critics, most of which like horsesh*t like the blair witch project, this is a hell of a good time.",
      "total_reactions": 0,
      "user": "alliedcola"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "This movie is a complete waste of your time, don't even bother watching it. The only decent part of this movie was the action sequences. But movies aren't all supposed to be about action, are they?",
      "total_reactions": 0,
      "user": "bethegame"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "A decent, entertaining action flick, but it isn't overly well written, which sucks, if they ever have a second chance with tyler perry, they could do much better.",
      "total_reactions": 0,
      "user": "extrafizz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "Alright, so... Alex Cross. Actually there is not much to say about this movie. There are a lot of pointless scenes, stupid dialogue and mistakes in this movie. Alex Cross is basically a detective story about talented detective who is trying to catch a murderer. That all. You wont be invested in this movie. Every few minutes I was looking at my clocks, painfully waiting for this film to end. And all this boring scenes, they go on, and on, and on. Well, it's not the worst film of 2012, at least I don't think so - I haven't seen a lot of other movies. I don't expect much from Paranormal Activity, but the point is - Alex Cross is not good. It's not the worst movie you will ever see. It's simply below average.",
      "total_reactions": 0,
      "user": "Palenoire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Tyler Perry should stick to directing rather than bieng in action films. Based on the book series gave Tyler Perry the worst opening week as an actor.",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I love Madea and there were a few times I thought I heard Madea's voice come through Alex Cross.  :)  Aside from that, Tyler's role was decent and a bit surprising.  I did not expect him to do as well and was pleased to see how much I enjoyed the film.  I would invest in seeing a series.",
      "total_reactions": 0,
      "user": "Micquez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Alex Cross was a very good movie. I think Tyler Perry was very good in it.  He\"s no Morgan Freeman,but he was good. I wonder why most of the movies with Black Stars gets Bad Ratings and movie like\"Thats My Boy\" which was Bad, gets good rating.....Crazy....Soooo....To Tyler Perry, Keep Up the Good Work!!",
      "total_reactions": 0,
      "user": "DIAMONDGOLD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Mathew Fox is the only reason I kept watching. He is the one bright spot in this cheesy acted, character undeveloped, predictable film. Far from the \"Kiss The Girls\" Dr. Cross!!",
      "total_reactions": 0,
      "user": "Gatsby007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Alex Cross was a surprisingly good movie! I've never read the original books, so, I cannot make a comparison, but, this was a very nice movie compared to some of the unoriginal stuff that they put out these days. I found it strange to see a mainly-comedy actor play a serious role, but, he actually fit it nicely.",
      "total_reactions": 0,
      "user": "ItsRaininMen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Convincing performances by both Tyler Perry and Matthew Fox prevent this otherwise generic action thriller from being a total bomb. If nothing else, Alex Cross served as a vehicle for Perry to prove his dramatic acting chops.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Just an average action thriller movie. See for yourself and give your own judgement.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}