{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 234,
  "mc_movie_name": "Alice in Wonderland",
  "mc_negative_rating_frequency": 150,
  "mc_positive_rating_frequency": 307,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I really thought I was going to dislike this movie. However, I was surprised by how much I liked it. Johnny Depp was excellent as the Mad Hatter. Although, my only complaint was that Christopher Lee was really underused. I wish I could hear him speak more lines as the Jabberwocky.",
      "total_reactions": 5,
      "user": "gm101"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "If you expected a controversial movie form Burton, \"Alice in Wonderland\" is not what you expect. However, the eerie creativity and fantastic visuals might delight you for the moment.",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Going into the film with very little expectations, I was very pleasantly surprised! The acting was really good, especially by the lead actress and Helena Bonham Carter... Anne Hathaway was somewhat annoying, but that's just because of the nature of her character - all bubbly and ... annoying. Ha.",
      "total_reactions": 3,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "All style very little substance.  Tim Burton has a tendency to do this, the visuals look amazing, but unfortunately the story lacks entertainment.  Plus as good as Johnny Depp is he's just kind of annoying here.",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "This is a brilliant take on the classic \"Alice\" story, with good acting, good characters, and the only real flaw being the over-the-top \"Lord of the Rings\" style climax. Well done, Tim Burton, and can't wait for the sequel!",
      "total_reactions": 3,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "While it was light on plot and character development, Alice in Wonderland was a visual delight-perhaps the best ever created by Tim Burton.  It's not amazing.  But for those who haven't seen it, I recommend you give it a chance, and tumble down the rabbit hole with Alice.  A 7.5/10.",
      "total_reactions": 5,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Tim Burton directs a ton of  heart and adventure into this adaptation which makes it great, but he also skillfully  directs one of the most important details of the story into the movie the wackiness. He also has impressive performances especially Johnny Depp and newcomer Mia Wasikowska. Some cool action and just amazing visual effects. I give this film 92%.",
      "total_reactions": 10,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "Terrible! Awful! Hideous! Johnny Depp ruined his career for starring as the Mad Hatter! The plot from the 1951 animated version (the one we all know and love) was massacred! And Alice wasn't even listed as the main character! For some reason, the Mad Hatter was. It's ALICE'S adventure in Wonderland! Not his! This is truly a disgrace to the \"Wonderland series\".",
      "total_reactions": 4,
      "user": "Sheldonc1981"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "The positive of this film is how visually appealing it is, however because it came out roughly around the time of Avatar, it becomes a second rate fantasy flick. Combining this and the messiness of the screenplay creates rather a disappointing film.",
      "total_reactions": 4,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 3,
      "text": "Another classic story that Tim Burton messes up by making it dark, don't get me wrong I've always wanted to see the story of Alice in Wonderland in a more mature setting about her sanity slipping, but it doesn't do that it just tries to make it an action movie with a darker tone, but fails because it doesn't make any sense, the reason I didn't enjoy it is because they have the setting, but they don't have the all characters as they should, I only like one character and that was not enough to save the movie from failure.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "Stop ruining Disney classics already and stop using Depp in everything. What is the obsession with the guy? Sure he was great in Pirates of the Caribbean but Mad Hatter? Give us a break. Should never have been made into a live action movie. Actually, Terry Gilliam should have been the one to have done it. Tim Burton just doesn't have it anymore in my opinion.",
      "total_reactions": 2,
      "user": "Hellion"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "A wreck that both Disney and Burton should be ashamed of. To take a literary classic and attempt to create an unnecessary new eerier world out of Wonderland is abysmal.",
      "total_reactions": 2,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "A fantastic movie for all ages. Full of funs, fantasies, mysteries and all. It has the element to attract people. I'm very proud to Mia Wasikowska, she does a great act for this. The Red Queen is very funny. I don't get the character of the Mad Hatter who is played by Johnny Depp so i will minus the perfect points for this movie.",
      "total_reactions": 5,
      "user": "iamkhenzpolenio"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Just one word: Boring. It is just so boring and it isn't good in any sense, not the characters not the story, nothing. Apparently Burton was just given a bunch of money and decided not to focus on the story or the characters or giving an inventive view on the wonderful book this movie is based on, and just spent it  on the special effects which are just ok. Terrible movie can't believe it's nominated for a golden globe.",
      "total_reactions": 9,
      "user": "arziankorpen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "The WORST movie of 2010. Its a horrible sequel to a so-so movie. CGI is bad, 3D was atrocious, i was bored and I was just sitting there waiting for it to end.",
      "total_reactions": 3,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "The point of an adaptation is to create your OWN vision, while sticking true to the important elements, of the original story. Tim Burton has done just that, and beautifully. Not my FAVORITE adaptation of \"Alice's Adventures in Wonderland\", but it's up there, and is certainly a memorable experience. In IMAX 3-D, it truly blows you away (especially the rabbit hole scene; GENIUS!)",
      "total_reactions": 3,
      "user": "GVirus16"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "the way Avril Lavigne did the song Alice was the only reason why this movie was such a big hit from Tim Burton. take my advice: go and see it.",
      "total_reactions": 7,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Alice in Wonderland is a dull and cartoonish film that only provides Johnny Depp's always great acting. I was quite disappointed.",
      "total_reactions": 2,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "A very odd and unique film. I'm almost disappointed that I didn't see this in 3D. Which is the only reason why anyone should watch this. This film was very, very, very fast paced. It will also go on my list of Tim Burton's worst. A word of advice to Tim, stick to stop motion. Although, the best aspect of the film is the costume design. Especially Alice's red dress. It's a no drainer that this won for Best Achievement in Costume Design at Oscars. The next great thing about this film is the effects. Loved the part when Alice falls down the rabbit hole. With a stunning performance by Johnny Depp and the rest of the cast the acting was decent. There was a nice feel to the acting. There personalities where spot on, especially the Red Queen.To break it down, I recommend this movie to people that get board with good movies and love fashion.",
      "total_reactions": 3,
      "user": "MetallicCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "This re boot of alice in wonderland is so unnecessary turning a fun story into a boring war filled political thriller with no soul and no sense of enjoyment.",
      "total_reactions": 1,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "It is a perfectly acceptable film, but I couldn't escape the feeling that so much more could have been done with such potent material. This is, after all, Tim Burton doing Alice in Wonderland! Why wasn't I blown away?",
      "total_reactions": 0,
      "user": "aabender002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Tim Burton's update of the classic Lewis Carroll tale \"Alice in Wonderland\" is an inspired work it embodies everything that makes Burton a master and what makes him a genius at the art of   dark fantasy.  While this  sequel ,or re Imagining, if you would like to call it, is a dark morbid fantasy film that while may lack the  wide eyed child  enthusiasm of the 1951 Walt Disney animated production it still keeps the adventure, the fun and the charm of the original production and book.  What I liked most about it was the dry sense of humor infused into this classic story, but also I like the fact that it does not try to be more than what it is; it does not try to be some audacious   fantasy film. Instead, it settles for an above average Burton film with a lighthearted side, while retaining the amazing visuals and stylish pace that is expected of Tim Burton. \"Alice in Wonderland\" may not impress everyone but for those who like some visually appealing dark fantasy films with a good-hearted   story to them. \"Alice in Wonderlandâ",
      "total_reactions": 0,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Tim Burton's re-imagining of Lewis Carroll's classic fairytale using his inevitable dark ,Gothic style. Really enjoyed this and it's a mixture of the original book & Through the Looking Glass. As expected, the visuals are brilliantly surreal, voice acting great & with Johnny Depp & Helena Bonham-Carter hamming it up as the Mad Hatter & Red Queen respectively.  Danny Elfman's score plays a big part too in keeping the tone as he's done with most of Burton's work.",
      "total_reactions": 0,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "You know why I don't like this movie at all? Just because of those stupid ads they have on the internet! They're annoying(just because I saw them a billion times on the internet)! I'd never watch this at all! EVER!!!",
      "total_reactions": 0,
      "user": "Jaden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "A Terrible deception...Tim Burton...what happened in this movie?",
      "total_reactions": 0,
      "user": "Joax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Horrifying.  It's as if the movie's entire purpose was to reinforce the dominant paradigm rather than deny it, and all the while take deliberate measure to mock the unfortunate.  The Red Queen character was the only one that felt remotely human, and she was swiftly disposed of with sadist cruelty.  The White Queen, for someone who supposedly was the image of purity, was of a condescending, arrogant, and spiteful brand.  Alice herself just falls back into others' expectations by slaying the Jabberwocky, which is itself a hardly thoughtful and tedious motion to forge some sort of third act; needless to say, the bit at the end is an offense to the Chinese deserving of harsh reprimand.",
      "total_reactions": 0,
      "user": "Jammerjoint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "I have to say Johnny Depp did a great job in the movie, but thats about it. what really ruined the story was the actress who played Alice. she was boring and did not make you want to keep watching the movie. the graphics and animation were excellent though.",
      "total_reactions": 0,
      "user": "peoplewhomatter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "I'm really mixed on this movie. On one end the art style looks cool capturing the strangeness of Wonderland quite nicely. Plus, it's nice that the film was not a rehash of the previous Disney version of the film. On the other hand though I did not care too much about the characters and the story. Plus, the story telling felt a little cliche for me. Overall, decent flick not going to recommend it and I'm not going to say do not see it because I do not feel strongly towards one side or the other. I'm going to say is see it in 3D if you can because there are a lot of 3Dish shots in the film.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "While I saw the original 1951 animated film when I was a child, and had the LP that told the story in an abridged form during my younger years, I've never read the Lewis Carroll novels, nor do I really remember much from Walt Disney's original masterpiece. What I can attest to is how beautiful and entertaining Tim Burton's version was. I've read several reviews from those who did not care much about this film. Those who hated the deviation from the original story. Those who hated the deviation from the animated film. Those who thought it was another fantastical, yet watered down, version of Tim Burton's imagination.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "I remember one year, Target had copies of Santa Clause Conquers The Martians. I bought this, and then proceeded to watch it at my home. I got a few minutes into it before I realized I had seen this movie before. It seems Mystery Science Theater 3 Thousand had already covered this movie. This movie was so bad, it had already gone down in legend.  There is not 1 redeeming feature in that movie. I enjoyed Manos: Hand of Fate more than Santa Clause Conquers The Martians.",
      "total_reactions": 0,
      "user": "not_good"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Mainstream Hollywood is entering an era of ridiculous amounts of CGI effects and unfathomable budgets.  After watching an outlandishly gaudy Avatar and Tim Burton's atrocious animation film 9, Alice In Wonderland wasn't so promising. But to my surprise, Alice shows that there is modest hope, not a lot, in this ill-fated generation of movies.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "I loved this movie and I don't care what people think! This was a great movie, the style, and atmosphere created was dark and at the same time pretty. I specially loved the queen. This movie is simple fun with a very pretty art style.",
      "total_reactions": 0,
      "user": "Tubie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "It is not quite as brilliant as I expected. Johnny Depp's creation of the Mad Hatter is wonderful, but it seems to dominate the film, where as Mia Wasikowska's 'Alice' was just as great a character to watch. It is unfortunate too that the film ends with a large action sequence that seems to downgrade the film overall, however the quirkiness and amazing visuals of the film, and the charm that is nevertheless existent despite its flaws, overcomes these. The stand out performance comes from Helena Bonham Carter, whose wonderful interpretation of the Red Queen is hilarious rather than villainous. It is, so far, one of the best films of the year so far and definitely worth watching.",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "Movie is just an attractive and appealing picture, unfortunately it contains nothing valuable. One time see movie, will not watch it again. '3D' added just to be. Average",
      "total_reactions": 0,
      "user": "MiraLoma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "C'est une mauvaise adaptation. Un point c'est tout. Les premiers films de Tim Burton restent des chefs-d'oeuvre comparÃ©s Ã  cette chose sans forme. Si vous avez adorÃ© Charlie Et La Chocolaterie vous aimerez surement cette version d'Alice. Ce n'est Ã©videmment pas mon cas.",
      "total_reactions": 0,
      "user": "arthurcloud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "Half Of this point goes to johnny depp and the other half point goes to helena bonham carter, no problems with them at all. However having never even read the book, I will say that other than the two aforementioned actors this film was garbage. It had no direction, the main character was left completely undeveloped, the actress playing the main character had no screen presence let alone confidence in her role, there was no sense of tension, I'm pretty sure something called a bandersnatch (which my mother informs me was not ever seen in the book) is not supposed to be and endeared loveable dog thing, it turned into another uneededly epic underdog story at the end, with unspoken potential for romance between the pimary female and male lead (oh disney you never fail to do this), there were a ton of unecessary characters who DID not pull their weight (spastic rabbit thing, mouse, other rabbit thing, the goddamn dog {aww he has a family, how lovingly manipulative} and the fat boys) Ughh and she does one of those disney things where she goes and tells everyone whats what at the end of the film all things which could have been concluded at the beginning of the film and i would have forgiven it ALL IF THE GODDAMN JABBERWOCK WASNT A GODDAMN DRAGON!! AGHH EVERYTHING IS A DRAGON MY DAMN COFFEE TABLE IS A DRAGON! MY EBONY COA COA BUTTER CO*CHIE IS A DRAGON MY IMAGINARY NEPHEW IS A DAMN DRAGON!",
      "total_reactions": 0,
      "user": "unclemarsellusw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "In the creative mind of director Tim Burton I say bravo. These graphics show that is mind thinks in very strange ways. The acting and the screenplay were rough in areas and great in others. Some of the time you just sit there and wonder \"Is this ever going to move on??\" and other parts you think \"Holy crap this is great!!\" It really depends how you look at this movie to know if you love it, hate it, or thought it was good. for me i thought it was good but certain parts of me wished they made the first part and then this part next.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Finally, I saw ALICE IN WONDERLAND the movie that I have been waiting for such a long time. The tale about nineteen years old Alice following the white rabbit, to find her destiny back in Wonderland that now ruled by Red Queen. The movie directed by Tim Burton, the man specialty in eye candy and delight visualization. Thiz movie is the seventh collaboration with Johnny Depp as his main Cast, after EDWARD SCISSORHANDS (1990), ED WOOD (1994), SLEEPY HOLLOW (1999), CHARLIE AND THE CHOCOLATE FACTORY (2005), CORPSE BRIDE (2005), and SWEENEY TODD: THE DEMON BARBER OF FLEET STREET (2007). His other masterpiece features are: BEETLE JUICE (1988), BATMAN (1989) and BIG FISH (2003). Thiz movie supported by various Casts like: Anne Hathaway, Crispin Glover, Michael Sheen, Alan Rickman, and Mia Wasikowska as Alice. The most powerful performance in thiz movie is Big Head Red Queen character, which played amazingly wicked and funny at the same time by Helena Bonham Carter (is about the same character on Lord Farquaad in first SHREK (2001)). Bonham Carter performance exceeds Depp appearance. Her existence saves the movie for overall. Beside that I did not feel any emotions on thiz film, everything was flat. Actually, thiz movie did not supported by good script. It might, the worse script that came to Tim Burton desk in these past twenty years of his career, despite the visualization is A-class. The story is an alternate version of Alice originally written by Lewis Caroll. thiz version did not carry such a thrill and interesting plots. In the final scene (Spoiler Alert!), give Alice a sword and knight armor to slay a dragon? It is definitely not a good option. The change is too radical, soft and tender Alice that builds from the beginning, suddenly take an incisive turn over. The flip over so hard that possibly had become its own boomerang itself.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "this movie wasn't horrible and it wasn't great but it did show the scenes as a magical area and i loved how Johnny Depp played the mad hater but over all it was interesting.",
      "total_reactions": 0,
      "user": "christina"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "Alice in Wonderland is a very pleasant movie. The movie passed without me blinking, there was no dull moment what so ever. By the time it reached signs of the \"end\" I asked myself, has it been 5 minutes yet? The movie puts you in a very interesting world with strange places and characters. The music in this film was the best music I've heard in a movie in a long time. The acting was amusing and little details about the characters' personalities was made in a very smart fashion that will keep you entertained through out the movie. I give Alice in Wonderland a 6 or 7 for all the fun that I had watching it, I wished it was 1 hour longer.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "I'd break this movie down into the following components: 1. Story:  Three and a Half Stars;  >>>> 2. Acting: Three Stars; Competent but not groundbreaking;  >>>> 3. Sound and Visuals: Four Stars; Gorgeous but sometimes \"too unreal.\" Yes that's an odd statement for a fantasy film.  What I mean by this is that some times you are too aware that it is not real, in that it seems artificial.  Well done effects can mute the aspect of artificiality, as I feel was done better in the second and third \"Lord of the Rings films.\";  >>>> 4. Gestalt:  The movie does not excel the sum of its components, as few films do.  An example of one that does is \"The King's Speech.\" >>>> My full cinema profile here: http://bit.ly/MyMovies",
      "total_reactions": 0,
      "user": "Efreet69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "This movie totally rocked.  Johnny Depp, Mia however you spell her last name, Helena Bonham Carter and Anne Hathaway i think did a fantastic job.  This was one of my favorites of 2010.",
      "total_reactions": 0,
      "user": "guardboy21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Well thankyou Tim Buton, thankyou for at least making me want to deliberately avoid thinking about how much I hate this film.  I summarise reasons below why I endeavour to avoid even remembering what it is I despised so much about this film, and why it actually makes me depressed just to write this review.  In no particular order of awfulness:",
      "total_reactions": 0,
      "user": "Rick_Rogers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "All the beauty and the hard work in creating Wonderland really pays off especially if seen in 3D.",
      "total_reactions": 0,
      "user": "Leeway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "The acting is superbly wacky; Mia Wasikowska is excellent and Johnny Depp is perfectly cast.  However this movie, which should more correctly be titled 'Through the Looking Glass,' features a plot and script so confusing and convoluted that the acting is lost in the muddle.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "One summerâ",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Alice in wonderland is good movie. But, action is so-so. It is gorgeous 3D movie!!!",
      "total_reactions": 0,
      "user": "Yu38111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is very interesting movie. Alice's story is very famouse. so, I was execiting movie. And costume is very great and cute!! Gohnny depp is very cool !! I want to into the world. I try see movie again.",
      "total_reactions": 0,
      "user": "saori21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Tim Burton was once called the cleverest and most imaginative filmmaker in Hollywood since David Lynch. A decade later he made Alice in Wonderland, and finally gave into his desire to be painter rather than a storyteller.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "It is not what you could call \"Burton's best film\" and totally lacked the appeal of the original version but decent acting and incredible visual effects kept my attention through the whole movie.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This version actually makes sense unlike the original version, because there's an actual story rather than a sequence of random events like the original. Mia Wasikowska has a fine mainstream debut as Alice and the rest of the cast have fun performances including Johnny Depp and Helena Bonham Carter. Despite Tim Burton's signature touch, it becomes quite ordinary towards the end. For what this movie was trying to do, I think it did a good job at it.",
      "total_reactions": 0,
      "user": "jos95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "For me the 1st 2/3rds of the film are a bit scatty and a mish-mash of ideas and plots - there's nothing quite holding the film together other than it's whacky visuals and the odd bit of magic. The last 3rd of the film really saves it though, and adds a lot of substance to earlier proceedings. It could have done with a lot more magic throughout, and also a bit more direction - but at no time is it unbearable and often it is fun, with that last 3rd being very good indeed.",
      "total_reactions": 0,
      "user": "SpunkyMonkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "Despite a strong start to his career, in more recent years Tim Burton has somehow managed to monotonize the absurd. Johnny Depp in Wonderland is a prime example. Despite what die hard fans of Burton may say, there are no original ideas here it's just a bastardised version of what you've already seen. I think it's supposed to be a sequel but if that is the case it's a fairly terrible one.",
      "total_reactions": 0,
      "user": "LJHayes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This film tends to be underrated by the other critics. It passionately tells Alice's story with wit and a lot of decent story ideas. Visuals and action are good as well.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Alice In Wonderland really is a mixed bag. I know that's hardly a way to begin a review, but when you've got a bag as mixed as this, it's hard to know quite where to start. I never can tell what Alice In Wonderland is trying to be, whether a drama, an action movie, a comedy, but it appears to be juggling all three at once, which provides mixed results, as I mentioned previously. Instead of being a mere adaption of the Alice In Wonderland book, Tim Burton instead creates a story that occurs 13 years after. Alice is set to marry a lord who she does not want to marry at all. Demands from her mother and parents of Alice's predetermined husband further confuse and frustrate Alice. So to escape it all, she follows a familiar rabbit into a rabbit hole, and we all know what will happen from there. Or do we? Since this is, in fact, 13 years after the original Wonderland incident, things have changed. Wonderland (or Underland, as we learn it is called) has become a much darker, and dangerous place. Alice is destined to slay a beast called the Jabberwocky, but she doubts herself, and the Red Queen wants her killed. It's all a little bit more complicated than it needs to be. But Underland is all about complications. I will start by pointing out Alice In Wonderland's biggest strength: The visuals. Between the magnificent makeup, the ridiculous costumes, the outrageous hair, and stunning special effects (and they are stunning sometimes), Alice In Wonderland is one of the most visually captivating films ever made. But if only everything else was as wonderful and undeniably incredible as the visual effects. The characters, while mostly amusing, feel a little bit...predictable. Tim Burton usually likes to recreate the characters, but instead, we get virtually the same characters from the book (and animated Disney movie), with little exception. True, Burton tries to flesh them out a bit more and add additional back story, but it does little to separate the characters in this adaption from the animated version. The acting, like the film, is a huge mixed bag. That's not to say that there are BAD actors. All the acting is very good, it's just expected. Predictable, like the characters. Most everyone is played by the book, with no special spin on almost any of them. Johnny Depp disappoints in his role as the Mad Hatter. He needs to be over the top and ridiculous. Instead, he's just rather ordinary. What happened to the wacky, bizzareness that be brought us in Charlie In The Chocolate Factory? But this isn't always the case with the acting. Helena Bonham Carter (as the Red Queen) is as outrageous and ridiculous as she needs to be, and more. Her acting is by far the most impressive in the film. Carter ends up doing the performance Depp should've done, but doesn't. One performance I didn't expect to like was Anne Hathaway's as The White Queen. \"She's much too recognizable.\" I thought. And I was right. But she does perfectly. She's extremely dramatic and flowy, and she does a marvelous job. Without doing any research on the score beforehand, I knew that it was composed by Danny Elfman. After looking it up after the film, I was proven correct. Here's how I knew: It sounds like all his other scores. Yes, Elfman's a great composer, but all his scores sound alike, each borrowing elements from his last score. If Elfman can't get his act together, Burton may need to look for a new composer. My last opinion about Alice In Wonderland may be the most important: It makes sense. Well, mostly anyway. It's not nearly as whimsical and bizzare as it should be. It's actually, relatively straight forward. Alice In Wonderland just isn't weird enough. It needs to be more odd. More outrageous. The animated version did a much better job at this. I wanted to like this film. I wanted to love it. But Tim Burton's Alice In Wonderland just isn't the film it should be. But it's not half-bad. If you haven't already seen Alice In Wonderland, it's not a bad diversion; it's just not a very good one.",
      "total_reactions": 0,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "This actually my least favorite movie of all time. It does something that I hate where movies try to make some classic story into lord of the rings. I cannot stand that. That of course is my subjective opinion. There are many other things I don't like, the acting, the dialogue, the VFX. The Cheshire cat is good though. Not good enough to redeem a single point, but he was the best thing in the movie.",
      "total_reactions": 0,
      "user": "bricefp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I'm guessing this is one of those \"loved by the public, hated by the critics\"-type films. I, for one, found it delightful. What else would you expect when you have a wonderfully quirky author adapted by a wonderfully quirky director?",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I saw Disney's version years ago when I was a kid (in Finnish), and don't recall all that much from it... other than that it was a weird, psychedelic movie. I think this matches the themes of the original quite well.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Alice in Wonderland is okay. Great visuals but the acting seem corny and the charcters looked stupid. An average film with average acting and average story.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "The creativity of Tim Burton is what saves this movie. In all truth, it was very boring at times. It picked up at the end when more interesting characters appeared. It was still full of great wackiness though.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Here's what's wrong with Alice in Wonderland: it doesn't want to be Alice in Wonderland. It wants to be Narnia. The Dormouse's overhaul into a feisty fencer alone is clue enough, as if everything else weren't already screaming it at you through a megaphone. The problem is that it isn't Narnia, shouldn't be Narnia, and isn't nearly as good at being Narnia as Narnia. Johnny Depp is more annoying in this film than he has ever been before, creating a Mad Hatter who is just confusing instead of remotely endearing, and every other character is roughly him in miniature in this respect. It's not even the good, bewildering kind of confusing that you would expect from the source material: it's just the bad, boring kind of confusing that suggests the filmmakers didn't do their homework, didn't try to create a character with a meaningful identity, and didn't try to make sure their characters had actual purpose and plot relevance. The March Hare is reduced to a one-note side joke. The Dormouse has been marginally elevated...into a slightly DIFFERENT one-note side joke from the one in the book, with slightly more screen time (this time, the joke is that the Dormouse is a Reepicheep clone! HOW WONDERFUL!). The Mad Hatter is the only character from the tea party that seems to matter, but he's just annoying. The Tweedle twins are simply dull and underused instead of funny in any way. The White Rabbit is instantly forgettable, and you'll forget him every time you see him. Anne Hathaway, as the White Queen, hints at interesting character elements...that you will never ever see. Helena Bonham Carter is forced into a heartbreakingly shallow role as the Red Queen that everyone knows she is far too good for.",
      "total_reactions": 0,
      "user": "GodotIsW8ing4U"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Nope. I'm going to say that if you have not watched the 1951 animation, you'll probably enjoy the film. If you have, it will certainly be a disappointment. It just does not have the strong heart that the cartoon had.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "I loved the movie, especially the sets, clothes, and the provision of the actors (of course), but the story could have been different and the ending could have been another. Loved the provision of Leo Bill, although very small.",
      "total_reactions": 0,
      "user": "lady_ascot21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Although very entertaining and beautiful because of the color saturation that was used this live action adaption of Alice in Wonderland just doesn't seem to capture the \"wonder\" that is Wonderland. With the cast of the film it could have been much much more but the color saturation becomes borderline grotesque and it just falls short of being the truly magical Wonderland that we were all expecting. And as much as I like Tim Burton, these flaws are most likely his doing. Sometimes Burton's creepy touch is not what a film needs or should have.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "A pseudo sequel to the 1951 animated film, Tim Burton's Alice does a really good job of showing the titular character struggle with her inner demons and fight for the right to be her own person. It's mostly based on the book's sequel, Through the Looking Glass, but it gives special call outs to most of Lewis Carrol's short stories and poems, particularly The Jabberwocky. The cast is great, and the visuals and music are Oscar worthy!",
      "total_reactions": 0,
      "user": "Edork"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Fraco",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Having a 4 year old child, we've been watching a lot of versions of Alice in Wonderland.  I was nervous about seeing the Burton version for two reasons: (1) the really negative critic reviews; and (2) it seemed a bit scary for my son.  In fact, I felt that this was, by far, the best version of Alice in Wonderland I have ever seen.  Unlike the others, the characters had tremendous depth, not just random strange entities with no overall connection.  And that lead me to the other wonderful thing about the film: IT HAS A PLOT.  It's not just a surreal drama, but there is a plot that keeps the viewer engaged throughout, and gives a purpose for each character's actions.  I did NOT expect this from Burton.  Is it true to the original?  Not really, but it's so much better.  Much like the play Wicked had certain aspects that were much better than the book.  I honestly think that this is one of the best movies I have seen in a long time.",
      "total_reactions": 0,
      "user": "wieltsj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Great movie for the entire family, primarily the kids. Funny with family friendly action. Any parent should get this movie for their kid. But I dont recommend watching it more then once or twice, the most is just a bit too predictable.",
      "total_reactions": 0,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "It's pretty much just a film adaptation of the poem \"Jabberwocky\" by Lewis Carroll than the actual book that he wrote, that's not necessarily a bad thing but I just don't think that's what it should be about. Most other things are good though, acting, CGI, and I was entertained while I was watching it. It's a good movie, but definitely not a must-see.",
      "total_reactions": 0,
      "user": "MDG397"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 1,
      "text": "This is absolutely one of the worst movies ever made. It's so corny, dull, and boring that's it's impossible to enjoy. Not to mention that it's extremely creepy and dark but it's a kid's movie! Do not let a child under 10 see it or he will be scarred for life. How did this make over a billion dollars on it's box office?!! The only reason it gets a one from me is because of the special effects. But other than that.............. Horrible! Horrible! Horrible!!!!!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "Superb visuals and great acting make this classic tale a great movie for kids, not so great for adults, but i think that it deserves at least a watch!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "I think Tim Burton should get plenty of rest. He is rusty. \"Alice in Wonderland\" is a outrage for Lewis Carroll's novels. Film without charm and boring. If Burton wanted to destroy the memory of the 1951 film, he just find it.",
      "total_reactions": 0,
      "user": "mapizarro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "I honestly expected this movie to be better than what it turned out to be. More a dissapointment than a disaster. But the main reason for the movies' bust is some of the acting, especially Mia's portrayl of Alice. Out of all the characters, Alices' was the worst. It made me hate this movie more than try to enjoy it. Aside from it's fairly descent visuals, you've really just entered a boring world that doesn't get better.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "you know, remakes suck. Ever so rarely is there a new version that is substantial or even better than the original. This one is neither. It is an instant cash grab of the most iconic tale of wonderment and enchantment, turned into a clichéd pop corn flick. Just throw this movie in the pile of movies that look good, but lack any good direction in story and development. First off, Tim Burton. Why do he keep doing these remakes; maybe he didn't actually do that many and I'm just being angry right now, but he hasnto stop. Why, why oh why can't Hollywood just leave our childhood alone? Enough ranting, time to get serious. The main problem with this movie is surprisingly the amount of darkness in it, not that I dislike it, but I feel that there's not enough or too much at times. At times you see really ghastly images; speaking of which just about 90% of this flick is CGI, and other times it's not. Of course you have Johnny Depp. he does an okay job as the mad hatter, nothing great just fine. Alice is easily forgettable and I don't I just don't care about her, all I care about her is that she has to fight some dragon in the end. Which is another problem, in the first 10 minutes or so, they just flat out tell you how it's going to end, in a cliché manner. I know there's this quest of understanding and all, but stopped prolonging the inevitable. The only none effect related comment I can say about this flick is that the red queen played by Helen Boncarter: I think, does a good job at being extremely over the top, and she's fun to watch. That's it I guess, I don't like this movie, and I don't recommend this to many people.",
      "total_reactions": 0,
      "user": "Skullgirlsfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Tim Burton tried to make this movie work, but just couldn't quite pull it off. Depp is fun to watch, dancing around the scenes while making an ass out of himself, while Anne Hathaway plays a roll she can't quite fit into. There is enough eye candy to keep you awake, but just like movies of kin, eye candy isn't enough.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "I still remember when this film first came out, it was all the buzz. The trailers got people excited, Disney laid out an aggressive marketing effort for the film and raised awareness for it, creating genuine interest in the film. Then it came out...and no one really knew what to think of it. Hell, I was in 6th grade at the time and even us 6th graders, a group that doesn't have the highest standards in the world to begin with, didn't even know what to make of the movie. Was it a great, fun, exciting adventure? Or was it too much style over substance? Well, I waited until the Blu-ray release to get my word on it and, well...I enjoyed it. It's gorgeously designed, it's exciting, fast-paced, reasonably fun, and pretty solidly acted. Sure, it does seem to be battle a gigantic identity crisis overall (is it supposed to be dark and serious, or light-hearted and goofy?) and the story isn't stellar, but \"Alice in Wonderland\" is a pretty entertaining film overall. Some people may have been so burned by the hype that anything less than excellent will be bad, but overall, even if it isn't \"excellent,\" it's still a pretty good film overall that's worth watching at least once.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Wonderland isn't all that wonderful.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Well lets face it this film is a  creative masterpeice from Walt Disney's original Alice in Wonderland which i got to say that it was a fun movie when growing up , Now it's Tim Burton's version of \" Alice in wonderland\"",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "This movie was just awful! I went in with high expectations and expecting a similar story to the book but they tried to do something different and it didn't work. Only thing good about the movie was the 3D.",
      "total_reactions": 0,
      "user": "jbrown8989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Alice in Wonderland surprised a lot in the animation of the year 51, in 2010, Tim Burton sack a slightly different story, but this time it's a bit boring , but the special effects are worth highlighting but the version Tim Burton I remain so.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Tim Burton Alice in Wonderland it's a good attempt to bring the live adaptation to the bring screens. Part of that is because of strong supporting cast, however the story leaves more to be desired and more development is needed. In the end. Alice In Wonderland is solid.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "What were you expecting? It's not like the trailer didn't say it was a follow-up to the original story. There was even one bit (not in the final film) where the Hatter loudly says \"Alice, you're back!\" . This was actually a rather good film. It had that distinct Tim Burton style to it and Johnny Depp does a very good job as The Mad Hatter. But I will agree with those who say the climax is over-the-top and out of place in an Alice in Wonderland movie, cool as it was. Nevertheless, Tim Burton's vision of Wonderland is a very interesting one. I've heard that the sequel uses the character of Time to show a much more detailed version of Alice's first trip to Wonderland. That's something to look forward to!",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Wow there are too many negative reviews O.o . In my opinion it was a fantastic movie and I love all the characters, I love the red Queen and the Mad Hatter! . I can't wait to through the looking glass.",
      "total_reactions": 0,
      "user": "diegonelli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "The movie is seeped in distinctive visuals, is a journey worth taking mainly to see Tim Burton's imagination at play. I liked the plot, This movie puts it's 3D to good use.",
      "total_reactions": 0,
      "user": "Berry-Tan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Another \"What was that?\" dull adventure that just couldn't work the first time. The second time manages to look even messier than watching it the first time. Watch the adorable animated Alice in Wonderland instead.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "I finally got to see Burton's Alice In Wonderland and I really wonder what all the fuzz is about. The film isn't nearly as good as Burton's best work, but it isn't nearly as bad as some claim it is either. Although he seems to have past the peak of his career, Tim Burton at least managed to turn a horrible script in a mediocre but visually appealing film film and while it's a shame Alice wasn't the masterpiece it could have been (especially if it was based on the American McGee game) I don't think it deserves to get all the hate it gets either.",
      "total_reactions": 0,
      "user": "johnslegers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "Alice in Wonderland is a kind of miracle, with a great direction, full of magic, color, suspense and interesting story-telling, including its amazing interpretations, despite the easy plot, and that's why this film became the most successful of 2010. Enjoy it.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2016
      },
      "score": 3,
      "text": "All of the problems I have with this film are expressed in the Nostalgia Critic's Video review of it and in his real thoughts video. If you wish to have more detail's about this film's failings as an adaptaion go watch said videos. Here is the link for them:",
      "total_reactions": 0,
      "user": "ElectroNick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 0,
      "text": "PUTRICIA EN EL PAÍS DE LA PUTA MIERDA",
      "total_reactions": 0,
      "user": "AngusBarbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Wow. I should have seen this movie way sooner than this. The Story was incredible dense with such great, diverse characters. The adventure is really thrilling with such great background music to take you \"down the rabbit hole\"  I Really enjoyed this one as a fantasy movie where everything is rather vague and everything comes at you with at a certain point you feel you are part of the story. Great one and i should have seen it in theater instead of DVD!",
      "total_reactions": 0,
      "user": "Gyrusho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 2,
      "text": "Well, its 2010 and what are the big budget studios doing? making mediocre and bad films, no surprise there. This adaptation (or total revamp?) started off well and witty, but then got dumbed down to where the scene at the end with the chess game between the red and white queens and what was that other thing? the Cracken?? haha, either made me want to sigh or snore loudly in the theater. I feel like telling Tim Burton that trying to do a post modernist version of Alice... just doesnt work and Phoebe in Wonderland is a much much better independent film (especially if you want to do a different Alice.. and one that involves actual living complex human beings instead of one dimensional cartoon characters). Who is Tim trying to be anyway? Roland Emmerich? Oh, and by the way at least this film was a couple of rungs (or many rungs? if were counting?) above 2012 which really sucked $%$%$% bad!! So, I think Ill just be sticking with Sony Pictures Classics or IFC and traveling further to see better films.",
      "total_reactions": 0,
      "user": "pdw123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "Alice in Wonderland is basically a difficult film to like/dislike. On one hand, I found the movie to be visually stunning and well-done. In this aspect, the film was entertaining. On the other hand, the plot and characters were so-so even though I kind of enjoyed Depp's Mad Hatter character as well as the title character. One must also take into consideration that the main reason this film was so successful was for the following reason: It came out at the height of the 3D craze. Overall, this movie is fine to watch once in awhile, but not necessarily for repeated viewing. This was an okay film that had so much potential to have been better. It's not entirely bad, but not entirely great either.",
      "total_reactions": 0,
      "user": "rei07"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 0,
      "text": "Terrible. I've always wanted to see a  live action of the regular Alice in Wonderland, not creepy like this. Has nothing to do with the classic one I love much more. The characters are nothing like the original, either. The original Alice, Mad Hatter, White Rabbit, & Tweedles are much more likeable in the classic. Tim Burton ruined it.",
      "total_reactions": 0,
      "user": "bethanyrobben"
    }
  ]
}