{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Alien Abduction",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 4,
  "mc_pro_critic_reviews": [
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2014
      },
      "score": 80,
      "summary": "Credit this spirited, uncommonly effective found-footage thriller for breaking the templates promised by its genre and title."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "Beckerman intersperses the footage with static, loud and jagged, and the couple of \"effects\" included are quick and dirty. If you're going to go the found-footage route, you might as well try to find a new way to approach the material. Beckerman has."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Matty Beckerman’s Alien Abduction repackages ancient legend for modern audiences in a found-footage story of streamlined efficiency."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Despite a neat narrative twist delivered during the end credits, Alien Abduction is ultimately a by-the-numbers enterprise that will please only the most undemanding audiences at midnight screenings."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "The performances are perfunctory and the scenario standard-issue even if the\r\nexecution of this no-budget thriller is top drawer."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "A sci-fi thriller as generic as its title, Alien Abduction generates only low-voltage shocks."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 38,
      "summary": "A few jolting scares are deployed throughout, but more difficult to shake is how the story's overacting lambs walk a rather programmatic path toward slaughter--or at least anal probing."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "Suffers from the tired POV gimmickry, the weak characterizations, the numbing sameness of stuck-in-the-woods-with-dolts narratives."
    },
    {
      "critic": "Kristen Sales",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "A rote, unimaginative entry in the found-footage subgenre of science-fiction/horror. It looks better than a YouTube video, but it’s rarely more engaging."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "Another first-person film with more shots of people's fingers or darkness than anything else. On top of being able to see nothing, we get to hear dull mumbles and linear dialogue for most the film.  The aliens seem to be systematically picking the group off, but it's not intentional, they're just too stupid to find them in even the most obvious hiding spots. Apparently hiding behind car doors, or in a basement cellar is extremely effective in thwarting super-intelligent beings.",
      "total_reactions": 1,
      "user": "Andrewcles"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "This film is scary. It is actually way better than recent found-footage horror films such as \"The Marked Ones\" and \"Devil's Due\". It touches the subject of alien abductions realistically, with the use of few CGI and special effects in general. It is precious how the film is executed, with a breathtaking setting which happens that it actually exists and has the reputation of the paranormal. There are some well made shots in this film with the use of massive special effects, what makes it look so interesting and real is the statics that cover the special effects and makes it more realistic, it is the shot from the earth to the alien spaceship and from the alien spaceship to earth, when you see it you'll know it. The acting in this film is really good, I bought every single scene, well done! The film interviews people at the beginning (The Blair Witch Project) which makes it a high cliche. The alien lights in this specific mountain yes do appear in real life, but I doubt that the tapes are anything near real. The little boy masters cinematography and never misses a shot? I don't think so. The audio is not interrupted when the camera switches shots, so it would've been better off without the found-footage style. I would love to see a horror found footage film, that when paranormal things starts to happen, the film character drops the camera and the film continues as a cinematically shot film, it would've been interesting. Overall, I highly recommend \"Alien Abduction\" it is really well made, better than recent horror found footage films, although, I have the feeling that V/H/S segments are turning into feature films, first \"The Den\" (Skype segment from V/H/S) and now \"Alien Abduction\" (From V/H/S/2). Either ways, \"Alien Abduction\" is a better film than \"The Den\" and V/H/S movies are really good!",
      "total_reactions": 1,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Alien Abduction starts off like \"The Blair Witch Project\" , with documentary style clips of interviews with local people recounting their tales of the strange lights seen in the area and mysterious disappearances on the woods.",
      "total_reactions": 1,
      "user": "Geekyucky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Nauseating found footage camera work pulls it down from the bar of most modern horror flicks, but still Alien Abduction is effectively horrific thanks to the atmosphere and execution.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "The movie had a great overall atmosphere and some of the action scenes were well made but the compliments stop there. The movie is cliché, boring at times and the horrible acting performances make the movie even less realistic.Thumbs up for the mom for being one of the most annoying characters I have ever seen and thumbs up for the actress for delivering the worst performance of the movie.Watch it if found footage alien abduction movies interest you but if not, just don't watch it.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Alien Abduction might had improved from recent found footage films but since when were they any good. Filmed by an autistic 11 year old child does not give a right to deliver poor direction, or repulsive special effects an utter tragedy.",
      "total_reactions": 0,
      "user": "SushiStoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "This film is pretty intense with a standard start that seems to kick off most found footage film. The drama and suspense comes from the fact that all you see is what the camera shows you. The audience perspective is through the eyes of the youngest family member who is practically attached to his cam in the movie. Not knowing the full surrounding, or greater understanding of the environment, actually creates suspense and intensity in \"Alien Abduction\". That is a cool trick when it works, a lot of films fail to capture this element fully, \"Alien Abduction\" creates a tense atmosphere filled with melodrama. The middle of the film sort of drags and the added character trying to help the family actually takes away from the momentum a bit. That is just the middle though. The last act kicks in with the expected benchmarks that service found footage films well.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    }
  ]
}