{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 87,
  "mc_mixed_rating_frequency": 53,
  "mc_movie_name": "All Is Lost",
  "mc_negative_rating_frequency": 37,
  "mc_positive_rating_frequency": 136,
  "mc_pro_critic_reviews": [
    {
      "critic": "Chris Hewitt (1)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 100,
      "summary": "A triumph of pure cinema and wonderful visual storytelling from Chandor, who must now be considered the real deal, while Redford is sublime in what could well be the performance of his career."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "Chandor and Redford make an illuminating procedural of Our Man's response to calamity... Our Man is everyman, revealed by beautifully filmed and edited action without exposition."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "All Is Lost works quite brilliantly on its most basic narrative level."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "It’s an expertly paced thriller that never misses a note."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "Chandor’s attention to detail, and the expressiveness and utter believability with which Redford goes about the anything-but-mundane business of surviving, make All Is Lost a technically dazzling, emotionally absorbing, often unexpectedly beautiful experience."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "The pacing is perfect, and the action, mostly filmed in a studio, is never less than utterly believable. The director’s first feature, “Margin Call,” was full of rapid-fire dialogue, and he shows off considerable range by following it up with this film."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "The way that Redford’s character — who for all his namelessness and near-wordlessness emerges as a distinct character, a calm, pragmatic, curious man with a dry sense of humor — struggles with that ultimate question is the beating heart of All is Lost, which somewhere in its second hour goes from being a good movie to being a great one."
    },
    {
      "critic": "Ali Arikan",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "Here is a formidable opus whose real spiritual relative is Tennyson's \"Ulysses\". Yes. All is Lost is that good."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "All Is Lost, which is only Chandor's second film, reveals itself as remarkably skillful, surprisingly insightful and deeply moving. It's a confident work by an artist who knows himself and trusts his audience."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "The ancient Greeks believed that character should be revealed through action. I can’t think of another film that has upheld this notion so thoroughly and thrillingly. There is certainly no other actor who can command our attention — our empathy, our loyalty, our love — with such efficiency."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "It's a meditation on mortality, with remarkable resemblances to \"Gravity,\" not to mention echoes of \"The Old Man and the Sea.\" It's admirably crafted, with a wealth of detail that illustrates the sailor's resourcefulness."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "There is incredible tension in this ordeal, this effort to survive, to find rescue, and Redford - an icon of the American film experience for more than half a century now - makes that tension deeply palpable."
    },
    {
      "critic": "Mary Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "In this film, however, he battles the elements and mortality with a thinking man’s resilience the equal of any astronaut, freighter captain or free man enslaved. That he fights fate on his own makes All Is Lost a signal film achievement and the capstone to a great star’s career. This is Ultimate Redford."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "Redford will surely earn a well-deserved Oscar nomination for this role, to which he commits with unerring dedication. But the real star is writer/director Chandor, whose painstaking approach is exquisite in its spare integrity."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "All Is Lost is movie magic on many levels but most importantly as the rare opportunity to watch a seasoned actor at the pinnacle of his power."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "This is Robert Redford doing what too many stars should do and don't: taking a chance. And reinventing his art. It's an extraordinary thing to see."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "A genuine nail-biter, scrupulously made and fully involving, elemental in its simplicity."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 100,
      "summary": "Redford, already a giant, has never been more suggestive. His character’s misadventure — might be a kind of cosmic penance. It’s the salvation of the moviegoing year."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 91,
      "summary": "Arguably, the performance is too single-minded to achieve real greatness, but its utter lack of showmanship is precisely what the movie requires; at its best, All Is Lost could almost be a documentary about survival at sea, though it’s more starkly elemental than even nature documentaries usually get."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 91,
      "summary": "Chandor delivers pure cinema. Thrilling and adventuresome, this is a career highlight from the uniquely sympathetic Robert Redford."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 91,
      "summary": "The movie is an impressively realized work of minimalist storytelling that foregrounds Redford's physicality more than any other role in his celebrated career. His performance defines the movie to an almost shockingly experimental degree."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "It’s a classic tale of survival that draws on how movies, in the right hands, can make viewers see the world through others’ eyes, and to feel what keeps them grasping as it threatens to slip away."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "In his late seventies, Robert Redford has never held the camera as magnificently as he does in the survival-at-sea thriller All Is Lost."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 89,
      "summary": "Audience fortitude aside: This is compulsively watchable stuff, a masterstroke of thoughtful direction and thought-provoking performance."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "In this spare, unusual and intimate action thriller, Redford's expressions do nearly all of the communicating. He is the sole human cast member and utters only one word during the entire movie, which covers a span of eight days. The ocean — super-charged and becalmed — gets equal billing. If this sounds bizarre, or like an exercise in tedium, it is neither."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "Redford, who can play intelligence, wit and nuance to a camera like nobody's business, holds us in his grip. It's a master class in acting."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "This solo ordeal won’t be to every taste, but All Is Lost is a grand vehicle for the actor and for that viewer ready to consider his or her own mortality, the problems, conflicts, strengths and shortcomings you’re sure you leave behind when you just sail away."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 83,
      "summary": "If one buys into the whole grace under pressure thing, All Is Lost – the title is its own spoiler alert – is first-rate."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 83,
      "summary": "All Is Lost is a taut, superbly crafted addition to the survival story genre."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 80,
      "summary": "With no 3D, no friends and no hope, Redford and Chandor show how survivalist instincts can stoke thrilling, thoughtful cinema. If Gravity grabbed you, hop aboard and hold tight."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "All is Lost is as quiet as \"Margin Call\" was chatty; at a minimum, you might call this film a procedural. But like the best of the genre, its relentless focus on the material and the practical also gestures subtly at a life of the soul, however battered."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "Unimaginable as anything but a movie. It’s largely wordless, sombrely spectacular, vast and intimate at the same time, with a commitment to detailed physical reality that commands amazed attention for a tight hundred minutes."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 80,
      "summary": "A virtually wordless film that speaks with grave eloquence and simplicity about the human condition. Nothing here feels fancy or extraneous, least of all Redford’s superb performance."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "The presence of Robert Redford gives the character weight, if not depth, because we bring to the film everything we know about the actor from other movies. Redford’s characters have seemed unflappable for more than 40 years: sometimes cool, sometimes cocky, but almost always master of a situation. To see him beginning to flounder is to see a new Redford, one who catches us off guard."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 75,
      "summary": "This very male and methodical movie is like the anti-“Gravity,” as the un-moored hero is quietly in control of his options and at peace with his possible failure."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Ultimately, your nautical mileage may vary as to whether Chandor and Redford achieve the philosophical and emotional impact they intend, but in a movie that is a demonstration of the importance of trying, they definitely try."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "The film is unusual not so much because of its content - the man vs. nature story has always been a popular one, whether in print or on film - but in its restraint. Putting an actor, even an accomplished one such as Redford, alone on screen for more than 90 minutes is a risk."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "The film has a quietly relentless quality. Redford is fully engaged and vital. I'll leave it to others to read greatness into All Is Lost. It's enough that it's good."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "The film is still a gripping experience, though, with its circling sharks, its sun-dappled beauty and its agonies of shattered hope. At one point I was convinced that Sandra Bullock would splash down next to our man in her space capsule and Hanks’ Maersk ship from “Captain Phillips” would steam by to pick up both of them."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 70,
      "summary": "Redford, who can’t avoid exuding charisma, plays this role with utter naturalism and lack of histrionics or self-regard."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "J.C. Chandor creates an austere snapshot of human struggle, ingenuity, and perseverance, one that's predicated on Robert Redford's fantastic performance."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "It feels like a filmmaker’s exercise rather than an involving motion picture. Although you may never be bored with All Is Lost, you are rarely fully engaged."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The film’s scope is limited, but as far as it goes, All Is Lost is very good indeed: a neat idea, very nimbly executed."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Redford delivers a tour de force performance: holding the screen effortlessly with no acting support whatsoever."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 50,
      "summary": "All is Lost is more fun to think about than it is to actually watch: It’s a testament to a great actor, an experimental piece of cinema and a bit of a bore."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "In his late seventies Redford reminds us that despite his plethoric and undeniably lustrous acting career he can still shine brighter than ever, in a movie where not only he is the only actor but he has hardly any lines. The director J.C. Chandor on the other hand proves that his noteworthy first feature film ‘Margin Call’ was no fluke and has deservedly gained a place in my list of directors whose next project I will definitely watch.",
      "total_reactions": 2,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Robert Redford is way out in the Indian Ocean, when his sailboat is hit by a shipping container. That's only the beginning of his solo ordeal for survival. The gradual deterioration of his situation is detailed methodically, without dramatics, dialogue and with minimumal emotion (the opposite of Bullock's solo challenges in \"Gravity.). Still, the continued quiet persistence in the face of continued frustration is effective. It's not especially gripping, but involves in an objective, almost procedural way.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "There is little poetry or artistry to this film.  As someone else said, it's basically a procedural about dealing with sailing emergencies.  I really don't understand so many reviewers proclaiming \"the performance of a lifetime\" from Robert Redford.  I thought his acting was too often stiff, unrevealing and sometimes forced.  It was not terrible, just uninspired, but then, has he ever been a really great actor?  Or been in a really great movie?  I don't mean to be unkind to an earnest guy making his final movie.  You should probably see this so you know what everyone is talking about.  And then you can wonder who's reviews you should trust.",
      "total_reactions": 1,
      "user": "iTheViewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "With no dialogue, Redford still delivers a performance worth of an Oscar nomination. It is a tough film to get into, Really one of those you either love it or hate it films. I enjoyed it though",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "This is a movie i didn't know about until I was on a flight and watched it. Slowly, almost like torture, the situation gets worse and worse for this aging sailor on his own sail boat. The film does not have any dialog and no other characters, which says alot in itself as the film is long but not boring. As an experienced sailor, the character is able ot survive but not without several missteps and know-how to save himself. The tension builds as the situation gets worse and there is no dialog- you can really become just as frustrated and full of tension as you begin to sink with the ship.",
      "total_reactions": 1,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "It's not a bad movie, but All Is Lost is way too sparse to hold complete attention for its almost two hour running time.  It's very well shot and meticulously detailed in terms of how Redford comes up with clever ways to survive, but a lot of the time I was bored.  Don't get me wrong, there were a handful of tense or exciting scenes.  A couple of times the movie actually got to be pretty emotionally resonant.  I just haven't fallen in love with the idea of movies being as bare boned as possible.  This same story could have been told with a lot more excitement if flashbacks, or at least some more lines, were added.  It's all very convincing, but if you look at 127 Hours, or Life of Pi, you'll see how much more engaging this type of movie can be.  Redford did a decent job acting but it wasn't a very challenging role to play.  He just had to hold a serious face the whole time.  The movie's not terrible but I don't get why critics adore it so much.  A metascore of 87 is just way too high in my opinion.  Nice storm scene though.",
      "total_reactions": 1,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "In its simplest form, the film’s about Robert Redford on a boat for an hour and a half. It’s a well-made film, great visuals, and great acting. However the end result just makes it boring when it’s so easy to compare it to other films such as Cast Away and The Perfect Storm. There’s virtually no character development either, if you start the movie off by connecting with the character (fatherly or personally) you’ll enjoy it, if you think he’s a rich jerk with a boat then you can’t wait to see him fail, but this doesn’t matter because you’ll never know anything about him, other than that he knows how to sail quite well. I can respect it as an art film, but as a form of entertainment it feels hallow, stretched, boring (like being stuck out at sea, I get it). If you’re a Robert Redford fan (The Sting, Spy Games) you’ll find it okay, if you’re an artsy Robert Redford fan you’ll like it, if you like sailing it’s definitely entertaining, but if you’re looking for a movie night with some friends you might want to pass on it. Overall I feel the film is just too over rated because it has Redford, if it was anyone else I feel like it would be panned and above all just average.",
      "total_reactions": 1,
      "user": "BonPhire"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Sailors will find this movie ridiculous because Redford plays a character who obviously does not know how to sail or how to react in a sailing emergency.  As sailors, we spent the entire movie asking each other, why isn't Redford doing this or that (things a real sailor would know to do).  Thus, if you are a sailor, either view the movie as a tragic comedy of errors, or expect to be disappointed.  The ending is unclear, which is annoying.  This is the first time in a long time that I disagree to such an extent with the professional critics.",
      "total_reactions": 8,
      "user": "SineWave"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Spoiled for me  a former yachtsman) by lack of authenticity.   Use of sextant  impossible to find position that way.  Hole not at but above waterline -entirely different.  Such flimsy patching would not hold out in that sea.  Unseamanlike behaviour  not securing hatch properly not zipping up all panels properly not sailing to favour unholed side etc. This is not pedantic.  Tone of film demands total authenticity and belief in he sailor's  measures. Suspect all makers in awe of Robert Redford recreating Old Man and The Sea..  Thus sloppy",
      "total_reactions": 10,
      "user": "royston"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "As a sailor and boat owner, I thought this was a horrible movie.  Lazy director and poor script.  The boat was poorly maintained, the skipper (Redford) seemed incompetent or even suicidal.",
      "total_reactions": 12,
      "user": "edwkee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "ALL IS LOST is a survivalist film following one lonely \"our man\" who remains silent. The film blasts a punch with its combination of terror and beauty. The sea has never seemed more astounding and frightening. Redford is cast so well, it is impossible to imagination another actor in this role. ALL IS LOST,  through brilliant camera work and stellar music, reaches biblical proportions in its view of the frailty and strength of the human spirit, the will to survive, and the desire to end it all.",
      "total_reactions": 4,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "No, it's not an original concept, but it's very well-done and inspiring.  The movie begins with the accident that leads to the initial crisis  a stray, floating shipping container strikes the 20 foot Newport, blowing a hole in the side.  The rest of the movie is a methodical striving for survival.  Redford does a fine job, and the cinematography is phenomenal.  The music is also excellent.  It's a stripped down movie.  I wouldn't recommend seeing this movie the night after 12 Years a Slave (which is what I did...)  Tough viewing, but both very solid films.  Break them up with a nice comedy in the middle.",
      "total_reactions": 6,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "All is Lost is a predominantly realistic movie about a lone sailor's struggle to stay alive on the Indian Ocean across multiple days, and through very plausible moments of good and bad luck.  It is a far more unique foray into what a movie can do than most of us have seen in a long time.  It's an antidote to both fluffy sentimentality and heartless, mindless effects movies.",
      "total_reactions": 10,
      "user": "Mike_M"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "I havent sailed much but even to me this movie which solely portrays sailing emergency situation at sea seems as a string of completely mind boggling unbelievable events as if sailor is trying to kill himself instead of fighting for his life. Thus ruining this movie for me. The fact that there is no dialogue and there is just a single character on screen makes sure of that.",
      "total_reactions": 10,
      "user": "asdasd33a"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "I hate to be a spoilsport, but as a sailor I recognize how ridiculous this film is to watch. It's an excellent film to showcase how not to sail, how not to prepare and how not to even bother donning a life jacket one time in the film.  I can begin with how inaccurate all of the scenes are.",
      "total_reactions": 5,
      "user": "stusmalley"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "All is most certainly lost including 106 minutes of my life watching this turgid drama in which the waves are as crashing as the boredom. Robert Redford's one man show is unsurprisingly disappointing. For one character to hold centre stage for an entire movie is a tall order that rarely succeeds and that is definitely the case here.Set the scenario on a boat and you have double trouble. What we actually have here is one man pitting his wits against nature, in this case a succession of storms. We never really know what the Redford character is doing out there and the time frame presented as 8 days doesn't actually seem credible in what happens on screen. Critics will reach for there list of superlatives (and they have  yawn yawn) and praise Redford to the skies to be sure, but I find it hard to believe that the general audience member will warm to this monotonous indulgence.",
      "total_reactions": 22,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "All is Lost is in an interestin enough film. Almost no dialogue makes it very unique, and the premice of a lone sailor battling for his life agains the elements promises a bit of a thrill. Unfortuanltely, however, Robert Redford doesn't really seem to be acting at all, and the character he plays appears to be trying to kill himself. He certainly managed to kill the film for me, as he sat in a overturned life raft, his face sunburnt and cracked, with a hat sitting three feet away from him. Anyone who has any knowledge of sailing, the ocean or the world in general will find this a tragic comedy of error after error, with an unresolved ending.",
      "total_reactions": 9,
      "user": "Bruce1000"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "They could have put the camera on some random person's face and get the same \"performance\" Robert Redford gave. There was no acting involved. The movie is boring garbage. Nothing redeeming about it.",
      "total_reactions": 8,
      "user": "Trev29"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Watching a mute sailor roam around his sail boat for one half and then chill in his life boat for the second half... all the while speaking a grand total of 10 words (I didn't count, might be less)... was a complete bore. I found myself reaching for my tablet continuously to browse the internet while this epically slow film dragged on. If you need a good movie to sleep to, this is the perfect movie with endless sounds of the ocean.",
      "total_reactions": 6,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "I could not get into this movie as much as I wanted to.  The only good thing was that the music score was appropriate for this movie. It helped me sleep.  The music was just as slow as the movie.  The acting by Redford was non existent.  No acting what so ever. He just went thru the motions. Too bad.",
      "total_reactions": 6,
      "user": "sandywenko"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "When reviewing a movie, play, musical, cabaret act or anything that comes under the guise of 'art' I do my best to be kind but I am at a loss regarding the new Robert Redford film \"All Is Lost\". I have walked out on only one movie in the 70+ years I have been movie going and it took all I had not to walk out on this one.",
      "total_reactions": 4,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "As Our Man (Robert Redford) narrates the only monologue throughout a practically dialogue-free film, as the deck floods and the water begins to sink into the “Virginia Jean” in the opening scene, it becomes quite apparent that optimism is not in our best interest for All Is Lost.",
      "total_reactions": 4,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "The movie gets no points for originality as we have all seen survival films before, including \"Kon-Tiki\" from this past year, which was also set on a ship.  However, Redford is so good and the filmmaking is superb so I was riveted to the screen the entire time.  I think everyone can relate to the snowball effect of one bad thing happening after another and you can't catch a break.  The Redford character is relentless in his persistence to survive, and you can't help but root for him because he never gives up.  He keeps one step ahead of death due to his survivor skills.  Kudos to the filmmaking crew with all the close ups, underwater photography, and great ship/ocean noises making you feel like you're on the boat with him.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "As quest for survival movies go, this one is made exceptionally well due largely to Robert Redford's great acting. Moments in this movie are extremely tense; don't go if you're looking for relaxation. Of the two movies of this type recently, Gravity and All Is Lost, I prefer this one because it goes for realism rather than Hollywood style.",
      "total_reactions": 2,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "i'll give this film a 1 only because i liked the score. the movie itself was a crashing bore. except for the opening scene. give me tom hanks and wilson anyday over redford's craggy face as a stand-in for actual acting.",
      "total_reactions": 2,
      "user": "ariel84"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "I had just listened to the TED Radio Hour and the tale of Roz Savage rowing across the Atlantic before going to see All Is Lost.  It was a very interesting juxtaposition of the real and fiction.  All is Lost was riveting and Redford's performance, with almost no spoken words, was a triumph of acting with eyes and body.  You may quibble with details, but I never let them get in the way of my absorption into the movie and Redford's performance.",
      "total_reactions": 2,
      "user": "jdksteers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "One of the year's most exciting movies barely has a word of dialogue, and is a completely absorbing lost at sea adventure. It's easy to take Redford for granted here, and in hindsight, it's hard to imagine another actor pulling this off quite as well.",
      "total_reactions": 2,
      "user": "ambender"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This is an extraordinary and riveting film and deserves much more than nominations --and it has had far fewer than it should have --it deserves a win. For the screenplay, for the performance, for the sheer beauty of it. It felt like a book that you cannot put down, that you urgently want to know how it ends, that you don't want to end. I hope this film and Robert Redford's performance in it win at the Spirits. It has such spirit.",
      "total_reactions": 7,
      "user": "TheKiddy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "It's interesting to see Robert Redford's workmanlike performance here -- with little action, no dialogue, zero glamour. But his misadventures at sea would have benefited greatly from the presence of a big tiger or Louie Zamperini. OK, not fair to compare this to fiction (\"Life of Pi\"), but having read Louie's true story in \"Unbroken,\" I felt frustrated that Redford's character was not more resourceful as the mishaps unfolded. At the very beginning, we hear his \"message in a bottle\" soliloquy that provides little in the way of backstory. What's he \"sorry\" for? Defying family wishes by taking this trip? Something to do with his kids' mother? Letting someone dye his hair and leave the telltale white sideburns? Not a satisfying film.",
      "total_reactions": 3,
      "user": "Lyn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Redford should have been nominated for an Oscar, and in any other year would have been (2013 was so strong for film and especially male leads!)  I found it gripping despite the ambiguity and lack of dialogue because you can't help wondering about the steps he takes for survival and would you have done the same thing, etc.    Wished for a clearer ending but I guess they wanted us to discuss it.   Beautiful photography and music, great acting, great truth.",
      "total_reactions": 3,
      "user": "reba"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Hard to sit through this one--the cinematography was good, scenery even believability--except for his not talking at all--well, barely.  No one says he has to carry on a monologue with himself but, come on, I think anyone would be making some noise if they were being tossed about on a boat, literally upside-down at times.  That 20 minutes to the first word (after the actual beginning) was just breaking the ice, I thought, but then there was such a dry spell afterward that I almost left; it was actually tedious to sit through.  I like and admire Redford  both as an actor and a person, but this particular film did nothing for me except make me wonder how much longer it was going to last........",
      "total_reactions": 3,
      "user": "cinemaddict"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "ugh.",
      "total_reactions": 3,
      "user": "sailorBob"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "The basic interest of this movie is will the Robert Redford charactor \"Our Man  survive. There is an apparent answer. A boat with a light approaches his lifeboat and shines a light towards his submerged body. He swims to that light and a hand reaches underwater to rescue him. Being rescued isn't consistent with the title of the movie, \"All is Lost.\" There have been claims by people who have had near-death experiences that describe a calming light during those moments. A possible hallucination of a dying brain could be that reaching hand. Perhaps, the same thing can happen when the victim/patient succumbs. If that is what the ending portrayed, all was lost. For the theist and believer in an afterlife the hand could be symbolic of God's taking Our Man to heaven. In that case he would have died, but everything is gained. Lastly, the visual presentation at the end may be the Hollywood required happy ending.  Please click this comment as helpful if you think that it is hard to explain the title of the movie based on what you saw.",
      "total_reactions": 5,
      "user": "Cranksy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "All is Lost is a tense, isolating and emotional experience, about a man stranded on a boat in the middle of the Indian Ocean. As things go from bad to worse, one cannot help thinking, as when watching a film like Gravity as well, \"How would I feel, and react, in such a hopeless situation?\" But what all holds this together more than anything is the performance of Robert Redford, who is completely believable and does a remarkable job at showing his emotions without largely the use of dialog. As one who doesn't sail I didn't always understand what he was doing, but always I understood the purpose of what he was doing it for, so never felt too disengaged. It's a pace film, but patient viewers will find great reward in this harrowing tale.",
      "total_reactions": 1,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "This is a truly amazing film and I'm shocked it gets such a bad user score. The user scores on Metacritic are usually very reliable. The mood, the acting, the alternating sense you get of hope and hopelessness, just make the film riveting for me. It's a pure action spectacle so I fail to see how anyone could have found it dull. Some of the shots are simply breathtaking too. Robert Redford is now a new hero of mine.",
      "total_reactions": 2,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "One of the slowest movies I have ever watched. I would say that if you know not to expect an action packed experience going into this then you would be fine, but even as someone who knew not to expect that I found myself caught off guard by how boring this film ended up being. For the majority of the film, rather than watching Robert Redford fight for survival, we watch him go through menial tasks. There are some interesting scenes here and there, but overall the film seems to just drag on. I wouldn't call what Redford does here acting, as his character very rarely shows any emotion or speaks at all. It's not bad, but instead a rather dull and boring film. I don't recommend it unless you are just a survival fanatic.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "it will generally require a herculean effort on the parts of both the director & the single actor/actress to carry a single character story in such a manner as to keep an audience entertained & captivated.  unfortunately, this film does neither.  with zero background provided, we really have no reason, other than basic human decency, to cheer him on in his struggle for survival.  one wonders, for example, what possible purpose and or planning went into this misguided, catastrophe laiden misadventure.  presented in a vacuum, as it is, it comes & goes without generating much impact, and i found Redfords performance solid, but hardly spellbinding.  unless you're a fan of his, i'd skip this one.",
      "total_reactions": 1,
      "user": "MeanJoeGreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "There is nothing to it. With less words than any movie I have ever seen, Redford needed to do some extraordinary acting to give some poetry or artistry to the film. Unfortunately, the movie becomes a standard survival film.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Wow, what a waste of time.I have watched movies with similar circumstances, but they were much more original.The only things original about All Is Lost are the things that lead to frustration.Are you kidding me two ships pass by him, and don`t see him? Are you kidding me he set the life boat on fire? lol Are you kidding me he just gave up, and let him self go into the Ocean? lol That was pretty dumb of him to put fire on the life boat, and then just quit. The main character is a man of few words, and when he finally says his first word half way through the movie you find out his mouth needs to be washed with soap.I hated how the movie ended. You don`t even see the guy/people who rescued him, just a hand.",
      "total_reactions": 4,
      "user": "oblique15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "Truly one of the worst movies I have ever seen! So so boring! Which is a complete shame because this movie had so much going for it! In the end, the only thing that was lost is what could have been a great film!",
      "total_reactions": 1,
      "user": "chrisjones914"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "All is lost, including an hour of my life spent watching the first half of this film. Redford is like a monk, not saying a single word. When the frustration finally gets to him, he screams out one word. Given the depravity of Hollywood you can guess what that word was. The second half was barely watchable, no dialogue. See Captain Phillips instead",
      "total_reactions": 1,
      "user": "Hum"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "There were a number of problems for me in this movie. First, although Our Man seems to be a fairly seasoned sailor, and has most of the right equipment on the boat, he failed to immediately turn on the bilge pump when he first saw water pouring in through the damaged hull. That would be one of the first things an experienced sailor would think of in that situation. If he had started to pump immediately, he might have saved his electrical system, including the batteries, depending of course on how good or large-capacity the electric bilge pump was. Second, an immediate emergency repair of the hull would have been in order. There is a technique of wrapping a sail around the hull as a temporary measure to keep the water from pouring in, and many cruising sailboats carry pieces of waterproof fabric (such as sailcloth), and ways to attach them to the hull, to make immediate emergency repairs.",
      "total_reactions": 1,
      "user": "seadaawg"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "A One was probably too generous.  I can't believe anyone liked it.  There are perhaps 20 seconds of dialogue in the entire movie.  You just watch Redford stumble around making mistake after mistake on his boat.  It is boring.  It is a complete yawner and you really don't care in the end if he lives or dies.",
      "total_reactions": 2,
      "user": "minaflewis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "It is obvious Redford has never been on a boat or he would never allowed himself to be shown as an idiot.  Love to know if there were any technical advisors, probably from NASCAR.  Thinking of allowing water in thru a hole or open hatch is OK?  Love the part of shaving as a storm is approaching rather than putting up a storm jib. Never trimmed his sails at all, always luffing.  There was so many stupid acts, the whole movie was aggravating.  BTW I'm a sailor",
      "total_reactions": 1,
      "user": "dosboat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "in the ending robert redford tries to drown himself then someone helps him  thats a dumb plan to do and guess what he catches his raft on fire thats a  idoiotic  move . i was really looking forward to see this .",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "If you are a sailor, you will likely spend the majority of your time watching this movie scratching your head, as Redford's character makes some truly mind boggling decisions, like stopping to shave while being faced with an oncoming storm instead of putting up his storm jib BEFORE the storm arrives.",
      "total_reactions": 1,
      "user": "jmshaver"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "although i regard robert redford as a great actor this was a surprisingly poor performance. predictable and formulaic  it was obviously  shot mostly in the studio. i couldn't engage with the sailor at all . he was so stupid in everything he did that i wanted him to die out of pure frustration and boredom. not his ,mine.",
      "total_reactions": 2,
      "user": "gregwatts"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "This movie is a case wherein \"user reviews\" are more valuable than critic reviews, insofar as at least some users are actually sailors. Obviously neither the director the the star have ever done any serious blue-water sailing, or they would not have made such an idiotic movie arguably about sailing. The \"mistakes\" are not trivial. They are stupendous. Akin to driving a car across America on the wrong side of the road and hoping no one hits you. This is not a spoiler alert, except to say that it boggles the mind that no one involved in a movie about sailing that sacrifices three sailboats knew anything about sailing in blue water. There are actually sailing chat groups devoted to enumerating just the most egregious mistakes this feckless idiot makes in the process of his \"sojourn.\" 81 at last count. Actual sailors promised not to go to a theatre and ruin the movie for others by falling on the floor laughing.",
      "total_reactions": 1,
      "user": "RichardGonci"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Watched the movie and was disappointed that the man, Robert Redford, was not really a sailor. Cannot imagine what he was doing so far away from a shore or land. He had no access to a life jacket, he didn't put the harness on until too late, his liferaft was kept in the V-berth when it should have been strapped on deck, had no EPIRB and he had no idea how to use a radio. He struggled to put on a storm jib which should have been easily accessible too since he saw the storm coming. I did like the way the boat was patched and he did try to get noticed by the containers, but as most sailors know, there is no one on the bridge of the containers and no one wandering around their decks at night.  His flares left a lot to be desired but I cannot blame him for trying to light a fire on the life raft except it caught the whole thing alight.  That was too bad.  I do know that there wasn't any hand at the end and that he died or drowned.  The photography was great and I was sad to see the boat sink.  Robert Redford should have checked up on sailing rules before doing the movie or was he just too complacent to bother.  Most lone sailors are much better prepared than he.  Sorry about the negatives but???",
      "total_reactions": 1,
      "user": "Warrior110"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "This terribly inaccurate film showed a complete lack of any knowledge of seamanship by all those who contributed to its making. I would only recommend it to any sailors who want to get a good laugh out of the terribly implausible mistakes of a lone sailor (Robert Redford) who appears to have spent his first time on a boat out on the Indian Ocean. From flimsily repairing a gaping hole in his hull to sending his life raft up in flames by attempting to start a signal fire in his plastic container, the movie was chalk full of ridiculous decisions. Redford seemed to stare at every difficulty for a good 5 minutes just to make yet another poor decision. Was he trying to kill himself? If I ever teach a sailing school class this would be a wonderful example of everything not to do at see. Hope this was helpful.",
      "total_reactions": 1,
      "user": "ilmdcas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "I'm surprised at the number of positive reviews that this film received. It has a weird un-cinematic atmosphere; like someone filming your uncle on a good digital camcorder pootling around on his yacht. There's a lack of tension, despite lots of bad things happening to the protagonist. And the ending is utterly risible. I mean, I was disgusted at the lack of realism and the blatant fudging to get a saccharine happy ending.",
      "total_reactions": 1,
      "user": "LeoKearse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "A thrilling, edge-of-your-seat ride to the bottom of the ocean pleases with its delicate sparsity. A fresh take on survival, All Is Lost is let down by its glaring lack of realistic emotion and contemplation.",
      "total_reactions": 0,
      "user": "Edwin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "There is only one character is this movie played by Robert Redford. He is all by himself on a boot in the Indian Ocean. The whole movie is about his fight for life.",
      "total_reactions": 0,
      "user": "netflic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "This film was unable to sustain my interest for a number of reasons. The opening prologue provided no tangible information. As a starter, it would have been helpful to know to something about this voyage. Family difficulties? Feeling guilty about past acts? but none of this was forthcoming. Also, more information should have been provided about where exactly he was (like a map) and where he was heading. Being someone unfamiliar with boats, it would have helped sustain my interest to know more about what he was doing after the storm hit. Frankly, being 1 hour and 45 minutes of a solitary sailor with no dialog, this film just lost it for me half way through. I still do not understand what the critics saw in this movie to give it high ratings. It seems like a self indulgent fantasy by Mr. Redford. And lastly, what kind of a crazy person 80 years old (or so) goes out in sailboat on the ocean by himself?",
      "total_reactions": 0,
      "user": "whitewind"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "We are right there with him in the wide, overwhelming seascape. Robert Redford gives one of his career's best and J.C. Chandor proves once more his place in quality film today.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "All around, All Is Lost is pretty good. J.C. Chandor continues to show himself to be a director to watch as both this and \"Margin Call\" show he has a knack for making great, actor driven, fims. Robert Redford is brilliant here, even if he barely speaks. The lack of dialogue is not even noticeable, as the film barely misses it, if at all. The film has no problems communicating all of the problems facing our protagonist and does so very effectively, as there is a ton of tension in a film that Netflix describes as \"harrowing\", which is truly a great way to describe it. The cinematography here is gorgeous and, in particular, the shots from underneath the water are breathtakingly beautiful. As a whole, this one is a triumph for cinema and stands as an example that you do not need much to make a good film. Now, this one can be slow at times, so it will not appeal to everyone, but I personally enjoyed it a lot.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Director J.C. Chandor follows up 2011's Wall Street drama \"Margin Call\" with a superbly shot \"All Is Lost,\" a near-silent survival procedural that creates an austere snapshot of human struggle, ingenuity, and perseverance. The film is a testament to the endurance of the human spirit when facing insurmountable odds, while employing only a few lines of dialogue to set the movie's tone.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "When I saw 'The Company You Keep' I said why would he take risks at this age. He took even riskier job in this movie. I heard that he also lost his hearing during filmmaking for this. Robert Redford, the hardworking man at 77. Don't think he's the only one but Bruce Willis, Stallone and Schwarzenegger doing the same. They are capable but this man put lots of effort to give his best.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "These are usually not my type of films a movie with no back story and no dialogue, but Robert Redford makes this film worth watching.  Like Gravity this film is really about the performances of its actors and for either in the wrong hands both would fail. Thankfully both succeed. A-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Taking some bold notes from Hemmingway’s ‘The Old Man and the Sea’, JC Chandor tells a story of a lone sailor’s strife to survive after being stranded at sea due to a series of worsening events. With little to no dialogue, ‘All is Lost’ is filled with subtext and relies on Robert Redford tremendous talents to hold the screen alone. Redford’s unnamed character (titled ‘Our Man’ in the credits), is an ambiguous figure with literally no back-story; but that made him all the more intriguing. There was no scenery chewing in the performance, just plain stoicism as his character steers peril in the eye… all truly felt lost. Chandor is no stranger to the dynamics of the 2008 financial crisis, and it’s very possible that some of these issues are layered between the fine lines of this story. With an abandoned shipping container being the initial cause of Our Man’s high seas accident, one could relate that to the irresponsibility of big corporations and the negative effects it has on the people. However, as you would expect from this metaphorical movie; it’s all up to each viewer’s interpretation. I applaud the rigorous efforts placed in producing this film, but for some reason I thought it was a tough film to fully connect to. It may be due to its stark minimalism or maybe the subtle emotional payoff. In any case, it was one of the year’s most ambitious movies, and I encourage anybody up for a challenge to give it a try.",
      "total_reactions": 0,
      "user": "Prodigy2013"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "This is an entry into the \"white people doing things they probably shouldn't\" genre.  You know, like getting involved in 3rd-world coups, climbing mountains and trying to be friends with grizzly bears.  Then everything goes wrong and it's time to make an inspiring film, instead of highlighting the colossal stupidity that put them in the situation in the first place.  This one features a guy in his 70s sailing alone in the Indian Ocean.  It does a fairly good job keeping your interest but the last 45 minutes get tedious and cliche, with the predictable \"almost\" rescue and the \"all hope is lost\" scene.  Redford has almost no dialog (doesn't even talk to himself). Likewise, there are no other actors in the film. Critics love these \"actor's studio\"  gimmicks and they explain about 20 points of the meta-score.  Bottom line, if you shop at Whole Foods, were ever a fan of Coldplay and have a Thule rack on your car, you will probably be inspired by this film.",
      "total_reactions": 0,
      "user": "jcasetnl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Not a film for lovers of fast paced action yarns, \"All is Lost\" is a reflective survival story in which a single man (Redford) awakes on his boat to find himself alone and sinking. With virtually no dialogue, this is a film of thought and the simple need to rely upon the human instinct for survival.",
      "total_reactions": 0,
      "user": "manofthemoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I have owned All Is Lost for some time now i just never got around to watching it that's a shame because i knew the film was good but damn i didn't know it was going to be a contender for my favorite Robert Redford movie. The fact that Robert Redford says less then 10 words through out the whole film is amazing i think its not till like the 22 minute mark till we hear him finally say something. The plot is simple but masterful some would find this type of film boring but not me i have actually stayed out on a boat for two weeks when i was younger and i had a blast. The film opens up with Robert Redford waking up to little spurts of water coming into his boat he gets up to see that he had clipped the edge of a container full of shoes that had fallen off a cargo ship. Well he ends up fixing the hole in his ship and life goes on as before but soon a huge storm hits and while fixing things around inside his boat a big wave hits his boat causing him to hit his head on a steel post that knocks him out. He then wakes up to water up to his thighs so he gets out a life raft and starts to gather some food and other things and he gets inside is life raft that is being pulled behind the boat. From here we watch Robert Redford try to survive in the open water as he tries to make his way to the Sumatra Straits in hope that he ends up being saved.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Another film about the human spirit’s ability to persevere we do not need, yet here we are again.",
      "total_reactions": 0,
      "user": "theseparator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Although it can't reach the cinematic heights like \"normal\" movies, this experimental film All is Lost is better than you might think. Even though its premise is basic, it still managed to hold my attention for all its 106 minute runtime. Redford shows off his acting chops here, and gives at least a little bit of insight into his character. Overall, the film is worth watching, especially if you like out-of-the-norm movies like this.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "A similar picture by Aleksandr Sokurov, Mother and Son, is an example of another brilliant film that uses action instead of dialogue, as well as time to tell its story. But to give this film an unusually low score would be the result of a lack of film literacy. I'd caution those who hated All Is Lost to avoid films by Andrei Tarkovsky and Satyajit Ray, too.",
      "total_reactions": 0,
      "user": "ShelbyMcShelby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "\"All is Lost\" will likely come across in different ways to different individuals. The movie-going public has a detached concept of the situation that Robert Redford's protagonist faces  think TV hit \"Survivor\", where a tough day involves performing stunts brainstormed by the show's staff who are camped on the other side of the island and the big downside is getting blackballed by backbiting co-contestants.",
      "total_reactions": 0,
      "user": "Dogbone49"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Good drama, but irritating if you know anything about sailing.  1) Emergency beacons are cheap and small and waterproof.  Anyone with any sense would have at least one on board. 2) What is the fool doing in the cabin during a storm?  He should be at the Helm.  3) Why did he spread that sail over the bow of his boat?  So what if some water was leaking in.  He could just pump it out (that is why the hand pump is next to the helm) 4) Why did he try to send an SOS early in the movie when his boat at that point was in good condition? I could go on but you get the point.  Redford makes up for the technical details though.  Very good acting.",
      "total_reactions": 0,
      "user": "mendozaAnthony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "An amazing and heart warming movie. There is only one character in the movie and still the producers are still able to get to grab the viewer. It was able to get a range of emotions out of me. It shows how strong the unnamed man is and his will to keep alive. Bravo! A great film!",
      "total_reactions": 0,
      "user": "arvintaylor138"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "BAD FILM..Professional well crafted film with too many ERRORS!!!. (Good metaphorically speaking). Firstly ..Who is this guy? Where does he come from? If you know sailing you will know that this guy does almost everything wrong as a sailor. So I assume he is an armature, in which case he is an idiot (really...... No life jacket, no mandatory PFD? really…?) Because of the obvious metaphorical caliber and cinematography of the film I will give the benefit of the doubt and assume that all the dumb choices he make are to in fact make a point.",
      "total_reactions": 0,
      "user": "fatcox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "After watching i have trouble to describe my feelings. Mostly it is annoyance.",
      "total_reactions": 0,
      "user": "TripleZero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "All is Lost es una película que aunque no llega a desarrollarse de una manera potente, posee un atractivo sutancial y bien definido.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "There are no other actors, no other locations, no other dialogue. All we get is just one guy, one sea, one story. This is the kind of film that needs to be made more often. Everything about it is powerful.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "All is Lost is the movie that the Academy Award basically forgot this year.  The seemingly hopeless undertaking of an older man’s fight for survival through unrelentingly dire circumstances after his boat’s hull collides with an abandoned shipping container at sea.",
      "total_reactions": 0,
      "user": "ArchonMagazine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "\"All Is Lost\" 10 Scale Rating: 7.0 (Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "There is a hefty sense of dread that you share with Redford's lead. What's really immersive about this film is that it relies on the situation to build tension and atmosphere. In this respect, it succeeds greatly. Although there are only extremely mysterious glimpses into the reason the protagonist finds himself in this environment, the shared hopelessness with character and audience makes up for the lack of nuance.",
      "total_reactions": 0,
      "user": "georgebillym"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "If you like grisly wrinkled faces looking concerned, this is probably the movie for you. Don't expect any dialogue. Don't expect musical cues to let you know how concerned you need to be. All you have is stark realism that at times does become monotonous. Robert Redford has a lot of acting chops, and he does a tremendous job in this movie. Too many actors would have tried to over sell it. I'm not really sure how a human being would act in the situation, but I imagine he nailed it. Great movie, but definitely not for everyone.",
      "total_reactions": 0,
      "user": "kriebelr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "'All is lost' starts with the apology of a man (Robert Redford) who admits he has tried - to be true, to be strong, to be right, to love - but failed. He fought till the end, he says. The movie shows his struggle. Man versus nature. We see a man who probably didn't care much about others during his life. He lived the life he wanted to live, he wrote the rules. Now we see him in a situation where he has to bow for his superior. He is being played with. Redford proves he still got it. His performance is down to the bone, and at the same time he refuses to give in to sentimentality. A must see.",
      "total_reactions": 0,
      "user": "ruben_13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Don't like Redford but I have got myself into watching everything that was released in this year with a green dot. Yeah bite me, I can never figure out what to watch.",
      "total_reactions": 0,
      "user": "rebelmswar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2017
      },
      "score": 9,
      "text": "Very few actors can succeed on carrying a whole move over their shoulders for almost two hours. Robert Redford not only delivers a superb character performance, but also involves us in the whole premise of the movie: the indifference nature has towards human life; and how it takes only one man to make us aware of what really makes our life worth about.",
      "total_reactions": 0,
      "user": "pardogato"
    }
  ]
}