{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 21,
  "mc_movie_name": "All Good Things",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 65,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The key to the film is in the character of David. One can imagine a scenario in which an overbearing father drives the son to rebellion, but what happens here is more complex and sinister."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "It's a juicy story, though that doesn't excuse Jarecki from fixating above all else on the tabloid-ready twists and pop-psychological turns of Durst's story."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Jarecki's not remotely in Scorsese's league yet, but he knows New York and he has seen the dark soul of man. Maybe next time he won't blink."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "All Good Things is a \"true crime\" drama with speculative scenarios and a kind of deliberately murky aura. It's a strange, thrilling tale begrimed by bad memories, by bad deeds."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "You go away slack-jawed with shock and sated with the chilling bedtime-story elements of a great unsolved mystery novel you can't put down."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Though the movie doesn't use real names and the press notes say it's \"inspired\" by the Durst case, it seems to follow many of the facts rather closely -- all the while mixing in not a little provocative speculation."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "It's not the smoothest thriller. But All Good Things is thoroughly engrossing, a roman a clef that chillingly ponders a puzzle and suggests solutions outlandish enough to be stranger than anything Hollywood, on its own, could make up."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "The result is a potent and provocative movie that will keep you up nights."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "The movie implies that Durst murdered his wife, but the unsolved crime turns out to be less mysterious than the mind of the killer, nervily portrayed by Gosling as not evil but unaccountably empty."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "The film ends up wrestling itself into a corner, though it's saved by a corrosive central performance from Ryan Gosling and a disconcertingly hypnotic feel."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Despite some choppy transitions and a few melodramatic moments that don't work, the film casts an effective, deepening chill."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Certainly the fictionalized brood in All Good Things is equal to the Friedmans in terms of dysfunction, and they're loaded."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 67,
      "summary": "It's a heavy, moody film, mimicking in its form something of the mental state of its central character, which is a nifty trick.  But the quality of the craft doesn't draw you in, nor does Gosling's aloof and inward performance."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "All Good Things is creepy and weird and sad, and little else."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "The film, although deeply flawed, is at times compelling, even if it seems as if a reel is missing."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "The film presents the rare instance of a true story that has been fictionalized and yet seems bent on cleaving to its least useful facts."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 58,
      "summary": "Here's a story about a man who befriended and eventually killed a Texan while going incognito as an exceptionally frumpy woman, then was eventually nabbed shoplifting a chicken-salad sandwich while carrying more than $500 in his pocket. Why underplay that?"
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "You watch it in stunned disbelief, wondering how a movie that started so strongly devolved into something so absurd."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Gosling, as the Durst-like David Marks, is scarily effective before his performance turns opaque and horror-movie-ish."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "There's a fascinating story here for a bolder filmmaker, but after so much meandering it's a relief that \"All Good Things\" must come to an end."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Dunst is not the only person doing quality work in All Good Things, but she is the only one worth watching."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The good thing about All Good Things - that would be Kirsten Dunst, for if there is one thing this strange and creepy film does well it is remind us of just what a talented actress she is."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "This is a soap opera that stands at a distance from its characters (that distance being the length of a lawyer's briefcase) and, though handsome and capable, feels as inert as mannequins in a shop window."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 42,
      "summary": "What's most surprising, given the latitude provided by all that conjecture, is that the Durst - \"David Marks\" for the purposes of the film - who emerges is less a character study than a thumbnail sketch."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "The more the film implicates David, the more it distances itself and the viewer, playing out in the emotionally detached but sensationalistic, overripe manner of a tabloid freakshow."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "All Good Things patina of fictionalization has not prevented the cagey Durst Organization from threatening a lawsuit. They need not worry, though. The film succeeds only in indicting its authors."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "The result is a queasy combination of speculation and dramatic invention with the ring of half-truth, though the co-stars, Ryan Gosling and Kirsten Dunst, add as much color as they can - not much - to a monochromatic script."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "One of the strangest movies I've ever seen, and not in a really good way. By the end, it had me wondering how much of the story was actually \"based on a true story\" and what the real sources were.  The trailer is deceptive as hell.  The Gosling character is a true freak, and I'm not sure that I'd ever recommend the experience to anyone.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "\"All good things\" is a brilliant absorbing and ultimately provocative drama thriller with a good direction and amazing performances by the three leading actors.It reminded in a way \"Revolutionary Road\" because we have the portrait of the desire of a perfect existence and the subsequent broken dreams of a couple. But in \"All good things\" not every reasons are explained because the director is telling a real story(the names of the characters in the movie were changed)that is still a mystery and the leading actor of this drama is an enigma. David Marks(Ryan Gosling)son of a powerful real estate man(Frank Langella)tries to establish a perfect and peaceful life with his wife Kathie(Kirsten Dunst)by avoiding his duties in the family business(legal and illegal).But it won't be easy for him to resist at the pressure by his strong father and he will be forced to take part of the ominous projects of his persuasive father.Besides,his increasing psychological problems will destroy his life with his wife.The second part of the movie is a shocking and bizarre look at the last years of the disturbed man and the homicides of his two friends.And the movie becomes a sort of \"Psycho\". What we see is the results of murder investigations. I liked the mixture of themes such love,corruption,madness,mystery and murder and Andrew Jarecki did very well in showing the growth and reasons of the characters,although David remains an enigma in many of his actions.I really liked the details he offered and I was drawn from the beginning to the end.The movie is predictable in some parts but in the last one is a real unexpected turn.Ryan Gosling was great in playing a troubled man and I was moved by the portrayal of this poor soul that had no chance to live in peace with himself.Also he shows some sinister sign of madness that are really overwhelming. Kirsten Dunst was simply terrific in portraying a victim of the husband and his powerful family but also an ambitious woman who tried to get advantages by the the whole situation in terms of the prospect of a wealthy life.For her amazing acting she should have been nominated for an Oscar.Frank Langella was really good in the role of the cold and manipulative father.The three characters are really complex and not easily categorized.\"All good things\"is probably one of the most appealing and interesting movie of the year.It has real great and original moments and although it doesn't provide an easy solution to the case it is not a distracting thing in my opinion(since it's still an open case).",
      "total_reactions": 1,
      "user": "francesco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "A giant mess of a film. Ryan Gosling and (a surprisingly tolerable) Kirsten Dunst do the best they can with a story that can't decide what genre it belongs in. This simply just doesn't work. Andrew Jarecki, whose \"Capturing the Friedmans\" was fascinating, can do better than this.",
      "total_reactions": 3,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I went into this movie knowing absolutely nothing about it, which unfortunately hasn't fared me to well in the past, this however was a pleasant if not creepily strange surprise!! Not once while sitting through this did my attention drift off, I was glued to the tension and incredible atmosphere. Once finished and the creepiness had subsided, the faults with the story began to surface and thats where the problem lies!! The Story is fragmented and skips from decade to decade with no regard for the time between. The story says based on actual events and 'intense' research, but feels speculative and contrived. The acting however is brilliant and the direction, if patchy is slick and attention grabbing. This movie is a bit half and half, but I feel that for a movie with such big faults to hold my attention for so long and honestly make me think, deserves a little more than a pass!!",
      "total_reactions": 1,
      "user": "Sausage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This Movie Rocks! Kirsten Dunst is so good.As is Ryan Gosling.They both act good together and do thier parts good. Who cares what it's Metacritic score is that means nothing judge for yorself.I'll give it a 95!!!!!!!!!!!",
      "total_reactions": 1,
      "user": "ACE103"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "There are notable performances in this film with the most significant being that of Kirsten Dunst, but unfortunately they are not enough to make this mystery murder film a captivating one.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Another attempt to crack the Durst mystery, and with added fictional guesses as to what might have happened. This one is stranger than fiction and the fact that Durst still trots around free with Daddy's millions has to gall all those who value justice. The story really needs a four part series. We never get to see the detective work done and why Durst walked away from his wife's (presumed) murder. We never see much of the trial for the murder of his lodger and have to wonder if folks in Galveston are rubes. Gosling is good as Durst, who was diagnosed as having Asperger's but seems way more competent than that. Frank Langella gets to do his customary \"heavy\" role as Durst Sr. In the end it;s such a mish mash of fact and supposition that I was left irritated by the conceit of the Director's presumptions",
      "total_reactions": 0,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "All Good Things is an interesting movie with some structural and pacing issues. The performances are good and the overall tale would beggar belief if it wasn't a true story. Still... Decent but not great.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "From the opening strains of Steely Dan's \"Daddy don't live in that New York City no more,\" I had a bad feeling about \"All Good Things.\"",
      "total_reactions": 0,
      "user": "QRITQ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I'll be trite here because the film is well, good. I kept wanting more, and I couldn't help feel like the story, true or not, and its characters were too heavy for the director's hands. Jarecki did \"Capturing the Friedmans,\" which was more than just good, so I was slightly disappointed in some of his decisions. Luckily, Gosling and Dunst do impressive grunt work for him and land up saving the film from a straight-to-video death. Bottom line is \"All Good Things\" is one of those films that prove great actors need great directors to make great films (look no further than \"Blue Valentine\"). One without the other and you just get, well...good.",
      "total_reactions": 0,
      "user": "DKay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "The title is a little silly when you find out what it means , and in reality, the movie is a bit silly when you watch it. If it were not for Dunst, the movie would have ended up being a good movie on cable.  Dunst is wasted in this movie and her sole role is to look innocent and is devoid of any character at all. Still, the movie keeps you in suspense ( somewhat ) but is quickly forgotten about afterwards.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "This looks like it should be an entertaining movie, but isn't.  Strong cast, Ryan Gosling, Kirsten Dunst, Frank Langella, and Philip Baker Hall are all among my favorites.  But good actors cannot always overcome a lousy script and that's the problem here.",
      "total_reactions": 0,
      "user": "NoahCoward"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "In the hands of a different director this might have been a better movie, but in the hands of Andrew Jarecki it doesn't quite make it. Ryan Gosling's deadpan performance was annoying and the film doesn't clearly give a motive for David killing Katie other than he's nuts. There must be something better to watch, folks.",
      "total_reactions": 0,
      "user": "jgzeger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Amidst strong characters and a fascinating premise, All Good Things hits several strong notes. Unfortunately, Kirsten Dunst gives a less than average performance, despite Ryan Gosling's fine performance.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "All Good Things offers a recreation of real-life events in addition to providing a bit of dramatic speculation on how things really went down. Director Andrew Jarecki brought in 2003 an Oscar-nominated documentary 'Capturing the Friedmans' and now makes the jump from the experience of this documentary to this movie.",
      "total_reactions": 0,
      "user": "Cream8n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "On a level of 1 to **** this is pretty damn ****. Unrealistic, poorly \"based on a true story\" and seriously Ryan Gosling dressed up as a woman? Yeah that was sooooo convincing.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "I am surprised to see the negative critical reaction to All Good Things. Incredibly ambiguous (because it has to be), All Good Things is a captivating mystery and crime film that is a really compelling character study, as much as it is a compelling crime tale. Ryan Gosling and Kirsten Dunst are both phenomenal here and Gosling's cold, calculated performance most certainly feeds into the ambiguity of the film as a whole and the film benefits from it. The direction and pacing are solid, but my main drawback here is the flashback storytelling that comes and goes. I think it was an interesting approach, but I am mixed on how effective it truly was. That being said, All Good Things is not a great film, but it is a well made, well acted film that really gets your mind turning trying to figure out what really happened.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "All Good Things isn't a pleasurable film to experience, but it offers an uncanny evocation of a narcissistic sociopath who doesn't come at us with the charm and sophistication that the typical screen bad guy has. The end result is intriguing, with a dash of a love story and a twisty. Good, but had an unsatisfying ending.",
      "total_reactions": 0,
      "user": "Berry-Tan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Ryan Gosling est un acteur que j'apprécie, pas un très bon acteur loin de là mais bien dirigé et dans certains rôles sombres ou atypiques, il fait le boulot comme ici dans cette incarnation d'u gars un peu dérangé du ciboulot. Kirsten Dunst par contre est mauvaise en tout, partout et supporte mal le poids des ans, ce qui lui enlève le rare intérêt qu'on aurait pu lui trouver. Son joli minois est marqué par ailleurs par l'abus d'alcool et autres substances psychotropes plus ou moins licites. La voir se traîner comme une limace pendant tout le film est très démoralisant.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}