{
  "mc_avg_user_score": 4.1,
  "mc_metascore": 17,
  "mc_mixed_rating_frequency": 21,
  "mc_movie_name": "All About Steve",
  "mc_negative_rating_frequency": 62,
  "mc_positive_rating_frequency": 34,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "i have to say i liked it and i recomend it, she is crazy and i got it i guss she won the award for the worst actress but i think everyone is crasy to say that,  liked it and my girlfirend did to",
      "total_reactions": 1,
      "user": "mau1133"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "I've seen a lot of movies in my time and I guess I tend to favour a good comedy, hey, I love the odd bad comedy, but this is neither, this is the movie equivalent of being bled out, I would rather swim in a pool of razor blades than watch this poor attempt at comedy again, truly terrible stuff",
      "total_reactions": 1,
      "user": "buffmysequel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Totalmente ridicula y quedada es una fusion de buenos actores sin un buen papel falta de humor, de tema y decadencia en l trayectoria tal vez la idea pude haberse ampliado mucho mas pero no dio a lo que buscaba.",
      "total_reactions": 1,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "A disgrace to movies everywhere. I thought the Blind Side was bad. Geez, this is pathetic on every level. It is a sad time in the film industry when this gets produced.",
      "total_reactions": 2,
      "user": "MovieMan12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "It really wasn't that bad. I don't quite understand all of the hate. It wasn't all that funny, but it wasn't a \"Gigantic piece of donkey **** or \"the most pathetic attempt at humor i have ever seen\" or even \"sewerific\". I could sit through it, and it was kind of fun.",
      "total_reactions": 0,
      "user": "Dillin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Ouch. This film hurts. Instead of giving the main character appraisals, she is mocked into being insane and moronic. So many plot holes, bad casting and a completely and utterly creepy and disturbing tone. Avoid. Now.",
      "total_reactions": 0,
      "user": "muzziklover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "What we end up with here is a perplexing situation: The film makes Bullock's character so out-of-touch and so socially awkward that it goes from charmingly quirky to frightening and pitiful. We can't identify with the character because a normal person would react in same way Cooper does, and thus we end up pitying her instead. We also can't laugh at her when the movie tells us to because that makes us feel cruel for laughing at someone so pitiful. This is an awful, awful movie.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "I don't know where to start. I'm not sure what I just watched but I know I don't like the way I feel nor exactly how to describe it. A little disturbed perhaps....... discombobulated even (I've been wanting to use that for ages). Such a weird movie, I want to remove the memory of it from my brain and I never want to see red boots again. Although with the sound down she looked amazing in them. It's driven me to write this, my first review ever because of the profoundly diminishing effect it had on what should be my happy times. Thankfully it was on tv so it didn't cost me anything other than 90 minutes of my life damn it.",
      "total_reactions": 0,
      "user": "CrankyFranky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Seriously, I have never understood why this film has received so lousy reviews. I loved the film from the first minute. Sandra Bullock's character is very strange indeed but she has a good heart and the right intentions. For me it's a perfect film about an underdog  an outsider who rises to the occassion. I have seen this film several times by now and still don't get the negative reviews. Trust me, give this film a chance!",
      "total_reactions": 0,
      "user": "diamonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Getting waterboarded, chewing on aluminum foil, or contracting scabies would all be vastly more appealing than the prospect of watching this movie again. Pure and undistilled cinematic kaka.",
      "total_reactions": 0,
      "user": "Bartacus1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "\"All About Steve in a hilarious tale of a woman who, after falling hard for a guy, thinks they're an item; unfortunately, he thinks she's stalking him!\"",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}