{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "Alpha and Omega",
  "mc_negative_rating_frequency": 20,
  "mc_positive_rating_frequency": 26,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is great if you're free and want to kill some time. But overall it's nothing special. A VERY predictable animation. You feel like you know what's gonna' happen in the middle of the movie. Okay whatever, my final score for \"Alpha and Omega\" is 5/10.. because even if you like it, there's no way to don't get bored. So actually it's kinda' relaxing animation for killing time.",
      "total_reactions": 1,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "awful and full of sexual undertones, the howling being the main reason our \"hero's\" got kidnapped is were i was ready to return this garbage, not for kids that is for sure",
      "total_reactions": 3,
      "user": "Gix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Even though I think this movie should improve in certain areas, I do believe that Lionsgate did a good job on it. Without doubt, all of the music composed in A&O; was truly astounding.",
      "total_reactions": 3,
      "user": "MovieCritic37"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "i disliked it. i cant even watch the dumb blocky animations, and the corny humor made me want to hide myself from my friends when watching it. dont want to see it again. and never will the 1 is for the kids, in which i heard liked it. but eh, dont watch it. please.",
      "total_reactions": 5,
      "user": "Blu_Bird"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "Alpha and Omega deserves to burn in movie hell. The sexual tension is totally inappropriate for younger kids, while older people will roll their eyes at the dumb jokes and become quickly bored with the plot.",
      "total_reactions": 4,
      "user": "DeVr33z"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "Winston(Danny Glover) is a wolf without sons, so the father, by default, sends his oldest daughter Kate(Hayden Panetiere) to alpha school because she's the heir apparent; the alpha female in-waiting. How does that make him feel, the pack leader, the envy of other wolves, having to rely on a girl for daily sustenance, fresh caribou meat, and in the future, leadership, when the time comes for Winston to hand over the reins of power? Surely, he'd much rather have his successor be an alpha male, just like his old \"man\". After Kate returns home without a kill, neither father nor daughter acknowledges the elephant in the room(well, in this case, forest), a notion about lacking, which must weight heavily on both wolves' minds, yet goes unexpressed. Even though Kate comes from good stock, all the alpha training in the world can't offset the physical disadvantages of her gender, relative to the male, who is stronger, faster, and more fierce, more wolf-like. But at the risk of seeming too \"Mulan\", the film addresses the father's latent paternal malcontentment over having girls in a roundabout fashion, by having the wolf blame the unsuccessful hunt on eastern wolves, then employing him in the highly unusual position of matchmaker, in which Winston brokers a connubial union with another alpha male, an enemy father who has a marriageable son, Garth(Chris Carmack), as a means to unite both packs. That's pretty convoluted. Since when do wolves consolidate? Wolves are territorial. If Winston had sons, and outsiders infringed on their hunting grounds, he'd make war, not peace, and have his warriors rip the trespassers' throats out. With her long eyelashes and well-brushed mane, Kate looks too high-maintenance for killing; she'd probably much prefer being a girl, just like her sister Lilly(Christine Ricci). Out of desperation, Kate is allowed to marry Humphrey(Justin Long), an omega, a wolf beneath her station, because his daughter is no hunter, no leader of wolves.",
      "total_reactions": 4,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Absolutely atrocious.",
      "total_reactions": 4,
      "user": "JawDropper"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "My two boys (8 and 7 years old) loved this movie.  Agree with some of the \"critic\" comments (e.g., the strong sexual tension with Omega....) but my kids didn't pick up on that.  I thought it was a very entertaining movie with decent graphics (not great).  The kids will like this movie.",
      "total_reactions": 5,
      "user": "shooter17"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "this is my favorite movie ever! i loved Alpha and Omega when it first came out, and i still adore it today. this is one of the best and most underrated movies ever! i loved the story, i loved the voice acting, i loved the premise, i loved the characters, i loved the music, it had some great writing and the landscapes were amazing! it looked so real, and you feel like you're actually with these wolves in Jasper and Idaho. also, this is one of the greatest cast of characters i ever seen. everybody in Alpha and Omega is incredibly lovable, they got great chemistry and the movie develops them perfectly. also, the animation was really good too. people say it's \"terrible\", but they're dead wrong so they can go screw themselves. like i said, the landscape is amazing! this movie has fantastic backgrounds with great colors that look even better in 3D. i loved Alpha and Omega and i loved the sequels. this is my favorite movie and i definitely recommend it to everybody!",
      "total_reactions": 3,
      "user": "NikoZguri1997"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "I'd say the movie was A-OK. I kind of liked it. But the plot was kind of so 1950s. The film needs more action, but the graphics and designs were pretty fine. However, the sexual tension can confuse young children, while teens will understand and woo. Also, we can learn a few things about marriage, etc. But we DO NOT get to the disgusting part. Well, I'm The Boss of Review, and I give Alpha and Omega a 7.",
      "total_reactions": 4,
      "user": "thebossofreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "To begin, this is a mediocre movie.  It deserves a 5.  No more, no less.  I give it a 7 for two reasons.  First, to attempt to balance out the negative reviews, and second, because I am one of the few people who thoroughly enjoyed the movie (who is not under the age of 10).  It has many things going for it.  The plot was the perfect balance between a simple Cinderella story and a more complex, for lack of a better word, political story.  The voice acting is well done, the animation is competent and deserves more credit than others give, and the characterization and development make you truly care about the main characters.  One of the major problems with the film is the rest of the writing.  Most of the jokes are extremely over-the-top, slapstick, or toilet-related.  The plot, as I said before, is a good balance and kept my attention, but it is not sure of its target audience.  The childish jokes might appeal to, well, children, while the emotional predicament might appeal to teenagers, and the political situation might appeal to adults.  The mixed-in sexual references are out-of-place in what seems to be a children's movie.  If, like me, you approach the movie as less of an animated comedy and more of a mature love story, you might appreciate it a bit more.  The original soundtrack is outstanding, and fit well with the themes of the scenes the songs were used it.  The \"Moonlight Howl\" as I believe they called it in the movie is an interesting concept, and if the introduction to it, a duet between two rather strange-looking wolves, wasn't as...creepy...it would have made a better impression.  The later \"howls\" throughout the movie are well done and the emotion-filled singing voices work very well.  The pairing of the singer with the character's voice actor does not work well in many cases, including Humphrey's.  There are also a few moments where the vowel sound in the music doesn't match the shape of the animated character's mouth, particularly in the later scene between Humphrey and Kate.  The body movements of the wolves are also well done, especially in the opening scene where Humphrey's **** head and his bending down to see through Winston's legs illustrate the character's youth and playfulness.  Now I've said all I have to say, and I hope that the reported sequel under development will fulfill its potential.",
      "total_reactions": 1,
      "user": "BoySamusMetroid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "My friends and I love this movie. It's not that terrible. But, I feel that they can improve in certain aspects:",
      "total_reactions": 2,
      "user": "Ilovetheaters58"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This is cutest and most awesome CGI kids film I have seen in a long while, Writing this down here to increase the user rating as it really deserves a higher rating.",
      "total_reactions": 2,
      "user": "Dulin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Alpha and Omega is one of the most underrated movies I have ever seen. Maybe it's because I'm a huge fan of animals, but I highly enjoy watching this movie. Justin Long and Hayden Panettiere are very likable as the two main characters, Kate and Huphrey, and the side characters don't disappoint as well, especially Lilly (Christina Ricci) and Garth (Chris Carmack). This movie has adults jokes and innuendo that parents and teenagers will laugh out loud at while children will be entertained by the silly antics of the characters and the humor, which is surprisingly subtle and has context without hurting the overall tone of the movie.",
      "total_reactions": 1,
      "user": "Scamp4553"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "All right this moive is great but I know there's some sexual stuff in the moive but still my fav moive in my life also there Makeing a 2 nd moive of it and it might be better then the first. Anyway is still great watching it with your family -thealphadogzHD",
      "total_reactions": 1,
      "user": "Thealphadogzhd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "I will admit, it has problems. Story is pretty cliché and the script can be questionable at times. And the animation doesn’t quite match pixar.",
      "total_reactions": 1,
      "user": "Joey743"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This iphone app was aweosme. I gave it to me kids and tehy wouldn't stop playing. Dunnow how it intstalled - came w/ chaep ripoof iphoon, stuk to bottom of bar tabl w/ gum, makes phon smell like hops. tasttyyy phon thx yeah.",
      "total_reactions": 3,
      "user": "B4byG3n1u5L0v3r"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "overall i dont think that this was such a terrible movie but i will admit it could have been alot better. the story just didn't seem consistent it was too common and its be done before. the point am making is that there was nothing to make this movie stand out nothing unique. the effects however were well done throughout the movie",
      "total_reactions": 0,
      "user": "Andy92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "I can see why it's been called as the worst animated in feature of 2010. From the person who brought us the abysmal animated remake of The King And I & the piece of trash Trumpet And The Swan has made this the biggest step down in his career. The plot is a mix of Romeo and Juliet Balto, The Incredible Journey and A Midsummer Night's Dream and uses the laziest cliches in animation including near the end after the stampede where Kate is knocked out cold from what it looked like it killed her. Humphrey thought she's dead without even checking her breathing her heartbeat and big surprise she's alive (who by the way is the one who didn't tell Humphrey that she has an arranged marrage which made him think Kate doesn't love him). Another bad thing is having all those big name actors like Danny Glover the late Dennis Hopper and Christina Ricci having their acting talents gone to waste. The most mediocre part is the humor and the constant howling which is not how mating rituals work and they howl more time than Warren Zevon. The sexual undertones were so bizarre that it almost as though some nutcase used another script just to make us care for the two leads. The most noticeable flaw is the animation which was done in India but pre production and post production were done in America which you could say is an insult to Indians. Finally the 3D is so terrible it makes the Last Airbender look like How To Train Your Dragon.",
      "total_reactions": 0,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "One of the most disappointing animated films! There was a plain story that might even bore your kids, characters not worth remembering, and dialogue a tad bit too corny to consider giggling.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "It does have some fun moments but the story makes it incredibly predictable. There are a few moments in Alpha and Omega that seem to rip off The Lion King and Open Season. The visuals make it even harder to recommend.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "While the movie was cute, some of the character's needed some more development as well as the plot isn't too new.",
      "total_reactions": 0,
      "user": "PeppersReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "A fun silly movie.I like animation movies, but this is ok at best.It just feels like it lacks something epic. It was predictable to know what was going to happen to the characters.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "It's not the worst movie ever, but it's still rather bad. The character designs are unappealing, the animation is cheap, the characters underdeveloped and most of them pretty much pointless. The story is completely unoriginal as well, it just takes the classic Romeo & Juliet plot and mixes it with road trip elements. It's boring and predictable in every way.",
      "total_reactions": 0,
      "user": "Tirah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "Don't you think the names of Alpha and Omega deserves it to go to another movie? Maybe a remake of this would be so much better than watching this movie.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "You can't watch this movie like any other movie. If you view it as a cutesy, silly adventure you might be entertained. Also, the animation is only bad when characters are in the air. When on the ground, there really isn't anything to complain about. I would give it 69/100, but that's too close to 70",
      "total_reactions": 0,
      "user": "SilverTheGamer"
    }
  ]
}