{
  "mc_avg_user_score": 4.3,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Alvin and the Chipmunks: The Squeakquel",
  "mc_negative_rating_frequency": 49,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "The first one started out watchable but then went downhill but this one goes downhill from the beginning, it adds THREE EXTRA OBNOXIOUS HIGH PITCHED VOICES to the mix and essentially just copies the story from the first. I think my iq iz lowering thiss moovie makes you stoopid dont wach it duuuuh... Save you-self...",
      "total_reactions": 1,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 1,
      "text": "OBNOXIOUS SINGING CHIPMUNKS. If that's not bad enough for you, how about OBNOXIOUS SINGING CHIPMUNKS AND THEIR OBNOXIOUS SINGING GIRLFRIENDS. Coz that's basically what this crap squeakquel is. *shudders*",
      "total_reactions": 1,
      "user": "YellowKirby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "Get your earphones or headphones ready as the chipmunks return for another dull movie of theirs as they hit the screen for even more annoying singing!",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "\"Alvin and the Chipmunks: The Squeakquel\" is a movie so preposterously obvious you won't remember a thing except for the annoying high-pitched voices of the chipmunks after 2 hours.",
      "total_reactions": 11,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "So Much More Than The 1st One! It Lacks Creativity But Earns In Back In This Movie! :D",
      "total_reactions": 4,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Well one thing for sure is that its worse than the first movie.",
      "total_reactions": 4,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best movies of 2009! It was so epic! (Why did Ian have to be half *****, that part disturbed me). Anyway, this is very funny, go buy it before the shelves. I checked the \"spoiler\" box because i said a movie part. Easy to know :P",
      "total_reactions": 3,
      "user": "oscarthedon"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "A boring, irritating cash grab that challenges your sanity for 1 1/2 hours. An atrocity to film making, its among the worst films I've had to suffer through. The fact that this made well over $400m at the box office makes me question how much more greedy Hollywood can be. The abysmal \"humor\" throughout the whole movie gets stale immediately and it's filled with writing that was quite possibly made by a 5 year old. A complete waste of your time, don't go near this abomination.",
      "total_reactions": 3,
      "user": "homer4president"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Much lower than the first, Which Was the movie Where the whole family enjoyed the film and laughed Became only for children under 5 years.The squirrels that would be the novelty and promise become boring. Movie predictable.",
      "total_reactions": 2,
      "user": "Maatts6"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "just a fine sequel.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "I have to say I can't quite see what's TOO bad about this movie. Some parts of it may not make sense and contain cheesy jokes, but overall, I just can't imagine myself giving it a three or a four. I mean, not a ten either, but I thought it was pretty good.",
      "total_reactions": 0,
      "user": "AndrewUltimate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "I watched thiz movie with no expectations. I think all of the things that they wanted to show us already appeared in the first movie. So the sequel (which named: The Squeakquel) is only a repetitions on what we saw before. The movie still cast by: Jason Lee and David Cross. The Alvin Character is voiced by Justin Long. The former Director Tim Hill (who also directed GARFIELD, 2004) replaced by Betty Thomas. It is very clear, The movie-makers intend to refresh things up by the appearance of new characters, The Chippetes (the girl version of The Chipmunks). Members of The Chippetes are: Brittany (Christina Applegate), Jeanette (Anna Faris), Eleanor (Amy Poehler). We certain knew the trio as creditable Drama-Comediennes. I think in some ways, the movie is less musical than the first one. The Chippetes performance looks like based on the nowadays Hip Hop style. If we looked at the human characters, Zachary Levi who seems to have more proportion than Jason Lee, both of them did not make us stunned by their performance. Their role definitely could be replaced easily by other Casts. In the end, I just said thiz kind of movie definitely just for fun.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "A worthy successor to the last movie, which is good or bad depending on your stance. Other than an over-dependence on the introduction of the Chipettes, there's nothing 'wrong' with this sequel that wasn't equally wrong in the original, but it seems to lack the same heart. If you liked the first one, you'll like this one too, but it comes across as a sequel more than a worthy tribute to the source.",
      "total_reactions": 0,
      "user": "LawlessSquirrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Filled with a few laughs here and there. They some what \"kill off\" Jason Lee's character due to him making very little appearance in the film. He recovers in the hospital while the Chipmunks are to stay with their aunt and attend school. This seems more like an excuse to send the Chipmunks back home and introduce a new character. Toby who takes the place of Dave ( Jason Lee) as he \"tries\" to take care of the chipmunks. He is filled with poor dialog and serves no real purpose to the story. It was a very poor mistake to use Toby rather than Dave. I would have expected a move like this if it was straight to dvd or Jason Lee not wanting to play the role anymore. One of the biggest issues people may find with this title is copy and paste. The Chipettes find Ian who repeats his actions to them as he did to the Chipmunks in the first movie. Principal Dr. Ruben requests the Chipmunks to help with a music contest to help save the music program. This Squeakquel felt like there should have been more to the entire movie. The overall plot is lacking and the music selection was okay. The only redeeming thing about the entire movie is the Chipettes. They should have been introduced in the 3rd movie while making this one about something else.",
      "total_reactions": 0,
      "user": "JoeRosa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Alvin and the Chipmunks: The Squeakquel may lack some of the surprise that the original had, but it is still kid friendly. It may be a hit or miss for most adults though.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "This is way better than the Chipwrecked sequel and it is the best of the whole series. But there are scenes that are too annoying and there are scenes that are good. The high-pitched voices of the chipmunks sometimes disturbs me and sometimes impresses me. But overall, it is an average movie for adults and a great one for children.....",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "I found myself bored. The movie is just like the first but more stupid and less fun. The reason it even got a 1 is because Theodore is amazing. The rest of the characters are just pathetic and so are the events following the stupid characters.",
      "total_reactions": 0,
      "user": "jfrotylpe532"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "A sequel that has nothing to do with his former party. Pesima but good to hang out.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "No modicum of effort has gone into this film and every lazy, predictable attempt at humour only serves to zap the energy audience members will desperately need to get through an hour and a half of, what can only be described as, crass commercialism.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "I am not a big fan of sequels aren't I? (Look at my profile), but it was funny, great songs added and I think it could have got a better mark than this, preposterous and lanky at that though.",
      "total_reactions": 0,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Se intenta mejorar pero queda dentro del mismo rollocon otras factores que se quieren hacer ver grandes pero no lo logran efectivamente, esta vez las Arditas fue una idea entretenida a la vez que algunas veces se ve ridicula.",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "I may have been more optimistic on the first film, but the second is just downright outrageously old. With its cliche roles of the smarts, handsome looks, and the charmer; the characters in \"Alvin and the Chipmunks: The Squeakquel\" are downright old and boring, and even worse as they add three more talking chipmunks with similar personalities as well. If David Cross' character wasn't horrible in the first, his role in the second is very dull and boring as well, with his already cliche character before turning horribly annoying. The plot of the story is obviously kid-friendly, as it takes on the role of high school that hundreds of films have already taken, and is nothing new. Although most kids will enjoy this film, to me, it was a bit to overdone with its annoying and boring plot and character elements, and its tired singing musical with the chipmunk voices.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Children will love it of course, but I didn't like it that much. Compared to the first one it feels cheap and that it could have been better. But then again not everything lives up to it's potential.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Really a very tasteless movie. I don't want to waste my time with another brainless movie like this. Really stupid argument even for a 5 years kid!!  And they want to make another!!! Noooooooo!",
      "total_reactions": 0,
      "user": "Xkryon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "I don't even think my little cousins would like it. I was a kid myself when I watched it, and I thought nothing of it. Now, re-watching it, it's probably the worst live action movie. Not one joke really made me laugh.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Not as good as the other 2 chipmunks movies but still great. The storyline was good. It was funny overall. The songs were great. It even had Wii Sports make a cameo. Alvin and the Chipmunks: The Squeakquel is a great movie and you should watch it anytime.",
      "total_reactions": 0,
      "user": "Mariofan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "I do not get the problem with this movie, I found it fun. Man the alvin and the chipmunks movie are great examples of underrated movies, and I hope the bad criticism stops with road chip.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "Alvin pulled a sequel, and Alvin, Simon and Theodore have company of Ardites , lol that funny idea of ​​a sequel to Alvin and the Chipmunks , but otherwise was the best movie of one of the most disastrous film of the family sagas.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Just when I thought I might enjoy it, it just brings a slap to the face as you are giving the same movie over again. Juat keep it for the kids so that the adults can stay in another room.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "Alvin and the chipmunks: The Squeakquel is not as funny as the original and and it shows simple a characters with boring story-telling and very down-beat plot. Fans will be disappointed with this very low result, with good-enough music and a bad premise.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "This is probably one of the worst movies of all time, not just a horrible movie, but a revolting one. This suffers from the same disease the plagued the Ice Age franchise. Brings nothing new, boring, dull. It is beyond horrible.",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2016
      },
      "score": 4,
      "text": "Talk about ending the year off with a whimper. After my review of \"Avatar\" spoke very positively of the James Cameron film, the last film that I'm reviewing from 2009 is \"Alvin and the Chipmunks: The Squeakquel,\" the easily inferior sequel to the surprisingly decent 2007 film. While the first film had a few charming and entertaining moments, \"The Squeakquel\" loses those moments, and overall, it's boring, much less fun, less humorous, and the soundtrack is definitely worse here. While it's perfect for the kids (minus one really weird, out-of-place pole-dancing joke), it's overall a poor sequel that I can't really recommend. There are plenty of better family options for the holidays than this film.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    }
  ]
}