{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 48,
  "mc_mixed_rating_frequency": 78,
  "mc_movie_name": "Angels & Demons",
  "mc_negative_rating_frequency": 48,
  "mc_positive_rating_frequency": 130,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "Dumb movie. The ending was hilariously stupid. Tom Hanks and that hair deserve to be thrown away. I could care less about this complex piece of dung. No angels could save this disaster of a movie.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Angels & Demons is pure hell to watch.",
      "total_reactions": 1,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "This is the only film I have ever walked out of. Sat there confused by what the hell was going on we struggled to keep up with it and had to keep turning to each other to ask why and what had just happened. We walked out just as a helicopter exploded. It was the final straw in a ridiculous and hideous film.",
      "total_reactions": 1,
      "user": "DAC1984"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Great movie, very entertaining with a thrilling story. Again same as Part 1 the \"Da Vinci Code\" pretty much setup story but...who cares. These are the movies you go to the cinema for.... I love such mystical thrillers of which you unfortunately nowadays can only find so few.....Watch it!",
      "total_reactions": 3,
      "user": "MadDad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "its way better than The Da Vinci Code, but the plot was confusing and most of all: implausible",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I liked that movie. It kept me watching, which is rare these days. I did not read the book, so I have no comparison to that. I was never bored, the action moved along, the acting was good, Rome was nice and authentic. If all movies made these days would have the same caliber, audiences around the world would be happier !",
      "total_reactions": 4,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "\"Robert Langdon\" (Tom Hanks) is back, and he has only a few hours to solve a mystery to save thousands of Catholic faithful, and top candidates for role of pope, before an incident which will kill them all as they await the annoucement of who the new leader of the church will be.",
      "total_reactions": 1,
      "user": "The_MOW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Angels  Demons is the sequel to the Da Vinci Code, and while it's generally said that Da Vinci Code was better, I disagree. When Da Vinci Code came out, I had just seen National Treasure, and there were so many similarities, that I didn't enjoy it as much as I should have. Angels  Demons does what every sequel aspires to do. It takes the characters we like and puts them in a similar but different story. Tom Hanks is once again terrific, bringing an intensity that few others can match. Following the clues lost in time and the twists and turns thrown in by writer, Dan Brown, Angels  Demons is most defiantly a sequel that lives up to the first one and also gives you something to talk about. What else could you ask for?",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The acting was good and it is suspensful and keeps you interested through out. Was no where near as good as the previous film was and I was actually a bit disapointed with it because it abandond the puzzles (which made the first film so good) and had far too much violence.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Much better than The Da Vinci Code but the subject matter (symbolism and the likeness) is a very hard sell going from book to the big screen. At times Tom Hanks having to explain things felt so out of place, yet it was necessary to keep the plot moving. Angels and Demons might have been ranked a bit higher for me but I was unfortunate (or fortunate depending on how you look at it) and read the book before seeing the movie and as the movie strayed so far from the book I became a bit annoyed thus making my viewing experience not as enjoyable. But if you haven't read the book by all means watch the movie as it will give you a heck of a good thrill ride with some extremely disturbing visuals.",
      "total_reactions": 0,
      "user": "jp992751"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Angels and Demons is the sequel to 'The DaVinci Code' both based on the novels by Dan Brown. Angels and Demons is the first in the novel series but second in the movies and tells a fast paced story about a bomb threat that could potentially wipe out Vatican City. Robert Langdon (Tom Hanks) is a representative from Vatican City and is asked to help find the bomb hidden somewhere in the Vatican.",
      "total_reactions": 0,
      "user": "dylan365v"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "More action packed the the first film and just as enjoyable imo. Rather suspensful as well. It just doesn't have what made the first film so good though and that's what hurts it imo. Still a solid film though.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "I have read the book and I was excepting a thrilling movie. I am completely disappointed, I wanted more I got less. So many basic elements have been skipped. They tried to give action and rush but for me they totally failed. The movie has no pace. I wouldn't recommend this movie.",
      "total_reactions": 0,
      "user": "geo86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Angels and Demons is not comparable to The Da Vinci Code. Everything that made the Da Vinci Code good was lost in Angels and Demons. The story was incomprensible with acting that seem that they were going through the motions. Huge disappointment.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "\"Angels & Demons\" is the sequel to \"The Da Vinci Code\" and is undeniably an improvement. This one doesn't feel as overlong, it's fast-paced, and has some swift and intense action.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Very entertaining and suspenseful!! Ron Howard is a very good director. Watch this movie!! It's obviously very underrated but do not listen to the critics and enjoy it!!",
      "total_reactions": 0,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "The movie Angels & Demons pales in comparison to its novel but is nonetheless thrilling, exciting and more compelling than its film predecessor. 7.6/10",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Angels and Demons: 3 out of 10: Clearly something bad has happened to Ron Howard. I don't know what exactly, but something has gone very wrong.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "\"Angels & Demons\" was a movie almost a term of conspiracy theories about the Illuminati , and their evil plans , but Tom Hanks in the adaptation of Dan Brown's book , the film has been very electrifying and terrifying , but very boring after the cosmic explosion scene until the appointment of a new pope , the Vatican is at risk of the Illuminati do .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Science and religion collide, commingle and eventually reach a state of peaceful coexistence in “Angels & Demons,” a follow-up to “The Da Vinci Code” in which director Ron Howard conspicuously gives top priority to the story’s beat-the-clock thriller elements. Less turgid and aggravating than its predecessor, this cleverly produced melodrama remains hamstrung by novelist’s Dan Brown’s laborious connect-the-dots plotting and the filmmakers’ prosaic literal-mindedness in the face of ripe historical antagonisms, mystery and intrigue.",
      "total_reactions": 0,
      "user": "FilmClub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "In many respects, Angels & Demons is a pretty straightforward terrorist-hostage film.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2016
      },
      "score": 6,
      "text": "whilst the improvement is definitely significant Angels and demons cannot help but go drift into a ridiculous and utterly unrealistic story however the action sequences and Tom Hanks performance definitely delivers",
      "total_reactions": 0,
      "user": "UNARMED_JORD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "I don't think it's too much of a stretch to say that this is the best of the Dan Brown novel adaptations. Whether that statement should be taken positively or negatively is up to you, dear readers.",
      "total_reactions": 0,
      "user": "GerardistheWay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2016
      },
      "score": 1,
      "text": "Not the worst movie I've personally come across... but close! I really felt like I was watching a 150 million dollar joke.",
      "total_reactions": 0,
      "user": "Zapador"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "The Acting And Pacing, Is Perfectly timed, Tom Hanks is rather extraordinary, as well Pierfrancesco Favino. If you liked 2006's The DaVinci Code, Then Angels & Demons, is worth your time.",
      "total_reactions": 0,
      "user": "moneylincoln"
    }
  ]
}