{
  "avg_user_score": 5.0,
  "metascore": 37,
  "mixed_rating_frequency": 92,
  "movie_name": "Annabelle",
  "negative_rating_frequency": 95,
  "positive_rating_frequency": 96,
  "pro_critic_reviews": [
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "The late-60's Satanic panic and housewifely ennui make for a surprisingly complementary mix of fear and paranoia in Annabelle."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "Annabelle is mostly a grab into the Great Big Bag O’ Horror Clichés: sound-bombs of shrieking violins explode randomly, doors slam unbidden, rocking chairs creak by themselves, machines suddenly whir to life."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "Each time a character gets tossed in the air by some manifestation or another, the effect is cheesy. Still, I've seen worse. For the record, the violence in Annabelle is far less copious and sadistic than the stuff in the Denzel Washington movie everybody's going to."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "Annabelle works enough devil figurine juju to make for a modestly hair-raising prequel to the more satisfying scares of its predecessor, \"The Conjuring.\""
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2014
      },
      "score": 58,
      "summary": "As a blunt object, a machine built to put nerves on edge and fingers over eyes, Annabelle is still crudely (and cruelly) effective. Fear comes cheap."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "When it comes to Annabelle’s five or six big stinger moments, Leonetti manages to deliver the jolts, and if audiences are sure to head home complaining about how dumb and predictable it all was, many may also find themselves nursing their significant others’ lightly bruised forearms."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "Annabelle is less cluttered with creepy bric-a-brac than “The Conjuring.” (The original director, James Wan, produced here.) But Mr. Leonetti embraces the potential of negative space."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "Though it features a plucky female protagonist, Annabelle still possesses the same medieval attitude toward women as “The Conjuring,” reducing the gender to the extremes of self-sacrificing mother and malevolent toy."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "The scares don't stay with you. They're the horror-movie equivalent of junk food."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "The script highlights an annoying lack of self-preservation on behalf of the protagonists. But the movie tries to be more than just a creepy doll freakout, and delivers the requisite scares."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "There’s real craftsmanship to the film, but it’s in service of a story that can’t quite support it."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2014
      },
      "score": 50,
      "summary": "There’s nothing surprising about this late ’60s tale, including its connection to the modern ghost stories told in “The Amityville Horror” and “The Conjuring.” But what it lacks in originality it makes up with in hair-raising execution. You will scream like a teenage girl."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 42,
      "summary": "Leonetti doesn't seem to have any particular knack for the staging of suspense or fear."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "A couple of good jumps but this Conjuring spin-off is led down by poor writing, anodyne leads and and overwhelming sense of familiarity"
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "Centrally, the title character remains an impressive piece of propwork, and Leonetti's restraint in never animating it (à la Chucky) is the only thing worth appreciating here."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "Sadly, Annabelle, a cheap, sleazy, low-budget prequel meant to explain the origins of that particular doll, is as undistinguished, uninteresting, and unscary as the worst of the Chucky films."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "Annabelle invites unflattering comparisons with scary movies that came before, but its disparate parts never coalesce into a genuinely fearsome thriller."
    },
    {
      "critic": "Christopher Gray",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "It's all a far cry from James Wan's The Conjuring, which embraced the thrill of the paranormal even as it respected its frazzled, earthbound characters."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "Annabelle is so lazily coat-tailing on Roman Polanski, they should have called it “Rosemary’s Barbie.”"
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2014
      },
      "score": 30,
      "summary": "While it’s possible that Annabelle might give a few audience members goosebumps, anyone who’s ever seen \"Rosemary’s Baby\" –or pretty much any film James Wan’s had a hand in since helming 2007’s \"Dead Silence\", the \"Saw\" franchise excepted – will figure out what’s going on within the first 30 minutes."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 30,
      "summary": "Gary Dauberman’s haphazard screenplay merely piles on the cheap scares, with director Leonetti cranking the volume up to 11 to accentuate the frequent jolts. It all adds up to a compendium of horror movie clichés."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 25,
      "summary": "It offers surface level scares without the undercurrent of humanity needed to make them register."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 25,
      "summary": "If \"subtle\" horror movies are going to be this devastatingly boring, maybe it's time to bring back the buckets of blood."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 25,
      "summary": "Despite its deficiencies, Annabelle is not without a modicum of verve. It has its unnerving moments, but they’re outweighed by the sheer stupidity and predictability of the story."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 20,
      "summary": "Familiarity is not always a bad thing, though. \"The Conjuring\" breathed new life into old clichés; it showed that those creaking doors and possessed closets and white-robed figures still had the power to scare us. But that was a movie made with sensitivity and purpose. The blunt, lifeless Annabelle, on the other hand, sucks that life right back out."
    },
    {
      "critic": "Graham Fuller",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 20,
      "summary": "Wallis is commendably restrained and Alfre Woodard adds class as Mia’s wise ally. But Annabelle is a vortex of visual clichés beyond rescue."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "summary": "For a superior experience, go buy a disturbing-looking doll that says ''Don't go see Annabelle'' when you pull its string."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Annabelle es una película innecesaria, llena de clichés de otras películas de terror; la historia es bastante sencilla, los Screamers son baratos, lo unico rescata ble fue la escena del elevador (muy buena por cierto) de ahí en mas no ofrece nada nuevo (ni hablemos del final, fue patético...)",
      "total_reactions": 1,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "La película mas mierdera de la historia, y para colmo repleta de sobrevaloración. demasiada publicidad para una película que prometía mucho y no cumplió nada.",
      "total_reactions": 1,
      "user": "Panchogul"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "With jump scares without suspense, plot without pacing, characters without development and a creepy doll who does nothing, Annabelle is scary in how unfrightening it is.",
      "total_reactions": 9,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "So, basically, if you had any idea that this moving was going to be about a doll, you would be wrong. It is isn't. It's about Helter Skelter with some knock-off wannabe Manson-style cult as the source of all the woes in the film. It's like Paranormal activity, Rosemary's Baby and Chucky had a threesome and their love child was \"ANNABELLE\"",
      "total_reactions": 6,
      "user": "Heero2020"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "Annabelle it's the kind of movie that pretend introduce a scary situation with bad storyline and the result is the same over and over again, many jump scares but not an atmosphere to introduce the spectator into the act. At the end, it's just a movie that wanna be successful using the success and good rating of the conjuring.",
      "total_reactions": 5,
      "user": "rayquaza9898"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "Don't bother seeing this movie. Annabelle had a complete lack of scares which made it extremely boring. Basically the doll just sat around the house changing [ing positions every 15 minutes. The acting was unbearable it was so bad. Really disappointing after last years hit The Conjuring.",
      "total_reactions": 4,
      "user": "thetvreviewman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "Annabelle was possibly the worst horror movie I've seen in a long time. The movie seemed to drag by and there were too few scare scenes. I honestly can't believe this came from the same people that brought us The Conjuring.",
      "total_reactions": 14,
      "user": "Jrud05"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "I was happy to read that Annabelle, without much publicity or hype and pretty bad reviews (which it did not deserve) made only $800,000 less than Gone Girl in its opening weekend.  Is there hope for the American horror-movie-going audience? Annabelle is a solid film with a plot, characters, and good acting. Yes, it is derivative, but it also creates a consistent mood and atmosphere and conjures up some real emotion at the end. No, it is not original, but it is also not a stupid and empty slasher fest, full of blood and gore where the director just goes “boo!” at you every few minutes. This kind of film is actually mocked during the features before this film by picturing teenagers doing such stupid things that the monster even looks exasperated. So bravo for a solid (if not great) horror film whose success will hopefully encourage more films in the tradition of “real” and more genuinely frightening films like Psycho, Rosemary’s Baby, and The Haunting of Hill House.",
      "total_reactions": 3,
      "user": "GinaK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Boring and unintentionally funny in a lot of scenes and the doll is completely arbitrary to the plot. Despite one decent sequence involving an elevator \"Annabelle\" is as porcelain of a movie as the real doll is.",
      "total_reactions": 3,
      "user": "NotoriousFraud"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "***SPOILERS***",
      "total_reactions": 3,
      "user": "TheSecretEmber"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Annabelle manages to use every horror cliche in the book, thus making it another typical bad horror movie of this generation. The acting is somewhat okay, but the sounds and the \"scares\" are overused, thus ruining the scare factor.",
      "total_reactions": 3,
      "user": "HannibalLecter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "A failure prequel that is lightyears far from it's original movie \"The Conjuring\"",
      "total_reactions": 3,
      "user": "PerfectCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "Não acredito que paguei pra ver isso sério, pelo amor de Deus, pior filme que já vi no cinema,  Invocação do Mal foi um filme muito bom agora não vale nem a pena gastar seu precioso tempo vendo isso.",
      "total_reactions": 3,
      "user": "heitorsgodinho"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "A shameless cash-grab, Annabelle fails to provide anything new to the genre with a boring plot, pitiful acting, and long periods of time where absolutely nothing happens.",
      "total_reactions": 3,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "\"Annabelle\" is your typical summer horror film. Its got the same scare formula as \"Insidious\" with its simple jump-scare horrors and what not; however, the shabby story and average acting does make it a little bit less in quality than its former.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "Three to five minutes of Annabelle in 'The Conjuring' is far more frightening than an hour and a half of Annabelle...  in 'Annabelle'. They just made the doll cute.",
      "total_reactions": 11,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "I'm going to use a videogame as a reference. If you have played Silent Hill P.T. and Left 4 Dead Series, this is the movie for you. I absolutely loved it. Good story. Seeing is believe and I suggest you see this movie.",
      "total_reactions": 8,
      "user": "YoSahop"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "From director of Mortal Kombat: Annihilation!! hah",
      "total_reactions": 7,
      "user": "Axtton"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "I hate to do this, but I'm going to have to call out Kyle Smith of the Post, Inkoo Kang of The Wrap, and Michael  Phillips of the Tribune - you all gave this travesty a positive review.  You should turn in your critic card - yesterday.  This is a horrible movie that commits the cardinal sin of horror movies - it bores the hell out of you.  Nothing happens in this film.  It's as if the movie's been sitting on the shelf for about 15 years, and the writers/director haven't seen anything that's come out in the horror genre since then.  Really embarrassing for Warner Bros.  Godawful crap.  Please, do yourself a favor, horror fans, and go see The Guest, Honeymoon, or any number of really good horror movies released this year.  Better yet, go check out You're Next or A Horrible Way to Die from Adam Wingard - one director who is doing horror right these days.  One more note on Annabelle - it seems that any form of entertainment that employs Alfre Woodward these days - be it Copper, Last Ship, True Blood etc. - officially jumps the shark when she appears.  I loved her in her early career, but she spells doom for whatever she's in lately.",
      "total_reactions": 11,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "Simply bad. Not scary at all, and I really disliked it. Not even close to how good the first movie was. The story was horrible, the actors were just plain stupid, and the scares were lame. 0/10",
      "total_reactions": 11,
      "user": "Blackstarhalo4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "If I were to compare The Conjuring to this year's Annabelle, well this year's prequel to the horror classic, The Conjuring, is all but a cliched boring demonic ritualistic fare that doesn't add much of an improvement upon its sequel nor doesn't connect the dots on what is all about the creepy doll in the Conjuring. At least there were few parts that gave me thrills especially the demon scene there. Oh that was creepy and intense but all in all its still a failure to justify a satisfying horror film.",
      "total_reactions": 4,
      "user": "DaMovieLover"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "It was terrifying and reasons why I never liked dolls. It was definitely a cliched horror film with loud noise and things popping out at the right moment but worked really well. Glad it was not an exorcism type movie.",
      "total_reactions": 4,
      "user": "francisrgo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "Come on, this is supposed to be a great prequel to the horror masterpiece The Conjuring, instead, it was a dull and laughable cliché \"horror\" story. What in this movie is supposed to scare us?",
      "total_reactions": 4,
      "user": "RamonGuerrero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "It was one of those 'Lets-get-it-over-with' movies. It really doesn't provide what The Conjuring did. A miniscule bit of horror. Though, it takes a bit of The Conjuring, but then again, it never provided the terror snd uneasiness of it.",
      "total_reactions": 2,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Overall, while it undoubtedly lacks the ingenuity of The Conjuring, it honestly wasn't as bad as I thought it would be. There were actually a few effective scares here and there, but nowhere near enough to put it on the same level as The Conjuring.",
      "total_reactions": 2,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "After all of the negative press I had read about \"Annabelle\", I still wanted to see it. Before all of the reviews hit, I wanted to see it, because I really, really liked \"The Conjuring\", and after - just for the lulz, as the internets say. So I did. And it's not that bad.",
      "total_reactions": 2,
      "user": "stako"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "This is a very bad movie, it's so predictable, there are some cool scenes, but the movie itself won't scare you so much, the story is too simple, and there is no climax, the movie ends and you ask if that was all, i was expecting much more from this, The Conjuring was good, but this one fails at everything. It's a waste of good material.",
      "total_reactions": 2,
      "user": "Massander"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "It is a shame I can't do two reviews for each half of this movie. Because the first half, if generic, is a decent creepy horror film. With paranormal activity esque camera work (which is the best part of the whole film) and a doll which is genuinely creepy, the first half does contain suspense and maybe a scare and a third. However after maybe 40 odd minutes, the film devolves into something more like scary movie or drag me to hell. All suspense is lost as we see the beastie who is behind everything (a dude with a goat's head) and we hear about the back story of the doll, which is nonsense. Overall this film was dissapointing, as the doll was one of the two scary parts of the conjuring, but this film is not scary, it's just kind of silly and dull.",
      "total_reactions": 2,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "\"Annabelle\" is one of the most boring, flat, dry, uninspired, unoriginal pieces of cinematic garbage I've laid eyes on in the past decade.",
      "total_reactions": 2,
      "user": "plushcarpet"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "Managed to be worse than The Conjuring...somehow. It was an hour and a half  of the director zooming in on the doll with ABYSMAL plot and extremely cliche storytelling, for a horror movie, this is completely unacceptable.",
      "total_reactions": 2,
      "user": "GerfyGerber"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "Quite simply, I gave this a one simply because of one or two brief scenes (the basement/elevator scene and the scene when the wife first sees the little Annabelle girl ghost in the apt.) that were slightly creepy.  Overall this movie was god awful boring.  At 22 minutes left (after the characters finally figured out a demon was involved) we were like \"How are they going to wrap this up?  That remaining 22 minutes includes credits!!\" How they managed to do it was due to an EXTREMELY sloppy edit in which the main  characters were confusingly  all of a sudden at  totally different places and with totally different characters then had been implied would occur a mere 5 seconds previously.  Guess the editors realized they only had 22 or so minutes left as well and knew they had to cram everything in at once.  Dull, predictable ending,  No tension.  Glad I only rented this. Very disappointed.",
      "total_reactions": 2,
      "user": "brentwshelton1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Given the late 60's early 70's setting I was hoping for an old-school feeling horror film like the ones from that era. While the visual style and poor acting are from that era, the scares are not. It is very much a modern feeling horror movie, and a boring one at that. No more boring than your average non-scary horror movie, but boring nonetheless.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "I was expecting much more from this movie.",
      "total_reactions": 2,
      "user": "madforeigner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "ANNABELLE is a complete mash up of everything that  is wrong with the horror genre. It's a dull, derivative, and predicable turkey of a film that favors cheep jump scares over lasting dread and is headed by a villain who is obviously just trying WAY too hard to be scary. This is a film that is unwatchable on every level.",
      "total_reactions": 2,
      "user": "NFW"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Annabelle captured the time period effortlessly. Seeing as the Director was the DP on Wan's many films, this film proved true to his other films. The camera moves effectively through and captures the tension you want the entire time.",
      "total_reactions": 13,
      "user": "alex1978"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Amazing **** Annabelle iot's an incredible movie to watch if you are retarded or if you have problems of brain. Oh my god, MASTERPIECE!!! 10$ for this!!! If you want to destroy your life, then watch it. Fck that shy of movie! .l.",
      "total_reactions": 5,
      "user": "ismacinefilo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "I hate this movie because it's scary, tense and freak me out so many times. After 45 minutes, i asked my wife for the time because i couldn't take it anymore. My wife chose the movie, not me so i forced myself to hang in there for my wife until the end. Never again i watch horror movie on big screen. EVER!",
      "total_reactions": 6,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "In comparison to The Conjuring, Annabelle is a major disappointment. The writing is incredibly mediocre with characters that are weak (and dumb), a script which is thin with a few holes and a plot which is unoriginal, predictable and just plain dumb. Apart from a nice period art design, the production is bland and feels very cheap. Joseph Bishara's score is also a disappointment; it is far from as memorable as Insidious' score and The Conjuring's score. The Conjuring had great performances; Annabelle - not so much. The performances feel fairly wooden and boring and do not really bring much life to the characters. I am not sure if the dull characters are to blame for this or if the actors are just not very good. Despite these flaws, I did not dislike the film - Annabelle does have its good moments, such as a few cool well-constructed scenes (e.g. Basement/Elevator) which make the film enjoyable at times, as well as a few references to real life events and other films such as Rosemary's Baby, which, I thought, was a rather interesting choice. Overall, Annabelle has a nice art design, a few cool moments and is enjoyable at times, but the script is weak, the characters are dumb and it ultimately feels cheap. As a theatrical film, it does not work - but it would make a great direct-to-DVD film.",
      "total_reactions": 3,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "It has its moments, but when you get to compare it with The Conjuring, its just the same regular horror movie with a \"ruins everything\" ending, regardless it is cute; but that is something that the movie shouldn't do, it has to be \"supposedly\" scary. Go and see it under your own responsibility.",
      "total_reactions": 3,
      "user": "jppl1999"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "As a casual horror movie watcher this was a great film.",
      "total_reactions": 7,
      "user": "CapnAwesome"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "This movie was very good. The main character is a very good actress, and there are some very good scares throughout this movie. Definitely one of the best horror movies I have ever seen.",
      "total_reactions": 4,
      "user": "tonysopranoz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Effective little chiller that benefits from some imagination in the direction and three or four scenes that are a credit to the genre. In fact the first real scene of horror is one of which Hitchcock could be proud. The attractive leads are also better than the usual cyphers placed in these types of films and the story is generally quite logically played out. References to Polanski's 'Rosemary's Baby' abound and there are definitely shocks to be had along the way. One sequence involving a sewing machine, a hob and some popcorn is cut to elicit maximum tension. Two supporting players are effectively presented with menacing undertones, but the movie's biggest mystery remains why anyone would want to own such a sinister looking doll in the first place. The final scenes become somewhat predictable, but I must say that it sets up the scenario for last year's' The Conjuring' very nicely, and is actually preferable.",
      "total_reactions": 4,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "I honestly didnt want to see this movie, but god am I happy I did. This movie was AMAZING and definantly had some parts that scared me and it takes alot. Such a good story line and even the ending was Amazing, sad, but amazing. Definantly worth spending the extra money to watch it in a theater versus at home.",
      "total_reactions": 4,
      "user": "sponkeymonkey"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Annabelle was a well acted horror movie for once! It wasn't over the top and the story was great. I loved the scares and honestly I thought it was scarier than the Conjuring which I LOVED. GREAT JOB!!",
      "total_reactions": 23,
      "user": "jasongoldsteen"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Annabelle has a very similar feel to the Conjuring and this installment fits nicely as a prequel. The excellent direction and well played characters makes this the scariest movie of 2014 to date. Be ready for a scary and some what interest horror film that may not reach the heights of the Conjuring, though never falls short. Annabelle is a very enjoyable movie that will keep you up at night!",
      "total_reactions": 13,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Annabelle is sort of a lukewarm movie. In the previews they drew you in with mentioning the Conjuring but it really doesn't live up to the quality of its parent film. There are several good scares in the movie and it follows a good storyline, but the ending comes abruptly and that was what spoiled it for me.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "There is a great little horror movie hidden in here somewhere which makes it all the more frustrating to watch. There are legitimately frightening scenes and moments here that really do evoke true fear, but each one was dampened by the direction the filmmakers decided to go. It was all build-up, build-up build-up with no payoff.",
      "total_reactions": 2,
      "user": "Sithbot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "I suppose the worst thing a horror film can be is un-scary, and Annabelle is not that; it has its frightening moments.  But because those scares – and even the attempts at scares that don’t always work – are so few and far between, the film winds up being the second-worst thing a horror film can be: boring.",
      "total_reactions": 1,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "Annabelle is entertaining for anyone looking for a good time. Overall, it is disappointing as a horror movie, it is dull, takes forever to pick up. When it does, it doesn't disappoint, but by then, it's too late.",
      "total_reactions": 2,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Annabelle gives you a good scare and definitely a must watch you wont regret it. I am definitely watching it when it comes out on dvd and I already have watched it 9 times that is how good it is.",
      "total_reactions": 4,
      "user": "rjbranch"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "ótimo simplesmente bom e excelente recomendo a todos assistirem clima tenso em tudo e simplesmente bom e pode sim chegar ao pés de invocação do mal",
      "total_reactions": 2,
      "user": "alencararthur"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "adorei o filme , ótimo incrivelmente bom e da um medo total , amei cada parte , e cada segundo , não sei porque teve critica negativa se foi um filme bom , e espero que o tenha o dois já que essa historia não é verdadeira",
      "total_reactions": 2,
      "user": "antalencar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "The acting is B level and a lot of the scares are trailer scares but I still felt there were some good moments.  The film at times was worth a recommendation but then the finale happened and lowered the rating.  C+",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "This movie was good October, Halloween fun. It's nowhere near as good as the Conjuring, but it does a pretty good job of giving the backstory much more depth. There's little CGI used throughout the film too and a lot of the scares here are done using old-school methods - creaking chairs, lingering shots etc.",
      "total_reactions": 1,
      "user": "lamesjees"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Initially when I went to go watch Annabelle I thought it would act like a sort of spin off to the Conjuring.",
      "total_reactions": 3,
      "user": "BL4D3MAG3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "went to see this film with no expectations. ended up being a nod to a few favourite horror flicks, they nailed the time period, the baby carriage made me think of Rosemary's Baby. The Demon made me think of the Red Face Demon from Insidious. This movie didn't really scare me, the cinematography and atmosphere was just chilling. I love the whole film. Well done acting all around I love the actor that played the Father, Tony Amendola, and also props to the main girl, Annabelle Wallis. I Absolutely love the Director, John R. Leonetti, because hes worked as DP on most of James Wan's film.",
      "total_reactions": 2,
      "user": "TrevorDevendorf"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "muito bom levei tantos sustos que eu perdi a conta acho que tem que ter o dois urgente pra eu poder assistir kkkkkkk e tem que sair logo em dvd pra eu poder comprar kkkkkkkk",
      "total_reactions": 3,
      "user": "dilsin1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "tao bom que deve ter o dois com certeza eu acho que foi o melhor filme de terror do ano e o melhor filme de terro porque o filme e muito bom muito bom mesmo eu recomendo",
      "total_reactions": 2,
      "user": "maria33"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "tao om tao perfeito levei tantos sustos que eu perdi até a conta ele é melhor que invocação do mal com certeza e tem que haver continuação porque um filme bom desse não pode parar nnota 1000",
      "total_reactions": 2,
      "user": "buritcha"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "muito bom muito bom mesmo ele e tao bom que chega ao nível de invocação do mal eu adorei em na parte do capiroto é a melhor kkk mais gostei em muito bom nota 10",
      "total_reactions": 3,
      "user": "oita"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "ótimo eu amei adorei gamei , e que nem droga provei gostei e agora viciei kkk sai logo em dvd que eu não aguento demora rsrs vamos la tem que haver o dois porque quando eu enjoar do 1 que é impossível kk eu terei o 2 pra animar hahaha",
      "total_reactions": 1,
      "user": "sarak"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "The film Annabelle, is both exciting and scary, while continuously keeping you on the edge of your seat not knowing when the action will surprise you.  When it comes to the goal of horror movies, there must be fear instilled into the viewer.  Annabelle meets the requirements, it does not shy away from instilling fear into the viewer.",
      "total_reactions": 2,
      "user": "horror_princess"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This was painfully unoriginal, had bad acting, directing, writing, and cinematography, and the priest character was extremely unnecessary, but I enjoyed the hell out of it. It had a lot of effective tension accented by its good scares, and I liked how it was set in 1968. If you want horror that doesn't require any thinking but delivers exactly what it promises, I recommend this.",
      "total_reactions": 1,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Although it has its moments of creepiness, this is not a very scary movie, and of course, comparison to the much more effective The Conjuring is inevitable. The problem here is that it's not very well plotted and the acting is B grade, to say the least. It's a movie desperately in search of a director...and an original script.",
      "total_reactions": 1,
      "user": "WJS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Annabelle is a fine primer for those unaccustomed to horror films. Make no mistake, the doll is clearly the star of this movie so It didn't matter to me how good or bad the actors performed. Great audio for suspense building and a couple of memorable scenes; only wish there were more. I hope there are plans for a sequel with perhaps James Wan directing.",
      "total_reactions": 1,
      "user": "aikman2irvin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "O já famoso toque de James Wan é o ponto alto de Annabelle (ele poderia estar dirigindo o filme em vez de produzindo, mas...) com cenas similares, mas não melhores do que Invocação do mal (a continuação de Annabelle) o filme irá te deixar tenso, porém te decepcionará com previsíveis sustos e um medíocre roteiro.",
      "total_reactions": 0,
      "user": "GustavoTalaini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "otimo espero que saia agora do cinema pra eu poder comprar o dvd original pra eu poder ver sempre quiser amei o filme nota 10 , kk e lembrando a parte do capiroto é top em",
      "total_reactions": 0,
      "user": "anacarol15789"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "What a way to ruin a a franchise ...",
      "total_reactions": 0,
      "user": "jaro2096"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "Annabelle is an uninspired, lazy cash grab, which relies on cheap jumpscares, following a formula you've seen a thousand times done better, in an attempt to take advantage of The Conjuring's success, a movie that, while still following some of the classic horror movie genre, showed you can deliver make a good horror movie, with a few of the typical jumpscares here and there, but never forgetting that well developed characters and atmosphere is what really makes a good horror movie work. Annabelle doesnt even try.",
      "total_reactions": 0,
      "user": "felix99gomez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "You know when you walk into something and you know it's going to be bad but you do it anyways?  Yeah, that's what I did here.  The plot? Overused.  The Acting? Overdone.  The Doll? It's been done and at least Chucky cracked jokes.  There was one creepy scene in this movie and it didn't even feature the doll.    It's like the people who made The Conjuring fell asleep and someone played a horrible trick on them.  The scariest part of this movie was that I used a free pass to go see it.",
      "total_reactions": 0,
      "user": "Sconesdeep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Giving this a 4 because the scare jumps were absolute rubbish, slender man the game makes me more scared than this price of junk film. the story line was boring and you know what happens in every scene. In the end the doll is kept safe in a glass box the end.",
      "total_reactions": 0,
      "user": "poppunkreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "O filme não é uma obra-prima, isso eu concordo, mas muitas pessoas estão vendo o filme em busca de um terror chocante e horripilante. Essa não é a intenção do filme. O filme tem intenção de mostrar a real história de Annabelle e isso o diretor fez bem. O filme contém uma ótima história e muito bem passada do roteiro para as telas. Outro ponto positivo foram as cenas agoniantes e de suspense extremo, como a cena da escada, do elevador (aos que ainda não viram.. ó) e as cenas em que mostrava a Mia com a máquina de costura (aquilo me dava uma agonia...). Um ponto negativo (ao meu ver) foi o da boneca não se mexer tanto. Entendo que uma boneca que se mexe e anda pela casa é tosco (odeio Chucky, por exemplo), mas nem olhares ela trocava... como na história real. Os atores, apesar do que li em alguns comentários, não são tão ruins, apenas o john e talvez o padre. Mas, sim, é um bom filme, que conseguiu alcançar seu objetivo de forma clara e que me satisfez.",
      "total_reactions": 0,
      "user": "aalencaraarthur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "O filme não é uma obra-prima, isso eu concordo, mas muitas pessoas estão vendo o filme em busca de um terror chocante e horripilante. Essa não é a intenção do filme. O filme tem intenção de mostrar a real história de Annabelle e isso o diretor fez bem. O filme contém uma ótima história e muito bem passada do roteiro para as telas. Outro ponto positivo foram as cenas agoniantes e de suspense extremo, como a cena da escada, do elevador (aos que ainda não viram.. ó) e as cenas em que mostrava a Mia com a máquina de costura (aquilo me dava uma agonia...). Um ponto negativo (ao meu ver) foi o da boneca não se mexer tanto. Entendo que uma boneca que se mexe e anda pela casa é tosco (odeio Chucky, por exemplo), mas nem olhares ela trocava... como na história real. Os atores, apesar do que li em alguns comentários, não são tão ruins, apenas o john e talvez o padre. Mas, sim, é um bom filme, que conseguiu alcançar seu objetivo de forma clara e que me satisfez.",
      "total_reactions": 0,
      "user": "annabelle1578"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "muito bom , no brasil esta fazendo muito sucesso ele e o filme de terror mais visto na historia do brasil e ele merece ele é um filme muito bom amei quero comprar o dvd logo , nota 10",
      "total_reactions": 0,
      "user": "Kaath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Annabelle was a well acted horror movie for once! It wasn't over the top and the story was great. I loved the scares and honestly I thought it was scarier than the Conjuring which I LOVED. GREAT JOB!!",
      "total_reactions": 0,
      "user": "cacaiique"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I liked it more than \"The conjuring\". It was more close to reality, because the people are indeed haunted, and not killed. The movie tells a story, and does this greatly. Nice camera direction, nice atmospheric. All made sense. It was a good movie.",
      "total_reactions": 0,
      "user": "Macdealer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "A mostly standard horror film with its loud noises and somewhat predictable scene setups but still mildly entertaining. The Conjuring was far superior than Annabelle.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "I've wasted $10 for the worst rated R movie in the history of the world. The movie wasn't scary, wasn't original, and I bet a five year old wouldn't freak out except for the elevator scene. The doll didn't move at all, and the movie stretched on for no apparent reason.  Don't bother wasting your money on this movie. I'd watch any rated PG 13 movie other than this.",
      "total_reactions": 0,
      "user": "asmaanurg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "John R. Leonetti directed this movie, and if you don't know what other movies he did, well he did such movies as: Mortal Kombat: Annihilation and The Butterfly Effect 2. Yeah this is going to be painful talk about.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "This movie was definitely not horrible... However, for the creators of the conjuring this is simply disappointing. It was still scary in all, but didn't make much sense...",
      "total_reactions": 0,
      "user": "youlouz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Annabelle quizá no se convierta en la mejor película de terror del año (2014), pero no se puede negar que logra sacar unos buenos sustos.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "annabelle is an entertaining film but it is not scary in any sense of the word except for two scenes and the lead in the film is an awful actress",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Annabelle is a failed horror movie that has jump scares a terrible plot and terrible acting.There is though one good scene in particular but besides that there is nothing to be found here.",
      "total_reactions": 0,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Great movie but different. Thought it was going to be like the chucky franchise but no Annabelle hardly talked in the film. Interesting plot. Great actors. One of the favourite horror movies I watched.",
      "total_reactions": 0,
      "user": "Maddison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "Ainda bem que não criei muitas expectativas pra esse “Annabelle”, caso contrário a decepção seria um pouquinho maior.",
      "total_reactions": 0,
      "user": "felipescavo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "An average kind of horror story, 'Annabelle' is a prequel to the far superior 'The Conjuring' from last year.",
      "total_reactions": 0,
      "user": "inamor417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "It's a paranormal activity movie involving a doll as the center of the suspense. The movie is neither original nor extraordinarily clever. But, it does get the job done for those whom enjoy jump scares and horror with the idea of demons and demonic possessions.",
      "total_reactions": 0,
      "user": "BeingNickDoh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "We could chat all day about how \"Annabelle\" lifted (even stole) bits from better films. But, that would take away from the net effect of this evil doll movie. \"Annabelle\" is a very good horror film, originality be damned.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This was a fantastic movie! Why this movie has a low rating I might never know, but I love this film! It's one of my favorite horror films, and I even have the poster in my room. Watch it, you won't be disappointed",
      "total_reactions": 0,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "It is an article of faith in moviehouses, if not in the various houses of the Lord, that demons are always clamoring for your mortal soul. Hollywood has never adequately explained what exactly these fiends mean to do with it. Presumably, our human essence is packed with unholy phytochemicals that the demons need to survive, like some supernatural form of kale.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 1,
      "text": "Annabelle is a horribly acted, boring, unoriginal, incoherent mess of a movie that isn't even scary. Avoid at all costs, do not waste two hours watching this.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "This movie starts off so strong and the acting is quite good, however about half way through it takes a downward turn. The cameras filming seemed to be switched for cheap handhelds, the scares become laughable and the plot just isn't that interesting. Annabelle could have been a modern horror classic but became a dull repeat of what has been done before.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "Annabelle was overall, an okay movie. Except, just like a lot of movies, the movie was nothing like anybody expected. The movie trailer made the movie seem like a really scary horror movie, but in reality, I personally didn’t think that the movie was scary at all. I won’t go as far as to say that I didn’t like the movie, because I thought it was a pretty good movie, it was just nothing that I wanted it to be.",
      "total_reactions": 0,
      "user": "oopsies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2016
      },
      "score": 0,
      "text": "Asco de película. Creo que teniendo la fama de \"El Conjuro\". quisieron hacer este intento de secuela tan horrible. Todavía Chucky es mejor que esto, realmente todos teníamos expectativas buenas, pero terminó por darme risa en lugar de miedo, trama horrible, la muñeca nada que ver, horrible, realmente desagradable.",
      "total_reactions": 0,
      "user": "idontknowher"
    }
  ]
}