{
  "mc_avg_user_score": 6.9,
  "mc_metascore": 73,
  "mc_mixed_rating_frequency": 20,
  "mc_movie_name": "Arbitrage",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 53,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 100,
      "summary": "Hitchcock called his most familiar subject \"The Innocent Man Wrongly Accused.\" Jarecki pumps up the pressure here by giving us a Guilty Man Accurately Accused, and that's what makes the film so ingeniously involving."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 91,
      "summary": "The film doesn't turn its issues into a glorified essay, but it does use them to give the audience a vital emotional workout."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 90,
      "summary": "Jarecki puts the veteran actor to brilliant use in the insanely gripping Arbitrage."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 88,
      "summary": "It's instructive to note what a killer actor Richard Gere can be when a movie rises to his level. Arbitrage is such a movie, a sinfully entertaining look at the sins committed in the name of money."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 83,
      "summary": "Arbitrage is a classy soap opera with a charismatic louse at its center, without \"Margin Call\" didactics, or the misplaced empathy of \"The Company Men.\""
    },
    {
      "critic": "David Cox",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "You've seen it all before, but lead Richard Gere drenches the proceedings in the old razzle-dazzle."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Unfolding in somber tones and among hard surfaces, Arbitrage has the slickness of new bank notes and the confidence of expensive tailoring."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Writer-director Nicholas Jarecki squarely lands that punch, creating a tense and chilling horror story for financially fraught times."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "\"Just One More Chance,\" Billie Holiday implores on the soundtrack. The nice paradox of Arbitrage is that we're interested to see whether Robert gets one, even though he's the villain-in-chief of a suspense thriller whose plot turns on generalized scurrilousness. That's a tribute to Mr. Jarecki's smart writing, and to the take-no-prisoners performance of Mr. Gere."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Surprisingly entertaining, probably because it uses Wall Street shenanigans and schadenfreude as the backdrop to a crime drama."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Gere is being talked about as an Oscar contender - he's never been nominated. January is a long time off yet, but his name is certainly worth putting on the long list."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Amazingly, Gere keeps it all together, via a kind of seething anti-rage that speaks reams to the character's survival instincts."
    },
    {
      "critic": "Michael Atkinson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Slick and grown-up as Richard Gere himself, this intricate fiscal thriller takes a dead bead on extreme privilege."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Nothing about the plot is novel, but the film easily maintains a low simmer that picks up in the final act, as Miller has to fight to keep his sinking ship staffed."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Between this cast and the conviction Jarecki brings to the table, the film feels incredibly accomplished for a first feature."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "As many of the most memorable and darker thrillers have, Arbitrage plays with affinities in order to completely confuse the drawing of any clear lines between good and evil, criminal and executive, skilled pro and callous cad."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Arbitrage is actually a fairly straightforward thriller in the John Grisham vein. It doesn't demand that the viewer know the difference between a hedge fund and a hedgehog. Arbitrage also reminds us that thrillers do not have to be action-packed to generate tension."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "There are few cinematic pleasures as satisfying to behold as an actor in a role that fits him like a Savile Row suit. Richard Gere offers just such gratification in Arbitrage, a silky, sophisticated Wall Street thriller that finds the actor utterly in his prime, wearing his age and accumulated emotional wisdom with warmth, charisma and nonstop appeal."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Despite an abrupt ending and the worst title of the year, Arbitrage manages to leverage real tension from its veteran stars in one of Hollywood's first pedigreed films of the fall."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Arbitrage is never the nail-biting thriller that it could have been."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "More seriously, Jarecki never quite pierces the skin of this world, capturing its shiny and grimy surfaces but failing to immerse us in its flaws; too often it's like flipping through a magazine story on the lives of the rich and corrupt."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "In the end, Arbitrage disappoints a bit. The writing isn't as sharp, or sophisticated, as it needs be. And the cynicism exhibited by Miller and the circle of traders and tycoons he moves in seeps into the fabric of the story itself."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Part \"Law & Order\" morality play, part \"Wall Street\" with a dash of the more recent and topically pertinent \"Margin Call,\" Arbitrage hums along, complicating its narrative without tying itself in knots."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "Between Gere matching wits with a police detective played by Tim Roth, and Gere having to explain himself to the steely Sarandon, Arbitrage is never dull."
    },
    {
      "critic": "Glenn Heath Jr.",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 75,
      "summary": "If the film covers well-tread territory (a morally bankrupt player trying to prolong his own influence), it does so with pinpoint control of mood and theme."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 67,
      "summary": "There's a touch of Hitchcockian flavor to the Arbitrage's cat-and-mouse thrills, yet the film clearly announces that there's now a third gifted Jarecki brother (in addition to Eugene and Andrew) to contend with in the moviemaking business."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "Arbitrage is a breezy watch, with good performances that don't cut very deep and an eye for décor but little interest in what it's decorating. What's missing, really, is outrage, or a sense of the 99 percent."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "Even at his worst - and Robert does some awful things - the actor almost makes you root for him, hoping he'll get away with it."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "As much as Nicholas Jarecki’s debut feature simmers, it never quite boils."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "Though it teeters at times on the edge between potboiler and melodrama, Arbitrage benefits from a notable lack of sympathy for Gere's Gordon Gekko-like Miller. Rather than seeming pat, Jarecki's straightforward cynicism is pointed and purposeful."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 60,
      "summary": "Gere does his best to give Arbitrage an agitated energy, but Jarecki's fatalism works against the film."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Every episode of \"Law & Order\" I've ever seen has a more complicated and plausible plot, punchier dialogue and more New York authenticity, all in less than half the time consumed by this poky would-be finance thriller."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Instead of digging into the psychology and morality of greed, Mr. Jarecki only glances and lectures in that direction before piling on a lot of melodramatic complications, including a death, an investigation and a cynical detective (Tim Roth). These days, it seems, the illegal manipulation of hundreds of millions of dollars simply isn't enough to incite moral outrage."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "Features an exceedingly dapper Richard Gere in a series of nice suits and handsome close-ups that serve no purpose other than to remind us how exceedingly dapper Richard Gere looks in nice suits and handsome close-ups.\r\nThe rest of the movie registers as a loss of: time, money, talent and logic."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "On the positive side, this film has strong acting, stylish directing, impeccable production values. The individual scenes are very well written and the dialog is crisp and authentic. On the negative side, Richard Gere's character has no redeeming value and is hard to embrace as an audience member. He is a man without a shred of moral duty or a sense of right and wrong. So it's difficult to become invested in a character who is so utterly repugnant. He could very well be accurately drawn, but so could a well crafted oil painting of a maggot.",
      "total_reactions": 3,
      "user": "hsg9000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "What a disappointment! Considering the cast -- and the start of the film -- I was expecting a smart, edgy tale of corrupt financiers gone amok in the Big Apple. What I got was yet another melodrama about a middle-aged slickster whose affair with a younger woman takes a tragic turn, and his machinations to avoid the consequences. It's been done better by everyone from Adrian Lyne to Woody Allen. Actually, it's been done better on TV series like \"Damages.\"",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "What can I say? I like Richard Gere. He's the man. And with all pistons fired he is phenomenal on screen.",
      "total_reactions": 1,
      "user": "SantiagoMAKiiNA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Jarecki definitely achieves a dramatic tension that many thriller directors and writers struggle to capture but unfortunately he falls short with his choice of audience placement. In a brave move, Jarecki has not only positioned the audience with a man who is essentially the unlikeable, guilty party, but he",
      "total_reactions": 1,
      "user": "libbycritiques"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Works well in that it makes you root for a completely unsympathetic character. Richard Gere is superb and largely to thank for that. A solid thriller.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "What we have here is Richard Gere being cool and looking stylish is expensive suits. The plot is awfully mundane- and frustratingly morally ambiguous, but the actors are very good here- and more importantly Arbitrage is believable. It doesn't feel like watching a movie.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "This is perhaps one of the worst films of the year.  The script is poor; the ending is non-existent; Susan Sarandon flounces around in ill-fitting and unbecoming clothes.  Were Richard Gere no a handsome man, this film would have gone immediately to video.",
      "total_reactions": 2,
      "user": "CarolG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "A tight script, good performances from Gere, Roth, Margolin. A Bernie Madoff type trying to stitch up his financial empire and life before it unravels. Will this slick Willy get caught or will he be able to dodge the consequences by browbeating, bullying, mesmerizing his way out of serious trouble? Yeah he reminds us of Gecko, and he's nothing like Bernie except in life style, in fact compared to Bernie he's a lightweight multi- millionaire. But he runs into the integrity of two people he can't shine the shoes of: his daughter, who won't go down with him and a wannabe middle class Black kid who is so tied into loyalty, gratitude, and guilt that he's very reluctantly willing to sacrifice himself. It's worth seeing if just to see a Master of the Universe walk the high wire over his own demise.",
      "total_reactions": 1,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Disappointing: expecting much more in terms of story. Could've have done without the mistress. Plenty of tension and complications could have been built entirely around deceptions and fraud and resultant tensions within family and relations with/negotiations with/deceptions of employees and tentative business partners. I expected far more info regarding how such fraud works. In movie critics' reviews saw that \"Law &Order;\" mentioned several times: this movie seemed like a more highly financed episode of L&O.;",
      "total_reactions": 1,
      "user": "warfield"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Very satisfying movie. Solid acting by the cast that features an enjoyable and entertaining story that keeps you interested in it from start to finish. May not be perfect but I'd still recommend watching it. It's just an overall good film.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "\"Arbitrage\" stars Richard Gere as Miller an immoral business tycoon (is there any other kind?) and Susan Sarrandon as is dutiful wife (is there any other kind?) and how theirs lives seemingly come apart after an accident that could lead to a homicide charge against Miller. Much like we watch people's lives unravel on Oprah or Springer, we are mesmerized as we watch Miller betray anyone",
      "total_reactions": 1,
      "user": "jimboesq"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "Starting with his supporting role in",
      "total_reactions": 2,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "I loved this movie. Richard Gere's character has a dream life, he has it all, and it is all collapsing around him. I felt real dramatic tension as this story unfolded and it had surprises along the way. I found the ending to be stunning. And where did Nate Parker come from? That man can act and does an incredibly real performance as the story pivots on his character. The film looks great too, New York has a supporting role.",
      "total_reactions": 2,
      "user": "MartinX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "WHAT IS ARBITRAGE?  While the definition of the word is appropriate for the shrewd transactions conducted by Richard Gere in this film, a better title with a more commonly used word might have been better.  But then, the abrupt ending killed all hope for ARBITRAGE.  Potentially a great movie with lots of suspense, it is an absolute letdown during the last three minutes.  If the Directors and Producers could take it back and redo the ending the film would be destined for unique greatness.",
      "total_reactions": 1,
      "user": "JerzeeGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This is a portrait of a man and a milieu, not a didactic, finger-pointer; and as such, as showing the story, not just telling us how to think,  the film works beautifully. I felt convinced by it, saw it as a compelling and timely",
      "total_reactions": 0,
      "user": "juderobe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Sometimes there comes a director with so much skill that it's like watching a jet fighter pilot putting his plane through its paces. Add terrific acting from every character, a riveting script, beautiful cinematography, and you have a solid \"10\".",
      "total_reactions": 0,
      "user": "Taplinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "This film will keep your interest, but it drags in places, makes you wonder about the poor choices of the main character, and sort of ends with a plop.  I expected a better film.  That said, a recommended rental.",
      "total_reactions": 0,
      "user": "DTDunn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Between stylish directing and wonderful production, Arbitrage is memorable as Nicholas Jarecki's debut and one of Richard Gere's finest acting performances to date.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "It`s a decent movie but the problem is it`s hard to root for anybody. Only one character I cared about, but he was not in no lead role. It`s worth watching but nothing ground breaking about this movie",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Richard Gere gives possibly his greatest performance in \"Arbitrage,\" a film that makes a home within suspense, intrigue, and a widely overarching sense of intricacy.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "A second rate entertainment masquerading as an A list movie. Arbitrage is like a routine episode of a low grade tv drama series complete with an ineffectual detective here played by Tim Roth. Richard Gere seems to be forever walking somewhere, and Susan Sarandon is quite frankly wasted aside from the last confrontational scene with Gere which is probably the best scene in the film. The abrupt ending just reinforces just how futile the whole enterprise is.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "So shocked at some of the poor reviews here! The movie is excellent. It is a classic thriller. The young actor playing Jimmy is brilliant, the next Denzel Washington!",
      "total_reactions": 0,
      "user": "Roadstar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "This a prime example of stylish drama that likely appeals more to mature audience. The characters are believable and acting is as steady as the credits suggest. Best of all, the moral of the story is that there isn't any.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is based off its fantastic performances.  Richard Gere gives one of his best performance's  striking the right balance between likable and unlikable. I also really enjoyed the performance of Tim Roth.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "IN MY OPINION **MAY CONTAIN SPOIILERS** by CtheTav This film grew on me from the moment I sat down to watch it. Going in I haven't seen any reviews or plot synopsis for this film so I had no clue what it was about. Turns out its the following. Richard Gere seems to have everything loads of money and a mistress on the side, a family who love him and success. It turns out this is all a lie. He's nearly bankrupt his company and needs the merger to go through to get away without anyone noticing. Add to this the fact that he has accidentally killed his mistress and needs to cover this up to get his company sold. Few what a week. This film ends on one of the best cliff hangers I have seen in years with Gere stuck between a rock and a hard place, but I feel the character is strong enough that the internet will be able to work out what he would most likely do, I know what I would do if I was him. The acting is excellent throughout the story moves along at a brisk pace meaning the 2 hours fly by. The story asks the question what you would do to save yourself. The writing was so good I found myself caring about Jimmy (an accomplice of Geres') and whether he would cave under the pressure. Rating 9 out of 10 A great thriller setting an example for others to follow whilst staying true to its roots",
      "total_reactions": 0,
      "user": "CtheTav"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Arbitrage is a generic Richard Gere thriller that seems a bit unfocused and scattered, but somewhat comes together in the end. It's predictable, melodramatic, but the acting is pretty good, as many stars are in this one (Gere, Sarandon, Roth). The story veers off course in the middle parts and starts to get away from Gere's character, even though this was a path the movie shouldn't have taken. Overall, the film is average. Only watch it if you like Richard Gere enough.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Richard Gere's hedge fund magnate Robert Miller is a studied personification of post-2008 \"big finance\" excess and moral turpitude. The movie's point is a wearily familiar truism: there will be no justice for powerful rich people, regardless of the scale of their crimes. What debut director Nicholas Jarecki succeeds in accentuating - with the help of Gere's perfectly judged performance - is the role that charisma and intelligence, rather than just naked economic power, play in maintaining this depressingly destructive cycle. A terse and effective thriller with an excellent supporting cast including Susan Sarandon.",
      "total_reactions": 0,
      "user": "liquidlunch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "I don't normally watch business thrillers, so it was a little challenging to follow what was going on for the business side of things.  However, once all the pieces fall into place, it's actually a very satisfying story. The main character is definitely not an perfect guy, but he has some surprising good points.",
      "total_reactions": 0,
      "user": "tethysdust"
    }
  ]
}