{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "Arthur Christmas",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 84,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 91,
      "summary": "The action is swift and witty, and the 3-D effects are imaginative and not simply tacked on as with so many animated movies these days."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 90,
      "summary": "Leave it to the folks who brought us \"Wallace & Gromit,\" \"Chicken Run\" and \"Flushed Away\" to bring a delightful blast of fresh air to the conventional Christmas genre. Aardman's Arthur Christmas is that and more - an endlessly amusing 3D, CG-animated Yuletide romp with lively innovation at every turn and a dream voice cast headed by James McAvoy, Hugh Laurie and Bill Nighy."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 85,
      "summary": "Arthur Christmas is a Grinch-style story of rekindled Christmas spirit told from inside Santa's compound at the North Pole."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 83,
      "summary": "The resulting adventure, like most of Aardman's work (Chicken Run, Flushed Away), is more clever than outright funny, but it's also genuinely sweet, and the complicated relations among Santa's clan are surprisingly believable."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 83,
      "summary": "Arthur Christmas gets a little sappy toward the end - it is a Christmas movie, after all - but it otherwise strikes just the right combination of naughty and nice, reverent and irrelevant, holiday-sweet and Aardman dry."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "It would be a Christmas miracle save for one lump of coal: an ear-shattering Justin Bieber song over the end credits. Gotta sell something to the kids at Yuletide."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "The real draw of Arthur Christmas is simpler: It's really funny."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "A great, big joy. Even if you're a bit bah humbug, just delight in the supremely clever Aardman comedy."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 80,
      "summary": "Arthur Christmas embraces this unconditional faith and rewards it with creative explanations and a brisk computer-animated adventure clever enough to become essential yuletide viewing."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 78,
      "summary": "Sarah Smith pulls the various threads of this wholly original – well, as original as can be reasonably expected given the thousands of cinematic iterations Christmastime has provoked over the years – together into a very coherent, visually stunning, oftentimes laugh-out-loud hilarious holiday film."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "For the kids, the action is always lively and, for the rest of us, the dialogue has a witty and even caustic edge."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "When it comes to Christmas movies, although most are quickly forgotten, a select few go on to become touchstones, beloved and re-watched by families year after year after year. Arthur Christmas may have what it takes to join the latter category."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "Arthur is sort of a dull hero, but the grandfather is classic, hilarious Aardman -- a thoroughly British eccentric prone to weird nostalgic/fatalistic utterances."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "This is a world where training wheels are called \"stabilizers\" and where children leave something called \"mince pies\" for Santa. (Um. Ew?) As a result, the occasional line will fly over your little ones' heads. But you can also expect for them to be charmed by it all."
    },
    {
      "critic": "Trey Graham",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "The film does have a distinctly British cheek; even with a Sony Pictures co-credit over the titles, it's just un-Hollywood enough to feel like a breath of fresh North Pole air."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "A worthy addition to the Christmas movie canon. It's funny and good-looking, with an impeccable voice cast of U.K. actors. It's also unexpectedly fresh, despite the familiar-sounding premise."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "There's nothing dark about Arthur: It's as bright and twinkling as a Christmas tree, decked with warmth and humor."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "Crisply shot and voiced by a legion of Brits, the animated Arthur seems aimed at the Scrooge and caroler in all of us."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "The film's indefatigable holiday spirit is infectious."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "A tender and upbeat spirit informs the writing and the execution."
    },
    {
      "critic": "Jody Mitori",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "Arthur Christmas stays sweet without becoming overly sentimental and is filled with sly details and smart action sequences."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "In a genre - the animated holiday film - already overflowing with the sentimental, the silly Arthur Christmas is a most welcome treat to find stuffed into the cinema's stockings this holiday season."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 75,
      "summary": "A yuletide fable that boasts Aardman Animation's peerless mix of whip-smart comedy and cheery heart."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 70,
      "summary": "Arthur was made, in co-production with Sony, by Aardman Animations, the U.K. company best known for Nick Park's Wallace & Gromit shorts, and the character animation has some of the same homely charm."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 63,
      "summary": "Watching Arthur Christmas is like doing your holiday shopping on Dec. 23: fun and frantic, exciting and maddening."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "All of the actors' vocal performances are spot-on, including McAvoy's gentle Arthur, Nighy's salty GrandSanta and Ashley Jensen's cute stowaway elf Bryony, a chipper little pixie that would make Rudolph's pal Hermey proud."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "The plot may be a little too cluttered for the toddler crowd to follow, but the next age group up should be amused, and the script by Peter Baynham and Sarah Smith has plenty of sly jokes for grown-ups."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "Arthur Christmas is not ultimately a cynical movie – it comes together sweetly and rather movingly at the end – but it springs forth from a place of cynicism."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 60,
      "summary": "Aimed at kids, Arthur Christmas could be a little trying if you're over 10, but if you want an easygoing flick to get you into the mood for the holidays you could do a lot worse."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie fails utterly at coming up with a story that merits all the eye candy."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 50,
      "summary": "The plot, though, is recycled from the Vince Vaughn comedy \"Fred Claus\" (Santa's duties are assumed by a goofy relative, in this case son Arthur) and the old Rankin-Bass special \"Rudolph the Red-Nosed Reindeer\" (Arthur goes on a rogue expedition with a couple other misfits)."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 12,
      "summary": "Ho-ho-huh? Arthur Christmas is an animated kiddie comedy that delivers all the wonder you'd expect in a movie about a guy delivering one package. Maybe they should have called it \"UPS Man: The Movie.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "This movie just entered our family's Christmas rotation. Really fun movie that has something for everyone in the family. If you're looking for a lighthearted break from the holiday stress, get lost in this hilarious tale of Arthur, a child-at-heart dreamer who wants every child to experience the magic of Christmas. Well done. One of the few movies I'll actually buy when it's released on DVD. Merry Christmas!",
      "total_reactions": 2,
      "user": "tallmanwriting"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "The Aardman animators (best know for Wallace & Gromit) usually infuse their films with deadpan whimsy and eccentric personalities. This is an exception. The story takes place on Christmas night when Santa and his team have one last present to deliver. Leave it to the eponymous black-sheep son to come into his own and save the day. While the pacing is frantic and almost every frame is full of activity, the characters aren't especially unique and the writing isn't particularly clever. I really wanted to like it, but found it flat and lacking personality.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Being a big fan of Wallace and Gromit and Chicken Run I had to see this film.  I enjoyed it, although not as much as the critics.  There really were no big laughs, but there are many small ones.  The most impressive thing about the film are the visuals, and the 3D is top notch as well.  The worse part of the film is that most, if not all of the characters have an English accent and my friends and I couldn't decipher some of the things they said.  I also noticed kids getting restless in the theater, so this might be hard for younger kids to follow.  Before the movie I had to suffer through a Justin Bieber video who is trying to be a cross between Justin Timberlake and Michael Jackson, but with a much worse voice.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The movie somehow works for adults, the constant gags involving spec ops elves and the logistics of billions of gift deliveries keeps the movie entertaining. Im ddocking 2 points because there's a Justin Bieber music video before the movie. First I've heard his music and it shook my faith in humanity, kid can't sing.",
      "total_reactions": 0,
      "user": "Gene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "The folks at Aardman Productions (Wallace & Gromit; Chicken Run) have done it again with this hilarious, cleverly written, dazzlingly animated Christmas charmer about Santa's two sons - muscle-bound technocrat Steve (Hugh Laurie) and mild-mannered dreamer Arthur (James McAvoy) - and how one of them (the title may give you a clue) saves Christmas for one little girl.  This may be one of the most visually thrilling 3-D movies ever made, but even in good old 2-D you'll have fun with the very funny screenplay by Peter Baynham and director Sarah Smith, as well as a fabulous cast of voice actors including standout turns by Jim Broadbent as Santa, Bill Nighy as patriarch Grandsanta, Imelda Staunton as Mrs. Claus, and Ashley Jensen as the plucky elf Bryony, who proves herself useful for far more than just wrapping gifts.  This one is a delight for all ages and sure to be a Yuletide favorite for years to come.",
      "total_reactions": 0,
      "user": "Winstonoboogie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Overall this is a really enjoyable film. The characters are likeable, the story is clever, and the film looks nice. It may not be in the style of an Aardman film but it is still enjoyable. I hope Sony Pictures Animation appreciates Aardman because they are good studio. While this is may not feel like Aardman’s other work it is still enjoyable and I will take this over Sony Pictures Animation’s own films such as Cloudy With a Chance of Meatballs any day. If you are looking for an enjoyable holiday film, a good animated film, or just sort of any enjoyable movie then definitely check this one out.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "It's nice to see a movie that captures the Christmas spirit like this one does. It might just be a new Christmas classic. Either way it's a fantastic movie to watch during the Christmas holiday.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Arthur Christmas does just what a really good Christmas film should - it keeps you absolutely glued to the screen and makes you feel all warm and fuzzy inside. It's expertly animated, slightly satirical, with strong morals and a great voice cast. While everyone gives their all in their vocal performances, of particular note are Hugh Laurie's efficient and coldly business-minded Steve Claus, Bill Nigh's ancient, senile and mischievous Grand Santa and Ashley Jensen's energetic and confident gift-wrapping elf Bryony. The story carries you along nicely, providing a fair amount of visual pizazz, action and humour along the way. Where Arthur Christmas really shines is in the festive message it promotes. The importance of unconditional family love is a common one in Yuletide movies, but somehow it comes across all the more effectively when the film's subjects, the Clauses are an undeniably dysfunctional, fantastic, yet strangely relatable family. Grand Santa is well past his sell-by date, but is not willing to give up the joys of life, or pass up an opportunity to show the younger generation how a job should be done. The current Santa (Jim Broadbent) is good-natured, but a little incompetent, and has never found the time to engage in any real way with his sons. Steve is desperate to do the best job possible and prove himself to be worthy of taking over the family business. Arthur, on the other hand, while inept, clumsy and generally being quite odd, is the only one in the family who seems to still understand, and truly care about the festive season, and what Father Christmas means to children all over the world. The real question is whether he's wise beyond his years or simply naive. The internal struggle within the family is essentially a battle between idealism (Arthur) and pragmatism (Grand Santa, Santa and Steve), and as a result, the film questions what modern Christmas is. Is it simply soulless commercialism, or is it something more? With these deep messages, as well as the simpler joys it provides, Arthur Christmas is certainly something special. It's just a lovely experience that will warm you to your very core, like a mince pie and a glass of mulled wine in front of the fire.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Its a joy full ride with santa and specially with arthur who makes the movie funny and adventurous. The movie is very interesting and a very happy family movie. It will make your christmas more magical and watch if something may be left near your christmas tree. Overall a beatifull animated movie. So merry christmas to all of you and wish all a happy and prosperous New year.",
      "total_reactions": 0,
      "user": "NEEBOND"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Great animation let down by a simple and predictable plot. No villain to speak of so I never felt there was any danger or real point to the story. Looked great, but insubstantial.",
      "total_reactions": 0,
      "user": "DukeJon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "good flick for kids and adults alike, as i guess most animated films are geared toward nowadays. a very technology-driven delivery of goodies to the good and even bad kiddies.",
      "total_reactions": 0,
      "user": "love_sick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Despite the fact that Aardman haven't done a proper computer animated feature in a while (Flushed Away, 2006) and it almost crippled the company financially when it bombed, they seem to have pulled off one of the best animations of the year. Arthur Christmas looks fantastic, its got a great voice cast, it's genuinely funny and it works as both a kids and a grown up film. The story is one of the people that work in the north pole. Its the tale of the clumsy Arthur (James McAvoy) who discovers that ,despite the well oiled nature of his families present delivering operation, a child has been missed. The rest of his family doesn't think it matters so Arthur heads out with the only two people on his side, his grandfather (Bill Nighy) and a wrapping department elf (Ashley Jensen). Because its a kids film they get into the usual highjinks but the film never loses itself with its message being one of optimism while maintaining the fast pace and quick wit with both visual and spoken gags being used to great effect. Its thoroughly enjoyable because it captures the spirit of the season while also making fun of it slightly. It gets you in the mood for the holidays and that's what its supposed to do.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "It's another Aardman film, what's not to like? sure it's not up there with Wallace & Gromit or Chicken Run, but it's better than Flushed away.  The story is nice, meaningful and relatively heartwarming; which is always good for a Christmas film. Some of the jokes may fall a bit flat, but that's not really much to complain about, I haven't seen anything where some jokes don't. I recommend this film to anyone wanting a fun Christmas film.",
      "total_reactions": 0,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Arthur Christmas is different from any Christmas movie you will ever see. It makes you wonder how Santa Claus really delivers presents. A fantastic story is at the heart.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "This was a wonderful Christmas movie for the whole family.   My teenage sons loved it and my wife and I loved it more.   It is such a funny fast action comedy,  we are already talking about getting the dvd to watch it again to see the parts we missed due to laughing too much.   Highly recommended.",
      "total_reactions": 0,
      "user": "cwbrady"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "If most of the animated film these days seem to emphasize on milestones about animation, set this aside. Arthur Christmas is sincere in its storytelling. It has this humble effort to simply tell a story on how important it is to make children happy and not sitting back in times someone gets left out. The voice talents are commendable especially voices for Grandsanta and Bryony. It would even deserve a \"voice ensemble\" nomination if such a category exist in the Annie. This movie will bring to life the child in you. movienotesbook.blogspot.com",
      "total_reactions": 0,
      "user": "aozeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "I was very encouraged to find this site. I wanted to thank you for this special read. I definitely savored every little bit of  it.",
      "total_reactions": 0,
      "user": "amydevid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Not real great. Was definitely expecting more after reading the reviews. Took my 5 year old who opted to watch this over the Muppets! Was wanting a warm holiday film filled with nostalgia and familiarity. Instead it was a British film filled with unfamilir scenery, sometimes hard to understand accents (especially for my little one) all the elves had blackberries, and Santa drove a spaceship (not a spoiler b/c this is the first scene!)! Not what I think of when I think of Christmas. It also lacked substance and I was bored. I didn't even giggle once and my son didn't either. Skip this one. Wait next for next year when it comes out on cable! I did like that it was 3D.",
      "total_reactions": 0,
      "user": "showny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Aardman have a definite appeal to their audience.  It all comes down to the fact that their films are both intelligent and silly in the same time. There are scenes in this movie which revolve around wit and multiple viewings are highly recommended to try and get all the in jokes. This could be the next Christmas classic....its just so happy. It becomes a bit dull during the middle act and some jokes doesn't really work, but the ending much more than compensates to that.",
      "total_reactions": 0,
      "user": "Jefflyn90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "An entertaining movie suitable for families wanting to bathe in the Christmas season. The movie's animation is  well done and utilizes some very imaginative elements. Although there are some logical plot holes, the kids will surely miss them. Arthur has its moments and laughs. But the thing that bothers me the most is that when you near the end, it feels as though the writers slapped on material to progress the film. This is exemplified by Arthur, who \"discovers\" the moral of the story, even though he had been preaching it since the start.",
      "total_reactions": 0,
      "user": "Aqueous"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Wonderful family film, lots of laughs, great characters and a nice spin on the Christmas mythology.  Animation is decent; a tad too long, but provides more entertainment than the other animated films this year.",
      "total_reactions": 0,
      "user": "MikeRG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "The lone Christmas movie of the year turns out to be one of the best made.  Though it may look overly silly Arthur Christmas has quite a lot of depth to it that many animated Christmas movies never come close to achieving.  The movie takes us into the world of the Clause family where the role of Santa is passed down from generation to generation.  When Santa fails to deliver one present to one little girl, Santa's son Arthur sets out to deliver the present with his old and rather looney grandfather, the former Santa.  The 3D effect used here is amazing and it helps to immerse the viewer in magical worlds of flying animals and winter wonderlands.  Its well worth the surcharge in my opinion.  The voice acting is spot on as well lead by James McAvoy as Arthur.  However what truly makes this film wonderful is its charm and its wit, and there is plenty of it.",
      "total_reactions": 0,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "The 3D, CG-animated family comedy Arthur Christmas, an Aardman production for Sony Pictures Animation, at last reveals the incredible, never-before seen answer to every child's question: 'So how does Santa deliver all those presents in one night?' The answer: Santa's exhilarating, ultra-high-tech operation hidden beneath the North Pole. But at the heart of the film is a story with the ingredients of a Christmas classic - a family in a state of comic dysfunction and an unlikely hero, Arthur, with an urgent mission that must be completed before Christmas morning dawns.",
      "total_reactions": 0,
      "user": "allmovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "Now this is what i was waiting for, a new High-tech Santa Claus/Elves. This one has deep emotions and heart warming and touching feelings to it and at the same time is a story well told in a non traditional way for the good ol Christmas that doesn't feel cliched at all. Superb visuals and everything and you will have a good time.",
      "total_reactions": 0,
      "user": "khan2705"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Arthur Christmas is a really good movie. It's funny, its got good music (like most films), a good and well thought out plot, good characters and great character building (it lets you know what they're like, properly). It's not as good as other aardman films, except from flushed away, it's better than that. Well done aardman, you've made another great movie!",
      "total_reactions": 0,
      "user": "skyminster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "I was surprised, I actually liked it. The reasons I liked it is it gave off a real Christmas feeling, had some silly ideas of how Santa gets his job done, plus it was original. Most Christmas stories are about the same. A good movie to add to the Christmas Collection.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Pretty much the best animated Christmas movie in recent years. It doesn't do very much that hasn't been tried before, but it does ooze with charm and Christmas spirit.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "It's admittedly cringe-worthy at times through a rehashed message on the importance of Christmas spirit, but that is completely mauled over by the unstoppable tide of hilariously crafted characters. Perfectly encapsulating a locked -antlers family over the Christmas holidays...this is probably my favourite Christmas movie, and with an overly clichéd message, that's quite the achievement.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This film was a real surprise.  I thought this would just be another stale Christmas movie, but I thankfully thought this movie was funny and had a lot of heart.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "It's a delightful Christmas tale with magical wonder, but it's story telling is just not that powerful. with a similar plot line to many told before, its can dazzle you with visuals, and give you a few moments of heart, and only really succeeds when its the winter holidays time of year. But don't get me wrong, I still found it enjoyable, and I would recommend it to those who appreciate the bountiful beliefs of Santa Claus.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "The movie is a great family movie for Christmas. It has great animation, good voice casting, fun action and comedy, and a heart-warming storyline. They even made Justin Bieber's \":Santa Clause is Coming to Town\" song sound O.K. during the end credits.",
      "total_reactions": 0,
      "user": "jacob4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "a very good Christmas film and yes it is the best animated film of 2011. but its a little overrated. the film was a good old vs. new story and does not side with one or the other but that alien sub pilot was maybe a bad idea.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Another Christmas movie blending in animation to enjoy for everyone and elves. Arthur Christmas is a lovable Christmas movie to enjoy at any age, any time, and anywhere.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "The problem with christmas movies nowadays, atleast for me anyway, is that they never seem to properly capture the spirit of christmas. Thankfully, Arthur Christmas succeeds in doing that. This is a very fun and enjoyable adventure with a funny script and some great comedic timing. It also addresses how christmas isn't like how it used it be. With lots of companies milking up the holidays, it isn't about the family or the spirit anymore, and this movie addresses that in such a hilarious way. The Santa in this movie is not like the Santa that you remember. He doesn't really do that much, instead he has hundreds of elves that enter the houses simultaneously and just drop everything off, and he is just the face of the company. Meanwhile, we have Grandsanta, who complains that his son has gone too commercial. He was by far the funniest character in the movie. Arthur is the protagonist, and is Santa's son. He is such a caring person with an optimistic attitude that did get annoying at times, but overall he is a great character that makes you want to pat him on the back. Steve is Arthurs brother who is the likely replacement of Santa, but i thought his character was rather pointless to be honest, and i didn't really care about him. There is a moment where i thought the film dragged just a little bit, however the last fifteen minutes of this movie make up for that as they're very intense. Overall, Arthurs Christmas is a great movie not just for kids, but also adults. It succeeds in capturing the christmas spirit, and i'm going to give it an 8/10.",
      "total_reactions": 0,
      "user": "ThreeboxIndoors"
    }
  ]
}