{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 24,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "Assault on Wall Street",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "An hour of these repetitive, predictable disasters should wear down all but the most bailout-hating viewers."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "Uwe Boll's insistence on plugging genre tropes into his imagined idea of populism returns us to the same cynical place as Postal, except with none of the sizzle."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "It's not the worst idea for a revenge fantasy, but Jim's payback is so lacking in logic and reality, not to mention tension, that it proves more laughable than cathartic."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 16,
      "summary": "What’s obnoxious is that it’s never in doubt where Assault On Wall Street is headed, and it seems to believe there’s a certain poetry to taking its time turning Baxford into a non-verbal Travis Bickle."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "At first: I hate Uwe Boll for what he usually does and creates  with a passion. BUT this movie was actually pretty interesting and decent. Believable characters, interesting story, heck even the soundtrack had something! Especially John Heard, Erin Karpluk and Dominic Purcell sold me on their characters. I have to agree that the ending is a bit \"I don't think it would be this way\", but hey the rest was  as I said  pretty decent. So as much as it hurts me, I have to give this movie a 8, because I wasn't bored a second while watching it while the ending being the only little downside of it.",
      "total_reactions": 6,
      "user": "Deeceem"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "excellent movie, hit on all points of the wall street mafia criminals who suck-up wealth from the entire American population. confiscation of Americans wealth thru printing of paper money-inflation-graduated tax system-- ensure the u.s. private central bank (federal 'reserve) get more and more of American's earnings. the terrorists live on wall street and in the fed bank and quietly kill many American's thru confiscation and theft of American's wealth. but that is ok...they usually do not use guns in your face but use computer systems and political spin. no blood on the street, so, no crime, eh?",
      "total_reactions": 5,
      "user": "fredgoddard"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This film is a nice movie, have a contemporary approach to social problems, have in mind the low budget too, you cant expect the lord of the rings with a budget like this. may sound dangerous but is a cathartic experience. A must see for reflexion",
      "total_reactions": 7,
      "user": "Mikele"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Good god man... it's an action/revenge movie. It's not supposed to get great scores... but if this is what you're looking for I give it a \"9\". Again, only if this is what you're looking for.",
      "total_reactions": 4,
      "user": "Tashy497"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Why are these type of movies even allowed to be released. Killing everyone related to certain profession because one or two of them were reason of his bad investment. Unbelievable How could people even find entertainment in watching a guy shoot random peoples?",
      "total_reactions": 2,
      "user": "S2G047"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "I wonder if people actually watch this movie before writing bad reviews  I just saw this movie, and found it to be very good. I think  what people expect nowadays is big holly wood  explosions, and computer graphics   In this movie the acting is solid, and the plot is plausible, and the ending is surprising  Truth is you owe it to yourself not to listen to paid critics  whom may or may not have an  agenda   Rate it for  yourself  you won't be disappointed",
      "total_reactions": 5,
      "user": "SRJ9098"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "It's a movie with an heartbreaking and touching beginning, where you see a realistic drop of someone who lose everything. Then, it becomes a movie full of free violence, presenting people getting killed only. The fact is, in the first and the second act, the movie tries to bring an intelligent point of view in interesting ways. In the third act, they try to brainwash you in a way too clear for me to just accept it. The part where the CEO just admits he's the bad one and that he just laugh at poor people without remorse was just too much.",
      "total_reactions": 4,
      "user": "charmedlp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "This is without doubt one of the worst movies I've ever seen. Bad cardboard acting, cliche characters, awful soundtrack, lame 80's cinematography and a ridiculous and morally bankrupt premise. This film is absolutely atrocious.",
      "total_reactions": 1,
      "user": "djnicey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Assault On Wall Street is nothing like you expect it to be, at least not until the last 15 minutes. Jim Baxford (Dominic Purcell) is a normal, hard working, family man, until his wife gets sick. Through a series of hardships Jim and his family go bankrupt, leading to an unspeakable act, that causes Jim to lose control. This film had all the makings of a terrific action movie, but that's not what we got. For over an hour, we watch the story of Jim's life slowly pass us by. What should have taken 25 minutes, takes up almost the entirety of the film, it was absolutely ridiculous! We meet Jim and his family, see what the issues are, and then, nothing for quite a while. Prison Break's Dominic Purcell stars in this thing and he is one of the best young action stars they could have gotten to star in this movie. It just really drives me crazy to see how obtuse the writers of these films can be. The lead character was cast, almost to perfection, while at the same time, you have a relatively good story to build upon, yet the film goes nowhere! By the time anything actually happened here, I was already fed up and disinterested. Assault On Wall Street looked like it was going to be a can't miss action/thriller. Instead, bad directing and perfectionist writers just completely destroy everything they have going for them and deliver a film that eventually becomes unwatchable.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Assault on Wall Street is just another action movie but atleast its a action movie with a point and message instead save some bs.",
      "total_reactions": 1,
      "user": "SilentHightimes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "I could not believe it was made by the director who is famous for his crap movies. When he had the most popular names in his kit, he gave nonsense movie 'In the Name of King'. For me 'Rampage' was his best movie though it was only okay type. I thought he could never make a better movie than that but surprised me and everybody with this. Yeah I liked it very much, the movie with not much famous actors in it which is almost a B movie. The 'Prison Break' actor gave the brilliant performance. The character like his are quite famous nowadays like one from the 'Death Race' who loses everything and go after for who did it.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "This movie makes a good point, we shouldn't let these  holes play with our money and economy. There should really be a huge hit on how much they can money they can risk. If so then we can give them a piece of our minds show em that this isn't a game.",
      "total_reactions": 1,
      "user": "DieRacher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "I was shocked. Really shocked. I can't even believe how shocked I was. The film was not terrible, nor good but actually DECENT. With that being said, Uwe has made a film that I found to be occasionally good. It had It's flaws, but after viewing this you can't help but to nod and say \"Congratulations\".",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Jim really kicked those god damned Capitalists ass!Very very nice film.Jim really have no choice.He had to do that.And I like his friends too!They were always stand with Jim.",
      "total_reactions": 1,
      "user": "DivinePhoenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Assault on Wall Street is a good movie, not a great movie or a movie you'll want to watch again anytime soon, but it's a good movie. It's a revenge themed movie that works well for what it is. The set up involving a armored car security guard and his sick wife dealing with compounding medical bills that force them into a debt spiral they can't get out of touchs real life in America these days. The first half of the movie does a good job of setting up what makes Jim seek revenge. We're able to sympathize with Jim during these moments and see how he could come to this conclusion. The way it's acted though is another story, some of the actors in this film are a little surprising. Veteran actor Keith David has a role as an NYPD officer who's been in the vice grip of debt before, we also have Edward Furlong playing Jim's best friend and co-worker. Both of these actors do well in their roles and it's nice to see Edward trying to rebuild his acting career. The main character though, Jim, played by Dominc Purcell comes off as just above wooden. He seems like a great guy, but he would come off in real life as creepy, someone you would keep your guard up around. He delivers a fair performance, but I think someone else could of played the part just a little better. The second half of the movie is where it begins to hit the fan as Jim loses it and takes out his frustration and anger against those on Wall Street and for the most part these scenes are done quite well. The action is good and Uwe Boll doesn't shy away from showing some blood and gore. The ending is somewhat of a mixed bag for me, as I kinda agree with it, yet think it shouldn't have happened another way. Assault on Wall Street won't become a action classic, but it 's worth a watch, especially if you hate the **** on Wall Street.",
      "total_reactions": 0,
      "user": "GundamMars"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Its an ok movie. Guy finds out he has  lost money because he was cheated by this bank who lied about his investment and as a result looses his job, his wife and goes on a revenge spree against corrupt bankers.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    }
  ]
}