{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "Astro Boy",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 35,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Animação muito mal feita",
      "total_reactions": 1,
      "user": "Iky009"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "It moves itself along at a brisk pace, and while lacking in the high quality storytelling department, this animated film has enough action-packed spunk to keep the younger audiences thrilled.",
      "total_reactions": 1,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Good action, animation, and fun. This film was a pleasure to watch and it did have some impressive action sequences. It requires the audience to open up their hearts and minds and lose their sense of reality to fully enjoy this picture. When you give all that up, and have fun in your altered mind-set as a 6 year old boy, this film is most exciting. If you can't muster up enough energy for that alteration, this film will appear to you as just....\"cute\".",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "better ignore these annonying critics,and just enjoy a great animation that both kids and adults would really love. I really loved the story,especially the emotional aspect. Superb action,and a great voice acting,astro boy is definitely up there with the great's,don't care what the critics say",
      "total_reactions": 0,
      "user": "hugoboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Note: I know nothing about Astro Boy apart from this movie. I hereby accuse this movie of various villainies and crimes. Astro Boy rips off various other films, is filled with cliches, there's an abundance of plot holes, and enough cop-outs to go around. This movie is a blundered mess. My main problem; it's an enjoyable blundered mess. Astro Boy is about a child named Toby Tenma (Freddie Highmore). He's a robot genius, like his father, Dr. Tenma (Nicolas Cage). During an unfortunate robot malfunction, Toby perishes in an explosion. Dr. Tenma is greatly saddened by this loss, so he uses his son's DNA to create an exact robot replica, and when the boy awakes, Dr. Tenma never tells Toby about his transformation. However, some critical changes have occured. In fact, this \"Astro Boy,\" turns out to be even smarter than before (an impressive feat). But he doesn't just improve academically. Astro Boy slowly discovers his various new abilities. He can withstand serious damage and high falls, and has the ability to fly. But Astro Boy just isn't the same as Toby, and Dr. Tenma just can't find it in his heart to love the robot. I thoroughly enjoyed the first half hour of this film. The animation, though simple, is gorgeous and slick. The story line was going pretty well, too. There was a pretty generous amount of humor, even. I felt like I might actually enjoy myself, contradicting my thoughts about the flick before viewing. Unfortunately, the film went downhill from there. It wasn't a significant drop at first. The next half hour held up pretty well, but it was bombarded with cliches and unsucessful attempts at plot twists. This second half hour was arguably funnier than the first, but there were also way more jokes that ended up being stale, and recycled. I also started noticing various rip-offs of other flicks here. I had already spotted a couple in the first half hour, but there were significantly more here. Finally, we come to the grand finale, where we get countless cop outs, rip-offs, cheesy lines, dumb jokes, cliches, and guess-before-it-happens moments. This also includes a completely random and undeveloped change in Dr. Tenma's character, and a boring and utterly stupid climatic duel between Astro Boy and the Peace Keeper, an evil robot charged with negative energy (both literally and metaphorically). Worse, there were tons of scenes in this last half-hour that had the potential to turn the film around, and make into the grand piece of cinematic entertainment I wanted it to be, but never had the guts to try. Plus, throughout the film, there are gaps in the story, dozens of characters with no personality that make stale jokes, and the movie just moves too fast. Even the score is relatively bland. The film really isn't as bad as I'm making it sound. It's got a lot to love, and there's definitely a few things that make the film worth watching. I'm just disappointed with the final product. It could've been much better. It should've been much better. Astro Boy could've been a masterpiece, but in the end, it just settles for being mediocre.",
      "total_reactions": 0,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Here's the deal, if you are a die-hard fan of the original work by Osamu Tezuka, I would strongly advise you NOT to watch this movie. Although I can understand the appeal to young children and adults who have never seen the original works, this is simply using the original characters, loosely basing it upon the original story, completely changing the behavior and characteristics of Astroboy and turning it into a new movie. If you are simply looking for a movie to share with your children, then go fro it. If you are a fan of Osamu Tezuka, and you want to watch this movie because of that, then don't watch it.",
      "total_reactions": 0,
      "user": "KimX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Astro Boy never takes off.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    }
  ]
}