{
  "mc_avg_user_score": 7.5,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 432,
  "mc_movie_name": "Avatar",
  "mc_negative_rating_frequency": 412,
  "mc_positive_rating_frequency": 2138,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 15,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "I legitimately have no idea how this film has been getting so many positive reviews. Someone once said great films were a combination of technical innovation and artistic achievement. While Avatar certainly nails the technical side, it's artistic half leaves a lot to be desired.",
      "total_reactions": 37,
      "user": "LostOverThere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "hurr hurr hurr look at me i use words like mediocre performance and other intelligent sounding words when the only thing i dont like about the movie is that its made the most money ever. Im a rebel i go aqainst what everyone else says just so i can be different from the crowd even though i secretly love this movie hurr hurr hurr",
      "total_reactions": 2,
      "user": "bjmcdonald1991"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "I think I'm a minority on my stance towards this movie. I don't have mixed feelings about it just to be edgy and apart from everyone else, it just rubbed me a little differently. I was largely absent from all the hype that surrounded it when it was released: I finally saw the movie towards the end of its theatrical run. With that being said, I had a much clearer perspective on it, seeing it in a theater with maybe 10 other people in it, and I can honestly say after seeing it, it's one of the most overrated movies of all time. For starters, I think the movie takes itself too seriously. At it's core, the plot is essentially an updated version of \"Pocahontas\" or \"Dances With Wolves.\" I was genuinely entertained for the first half hour, in which you're introduced to the main characters and the setting of Pandora, but then movie started to take another turn. The whole thing was simply overshadowed by this very self-righteous, naturalist message about how we have to take care of the planet. Now don't get me wrong, I care for the environment, but when I feel like I'm watching a $300,000,000 EPA PSA, it kind of ruins the effect of a movie that comes from the director of Terminator 2. Throughout the movie, various other sci-fi elements are taken from movies like the Matrix and Jurassic Park, and subsequently accompanied by video game quality dialogue. In a word -- it's all over the place and just comes off sappy. Rather than a sophisticated narrative geared towards adults, Cameron just decided to go completely Saturday morning cartoon with this one, causing tons of merchandise and distribution out the ass that caters mainly to middle school boys who take garbage like this too seriously. But hey, it has amazing special effects, so I guess the it's saving grace is the familiarity of the director, and that it looks pretty.",
      "total_reactions": 2,
      "user": "PrivateJoker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "There's a certain something to be said about the power of a visually strong movie like Avatar. It's kinda like a sleazy, but charismatic sales person. You like the person while your in his office, cause he just reeks of charm (or cigarettes) and you buy in to his pitch, cause he's good at what he does, but when you leave the store, you find that you really didn't like the product that much after all. That's kinda how I feel about Avatar. The movie's visuals are amazing and I would say that nothing will be defeating it anytime soon as far as that goes. But when you brush away all that, what you're left with isn't necessarily a bad movie, but an average to ok one. I say this because most of the time I spent watching it was marveling at the amazing visuals that Cameron's team presented us. That part I can't heap enough praise on, but other than that, the story of the movie pretty much comes across as a straight up black and white morality play. I can understand the \"it's just a movie\" that people may say to that kind of suggestion, but where it doesn't hold up is when you try to pass the movie off as a political/social statement about our society. Nothing in reality is ever black and white, and to do so discredits a lot of what makes us a very complicated, arrogant, and interesting species. Aside from it's horrid attempts to justify why our material world is wrong, the story presents the humans as evil, greedy, and violent; but the Na'vi are peaceful, harmonious, and coexist with nature. Of course the main character ends up going native, finds he likes the tribe more, and then sides with them in the upcoming inevitable bloodbath, and the usual sequence of most big budget movies plays out with no originality whatsoever. Still the movie does entertain, even though it provides a mixed message, and there are some very interesting moments. The real credit to Avatar is the level of thought put into the actual world itself, and here the production/design team did a remarkable job in making Pandora a reality. To me it's a shame that they went for a more simplified story of good and evil as opposed to something more complex and real, but I guess that was never their intention in the first place. It probably wouldn't have been as successful in the theatres if it was. A simple message doesn't mean a bad one, but in this case it was more of a typical one.",
      "total_reactions": 1,
      "user": "zombiehampster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Other than popularizing 3D, Avatar has nothing else to offer. The story is basic and unbearable at times if not predictable. The only thing that is captivating is the effects and technicality for a short time then it and the dialogue appalls.",
      "total_reactions": 1,
      "user": "USG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "To sum up a boring film. i mean yeah the cgi, blue alien concept is good but not for 162 minutes. I was frustrated with the fact that james cameron thought it would be ok just to show off the cgi and leave it to a bunch of 10 year olds to create a shabby story with more action scenes than all 3 transformers in a row. im not saying its a bad film, not by any means as i suppose the cgi and idea of pandora is well thought of, its just very boring after you realise that the cgi concept is all your going to see in this 2 and a half hour marathon of a film.",
      "total_reactions": 1,
      "user": "TheSuddernator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Kids will like this movie better than adults because the story is very hackneyed and cliched. Any adult will have seen it several dozen times already, so to see it again, in a long drawn out overly long movie, is as tedious as he!!. But kids who have never seen any version of this story before, might like it. The story lacks any nuance. The good guys are the indigenous people without technology who worship a tree. The bad guys are the people from earth, who have lots of technology and calmly drink coffee in their helicopters while they blow the primitive people to smithereens from the air. Like someone else said, it is a 3 hour public service announcement. And it lacks any kind of character development.",
      "total_reactions": 1,
      "user": "NikolayG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "When I decided to begin watching Avatar, I was expecting a great movie, but that's simply not what was revealed before my eyes. The only truly good thing I can say about it, is that it's got some pretty impressive visuals. The rest of the movie is more or less average.",
      "total_reactions": 1,
      "user": "Xposure"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "You know how some movies and series are all story and no special effects, and they are still awesome, like Dr Who, and Red Dwarf, and animation. Well, Avatar is the exact opposite. A tech demo of what budget can do in this day and age, but that is it.",
      "total_reactions": 1,
      "user": "Ndi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is Pocahontas in space, literally  look it up, it's the same plot just with different character names and it's in space. Moreover, it has numerous plot holes and makes the natives out to be perfect, when they are not. The largest and most glaring plot hole was the ending, when the spirit of the plant life or something brought in all the wild animals to attack the humans, even when the entirety of the preceding movie explicitly said on numerous occasions that this does NOT happen ever, for any reason. The second being 'Unobtainium', the stupidest sounding plot device ever and a large deposit just happens to be under a tree that the natives live in. Despite the numerous sub-surface mining techniques available, the CEO or whoever decided to just attack the natives for no reason, just to show the contrast between the 'perfect' natives and the 'evil' humans (white people). This movie is anti-colonialism, clearly, but it's so one-sided it's not even funny.",
      "total_reactions": 1,
      "user": "Oplindenfep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Best movie of all time, since i have to have 150 characters, here is a long yeah. yyyyyeeeeeeeaaaaaaaaaaaahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh.",
      "total_reactions": 1,
      "user": "MrGman2142"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "A bland, cliched story with average acting and although the special effects are superb, it doesn't stop the film from being a mediocre bore-fest that you'll forget in a couple weeks time.",
      "total_reactions": 1,
      "user": "RayPist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "I have come to call this movie what it is, a cliche and stock character ridden bucket of pure crap fished from the toilet that is Holywood. no effort whatsoever was made to make this anything but a quick cash grab by one of the most worthless directors out there next to Michael Bay. all this movie is is a bunch of pretty colors with a story ripped from the likes of Ferngully and Pochahontas. now that may enough for some people but not me. if not for the special effects I would give it 1",
      "total_reactions": 1,
      "user": "someguy8896"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Although it had a good plot, and somewhat decent graphics, the film was hard to sit through. First there was story, then a battle, then story, then a battle, and it kept going on for a while. The acting was okay for the most part, but there was so much CGI that it takes away from the story.",
      "total_reactions": 1,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "This movie deserves a Oscar in visual effects. that being said this movie fails in both the story and acting(specially neteri).",
      "total_reactions": 1,
      "user": "yogesh487"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "Where are all these good reviews coming from? I dont get it. The plot is horrifically obvious, the acting banal and the film... boring. I mean ye its kinda pretty but oscars? I just dont get it.",
      "total_reactions": 1,
      "user": "ingie44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Avatar collides.",
      "total_reactions": 1,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "Like most of James movies, you can expect scenes of amazing animation and believable plots, but Avatar for me was one of the more boring films by Cameron. I know lots of people would disagree, but I expect that, but to be far I also expected more from the movie itself.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "The special effects were amazing but the acting performances and the length of the film are the week spots.Sam Worthington tries but he is not good enough to be the main character.",
      "total_reactions": 1,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "In my opinion one of the most overrated movie of all time. The run time was almost 3 hours and there weren't enough entertaining scenes to keep me into it the whole time at all. I also though it took a little while to get going. And even the action scenes were below par to my standards not awful by any means but not as good as everyone says or as I had hoped for. The one thing it had for it was great visual effects and that is why it even gets up to 5 out of 10 for me.",
      "total_reactions": 1,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Visually it's so stunning and mesmerising, but that's just about it. It's boring, predictable, and too much romeoandjuliettey. More mystery and suspense to it would be a nice touch.",
      "total_reactions": 1,
      "user": "HighPriestesa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "What a technical aspect, yes it is great. That is it. This is a very cliched movie with nothing new, charismatic at all. The characters were nothing special, and more of the run in the mill archetypes that you expect.",
      "total_reactions": 1,
      "user": "ChrisTaylor94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "If you remove the special effects, thus, removing the Na'vi and replacing them it by... I don't know, native Americans, you'll notice that this film has already been done. Three or four times. White man saves the \"stupid\" natives that can't look after themselves -which is a paradox, after all, because the movie wants you to feel that the Na'vi are really special and have their ways with nature, but they are defenseless even so. What Avatar has of awesome is the ambiance, the effects are amazing (even though I prefer practical SFX, like Blade Runner, or Alien) and the movie turned 3D into something mainstream. Like what Gone with the Wind made with colored movies. Oh, and the Na'vi language was a nice touch, I read that they spent years creating it. But, if you discount all the artistic achievement, you'll notice that this film has been done before, and this version has a cumbersome plot and cheesy dialogue. It's a fun movie if you decide to leave your brain at the door. But for anyone that saw GOOD films in their lives, Avatar is only mediocre.",
      "total_reactions": 1,
      "user": "azeitona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "When his twin brother is killed, disabled ex-Marine Jake Sully is recruited to aid a mining expedition on the distant jungle moon of Pandora as only his DNA will bond with the alien hybrid body, known as an Avatar, that allows humans to breathe the toxic air. With orders to infiltrate the Na’vi, Jake finds himself falling in love with native girl, Neytiri, and complications soon ensue…",
      "total_reactions": 1,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Avatar is a visual treat. But that's the only good thing I can say about it. The world of Pandora is a beautifully rendered world that's so brilliant looking you wish the movie's story was that good. But it's not. We've seen the entire movie before- Dances with Wolves, Pocahontas, etc. I don't get why you'll pan some movies for being \"great to look at but the story wasn't very good\" when you acclaimed this despite having the same problem. The film just tries too hard to be smart but the only reason to watch it is to look at the pretty colours. Seriously, is this REALLY the same guy who made Terminator?",
      "total_reactions": 1,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "This movie was all gimmicks and no substance. Designed to be a eye candy for the sake of 3D, it is basically a boring adventure about humanity being unpredictable. The problem is that the fancy 3D and CGI cant keep your attention for long once you are accustomed to it and if you take that out of the movie, you are really left with bad sci-fi flick about \"duality.\" \"Human duality\" is probably the 2nd most boring subject of a movie behind all the \"coming of age\" stories. The military and science are once again the bad guys while the aliens are innocent and good. I really dont mind movies that portray humans as bungholes (because frankly, as a society, we are), but its getting old and this movie did not even try to be original. There were no cliffhangers, no interesting characters, dialog was mundane and the plot was predictable. The entire movie could have been done in 15 minutes.",
      "total_reactions": 7,
      "user": "marc5477"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Despite \"Avatar\"'s heavy plot, Blockbuster king James Cameron impresses us with fantastic visuals and CGI of the Na'vi and human battle scenes in (Le Gasp!) 3D.",
      "total_reactions": 17,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Avatar is no doubt my least favorite film of all time for one simple reason: it is everything wrong with Hollywood. Over-budgeted production cost, the lure of 3D to draw viewers, manipulative characters and political messages, and the complete lack of depth in the characters and story plague this beautiful looking film. To say that this film is bad would be a lie, but I despise this film so much due to it's one-dimensional characters and predictable and unoriginal story. James Cameron has done some great work in his career (The Terminator films, Aliens, [and even] Titanic), but Avatar is not among that prestigious list. Avatar only goes to prove that visual effects and action scenes do not guarantee a good film. For example, 12 Angry Men is one of the greatest films ever and it contains no action, CGI, and lacks multiple locations; the entire appeal of the film lies in its strong characters, dialogue, premise, and confrontations. Avatar lacks all these quintessential elements, and therefore suffers.",
      "total_reactions": 11,
      "user": "phAtBenJ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "When I first watched this movie I was blown away. It is probably my favourite movie of all-time but then I seen it a second time and I kind of got a bit more bored than the last time I watched it. It's still a great movie though.",
      "total_reactions": 4,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "Absolutely hands down, the most over hyped/ over rated movie in history. I saw this movie when it came out in theatres and i hated it so much i had to vent as soon as i became a member of metacritic. sure the special effects are good, but thats not enough to salvage the terrible acting and dreadful script. the entire story is borrowed from other hollywood movies. it disgusts me how much people love this movie. to me this shows just how simple and shallow movie goers are. the aliens were just friggen annoying to listen to and to look at. Ive never fallen asleep in the theater, but this got me pretty close. just a boring, eye candy laced, piece of **** movie.",
      "total_reactions": 4,
      "user": "TheWhiteMamba"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Great visual effects, film and mounted with a spectacular photography and a magnificent art direction and stunning views, but their enrendo is not the best yet it is still a great movie.",
      "total_reactions": 4,
      "user": "Iky009"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "I had heard a lot about \"Avatar\" before seeing it, and the general complaint from most was the movie's lack of originality. Having seen the movie, I would agree that the premise is nowhere near unique, but to me originality shouldn't be the basis for judging the quality of a film. More than anything a truly great movie should be striking, and Avatar is precisely that. James Cameron used his budget ($237m) to create one of the most engrossing environments to ever grace the screen, and pushed the 3D technology (which I don't even like) to the limit. The result is pure spectacle; behind me in the movie theater there was a family with three children and throughout the 2 1/2 hours there were constant exclamations of \"Wow!\" and \"Oohh!\" I would have been slightly annoyed had I not realized I wanted to say the same things, and for a movie to revert a hardened critic like me to a world of pure escapist wonder, I have to give the film credit.",
      "total_reactions": 6,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Visually, Its extremely impressive and I was shocked that James Cameron didnt win the oscar for best director because of the visual effects in the film and the ground breaking use of CGI as well. However, The film sucks. The acting is terrible, the plot not only sucks but is a complete rip off of Dances With Wolves, and its incredibly boring (I was only entertained in 3 very short parts in the entire film). Sorry but the visuals can only get you so far in my book and this film just doesnt cut it imo.",
      "total_reactions": 6,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "james cameron, stop trying to shoving life lessons down my throat and wow me with visual effects, make a good movie without sam worthington your boyfriend.",
      "total_reactions": 3,
      "user": "scbrother"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Avatar is a great movie, but just how great is it? While I thought it was pretty cool that they based all the air and space craft on ones from the Halo series, the story was a bit of a disappointment. I was never really into Pocahontas or Ferngully when a was younger, and I was never into old movies like Dancing with Wolves, so the story of Avatar did not really stick out to me. Visually the film was quite enticing with it's colourful scenery, it was not all that interesting because of the story. Avatar had much potential, but I am not so sure it lived up to its potential.â",
      "total_reactions": 3,
      "user": "Seriously"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "AVATAR (or, as some seem to enjoy calling it, \"The Blue People Movie\", which really should be THE SMURFS, not this) is an adventurous, intense movie, and the best movie you can think of to be the highest-grossing film, both worldwide and in America.  Very few parts of this actually truly ticked me off, but there were a few to name: such as near the ending, when it began to get boring (a habit many creative sci-fi films such as even INCEPTION get into); and when Grace (Sigourney Weaver) died.",
      "total_reactions": 3,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This film reaches a new level when it comes to both technology and creativity. It´s a really good created alter/reality that will hold your attention with ease during the entire ride. Visuals and atmosphere give this this movie an absolute a-status. The created world is absorbing your brain so bad that the average story won't bother you even 1 second. This one shines in utter  greatness!",
      "total_reactions": 3,
      "user": "Isaac_adhd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Visually, this film dazzles and amazes.  Story- this film is an overly preachy and overly long and an overblown film.  I really didn't like it at all.  My opinion.  There you go.  Oh and the 3D, made me sick.",
      "total_reactions": 3,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "This is the worst movie i have ever seen. if there was a lower review then 0 then i would have put that. if i got a copy of this movie i would set it on fire and dance on its ashes",
      "total_reactions": 3,
      "user": "HoldenKausler"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Avatar is an agonizing movie with amazing visuals and incredible use of 3-D and motion capture technology. In the purely technical sense, this film is a masterpiece; however, in terms of story, characters and ability to develop the plot, the film fails miserably. Every single character in this film is not only uninteresting but undeveloped. Think about it... what do you REALLY know about Jake or Nyteri? The dialogue is also horrendous. At times my jaw dropped at how uninspired the lines were. \"I see you\" in particular feels cheesy and overused. Then there is the awful love story. It is without a doubt one of the worst development of a couple I have ever seen in a film. We go from Nyteri HATING Jake to them occasionally nudging each other and laughing to...well them doing under the tree of souls or whatever it's  called. I know months have passed in the story, but only 45 minutes have passed to us, and nothing in the film explained or showed how their feelings grew for each other. Giving someone a meaningful look once doesn't count as developing a couple. To top it off, this movie is excruciatingly long. By the time you see it for the second or third time you will be constantly checking your watch. It just won't end! The film could have easily cut 20-30 minutes. While there are a lot of pretty images, the plot and characters are pretty ugly.",
      "total_reactions": 8,
      "user": "Iswearimsmart"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "If Pocahontas was a 3D live action film starring blue people, this would be the result.",
      "total_reactions": 15,
      "user": "thomasno"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "My only wish is that they would have made the movie an hour longer. You don't want to leave Pandora. What a truly amazing creation of a world and culture.",
      "total_reactions": 5,
      "user": "rodericrinehart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "First time watching this your not going to have any negative points, as it will win you over with graphical wizardry. And boy, are the graphics good. With very highly realistic environments, seeing it in 3D on the big screen is something magical. Assessing the film afterwards reveals a highly weak and wooden story that is just holding the film together with the visuals. Though the storyline is utter guff, the 'wow' moments might just make this a great film. Just.",
      "total_reactions": 5,
      "user": "Susano"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Nowhere near as good as people make it out to be. The storyline is average, the characters aren't very well developed and the acting is poor but, apparently, this doesn't matter to anyone because in these modern times a movie seems to be able to get around based on special effects alone and Avatar is a prime example of this. It made a lot of money because it was visually great despite how bad it was a movie. I'm very happy that this crap didn't pick up a Best Picture Oscar, it didn't deserve it.",
      "total_reactions": 5,
      "user": "GarethCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "this movie is garbage. and whoever thinks that it is the \"Best movie of all time\" remove the special effects and see how holds up to the title of \"best move of all time\". as for the special effects... the 3d was good in some parts but overall unnecessary, it could have got by without it. as for story... could be wrapped up in an hour rather then three hours. the action only showed up at the \"big battle\" at the end other then that it was useless filler. overall: not worth the money or time",
      "total_reactions": 5,
      "user": "Mrsoandso"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Despite almost being a spin off of Dances With Wolves, the ridiculously beautiful visuals, believable and likable characters, and successful good Vs. evil theme makes this movie one of 2009's best",
      "total_reactions": 5,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Looks good but painfully cliched. I for one would recommend a rent just to see lovely it does really look, but it doesn't take long to find how shallow the charachters truly are",
      "total_reactions": 7,
      "user": "NF123"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "Most overrated movie in history. The only good thing about Avatar is the visuals. The world is pretty to look at but.. well, there's nothing there. The story is horrible, the characters annoying, and the scenarios they find themselves in absolutely ridiculous",
      "total_reactions": 7,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "James Cameron has returned from the deep abyss that was Titanic to create something truely remarkable. Avatar is a film shot in digital 3D. However it far suceeds, in terms of techincality, recent films such as Beowulf and UP. It really is a marvel of architecture. The expressions on the faces of the characters are scaringly un-canny, and the same goes for the environment in which they live in. However all that said, there are some downfalls of this film. For example, the story is extremely thin. It is very easy to get caught up in the beauty of this film, and forget about the cliche full narative, that frankly, if you noticed how bad it was, leaves you feeling like a bit of a sucker. It follows an ex marine called Sam, and is set in the decade of 2050. It starts on board a space ship, that is approaching a fictional planet named 'Pandora'. We later learn that it contains a very valuable substance, and thus why the Americans decide to invade. Sam is chosen, and this is where the 'Avatar' comes in. It is basically a suit that he wears during the time he is in the simulation pod (that allows him to travel to Pandora) it disguises him as one of the 'Na'vi' (the big blue aliens). His goal is to persaude the Na'vi to move away. However in typical fashion he falls in love with one of the indeginous, and we have a classic story. A sort of good cop bad cop scenerio. The good guy being Sam who decides to betray the US and save the Na'vi. The bad guy being an Army General that wants to invade, however he did resemble a character from Toy Soldiers. Without giving away too much, we end up with a happy ending, that like I said earlier, fails to satisfy. However, if you mangage to ignore the story, and just marvel at the CGI, you will be pleased, this is one you have to see on the big screen though, and if you can, see it in 3D. In short it's the cherry without the cake, glamorous but with the essential bits missing.",
      "total_reactions": 11,
      "user": "NatDurman"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "While a beautiful movie to look at, the intense CGI cannot hide the hopelessly derivative story and generally poor acting. While the world of Pandora is nice to look at, it is poorly thought out. All the characters are caricatures of the worst movie stereotypes. We have the badass soldier chick, the angry army commander, the hero who just wants to do the right thing, and the industry crazed maniac.",
      "total_reactions": 23,
      "user": "Kastian"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Ok listen for all you bad reviewers: If your not looking for an action movie, go watch a freakin romantic comedy. Thats not this movie. The effects are amazing and stop bring the stupid, childish Pocahontas or whatever into this film. They're nothing alike. This movie was rated better then Titanic and has awesome plot and idea and characters that are realistic.",
      "total_reactions": 6,
      "user": "MovieCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This is what you call A Great Movie.  It will live on as that for a while and perhaps forever. Avatar is spectacular, goofy, and most of all cool.   Hopfully Avatar will be remembered for a while, before any other movie takes its place",
      "total_reactions": 4,
      "user": "Ransack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "another good film from james camron . not as great as id hoped and some people have said but its still worth seeing . the main problems i have with this film is its presented in its trailors as this HUGE action film . when in reality there really isnt much action till the last 20 min . considering how long it is think they coulda packed abit more in . the story is entertaining although very predictable . the visuals are just out standing pandora really comes to life . the acting is ok i didnt really feel impressed by any one . its a entertaining film that most of the family can sit down and wach and have a fun time .",
      "total_reactions": 4,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "When I sit down to watch a movie, I'd appreciate not being beaten over the head with political agenda bull. Storyline was not only thin and shallow but also extremely distasteful, and purely immature. To me it felt like liberals vs. war-mongering conservatives; childish name calling and finger pointing. Again: when I watch a movie, I find it insulting when it's attempting to brainwash me with political agenda whether it be extreme right or left. On to the next point. The distasteful bits would be the fact that we're supposed to cheer for the aliens---While they slaughter human beings. Now this could have worked if say a large portion of the marines rallied together (representing the audience) to protect Pandora, and the bloodthirsty Corporal (and why is he so bloodthirsty? Any reason?) could have his group of evil followers. And at the end, the humans find negotiation with Pandora and 'wisen' up to their ways (because we violent humans are utterly stupid according to the story. Yes, that means you). No, the movie didn't even do that. It gave no room for redemption, and practically insults you on a personal level. Next Point: If the evil business man was really after wealth, he would've stopped the operation to gather ore. He would've gone after the wealth of medical, biological, and sociological knowledge which would have made him insanely more rich than mining would. And finally, there is the point that many people have brought up: It's a total rip-off. Pocahontas, Dances with Wolves, Fern Gully, Aliens, and Storm Troopers have all been brought up which means the storyline is over used. Movie was highly overrated, critics either don't know their sh*t, are politically biased, or are too gutless to truly critique the film. A great big middle finger to the message of the film, and much love to the artists who made such a beautiful world. Shame on those who shallowly rated the film based upon appearances.",
      "total_reactions": 4,
      "user": "Ambrosine"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "If I wanted to watch cartoons I most definitely would watch ROBOT CHICKEN. One or two of my in-laws INSISTED that the characters in this were REAL (not computer generated real but REAL!!!) That is the type of intellectual hooraying for this gigantic waste of my time that makes me squirm. OK the effects were decent. But I DO NOT watch movies for their effects. The story was adolescent and the \"camera work\" was marginal at best. Try watching cinema and not a 3d cartoon, you might find your artistic integrity improved.",
      "total_reactions": 4,
      "user": "OneWhoKnows"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "The special effects, CG, and sound were awesome.  Beyond the eye candy there is simply nothing here.  As other reviewers have stated the story is cliched, and the director was trying to make an obvious political statement.  I thought this detracted from the overall story.  My wife was predicting plot lines and actor lines, and she never does that.  The only part of the story that was not predictable were the huge plot holes throughout the movie.",
      "total_reactions": 4,
      "user": "tycho32"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This is the best movie have ever saw.",
      "total_reactions": 4,
      "user": "benjaminavatar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 1,
      "text": "Man when i first went to the theater i though it was going to be great people told me it was one of the best movies of all time so i went and check it out but in the end of the film it turned out to be **** all that was good of the film was the cgi and i dont care for 3d the story was **** the acting was **** the writing was **** the screenplay was **** everything was **** and sadly to say the directing was **** i love james cameron growing up but he has lost his touch",
      "total_reactions": 4,
      "user": "deltapatrick"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "This movie gets a few points in my book for amazing special effects, attempting (ironically) an environmental/anti-corporate message, and a handful of exciting scenes. It is otherwise a trite and pointless exercise in box-office money making. Not only is it a pastiche of many other (better) films, but it is dumbed-down and toothless. The black and white morality, hokey 'spiritualism', and PG romance set to horrible adult contemporary music, screams \"Disney!\".",
      "total_reactions": 4,
      "user": "DGDSN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "8 is for the graphics",
      "total_reactions": 4,
      "user": "simplex"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Congratulations to the special effects and the graphics and the 3D! But, the movie itself is so ridiculous and cheesy. It's terrible. James Cameron can't write a good script. This could have been done a lot better. And, honestly, I'm not interested in watching sequels.",
      "total_reactions": 4,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Along with the graphics in this movie i personally think this was a near perfect movie!! The storyline was similar to any like it with the enemy becoming friend but there was more to it i think. Showing the love of earth and others though money is there. Understanding others before destroying them is more important.",
      "total_reactions": 4,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Easily the most overrated film of all time. Visually it loses its impressiveness rather quickly into the film and while it may look great in 3D, In 2D is rathers boring. Not to mention the film's plot is a rip off of Dances With Wolves (Seriously check that out). Also the acting is rather disapointing and sometimes terrible. Overall its visually impressive in 3D but thats it.",
      "total_reactions": 4,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Avatar delievers with the 3D effects and it really did feel like you were in another world from my point of view but the storyline really dissapointed me, I found it generic and very,very obvious. I guess, mostly the film is really about the out-of-this-world effects and the 3D and the storyline will suffer a bit, but,at points, Twilight was more original. I may be sounding a bit harsh but I just expected a bit more. It was good,but not excellent and not a 10/10.",
      "total_reactions": 2,
      "user": "Paxster"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The visual effects are breathtaking and the directing is incredible. The only negative thing about it would be the plot, which is simple and common, but all the rest, visuals, sound, directing, actors, are very, very good.",
      "total_reactions": 2,
      "user": "Razv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Visually speaking Avatar is the greatest creation ever made in cinema history.It has beautifully put together and has the best visual effects ever made. Avatar is a revolution for the genre and is basically the Star Wars of the next generation. This is Cameron's true masterpiece,and is the greatest 3-D film of all time. Many naysayers say the dialouge does not sound real and is just terribly written,but to me the conversations sounded more realistic than some films. Personally I found the dialouge intresting and very lifelike. The acting is good on the most part,with a few exceptions. The audio is also exceptionally good. The background score is good and backs up exactly what is happening,and thats not all.Explosions sound like explosions,the wind sounds like it is blowing,and embers sound like their burning. All in all this is the most entertaing sci-fi film i have ever seen.It is a must see.",
      "total_reactions": 2,
      "user": "jeremyd99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "It looks great and there is enough here to support video games and theme parks for years to come. Shame they forgot the story, script and acting.  Cameron hasn't made a decent movie since Aliens (neither has Weaver). What a tragic waste - no wonder it was completely overlooked at the awards nights",
      "total_reactions": 2,
      "user": "Calexican"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "A  complete waste of good earned money and time.   I would have rather watched a racoon cross the street for 3 hours .  FINAL: a deliberate piss of trash",
      "total_reactions": 2,
      "user": "MarcelloM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Save yourself some money. Blow the dust off of your old Pocahontas V.H.S, plug that baby in and TADA! Without all the glamour its the exact same thing, whithout even spending a dime! Don't be fooled people.",
      "total_reactions": 2,
      "user": "Sixella"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "I honestly don't understand all the hype behind this, the story never really grabbed me and the characters weren't interesting, however I will give them credit for creating a unique alien movie as opposed to every aliens are invading movie that has been done over and over again, but it's still not that great, an ok movie from beginning to end.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Awfully clichedyl, horribly acted and scripted and stupidly over-hyped. Also lead to about two weeks of non-stop mindless gibberish from stupid 12 year-olds who seem to think that making a ridiculously high budget immediately makes a film brilliant.",
      "total_reactions": 2,
      "user": "SuperTakashii"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Avatar may not impress all audiences on a narrative level, however, its breathtaking visuals, lavishing colors, and groundbreaking special effects certainly proves James Cameron's knack for filmmaking.",
      "total_reactions": 2,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "Dances with Wolves meets Fern Gully The Last Rainforest with a dose of white arrogance. Yes, it's pretty to look at sometimes, but past the fluffy eye candy visuals there's very little substance to this movie. I found myself rooting for the supposedly \"evil\" colonel halfway through the movie and hoping he would just blow away Jake Sully and his tree hugging friends and end the movie. At least the Colonel is honest and does exactly what he says he's going to do, and isn't a double talking snake in the grass like Jake Sully. This movie does a horrible injustice to fans of James Cameron, serious movie goers and manages to fall short of all the hype and positive reviews that proceeded me seeing it. So badly does it fail at being the cinematic masterpiece that so many people seem to hail it as, that I would consider it to be the most disappointing movie I've ever seen. This isn't a cinematic masterpiece, it's cinematic dreck.",
      "total_reactions": 2,
      "user": "MagicSquid"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Film making technology so much ahead of its time. Now I know how people felt when they watched \"King Kong\" some 70 years ago. Best movie of all time.",
      "total_reactions": 2,
      "user": "NKcantHANDLEme"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "A strange mixture of Dances With Wolves and Aliens makes for a an equally bizarre but visually stunning screen epic that unfortunately falls flat on its face when it comes to plot and characters. A crippled soldier is sent undercover disguised as a blue smurf to convince the natives to move out of their hometown so that the government can obtain a rare and valuable substance known jokingly as \"unobtainium\". Directed by James Cameron, the same man who swept the world with the 1997 epic Titanic. A movie best experienced in 3-D. All in all, good entertainment.",
      "total_reactions": 2,
      "user": "TheNewSpielberg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "The visual effects are fantastic but there are certain points in the film that the characters are a little over-the-top. The story is original but a little bit boring. The acting is sometimes good and sometimes weird. This is certainly not James Cameron's best, but a solid one though",
      "total_reactions": 2,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "Overrated. Storyline is predictable, I mean the trailer itself showed what is going to happen already. I don't care if its the highest grossing film ever. I am not going to judge the film a high rating because of that..",
      "total_reactions": 2,
      "user": "Chrislake94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "3 hours of absolute drivel. I admire the fantastic visuals and the technology, animation, bright colours and scenery. But this is exactly what a movie SHOULDN'T be. It's the direct equivalent of games like Crysis 2; all about fancy graphics but no real substance behind all the nice coat of paint. Avatar has some good action scenes and looks great as an advert for a HD TV, but as a movie it is a fail. Not only is it the most predictable movie I have ever seen, it's also the most disappointing. It seems like it was made to appeal to people that have no standards and will literally watch anything regardless of its story. If I want nice graphics, I buy a gaming PC and experience them first hand. If I watch a movie, I want to be entertained or engaged in a passive experience. There is no comedy, no moral, no philosophy, no story. The entire plot can be summarised in about 2 sentences. It portrays humans as the bad guys to appeal to people's emotions, but ignores reality. It's completely crap designed for people with low intelligence.",
      "total_reactions": 2,
      "user": "sinadoom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "God i hated this movie. it was stupid, boring and stupid. it didnt make sence in so many areas. its only endearing quality was when we left it running at home with the sound down. it makes a pretty screensaver!",
      "total_reactions": 2,
      "user": "charredrelik"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "This score is totally for the visuals and nothing else. I admit they were amazing and groundbreaking. The plot is stupid. The characters are stereotypical. There is way to much 'environment is gud' message shoved in your face. I will never watch this movie again.",
      "total_reactions": 2,
      "user": "Josh_47ra"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Simply Amazing!",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "My first and only time going to see a movie in 3D... it wasn't bad and didn't feel too gimmicky but it just wasn't necessary. As for the movie itself, I liked it for a lot of reasons but it wasn't the ground breaking experience it was made out to be from all the hype. My only real gripes are with the story. If the characters were at least somewhat memorable I could have given it a better score but... I don't know what it is but the vast majority of the characters just seem like actors on a set rather than real people. I've seen better character development in videogames from the 90s. The plot I thought was good but can't deny how similar it is to a number of other movies I've seen. Those things aside though I could find a lot of reasons to defend it too. I remember there was a lot of racial controversy surrounding the movie and I can't help but scratch my head at that. >_> Also the art direction is some of the best I've seen in a movie, I just wish all the cool bells and whistles were backed up by a better plot. I will say that it was probably among the most intriguing movies I saw in 2009.",
      "total_reactions": 2,
      "user": "Subject98"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Going to see this in the cinema was the biggest disappointment I ever had with a movie. Lots of amazing graphics they said, they were right, a unique experience they said, they were right. Hey guys, ever wondered what the most **** up hero of all time looked like? The main character of avatar is your answer. Big commando man asks him to politely get the \"navi\" to move down the road just so the earth can have some more oil. Seems fair. So they turn him into a Navi, great, now he just needs to earn their trust and lead them both to a political understanding. But no, this wanker **** their leaders daughter, attacks humans, starts a **** war, kills all the humans and is presented as some kind of role model. **** **** Something like $7billion spent on this film. Probably spent on tipping of critics so they give it a good score. A **** predictable story with HD slapped on its huge ass. Waste of space.",
      "total_reactions": 2,
      "user": "gregthreet"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2012
      },
      "score": 0,
      "text": "AM I THE ONLY ONE THAT HASN'T BEEN LOBOTAMISED?",
      "total_reactions": 2,
      "user": "TheZapper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "The idea for the story and technology used to produce this film are both fantastic. However, it just becomes too boring and too predictable extremely quickly. The characters are so generic and the fact that it gets so much praise is indicative of the way movie critics are now-a-days. It wasn't a poor film but it isn't one of the best films ever. It was simply a good film as most of them are.",
      "total_reactions": 2,
      "user": "dev92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "Yes. The visuals were amazing... but that's about it. I seriously don't understand how people can call it the greatest movie of all time, the plot is weak.",
      "total_reactions": 2,
      "user": "Kamal_Voltaic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "It's the first movie that I saw, who made it perfect with the 3D part. But that's all. Story is boring as hell. I watched Avatar now for the 5th time, the first 3 times I just fall asleep. Sorry, I don't get it!? Why is that movie so great? Story is nothing new, but the effects are ... Yeah, I'll go and watch the visual demo of my Nvidia, it's the same ...",
      "total_reactions": 2,
      "user": "theWrath"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "I absolutely hated this movie because there was no plot too much romance and the CGI was a little over the top, probably the WORST MOVIE OF THE DECADE",
      "total_reactions": 2,
      "user": "Saggarwal20"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This movie has a storyline which is confusing. The special effects used were awesome. The places are imaginative in the way they are designed. There are lots of action in this movie. However, storyline, as stated is confusing, thus storyline is horrible. All these makes it an average movie.",
      "total_reactions": 2,
      "user": "supermann234"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "My favourite film; of ALL time so far. Perfect effects, and I can honestly say, it was the first film I ever saw at the cinema with which I didn't want to pause and walk out for a couple of hours. The ONLY film. Greatly looking forward to the sequel. There really isnt much I can say about this film apart from, it ticks every box. Just next time, Cameron, jazz the plot up slightly? This film was nominated for an unbelievable 128 awards, which includes 4 Golden Globes. If that isn't enough to convince you to watch it (if you're one of those rare people who hasn't seen it already) then just take (At the time of writing) 1,309 positive Metacritic reviews. Completely epic, and only 40% live action, with the other 60% being made up of the greatest technologically advanced CGE. The highest-grossing film ever made, by a large margin. ( 0.8 Billion US Dollars more than its closest competition, another of James Cameron's films, Titanic. In total, Avatar has so far made $2.6 Billion.) So in-depth was the making, a 1,000 word language for the Na'vi was created. No wonder it took 16 years to make.",
      "total_reactions": 21,
      "user": "Alex"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This movie is the most overrated piece of politically correct, anti-American garbage I've ever seen. This movie is about a man who betrays his own country! How is that \"heroic\" or worthy of admiration???So, it has cool special effects. Whoopty-f***ing-do! I can't believe this piece of crap movie was so beloved by everyone. Apparently, pretty colors and cool explosions are all the typical modern consumer cares about. How sad.",
      "total_reactions": 11,
      "user": "AI88"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Most critics have just praised it for its just stunning visual effects and 3D effects, but I find its story to be incredibly powerful and moving with just enough emotional depth added in there. I give this film 93%.",
      "total_reactions": 9,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Sure, the visuals are distinctive enough but that doesn't excuse the lazy cut-and-paste job done with the script.  We've seen this exact story done before numerous times before and done better.  A lot of people seem to think that the visuals make up for it but in the end this film is nothing more than a tech demo at best.",
      "total_reactions": 14,
      "user": "Ikarus14"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "the only reason i kind of enjoyed this movie is because my brother was repeating the lines in engrish, yes engrish. i really hated how they portrayed the marines, and when i heard that some people in the theaters clapped when they watched the marines getting killed, i felt like shooting james cameron in the face while saying \"yea get some mofo!!!!\" seriously i want to enlist in the marines, and i have a friend in training right now, i do take offense to that. this movie also rips off so many different movies such as dances with wolves. unfortunatly my brother bought this movie on blu ray instead of hurt locker which was a much better movie. to all you obsessors, dont get mad at me, because the critics agree with me!!!!! hell yea!!!!!!!!!!!",
      "total_reactions": 5,
      "user": "Peter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Words cannot describe the elements in this fabulous motion picture. The director, James Cameron, has set a new standard for CGI (computer-generated imagery) films. With elements such as Sci-Fi, Action, Romance, and Drama, EVERYONE must see this movie. I have seen 400+ films in my life, and never have I seen a film that was so well produced, a film that you couldn't resist cheering at the end, because you didn't want it to end. This film has the best special effects. No other film has used this type of CGI. This movie has broken a new barrier in the American film industry, just as visiting the moon for the first time. Well done Cameron, well done.",
      "total_reactions": 5,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Avatar is definitely the best film of the year, and one of my favourite films ever.",
      "total_reactions": 3,
      "user": "smijatov"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Forget about plot development and storytelling; it's all about the visuals here. I mean sure, the story is somewhat interesting and the characters have redeemable qualities, but this about blowing your eyeballs out of their sockets by using either dazzling beauty or monstrous explosions. If you let it be what it is, \"Avatar\" is a ton of fun, maybe the best film of 2009.",
      "total_reactions": 3,
      "user": "nboley08"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Everything about this movie is cliched and boring other than the half-decent CGI. I actually hated it. I highly advise you never to rent or even skim through this movie on television...it's a pile of ****",
      "total_reactions": 3,
      "user": "GamerinHarmony"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This is the epitome of pure genius! James Cameron brought to the screen one of the greatest and most ground-breaking movies of all time! Literally, words cannot describe the energy that made this film such a wonder and I would recommend this movie to anyone!",
      "total_reactions": 3,
      "user": "Ridz43"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Good visual and sound effects, however Avatar has a weak screenplay, which seems to be a mix of Dance with Wolves, Pochahontas and Alien. James Cameron was giving so much attention to the visual and sound that he did totally forget about the artistic part, mainly the script. Received 3 Oscars: Cinematography, Art Direction and Visual Effects, but in Avatar, the Art Direction and the Cinematography are Visual Effects. So it received 3 Oscars for the same thing: Visual Effects.",
      "total_reactions": 3,
      "user": "Civerts"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "To simply put  it Avatar is  the most beautiful movie i have ever seen. the visuals are stunning and the story is good enough. Avatar will not be matched in the techinal world of movies for a very long time. a truly stunning spectacle",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Four words for this movie: Pocahontas from the future. It's no joke. The visual effects, Pandora, photography, everything is great. But I think James Cameron got so excited by these that he forgot to invest in a good history. No surprise he didn't get th Oscar for Best Movie...",
      "total_reactions": 3,
      "user": "SilverMan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Everything is horrible. This alien, antagonist, helicopters, both protagonist and antagonist's weapons, arrow, spear, robot, giant knife, story. What a waste of money. What's worst is there will be a sequel.",
      "total_reactions": 4,
      "user": "ascoltami86"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "\"Avatar\", directed by James Cameron, is a magnificent intense sci-fi spectacle. The movie is well-shot, has beautiful landscapes and spectacular use of CGI. Anyone who watched \"The Matrix\" will find this movie somehow similar.",
      "total_reactions": 10,
      "user": "Official"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "An absolute revolution in film making. James Cameron and his team have crafted the most detailed, involving world in movie history. Yes, the plot is a little recycled and thin, but it still proves to be timely and moving. Fascinating and completely mesmerizing. Overrated? Absolutely not.",
      "total_reactions": 1,
      "user": "FrozenStar90"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Not quite as ambitious as I had hoped it would be when I first heard of it, but still an excellent movie. It's a great film less for the story itself than for the way it celebrates all the things people love about the space-western genre.",
      "total_reactions": 1,
      "user": "DeVr33z"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Obviously one of the best ever movie seen in my life.Cameron is a genious who proved he can make a movie with extreme CGI.Cameron's talent is just as big as his dreams",
      "total_reactions": 1,
      "user": "jaibalaji"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "extraordinary film of james cameron, this film was imposible, but now, we see that we are wrong",
      "total_reactions": 1,
      "user": "mjadri"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Good movie but not the best i have ever seen. The plot was ok but the graphics were the thing i watched for. james cameron kudos on this one pal. not as good as titanic",
      "total_reactions": 1,
      "user": "Beats"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "This movie was great, and even better in 3D. James Cameron has worked really hard on this film. This is 1 of the future-set films you would want to see.",
      "total_reactions": 1,
      "user": "AceIsCoolPro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "A nice and entertaining movie that however sets its priorities on visuals rather than characters and storyline.",
      "total_reactions": 2,
      "user": "rollingstone82"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "This movie is a slighty overrated but it's still very entertaining. This isn't the kind of movie you could really watch at home though and be very entertained. This is very much a theater movie to watch in 3D if you could IMAX 3D but at home it would seem kind of boring.",
      "total_reactions": 1,
      "user": "1966Zodiac"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Re-watching Avatar on Blu-Ray (minus the 3D) proved to me that it can stand on it's own story. While the CG is breath-taking and far more advanced than ANYTHING that's come before in cinema history, the story itself is interesting (it's copied, but adds a spin or two) enough and the characters and acting just deep enough to hold the film up.",
      "total_reactions": 1,
      "user": "IanM197"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "Truly I disliked this movie....  A lot.  I'm giving it a six for special effects which were amazing.  But as for the actual story it really wasn't very original.  John Smith goes to the \"New World\" and saves the girl he loves.  Doesn't this sound like Avatar?  I think it was too close to Pocahontas, but some of you may think otherwise.  Still, this movie was entertaining but I don't like movies with the \"earth god\" thing or fantasy....  It's worth seeing though, rent it for sure.",
      "total_reactions": 1,
      "user": "Jawcl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Mining Corporation after deposits on alien planet, team are sent down to inhibit the planet in native form via Avatar program, things go wrong, man befriends tribe, learns their ways, fights the evil corporate machine.",
      "total_reactions": 1,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "You have to see this film in 3-d to apprecciate it. That being said, Best movie I have ever seen. The visuals make you feel as if you are in that world. The storylines having some political meaning about todays wars. The story of love between two completely different beings. Yeah its pretty mind blowing.",
      "total_reactions": 1,
      "user": "Iqbal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Not totally blown away, but i was thoroughly entertained by it. But the film's strongest point is definitely the visuals. Pandora is beautiful and looks realistic. The story, though unoriginal, is still effective for this film. The dialogue, is bad sometimes, and decent in others. Definitely not a strong point. But if this film needs people to root for, its easy to tell who. If you want 3 hours of great visuals and nothing else, this is your movie.",
      "total_reactions": 1,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "In my top 5 movies of all time. I'll start with the obvious. Visually stunning. I have never felt so submerged into the movies environment. I literally felt like I was flying with Jake and Neytiri on my own Banshee. I didn't even care that the story was unoriginal. The Lion King wasn't an original story but its still fantastic. Everything James Cameron touches turns to gold. The only reason people don't like this movie is because of it's anti war message and because they think it makes the USMC look bad. Get over it, its a movie. Shouldn't have lost the Best Picture Oscar to The Hurt Locker.",
      "total_reactions": 2,
      "user": "MPVahalik"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "If you see this in 3D you will constantly be amazed the fantastic visuals and 3D effects. Avatar is an amazing looking film that will impress everyone, However, if you are looking for amazing characters and story it is not in this film. The story and characters are unoriginal being recycled and two-dimensional. So a lot of whether or not you will enjoy this movie will depend on how much those to aspects matter. If you just want to see amazing visuals you’ll have a great time being blown away by this movie and forgetting for most/all of the movie how unoriginal the characters and story are. However, if characters and story matter a lot to you, you will be disappointed in this film as they are recycled from countless other films. For me I really enjoyed the visuals and they kept my interest throughout the film. The eh characters and story only took me out sometimes. So overall I enjoyed Avatar although I don’t think its great. However, the amazing 3D make this one worth a watch.",
      "total_reactions": 1,
      "user": "Jacob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Awsome, Alien, Star Wars, Heavy Metal, and Jurassic Park all wrapped into one spectacular sci-fi thriller!",
      "total_reactions": 1,
      "user": "rocky1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "While I don't think it's the masterpiece everybody's talking about, I still liked it, despite Neytiri being annoying and Sam Wothington's mediocre acting. In fact, I actually saw it in 2d, not 3d!",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I'm sorry, folks. Say what you want about the special effects, #D technology or artwork, but Avatar's story being one used over and over is incredibly annoying and definitely preachy. If I wanted to see a movie about environmentalist propaganda, I'd see An Inconvenient Truth. If you looked back at Dances with Wolves or Ferngully, you'd see this movie. Trust me.",
      "total_reactions": 1,
      "user": "movieg"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "If you didn't get the chance to watch this in theaters, I feel sorry for you. The non 3D version simply isn't as good. Even on a 1080p screen it shows that this movie was more about the experience of watching 3D well done and not the story in the movie itself.",
      "total_reactions": 3,
      "user": "Tubie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Visually mindblowing and irresistibly exciting, James Cameron has created a masterpiece that is a revolution to the film industry. The story may not be new, but carries a strong moral message and has an emotional love story in the background. It must be seen in 3D for the visual splendour to be at its prime effectiveness. I sincerely hope that its sequels do not ruin such a fabulous movie, one which (despite 'The Hurt Locker's brilliance) should have won the Oscar for 'Best Picture'.",
      "total_reactions": 1,
      "user": "Judddy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "It's unfortunate James Cameron is such a delusional hippie. The premise (and funding) of the movie are remarkable; they could have done a lot with it. Instead we are lended to quite possibly the most non-believable plot of the decade. The acting is overdone, and they seemingly spent tens of millions of dollars on scenes where we are watching a bunch of blue idiots pray to a tree instead of using this money/time to further the plot and make it believable. Literally 1/4 of this movie is watching blue people do stupid, tribal crap in a forest. Come on.",
      "total_reactions": 1,
      "user": "MitchC9"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Visualy, I thought the special effects were spot on, even the motion capture animation was brilliant.",
      "total_reactions": 1,
      "user": "ESS180"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "A young man named Jake Sully takes his late brother's place in a mission on a distant world of Pandora. There he learns that Parker Selfridge wants to drive the native humanoid Na'vi in order collect all the material throughout. In exchange for his legs, Jake helps his new friends use their avatar identities find the Na'vi, but he gets lost along the way and finally finds the tribe. As he begins to bond with the tribe and falls in love with the beautiful blue alien, Neytiri, little does he know that Colonel Quaritch determines the destroy the Na'vi as he rallys up the tribe for an epic war for the fate of Pandora.",
      "total_reactions": 3,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I know it was overhyped an'all but i really enjoyed avatar, i must say. But i preferred it without the 3D. I don't think the film's only qualities are 3D and great CGI; i thought it was full of solid acting performances and James Horner did the film credit with a solid, iconic soundtrack. I thought the plot was good and didn't mind the script too much, but obviously nothing could completely live up to this amount of hype!",
      "total_reactions": 1,
      "user": "Alex6"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "The huge amount of positive users reviews on here kills all of my hope about humanity.  This movie was an ego show by Cameron, and the only good part was the innovative effects.  The story was terrible, and tried WAY too hard to send a message.  The acting was garbage, and the world had no depth.  Everyone I went to see it with was very excited about it....but half fell asleep in the theater and the rest of us were laughing the whole time at how stupid it was.  If the money that it took to make this movie was spent on something productive, we'd be on freaking Mars right now.  Sit.kip",
      "total_reactions": 4,
      "user": "dmaar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "YAY! What an awesome movie, it really had everything it needed. Intense battles, deep moments and some slightly scarey themes tied this Sci-Fi in a neat little blue bow, that also glows in the dark and is environmentally friendly.",
      "total_reactions": 1,
      "user": "Clanka"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "The pinnacle of the \"think with your eyes not with your mind\" movement that is currently ruining the fields of cinema, music, and video games. This movie looks astounding in IMAX and 1080p and the special effects are ground breaking. The sound quality is also phenomenal and I can see how it is really easy to get sucked into the eye candy that is being offered up. The script and acting however leave much to be desired and you need to be able to look beyond the pretty pictures. Once you get past the shiny solar panels on the space ships and glowing lights on the alien planet the movie doesn't have much substance. This is without a doubt one of the most overrated movies of all time. I wouldn't go as far as to give it a 1 or a 0 but this movie had immense potential and ultimately turned out to be a giant heap of eye candy.",
      "total_reactions": 1,
      "user": "VAFranky"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Lives up to all the hype, a must watch for everyone. James Cameron is a genius and Avatar proves it. It's a long film but it's one of the best I've ever seen.",
      "total_reactions": 2,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "As the highest grossing film of all time, Avatar is the must-see science fiction movie that is definetely one of the greatest films I've ever seen. James Cameron is absolutely a terrific director for this awesome movie. The special effects and the production design are also wicked phenomenal. Avatar is not only one of the best films of 2009 and the 2000s, it is also one of the best films of all time since Jurassic Park.",
      "total_reactions": 2,
      "user": "NathanG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Avatar is one greatest filming masterpieces of the modern age out striping it's competitors in all areas. The pure originality is mind blowing, the graphics stunning and the characters credible and flawless. The plot apart from being brilliant explores themes and circumstances not unknown to our world, enough to make American politicians and military to squirm in their seats. David Cameron reminds us of the capabilities of modern film-making and the the crew that make them happen. Avatar has set the standard and will be remembered as the film that truly made film-making an art form.",
      "total_reactions": 1,
      "user": "Creativita"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "If this movie actually cared for other stuff than the art, the designs and the SFX (which are all fabulous); I would give it a perfect 10. Unfortunately, the story is incredibly average, not bad, but average. I truly expected more from the director of Titanic, The Terminator, Aliens, The Abyss, True Lies... etc; but hey, congrats to the man: Avatar is the highest grossing movie of all time ($2,782,275,172), and Titanic is second. So hat off to James Cameron. But if only they had spent so much money ($237 million)  for a script that was at least worth it.",
      "total_reactions": 1,
      "user": "Roeyl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "\"Avatar\" is as visually intriguing as its impression on the viewer is enjoyable. Its contents make for a recipe that appeals, in atleast one respect, to critics of all facets of interest.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The story is a Science Fiction adaption of Pocahontas. The movie shows that colonialism leads to the destruction of nature due to excessive exploitation of the land, and further to suffering of the native people due to the accompanying displacement of them. Moreover, the movie supports a holistic world view, describing a harmonic interconnection between the indigenous people, flora and fauna. The natives live in harmony with animals and nature. At one point the War on Terror mentality is criticized, when the humans explain their attack as a means of protection from the \"savages\". However, they were the ones who stole natural resources from foreign soil and threatened the natives in the first place. Fascinating pictures, dramatic showdown.",
      "total_reactions": 1,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "I've had mixed feelings through the months regarding this film. The day I watched it for the first time, I thought it was the most amazing sci-fi movie ever, with outstanding visuals, music and design. The day after, I realized that the plot was way too predictable, corny and cliche, and that some acting was borderline B-movie. Now, I've watched the film for the third time, and I have reached the conclussion it is one of the best films of the decade. Yes, the plot is nothing new or original, but James Cameron manages, just like he did in Titanic, to give it just enough emotional impact and even provide a good message about racism, enviromentalism, imperialism, the dangerous potential of capitalism, and the treatment of Native Americans and other \"uncivilized\" cultures through history. In the end, Avatar is trully a great film and an instant classic.",
      "total_reactions": 2,
      "user": "Goldheart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Have you seen \"Dances with Wolves\"? Well, this is a 3D hyper-technological version of it, with very few differences between them. I'll be honest: this movie was good, but I knew the plot from the long run and, aside the flashy 3D graphics and the animation, it has nothing much to offer: it tries to impress with its scenery, character developement, alien backstory, enemy's reasoning and desperation and such, but in the end you'll hardly even hear any and just want to see an action scene! There's just nothing impressive at all in this movie: the main character is just uninteresting, the lover is just there, the enemy are the usual greedy people wanting to get their stuff  and action is...good actually, and the scenery, while I admit it was well done, it just doesn't impress anymore: we had an overload of CG graphics already, and if they have to use it, use it so it doesn't bore us! We are tired of super-yet-fakey-realistic CGI graphics that are obviously fake: videogames could and actually did better than you did!!!",
      "total_reactions": 1,
      "user": "vahn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "A film that has captured a global audience, Avatar is nothing short of amazing. The effects are unbelievable, the story is arguably original enough, and the performances are good with Saldana giving the best. The film lacks in the score department. While effective, I believe the score could have packed more of an emotional punch. While this film did not capture Best Picture, I think it is all the better for it. Avatar will be remembered far longer than The Hurt Locker. Cameron knows how to make movies that have widespread appeal and that's what making movies is all about.",
      "total_reactions": 1,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "This movie, is in my opinion, the best film of 2009. This movie shows how great James Cameron is at making movies. Great special effects, awesome fight scene and it has the perfect blend of action, sci fi, romance and fantasy.",
      "total_reactions": 1,
      "user": "pwnstar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "I thought that this movie was really bad. It was incredibly long and barely kept my attention. The special effects were cool but that doesn't change the fact that all James Cameron did was make a futuristic remake of  Dances With wolves. NOT a good movie.",
      "total_reactions": 1,
      "user": "JAM123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "James Cameron has succeeded where George Lucas failed.",
      "total_reactions": 1,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "I thought it was a great movie. good story, good acting, amazing special effects. I understand the plot is just not good enough for some of the experts, but this is a really good film.",
      "total_reactions": 1,
      "user": "jc15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "The first time I heard about avatar it made me think about a flying monk with a stick to wack guys with. But when I saw the trailer then I got more interested in it. Turns out its all about a disabled ex-marine who fills in for his twin brother (because he was shot by a robber), to go to a distant planet. In order to become part of the avatar program (the DNA of the user and the indiginous natives, that was fused together in order to befriend them). He has to befriend them so that the other humans can get a rare element that happens to be under their home tree.it turns out that the real bad guys are us. Well thats all I'm going to say exeppt that it is one of my favourite movie. And the best movie ewer made. Can't wait till avatar 2.",
      "total_reactions": 1,
      "user": "KgnDavel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is really stunning. The effects and CGI are amazing, and it has a great storyline. Years of planning put into this payed off. Pandora was designed really well, and the battle scenes couldn't have been better. The \"avatars\" were played by real actors and filmed on a motion capture studio, and they done really well. the film was really well made, and I can't think of many ways in which it could be improved upon.",
      "total_reactions": 1,
      "user": "MediaCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Amazing special effects! Some people don't like the story of this film but I do. It is very fun and it was worth it to see this movie. The large budget really shows that a lot of work was put into this movie",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "It's the number one blockbuster of all time. It used every inch of its over sized budget to create one of the most spectacular set of effects ever seen. Yet despite its crowing achievement, AVATAR is not Cameron's best works, too distilled for a more general audiences. Not as great as his classics such as Aliens or T2, but more palatable for the masses. At its heart, it's a love story told countless before. This simplicity allows it to become a film that transcend different cultures, but it is also its main weakness.  Yet despite all that, it is still well acted and has pioneered technology that is currently influences other film makers today. Again, just like the Dark Knight, another blockbuster classic too populist for the OSCARS.",
      "total_reactions": 1,
      "user": "dharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "This movie actually shows the real history of humans that how we where and then what happend to us after a perfect golden age and how we all were one and closed to each other and the nature.",
      "total_reactions": 1,
      "user": "Shahnameh"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "People bashed it cause it was a big budget film and the focus of the previews and reviews were on the special effects, however this is one of the best sci-fi movies ever made, filled with hidden messages and real implications for our future. If you refuse to see it because it was a highly publicized blockbuster, than you are an idiot!",
      "total_reactions": 3,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "One of the best movies I've seen this year - and one of the best movies I've seen overall.",
      "total_reactions": 1,
      "user": "oxana"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "After taking nearly four years to finally see this film, I am quite impressed. The story may verge on Dances with Wolves but it is still a powerful one and so beautifully shown.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Avatar is as imaginative and innovative as a movie can be, but it is only enjoyable on the big screen, the biggest you can get, and in 3D. Another problem I had with this film is that once you have seen it for the first time, it's impossible to re-watch it without feeling tired of it.",
      "total_reactions": 1,
      "user": "dudu_95"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "La mejor pelicula de ciencia ficcion desde The Matrix. Avatar es simplemente extraordinaria. Un filme romantico e visualmente fantastico que nos presenta problemas reales. La historia puede que sea poco creativa, pero la trama, los elmentos que Avatar posee la hacen ser perfecta. La verdad es que fue sorprendente, no solo visualmente, sino ademas que presenta problemas causados por humanos. Cameron lo hace nuevemante, esta es definitivamente su mejor pelicula. No es solo un filme, sino la razon por la que vamos al cine.",
      "total_reactions": 1,
      "user": "ObbiePR18"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Cameron hit on special effects but other than that, unoriginal in story and slightly boring. Too much CGI for my liking. Very well done effects but the story falls short of new and/or exciting.",
      "total_reactions": 1,
      "user": "jedijared182"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "A great vision, with more than excellent visual effects, some of the best I've ever seen in fact. Despite this, the film drones on for the last hour with battle sequences. If you're not a hardcore sci-fi action fan, it'll put you to sleep.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Avatar 10/10..........................................................................................................................................",
      "total_reactions": 1,
      "user": "hardkor33"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Barring the by-the-numbers story, James Cameron's \"Avatar\" retains a supreme amount of imaginative prowess, accentuated by superior CGI/mo-cap work and a knockout score from James Horner.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Truly Avatar was a mastermind. Was. Cameron gives the plot too many things to keep up with, not only that but it gives you an unpleasing run time that will leave you bored till the end. Now for the people who disageree with me and say its an all time epic film your wrong. Watch it again and you'll realize how boring and forgettable the last battle of the movie was. So overall, this was a very exhausting film to watch.",
      "total_reactions": 1,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "When I first saw Avatar in theatres a few years ago I was simply awestruck.  It is without a doubt the most visually beautiful film ever made.  The world of Pandora is as detailed and alive as any setting you'll ever find in a movie, and quite possibly even more so.  The story may have been done many times before, but it's still very engaging.  There are moments that are powerfully charged with emotion, the direction is flawless, and the scope and scale are both breathtaking.  There is also an extremely resonant atmosphere throughout.  James Cameron has created what is quite possibly his best film.  It's an instant classic, full of deeply human and resonant emotion, groundbreaking visuals, and viscerally stunning action.  My only real complaint is that the dialogue can be somewhat clunky, but the rest of the movie quickly sends this to the realm of nitpicking.  Please choose to watch this instead the next time you even think of checking out one of the lousy Transformers sequels.",
      "total_reactions": 1,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the best motion pictures I have ever seen. There were some really lovable and heroic characters, and very interesting ideas. The environments are amazing and the whole thing has allusions to the Indians and Trail of Tears. The ending brought me SO much satisfaction too. Get the Blu-Ray!",
      "total_reactions": 1,
      "user": "UntoldAv3nGer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Avatar is the poster child for 3D cinema yet its other qualities are distinctly one dimensional, apparently 200 million dollars can't buy you a good story. Anyone who watches this is in for a headache-inducing three hours that they will never get back.",
      "total_reactions": 1,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "I'm not really a fan of big budget movies  except for Titanic  i think having a big budget movie will make it hard to maintain the story and the actors performances and aside from the fact that this movie in 3D i think James Cameron did a spectacular job with the visual effect and all that technological stuff  but is the story solid  NO is the performances good  NO is the performance by Sam Worthington the leading actor memorable  Hell NO he can't act  so we left with nothing good and memorable  also the story is unstable and messy so for me a solid 6 out of 10 fit to this movie.",
      "total_reactions": 1,
      "user": "ExKing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Simply one of the best films.",
      "total_reactions": 1,
      "user": "BestNoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "James Cameron's thrilling film starring talented actors like Sam Worthington, Zoe Saldana and Sigourney Weaver will always remain a favorite to many of its viewers. Special effects were jaw-dropping and unbelievable.",
      "total_reactions": 1,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "This was awesome. Really outstanding. This is Crysis of movies, I will never forget when I watched this for the first time in IMAX, my mind got blown away - I really saw the future of cinema world. Today it might be not so bright as it was in 2010, but five year ago this movie just kicked out!",
      "total_reactions": 2,
      "user": "Violett"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "Definitely the best movie i've ever seen in many years!!! Great effects, great acting. great music and everything is PERFECT!!!! I'm into this movie, and i'll never forget!",
      "total_reactions": 2,
      "user": "lamsokul"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "What an amazing movie and the ability to bring the viewer deeper into the realm of new belief is not comparable. James Cameron was able to strongly voice opinions through the characters and situations presented in Avatar. From the story line all the way down to the visual effects, the movie was spot on for its delivery point.",
      "total_reactions": 1,
      "user": "demk3653"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Epic. I really liked it!! James Cameron is the best film director ever. The 3D was amazing and the special effects too!! Do not miss it! Simply amazing!!",
      "total_reactions": 1,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Masterpiece!",
      "total_reactions": 1,
      "user": "MetalFoX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "James did a awesome job making this movie. I saw the trailer, asking my parents badly to let me see it. Luckily they said yes. I walked out of the movies thinking \"This is my favourite movie of all time\". It still is. I got the blu-ray and never regretted it.",
      "total_reactions": 1,
      "user": "reviewmatt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This is one of the most amazing movies i´ve ever seen. The special effects are astounding, and i think it is also an artistic masterpiece. The landscape, plants and animals were brilliantly designed, the characters´development in the movie is correctly achieved and the story is interesting. It is a very good movie filled with beauty, majesty and lot of creativity. I highly recommend it.",
      "total_reactions": 1,
      "user": "YJGNatera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "It's so well produced that the visuals and sound of the film will make you feel like you really are on a different world. However, the below-average plot (which is typical, done to death and extremely cheesy) will probably spoil your enjoyment.",
      "total_reactions": 1,
      "user": "destinyx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Avatar is an amazing visual spectacle to look at, and is pretty much the definition of eye candy. But, the movie distracts you with the beautiful scenery while it lacks enough story to fill its own shoes.",
      "total_reactions": 2,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is the complete in-theater experience. Watching it at home, it still holds up well, but in theaters, especially IMAX, the movie was absolutely stunning. It was an engrossing ride, that uses its atmosphere to draw you into the world and apart of the story.",
      "total_reactions": 2,
      "user": "Casual-Critic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "The movie has good visuals and can be entertaining if you don't think too much about the cliche storyline.",
      "total_reactions": 1,
      "user": "Klotz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "It's a visual masterpiece, but a narrative disappointment. It immerses you in it's magnificent world, rather than entertaining you with it's story. But, the story isn't bad. It is really decent, actually. It just falls short with it's predictability. However, it's one of those few films that impresses only with the beautiful scenery.",
      "total_reactions": 1,
      "user": "DaEagle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "a true James Cameron masterpiece with its dazzling visuals and special effects, to its unique telling of a story that we have heard over and over again (save the trees!).",
      "total_reactions": 1,
      "user": "demolisher7778"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Avatar takes it away with its beautifully well done cinema and sfx, but i kinda agree with the critics the story wasn't strong enough to live up to its magnitude. The part before the ending was kinda stupid because it didn't give much detail on how all the humans on Pandora were dealt with.But i did like how jake Silly got a new functional Avatar body, Permanently. This opens windows for potential sequel and hopefully a more heart gripping story with twist and confusion, because i felt that this one was lacking on those.",
      "total_reactions": 1,
      "user": "MetaCryptic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This film is simply amazing! The amazing visuals and a gripping, emotional story makes this one of my favorite films. James Cameron definetly knows what he is doing,  there is just so much detail packed into the world of Pandora. There was clearly a lot of effort put into this project.",
      "total_reactions": 1,
      "user": "Zepheem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This is my favorite sci-fi movie of all time.  Fantastic visuals, fantastic characters, and fantastic dialogue.  It's amazing how those three things are interwoven to create a simply amazing movie.  It's really a world you can get lost in.",
      "total_reactions": 1,
      "user": "BigDegs29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "It may sport more visual than substance, but \"Avatar\" -- thanks to James Cameron's directing -- is still a satisfying 3D movie despite its formidable length.",
      "total_reactions": 1,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "“Avatar” is one of the greatest movies to ever hit the big screen, and this is seen on the box office hits. At almost $3 billion, “Avatar” is the number one grossing film of all time. The film used an excellent plot, infused with action, romance, and drama, all while hitting home a true message. The message that the movie delivered can touch anyone that is able to view the 3 hour-long eye candy. The movie budget approached $300 million, adding a quality never before seen in cinema. This movie was a cinematic breakthrough, intertwining computer graphics with live acting, creating names for unknown actors, and leading critics to rave over the top film of all time.",
      "total_reactions": 1,
      "user": "teddyg1996"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "There's no way to deny the fact that Avatar is a true masterpiece when you've just came out of the cinema. The story is full of heart-breaking moments, and the CGI is way above reality. But the most important thing is that, Avatar is the best film you've ever seen!",
      "total_reactions": 1,
      "user": "Tomle1202"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "While the story is not original in the slightest bit, it was executed very well and the effects were beautiful.  The acting wasn't particularly good except for Sigourney Weaver (but she's always good), and the dialog wasn't particularly memorable either, but the action is more than enough to keep you interested.  I also highly recommend you get the 3D edition, as this is the only film I've ever seen that actually looks better in 3D.  In the end, I honestly can't understand all the hate it gets.  It may not be original but it is executed well and it has great action and effects.  I'm not usually one to jump on a bandwagon with directors and studios, but I may have to make an exception with James Cameron.  I have yet to see a Cameron film that I didn't like.",
      "total_reactions": 1,
      "user": "SkyrimGuy935"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Jake Sully is a former Marine confined to a wheelchair. But despite his broken body, Jake is still a warrior at heart. He is recruited to travel light years to the human outpost on Pandora, where a corporate consortium is mining a rare mineral that is the key to solving Earth's energy crisis. Because Pandora's atmosphere is toxic, they have created the Avatar Program, in which human \"drivers\" have their consciousness linked to an avatar, a remotely-controlled biological body that can survive in the lethal air. These avatars are genetically engineered hybrids of human DNA mixed with DNA from the natives of Pandora... the Na'vi. Reborn in his avatar form, Jake can walk again. He is given a mission to infiltrate the Na'vi, who have become a major obstacle to mining the precious ore. But a beautiful Na'vi female, Neytiri, saves Jake's life, and this changes everything. Jake is taken in by her clan, and learns to become one of them, which involves many tests and adventures. As Jake's relationship with his reluctant teacher Neytiri deepens, he learns to respect the Na'vi way and finally takes his place among them. Soon he will face the ultimate test as he leads them in an epic battle that will decide the fate of an entire world.",
      "total_reactions": 1,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I like Avatar, because it boasts stunning visuals, and invites the audience to an unbelievable world that looks great. That being said the plot is anything but original, you can compare the plot to Ferngully, Dances With Wolves, Pocahontas, and many other films, on top of that the characters are plucked out of those films to, so while it's visually stunning, Avatar is in my opinion not a great film, but still a good film.",
      "total_reactions": 1,
      "user": "tjman09"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "The visuals are very impressive and the story is well thought out. Although, as you watch it more and more, you realize that isn't as spectacular as everyone says it is.",
      "total_reactions": 1,
      "user": "emlugo123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "James Cameron makes a triumphant return to the box office with Avatar. Avatar is the highest-grossing film of all time and it's not a surprise. The film is a futuristic western that showcases the best CGI, cinematography, and action that Hollywood has to offer. Although the story is pretty predictable and borrows many elements from other movies such as Pocahontas, it still manages to keep the audience engrossed in Avatar's spectacular universe. The superlative visuals in this film are absolutely breathtaking. The beautiful creature designs, environments, and action sequences take CGI to an entirely new level. Cameron has created a wonderful universe to expand upon in future sequels. Although Avatar is not perfect, it is definitely the best eye candy ever made.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "the environbment is realy important and peopl do note understand e that it needs protect. this movie says thaew environment is protec4t and i respect it for that so it make god movies. james ceeameron is myf ather figurte anded sad... like this moviesz. i like how rhias movie connects to teinetanic.... cuz leonardoo decaprio was in the end in the blue trwwe, and i creid becus i thought he ded... it remindedfrg me of mi childho9ed becaused whey i was yung i wa blue and ded. good job caemerin you make made kate whihslets cry in this movie right????? i give 10",
      "total_reactions": 1,
      "user": "alexo774"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "When his twin brother is killed, disabled ex-Marine Jake Sully is recruited to aid a mining expedition on the distant jungle moon of Pandora as only his DNA will bond with the alien hybrid body, known as an Avatar, that allows humans to breathe the toxic air. With orders to infiltrate the Na’vi, Jake finds himself falling in love with native girl, Neytiri, and complications soon ensue…",
      "total_reactions": 1,
      "user": "EddyGregs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "There's a reason this movie made so much money. It's not just the incredible CGI but also the imaginitive world that drew so many people in. The base story is pretty basic: the humans want something and will take it from the alliens by force unless Jake Sully can convince the aliens to hand it over. It evolves into a tale of learning their customs, bonding with them, and eventually siding with them (them being the aliens). I can't say it's \"platiinum status\" but I've watched it at least four times and I still enjoy it (and again, the plot is not garbage).",
      "total_reactions": 1,
      "user": "Epik_Ninnja"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Earth is overcrowded and certainly not a place I would choose to live in, but Avatar has a solution. Or perhaps a way to make money. Avatar is the highest-grossing film of all time and I can certainly see why. It had aspects that appeal to a lot of people with the mix of animation and live-action and the themes present throughout that definitely sparked conversation within. Jake Sully is a paralyzed marine that is easily set up as a hero from the start, and this story is about him and his (and human's effect on Pandora.",
      "total_reactions": 1,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "In my opinion, Avatar is the most visually striking movie ever made, no thanks to it's James Cameron, if you remember he was the director of Terminator 2: Judgement Day which was also and amazing movie. Avatar is so realistic you could mistaken it to be 100% real. The story is the heart of this film as it drags you into the world of the planet Pandora which is inhabited by humanoids called the Na'vi. The actors and actresses are unbelievably amazing all of their performances, like Sam Worthington who plays Jake Sully, the wheelchair bound veteran who is given the job to control his dead twin brother's Avatar so he can convince a Na'vi clan to move away from the part of the jungle that they are in because the way of the RDA's path of the search of the rare metal Unobtainium that lies in the soil of the planet. Then we have Na'vi woman named Neytiri who is the clan leader's daughter, she was forced to train Sully to become one of them, which eventually makes them fall into love. Everybody else gave an A+ performance which was amazing. It will be a very very long time before we see another so incredible like Avatar and a while before another breaks it's massive box office record as the top grossing film all time with earning of $2.7 Billion.",
      "total_reactions": 1,
      "user": "Th3GreenHorne7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "We can say that this movie is incredible therefore raised 2.7 billion do not expect to create an award-winning movie , James Cameron great job as well as in Titanic and Terminator is now attacking once more with Avatar .",
      "total_reactions": 1,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "It's only a matter of time before this movie gets beaten by Star Wars: The Force Awakens at the box office worldwide after all the work this movie did to beat Titanic's record. I don't really understand all the hate for this movie. I thought it was fine.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "One of the best movies I have ever watched. Specially, the story-line, the concept is spot on! And great all-round acting. No doubt it became one of the best box-office hits of all time!",
      "total_reactions": 1,
      "user": "Pamuditha007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "This would have been one of my favorite movies of all time if it weren't enough for more awards, more 3D special effects and a greater depth in the story, this movie would have been more epic. The music overall was one step down from Titanic.",
      "total_reactions": 0,
      "user": "jwt7000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "a perfect screenplay with emotions tragedy some edge of seat scenes and a touching climax. the cast performance is good. but what makes this movie a blockbuster!!  the main reasons include the perfect background score during the scenes that motivate the viewers. the picture perfect cinematography and the most visual effects ever seen. editing is also cool and does not drag. i was not bored anywhere. it was a perfect movie and one of my best action movies.",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Alright this is an enjoyable movie, more so than most other blockbusters available. But that's just it, it's a block buster, the story is basically pochahontas with smurfs (just ask trey parker and matt stone) but nonetheless you will find yourself sucked in by the very pretty world of pandora. If you are an independent film maker or stuck up critic you will hate this movie with a passion, fortunately though most people can't be classified as such and can accept a movie for what it is, a bit of entertainment. Either way this is certainly worth seeing, more so than some higher brow  films.",
      "total_reactions": 0,
      "user": "nunchuks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Now Avatar is one of those movies you see at the movies and love it more than anything else after seeing it. However when you watch it again you realise it was because you were so overwhelmed with the small things in the film and focused on the fantastic parts instead of anything else. I thought that way after seeing it but Avatar will never live up to the likes of Star Wars, Blade Runner, E.T. or Inception as examples of sci-fi films that will never have equals.",
      "total_reactions": 0,
      "user": "Pixarlover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "I never understood the hype behind this movie. It had great special effects and plot (related to nature) and cast a shadow on how humans are diverging from this sync to nature. Although everything was great the hype for it was overrated. The movie was nothing more special than any other movie. It was 4hrs long but I wouldn't say it got boring - it did lag at times though. As always it did have alien sexuality if thats what turns you on - maybe thats what got it hype.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "The good thing about the film is the technical side of it, good acting and they even got Sigourney Weaver involved.  Thats about it really, the bad side is the story.  Its obvious what is going to happen, to be fairly honest its Pochahontas that has been altered, and is set in the future",
      "total_reactions": 0,
      "user": "Matt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Slightly overrated but it was entertaining and I wasn't really bored once throughout the whole movie so kudos to that. It was a good movie, and I'll leave it at that, nothing about the performances were spectacular, just an all around good movie.",
      "total_reactions": 0,
      "user": "BrendanL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I'll admit, with all of the hype that surrounded this film, I was sceptical as to how good it could actually be, and was waiting for it to fail. Oh, how wrong was I? Avatar is a brilliant film. I saw this in 3D earlier this year, and in 2D just the other day, so I feel I can give a review that isn't biased with just one setting of the films view. I'll just clear the air, state the obvious here and leave it in the dust: The film in 3D is an AMAZING experience. The way in which you see these spectacles James Cameron has created, it will burn itself into your memory in a good way. 2D has you focus less on the spectacles and more on things like the story and the characters. Now, to the films actual review Avatar is the tale of Jake Sully, a soldier who takes over from his dead brother on a science project, which temporarily has his mind transferred into an Avatar body, to help the military in their quest to take a substance from Pandora (the planet). From there on, he lives amongst the Na'vi (the race the Avatar body is based upon) and begins doubting where his allegiance lies. I'll admit, the plot isn't anything complex or original. It's been done before, and you can basically guess where the plot's going to go. \"They're gonna rebel\" \"His truth will be discovered\" \"He's gonna question his motives\". And you knew they only introduced the Toruk so Jake could master it. Also, was I the only one who didn't like the guy playing the boss? I mean, he was great in Friends and My Name Is Earl, in comedy roles, but for something serious like this, it just didn't seem to suit him. And the oxygen on Pandora was toxic to the humans. How exactly does it work? Stephen Lang's character had quite a time of exposure to it (when chasing them escaping on the helicopter, when he shot Grace) and seemed fine. And Jake as well. He was exposed for an amount of time, possibly longer, and ended up fine. Anyway, thats the negatives out of the way. Now the positives The world of Pandora and its inhabitants was a marvel to behold, even in 2D. James Cameron has a very creative mind. Just look at all of the creatures, from the Hammerheads, to the four-armed monkeys. Not just that, the technology as well.How info could be moved from one screen to another with just a flick of the wrist, and the handcuffs. I'll say it again, James Cameron is one creative guy, with one hell of an imagination. Shame about his acceptance speeches, though..... The way CGI contrasted with the humans. It didn't seem to contrast much. When (Avatar) Jake was carrying Grace, it didn't seem like one big clash of reality and Computer Generated Images, they seamed together perfectly, like two pieces of a puzzle clicking together. I liked how the characters developed. How Grace went from a no-nonsense **** to how she was warm and a good friend to Jake and Norm. I especially liked how Norm changed from a goofy scientist to him punching out officers and joining in the big battle. The final battle: What a marvel! Just the contrast of the flying Dragons (or whatever they are) versus the gunships. Just basically how it was Nature VS Machinery. I think it's safe to say that there was no shortage of awesomeness within that battle. Shame Tsu'tey was killed off. Just as I was getting to like him. Once Jake first woke up in his Avatar, when he first went from standing up to running through the outdoors, I felt for him because in human form, he's confined to that wheelchair, but as a Na'vi, he's no longer confined. I also felt James Cameron placed some parallels for the Iraq war within the movie. One group going to another land in order to take something that they wish, resulting in a battle. And Stephen Lang! His turn as a villian is quite menacing, especially in the cold hearted way he just bombs the Tree, the home of the Na'vi. I felt that he was the perfect counterfoil for Sam Worthington's Jake Sully. All in all: It may seem like it mainly concentrates on the visuals, and it's plot development may be by numbers, but this is definately a film you must watch!",
      "total_reactions": 0,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "The writing behind James Cameron's AVATAR is so god aweful that half way through the movie the only motavation I had to stay and watch is so that I could compile a list of reasons why I hate this movie. Every character in this movie is a cliche'  or a stereotype such as The Austrailian-American Mariene, The Scientist, The War Hardened Badass, The Egotystical Buisinessman, and many more! And what little of a story AVATAR has is covered up by the horendous CGI. The technology behind the CGI is impressive but it is hardly artful often lacking patern and flow, or anything else visually appealing. Instead they overuse CGI in what can only be described as a head-ache indusing high contrast orgy. The movie is way too long as well. It would be nice if it served as a 10 minute tech demo, but the 3 hour embarassment to all things filmlovers truely value is less than nessary. In conclusion If you want to remain brain dead for 3 hours of your life and leave the theatere with no questions, need for thought, or questioning morality, watch avatar. If you truely value films, please skip this movie!",
      "total_reactions": 0,
      "user": "XLR8TER"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "One point for phenomenal visual effects and a visual imagination that runs amok.  As for the rest, the story line, and more importantly, the message it conveys, it is downright painful.  The message being that of an all-powerful imperialistic, capitalistic and militaristic power being defeated by bows and arrows in a completely silly, unbelievable battle.  Which in this day and age reminds one too much about the American empire projected into the future to the nth degree of violence and sheer stupidity, with all its arrogance and capitalistic values.  A great message to the rest of the non American, non Western world . . .  The irony is, it is made by a Canadian who comes from a country that is the opposite of imperialistic.  If I didn't think that Cameron takes himself too seriously to do otherwise, I would think that he mocks America by using every clichÃ© there is in American cinematography and serving it up to them as if to say:  here, as ugly as that country's culture and values come.",
      "total_reactions": 0,
      "user": "Ricochet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Avatar is a really mixed bag. It's good points are awesome; Sci-fi on a grand scale, fantastic action sequences and a return to the colonial marines aesthetic of Aliens. It's bad points are equally annoying, though; It's overwrought in the extreme, it has a paint-by-number script and commits wholesale theft from Dances With Wolves. Ultimately, however, Avatar scores an inevitable victory from the simplest of notions. It makes us want to see the bad guys take a monster ass-whooping!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "A well-crafted masterpiece. The visual effects are probably the best since Star Wars. The story is amazing, the characters grow into you and the music was beautiful.",
      "total_reactions": 0,
      "user": "greengobbie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "If you think this movie is all 3d effects and no story and is totally rubbish, think again. Yes, the special effects are brilliant, but so is the story, although you have to dig really deep to find it. Here's a quick summary: A guy is asked to join the American Army after his brother died. He is asked to go undercover as one of the indigenous um... whatever they're called. The blue things to provide research for the Army. Or  is it the Air force? Ah, anyways. The General then reveals the blue things' home planet, Pandora will be a second planet to Earth for humans to live on. Then he decides to launch a full on attack on Pandora and the blue things. Then the main character breaks the Army, Air Force, whatever's trust to stop this from happening. If you want to see the movie then I won't fully spoil it for you, but ignore the people saying there's no plot or the plot is bollocks and watch it. Oh, and don't watch it in 3DTV. I could have been close to having a migraine watching it at the cinema. The number nine says it all...",
      "total_reactions": 0,
      "user": "Bathmat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "A very nice 3d movie with a lot of effects and well done graphics. But the story it really sucks. I was very very disappointed after watching the movie. Nothing was original in the idea: the Matrix two worlds, the tree with the eternal life where all the spirit are gathered, the eco 'not to destroy the forests' idea.... very, very disappointed.",
      "total_reactions": 0,
      "user": "ovi_bz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Ten years after TITANIC, People are waiting for James Cameron next project. AVATAR is Cameron ambitious project to explore the special effect better than ever. From his filmography, such as: ALIENS (1986), TERMINATOR (1984), TERMINATOR 2: JUDGEMENT DAY (1991), TRUE LIES (1994), and TITANIC, we should not doubt Cameron resume. In 1997, TITANIC won 11 Oscars, to be equal with BEN-HUR (1959) as all-time best achievement in Academy Awards. Casts of AVATAR are: Sam Worthington, Michelle Rodriguez, Giovanni Ribisi, and Sigourney Weaver (who already became Fighter-woman Icon in Cameron ALIENS).  Thiz movie has a unique story that reflects the originality of the script. While we were watching AVATAR, made us did not realized that 90% of the movie is actually animation. The technology itself has reached the new level of breakthrough. They definitely already set up the bar so high to be challenge in the coming years. The stunning moment that I like to watch over and over again is the night scene of forest landmark. The forest describe fills with unique plants shine and glow on surroundings. There is something mystique and beautiful about that scene. The great thing I like about AVATAR is that the theme about environmental issue is very strong. Overall, in my opinion, Thiz movie also had a tremendous hidden-philosophy inside about human need, environmental, and human heart. Like I said before, Open your eyes, The dream is over.. Close your eyes, It is still a dream. The Blue-man rocks!",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Avatar is a great movie. Spectacular CGI special effects, strong cast and an entertaining story plot. This is a must-watch, even if i only gave it a score of 9.",
      "total_reactions": 0,
      "user": "Canamavrick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "avatar is David Cameron's latest movie, and sure its one of his worst pieces, but what did people expect, did they expect a smurfs movie? i hope not. to be honest its not the movie's fault that its over rated. its the ads and everyone's hype, i give it a 6/10",
      "total_reactions": 0,
      "user": "oscarstrok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "A shamelessly bloated sci-fi \"epic\" built around a story that manages to slip into a deficit of surprises, characters so cliche you could almost quote them during your first viewing, an alien culture that's as deep as any Native American stereotype, and an environmental message delivered like a sledgehammer to the skull.",
      "total_reactions": 0,
      "user": "Nomaic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This is literally one of the greatest films ever made, in my opinion there are only two things wrong with it one being that the adventure has to end and the other that none of it is real",
      "total_reactions": 0,
      "user": "yeti_san"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "A film which certainly relies too much on its special effects. Peel back the visuals and you get a weedy storyline, ending in a an overextended battle. Having said this, I love the feeling of old against new traditions and the Avatar World is incredibly creative and involving. The music is also very magical.",
      "total_reactions": 0,
      "user": "J42Hmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "How is this thing up for Oscars for best film, I will admit that the movie looks stunning and you do get slightly drawn into the characters witch is good because they are blue aliens after all but if all the world needs is a good story and amazing special effects (most of which was done real in Christopher Nolan's great Inception), then why don't people just watch Inception. This movie did not live up to the hype.",
      "total_reactions": 0,
      "user": "codfather96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Nice film.Almost great film. the 3D was too overwhelming. I prefer the the original version of the film. Kudos to Worthington and Cameron.Almost great film. the 3D was too overwhelming. I prefer the the original version of the film. Kudos to Worthington and Cameron.Almost great film. the 3D was too overwhelming. I prefer the the original version of the film. Kudos to Worthington and Cameron.",
      "total_reactions": 0,
      "user": "gengrenjie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Avatar es una obra maestra para muchos, pero una simpe pelÃ­culita con efectos especiales para muchos otros (me incluyo). Avatar es una historia dirigida por James Cameron, que no abarca ningÃºn interÃ©s para verla proximamente en cable, ya que nos dormiriamos a los pocos minutos de empezados. James Cameron hizo pelÃ­culas aburridas como Titanic, y otras. James Cameron se cree un director revolucionista, pero no lo es en lo mas mÃ­nimo, ya que sus pelÃ­culas tienen una mirada hacia lo polÃ­tico, hacia el poder, y se encuentran con doblajes casi patÃ©ticos a la hora de construÃ­t a sus personajes con un idioma bien caracterizado. Avatar es una basofia humana en un mundo lleno de bichos azules.",
      "total_reactions": 0,
      "user": "Pepo12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This is such a great movie, I'll say I've seen it at least 100 times now. This movie started a whole new era for films, and it was a shame it lost out to The Hurt Locker at the Oscars! Full of action and amazing locations for the lush jungles of Pandora, this is truly astonishing! Sure, the game wasn't that good but James Cameron made up for it in this movie, definitely. Anyone else agree that the war is the best part of the film?",
      "total_reactions": 0,
      "user": "TheCritic1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Pocahontas, BLUE KITTY VERSION. Honestly, there's not much else too say. The visuals are good, but since when does something shiny make everything else unneeded? Gotta love the fervent anti-human nature of the film as well. Let's all hate our evil greedy selves, right? Blue kitties totally superior.",
      "total_reactions": 0,
      "user": "Paradosi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "This movie is a great one. I wish the battle scenes would have been more epic, but I really can't complain too much. Not the greatest movie ever, but very great. Great graphics and a decent story.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "I don't care if it has the SAME EXACT PLOT as Pocahontas or a lame, cliche theme!",
      "total_reactions": 0,
      "user": "andie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "James Cameron has created a masterpiece that will be remembered for decades to come. Avatar was the best movie of 2009 by far. Avatar surpassed the expectation and is the top grossing film of all time, The stats speak for themselves.",
      "total_reactions": 0,
      "user": "Jcrank42210"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Cameron continues his time honored method of creating films.  Swipe the high concepts from a half dozen groundbreaking original works, glue them together with a lowest common denominator script, add money, a lot of money, an extraordinary amount of money, hype thoroughly, make more $$ back, and take credit for everything.  Hail to the King.  Avatar looks incredible, yadda, but to say the story is derivative would imply the origins of its ideas got their due.  They never have in film, and now they won't because Cameron robbed the cradle.",
      "total_reactions": 0,
      "user": "spacecaptain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "Probably one of the most overrated movies of all time. Can't believe people can call it an instant classic. nor that it's ranked in the top with really great movies such as The Godfather and Shawshank Redemption. It doesn't deserve to be among the top 500 movies on IMDB. Read any positive review and all you hear is how cool the visuals are, how the CGI is breathtaking and so on. What they don't tell you is that the plot is basically written by a 5-year old. Avatar is a big, fat, tired old clichÃ© with a dazzling new paint job. Most of the \"plot\" is derived from old and often better material, basically the whole \"Sorry about Colonialism\"- and \"The Noble Savage\"-genres that include movies and books such as Dances with Wolves, A Man Called Horse, The Last Samurai, The Last of the Mohicans, Dune, Lawrence of Arabia, Ferngully, Pocahontas, Robinson Crusoue, The Thin Red Line, Moby Dick and many, many, many others. The acting, while not bad is not memorable either, nor are the many stock character suck as Jake and Grace. In fact, Avatar has none of the hallmarks of a classic: great script, superior acting, memorable characters that you root for or even suspence or immersion. Everyone is so wooed by the visuals, but great visual by itself doesn't make a good movie. I doubt people will look back to this movie in 50 years time and consider it a classic, especially in ten years time when the CGI starts to look really dated. At it's best Avatar is a good popcorn movie, you sit awed for about two hours but after that it's easily forgettable, and it deserves nothing better.",
      "total_reactions": 0,
      "user": "RappScallion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "James Cameron films always thrive on their epic visuals and their equally epic storylines. However the problem is that to have an epic story you usually do not have the room to add a personal side to the film. Avatar overcomes this barrier and has a personally touching plot alongside its stunning visuals and impressive acting. It's not the best film ever, but it is certainly deserved of the trademark James Cameron hype.",
      "total_reactions": 0,
      "user": "CursedKnight187"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "yea it was fantastic.  it was an epic.  it had great special effects.  the story was lacking.  but the overall movie was good.  the action scenes were great.   it was decent.   it had a lot of political overtones in it.  which were necessary",
      "total_reactions": 0,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "James Cameron has made some of the biggest movies to ever hit the big screen, from Aliens to Titanic, and he's notorious for breaking box office records every time he releases a movie. Avatar is no exception. Here's the important question though: Are his movies any good? In some cases, yes - Terminator 2 is still one of my favorite actions movies, and Aliens was a more-than-worthy successor to Ridley Scott's infamous Alien. But in other cases, as with Avatar, he needs to sit down and really consider if he has any purpose on this earth, or if he should just kill himself so we can remember him as a good director with a  few blemishes. Needless to say, I didn't like Avatar. I can't imagine why anyone would; not one thing about the story is original or even clever. I understand that it's pretty and the stupid pink plants stick out in 3-D, but aside from good effects, this movie has absolutely nothing going for it. It has a horribly un-original story, terrible pacing, poor character development, and is just all around a huge waste of time. An example of what I'm talking about would be Trudy Chacon, remember her? No? Neither did I; I had to look her up just now to make sure I got the name right. She's the pilot that is supposedly a primary character. Well, she dies during the battle, and there are a few things wrong with this segment. One, why the **** is her helicopter painted with war paint - let alone the fact that she's wearing it, too, for no reason - but you're going to tell me that they all banded together after their most sacred tree was destroyed to paint this chicks helicopter? Two, why am I supposed to care that a character with absolutely no development dies? Not only could I not remember her name, but I couldn't tell you if she even had any dialogue aside from her tragically terrible final words. I could pick this movie apart scene by scene, but I don't want to implode from anger, and I don't want to bore you, so I'll end it here. Read the rest of the review on my film review site, rocketcrossing.com, and check out our facebook page at facebook.com/rocketcrossing.",
      "total_reactions": 0,
      "user": "Rocketcrossing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "People say that Avatar has a weak plot- not true. You hear over and over again that it rips off Dances with Wolves...ok... Dances with Wolves has a great plot. Other than the fact that the movie has a similar, but still great plot...it is perfect. The environments created, characters, music, etc is a 10/10. The plot may be a 8/10 at the lowest, but even if you disagree and want to give the plot a 1/10 or a 2/10, that does not warrant a 1/10 overall for the movie.",
      "total_reactions": 0,
      "user": "Markc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best visual movies I've ever seen. Everything felt like a totally different world that brought me into the movie. I was completely blown away.",
      "total_reactions": 0,
      "user": "Deer50"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "It may be a long while before another cinematic experience as involving as this emerges. In 3D it is absolutely breath-taking. Though I'm not generally a fan of this latest craze (there have been very few examples of well-used 3D), Avatar really does show the technology's potential. You are transported to a completely believable alien world - you can almost feel Pandora's air on your face. The environmental message, while not by any means new, is presented convincingly, and with aplomb. Sam Worthington also proves himself as a credible leading man. The plot is uncreative, however - let's be honest, it's Pocahontas in space. And why \"unobtainium\", Jim, why? Cliched and with a couple of missteps it may be, but by God Avatar is a thing of beauty.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Phenomenal,Awesome,Outstanding,Beautiful,Mind Blowing,Masterpiece,Great Visual and Effects,Movie full of Action...Avatar is the best movie of all time!!!",
      "total_reactions": 0,
      "user": "Predrag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best films of all time. There is nothing more to say. Everyone must see this film. Special effects, plot, story, acting, and immersion are all top notch qualities of this film. And for the full experience, I do recommend seeing this film in high definition, 3D, and with surround sound. You will be doing yourself justice.",
      "total_reactions": 0,
      "user": "cylixdemas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Simply the best movie, everyone has to watch it! Amazing special effects, sound, story, deep meaning! James Cameron definitely is one of the best directors! I love this movie!!!",
      "total_reactions": 0,
      "user": "Vic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "The story is very unoriginal. Its basically Pocahontas in the future. I'm hesitant to label it as a great movie. Alot of people seemed quick to label this movie as legendary, but the narrative of the film is quite the opposite. Sure, the special effects and everything were great, and it has entertainment value, but other than that it is fairly forgettable. All in all, decent movie that is easy on the eyes but not groundbreaking.",
      "total_reactions": 0,
      "user": "jcw2385"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 1,
      "text": "Before the film was even released, I knew exactly how weak the storyline would be regardless of the profound hype surrounding it. There really isn't much to say, other than 3D is barely as impressive as others make it out to be and that was supposedly the 'saving grace' of the film. The storyline simply borrowed from a platter of other films and even still managed to fail. I also won't bother going into what I expect to be scientific inconsistencies.",
      "total_reactions": 0,
      "user": "Alexander_N"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "The best movies don't make the most money and Avatar is the best example of a movie held back from being a deeper and more original film to be more appealing to a wider audience and make more money. The movie is well crafted, having stunning visual design and an entertaining (enough) story, but James Cam is smarter than what this movie actually is and has deliberately held off from making a more original, truly entertaining, and deep science fiction movie. The light science fiction themes the movie does have are good and relevant in our digital age of internet avatars, I just wished they did more with them. The movie is what it is, it is fun and worth a watch, but is only half as good as it could have been.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Ultimately overrated. Great effects and visuals but the story sucks. The story line is like Pocahontas's and has nothing to say. The characters are rather ridiculous with the hipster navies.",
      "total_reactions": 0,
      "user": "island"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "\"Avatar: 3D the IMAX Experience\" Brief Review! \"B\"",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "It can't be denied that this film will revolutionize the special effects of the future, but films with a focus on special effects tend to be the ones which hope that the effects alone can carry the film. Fortunately for Avatar, it has a generally solid plot to back up those effects, but I wouldn't necessarily call the acting top notch. It's incredible fun, and it has created a beautiful world brought to life in 3D, but it needs a little work.",
      "total_reactions": 0,
      "user": "Hasriona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "This is the most overrated piece of cinema I've ever seen.  All flash, no fire, Avatar combines the special effects of Transformers with a story ripped from Pocahontas and recycled a million time over.  The only difference is that, instead of Native Americans, they're giant blue people with tails.  Sure, Pandora is a pretty cool place, but that and a bunch of 3D-inflated box office records are all this movie has going for it.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "I've never really heard of a film like this that got so many positive reviews especially seeing the literally dazzling special effects, and that was the furthest it got.  Even so, it made the film look cheap, yet overrated, and the 3-D doesn't make it at all better. It looked more like a LSD-induced fairytale, and that is an excuse for such a inadequate plot.",
      "total_reactions": 0,
      "user": "Candy-Floss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "my mom pulled me out of school to see this. I really expected alot from this movie, and I walked into the theater with \"modern classic\" in mind, overlooking the fact that I don't like James Cameron movies. Well uh.. thirty minutes in, I was thinking \"Wow cool! Look at that 3D!\" but there was that Indy 4 esque \"this better not be it\" thought in the back of my mind. The characters, the were like robots, with cartoonish generals and    that sort of crowd. The weird blue chick was cool at first but soon got very annoying. Also, why is this Sam Worthington guy in so many movies? Why does James Cameron keep casting him? I mean come on, Teller would have been a more reasonable choice than that stooge. Still, the movie has eye-popping FX and the 3D is the best I've ever seen, so it's still probably worth your time if you enjoy other films by Cameron. The mythology is fairly deep, if not cliched, as well so Cameron is technically able to write a story a four year old couldn't. This would all be fine for a animated series, but spending all that money on FX for something like this probably isn't worth. Well, they made an ungodly amount of cashola on this movie, so I guess it was worth it. Then everybody talks about how great this movie is, and The Hurt Locker loses at the Golden Globes. I guess I just got James Cameron'ed again.",
      "total_reactions": 0,
      "user": "Poopman157"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "Would have liked it better if it wasn't surrounded by an utterly massive and undeserved hype machine.  It's story is a hackneyed, childish and sub-par re-telling.  VFX and animation were mostly great but it's art and designs were entirely derivative and or directly copied from a variety of sources without the slightest hint of tribute or homage.  It's not even a challenge to find nearly identical designs to everything in Avatar that pre-date it's production.",
      "total_reactions": 0,
      "user": "skuby"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Those who love Avatar love it for its effects and visual design, and blame the others for not concentrating on that element like theyre supposed to. Those who hate Avatar hate it for its recycled story, lame characters, and laughable dialogue, and blame the others for not focusing on the elements that truly matter in any film. Well, both of those sides are right, and both of them can be validly argued. But, the latter side has a better point: Story and characters are what makes great cinema, not great looking effects. And, rather than using effects and images to tell a story (Blade Runner) or stir up interesting ideas (2001), Avatar is only interested in looking good.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "The storyline may not reach the genius-level of its technical part but,  \"Avatar\" is deeply absorbing and benefits from Cameron's visionary direction and a strong performance by Zoe Saldana.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Yes the story was mediocre... but the execution of the special effects & scenery was absolutely breathtaking. Got to see it in IMAX 3D and was absolutely stunned at what technology can do to an average story. I am glad I live in America.",
      "total_reactions": 0,
      "user": "joelschnick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Ah Avatar, where can I begin?  This movie is a masterpiece of a motion picture!  Everything about this movie is amazing!  The plot takes place several thousand years in the future, where mankind has run out of resources, and are now looking for more on distant planets.  They then come across a race of humanoids called the Na'vi, and go to war with them, all because the humans are stealing their resources.  This is a very good, yet a tad bit unoriginal plot that everyone loves.  As you can probably expect from this film the humans are the bad guys.  The visual effects are excellent!  Everything looks very realistic, and I love that!  The character development is great too!  It shows the main hero turning from a human to a Na'vi.  Personally, I see little problem with this film, other than its plot, which is a little unoriginal.  I wish the video game based off of this movie was better (see my review of that for more details), but it is unfair to judge a movie by its video game.  Overall, this is the near perfect film!",
      "total_reactions": 0,
      "user": "cub317"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "what can i possibly say",
      "total_reactions": 0,
      "user": "debjyotinsec"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "This could have been a good movie if it wasn't such a junk food feast of special effects and lacking of plot. This movie could have been great, but it wasn't, as James Cameron is much more interested in plagarising from good plots and sticking a bunch of blue creatures and glittery fairy nonsense in it to make it look pretty. It's a shame the critics were either too confident in that this was going to go somewhere, or too scared to pipe up that it didn't. There are better movies out there that don't particularly seem to be popular with the critics. I am more than confident that this was not even worth the production it deserved, or the paper the tickets were printed on. There were aspects of the movie that I would have enjoyed, there were things I could of happily watched, but sadly it was blindingly obvious to me that the CGI and special effects were just part of the after effects I suffered when I came out of the cinema.",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Avatar is a beautiful film with its fantastic visuals, great score by James Horner and solid performances, but its narrative is quite derivative of other films making it not as great as it could have been.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Visual masterpieces with a thrilling story and unbelievable mastery in filmmaking rarely come along, but director James Cameron has simply (well, not simply) defined the open era of cinema with this stunning and original masterpiece that has set the benchmark for years to come.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Truly a work that deserves admiration.  Many people were doubting if this film is justifiable to its enormous budget, many were doubting if it would â",
      "total_reactions": 0,
      "user": "MokoReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "Too overrated. A movie with computer design only... nothing interesting... it sucks don't waste your time on this...",
      "total_reactions": 0,
      "user": "khajvah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "this film was much better then i expected to be buy i wish that the main characters in the film didn't look like smirfs who never wash their hair and stick into anything they want and all of a sudden its there's to keep. good actors in the film women of alien is on it who as usual gets shoot but still survives. the main jist of the film is humans go to a planet infested with smirfs and other flying dragons that love biting humans faces off and they use their planet for resources such as wood but these smirfs live in their natural habitat which is the jungle and everything gets out of hand and yes they have a massive WAR! after home tree gets owned by loads of missiles. however the smirfs have a weapon, the king dragon which gets tamed by a guy i think called sully who was a human but then turned into a smirf in a little machine. overall this film is amazing and it showed be since it cost so much! good ideas put into the film as well they thought of good creatures to have a fight with the humans and also with the futuristic mechs the humans have, luckily the smirfs have nature on their side and you will have to see the film to know what happens in the end!",
      "total_reactions": 0,
      "user": "easypeasy118"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "A solid blockbuster that pulls all the 'right' strings and puts on an impressive spectacle. The aspect that settles it firmly in the highest part of the score chart (giving it an 9, but it could be an 8 as well) is that the director takes a humanitarian subject that he is personally passionate about, and creates a compelling Hollywood expression of the issue. It doesn't hurt the film that nature is so rich in beauty and easily gorgeous visuals that the movie oozes with beauty that in itself creates a compelling argument for environmental preservation and humble approaches to our shared home.",
      "total_reactions": 0,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "The movie looked and sounded amazing. No doubt about that, but for being 10 years in the making the plot was a little too umm predictable. Some say thats being too nit picky, I say I could predict the whole movie and it kinda sucks. This is pokahontas basically with blue aliens. Great battle sequences, but the story overall isn't that interesting and again being totally predictable doesn't help it. I thought it definetly had an amazing look to it, but by the end I thought I saw something only about as half epic as it was built up to be.",
      "total_reactions": 0,
      "user": "djcmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "This film is like a very subtle spoof written by an enemy of James Cameron.  His ego and lack of imagination and cliched goo ooze through this awful God awful film.  This is seriously made by the same guy who did Terminator 2?  Only reason this is even getting a 1 is because some of the non cartoony looking stuff is neat visually once and a while.",
      "total_reactions": 0,
      "user": "Hyperbole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "I give this movie, overall, a 4.  If i were to break up the movie, my scores would differ.",
      "total_reactions": 0,
      "user": "Snodog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "A beautiful journey in 3D, put together by Cameron genius. Despite obvious flaws in the plot, is a good movie and worth the ticket. Especially great for images that will be offered in the same way.",
      "total_reactions": 0,
      "user": "Lacohfilho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of the best movies I have ever seen. It got robbed of an Oscar for Best Picture. The graphics are stunning and the plot is very good. You have to be crazy to not like this movie.",
      "total_reactions": 0,
      "user": "nathan737"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The whole thing may just be one large cliche with some new characters and visual effects, but if that is so, then it is also one of the best cliches I have ever seen.",
      "total_reactions": 0,
      "user": "Doehl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "First off, this would be a 10 out of 10. It's really good. Visuals and special effects are phenomenal. Theyre all amazing, and some of the best in filming. Score is really good. The story is also really good as well. The battle sequences are epic. They're amazing. I'm happy this got 3 oscars, but I think this shouldve got more. Overall, this is an amazing scifi adventure that's a amazing movie. This is highly recommended. You should see it.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "7.5 - the movie was just a simple story which was hidden behind the graphic effects which kept me watching. that's probably why i played it so many times on my 3D tv.",
      "total_reactions": 0,
      "user": "Paranoia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "The movie wasn't half bad,  but the visuals were about the only thing it could conger up. Script and acting were below par completely and the movie seemed too cliche.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Avatar is the magical work of the cinematic genius that is James Cameron, the man behind The Terminator and Aliens. Jake Sully is a marine who was injured in battle and left paralysed from the waist down. After his brothers untimely death Jake is invited to take up his brothers scientific pursuits on the planet Pandora as part of the Avatar program. After being separated from his group on a mission Jake is found by Neytiri, one of the Navi native to the planet. Neytiri trains Jake in the ways of the Navi as he falls in love with her and the planet around him. However the mining corporation stationed on Pandora have other plans for the planet, and so ensues a battle for survival, love and family. Avatar is more than just a visually stunning film with its amazingly realistic special effects, it makes the film feel alive and real. Avatar is a must watch film that should not be missed by anyone.",
      "total_reactions": 0,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Great effects and beautiful colors. But the aliens remind me too much of cats and the plants in the movie seemed too Earth like. They should have made everything a bit more extraterrestial such as the Na 'vi and the plants.",
      "total_reactions": 0,
      "user": "000Tuld000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "This was not the worst film I have ever seen. It wasn't good, though. As many people have pointed out, the story was predictable and dull, and the script was poor. I could have forgiven it for not having a very original or insightful message, you don't really expect that in a blockbuster, but it insisted on shoving it's completely unoriginal message down my throat for so long that I got pretty sick of it. Overall, I'm at a loss as to why so many people rate this film so highly.",
      "total_reactions": 0,
      "user": "Rioka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Avatar, despite all its hype and adoration, simply fails to deliver a truly satisfying experience. The special effects are easily the best part of this film, though everything else from the stilted writing to the empty, stereotypical characters to the uninspired eye-roller of a dystopian future bereft of any intellectually stimulating rhetoric or substance.",
      "total_reactions": 0,
      "user": "skyrimbestgame"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Avatar, along with James Cameron, is a classic example of overrated media. Even though Avatar has its strong moments, and the undeniable visual candy that is omnipresent within the movie, its plot is tired, predictable and cliched. The raconteur of gunfire, obvious native America references, disappointing dialogue and bitter aftertaste combine to form one of the most mediocre films by James Cameron, only being supported by the visuals.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Climatically beautiful, masterful use of 3D and amazing use of colors, and great computer animation. These aspects are the highlight of the film. If you get the opportunity to see Avatar on a movie theater screen then it is a must see due to it's brilliance on the big screen. However on the small screen much of this brilliance is less in the forefront and this allows you to see through how pretty it is and see how the story is really lacking. Avatar's story line is an unoriginal mishmash of different movies filled with uninspiring characters. Yes this movie will awe you with it's visual effects but if you're looking for a movie with a deep story Avatar is not it. the acting all an all was good and the story was not lacking at any fault of the actors. This movie is a typical James Cameron spectacle with little more than pretty scenery.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "A truly marvelous and magical experience, Avatar is a feast for the eyes, plain and simple. While the story is a familiar one, it is expertly told and very well written. The acting is solid and works well in the film. The direction from James Cameron is inspired and matches the expansive and daring chances taken in the visual storytelling of the film. However, the true stars are the visual effects team who do a truly phenomenal job to bring this story to life. With breathtaking visual effects and fantastic cinematography, Avatar comes to life through the visuals and breathes new life into a familiar, yet incredibly engaging, storyline. Due to this visual plethora of eye candy, Avatar reaches new levels never seen before in film that really elevates the film as an overall piece. While many leave Avatar feeling underwhelmed due to the now familiar use of CGI, 3D, and the bland story, I was left awestruck. While the visuals have led to a new trend in film, of which Avatar was the first, its effects hold up and, honestly, may still be the best use of its effects to date. A wonderous achievement, Avatar is a truly phenomenal work.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "James Cameron's Avatar is a fantastic film and I highly recommend it. I went to see it in theaters on the day it came out, and damn was it a fantastic film. Never have I been so engaged to a flick that was entertaining like Avatar. I know own it on DVD; it was that great. But it all boils down to personal preference. The reason it doesn't score a perfect 10, was because of some predictable scenes throughout the film and some cheesy lines. Other than that, Avatar was one of the most incredible and spectacular films I've ever watched. Oh, and I also recommend this movie on a Home Theater system to get the most of the experience.",
      "total_reactions": 0,
      "user": "TowerPowerHour"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This was definitely a great film to watch, it had a very compelling story, and the visuals were amazing. It was quite funny how they named the special ore \"Unobtainium\" it made me laugh.",
      "total_reactions": 0,
      "user": "Garian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "This movie is overrated but it still wasn't bad. The special effects were absolutely awesome. The 3D? imo -- unnecessary. I don't think I even noticed anything being in 3D after the initial few minutes of putting my glasses on. The 3D technology was also inferior to the laser IMAX 3D films I saw in the late 90s, in those, things actually jumped out in the theater right in front of your seat, with this 3D technology? nope, things just kind of pop out a few feet in front of the screen only. The plot of the movie was okay, a not-so-subtle criticism of the Pentagon (you seen a pentagon around their map board) and/or Military Industrial Complex wanting to destroy the natural habitat of the indigenous people. This movie dragged a lot in parts though, it was longer than it needed to be, they should have cut out those dragging sections, it would have been much better then. Overall, amazing special effects and a mildly-entertaining movie. Worth seeing but doesn't live up to all of the hype. I give it an 8/10",
      "total_reactions": 0,
      "user": "Necromus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "\"Avatar\" is great, because It's full with thrilling moments. Now, the 3D animation is masterful, and the story, not fantastic, but great. It's with great voice acting and with good characters.",
      "total_reactions": 0,
      "user": "FilmReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "One of the best ever. Im Super suprised it didnt win the Best Picture. The Final Battle had even great suprises, and intensity. For those who negatively judge, they got no proof that it sucks, which it doesnt.",
      "total_reactions": 0,
      "user": "Jack101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The movie is good, but not so good for me. The film serves only to see it once and then forget about it.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "This has to be one of the most overrated films in the history of cinema. The only reason this movie gets any praise is because of the special effects, which I will admit were really good, but everything else is just below average and unoriginal. Avatar is far too long and is something that I would expect Michael Bay to direct.",
      "total_reactions": 0,
      "user": "EDJET787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Effects: Absolutely incredibly well done. Nothing bad to say about it.",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "As I once heard it put: \"A sight to behold. A story to forget\".",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Mind-blowing special effects and amazing screenplay however calling this movie the most epic movie ever is overrated.",
      "total_reactions": 0,
      "user": "jfrotylpe532"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "What has Avatar to offer? Graphics and... and nothing else. Only good graphics. The movie is definitely overrated, with a poor story, ridiculous characters and nothing new to offer to the genre. I'm sorry, but I really didn't like it at all.",
      "total_reactions": 0,
      "user": "AlessandroCali"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "For sure one of the best action/sci-fi movies ever. It's so emotionally engaging, so mindbogglingly(?) epic, nothing compares to the epic awesomeness of this film. As I'm sure you can tell, I love this movie.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Visually it is utterly breathtaking. Special effect are some of the best to date. Then again it's Cameron, can we expect any less?!",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "is a film with great graphics but the story is no big deal is anyway",
      "total_reactions": 0,
      "user": "irmaod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Avatar will take you to Pandora. Jake Sully informed that his brother is dead so now he is controlling his brother's avatar. This film is not only action but also drama. I really cried. Great film.",
      "total_reactions": 0,
      "user": "giannis19962012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "The movie is nearly fun to watch, but misses that by a thin hair. The story i abominable. Cheese and bore. The effects, while entertaining can't last the length of the movie, which by the first half, is begging you to leave.",
      "total_reactions": 0,
      "user": "nirishan9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 3,
      "text": "This movie was a conglomeration of story lines that were boring the first time I saw them in Pocahontas and Titanic. It is a go- green movie that thrives due to its special effects but falls flat on every other aspect. This movie has risen to its predecessors of Push and Transformers.",
      "total_reactions": 0,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "[8.8] After seeing Titanic I really didn't expect this from James Cameron. It's a very well-balanced movie that is obviously visually stunning, but what is really impressive is that this movie is the most lifelike any sci-fi movie will ever be. You can say that this movie is defined by CGI, or that it isn't very smart, but it is a believable, and more than worthy sci-fi movie. It probably achieves this because it borrows so much from video games, but nonetheless, Avatar works very well.",
      "total_reactions": 0,
      "user": "ncstatemike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "An unoriginal movie that did not recieve even one oscar that it recieved. Also, that only happened because James Franco directed Titanic. Not worth owning, a  movie that's easily forgettable.",
      "total_reactions": 0,
      "user": "SeaweedWrap002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is meant to look and sound good, and really that's it. Other than all the CGI and special effect, there's nothing much to the movie. The plot is nothing we haven't seen before  the characters aren't that interesting, and the 3D never adds much. If you want to see a good looking movie, then this is for you. If you want a good story, go see \"Dances with Wolves\", which has a very similar plot that is twice as good.",
      "total_reactions": 0,
      "user": "shprea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "The action was what you'd expect from such a big block buster. And I kinda like the premise of the story but the story turned out fake and emotionless in my opinion. Also I couldn't find it in me to care about a single character. The love of the main characters was poorly developed as well. In the end it's not for me. But those of you that just want to see blue aliens go to battle against mankind because we're invading their planet. Go for it.",
      "total_reactions": 0,
      "user": "Mereopinions"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "What the heck is wrong with some of the people here? Do you know how hard it is to make a movie like this, which in my opinion had great characters, good message even though it was a rip-off from Pocahontas. A big bow to all people involved in this visual masterpiece! Great CGI, superb combat and overall a 10/10 that i dont usually give often",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "This is the number one movie of all time????????????????????????????????????????????????????????????????????????????? Why? Because of the flashy special effects? Cause that was the only memorable thing from this movie other then the long 3 hour experience first time watching it in a theater I feel asleep 1hr and 20 mins in. Next time watched it at home stopped at an hour, next week picked back up then stopped, then again I took me 4 times to watch the entire movie at home over a month long time period. Nothing special and certainly original. Save your money and watch a bootlegged version online or the real thing online.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "I like this film, because of the feelings this movie distributes. This piece of sci-fi is very beautiful to look at and it is very engaging. It is a solid 10",
      "total_reactions": 0,
      "user": "pottomless"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 2,
      "text": "I dont know but I prefer science fiction without all tha eco themes like  Rendezvous with Rama form A. C. Clarke http://en.wikipedia.org/wiki/Rendezvous_with_Rama.",
      "total_reactions": 0,
      "user": "Georgus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "the script may not be the most innovative or better hefty, but that is where the technical triumphs over the rest, with the effects that the film has another relatively talented cast, the film only presisava a story while doing the technical part rest.",
      "total_reactions": 0,
      "user": "Scorpion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "I really dont see the big fuss about the movie. It was a predictable story borrowing heavily from other works. Visually striking however, no one can take that away from the movie. But other than that, its just like any other usual movie with nothing original.",
      "total_reactions": 0,
      "user": "Pimpinpakman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "An astonishing looking film, but with little emotion and extremely predictable story. The action scenes are very well done, and the world of Pandora are the best elements of the whole movie. The writing can get very bad at times, but of course the purpose of this film is to entertain, which it does for the most part.",
      "total_reactions": 0,
      "user": "NimbleReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Overrated and shallow, Avatar is one of the enigmas of film making.  How could a movie with a tired story line, hilariously one-dimensional characters, and poor script have such good critical reviews? Given, the movie has stylish directing and fantastic visuals, but I could have the exact same entertainment experience on a theme park ride.  A good movie is supposed to tell a story and have relatable characters, and Avatar had neither of those things.  One thing I will say is that the movie gave me a good laugh, when the stereotypical grunt Marine was in the robot suit and pulled out a comically huge knife, I thought that was the funniest thing ever.  If you are looking for a film with some substance, don't see Avatar, but if you just want some eye-candy, you might like it.",
      "total_reactions": 0,
      "user": "bsykes91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "The special effects were indeed amazing, the direction great, the photography too....but this story has been told a hundred times before, and in much better ways. It's an overly simplistic divide between the good guys (the natives) and the bad guys (the greedy invaders). Any moral conflicts seemed to be redundant; in fact, the film was extremely predictable (like we all didn't know what was going to happen when Jake was told the story about the Toruk....). Overall, not a bad film, but the extensive hype and predictable storyline ruined it for me.",
      "total_reactions": 0,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "WARNING: As this film has had an interesting reputation, many people will disagree with this review and I'm perfectly okay with that. All I ask is that you please be respectful of my opinion, just as I am respectful of yours. Please, and thank you. Now, let's begin.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "The storyline itself isn't the greatest but this movie was just amazing to watch in 3D. I was blown away when I first watched this movie and it led the way towards the 3D era.",
      "total_reactions": 0,
      "user": "jbrown8989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "UHHH. The movie is like a ejaculation of cgi with no story or interessting characters. **** it. James Cameron is eating all the praise and money and we reviewers have to tell the casual audience that this movie is completely soulless and bad.",
      "total_reactions": 0,
      "user": "reviewer2015lol"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "WHAT I LIKED: A great and genuinely original idea for a big blockbuster - 'Avatar' succeeds on many levels. It explores some serious themes whilst still making you connect with the characters thanks to great acting and development. It's also visually stunning, being one of the rare films that aesthetically just makes all moviegoers very impressed",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Well , I can say by far .. this is the biggest experience for our eyes.",
      "total_reactions": 0,
      "user": "VIC3NT3ST3LVIIO"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Avatar shows how bad is human talking about many senses, looking on the human crucial virtues and the violence that we can make. Wars, science-fiction, terrific story-telling and a great plot so far, it's what makes Avatar the most successful film ever, with money, of course.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "Here's a bit of advice. Why don't you watch the film yourself instead of looking for other people's opinions? It won't kill you to watch a movie that disappoints you",
      "total_reactions": 0,
      "user": "ten0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "Easily one of the most overrated movies of all time as well as directors of all time. Apart from stunning visual effects, Avatar lacks an interesting story. The movie also suffers from mediocre performances",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "Featuring state-of-the-art CGI/Motion-Capture effects, James Cameron's Avatar is not only a cinematic revolution, but a masterpiece, with wonderfully created set pieces, a brilliant score, and a stellar story-line that will surprise and immerse audiences time and time again.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "This film ushered in a new era in visual entertainment. All \"3D\" movies made after it look like pale attempts at imitation by people who don't know what they're doing. Any rating less than a 10/10 is sacrilege. (No, the plot doesn't matter that much once you've made such a leap in visual technique. It just has to be a decent plot, good enough to keep the whole project together, and it is definitely good enough for that.)",
      "total_reactions": 0,
      "user": "abm0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "While definitely overrated, Avatar is still a really great movie. Its got great writing, great casting, great performances, great cinematography, great music, great action, and above all - spectacular CGI. It raised the bar in 2009 for what was capable for special effects and 3D technology. Definitely watch it if you have not already.",
      "total_reactions": 0,
      "user": "MasterRiley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "Best movie that I ever seen. I am tired of life on this boring planet - Earth. Pandora, this is the world where I want to live! I look forward to the continuation of this wonderful movie!",
      "total_reactions": 0,
      "user": "RudeLannister"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "It was not very good. I wouldn't even watch it if i was paid too. The only cool thing about it is the live action vs actual people concept in the story. Its very bad though.",
      "total_reactions": 0,
      "user": "Movielover2400"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2017
      },
      "score": 10,
      "text": "Avatar was one of the best movies that I have ever seen! It was a shock to me when Avatar didn't win Best Picture at the Oscars. The visual effects, acting, character development, and the story-line was perfect. I highly recommend this movie to anyone!",
      "total_reactions": 0,
      "user": "LukeDzk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2016
      },
      "score": 4,
      "text": "this movie is in serious need of a charismatic lead - and unfortunately, in Sam Worthington, it falls way short. The failings of this movie were camouflaged by the razzle dazzle back in 2010 but 6 years later it falls apart rather horribly. it doesn't look pleasant watching this on a modern television.",
      "total_reactions": 0,
      "user": "moheeto"
    }
  ]
}