{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 12,
  "mc_movie_name": "Away We Go",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 58,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I really love this film. It manages to be really funny, really poignant and really sweet. I was completely in love with the two leads, who are both excellent and fit together perfectly. And what a delight to see some of my favourite actors pop up in the most wonderfully zany roles: Allison Janney as a wild and wildly inappropriate mother, Maggie Gyllenhaal as a nutso hippie, and the excellent Melanie Lynskey as an adoptive mother filled with a heartbreaking sorrow. This film took me by surprise.  I think, ultimately, it's a tiny bit too shmaltzy by the end but mostly it's just wonderful.",
      "total_reactions": 0,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I don't know why I liked this movie so much. It was maybe a little self-important but I think that John Krasinski (who is hilarious on The Office) and Maya Rudolph took control of the movie with their performances",
      "total_reactions": 0,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "The film could be boring, but the attempt to make it funny makes it even worst. The opening scene makes you smile but the film doesn't go over that first scene, all the weirdos they meet throughout the film stop to be funny after 10 minutes. It's a film that wants to make people laugh and they try so hard that at the end everything is completely wrong. The good elements of the analysis of troubles brought by maternity are wasted in such a screwed contest. After 30 minutes you will start wondering why you are still watching such a film and it's really hard to make it to the end of it.",
      "total_reactions": 0,
      "user": "SergeInho"
    }
  ]
}