{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Bad Kids Go to Hell",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 8,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 80,
      "summary": "A slickly produced and brazenly clever piece of work that could attract a cult by sheer dint of its ingenious nastiness and self-aware snark."
    },
    {
      "critic": "James Spillane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 63,
      "summary": "The film's unlikely combination of didacticism and sexy teen slaughter signals a booming trend: the Occupy horror flick."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "This bloody exercise in camp quickly wears out is welcome, although its copious doses of nudity and gore, as well as its undeniably catchy title, should help it stand out on video shelves."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2017
      },
      "score": 30,
      "summary": "This low-budget combination of thriller, horror and satire flaunts a smartass tone that proves deadening, and as the body count starts rising, viewer interest quickly begins dropping."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 20,
      "summary": "Bad Kids Go to Hell is the kind of movie its own pampered, careless, coked-up characters would make as a class project at the ass-end of senior year: boys running around with weapons, girls mugging sexy-sassy, narrative continuity be damned."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "It's a very entertaining movie that me on the edge of my seat until the very unexpected ending (stay for credits). The acting was superb and not just from Judd Nelson and Ben Browder. The \"Bad Kids\" were cast exceptionally well. One of the most surprising talents was Jeffrey Schmidt, who played Dr. Day. His quirky character was hilarious, as were many of the unexpected music video style flashback scenes that had the whole theater laughing out loud. This is definitely one of those movies that you'll want to see with others. Instant cult classic!",
      "total_reactions": 2,
      "user": "funnyguy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Found the film to be much better than the comic it was based on. Since I only have so much space to review, Id defer to the VARIETY review which Joe Leydon hit pretty much on the nose: Fast, fun, and not too serious. It's dark, but not depressing. And the end is KILLER. And a GREAT soundtrack.",
      "total_reactions": 2,
      "user": "StaceyMathews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Fast pace and entertaining!  Clever writing and lots of whit!  Most certainly a thinking persons movie!  I like the ride all the way to the end!  Great surprise and twists!!!",
      "total_reactions": 2,
      "user": "Gradeit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Fun. It's a perfect Friday night rental. Best part was the acting. Judd Nelson is hilarious and the younger players seem to all be on their way up. If you loved the comic, you'll love this",
      "total_reactions": 2,
      "user": "Th3Three"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Although the acting in this film was quite good; its writing was really lacking. Despite the fact that there were several amusing scenes as a \"horror movie\" it failed to be fully satisfying. Several characters that were detestable lived and the film had two twists. The first of which wasn't bad but the second twist (which occurred in the scene directly after the previous twist) was just plain silly. The film had potential but the writing (and fake looking roaches and rain) really held it back from being achieved.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Everything about “Bad Kids Go To Hell” is almost perfect in it’s utilization of nostalgia it tries to capture, with all the tribute images and backdrops that so epically scream “John Hughes”. From the library, the character traits of the kids, (only more modern and less wholesome), who make up the cast, right down to the awesome Judd Nelson cameo as Head Master. The flaw (which is minor) is that it seemed to go hardcore in referencing the 80’s high school flick but sadly no real dialogue reverb from the movie, what - not one kid could have found a way to declare “I wanna be just like you. I figure all I need, is a lobotomy and some tights”. Okay, I know new decade , new social commentary. The film does have some very awesome quotable moments that I loved, my fave “I don’t worship the devil, I just promote him”. The cast where killer in their role and all had more than enough back story and depth of personality to bring the characters to life. I did want a bit more bravado, overt-expression from a couple of the characters. I thought they where more subdued than they should have been, but still the acting was stellar. Plus a hot cast can hardly ever go wrong.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2016
      },
      "score": 1,
      "text": "I can't quite even understand how anyone can make a feature-length film and let it be that sloppy and poorly written. Everything from the total lack of continuity, relevance or even understandability in the storyline and character motives, to the soul-crushingly low end CGI and effects that never fail to grate horribly, to the sheer nonsensical or impossible actions and events in the film...",
      "total_reactions": 0,
      "user": "Zedred46"
    }
  ]
}