{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "Being Flynn",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 15,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "And then there's the simple fact of De Niro, playing a delusional taxi driver. It's easy to imagine Being Flynn's story turning precious in the wrong hands, but Weitz and his cast spin it just right - as a narrative that is both emotionally real, and just writerly enough to suit its leading men."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 80,
      "summary": "Robert De Niro and writer-director Paul Weitz find the most congenial material either of them has had in quite some time in Being Flynn."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 80,
      "summary": "The film surrounds its leads with a cast whose faces capture the ragtag dignity Flynn described in his book -- no overacting required, no emotional panhandling allowed."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "It's an involving journey, remarkably free of sentimentality, deepened by the performances."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "He might be guilty of showboating, but De Niro's knockout performance is a declaration that the star of \"Raging Bull\" isn't ready to hang up his gloves."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "What's admirable about Being Flynn is that it doesn't cave in to the standard Hollywood redemption formulas, with the father redeemed and the son inspired. It's more complicated than that."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Dano is still doing his ethereal, creepy underacting routine, but, compared with De Niro's scenery chewing, he seems almost dignified. The film, written and directed by Paul Weitz, has many touching moments and many more hokey ones."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Weitz's sense of play and the Badly Drawn Boy soundtrack each give Being Flynn an enjoyable lightness; meanwhile, the curdled, hidden rage lurking within both Flynns gives it an equally enjoyable edge."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "The story is gripping, compelling. One wonders what De Niro might have done with such a role 30, 35 years ago. De Niro -- whatever happened to him?"
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "In this tale of two lives, Being Flynn gets the emphasis wrong. The success that has many fathers is altogether predictable; it's the despicable orphan of failure who has us in his thrall."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "Here, you can feel De Niro's full engagement in a character that echoes his roles in \"Taxi Driver\" and \"Awakenings.\" It's a great wreck of a performance that feels bruisingly true. At its best, when it keeps sentimentality at bay, so does Being Flynn."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "There's no doubt that Being Flynn is an attempt at something painful and genuine – the movie itself yearns to make a connection, even if it can't quite locate the most effective channels."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "On the whole, the film feels detached and morose, just like its characters."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Mostly, though, Being Flynn is memorable for the sight of a once-great actor rousing himself to a performance the movie itself isn't prepared to handle."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Paul Weitz has dialed things down considerably for Being Flynn, writing and directing with an earnest sensitivity that at times suits, at times undermines, the complexities of the story at hand."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Robert De Niro has made several unwise choices in roles recently, and his belligerent wannabe writer in Being Flynn definitely adds to that list."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "There is honest feeling, genuine humanity and real intelligence in this movie, but there is also a sense of caution, of indecisiveness, that undermines its potential power. Being Flynn is an honorably ambivalent film, finally unsure of what to do with the two strong, complicated characters at its center."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie's emotional content was manifest as an absence. What stayed with me most memorably was the father's insufferable bombast and the son's sad passivity."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "It's no wonder the movie is no walk in the park, even with a pretty soundtrack by Badly Drawn Boy (again, like About a Boy). It never feels inspirational - it's too gritty and dark - and there isn't a single easy solution in sight for either Nick or Jonathan."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Is it possible for an actor to go through the motions even as he's going over the top? In Being Flynn, Robert De Niro does phoned-in scenery chewing."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Too small and dark to appeal to a large audience, it's not a movie to cherish."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "What the actors are unable to get across emotionally (which is a lot - Dano and De Niro, both of them all big actorly tics, often seem like they were filmed in different rooms), Weitz hammers home via near-constant music."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Weitz – who did a great job adapting Nick Hornby's \"About a Boy\" into an affecting 2002 movie – can't bring the pieces together here."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Sadly, most of the film's dull edges have to do with De Niro, who is clearly in rest-on-his-laurels mode; at his worst, he approaches radioactive, Robin Williams levels of bathos, as when Jonathan - roaring like a bush-league Lear - is banned from the shelter for bad behavior."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "The real coup de grace for this would-be serious-minded drama is the sledgehammer-subtle direction of Paul Weitz (who is also the screenwriter), who enabled his star's paycheck mugging in the execrable \"Little Fockers.\""
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "A handful of acting moments aside, Being Flynn is a drama without much in the way of rewards."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "If Robert De Niro knew what was good for him, he'd certainly distance himself from this director and find a new path."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "The film has some interesting moments and sheds some empathetic light on the plight of the homeless, but DeNiro's character is just so arrogant and annoying that he makes the film almost unwatchable. There's not enough of a payoff for having to endure all of the father's crap.  Olivia Thirlby is good in a smallish role, and Lily Taylor is awesome in a very quick appearance - almost playing a grown-up version of her character in Say Anything. Paul Dano is somewhat interesting an unpredictable, but even his \"shortcomings\" made me groan a bit.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "In a real-life memoir called \"Another Bulls_ _t Night in Suck City,\" by also real-life Nick Flynn (played by Dano), a playwright and poet, he describes the reunion with his long-absent and eccentric writer and father Jonathon Flynn (played by DeNiro) at a homeless shelter, of which son Nick had voluntarily worked during the 1980's. Adapting such a premise into a film is filmmaker Paul Weitz, who for the last seven years has been working to capture the father and son relationship of the Flynn's, as portrayed in the film, \"Being Flynn.\" Through the course of the film, the viewer is also introduced to Mrs. Flynn (played by Moore), who committed suicide when her son, Nick, was 22 years old. She is pictured throughout in extending flashbacks, primarily shown with her \"then-child\" son Nick. Also, shown, is Nick's semi-involved, vaguely determined girlfriend (played by Thirlby), who serves as the support for Nick during his down-ward spiral. These are the main characters. Father Jonathon, though, much ado to DeNiro, is the main emphasis of the film. Suffering from an extensive bout with alcoholism, and having served time in prison for writing bad checks, Jonathon's pent-up rage boils inside of him, and readily shown by the acting prowess of DeNiro who has finally messaged to audiences that \"He's back.\" However, there is something about DeNiro's playing of down-and-out long-shots rising up from adversary that suits him in this bio-pic role. Notwithstanding his own \"comeback\" from histrionics, as shown in the past decade, one can't help but link DeNiro's delineation of Jonathon Flynn as perceptibly and eerily similar to his classic performance of \"Taxi Driver,\" some thirty-plus years ago. This is so for a few, yet intentionally done, reasons. One, Jonathon works as a taxi-driver, and later his torn self is shown in front of a mirror; you'll know what I'm talking about. Although this isn't the first time DeNiro has denounced his infamous moving roles in the past (see \"Little Fockers\" and \"The Adventures of Rocky and Bullwinkle,\" to name a couple) I will admit, a special resonance of nostalgia and movie history is brought to life again, this time from an aging DeNiro. So, it is good to see him back onboard. As for Dano, he shows signs of letting loose, much like his to-to-toeing with Daniel Day Lewis in \"There Will Be Blood,\" however, his sullen, nonplused brow and merose eyes are seen as indications of overacting, and become bemuddled, in terms of drawing a resemblance to the real-life Nick. Having read Nick Flynn's memoir, I can confirm that Dano does have moments with showing a similar sense of loss as felt through real-life Flynn's words, especially in his drug use, but he almost looks and feels distracted. Put differently, Dano can't quite match DeNiro's redemptive role in firepower; instead, he feels weary and too-defeated. As for Moore, she hands in a safe, unrestrained role as the non-present mother, but the flashbacks simply don't give her enough \"life\" to be considered commendable in her role. As for Thirlby, she, too, shows signs, like Dano, of breaking loose, but by no fault of her own, Weitz doesn't give her the aid to render a memorable performance; she's a mere fill-in to bolster Dano. The film, as a whole is not bad, though, is doesn't quite feel as if Weitz knows what he wants to do with his convincing leads. He shows DeNiro trickling into despair, but doesn't know how far to let him drop before he ascends back up to shape. And, more specifically, Weitz shows a DeNiro, sleeping on public benches and such, however, on a whim, shows him hearty and sane as ever. Then, just as easily, shows DeNiro imitating almost Greek oracle, versing words to the heavens, and displaying his loss with reality. The extremes are flunctuated too frequently. Moreover, I find Weitz's extensive research with the real-life figures of the film plaudable, as he obviously taps into DeNiro's adroitness, and will to act again, however his diluted narration and uneven balance leaves more to be desired. Overall, \"Being Flynn,\" is a worthwhile drama that not all will enjoy, but many can find elements of which to relate.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Being Flynn is a dark and unpleasant film about the deeply fractured relationship between an aspiring writer and his alcoholic father.  That may sound like the basis for a deeply moving story about redemption and second chances, but writer/director Paul Weitz is so determined to avoid sentiment and easy answers that he drains the movie of any real feeling.  Still, Dano and DeNiro are very good in the lead roles and the beautiful score by Badly Drawn Boy helps to keep it from being unwatchable.",
      "total_reactions": 0,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Every movie I watch Paul Dano in reinforces what an amazing director Paul Thomas Anderson is.  That he was able to get a dynamic performance out of Dano in There Will Be Blood is a miraculous feat when you consider Dano's other work.  Being Flynn is case in point.  Dano plays the character with a grim seriousness that doesn't help the already melancholy tone of this movie.  A role that should have many levels, and be played with some irony to counterbalance the darkness, is instead played with a one-note monotonous sadness.  The end result is a character who feels way more sorry for himself than we do, and a story with a big hole where its male lead should be.  Robert De Niro is heroic enough to overplay his role, to make up for the void at the center of the picture, and give us some entertainment value.  But the end effect for him is that he appears to many critics as conspicuous and flashy.  The real culprit is Dano, who doesn't crack a smile for the entirety of the film and who ensures that we don't either.",
      "total_reactions": 0,
      "user": "jdicksteihn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "I like things like this that have their roots in real life, interesting to see what some people have to go through, worth watching nothing amazing cinematic wise, a good story though.  And life is about having stories to tell.",
      "total_reactions": 0,
      "user": "hootis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "This is really a boring movie, the film has non action, non humor, non good plot, about this movie you can't say positive things, only dad Danno and Di Nerro did good acting. The plot and the director is the worst, really there don't happen anything in this movie, only driking and f***ing, that's it. Don't waste your time on this movie. This movie is 102 min bored.",
      "total_reactions": 0,
      "user": "Wiesy"
    }
  ]
}