{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 0,
  "mc_movie_name": "Beneath",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 5,
  "mc_pro_critic_reviews": [
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Ultimately, Beneath is better than your average Roger Corman clone because it is more serious than trivial."
    },
    {
      "critic": "Michael Atkinson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Beneath may be an earnest goof, but any intended irony is so spiked with rainy-day-matinee movie love that the result is an oddly guileless horror exercise, unscary but rather adorable."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Although Fessenden does fine work shooting his equivalent of Lifeboat, the movie’s surface is often rough. Yet the title doesn’t just refer to what lurks in the lake’s still water. It’s a guide to where Beneath’s substance lies, the acid heart inside its plastic chest."
    },
    {
      "critic": "Noel Murray",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "As routine and undercooked as Beneath’s one-wet-corpse-after-another plot is, the movie is still breathtakingly beautiful at times, with compositions and color tones that resemble a high-class fashion-magazine layout circa 1965."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Its stance toward every dipshit slasher and creature-horror flick that's come before it never feels less than casually hostile."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "That sly toying with audience sympathies is, alas, all that’s notable about this otherwise poverty-row quickie produced for the Chiller cable network."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 30,
      "summary": "Beneath gets capsized as much by its knuckleheaded script as by its somewhat risible giant flesh-eating fish."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 20,
      "summary": "Though the young actors...are appealing enough, you keep waiting for a boatful of humor to come along and rescue them. The whole film is a campy put-on, right? Apparently not."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "kind of the opposite of the other movie I watched today, I liked this one a lot less than I expected. Its gotten mixed reviews mostly on the good side Id say. Unfortunately it does not deserve the praise. What I did respect about the movie was the way the creature looked. It looked like they mostly used practical effects mixed with a little bit of cgi. This in my opinion was a great move on part of the directors. Using practical effects is almost a must for me. There has been a flood of cgi filled creature features and most of the time as soon as the crappy digitally animated creature shows up it pulls me right out of the movie. The creature in this movie looked great, Unfortunately the movie has nothing else going for it, The whole movie takes place around a group of teenagers stranded on a small boat. They make incredibly bad and unbelievable decisions that just piss you off and just over half way through I couldn't wait for this movie to end. It would have been nice to see them do something special with this cool creature and when it finds its first victim I thought things were looking up but they definitely went down from there.",
      "total_reactions": 0,
      "user": "McCorpse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Beneath is a very effective horror movie that's more than just a simple scary ride.  Beneath works on multiple levels...  Although set on a lake with a monster in the water, at its core, the movie is really about life in high school (or at the office).  The biggest threat our characters face is each other, rather than the monster.  The use of a practical monster, rather than a cgi creation, adds to the gritty realism.  The young, attractive cast plays the movie with necessary intenseness, and the cinematography is beautiful  Ultimately, Beneath is a scary, funny and smart movie.  My friends and I all enjoyed it.  Definitely worth checking out!",
      "total_reactions": 0,
      "user": "Moviefan1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "A fun horror movie.  It doesn't rely on CGI monsters and has a real \"Lord of the Flies\" vibe.  Plus the actors make you believe lines that could've fallen flat.",
      "total_reactions": 0,
      "user": "M0vieWatcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Pretty good psycho horror flick.  This movie is less about terror beneath the water than terror above the water.  The real evil is the group \"friends\" on the boat.  Some scary moments, but actually quite satisfying as the monster and the friends' strained relationships take their toll.  The monster could look more real, though.  Good music.  Nice to see the wheel chair dude in Breaking Bad actually speak.  He's pretty damn creepy.",
      "total_reactions": 0,
      "user": "hooba245"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Beneath follows a group of teenagers who show their true colors when trapped in the water.  Nobody does indie horror better than Larry Fessenden.  I liked The Last Winter better but enjoyed this.",
      "total_reactions": 0,
      "user": "CarlosDanger"
    }
  ]
}