{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 22,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "Big Mommas: Like Father, Like Son",
  "mc_negative_rating_frequency": 36,
  "mc_positive_rating_frequency": 41,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "It goes down like a canned but genial '80s comedy: Without fanfare or much nutrition; part of your balanced breakfast."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Kind of a drag when it resorts to frantic slapstick and tired action-comedy tropes, but modestly engaging during stretches that suggest the project would have worked better as an exuberant musical."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Hilariously horrible when it isn't just plain awful."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "John Whitesell's extraordinarily witless movie operates as a checklist for cultural and racial clichés."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Won't likely disappoint fans of men-in-drag comedy but doesn't offer much that's original or funny."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 33,
      "summary": "Lawrence's gender-bending jokes are played out, and his slapstick is wooden and slow."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 30,
      "summary": "About the only honestly funny thing in the movie is Faizon Love's uncredited performance in the Joe E. Brown role, as the school maintenance man who's immediately smitten with Big Momma."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Star Martin Lawrence, now the sole remaining element from the original \"Big Momma's House\" 11 years ago, looks pretty tired both in and out of makeup here."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Fresh or not, creatively merited or not, here it comes: the third installment of Martin Lawrence's big, dopey franchise."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "A humorless mashup of \"White Chicks\" and \"Glee.\""
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 20,
      "summary": "Whoever demanded a third installment of Lawrence's mirthless mash-up of weak gags and cross-dressing horrors should be imprisoned and forced to watch it on repeat until they repent. Avoid."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 11,
      "summary": "The comic, his career now apparently in total free fall, tackles the (dual) role(s) so broadly (no pun intended) that it's just plain annoying."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "summary": "A film so drained of entertainment or simple humanity it is difficult to relate to as anything other than industrial artifact."
    },
    {
      "critic": "John P. McCarthy",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "summary": "Starved of humor and energy, the interminable Big Mommas: Life Father, Like Son could force Lawrence and co-star Brandon T. Jackson undercover for real."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Really enjoyed this film, but enough is enough for the ''Big Momma'' franchise! 1&2 were stronger but this one is still pretty amazing, and now it has a touch of music! Funny and it does have it's cliff hangers! 10 OUT OF 10!",
      "total_reactions": 1,
      "user": "WeKnowFilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "Big Mommas: Like Father, Like Son is an alright film. It has a few good laughs and Martin Lawerence does a solid performance. The problems with this film is the story isnt really good at all, alot of the scenes that try  to be funny are just not funny at all and that last two big momma where more funnier and better then this one. I would give this a low rental.",
      "total_reactions": 1,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "They should stop making these. They either have good salesman or really stupid investors, i would like to know how and who does the research before they invest into these movies.",
      "total_reactions": 5,
      "user": "PaulaNR"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This beautiful masterpiece is one of the best films I have ever seen. Martin Lawrence is masterful in the art of slap-stick comedy and intelligent humour. The subtle shakes and jiggles by his fat suit only magnify his artistic, majestic comedy abilities. This film is not only heartfelt, but also funny. I highly recommend this classic to anyone who enjoyed other classics as Citizen Kane, Psycho, and Godfather, as this film surpasses even those greats.",
      "total_reactions": 23,
      "user": "Tmacfan51"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Just 2 words are needed to describe this movie: Corney & Awkward. OMG, Boy was this thee worse movie Ive ever went to the movies to see!! For the first time, I actually couldn't wait for it to be over. This was a total waste of Money. I cant believe people actually have the nerve to give this a 10. For once I actually agree with the critics on this one(rare). The other two 'Big Mommas' was really really good(great) & funny so I thought this one might be worth a watch but boy was I wrong, most movies fail with sequels & this is one of them. I should have trusted my instincts after watching the trailer. I did get approximately 3 laughs but that's nothing compared to the others, not much of a compliment here. This was quite utterly a Tasteless Comedy all the way through, It starts off slow, you hope it gets better but it hardly does, It wasnt even pieced together right. This was not good at all. Dont listen to the good reviews. It was actually Cringe Worthy & thats thee worse thing that can be said about any film, I was Embarrassed for the makers. Everything about it was wrong, it was awful, take it from me. Not Recommended.",
      "total_reactions": 4,
      "user": "Cazatuz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Hollywood has done it again. What a thrill ride of a movie! An absolute delight and work of art. If this movie were a woman, I would most likely pleasure her with a reach around and a good rim job. Martin Lawrence is a divine God of comedy. Where does he come up with all his wacky, fun shinanigans? A Black masterpiece.",
      "total_reactions": 4,
      "user": "VFStein"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "\"As Unnecessary this film may be it does provide some laughs but nothing spectacular. The Story feels wasted and overused and acting is nothing short of terrible. But somehow i was surprised just enough to MILD MILD recommend it . just buy like a hair!\" .. C",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Not the best, but this film is a must see and an excellent watch! The film is interesting,funny and action-packed! I loved it! It also has a bit of mystery and excitement that everyone enjoys!",
      "total_reactions": 2,
      "user": "MovieMadness"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Should've win a damn Oscar! The acting and screenplay is superb! Martin Lawrence is god's gift to Comedy. The way he portrays the fat black woman makes you feel as if YOU, yourself, are a fat black woman fighting crime. lol",
      "total_reactions": 7,
      "user": "BrendanL"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Following in his father's footsteps, Trent(Brandon T. Jackson) falls for, in the immortal words of the late Rick James, \"a very kinky girl,\" just like his dear old sweet mama. Like father, like son, indeed, or maybe it's just sloppy writing. A decade ago, in Raja Gosnell's \"Big Momma's House\", FBI agent Malcolm Turner(Martin Lawrence), a master of disguise, first put on his fat suit and wig as part of a federal investigation against Sherry Pierce(Nia Long), Trent's mother, whom the bureau had suspected of laundering money stolen by her thuggish boyfriend(Terrence Howard) during a holdup in the bank where she worked as a teller. Disguised as the person of interest's aunt, try as he might, Malcolm simply could not relate to his target as a 400-pound(by conservative estimates) mammy. His attention for Sherry would prove to be problematic, especially in the scene where the supposed niece crawls into bed with the undercover agent, and nearly blows his cover when their immediate closeness triggers a physiological change in the cross-dresser's anatomy. Although a flashlight explains away the first initial concentration of blood(obviously reallocated from his brain), Malcolm's state of sexual arousal persists, so when Sherry gets no answer to her inquiry about a possible second flashlight, as it's edited(the filmmaker cuts away to the next set-up), the moviegoer wonders if she eventually vacates herself from the highly-charged bed, because from her perspective, Hattie May Pierce must either be a man, or a hermaphrodite. In \"Big Momma's: Like Father, Like Son\", Trent(formerly played by Jascha Washington in the series' first two entries), an aspiring rap star, pays homage to his mother of indeterminate sexual orientation by dating a girl whose taste in potential partners are simpatico. Oblivious to his feminine environs, a school of the arts for girls, Trent pees standing up, just as Haley(Jessica Lewis), a talented pianist, sets foot into the dorm room, and similar to Sherry, the singer-songwriter seems unfazed by the implied organ-related anomaly at hand, since the force of the outgoing liquid in concert with the abiding urinal, would suggest a sex-based discomfiture of startling proportions. And yet, Trent goes unquestioned, despite being an obvious drag queen(Lawrence is marginably more successful as a woman), and continues to be accepted as being woman-like, which conveys an ambivalence in Haley about the second, more radical possibility. As his alter-ego Charmaine, the self-proclaimed \"Prodigy\" is ever mindful of staying in character as it relates to sexual boundaries, unlike his father who, after learning that Sherry had committed no crime, forgets his put-upon identity and kisses her, not particularly chaste-like, a beat too long, full, on the lips. Instead of reacting in outright horror and disbelief, Sherry gives Big Momma a look that intimates the opposite. Yes, \"Big Momma's House\" establishes the future Mrs. Turner as straight, but still, as a result of some slipshod writing, there's these gaps that preside over her ostensible heterosexuality. Likewise, in \"Big Momma's: Like Father, Like Son\", Haley falls for a man, the rapper(also a nascent Duke student), but perhaps she concurrently falls for the perceived hermaphrodite, as well. When Haley first lays eyes on \"Charmaine\" in the cafeteria from \"Fame\", she looks thunderstruck, giving the homely a frank appraisal of \"her\" loveliness(it must be love) with her twinkling eyes and outstretched mouth. At the year-end showcase(in other words, talent show), because Trent needs to remain incognito from his gun-totin' pursuers, he replaces himself with his doppleganger femme, who performs the hip-hop-tinged love ballad that he collaborated with Haley, a song in which the girl tells the hermaphrodite \"you're the air that I breathe\".",
      "total_reactions": 5,
      "user": "Shiira"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "ignore what the critics say and see it, you WILL laugh!",
      "total_reactions": 5,
      "user": "scbrother"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Too ****",
      "total_reactions": 8,
      "user": "sergeysnl"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Once again, critics almost always hate the movie that have potential, I saw it and it is funny, and better than what the trailers do, I just don't get the rating, thank god for User Score.",
      "total_reactions": 9,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I want to say it was disappointing but that would be inaccurate because i went in knowing that it was going to be awful. I was right ! The movie is bad from top to bottom, from the poorly developed and uninteresting characters to the unrealistic and naive plot, from the humorless jokes and cheesy spontaneous songs to the lame, lame actors(and i'm not talking about Martin Lawrence which was pretty funny, although you couldn't laugh  because any funny thing was followed by something really lame). Horrible.",
      "total_reactions": 2,
      "user": "Razv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "This would have been a really funny movie if it was released ten years ago. Lacked creativity; and the acting was terrible. Although there were some funny moments.",
      "total_reactions": 1,
      "user": "MrTeddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "I love this movie it was very very very funny. I would be great for a 12 to 13 year old kid, or even for an adult, family.",
      "total_reactions": 0,
      "user": "horsesbatchelor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "Like Father, Like Son is the weakest of the series and one of the worst comedies ever made. Unoriginal, unfunny and very annoying. The jokes are outdated and cliches all over the place, it was a torturous experience for me, and this Big Momma has gone way too far from the original concept of solving big smart cons and crimes into simple ones. I did not like this one.",
      "total_reactions": 0,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2016
      },
      "score": 2,
      "text": "A generic pile of crap, mixed with crap, add a dash of crap and then a pinch more crap.  Martin Laurence finds another excuse to get into drag and drags his son along for the ride.  Pun intended.",
      "total_reactions": 0,
      "user": "marcmyworks"
    }
  ]
}