{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 74,
  "mc_mixed_rating_frequency": 80,
  "mc_movie_name": "Big Hero 6",
  "mc_negative_rating_frequency": 36,
  "mc_positive_rating_frequency": 618,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 90,
      "summary": "Take my word for it, or better yet go find out for yourself: Big Hero 6 is a treat."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "East meets West to immensely satisfying effect in the vibrant mash-up of an animated romp, Big Hero 6."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 89,
      "summary": "Sweet and sharp and exciting and hilarious, Big Hero 6 comes to the rescue of what's become a dreaded movie trope — the origin story — and launches the superhero tale to pleasurable new heights."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 88,
      "summary": "It’s a movie that’s as fun to watch as it is funny. But the real appeal of Big Hero 6 isn’t its action. It’s the central character’s heart."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 88,
      "summary": "With a film this funny, exciting and visually stimulating, who cares if you know exactly what's going to happen next, and when."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 88,
      "summary": "The storytelling is solid, propelled by characters that you come to care about."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 83,
      "summary": "At times, Big Hero 6 gets a little too noisy for its own good, but that never manages to drown out its many quieter charms."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "Whatever flaws it has are ones of over-enthusiasm and over-ambition and are therefore easy to forgive, especially because when it works, it really works."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "After \"Frozen,\" Disney delivers a heart-melter. The sweet, witty main pairing focuses a potentially busy, derivative super-group tale. Stay for the sting: Big Hero 7 is practically a given."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "The Scooby-Doo-ish central plot is forgivable in a movie with so much visual verve, energetic action and a character so wondrously designed as Baymax."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 80,
      "summary": "Amid all the nerd-inspired firepower that gives the movie much of its flash, the big boy's droning tone proves to be the film's stealth weapon, perfect for pulling off highly targeted comic strikes."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 80,
      "summary": "Big Hero 6 is good enough to transcend its blah ending and to make the case that every superhero story should be entirely animated."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 80,
      "summary": "It ultimately amounts to a feature-length origin story, but with characters this unknown and execution this fun, that’s an asset, not a liability."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 80,
      "summary": "Big Hero 6 was executive produced by Pixar guru John Lasseter. You can see the influence in the high quality, from the appealing 3D animation to the unusually sharp story and script (a cooperative effort credited to seven people)."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "A melding of old and new modes of animation, in which the attentive artistry of the past coexists with the hyper-detailed, computer-generated present."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 78,
      "summary": "Another friggin’ superhero story that acknowledges comic-book tropes while rarely subverting them, Big Hero 6 is powered nonetheless by its witty charms, lively animation, and swift pace."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "This one's a winner. And Baymax, baby, call your agent. You're about to be a household name."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Although competently made and consistently engaging, there's nothing special about this animated superhero origin story."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "An action adventure that puts brain ahead of brawn as a valued commodity is always reason to celebrate. Add in the considerable heart that Baymax contributes (with elements borrowed from both “WALL-E” and “Up”), and you have a winner."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "The most endearing character in Disney's animated superhero animated movie is a one-man Affordable Care Act. (Make that a one-robot ACA.)"
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "A rousing movie that’s satisfyingly infused with traditional Disney sentiment."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Big Hero 6 is second-tier Disney/Marvel entertainment, fine for a day out with the children yet doesn't seem enough, after the creative advances of Wreck-It Ralph and the emotional heft of Frozen."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "The visuals are splendid. Even close-ups of face and hair are something to marvel at."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Without making a big deal out of it, Big Hero 6 features a shrewdly balanced and engaging group of male and female characters of various ethnic backgrounds. It'd be nice to live in a world where this wasn't worth a mention, but it is. And yet the movie belongs to the big guy."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "It’s manipulative and overlong, too loud and “Incredibles” action-packed for the very young. But the manipulation errs on the side of mercy, compassion, sacrifice and humanity."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "As much as the action stuff works and would indicate that any other property Marvel entrusts to the animation side of things is in good hands, Big Hero 6 gets by more on the charms of its comedy."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 70,
      "summary": "Therein lies part of the dissonance with this often-wonderful, deceptively strange movie. You could get emotional whiplash watching it."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 70,
      "summary": "Big Hero 6 is easier to admire than to love. It veers from chipper to noisy to dark stretches where it grapples with adult-sized grief."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "After establishing its fresh and relatable origin story, the movie gets bogged down with a relatively generic villain’s power-hungry schemes. Still, there’s enough that’s new and different about Big Hero 6 to get excited about, especially for those still too young for Marvel’s more intense live-action fare."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 67,
      "summary": "Big Hero 6’s considerable graces as an animated film — its fantastical layouts and bouncy sense of figure and motion — are offset by its deficiencies as a second-rate superhero flick."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 63,
      "summary": "Gorgeous and disturbing, Big Hero 6 is a departure for Disney: a film targeted at older kids, and the studio's first venture into straight-up comic book culture. Walt would flip in his cryogenic chamber if he saw this anime-style production."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 63,
      "summary": "Consider it a more family-friendly \"Guardians of the Galaxy,\" with the added kiddie appeal of a big, inflatable windbag to laugh at and love."
    },
    {
      "critic": "Chris Heller",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 63,
      "summary": "The film quickly becomes a study of grief and retribution, and the question of how exactly technology can and should be utilized in the treatment of these emotions."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "It is, after all, the Baymax show - and he is cute, cuddly, comedy gold. Fortunately, although Big Hero 6 has various flaws, he's generally on hand to patch them."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Especially when Baymax is onscreen doing his adorable-puffy-robot thing, Big Hero 6 qualifies as a better-than-average kids’ movie with enough cross-generational appeal to make it a fine choice for a family weekend matinee. But I couldn’t shake the feeling that this film was designed to function as a starter kit for future Marvel aficionados."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "As far as 'toons go, it's probably most reminiscent of Pixar's \"The Incredibles,\" given that both are stories about superhero teams. There are also echoes of \"How to Train Your Dragon\" in the flying scenes, featuring little Hiro perched atop Baymax's back. But even then, Big Hero 6 still feels like its own, distinct creature."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "The animation is fluid and inventive, balancing action and slapstick with aplomb."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 50,
      "summary": "Big Hero 6 even has a title that sounds like a product ordered off the takeout menu of the type of restaurant that recombines a few elements in many ways. That could work fine, if any of the ingredients were particularly flavorful."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "My friends 5 year old noticed the holes in this movie... what a let down. The animation looks good, the characters are ok on their own, but the story... oh my god the story is horrible. Cliche after cliche and forced emotional situations. It was clearly following a formula rather than a story. Whoever wrote the story needs to be shot for how badly it progressed. I actually predicted the entire movie in the 1st 10 minutes (I didnt know anything about it going in) and the only thing I got wrong was who the villain would be. I figured that the movie seems to cheesy that it would try another predictable twist like making the elder brother the bad guy and he is doing to get his GF back. That is how predictable the movie was. No originality whatsoever and it got worse as it went along. I almost puked when i saw it turn to a bad superhero flick. My friends 5 year old asked us why the kid didnt just build more of the small robots or make a new remote control (referring to the brain control interface).... how sad is it that a 5 year old figured that out? Not good.",
      "total_reactions": 14,
      "user": "marc5477"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "The only good things about Big Hero 6 are the fantastic idea and rendition of San Francisco in a Japanese architectural style and the \"out-of-power\" Baymax scene. As for the rest, same old same old story, good vs evil and blah. I hated the excessive amount of action (all over the place, really) and I still prefer hand-drawn over CG. But now that Miyazaki's out of the picture, what can we do?",
      "total_reactions": 13,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "I have to say that I am becoming increasingly weary of both the quality of animated films lately and the seemingly tireless obsession audiences have for super hero films which, it seems I finally have to admit are not my bag. Big Hero 6 combines the two and aside from the brilliant animation and delight of combining the cities of San Francisco and Tokyo to make San Franokyo, this remains a bit of a slog to get through. Baymax is a lovely character, but the plotting is so predictable that the interest remains muted. Needless to say it's a big hit and sequels will undoubtedly follow, but I for one will sign out here.",
      "total_reactions": 8,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "As a near-perfect interpretation of the Marvel Comic, Big Hero 6 is a spectacular and memorable animated movie, and Baymax is undeniably one of the greatest Disney characters of all time!",
      "total_reactions": 13,
      "user": "TotallyEpicHD"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This is an addition to my all time favorite movie and Baymax is now my favorite disney character. The thing about disney films is that it always bring out the child in every grown ups.",
      "total_reactions": 13,
      "user": "xenonpages"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "I love Disney movies just as much as the next guy, but I had mix feelings about the plot-line and some of the characters.",
      "total_reactions": 6,
      "user": "Salsand3r"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Following the positive track record that Disney's animated studio has, with recent releases of Frozen and Tangled, it was easy to see why I was excited about Big Hero 6. But, that excitement was short lived. Before I explain my dissatisfaction with the movie, I will go over the positives of the film.",
      "total_reactions": 14,
      "user": "Billyheel"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "As a single senior with no kids to accompany me to this well received animated wonderment, I was confident that this movie would entertain me in the same vein as The Lego Movie and Wreck It Ralph. I thought it was again built for kids with a sprinkling of adult concepts enough to emerge from childlike entertainment to amuse the adult funny bone throughout. Wrong! This is a kid's movie...period. Intense color, action, no logic to the story elements, just a kind of psychedelic splattering of stream of consciousness video game dream sequences. Over 18? Beware the waste of your movie dollar. Under 18? The action, state of the art animation, and absolute childlike fantasies brought to life, it's beyond loveable.",
      "total_reactions": 14,
      "user": "Chazd3"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Visually resplendent,  gleefully hilarious, and superlatively emotional, Big Hero 6 is a solid, if slightly familiar addition to Disney's recent string of great movies.",
      "total_reactions": 11,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "Big Hero 6, is another disappointing movie from disney this year.",
      "total_reactions": 8,
      "user": "johnangel"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Big Hero 6 is a heartwarming, action-packed comedy adventure film that brings the superhero trend to Disney Animation studios and they certainly hit it out of the park. It is beautifully animated, fantastically written and remembered for its delightfully charming companion robot Baymax, who is essentially the more well-versed version of Pixar’s Wall-E. The story instantly encapsulates the audience in the world of Sanfransokyo with a group of charismatic and empathetic characters, which is certainly what Disney does best.",
      "total_reactions": 8,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This is easily one of Disney's greatest achievements as it has it's happy and sad parts like both Frozen, and Wreck-It Ralph. It holds on to everything great and let's go of everything bad.",
      "total_reactions": 8,
      "user": "kateuptonlover"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Big Hero 6 is a gorgeously animated movie and a technical masterpiece. It is also full of emotion, funny moments, adorable characters and creative action scenes that blew me away. I will definitely be seeing this again.",
      "total_reactions": 13,
      "user": "Soapert"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Ok well I went to see this movie yesterday not really knowing what to expect the previews sure didn't look great but I decided to just go with it and possibly have a good time well I loved every second of it a true Disney master peace once agin my only word of caution is to parents with really young kids the end is violent and the subject of death is tackled threw a majority of the movie but other than that a perfect family movie and a good choice for almost anyone action packed family fun for the whole family",
      "total_reactions": 10,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Nobody looks at the messages in a movie anymore, this movie is preparing our culture to try to become better god's than we currently are... lol, and teaching us that in order to ascend into a greater evolved self, that we need upgrades... I wish i could make this up but the only God, totally predicted this would happen (among other predictions that came to pass) and recorded the last time this happened culturally... humanity became pretty evil and God in his mercy had to destroy it in a world-wide flood to save Noah and family and all future generations born into the then (and now) unforgiving and evil world. You are told of all the nice things technology gives us but nobody considers all the terrible things we will do with it. Holographic sex doll anyone? Or if your grandpa was Hitler and someone uploaded him into the internet maybe he gets downloaded into a nice robot. My concern here is not technology itself, I believe we're just wanting it so to cheat death and keep sinning, not being accountable to God but BEING God. The wages of sin is death, and through Christ Yeshua (Jesus) you can live. But mark not my word but God's Word; we're not going to be allowed to live forever with or without technology apart from Jesus. God said \"My Spirit will not contend with man forever\" Gensesis 6:3. I'm not judging you for watching or even enjoying the movies, I just don't want people to be deceived. Your probably thinking i'm totally deceived too. That's ok but please don't hate me!  Or say i'm being \"intolerance\" and then become totally intolerant of me. But when your kid begins to hate himself because he's not as good as all the superhero's he sees in every kids show or as big as the school bully, just tell him he'll get an upgrade one day. We don't need technology near as much as we need Jesus, our moral example and creator. Don't you think that he would know what would or wouldn't make us 'better'? Anyway, i'm not trying to convert anyone, I'm completely incapable of changing anyone's beliefs no matter how much I write here, that's a matter between you and God who says, \"I will give you a new heart and put a new spirit in you; I will remove from you your heart of stone and give you a heart of flesh...\" Ezekial 36:26. I'm just saying we should seek truth for ourselves and not believe everything Disney or Microsoft or Nasa is telling us.",
      "total_reactions": 10,
      "user": "sonoflehigh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Though this isn't as good as Wreck it Ralph or Frozen, Big Hero 6 still is a fantastic time at the movies for all families.  This has many of the same elements a fun action adventure mixed with a lot of emotional heart felt moments.  A-",
      "total_reactions": 5,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Fantasticly animated, a visual masterpiece with many lovable characters and plot twists. I saw it twice in theaters. If you liked frozen but you wanted everything about it to be more awesome, go watch big hero 6.",
      "total_reactions": 5,
      "user": "TheBlondeNerd"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Adding on to this great film year is Big Hero 6. A fun, emotional, and comical animated film loosely based on the indie-Marvel comic of the same name. While very slightly cliche at some points, it is entertaining and one of disney's best non-musical animated films in years (along with Wreck-it Ralph). The characters connect to you, even the cuddly robot Baymax, the animation is great, and the voice acting is solid as well. This is the first moment when I can say Disney has officially defeated Pixar in the quality of computer animation films. Pixar had three off movies in Cars 2, Brave and Monsters University, while Disney produced Wreck-it Ralph, Frozen, and this film, a great film all-around and one worth seeing, whether you are an adult or kid.",
      "total_reactions": 9,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Big Hero 6 really blew me away, I expected it to be good since Disney is having another animation renaissance but once the credits began to roll all I could do was wish it was longer. This movie has something for everyone, comedy, action, some despair. In fact, surprisingly the only thing missing was romance, which is fine with me.  If you love superheroes, robots, and animated films, I think you've found your holy grail.",
      "total_reactions": 9,
      "user": "Kuvira"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "I just simply didn't enjoy this movie. The plot was so used, jokes weren't that funny, the idea of characters and settings are awesome but overall it was poorly executed.",
      "total_reactions": 11,
      "user": "maxguy2099"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Big Hero 6 is a great addition to the Disney animated canon. Its action-packed sequences, beautiful animation, and great characters just proves the Disney is on a revival era",
      "total_reactions": 11,
      "user": "Twizzy90"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "My family got tickets to an early showing. The movie was excellent. The atmosphere was refreshingly different, the characters fleshed out, the plot touching, and the humor was rich and consistent . I would recommend this one to anyone, and especially to couples and families with children.",
      "total_reactions": 10,
      "user": "Costs1129"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "\"Heartfelt, admirably entertaining, hilarious, and visually stunning.\"",
      "total_reactions": 8,
      "user": "DaMovieLover"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "EXCITED  and Funny Outstanding!! Itulah satu kalimat yg aku gambarkan buat BIG HERO 6. Menurut saya film Big Hero 6 ini sangat ringan dari sisi plot dan alur cerita. Memang nonton film ini untuk dihibur oleh karakter Baymax sebagai bintang utamanya. Seisi bioskop sering banget ketawa lepas tiap kali ngeliat kelakuan Baymax yang super gemesin. Jadi memang jangan bandingkan dengan plot film Marvel lainnya seperti Guardian of Galaxy atau the Avengers, coba bandingkan Big Hero 6 sama film Frozen deh biar gak terlalu berekspektasi tinggi.",
      "total_reactions": 8,
      "user": "Wahlberg"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "You'll find yourself lost in this brilliantly constructed animated world. It's not everyday you find an animated flick as honest and touching as this one. Baymax is sure to become another highlight character of Disney.",
      "total_reactions": 6,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "I had very great expectations for this movie especially after seeing reviews/box office earnings. However, i was terribly disappointed. it seems this movie was made solely for young kids who have little sense of how the world/reality works. Too many movie cliches used in this movie... so many that I can't think of a single original plot line/device used by this movie. You could see plot twists from a mile away e.g when it was about to be revealed that Callaghan was the guy in the mask. This movie is for little children who swallow everything they are fed. I give a 5 rather than a 2 or 3 just because a few parts made me genuinely emotional. Overall, an overrated, over-hyped disappointing movie.",
      "total_reactions": 6,
      "user": "chidime"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Big Hero 6 is such a great movie! The animation is beautiful and is somewhat reminiscent to Wreck-It Ralph (which I loved as well). This movie managed to topple my expectations before I saw this movie in theaters. It has great voice acting, touching moments, a great tribute to science, and, again, has absolutely gorgeous animation and the only downside being its predictability. Big Hero 6 will definitely move on to be a Disney Classic.",
      "total_reactions": 6,
      "user": "demolisher7778"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "To be fair, I have always been a fan of animated films but Big Hero 6 is beautifully animated and the setting is alive. You could watch the movie multiple times and see new things going on in the background of nearly every scene. I had fun the entire film and it never felt like it was dragging or rushed. I didn't find the movie to be too geared towards small children or reliant on silly gags to be inaccessible to adults. I'm in my 30s and the Baymax fist-bump made me laugh harder than I have done in a long long time.",
      "total_reactions": 6,
      "user": "MrTrelawney"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Since I was so disappointed by Frozen, I was hoping Disney would step up their game for this film. After I saw the first 30 seconds of the film, I knew it was going to be amazing. The action never ends and the cast features a large range of loveable characters. You'll come across some sad moments but as a whole this is one of the best animated films in years!",
      "total_reactions": 6,
      "user": "sonic4president"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Big Hero 6 is a wonderful action packed superhero movie that is inspired by the Marvel Comics. There are 6 things that this movie is the best animated movie in 2014. #1, This is inspired by the Marvel Comics and I'm a huge fan of the Marvel in general. #2, this movie has the biggest cast ever in a Disney movie and it is also has a diverse cast, which is i really like, even though the original comics are all Japanese. #3, The animation is done really well and the they did a really good job picking those casts and getting into their characters. #4, the story is the most heart-warming and brilliant plot that I have ever experienced. #5, I loved the character Baymax because he's huggable and made all of us laugh and love his fistbump whenever he does it to anyone. Finally #6, this movie is better than Frozen. This movie gives a perfect 10/10. If you haven't watch the movie, then go for it. This is a great film that is suited for everyone. That is all and thank you.",
      "total_reactions": 6,
      "user": "Cyclops4Life"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "As a comic book reader and lover, I am ashamed to say I knew next to nothing about Marvel's Big Hero 6 past a few sporadic reads here and there. The characters were always enjoyable and kept my interest, but it never lead to anything more than a mild fondness, so when I heard there would be a Big Hero 6 I can't say I was anything more than intrigued. The first Disney animated film to feature Marvel Comics characters since the acquisition in 2009, the characters seemed ripe for an animated romp onto the big screen, but detail changes to core characters left many fans holding their breath and hoping that the animation pioneers wouldn't turn their beloved characters into nothing more than second rate acts for their theme parks upon the films release. I am here to calm some of those fears and tell you that Big Hero 6 is a lot of fun!",
      "total_reactions": 6,
      "user": "petrocs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Big Hero 6 might not get its high marks on originality but the gorgeous animation, timely humor and at times heartfelt make for one entertaining film.",
      "total_reactions": 4,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Big Hero is one of the best animated movie that I have ever watched, it is fun, touching and surprising. The movie is not predictable, the animation is beautiful, and the city (San Fransokyo) it's incredible, and they created a new hero that is original and funny. definitively should be in the best movies of 2014.",
      "total_reactions": 4,
      "user": "victorhjkl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "I felt guilty enjoying it too much because I'm grown. Its the Big One parents been waiting for, you might like this film better than your kids do,  its better than any of the adult action/thrillers this winter, even beating Mocking Jay. You won't blink or wish for this movie to be over. Has an incredible story line, great flow, awesome characters you can feel in touch with, as well as an emotional connection and morals.",
      "total_reactions": 2,
      "user": "chughead"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "As an adult I went in to this movie with some hesitation. It being one of those \"meh\" weekends at the theater and a friend really wanting to see something. Well I was pleasantly surprised. The plot of this film is not overly complex, it being aimed at children. But despite being simple it is very effective. The film has a lot of heart and likable characters and a good balance of pacing.",
      "total_reactions": 2,
      "user": "Gamed2long"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "From the creators of Frozen, comes another magical animated movie.",
      "total_reactions": 2,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "9/10",
      "total_reactions": 2,
      "user": "ZadenBuria15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "This Heartwarming family movie is one of the most best Animated Feature of the year. Strong Animation, Good Action Sequences, talented actors, amazed story and sound mixing and very funny. Replay Value: Very High",
      "total_reactions": 2,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "With the huge success of Wreck-it Ralph and Frozen, the mouse house seems to know that an animation production will only work if the theme, culture and background are connected to the modern lifestyle of the society. Although it feels like the plot itself lacks some originality and a bit formulated with easily predictable twisted climax, the combination of bouncy actions and motions, amusing development in between the cool characters, usual family, love and certain emotional-driven moments and colorful 3D visual effects are brilliantly enough to allow kids to enjoy, but this Marvel's adaptation seems to aim at the older teens and adults. It is a little bit transformeric and Bayish-style by starting off with some familiar scenes in \"Real Steel\" and having electronic pop-rock style scores from the composer Henry Jackman. However, setting in a background of American-Japanese culture might lead to the thought of targeting Japan's market after enormous profit from there, but this adorable, kind-hearted, friendly robot Baymax reminds us of good moral values, and certainly, it will easily be one of the most loveable character among the audiences.",
      "total_reactions": 2,
      "user": "michael1208"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Best Animated Film Of 2014! A very heroic movie. Incredible!   =)  thank you so much chris williams and don hall for making this movie. I have been waiting this movie for so long and i hope metacritic will give a score of 100 to this movie, thank you.",
      "total_reactions": 2,
      "user": "Jeri"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "I have not read the comic.  This story was good.  Good family fun.  Entertainment for all ages.  Packed with plenty of action, emotional ups and downs.  Played the downs a little too long for my liking.  Amazing animation.  And, of course, look for the Stan Lee cameo.",
      "total_reactions": 2,
      "user": "Cycled"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Trust me, or don't your just gonna be missing out. This movie is great. the plot is great, the animations are great, long story short this movie is worth more than 15 dollar tickets.",
      "total_reactions": 2,
      "user": "ThatOneCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "I loved this movie!!! The plot was fun, suspenseful and hilarious at the same time!!! The animation is amazing, the futuristic theme blows me away, but the plot twists are a little annoying. WATCH THIS MOVIE NOW",
      "total_reactions": 2,
      "user": "jswessler"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "As a family oriented movie, it's amazing. It does exactly what it's supposed to do. The visuals are very well done. However, it's nothing groundbreaking because the plot, characters, and conclusion are nothing I haven't seen before in a movie. It does what it's supposed to do extremely well and nothing more.",
      "total_reactions": 2,
      "user": "Knuckleberry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Wouldn't say it's on the top echelon of Disney movies, but it pretty damn good. It's pretty cliche, but it has it's moments of great creativity. The plot is a little comic book generic, but the movie shows that with some references and **spoiler** Stan Lee at the end. (Sadly he might not be around for the next one). So all in all that generic story line didn't affect the overall movie. Sadly the length is what hurt. It's rushed towards the end and the reveal of the villain comes too quick. The length is a little over 1 and a half hours, which is too damn short. The ending is where your really see the short length. It's rushed and the final boss seen is overwhelming. Overall I'm satisfied, but I would not say this is one of the better movies of the year or better than Gone Girl.  8.8",
      "total_reactions": 2,
      "user": "bmaster46166"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "This is truly the funniest movie that Disney ever made!!! Well I wish I could see this movie everyday, especially the very funny & weird handshake... this is truly USA\"s #1 movie!!!",
      "total_reactions": 2,
      "user": "darrenkty"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Big Hero 6 is a visual masterpiece which speaks accord to the recent Disney Renaissance of movies, yet to older audiences will feel somewhat shallow and uninspired, despite the clever humor and brilliant setup.",
      "total_reactions": 2,
      "user": "Sami1309"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "While I didn't feel the movie was the best I'd ever seen, I have to praise it for the brilliant way it sold its non-violent message.  The action was solid, but the plot was VERY predictable, probably among the most predictable I've ever seen.  It's not predictable in a bad way, however.",
      "total_reactions": 2,
      "user": "PoultryInMotion"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is a fantastic animation with a lot of action and the perfect amount of humor to balance it. I would highly recommend this movie to adults and children.",
      "total_reactions": 2,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Lovable characters and an original story collide to form a touching animated film. Not only does the plot twist make the story intriguing, but the realistic aspect of everyone dies make this movie even more amazing.",
      "total_reactions": 2,
      "user": "SirMustardseed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "EXCELENTE!! A melhor animação de 2014, ao lado de Como Treinar o Seu Dragão 2, com certeza!! Mais uma animação que preza mais pela \"ação\" do que pela \"comédia\". O filme tem um ritmo muito bom, com uma perfeita dose de humor, não cai no clichê de ser engraçado a todo momento. Com um personagem principal muito carismático e com uma história de \"origem\" que consegue não ser cansativa. A fotografia do filme é incrível e o nível das texturas e designer do 3D está excepcional!! Realmente, uma animação muito bonita e divertida tanto para crianças como para adultos. Digna de uma futura continuação. Recomendo fortemente!!!",
      "total_reactions": 2,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Very good for adults and children as it will entertain both.. My 4  year old liked  it as much as Frozen so that says it all when it comes to the true test.",
      "total_reactions": 2,
      "user": "crai3g"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "There really needs to be more original superhero movies that we can call \"Grand.\" I can't tell you enough how cliche - no matter how enticing - the Marvel franchise is these days. I like Marvel, but we need more heroes than them, you know?",
      "total_reactions": 2,
      "user": "LocoGuy107"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Disney does it again. After last years mega-hit of Frozen the pressure must've been felt to come up with another great family movie that people will return to for years to comes. Big Hero 6 is definitely another Disney classic. It tugs at the heart strings of the viewer and gives Disney lovers another great character to admire in Baymax. A great family film and definitely one to revisit again and again.",
      "total_reactions": 2,
      "user": "ajarias96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Funny, Heartwarming, Smart and creative. Big Hero 6 is a movie that everyone should go see. Based on Marvel's comic book, Disney was very smart enough to release a film that is stunning!",
      "total_reactions": 2,
      "user": "TheLatinoCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "The movie is good enough. Will it become a classic? Maybe, this generation has frozen as icon, probably this one will go down as easy. But what bothers me is that this movie does not develop, it supports itself over cute scenes and jokes for as long as it's humanly possible.",
      "total_reactions": 2,
      "user": "The_hamur"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This movie was amazing. I went and saw it on a whim, because I had nothing better to do. Now I pity the alternate-universe me that didn't see it. The movie had me laughing the entire way through, and I'll admit, I cried when Baymax \"died\".",
      "total_reactions": 21,
      "user": "TheGameGeek"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2015
      },
      "score": 0,
      "text": "I went into this film backed by the excitement and hype during its initial release.",
      "total_reactions": 12,
      "user": "themacmeister"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "It seems Disney wants to step out of its boundaries on how it portrays family relations, this time focusing on a brotherly relationship with Big Hero 6, even if that relationship is relatively brief. However with the title of \"Big Hero 6\" you hoped to see a spoof of the Justice League with possibly one of the more humorous robots of the past years. Despite these elements, it never exceeds to be anything flavorful with a rather unremarkable protagonist whose sole function is to whine a good amount of the movie, and where the plot fails to pick up any sort of momentum.",
      "total_reactions": 5,
      "user": "Rem"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Really, really enjoyed this movie, the kids too, they wanted to see it again, the minute we left the theater.",
      "total_reactions": 5,
      "user": "pzol"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "With The Action Of Marvel,The Emotions Of Disney and the humors of both,Big Hero 6 is a great animated film from Disney.Fun and stunning,Big Hero 6 is wonderful.It may have a predictable Plot and a the other characters might have less development but it didn't ruin the movie due to it's great development and chemistry between Baymax and Hiro Big Hero 6 is cute and an emotional film and the best animated movie of the year for me.",
      "total_reactions": 5,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 23,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "Big Hero Sux.. First of all, the way this film was marketed was dishonest.  It seemed like it could have been a character driven Disney film. This along with Wreck It Ralph have attempted to hijack the legacy of Disney Animation to loud and obnoxious action scenes strung together with a cliche plot.  Once again, this should have been under the Pixar label as not to ruin Walt's legacy.  Cashing in on their Marvel acquisition, The Walt Disney Company has attempted to make a kids movie which resembles every single other super hero movie out there.  Can you imagine if a classic like Aladdin just had 5 minute long action sequences strung together instead of jokes and songs? This one makes lesser known Disney films like The Black Cauldron and Atlantis look like a masterpiece akin to Bambi.",
      "total_reactions": 37,
      "user": "jumpinjamie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "One of Disney's great animation traditions is to show a short before the feature. \"Feast\" is a delightful look at a hungry puppy. Then comes the main event, an energetic and non-stop action adventure that follows a young man (Hiro) and his large, soft robot Baymax. They team up with a group of inventor nerds to form a super group that tackles a villain with a cool weapon. The pace is lively and the characters are interesting, but only one (voiced by T.J. Miller) provides any comedy. Most of that is left to Baymax's sweet size and lovable attitude. The visuals are bright, beautiful and dazzling, as Disney does best. Fun for kids and adults. NOTE: Stay thru the credits for one of the best cameo gags ever!",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Big Hero 6 is a witty and hilarious superhero flick without the recent trend of nasty grittiness. Visually engaging, the movie is easily accessible and will entertain general audience. Its many heartfelt moments as well as genuine comedy elevate the movie into the caliber of Disney's greats. The plot moves fast as it shows a lighter take on superhero formula, it never presses too much or heavy handed on its approach. While Disney is always known to showcase visual in fantasy setting, it's nice to see the vista changes to modern city of San Fransokyo, as the name suggests, an oriental version of San Fransisco.",
      "total_reactions": 3,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Big Hero 6 is not as strong as Wreck-it Ralph or Frozen, because we see concepts that were already in other films, like playing with the figure of the bad guy, from the first one, and evaluating the relationship between brothers, from the second one (but with girls). Although there is a new thing in this movie, not an idea that breaks paradigms, but interesting as well: mourning and how to face it. We notice the reactions, the different paths to overcome it and the acceptance. All of this is achievable by the presence of a protagonist that allows to audience to identify with, a lovable/charismatic companion and a parade of eccentric friends. Big Hero 6 is a film that will enjoy not only the children; makes you laugh, feel intrigued and even being sad, but definitely have a great time.",
      "total_reactions": 3,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Hey, lets face it. They know how to make a good animated movie now. Case closed. This one does have enough new ideas and some great commentary and issues that keeps the kiddos big and small entertained.",
      "total_reactions": 3,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This is easily one of the top animated movies ive ever seen! These idiotic disney fanboys that are writing bad reviews dont know what they are talking about. I went with my wife and my son and we were laughing from beginning till the end. This movie was very whitty and yes has some action scenes but the story of the boy growing close to this robot pretty much replacing his brother is very deep and heart warming. Everyone has to see this movie especially in theaters. I was well worth my 10 dollars and i will probably go again because its that good!!",
      "total_reactions": 3,
      "user": "rpg4life"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "Continuing their girls-boys-girls-boys theme pattern, Disney finds themselves on the trail of the impossibly and dreadfully overhyped Frozen.",
      "total_reactions": 3,
      "user": "milesprower06"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Big Hero 6 is a great film. Its probably the first animated Disney movie that I loved since the ones from the 90's (yes I just said I did not love frozen, hate me all you want.) It is a beautifully animated movie that has humor, lovable charterers, and makes you feel for the characters... including the villain. I left this movie with a smile on my face.",
      "total_reactions": 3,
      "user": "LethalMuffin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Big hero 6 is by far one of the best animated movies I have seen in a very long time. Cute, funny, lovable and sad all in one cute movie. It had a futuristic superhero setting with a lovable sidekick that you cant help but smile at.",
      "total_reactions": 3,
      "user": "Gennifer11"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This Movie i really hope that is winning Oscar, Golden Globe, BAFTA and diffrent other prices.",
      "total_reactions": 3,
      "user": "Sinbad007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Absolutely wonderful this reminds me of my childhood where I'd day dream of robots and play megaman 2 this really reminded me of megman , great animation, good voice acting , full of excitement .",
      "total_reactions": 3,
      "user": "TheNyanLegend"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Watching this just made me want a Baymax myself. The movie is well made with action-packed scenes and hilarious moments. Of course is worth every penny",
      "total_reactions": 3,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Big Hero 6 epitomizes the advancements of the movie industry in the 21st century. In my eyes, it's the best Disney movie to date.",
      "total_reactions": 4,
      "user": "lordsuarez"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Who doesn't love a good team-up flick? This movie was visually stunning, heartwarming and overall just really fricking cool. Did the fact that a 4 year-old behind my row gave a full length commentary detract from the film...pshhh, not at all! I digress.",
      "total_reactions": 4,
      "user": "NeekReviews"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Three things,Best Film of 2014,Best Disney Film and Best Animated Film of 2014.Period,the plus side about this movie is the animation,the way they construct the story,the likeable characters and also the way the address depression and some serious issues about death which most animated movies don't do so.Even the jokes of the movie were logic in a way that it is not even slapstick,but instead with the logic way of humour.Also this movie has one of the best cinematography in animated movie history so as some of the best fight and action scenes in animation history since The Incredibles and How To Train Your Dragon.And hell yeah,this is way better than Frozen and Wreck It Ralph.So if you are doubtful about this movie,go and watch this movie,if you don't you are missing what it is called the best Animated movie of 2014",
      "total_reactions": 4,
      "user": "charpiechengtz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Animation. It can't get much better than it is, because Big Hero 6 has the best of the best, and looks into the future. It's love and enjoy in one, and has everything a film needs for people to give it a 10. It uses absolutely everything to use and make a brand new hi-tech kind of movie to enjoy for everyone. Creates memorable moments with Baymax, and Hiro really was a Hero. I didn't know if it would be that good before I saw it, but when I went to see it, it was an amazing film that entertained me a lot.",
      "total_reactions": 4,
      "user": "Tbone413"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "It's a combination of the charm, humor, and emotion of a typical Disney animated film with the big spectacle, action, and plot of a Marvel superhero movie. The results are incredibly satisfying. It's a movie that is sure to be a hit with families.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Big Hero 6 is hands down one of the best animated films I've ever seen and maybe the best non-Pixar film since The Lion King. The realism in the animation, while not losing the charm associated with the genre, is stunning, the humanity and emotion in the film is superior to most live action films you'll see, and the story is fresh and entertaining. It combines humor with sadness with action to make for an exciting viewing experience. They also make you absolutely love Baymax, the big, white, puffy looking marsh mellow robot in all the advertisements. Overall, this movie is suitable for people of all ages, genders, cultural backgrounds, etc. Jump into San Fransokyo and get ready for a great film.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Big Hero 6 is a breathtaking visual spectacle that realises the farthest reaches of our imaginations, and dares to go even further. Featuring vivid, textured and rich characters coupled with a screenplay that teems with wit gives us an animated film that proves that Disney don't need no Pixar.",
      "total_reactions": 2,
      "user": "anshiman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "If anything I really am not sure how to feel about this movie. But, I do know I enjoyed it.",
      "total_reactions": 2,
      "user": "Rox22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Something a little different from the typical Pixar story, but still filled with all its charm. The overall story is rather simple, but its unique cast of characters and of course the lovable Baymax is what makes the movie an enjoyable experience. Nothing too memorable, but a step in the right direction for future Pixar movies.",
      "total_reactions": 1,
      "user": "BlackswordSteve"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Sin duda este es el resultado más preciso de fusionar Disney con Marvel, adecuado para los más pequeños sin duda, pero en el proceso no arropa al adulto, no es de extrañar si llegas a contar los minutos para que termine el show.",
      "total_reactions": 1,
      "user": "chepod8"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This instantly became one of my favorite animated movies, that could stand beside movies like the incredibles.  The main story and characters are very well thought out and brings some strong funny moments along with emotional parts.  I had to watch this with my kids, but I am going to buy it for my personal collection too.",
      "total_reactions": 1,
      "user": "mijxero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Team up Iron man with dexter (animated not live action), a zealot from starcraft, the flash if he were from tron, and a mix of frozone with poison ivy pitted against a villain that makes Doc Oc look like calamari  and you may just come close to how amazing this film was. Geeky references aside, this movie is a gem. I was engaged the entire way through and loved every minute. It personally felt as a scooby-doo meets the justice league, which sounds strange at first until you see it in action. Each character has an actual character outside of being the person with the powers, which I found shocked by since they establish it in a very fluid way in a short amount of time. The main character shows quite the development over the course of the movie, even lashing out at the person who caused him his grief, leading to some very troubling choices. I'm just going to cut myself off before I tempt giving spoilers. Just watch it!",
      "total_reactions": 1,
      "user": "TheTwistedKris"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Big Hero 6 es una película película de animación que resulta ser carismática, entretenida y con un personaje principal bastante gracioso y divertido.",
      "total_reactions": 1,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Yet another very welcome surprise this new product Disney.",
      "total_reactions": 1,
      "user": "JekSpacey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Big Hero 6 contains everything to be an enjoyable movie, from the solid voice acting to a lovely fat robot, except for the disappointing story that does not really hold up to its hype until the end.",
      "total_reactions": 2,
      "user": "Tomle1202"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Before watching this film: I'm not aware of the source material for this film.",
      "total_reactions": 2,
      "user": "43in2014"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Big Hero 6 is Disney’s latest magical animated adventure for the children of today, or those who are kids at heart. The story takes place in the future following Hiro, a robotics prodigy in the city of San Fransokyo as he goes about his life with his older brother Tadashi and their group of friends. This time around the ultimate disney hero is provided for those who enjoy the cute and squishy, the ever so huggable and inflatable medical robot Tadashi created named Baymax. The very image of Baymax in some of the trailers probably drew in the entire population of those under the age of 8. There are some dark events that leads everyone to come together as a team and essentially be a Disney movie, but all in all, as with How to Train Your Dragon 2. Disney has created another great animated action comedy that will bring a smile to pretty much anyone's face. Unless you work in a puppy mill, then you just shouldn’t be smiling.",
      "total_reactions": 1,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Big Hero 6 is a great little action movie with fun one liners for adults and kids. The animation is great, and the thought that has gone into the setting is good too. The part where it falls is that it is predictable. If you have a brain, you can see where it is about to go. But still a great movie for a chilled movie night.",
      "total_reactions": 1,
      "user": "BigGuyChris"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "4/5★ Big Hero 6",
      "total_reactions": 1,
      "user": "reellm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "The best way to describe Big Hero 6 is if The Incredibles, Iron Giant, Avengers and Terminator 2 all came together into one. In other words this is a pretty good movie. However it is Baymax that carries the movie on his robotic shoulders.",
      "total_reactions": 1,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "This movie is decent, I suppose. The animation's great, but the movie's SO cliched. It's just a compilation of superhero movie cliches-uck. I think that the atmosphere of the movie was nice, though, and the mash up of Tokyo and San Francisco as its setting is really cool. The only thing I actually really enjoyed was Baymax. The movie was funny in some parts, and Baymax is a pretty interesting and creative character. However, if Baymax didn't exist, this movie would be pretty bad. 2.5-3 stars bad. I'd say if you have kids, this wouldn't be THAT much torture to watch. It isn't a bad movie, but it isn't very good by Disney standards either. If you REALLY want to watch it, knock yourself out, but if you aren't really sure or you don't think that you'll be very interested in the movie, save the money for another one.",
      "total_reactions": 1,
      "user": "The-Fox"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "A fairly enjoyable, but VERY predictable film. Am I the only who feels that this one felt more like tribute to superhero films? Baymax is lovable and the main character was well made, but it suffers from plot points that Disney has literally done a thousand times in there films. Aside from a predictable plot, this is a fun, family friendly film with good characters, and beautiful animation.",
      "total_reactions": 1,
      "user": "KENXAVI"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The new Disney film, not being a brilliant animated masterpiece, is fun and entertaining. It has some nice jokes and the robot character is just very funny and awesome, having you liking him very much and laughing every time he is on screen. Kids will love this movie from the beginning to the end, and all the adults will enjoy it.",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie needs a higher score. This movie is so awesome. I really like the element of losing someone is the movie. And in the end when Hero and his robot went in the portal- IT WAS SO EPIC !",
      "total_reactions": 1,
      "user": "idanidan123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Starts out promisingly, and there are some really funny moments once the Baymax is introduced, but the for me the film lost it's way a bit in the final third. By the end of it, the schmaltz strangled all of the humour and charm.",
      "total_reactions": 0,
      "user": "bobbsyw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Disney has followed up Frozen with another amazing film. On paper Big Hero 6 may seem like an Iron Giant or Terminator: 2 Judgement Day ripoff and while there are similarities and clichés throughout the film the main characters their relationship with each other along with the story are well realized in a way that makes it easy to overlook those details. Big Hero 6 is a great film that provides Marvel fans, Disney fans, and movie fans in general with a great experience rivaling that of a Pixar film. The supporting characters could use some development but with any luck this film will get a sequel that will explore them even more. Until then I will continue to watch this film as I eagerly await the next Disney film as this studio has regained the magic they had in the 90s. Hopefully Pixar can pick up the slack with Inside Out but regardless its glad to know there is animation studio on top of their game again! There is a short at the beginning of the film called Feast its not the best short ever made lacking the awe of Paperman but it is charming. Just realized this year there are three animated films that I loved, which makes this one of the best years for animation ever.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I'm in the midst of seeing all of the films that were nominated for Academy Award Best Picture. Big Hero 6 won as Best Animated Feature Film, and the other films nominated in this category were The Tale of Princess Kaguya, The Boxtrolls, How to Train Your Dragon 2, and Song of the Sea. The only other one I've watched so far in Tale of Princess Kaguya, which I absolutely loved.",
      "total_reactions": 0,
      "user": "rpm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "A young boy teams up with a cute inflatable robot and a group of friends to form a band of super heroes out to avenge his brothers death. Clever, funny with great characterisation and an interesting story, this is the Disney cartoon for all young geeks who can't relate to typical Disney heroes. Great fun and shows Disney back on top form",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "With great animation, effects, and acting, this film was a lot of fun to watch and was extremely entertaining. Our humanity was captured, not only in the animated acting, but also displayed in the motivations of both the hero and the villain.  Disney has taken an irrelevant team, and given them new life, busting eight (8) super big blocks.",
      "total_reactions": 0,
      "user": "Pontificator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Gorgeously animated as per Disney's excellent standard, but surprisingly sporting a predictable superhero origin plot. The inclusion of Baxmax, one of the most endearing Disney creation in years, is a highlight. He provides both the comedy relief and the heart of the film. Kids will love this and this is another home run for Disney.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "It felt like Disney bought Marvel because they couldn't make a story about heroes for boys. They said so themselves. This movie doesn't try to be original, it is trying to capture the essence of the traditional \"hero\" story and frame it for a modern audience. It is trying to be family friendly and entertain the whole family with varied cast of characters that should give everyone someone to relate to... while poking some fun at itself and the hero genre.",
      "total_reactions": 0,
      "user": "DeonCadme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Loved the trailer and couldn't wait to see the movie and it totally lived up to the hype. Good story, Humorous, and looks great. Easily the best animated film of the year and can't wait for a sequel.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Big Hero 6 is an animated movie that is enjoyable for both older kids as well as adults. The animation is clean and very aesthetically pleasing.  The plot is a bit predictable but still enjoyable. The highlight of the film is Baxmax, a robot designed to be a medical helper. Almost all of the humor is derived from this marshmallow like robot. The background characters have distinct visual elements, but really no character development at all. Still I enjoyed the movie and it is worth checking out through your local library.",
      "total_reactions": 0,
      "user": "dc127"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "This is one of the first animated films I have actually recommended to many people to watch after I saw it. The humor appeals both to adults and children and the action sequences are very well done. It also knows how to be serious when it needs to and appeals to the viewer's emotions quite well. It's definitely worth the watch no matter what age you are.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Disney animation finds another winner in \"Big Hero 6,\" a visually ornate ride from start to finish that doesn't seem to lack in humor or emotional depth.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "I think Big Hero 6's main issue is how caught it is with it's incredibly humble premise, that it forgets to set up the world it's created in. This is all very fast moving, even for a kid's film and whilst it is admirably decently animated, Big Hero 6 doesn't create too much depth as to what it is trying to achieve. A generator of sympathy, meaning the bad guy is essentially non threatening at all. It's also a shame that genuinely quirky and interesting characters like Wasabi and Freddie didn't get a whole opportunity to explore their potential as much as they should've, giving warm and relieving addition to their futuristic suits. This being said, Big Hero 6 is solid to entertain, the chemistry between Baymax and Hiro is humble and charming and will please as a family movie. Just don't expect anything too meaningful, it often gets too caught up in sad moments that it forgets the environment it is set in isn't that harmful at all.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Was brilliant,the amount of action ,suspense and plot twists is superb.Really worth a watch,those negative reviews of this movie are bizarre because this movie is out of this world!",
      "total_reactions": 0,
      "user": "Twist_Of_Fate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "An entertaining first entry from the hybrid of Marvel and Disney with a lot of hearts and a lot of thrills albeit with a few flaws that is outshone by its many excellence.",
      "total_reactions": 0,
      "user": "alllifeinfate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "It's like Disney to make a visually breathtaking movie. Though the robot-human concept is starting to grow a little-bit stale on me, the show had plenty of laughs, action, drama, and heart to make up for that. It's a fun-filled superhero ride for kids and even for the parents. Even if the story is almost archetypal, it adds to the impressive  catalogue of Disney Animation.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "I'm telling you, Walt Disney Animation Studios seems to be in a groove where they can do no wrong. \"Wreck-It Ralph\" proved that you can make a film centered around video games and make it amazing, while \"Frozen\" became a worldwide cultural phenomenon for a number of reasons. Now we have \"Big Hero 6,\" which shows us that, in an industry dominated by superhero films from Marvel and DC, animated superhero films can succeed in theaters. \"Big Hero 6\" is beautifully-animated, well-written, action-packed, hilarious, heartwarming, and it features some tremendous and memorable characters. There's no two ways about it, \"Big Hero 6\" is an excellent animated film that everyone should watch.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Disney's 'Big Hero 6' is heaps of fun. I simply loved everything about it... And now I definitely know what I'll be dressing up as for next Halloween!",
      "total_reactions": 0,
      "user": "kasperlovborg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "From the creators of 'Frozen' and directors Don Hall ('Winnie the pooh')  Chris Williams ('Bolt') comes their astonishing achievement big hero six. This movie has beautiful stunning effects also a great voice performance cast, Ryan Potter as Hiro Daniel Henney as Hiro's big brother and Maya Rudolph as Aunt Cass. The cast is phenomenal! even though i hate kid's humor in animation films, this movie gave me a ton of laughs and some Lol moments. The best part of this movie is Bay max (who perfectly marvelously done) the actor behind Bay max who is voiced by Scott Adsit who is brilliant in this movie. he should win best actor for an oscar nominee. Even though the plot is cliche'd and TJ Miller tries to be funny but he's not funny at all, The effects are wondrously done, the direction from Williams and Hall are outstanding. Grade A+ one of 2014's best films of the year!",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "After being a little disappointed in Frozen, I was glad that Disney was able to recover themselves with Big Hero 6. This film is very beautifully animated and has a very entertaining story surrounding. I like how this film felt kind of like a mesh between Marvel and Disney films and it worked remarkably well. I love the whole city, San Fransokyo, since it combines both San Francisco with Tokyo; it worked as a very cool environment for the film. The characters were a fun bunch, I especially liked Baymax, he was very funny and he is one of the biggest reasons why this film is excellent. The whole group of scientists, that befriend Hiro, is also a cool group of people. Some of them fall under a few cliches but they are still fun to be around (their whole \"lab\" room was also cool, I liked the inventions they were creating). The story is pretty cool even if it was a bit predictable at times; seriously, don't have your expectations too high for the movie's villain. Despite, some minor problems, this film has a great story, there are even some pretty emotional scenes in this film I must say. This film is great and probably one of Disney's best films in a while. I also wan't to congratulate this film on winning the Oscar for Best Animated Film of 2014, even though I kinda liked The Lego Movie and How to Train Your Dragon 2 a bit better (sorry).",
      "total_reactions": 0,
      "user": "DrewtheDude85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "\"Big Hero 6\" feels ultimately too familiar and watered down, but the brisk computer animation, constant funny gags and high-stake action might win you over.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "The great film, animation is good, the story is cool and different, is not that cliche that has in some films from Disney, the first I found a little weak, but then the film tip far more engaging.",
      "total_reactions": 0,
      "user": "SpiderPlayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "There has been so many superhero movies lately that it seems like I don’t even recall which superhero movie that is not related to Marvel Cinematic Universe nor to DC Cinematic Universe nor to 20th Century Fox’s X-Men Universe. To see another superhero movie that consists of entirely new superheroes and that is not related to either of the three universes is quite refreshing, which is ironic since this movie is actually from an old Marvel comic series.",
      "total_reactions": 0,
      "user": "OpinionatedGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Big Hero 6 is probably one of the better animated films aimed at a younger audience that I have seen in a long time.  It really was a joy to watch and once again it’s a film that where it may have a few hiccups, they don’t bother my enjoyment of the overall film. it's an excellent showcase for the 3D in animation with it's excellent art style and action and with great characters and story it featured i would love to see disney follow it up with a sequel",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I will admit it. At parts this movie made me cry, laugh, and feel for Hiro Hamada. But there was a sort of bad aftertaste to it for me. This mostly consisted of the sometimes cheesy dialogue made by characters, such as Gogo's \"Woman UP!\" during the final fight, or Wasabi's, well, overall dialogue period. I just don't really like Wasabi. Some plot twists were obvious, some plot tools were cheesy, such as when Hiro \"randomly\" decides he needs to upgrade everyone. I did like this a whole lot better than \"Frozen\", though. This movie got my emotions roiling in several spots, and laughing uncontrollably in others. I will say though, the scene where Hiro tells Baymax to destroy Callaghan, was one of the most powerful and shocking scenes in cartoon and possibly superhero movies in general for me. I watch this movie every night when I go to sleep, but I always stay up for that one part. But, besides some cheese, my biggest peeve was the ending. True, I didn't want Baymax to die, but when he did, I really felt that this was a fitting end to Big Hero 6. When it came down to it, that is what Baymax was built for: To Save Lives. So when it was revealed that he was brought back, I was kind of disappointed.",
      "total_reactions": 0,
      "user": "SladeWilson519"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "This movie looks fantastic! It's beautifully designed, rendered and animated with lots of bright colours and fun action. The voice work is first rate and the dialogue is fun. The only problem with this movie is with the story which tends to have too much melodrama.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Big Hero 6 is one of the best Disney animated movies during a decade since The Lion King, Aladdin, Beauty and the Beast, Frozen and Wreck-It Ralph. It has an awesome story, memorable characters including Baymax who is hilarious and it had great musical score by Henry Jackman and one original song Immortals composed and performed by Fall Out Boy was very good. It had impressive animation, creativity and stunning visuals, they look better than Frozen and Wreck-It Ralph in my opinion. It had a lot of action, humour and emotion which is a perfect balance for a Disney film. My final score for Big Hero 6, 9.8/10. (Amazing)",
      "total_reactions": 0,
      "user": "Daniel17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "It's an ok movie, but it has a very cliche and predictable story and the interesting characters are put aside, the movie is by no means bad, but it could've delivered a little better. Also I knew who the bad guy befor they even revealed it.",
      "total_reactions": 0,
      "user": "Mediawatcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Disney never fails to create animated movies that are beautiful to watch. In the case of San Fransoyoko, there is no difference.",
      "total_reactions": 0,
      "user": "Kacy00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Okay, It didn't succeed much, but it still is a very good movie with something different this time.  Plus, it was a really unique movie compared to Frozen though...",
      "total_reactions": 0,
      "user": "AGN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "When I started to watch Big Hero 6 I didn't really know what to expect and thought it was going to be a film about a young kid bot fighting from the first scene, although I would not have minded that happening as the bot fighting is pretty good, I had no idea that it spirals into a superhero movie.",
      "total_reactions": 0,
      "user": "boubadiop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "A complete masterpiece! The story is amazing since the begin to the end. No more words, but I felt the villain's story a little weak. I'd like to see the older brother as a villain even if it was a cliche.",
      "total_reactions": 0,
      "user": "Henri123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Big Hero 6 is a well-made superhero animation which tells nothing new nor special. The animation lacks a good screenplay though it is a decent one for teenagers.",
      "total_reactions": 0,
      "user": "Armin_Abbasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "The fast-paced and fun-laced screenplay, and the adorableness of Baymax do not quite succeed in overcoming the hackneyed nature of Disney's Big Hero 6.",
      "total_reactions": 0,
      "user": "Aravindh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Baymax has to be the most adorable and coolest Disney character I've seen in a while.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I went into Big Hero 6 not having a clue what it was about except that it had a balloon robot. Previews made it look dumb, but I was so wrong. I'm so glad I went, because this movie was far beyond my wildest expectations.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "'Big Hero 6' is the latest feature from Walt Disney Animation Studios, who recently brought us 'Tangled' (2010), 'Wreck-It Ralph' (2012) and 'Frozen' (2013). They have been on a winning streak these recent years and are currently in their new \"Renaissance era\".",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "I will have to say this is the best animated movie of the year and deserves that oscar win. Such a great movie mixed into multiple genres like action, adventure, sci-if, with some drama. The character are so likable and Baymax was so cute and reminded me if the minions. It might be predictable, but the fast pacing of the film saves itself. I don't like re-watching movies no matter how good they are, but I can't stop myself from re-watching this. This is SO much better than that frozen crap.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Ignoring early expositional problems, a few plot holes and a lack of unpredictability, Big Hero 6 is a very funny, very charming and very entertaining animation that services its target audience near-perfectly.",
      "total_reactions": 0,
      "user": "EdgarReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Although a lot of themes have been stolen from other movies, the journey was still great fun and I have empathy for these characters. The plot's simple enough for kids over 10 to understand, and it isn't a movie that can only be enjoyed by a certain age group. I recommend it!",
      "total_reactions": 0,
      "user": "Sontate72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "Toy Story, A Bug's Life, Finding Nemo, WALL-E, Up, and Wreck It Ralph, what do they all have in common? They are all masterpieces, and Big Hero 6 is the next big thing, and you know why? It's because Disney incorporated a story from another universe, Marvel, that's right, Big Hero 6 came from Marvel, and that is one of the reasons that makes this film great. The characters make up for the amazing acting and the real emotions coming from them, the animation is so alive and so bright even when the picture is very dark. But the real reason that this film is the next big Disney masterpiece? It's the inspirational messages that the film presents, and in this film the message falls under the lines of vengeance does not become received by revenge, and learning to let go is a hard thing but to some people, it a natural instinct, and wherever you go, take some friends with you, because you could be something bigger and stronger when you have help, sure in the end some people don't make it but that right there is the message, staying strong in the face of challenges, that's what makes Big Hero 6 a masterpiece.",
      "total_reactions": 0,
      "user": "Th3GreenHorne7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "What can I say? Absolutely brilliant and fantastic are some adjectives. This movie was completely amazing. Do not listen to anybody who tells you about plot holes and clichés, they are way too focused on looking for mistakes than just relaxing and enjoying the movie. And what a movie it was. If you haven't seen it, I strongly advise you to watch it. RIGHT NOW. The most phenomenal movie I have ever had the joy to witness. Here are a few reasons why:",
      "total_reactions": 0,
      "user": "Noo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Big Hero 6 , has good fascination and great affirmative , for the good script , the incredible combination of Tokyo and San Francisco , to create the incredible and fictitious San Fransokyo , but also the great adventure of 5 young common robot and a nurse who became in big heroes.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "This is a very smart and funny movie for kids as well as adults. We don't have kids and we have watched it twice already. The show takes place in a fictional city that is supposed to represent a cross between San Francisco and Tokyo. The highlight of the film is the character of Baymax, an inflatable doctor and friend, who turns out to be a hero.",
      "total_reactions": 0,
      "user": "Slugone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "After the Academy's ludicrous mistake of failing to nominate \"The Lego Movie\" for Best Animated Feature, I was rooting for this to win (which, thankfully it did). It is yet another example of how an obscure comic can be transformed into a really good movie. Baymax was a really good character and probably one of the most adorable robots in film. Hiro was a good character too because he was pretty complex. One of my favourite scenes was the one where Baymax is low on battery and he starts acting all drunk (but I feel they missed an opportunity to have him start singing \"Daisy Bell\" like HAL from \"2001:a space odyssey\")  it's a very good movie, highly recommended to both superhero fans and Disney fans.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Big Hero made me feel like a little kid again. I truly enjoyed watching the movie. Definitely worth watching because it also offers good lessons.",
      "total_reactions": 0,
      "user": "james417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Probably my favorite animated film to date. Very entertaining and good story.",
      "total_reactions": 0,
      "user": "jigsmode31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "When I saw that many people commented on Big Hero 6 i decided to check it to see if it was true that many said, is a teacher and works almost are right ... but unfortunately it is not. It seems that many people liked the film because they saw it as an original idea, I do not know but for me The Lego Movie is a great original idea, but this not. Bone is not bad, the only thing I am against is that Disney continues to use the cliche to Kill the parents of the protagonist and the character you loved you so much, it's something that we have seen in many Disney movies and I still do not understand why still do, maybe is its a formula of making movies or maybe is a betrayal of the studio, do not know. If they wanted to kill as Tadashi do it but at least let their parents are alive, not make them disappear from the film and say they are dead without explaining how they died. I also found it absurd that the reason for why is Callaghan the bad guy and the Baymax sacrifice, i know many people cry but I'm sorry, I'm think it's really silly and absurd, but the film is really bad? no, it could have been better? probably yes. There are many things that they liked me the film, I like animation, the characters, the comedy, the action scenes, the city San Fransokyo, the tecnology, the friendly relationship of Hiro and Baymax and the message. I just do like Minions as if it werent these 2 problems the film could have been better. In my opinion, Big Hero 6 is entertaining, Not the best of the year but is entertaining. I do not think That was really deserves an Oscar for This Film.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "It was a great movie but not the best. Its graphics was quite good and I love the city in the movie. However, I do not like the storyline very much because Hiro's bro should not be died soon.",
      "total_reactions": 0,
      "user": "ChrisAng542"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Big Hero 6 is an enjoyment of 102 minutes of action, sad moments, and watchable moments all in together. It's just better than how they done it with their predecessor.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "If 2004's Disney-Pixar \"The Incredibles\" made a classic not only in animation, otherwise, in superhero movies ever. Then Disney desired to make a new one; heavy but enjoyable, and what we had here was \"Big Hero 6\". The adventure of six friends that begins à là \"Iron Man\" creating its own powers and defeating a bad guy. The problem here was the simplicity of the plot, there's not so much in the argument, but what shines here, besides the values, is the adorable-fatty Baymax. {the film} will make you laugh, think, and stay positive and when you'll have left the theater, then you'll also have gone satisfied saying it was pretty well, but not more than that (72%)",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Big hero 6 is a huge hit as we are giving a emotional, and funny story. The best thing about this movie is the relationship between hiro and bamax, who become closer throughout the events that happen in the film.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "Big Hero 6 is full of action, color, real-science and intelligent story-telling for put the audience in shock and in love with unforgettable characters and a pretty story. Disney has a new fantastic classic animated film, officially.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "This movie is a wonderful action-adventure story following our hero conventionally named-Hiro (pronounced as hero) in his journey to solve a tragic mystery following his escape from bot-fighting. An illegal sport that his brother didn't support although Hiro was pretty good at he saw more in Hiro's inteligence so Tadashi takes him to his school and orginal Hiro as a typical teenager at the age of 14 doesn't like the idea he thinks the school is for nerds but when he arrives he is completely blown away by the technology and students who go there much like how I was. The cast-Go Go Tomago, Wasabi, Honey Lemon and Fred are all really different people who have an interests in technology Go Go is a bit more pessimistic and say emo she has a interest in speed. Wasabi is interested in science and takes it more seriously he has an interests in lasers, energy and plasma. Honey Lemon is a very friendly and tall girl who likes color and materials that can freeze solid into color and Fred well he's just Fred he likes comics, fictional fire-breathing animals and superhero stories. Than they have a professor Callaghan who is sought to be smart and cunning and shares a rivalry with his brother Krei they also meet Baymax later in the story when Hiro accidentally summons him and leads him on a journey these characters interact with each other in different ways some good some are bad others are falsely-accused  everything is going well until Hiro's brother Tadashi dies in an unexpected incident after a tech show cast. Than Hiro goes on the hunt for the suspect with his newly acquired friends they will fight many battles together and the movie does have some positive messages and is one of the most inspiring and greatest movies I have ever watched. The animation looks good to me and little details like the way Wasabi cuts a hole in a wall and they way the microbots move together in a scary fashion sure is bound to give to some dramatic as well as humorous situations that occur in the movie. The voice acting is so well done it feels like I am watching an actual conversation between unlikely or completely likely friends as well as they plot which made sense and gave way to an epic struggle of good vs evil. It is one of the best films I have ever watched and with the int resting lore and characters with their amazing gear created for their liking I am ready for a sequel as to me this series seems to good to be a one-hit wonder and I certainly hope it will stick to it's original comics.",
      "total_reactions": 0,
      "user": "MercenaryofHate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "The Disney film “Big Hero 6” was a huge hit in the box office. The beautifully made animation was the best of any animation seen so far. Spectators of the film wouldn’t suspect a fourteen year old boy genius to get into college at such a young age; the boy had proved to show great intelligence throughout the movie. Many people fear the development of A.I. and this movie puts that thought into a different perspective. MIT’s article on A.I. titled “Our Fear of Artificial Intelligence” reflects people’s fear of A.I. which is the opposite of what “Big Hero 6” stands for. They say that “A true A.I. might ruin the world- but that assumes that it is even possible” (Ford). This article not only explores the dangers of A.I.,  but it also explores the benefits. One of the benefits could be that “A benevolent superintelligence might analyze the human genetic code at great speed and unlock the secret to eternal youth. At the very least, it might know how to fix your back” (Ford). This makes Big Hero a timely film due to the fact that it explores the capabilities of Artificial Intelligence at a much more innocent level, than what could happen if someone were to go too far with A.I. Overall our group does endorse the message Big Hero 6 brings up following the lines of Artificial Intelligence, however it still needs to be kept in mind that Artificial Intelligence is dangerous.",
      "total_reactions": 0,
      "user": "hsoney"
    }
  ]
}