{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Big Miracle",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Big Miracle is a family movie fitted with the usual appeals to multiple audiences, and though tots, teens and younger parents might find the action a little slow until the rescue pressure builds, the grandparents will enjoy it as a trip down media memory lane."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "It's an exciting, charming and often quite funny family film."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "It's a screwball comedy, with a possible debt to Preston Sturges's 1942 film, \"The Miracle of Morgan Creek,\" a movie inspired by the Dionne quintuplets, and similarly set in a small town turned upside down by media and political showboating."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Big Miracle is not the most sophisticated adventure film, but compared with most family movies, it's practically something out of Noel Coward."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Big Miracle tells its sort-of-true version of events in a democratic and humane fashion, by way of a rangy, lively group of competing interests who actually do on occasion act like real people."
    },
    {
      "critic": "Janice Page",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "It needs only to entertain. And that it does thoroughly, leaving us both charmed and enriched without feeling very preached at. Praise be."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Big Miracle even throws in an unexpected bonus, a surprise last-minute cameo that is funny without being the slightest bit mean, just like the rest of this hugely likable movie."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Rounded, redemptive and refreshingly free of cynicism."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Kwapis fills small roles with great character actors like Stephen Root, Andrew Daly, Kathy Baker, Tim Blake Nelson, John Michael Higgins, Rob Riggle, and James LeGros, all skilled at making a lot out of a little."
    },
    {
      "critic": "Rachel Saltz",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Big Miracle gets off to a shaky start, but once revved up, it becomes an involving work-against-the-clock-and-the-odds action movie."
    },
    {
      "critic": null,
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "There may be no role Barrymore is better suited to than that of sanctimonious environmentalist."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "This family-friendly outing captures the story's human snowball effect with a measure of sly, satirical wit, if also an excess of boilerplate subplots and jokey '80s details."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "It's the affable cast, headed by Drew Barrymore and John Krasinski, that really makes the picture so widely accessible."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 67,
      "summary": "Big Miracle is all formula, but with just enough savvy to temper the gentle-spiritedness and qualify it as that rare family film with an emotional manipulativeness that doesn't leave a sick slick in the mouth."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 65,
      "summary": "But there's so much going on in Big Miracle that the biggest miracle of all – the whales at the center of the story, get lost amid all the criss-crossing love stories, political wheeler-dealing and well-intentioned but inadequate rescue missions."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "What Kwapis does do, however, is nicely handle the film's whale of an emotional payoff."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "As the minutes tick down, the sentimentality picks up. But chalk that up to the enigmatic creatures, which grab hold of human hearts no matter one's politics or affiliations. Whales just have a way of bringing people together."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Inspiring, real and heartwarming, Big Miracle is something of a miracle itself - a family film everyone in the family can love that doesn't talk down to its audience and makes more salient political points than \"Free Willy\" or \"Dolphin Tale.\""
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "The genuinely sweet nature of this sometimes clunky movie is mixed with a little sass, and wins you over."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 58,
      "summary": "Big Miracle is harmless enough, but what's annoying about it is its aura of fake activism. The movie doesn't seem to get that it's exactly when the news media began to devote more time to subjects like whales that it started to turn into news not for activists but for couch potatoes."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "The film bulldozes any genuine nuance or insight or even emotion in exchange for ready-made plot points and by-the-numbers catharsis."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "It's certainly a worthy saga. But given the abundance of one-dimensional human portrayals, it becomes apparent that a documentary on the subject might have been more powerful."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "There are too many convenient romances, trumped-up crises and reversals of conscience to clear up while those poor whales suffer. Big Miracle isn't an entirely bad movie but a wholly misguided one."
    },
    {
      "critic": "Andy Klein",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 42,
      "summary": "Stephen Root, Ted Danson, Dermot Mulroney, and other familiar faces lend their support, but it's not enough to overcome the limp, by-the-numbers execution. The film comprises innumerable expository scenes, leavened with uninspired comic relief."
    },
    {
      "critic": "Matt Singer",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "You'd have to possess a heart colder than the Northern tundra not to care about these poor animals working their flukes off to jerk audience tears, but emotional manipulation or not, this is still a movie about people standing around a hole waiting for something to happen."
    },
    {
      "critic": "Olly Richards",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "This true-life tale takes some believing in the era of global warming (too much ice? Really?) but the sledgehammer emoting should let you know you're in a family drama."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "While rooting for the marine mammals (and wishing for more footage of them - and even of their animatronic incarnations), your heart will also go out to the cast, stuck even more pitiably in syrupy manufactured crises."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 12,
      "summary": "Any goodwill it boasts is terminally suppressed, buried beneath a layer of bullshit as thick as blubber."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Wow an awesome sorprise, Big Miracle for me is like The Big Year but better, the cast is awesome, Kristen Bell, Drew, John, wow are great. A good and emotive film.",
      "total_reactions": 4,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Not \"Gone With The Wind,\" but an entirely likable film without robots, aliens, explosions, sex or violence.  Solid, simple story.  Krasinski is glib and funny and utterly without affectation.  Nice performances by some of the smaller players as well.  If Hollywood made more movies like this the world would be a better place....",
      "total_reactions": 3,
      "user": "overeasy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Definitely worth my time, much better than the standard trash that is becoming popular movies, I'm not going to say it was a great movie, but it was sure worth it.",
      "total_reactions": 1,
      "user": "hootis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Big Miracle, a family-friendly docudrama by means similar to that of last years Dolphin Tale, is pretty standard family fare. It doesn't have a storyline moved along by its characters (who are quite absent here, however many there are) but by an atmosphere of straightforward morals and warm, good will. There are actually a few surprising moments to be had here, which elevate the picture above the norm. It does step into reaching territory and Drew Barrymore's character comes off as irritating, but John Krasinski delivers a more comic, relaxed performance that adds to the genuine likability of the film. For families searching for harmless feel good fare, look no further.",
      "total_reactions": 1,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "It was a generally pleasant film, but it really felt more like a TV docudrama than a film for the big screen.  Also, stereotypical characters abound--the gruff soldier, the profit-driven oil man, and the bleeding heart Greenpeacenik...the characters were pretty flat and predictable.",
      "total_reactions": 3,
      "user": "atomx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "Big Year, just like Dolphin Tale, has its flaws but can be mildly fun to watch. even if the pacing and characterization are somewhat lacking.",
      "total_reactions": 2,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "This is a movie that everybody should watch. The more \"loony\", \"tree-hugging\", \"bleeding-heart\" \"hippies\" in the world, the better. The only kind of person who could dislike this movie is the insufferable cynic.",
      "total_reactions": 3,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Dolphins are whales, small whales, cetaceans not in the humpback sense, but cetaceans nonetheless. As a result, this consanguinity makes The Cove worth denoting, since what it shares with Big Miracle, is the notion of western imperialism being inconvenienced on a foreign culture. Far from the Grand Guignol spectacle of the dolphin slaughter, however, which takes place annually in Taiji, a small Japanese town, infamous for its dependence on a psychotic fishing industry(in this case, western imperialism is a good thing), Big Miracle opens with a scene where we see Inuit Eskimos on a whale hunt, which otherwise wouldn't be disturbing in a context where the narration privileges the native. But this isn't The Fast Runner, the 2001 film that showed the Inuit culture on its own terms, a culture that, as just mentioned, includes whale hunting, as seen in the film's ethnographic approach. In an early sequence, detailing daily life, an Eskimo prepares the mammal flesh with a sharpened stone. But it's okay. The audience realizes that the harsh living conditions would bring about a need for these isolated people to eat whale meat, whereas Big Miracle saddles us with a dialectic relationship between industrial and non-industrial cultures, since Rachel, whose Greenpeace activism imposes her values over indigenous ones, lumps industry and sustenance together as being one and the same, thereby associating the Inuit people with the Japanese, even though survival, and not profit, is their motivation for the killings. The message being: conform with the mainstream view on whale hunting, or be vilified. She places a higher value on animals over people. But what are these Eskimos supposed to eat? Ice? Without needing to dramatize the point, it's reasonable to assume that Rachel would protest all potential animals native to the Arctic Circle being converted into meat. At a council meeting, where the fate of the whales is already decided, Malik arrives late, just in time to overturn the tribe's decision to feed their people, because the elder statesman doesn't want the bad publicity of whale blood spilling before the media cameras. But in a filmic sense, the moment symbolizes the Hollywoodization of the Inuits, in which Malik compromises his people's cultural norms by grafting a westerner's sense of morality towards aquatic wildlife. The Eskimo is remade in our own likeness, and has little connection to his real-life counterparts in The Fast Runner, where the indigenous Alaskans are less relatable. Big Miracle gives us the false impression that the decision to save the whales was a multi-cultural one, perpetuated by outsiders but agreed upon via the Inuit people's own volition, when in fact, these powerless natives were probably victims of strong-arm tactics orchestrated by the Greenpeace contingent, who ran interference on their way of life, ramming its animal rights activism down their primeval throats. The filmmaker, counting on our built-in sympathy for the large mammals, and counting right, has in Rachel, a benevolent protagonist, since moviegoers, American ones, share her value system, so as a result, the whale advocate's hubris goes unnoticed. To further obscure her pomposity, Big Miracle ensures us that the exploitation is coming from both sides. While Greenpeace threatens to expose these natives as murderers, the Inuit Eskimos keep pace with the westerners where the matter of ambition is concerned, thus matching the careerism of the television journalist by being capitalists, as brazen as can be. Overrun with tourists on media-related business, the desk clerk at a crowded Barrow inn has the temerity to charge Jill a room with an exorbitant price, knowing that the diva would be incapable of hacking the Arctic chill from the backseat of her car. Later, the tribal elder's son, already indoctrinated in western ways through popular culture(via cassette tapes, most notably, Guns 'n' Roses' Appetite for Destruction, a commentary on Barrow's big oil presence), also gets the better of Jill when he sells the reporter a piece of cardboard to guard her knees against ice at the whale viewing site for fifty dollars. It's crucial to the film's success that the Inuits are never portrayed as victims, but rather, formidable opponents to these interlopers, especially since the film posits Rachel as an uncomplicated heroine, when the truth of the matter is that she's stealing people's food, through the casual disregarding of Inuit traditions. Yes, save the orca in Free Willy, knowing what we know about marine parks such as Sea World and other oceanariums, complicit all, in the dolphin massacres, as seen in The Cove. When Jessie vandalizes the show tank holding the killer whale with graffiti, his criminality, in retrospect, plays now like naive activism. Arguably, the whales in Big Miracle should be food. So how does one go about preparing whale, exactly? It's none of our business.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "I am SO HAPPY that this flopped. John Krasinski can't act and Drew Barrymore is more annoying than ever. It's been out two weeks and has only grossed $13.2 million against a budget over 40 million dollars.",
      "total_reactions": 2,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "This film is utterly unsatisfying.",
      "total_reactions": 4,
      "user": "HDeezy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "A truly delightful family film based on a true and heartwarming story, brought with lots of humour based on the very likable characters portrayed by Krasinski and Barrymore both oozing screen charisma.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Big Miracle uses real-life events as the basis for a surprisingly satisfying family drama. Not half-bad for what appears to be a kid's movie.",
      "total_reactions": 0,
      "user": "Geniasis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "I loved this movie. It was great, touching and perfect. The cast was awesome, the story amazing, the characters memorable... it never took parts, I mean Greenpeace wasn't always looked in a positive way, the movie clearly shows you some flaws of the organisation. But it focuses on what it should: helping the wales. There is no 'bad guy', no 'perfect hero'. It's just people with their qualities and their defects, putting all of their effort into saving the poor creatures. It has a great message for the kids (but also for the adults). It's like a good version of Free Willy. It takes it's audience seriously, and it tells it's story really really well.",
      "total_reactions": 0,
      "user": "klara"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "This is an awesome up lifting family movie! It does the true story justice and you become attached to those whales. You are cheering for them to be freed the entire time. This isn't movie of the year but it does the job it was created to do! If you like animals and family friendly movies this movie is for you.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Big Miracle, beyond its bland, nondescript title, delivers exactly what the coming attraction promised, an enjoyable save-the-whales\" tale.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}