{
  "mc_avg_user_score": 3.9,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Black Rock",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 1,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "This indie, female-centric riff on “Deliverance” is spare, smartly written and shot through with moments of twig-snapping tension."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 75,
      "summary": "Layered conflicts mount as this lean film treks on, and they're not limited to gender politics."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Black Rock never reinvents the rules, but it understands them just well enough to make its bloodless stabs at ingenuity stand out."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 70,
      "summary": "Working from a ruthlessly efficient script by husband Mark Duplass, Aselton effortlessly sets up the women’s reunion scenario before effectively flipping the action from drama to thriller."
    },
    {
      "critic": "James Rocchi",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 67,
      "summary": "Black Rock isn't going to become the sort of classic that \"Deliverance\" was, but if you like your scares smart, and like them to happen to people you actually care about, then Aselton's island of friendship and fury is a nice place to visit."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 63,
      "summary": "It's quite thin, but at least Black Rock plays its \"kills\" for more than stupid gamer's diversions."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The male characters here are too thinly developed for this to be a top-notch survival thriller, but Ms. Aselton knows how to get the pulse pounding."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "The story and its violence are deeply silly, but there's something nervy and upsetting that distinguishes the film's incidental excitement."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "Ultimately, it’s hard to shake the sense that her picture is a character study bending itself, painfully and unnaturally, into the shape of a nightmare-in-the-boonies horror flick. Is this the only way films about female friendship can get greenlighted these days—by drenching themselves in genre tropes?"
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Aselton is clearly trying to broaden her reach as both actress and director beyond the rumpled indie comedy of \"The Freebie,\" her directing debut, and the concept is there, but a movie like this needs a much more polished execution that Black Rock gets."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "[Aselton's] disregard for her male characters causes Black Rock to spiral into dudette \"Deliverance.\""
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s all a fair attempt, but Aselton isn’t going to make anyone forget Kathryn Bigelow."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The dialogue is particularly bad, which is odd because the Duplass crowd typically excels at natural-sounding dialogue."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "A soundtrack of churning rock songs by the Kills is as close as this misfire gets to authentic grrrl power, borrowed as it is."
    },
    {
      "critic": "Rob Nelson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "Straining to be a distaff “Deliverance,” indie thriller Black Rock is unable to shock, much less convince."
    },
    {
      "critic": "Aaron Peck",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 30,
      "summary": "The screenplay is far too obsessed with the setup, and not at all concerned with making the villains even the least bit believable or scary."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "Despite the sight of so much cheesecake romping naked through the woods like the girls have never heard of poison ivy, it’s the usual disreputable grindhouse schlock."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "Rock is a poorly written and ineptly directed genre piece that lacks tension, suspense, fear, all those things that make’ a “thriller” thrilling."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "Black Rock is as dingy and dirty as the genre thrillers it appears to want to one-up. All it does, though, is bring everyone down."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "A laughable feminist version of Deliverance (1972). The script is so cliché ridden to the max (I wonder if they used copy-paste from a few other movie script...). The male characters are all cardboard hillbilly rapists, the three women are old childhood friend who reunite during a trip, and settle their past issues. Situation goes bad as the male characters try to rape, torture and murder these three (I guess that is their weekend hobby). They try to escape while their lives and friendships are turned on their head ....Sounds boring right? Well it is. We have already see this scenario a trillion times before. This movie offers nothing new, and I believe it is very insulting towards male audiences (I guess the director lady is pro man-hater of some sort...). See something else if you can! Boring cat and mouse \"drama\". Not recommended.",
      "total_reactions": 2,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "We know from past experience that the bad days outnumber the good in places called Black Rock. So it comes as no surprise that things go wrong almost from the get-go in the low-budget indie “Black Rock,” set on a tiny forested island off the coast of Maine. It’s here that three girlhood pals now in their thirties go to unwind  and because two of them fell out over a fella a few years back, this is what you might call a session in survivalist reconciliation. Once on the island the friends go exploring. They turn up three hunters armed with guns. Bad sign. The hunters introduce themselves as gung-ho Army vets. Another bad sign. And did we mention they received dishonorable discharges? Cue the sirens and flashing lights.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Black Rock is one of those rare films that was written by, directed by, and starring the same person. Back in the early days of film, this was common, but today it's rare. While I admire all the work a single person puts into such an effort, the truth is that most of these films turn out to be a little strange, Black Rock is no exception. Three life long best friends decide to reconnect on a weekend retreat, to a small secluded island, where they had a lot of childhood memories. Once there, they run into a pack of hunters. Testosterone and alcohol mix, leading to a vicious assault, leaving one group a member short, and the other group on the run. Katie Aselton is the Writer, Director, & star of this film and while I admire what she put into it, the truth is that it was very predictable and didn't make a whole lot of sense. First of all, these three women, as children were allowed to play on a secluded island in the middle of nowhere, without supervision? It also doesn't make sense that the hunters would be there, when there was seemingly no wildlife, and of course there had to be exactly three of them. Finally, why did three women, spending a weekend alone on a secluded island, bring enough alcohol to fuel a Todd Phillips movie? The whole thing was just a little too weird to be believable, and when you add how predictable this film was, it's just a recipe for disaster. The one thing I liked was the performance of Jay Paulson. He's usually a guy who gets bit parts and guest appearances here and there, but he was very solid and the most believable of the six characters. Aside from that this is a slow, painfully predictable, mess of a film, that really doesn't have a whole lot going for it.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Works great, is an easy and well-directed thriller, of course, is not one of the best of the genre and you can easily find something more interesting and busy, but not even close to being a bad thing.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "This is an interesting film with some very good tension, but some of the dialogue is poor and like a lot of thriller/horror movies some of the scenes just get silly.  To silly to recommend. C",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    }
  ]
}