{
  "avg_user_score": 8.4,
  "metascore": 73,
  "mixed_rating_frequency": 1,
  "movie_name": "Black Cat, White Cat",
  "negative_rating_frequency": 3,
  "positive_rating_frequency": 32,
  "pro_critic_reviews": [],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "It was a weird comedy, one of those rare kind. You won't like it from its very beginning. It took me for nearly 30 minutes to understand the characters and storyline. After that it was non stop adventurous fun ride especially wedding ceremony scenes were extremely amusing. Each character was funny and very unique which made the movie very special. I liked the total scenario, I mean the culture and all as in a movie which generated laughs in us.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "There are tons of hilarious moments that are best seen without being told about in this film. The storyline is very difficult to describe, so you can just watch the film as the plot is easy to follow. The Grga family are hilarious, and there is one scene where a pig licks the paint of a car off, for no particular reason! This film is a one of a kind masterpiece, as long as you're okay with a Bulgarian film with English subtitles and tons of bad language. If you're okay with that, then go watch Black Cat White Cat!!",
      "total_reactions": 0,
      "user": "resumegam3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "My second favorite film of all time. It's got great spirit. Sure it has some slapsticky humor, but the characters are great. Zika carries the movie for the most part, but that's okay. Somehow it's flaws actually enhance its enjoy-ability. It's lovable, its cute, it's morally ambiguous, just like -ummm- cats!",
      "total_reactions": 0,
      "user": "Bias"
    }
  ]
}