{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 79,
  "mc_mixed_rating_frequency": 89,
  "mc_movie_name": "Black Swan",
  "mc_negative_rating_frequency": 76,
  "mc_positive_rating_frequency": 871,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kristin Hunt",
      "publication": "Premiere",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 100,
      "summary": "Just like the final performance by its deeply disturbed heroine, Black Swan is perfect."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Artful, epic, operatic even, this thriller set in the world of ballet challenges the viewer with its intelligence and depth and wit."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "This eye-popping, inspired and often-demented (in a good way) cross between \"The Red Shoes\" and \"All About Eve\" channels horror maestros David Cronenberg, Brian De Palma and Dario Argento."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "One of the best movies of the year."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "To induce a state of dread and mesmerize with beauty is a rare, paradoxical achievement."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "This is, no doubt about it, a tour de force, a work that fully lives up to its director's ambitions."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Wild and woolly, the movie is a breathtaking head trip that hails from a long tradition of backstage melodramas: \"42nd Street,\" \"A Star Is Born,\" \"All About Eve,\" and, yes, that kitschy '90s relic, \"Showgirls.\""
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Black Swan is visceral and real even while it's one delirious, phantasmagoric freakout."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 91,
      "summary": "Whether your tastes are delicate or coarse, whether you prefer the ballet or horror movies, there is plenty in the film for you."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 91,
      "summary": "A florid, often lurid, completely enthralling film held in place by a disarming Portman, who rarely leaves the frame."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "It's all or nothing with Black Swan. Either you embrace its headlong descent into madness brought on by the pressures of artistic perfection, compounded by smothering anxiety, or you reject it. It's that simple."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "A wicked, sexy and ultimately devastating study of a young dancer's all-consuming ambition, Black Swan serves as a fascinating complement to Darren Aronofsky's \"The Wrestler,\" trading the grungy world of a broken-down fighter for the more upscale but no less brutal sphere of professional ballet."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 89,
      "summary": "This drama-horror hybrid, set within a New York ballet company, strikes a tone more along the lines of the terrifying hallucinatories of Aronofsky's breakout film, \"Requiem for a Dream,\" revisiting, too, favorite themes of monster mommies and female hysteria."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Black Swan is ridiculously over the top, but in a way that makes it fascinating to watch."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "A near-masterpiece of a film set in the hothouse world of New York ballet."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The look and feel of Black Swan, which captures the essence of a major New York ballet production, is one of Aronofsky's great successes."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Portman's portrait of an artist under siege is unmissable and unforgettable. So is the movie. You won't know what hit you."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "A full-bore melodrama, told with passionate intensity, gloriously and darkly absurd. It centers on a performance by Natalie Portman that is nothing short of heroic."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Is Black Swan high-minded? I'm happy to say: No. It is extremely high-grade hokum, which is to say it offers several different and combustible varieties."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 83,
      "summary": "Lurid and voluptuous pulp fun, with a sensationalistic fairy-tale allure. You can't take it too seriously, but you can't tear your eyes away from it, either."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 80,
      "summary": "An extraordinary, intoxicating movie. Its hard, twisted edges may turn off some, but there's no faulting either Aronofsky's technical mastery or Portman's flawless performance."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Both a baroque thriller set in New York's ballet demimonde and a portrait of artistry as schizoid perfectionism, Darren Aronofsky's new film percolates parallel lines of fine madness-but then, doubling down on duality is this movie's raison d'etre."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "A near-irresistible exercise in bravura absurdity, Darren Aronofsky's Black Swan deserves to become a minor classic of heterosexual camp-at the very least, it's the most risible and riotous backstage movie since \"Showgirls.\""
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Aronofsky isn't loose enough, or canny enough, to be in touch with its camp soul."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "A psychosexual thriller that lures its viewers into a woozy nightmare."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "With Natalie Portman dominating the action and exhibiting a screen maturity not seen from her before, this all-stops-out Grand Guignol melodrama exhibits more than enough blood, sweat and tears (emphasis on the blood) to score nicely beyond the ballet crowd."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Arriving with a savage grace, director Darren Aronofsky's nightmare-come-to-life Black Swan cements his reputation not only as one of the more daring filmmakers of his generation, but also as an actor's director of the first order."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Like all his (Aronofsky) films, it's lurid, visually stimulating, thoughtful, absurd in spots, well-cast and unrelentingly intense."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Black Swan is a stage door melodrama putting new spins on cliches as old as \"All About Eve\" (and maybe Adam). Setting them among ballerinas as opposed to showgirls or movie stars doesn't make them any less familiar."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "It's excessive and psychologically imprecise, coarse where it should be refined and too much like a David Cronenberg horror movie in places where restraint and intellectual rigor are called for."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Audaciously whacked-out and never less than entertaining, Darren Aronofsky's Black Swan mixes a backstage dance drama with a Freudian psychological thriller that's indebted to Roman Polanski's studies of shattered feminine psyches and David Cronenberg's movies about repressed bodies in rebellion."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Some girls fight over men. Ballerinas fight over parts. But the occasional brilliance of Black Swan is that it's a one-way fight. Nina battles herself."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Aronofsky blurs the line between reality and fantasy, turning the film into a gothic horror show that is fascinating and disappointing in equal measure. What's resplendently real, though, is the beauty of Ms. Portman's performance. She makes the whole lurid tale worthwhile."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "The black/white duality isn't terribly interesting, but as in most of Aronofsky's films, an intense horror of the body and its uncontrollability fuels the rhapsodic psychodrama."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 65,
      "summary": "For all its dazzling allure, Darren Aronofsky's Black Swan, a feverishly psycho thriller set in the hermetic world of classical ballet, proves a meaningless exercise in Grand Guignol exhibitionism."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "Me, I'm of two minds about a movie that wants to be a nail-ripping thriller and a statement on an artist's unholy communion with her role. It's reminiscent of older, better movies."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Portman toils slavishly to realize Aronofsky's mad vision. It isn't her fault that, despite Black Swan's visual splendor and bursts of grand guignol excess, this emotionally inert movie never does grow wings."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "This exercise in hysteria is so over the top that you don't know whether to scream or laugh. Despite an emotionally gripping performance by Natalie Portman, it's nothing more than a lavishly staged \"Repulsion\" in toe shoes."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 42,
      "summary": "A love-it-or-hate-it movie. Put me in the (sort of) hate-it column. My slight qualification here is because Darren Aronofsky's movie starring Natalie Portman as an increasingly unhinged ballerina gets points for being unlike anything else that's out there."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Indeed, White Swan/Black Swan dynamics almost work, but the horror-movie nonsense drags everything down the rabbit hole of preposterousness."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Off the dance floor, however, Black Swan is trashy and incoherent. Aronofsky, for all his gifts, is a gaudy maestro, opportunistic and insecure as an artist."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "Not just any kind of trash, it's high-art trash, a kind of \"When Tutu Goes Psycho\" that so prizes hysteria over sanity that it's worth your life to tell when its characters are hallucinating and when they're not."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 9,
      "pos_reactions": 20,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This is one of the best movies made in the past ten years. Its art is mesmerizing. Its entry into the psyche of Portman nearly singularly unique. Its portrayal of the relationships excellent, its moments of tenderness and want, concern and horror, worthy of almost any director. Over the years, we will see this film grow in stature. Its record twelve Broadcast Film Critics Association nominations are no mistake.",
      "total_reactions": 29,
      "user": "immortalwa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This movie is plain brilliant. The stronghold is its script as with all movies, but this one in particular stands out because of its very unique and dynamic development. The storyline is very original and it is putted out in the same way, with a very intriguing and terrifying psychological plot. The concept of madness is its central element, and it is unwrapped is a way that will make you feel it yourself. The horror also takes deep involvement in the telling of this story and it has a huge part on constructing the mind altering movie this is. Over another aspect; the acting is as well excellent, with wonderful performances that have proven to be an essential part of this production with major contributions to the whole feeling of it. Totally amazing, this dark and machiavellian title will challenge your mind as never before and make you experience the psychological evolution through unexpected twists until achieved the utmost insanity seen in this movie.",
      "total_reactions": 2,
      "user": "AoKuroiRaccoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Black Swan is almost as perfect as it's protagonist's final performance. With an incredibly detailed, perfected, yet subtle performance by Natalie Portman - a career best, most certainly - Black Swan manages to keep ones attention fully throughout the length of the film. Not only does Portman shine, but so does the supporting cast, especially Barbara Hershey and Mila Kunis. With many fantastical aspects to the film, it is somewhat confusing and keeps one on the edge of their seat, since we never know what is really happening with Nina (Portman) and her surrounding. The cinematography is beautiful and the editing is done quite superbly. The musical score is very appropriate, with beautiful music by Tchaikovsky, including a techno-redo for a club scene, done by the Chemical Brothers.",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "My favorite movie from 2010. It's beautifully dark and intensely made by Darren Aronofsky, who has kind of a streak with me (my favorite 2008 movie The Wrestler). Natalie Portman's haunting performance is amazing. The whole cast brings their A-game. Mila Kunis (her rival), Vincent Cassel (the creepy director),  and Barbra Hershey (the crazy-ass mother). I know it's not categorized as a horror movie, but it sure feels like it and it's nice to see some recognition from the academy.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "This is a very interesting film. I really like how the whole movie went together. Now the one thing that some viewers might not like about the movie is how sexual the film is. It does play a part in the story. Like the more gritty dirtier version of Swan Lake. The cast is excellent. Natalie Portman is pretty intense and so strict in her life. While you have Mila Kunis who is more bubbly and willing to do anything. Winona Ryder is in the film but seems like she was dying. Couldn't tell if it was her or the character. Vincent Cassel is also pretty good as he pushes Portman's character to be the best. The film really has a dark feel to it showing how the mind can warp reality and take control. If you are not a fan of the theater, when you here Swan Lake, you think boring. But even though this seems like a different movie, it actually has the presence of Swan Lake in the background and it makes it very more interesting to think about.",
      "total_reactions": 1,
      "user": "chelano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "The intensity of this film elevates the artistic portrayal of Swan Lake far beyond what you may expect. Aronofsky enthralls the audience with this mesmerizing piece of art, coupled with Natalie Portman's phenomenal portrait as a troubled young dancer.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Maybe it's the acting, maybe it's the perfect scrip, maybe are the musical numbers that makes this movie a perfect psychological thriller, with a storytelling technique unlike any other.",
      "total_reactions": 1,
      "user": "RamonGuerrero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "\"Black Swan\" is a fearless movie that unveils the psychological horror of perfectionism and observes the deepest, darkest personalities of mankind. All of this is created and formed with Keen, sensitive direction and a frightfully perfect performance from Natalie Portman (as expected, she won a Oscar for her performance). Ultimately, this masterpiece is a beautiful dark twisted movie you must, and will watch.",
      "total_reactions": 15,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "A beautiful, seriously flawed, at times laughable, melodrama. The only suspense, soon disposed of, is whether we are witnessing the descent into madness or a ghost story. Descent into madness it is! Sit back and watch her unravel, or rather metamorphize. Vincent Cassell is out of his depth in a role that requires more than his usual fetid pathological intensity. Natalie is sweet but her ultimate transformation seems like more than she can, or is allowed to, emote. The ultimate problem lies in the often weak direction which seems engrossed in pulp fiction or comic strip camp instead of the exploration of driven ambition.",
      "total_reactions": 6,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "This is one of the worst movies made in the past 10 years.  After all the buzz, my wife and I had hyped up hopes that were dashed halfway through this wannabe psycho-thriller.  It's one of those movies in which, at the end, when you expect to have this \"aha\" moment that gives some measure of clarity or answers ... you see the beginning of the film credits.  We expected a sophisticated, sexy thriller ... we got a goofy movie with a few titillating scenes with Portman squirming on a bed.",
      "total_reactions": 4,
      "user": "DAVID1966"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Surprisingly one dimensional and lacking in heart, especially when compared to Aronofky's The Wrestler from a year ago which I thought was superb. Natalie Portman was good, as was most of the other acting, but the movie as a whole did not make me care at all.",
      "total_reactions": 4,
      "user": "jonh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Way over hyped.",
      "total_reactions": 4,
      "user": "juliet1000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Neither fish nor fowl-\"Black Swan\" neither surprises nor probes the mind of its would-be tragic heroine. The theme of the young femme lost in an exhibitionistic/voyueristic art-world, beset by a husky voiced rival, willing to do everything it takes among the casting couch set - and then some, has been done before and much better. Take it from this man raised in a ballet family, see \"Show Girls\" for the real deal! Ironically, that piece of high-brow trash was the one critics loved to loath - which I take, as here, a mark of the nebbish anti-sexual nerdosity of the average film reviewer. In short, \"Black swan\" is predictable and boring, while \"Show Girls\" still delivers the devilish thrills and erotic chills Swan is wan to do.",
      "total_reactions": 4,
      "user": "Orson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Booooooooooooooooooooooooooooooooo!!! Was I trippin on acid? This movie is a mess!!! a weak storyline, and average acting does not a Oscar make!!! I know some of you fan boys loved to hot **** scene but I though it was a little tasteless.....wait....or did it really happen!!! who knows, who cares! I give this movie 2 thumbs down!!!",
      "total_reactions": 4,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "I had been wary going to see this film after reviewers who I would generally trust had been greatly unimpressed by it, but as a big fan of Requiem for a dream I still had hopes. I had read that as a description of the ballet world it was full of clichÃ©s, but this did not concern me, as it was not intended to be one. What did, was that as a portrayal of anything faintly human, there was nothing but ridiculous pastiches of human beings. The premise of the film is the extreme suffering and destructive forces a person must endure to achieve their artistic goals. While there is truth in the idea that one must suffer for their art, or to excel in anything, this idea is explored in a crude and superficial way. Black Swan trades on a romanticized view of the 'high art' ballet world, and on the idea of the mysterious and mad artist perusing perfection at the expensive of their sanity. This is itself just another clichÃ©, and an approach that makes the most of the cultural myth of the tortured and illusory artist engrossed in an exotic and unhinged life. While this idea may be seductive to some judging from the many favourable reviews, if you are not sucked in by the shallow illusion, all that is left is affected banality. In time I think this film will come to be seen in a less favourable light.",
      "total_reactions": 4,
      "user": "Headrush"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Histrionic and overly-dramatic movie full of smoke and mirrors, with nothing new to reveal. Natalie Portman, a fine actress, is tearful and earnest. Since the film is all from her POV we never know when she's hallucinating. Perhaps the overbearing mother is a total hallucination as well. Perhaps the whole ballet company is a hallucination.",
      "total_reactions": 4,
      "user": "Gabrielle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "To be honest, I was very disappointed by this movie.  When I saw the previews, I really wanted to see it.  It looked like a film that dealt with the trials and tribulations of perfectionism, masochism, and mental illness.  It did deal with all three of those issues but in an extremely slow and unexciting way.  I did not connect with any of the characters and the ending was no surprise.  Because there was no connection made with Natalie Portman's character, I didn't even feel bad for her in the ending.  Honestly, I was just glad the movie was over and was grabbing my coat the second she made the jump.",
      "total_reactions": 4,
      "user": "nutmeg_80"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "i dont understand why natalie portman is getting such rave reviews(dancing aside).. she either cried or hyperventilated for 2 hours thats it ... i had more questions than answers by the end of that movie, for all the hype was i was very disappointed.  a",
      "total_reactions": 4,
      "user": "kelkel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Black Swan deserves the title of psychological thriller more than simple drama because, although its about a ballet dancer that wants to get the leading role in the Swan Lake, shows the journey that has to make an obsessive and disturbed girl throw her subconscious to change her personality. But this will become more difficult because she will have to struggle not only against herself but also with an overprotective mother who tries to fulfill her broken dreams through Nina.",
      "total_reactions": 4,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "As I was watching \"Black Swan,\" I started counting the times the camera lingered on Natalie Portman staring pointlessly at herself in a mirror and lost count at eight billion.  Guess that means I'm not one of the many crying \"bravo\" for this film.  I love Vincent Cassel, but here he's wasted as one more catalyst for the flowering of Natalie Portman's neurosis into capital-A Art.  It's interesting to me that Winona Ryder showed up as the has-been dancer because Portman seemed to base her character on the timid mental patient Ryder played in \"Girl, Interrupted\" (watchable only for Angelina Jolie's much more dynamic sociopath).  The difference here is that we experience manifestations of Portman's disintigration and are clearly supposed to wonder whether she is, in fact, being sabotaged.  That would be the thriller part.  But it's evident from the first 10 minutes of the movie that this chick is way too screwed up for anyone to bother sabotaging; all an intelligent rival would have to do is stand around, smoke a cigarette or two, and wait for her to self-destruct.  So \"thrills,\" for me, along with surprises, were in pretty short supply.  I was mildly interested in how she'd finally sex up her Black Swan (hint: no sex involved) but rolled my eyes when it finally happened.  I'm happy for all the people who swooned with delight at this film, but I was definitely not one of them.  Plusses: some nice dancing.  Vincent Cassel putting the mack on Portman then walking off in disgust.  Barbara Hershey's scary facelifts finally used to advantage.",
      "total_reactions": 12,
      "user": "JennetP"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Considering all the laudatory reviews and the number of 10 ratings one might assume a masterpiece had birthed. Alas not for this viewer. Natalie did a fine job, no problem there, but talk about an overwrought  Polanski rip-off. If this is masterful film making today, I'm depressed. It had the makings of an interesting, dramatic thriller. But where was the subtlety, the craft of a work that gradually seduces you. Not here. I'm only seen a couple major reviewers that have really questioned the artfulness of this project. I felt like I had been hammered by it. It was so over the top.",
      "total_reactions": 12,
      "user": "movieboy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "I heard great reviews about this movie so I expected to see a great movie about the ballet Swan Lake. The movie started with camera work I would have expected from an amateurish 8th grader holding the camera for the first time. It was shaky, forcefully zoomed in, and did not capture the mood of an ballet. After the terrible camera work hit me I was forced into the overworked tense scene where everything they tried to place in a scene that would scare her just seemed funny. The dream sequences which were not dream sequences left me asking who asking who came up with this script and you need to pick a genre and stick to it. Finally while things like costumes and acting were amazing, the directing was terrible and ruined what could have been a great movie.",
      "total_reactions": 12,
      "user": "lowspark"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Unbelievably trashy. A cross between Polanski's Repulsion, Carrie and everything done by Cronenberg. But unfortunately done by all the above much better. A boring, repulsive, claustrophobic experience with a courageous, yet artificial performance by Portman. I never believed for a minute that she was the obsessed, naive and sheltered character she was playing. And this whole nonsense that all she needed was a good orgasm to perform the Black Swan with passion was too much. And was the lesbian sex scene really necessary?",
      "total_reactions": 9,
      "user": "ErichSchoe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "This movie's plot was thin and played out in a shocking and gruesome way. Come on folks, give the viewer a little more credit for taste and intelligence.",
      "total_reactions": 6,
      "user": "boston"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Creepy and disturbing at parts. Every person in this movie is severely screwed up in the head. Only good thing was the making out between Mila and Natalie.",
      "total_reactions": 3,
      "user": "phillyjeff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "\"Black Swan\" runs an intense and gripping course that is provided by the direction of Darren Aronofsky; but the spectacular and spellbinding performance of Natalie Portman is the reason that this film will be remembered long after.",
      "total_reactions": 3,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Outstanding film.  Portman gives an excellent performance.  This is not a film that is enjoyable to watch, minute-to-minute, as it moves along.  It is a ride you are on.  And it is incredibly stressful and scary at points, but that is a sign of Aronofsky's success in putting you inside the protagonist's increasingly frayed mind.  The ending is exhilarating and powerful.  As good of a closing 30 seconds as I have seen in a film in quite some time.  The film is an excellent piece of art with several good acting performances.",
      "total_reactions": 3,
      "user": "Lucious"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "I watched this because of all the hype and awards it was garnering. After watching this, I was quite surprised. It was not nearly as good as what most of the critics were saying. I mean, the whole movie is about Nina and how she descends into madness. And that's it. Everything else are just fillers. The ballet dancing, sure, it was great and Natalie Portman did a splendid job. There were, what I would consider \"unnecessary\" scenes that contributed much to the film's age viewing classification. Hmm... I don't quite know how to put this but we don't really get to see much love towards the \"art of ballet\" instead we get a tortured soul that happens to be in ballet. We never get to see Nina loving ballet. We just see her desire to be perfect. This is not a bad film, not it is definitely not. But it is not as good as I thought. I don't believe this film will bag the Best Picture Oscar, but Natalie Portman, sure, she will for Best Actress in a Leading Role.",
      "total_reactions": 3,
      "user": "john_galactus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I hate to be so vulgar but this movie was a total mindf*ck; and I mean that in the best way. Seriously, I don't know how else to describe it. Whatever it feels like to drop acid, that's what this movie was like. Mesmerizing. Uncomfortably intense, dark, powerful, creepy, sexy, and heartbreaking. I recommend you see it; it will kick your ass and you'll love every second of it!",
      "total_reactions": 3,
      "user": "NancyB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Natalie Portman was difficult to watch in this so-called psychological thriller. Her quest for perfection took her into the uncharted territory of real/imagined physical injuries and damages, real/imagined conflicts with her demanding and smothering mother and her jealous competitors, and real/imagined conflicts about her sexuality.",
      "total_reactions": 3,
      "user": "bruciebaby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I loved this movie! Natalie Portman was mesmerizing! I was on the edge of my seat for most of the movie. It was exhilarating and disturbing at the same time. An Oscar contender for certain. I would see this movie again.",
      "total_reactions": 3,
      "user": "SDMOVIEGOER"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is ally hype. It's nothing more than a compilation of lesbian sex scenes, blood and emotion. If this is what the world calls a good movie I seriously wonder what the hell is in the water these days! Americans need to wake up and see what is essentially softcore porn.",
      "total_reactions": 3,
      "user": "daviddepriest"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Who wrote this crap?!! What an objectionable, cluttered, incoherent, sophomoric mess.  Give me \"Repulsion\", \"The Tenant\" or \"Gaslight\" instead of this pretentious, infantile drivel.",
      "total_reactions": 3,
      "user": "bobgure"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "High art, beautiful photography, great costumes.  So so acting, over the top plot, with a few memorable moments.  Go to an afternoon showing or wait for it to come to your ondemand service.",
      "total_reactions": 3,
      "user": "CrabbyCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Awful movie! I almost walked out like half the audience! What were the critics thinking? Ok, she does a decent acting job but 80% of the movie is nothing but pure PORN! if that's what you're looking for then enjoy. Personally I had no desire to see girl on girl and other sexual acts on a large screen. Trailers & movie description VERY MISLEADING. I left wanting my money and sense of decency back.",
      "total_reactions": 3,
      "user": "FLCricket"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "Boring and disturbing.  Could not even finish it.  I do not qualify insanity and boarder line porn ART.  This movie was so uncorfortable that we decided to not put ourselves through any more torture.",
      "total_reactions": 3,
      "user": "crs221"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "A lite porno with a tacked on story line that was as \"thrilling\" as watching a silent horror movie from the silent movie era where the only sound was that of a piano being played to enhance the viewers mood during those otherwise silent screenings. Except this movie doesn't have that piano to enhance the mood. The only disturbing sound throughout this entire movie is that of a protagonist that, when speaking, stuck out like a broken, ill confident little child. Would this kind of character ever get to be the star of a leading production ballet company? I don't even hardly think so.",
      "total_reactions": 3,
      "user": "Golder"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Honestly. The best movie I've ever seen. I believe it was a nicely cast film and well written. It takes you deep into the psychologically disturbed mind of Nina (Natalie Portman). It's apparent that Nina is a closed off \"mama's\" girl. Nina, still living with her mother and sleeping in a pink bedroom, starts the film seeming rather normal with a few odd things such as the scratches on her back. Things seem to spiral further into psychological torment after she is cast as Swan Queen in \"Swan Lake\". She, as well as the audience, begins to see things wrong with her that everyone around her cannot see. For example, the tearing of skin off her finger in the bathroom, the lesbian love scene with Lily (Mila Kunis). In this fantastic psychological thriller Natalie Portman reaches what seems to be deep down to be able to portray herself as this disturbed soul. The last scene is simply breathtakingly fantastic, leaving you in awe and wanting more. One of the best film's I have ever seen. I say you must watch \"Black Swan\".",
      "total_reactions": 3,
      "user": "JGLman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Black Swan is gripping, dramatic, intense and passionate and Natalie Portman brings all that in her unforgettable performance. This movie also has a strong performance from Mila Kunis and has some cool visual effects that fit the movie. I give this movie 93%.",
      "total_reactions": 3,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Coming from a successful award circuit with The Wrestler - which consequently restarted Mickey Rourke's acting career - director Darren Aronofsky returns with the ballet-based psychological thriller Black Swan. Following in the footsteps of Aronofsky's previous films (Pi, Requiem For A Dream), Black Swan is a dark psychological nightmare with disturbing cinematography that freely crawls underneath the skin of its audience.  In his newest venture,  it seems as if Aronofsky took stylistic notes from Jean-Luc Godard and at the same time attempted to make a vague statement.  Essentially, Black Swan is a film that has too much style rather than its implied substance. Like The Wrestler, Black Swan converges most of its attention onto a single character. Natalie Portman strays from her archetypal roles and impeccably plays the innocent character of Nina; an aspiring ballerina who receives the star role of the \"Swan Queen\" in an upcoming rendition of Swan Lake. The production of Swan Lake requires the queen to play the innocent White Swan and the provocative Black Swan.  Primarily, the film focuses on Portman's conservative character, who must under pressure, contrastingly channel her inner malevolence to \"perfectly\" perform her role.  Portman IS the highlight of this film. Like with Mickey Rourke in The Wrestler,  Portman defines herself as an actress in this film. Although it takes an excessive amount of time to buildup to Nina's breakdown, the final half of Portman's performance is flawless. The spectrum of emotion and insanity she displays is so real, she has truly locked the \"best actress\" category for the upcoming award season.",
      "total_reactions": 11,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "If 'Black Swan' was directed by David Fincher, it would be called 'Ballet Club,' and it would be a thematic sequel to 'Fight Club.' However, it wasn't directed by Fincher, but instead by Darren Aronofsky, which explains why it is probably the most well-directed movie of the year. I can't say that it is the best film of the year, which I believe is 'The Social Network' because it is both good and culturally relevant, but Aronofsky's skill is at its peak in 'Black Swan,' and it sure is something to marvel. I believe Aronofsky exquisitely directed the most perfectly structured and beautifully told story of any film I have seen this year. I still give major props to Fincher, as well as David O Russell ('The Fighter') and Christopher Nolan ('Inception'). Natalie Portman steals the screen for the majority of the film, brilliantly portraying the fragile ballerina Nina Sayers. After winging the role of the Swan Queen in the upcoming show of the popular Swan Lake dance, Nina struggles to move out of the shadow of her nutty, sheltering mother, while rejecting the sexual advances and dark nature of her extremely professional instructor, all the while preparing for a performance she wants to make perfect. Seeing 'Tron Legacy' and 'The Fighter' before this (I saw all three in one day) helped keep me up with this whole perfection fiasco, which is the entire theme of 'Black Swan.' The most brilliant thing about 'Black Swan' is that it actually adapts the story of 'Swan Lake' into Nina's story that we see in the film. Since I'm a guy, I know very little about 'Swan Lake,' but Aronofsky obviously wasn't targeting all females with this film, so he throws in a summary about halfway in. It is then that you should be able to pick up that everything Nina is going through is a literal translation of the 'Swan Lake' story. This is even easier to notice with the orchestra music that plays throughout the movie during scenes that would not normally have music playing in the background. Most guys won't find this information fascinating at all, but hey, we get to see two hot chicks making out. Or do we? Aronofsky does a lot more with this film than you'll probably be able to notice after seeing it once. This includes having Natalie Portman always wearing white while Mila Kunis always wears black, to represent Portman as the Swan and Kunis as the dark side, although this symbolism is all in Nina's head. Her reluctance to push everyone else out of her life shows as we continually see her trying to keep her mother out of her room, as well as her attempts to impress her instructor while failing to understand what he wants out of her. Her struggle to impress two perfectionists drives her to the point of insanity, and the balance of the two characters on Nina's shoulders represents the struggle of the \"swan\" with it's dark side, which we see leads to a surprisingly extravagant conclusion. I would say that Aronofsky was very Fincher-esque with the psychological mindf**k, Kubrickian with the perfectionist structure of the film (especially with the bombastically loud orchestral soundtrack), or even Tarantinoish with the way he incorporated symbolism every which way (as 'Inglourious Basterds' did), but if you have seen any of this director's past films, you will understand that this is all Aronofsky. While it is indeed perfect, and very symbolic, it is also very dark and never afraid to push the limits, just as his other films are. 'Black Swan' as a whole represents the beauty of Aronofsky's dark natured filmography, although some will not like it since the limits the film pursues to push are not the type fans of Disney's 'Ice Princess' would've expected. It actually thrilled me to see many of the young girls in the theater covering their eyes throughout the film, just so I could assure myself that I wasn't watching some Hannah Montana manure.",
      "total_reactions": 8,
      "user": "AwesomeDragon"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This is the best movie to come out in the past twenty years. Absolutely gorgeous, and haunting at the same time. It will stay on your mind for days after seeing it. Every Academy Award should go to Black Swan, Natalie Portman, and Darren Aronofsky. My new favorite movie.",
      "total_reactions": 8,
      "user": "VGabriele"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Very Disappointed in this movie.  Yes the dancing and the Photography is good, but it takes a lot more then that to make an interesting movie.  My group found the movie tiring and the ending predictable.  The idea that anyone would cast such a fragile, timid ballerina in the lead of a major production  of Swan Lake in one of the world's premiere ballet companies is laughable. Dancing required hard work and discipline. As the movie states, it is a very competitive art. I do not think this character, who still sleeps in a room that was designed for a three year old would have ever made it past her first three years of dance, much less make it to stardom. She would have \"cracked up\" years and years before.  I have read the other reviews and \"know where they were going\"...I just don't think they ever got there.",
      "total_reactions": 13,
      "user": "DRahaim"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Ridiculous pap geared to 13 yr olds.  The whole deal was idiotic, all geared to how they could get the next gruesome special effect or soft-porn scene into the flick.",
      "total_reactions": 10,
      "user": "Eden"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "get to work and stop dancing like a baby! dumb ****",
      "total_reactions": 5,
      "user": "scbrother"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Black Swan is one of those all too rare films these days where you are never quite sure where it is going.  Sometimes that can be upsetting and disorienting--but not so with this film.  Aronofsky's direction kept me constantly on edge and even provided some genuine thriller moments where more than one audience member shrieked out loud.  It is a darkly hued tale expertly told and performed by Natalie Portman in what is surely one of her most powerful roles to date.  Indeed this story is at times disturbing and provocative, but that's the way good art should be--even in the seemingly simple lithe world of ballet dancing.",
      "total_reactions": 5,
      "user": "Avery"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "The first thing I did after seeing The Black Swan, was buy new socks. Comfort is not in the emotional vocabulary of this film. Think Requiem for a Dream without the laughs or the moral tale. Black Swan is a fable of self destruction.",
      "total_reactions": 5,
      "user": "Jim_S"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Wau!!! Awesome, Natalie Portman is wonderful. She make a mysterious and fantastic interpretation. Darren made a movie that it can be one of the best in this year. Mila Kunis do a great job.",
      "total_reactions": 5,
      "user": "0102"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Black Swan makes Harry Potter and the Deathly Hallows Part 1 look like best picture of the year--I say this because I thought the Potter movie just might be the worst movie of 2010.  To my surprise, and dismay, that is not the case.  There's an even worse film:  Black Swan.  It takes itself so seriously--We're making Art here, people!--that I wished I was watching ballet and not this movie.  I hate ballet and this movie made me want to watch ballet.  That's how bad this movie is.  Watching ballet would have been more entertaining, more fun, and for more original than this insipid meat cleaver to the face--thirty seconds into the movie and it's clear that Natalie Portman's character is madder than a hatter and there the guesswork ends; the conspicuous meat cleaver has split your face in two, but does director Aronofsky stop there?  Nope.  His disgust for subtlety (of any kind) knows no bounds, or shame.  He wants us to be so sure that Portman is madder than a hatter that he meat cleavers us in the face over and over:  She's madder than a hatter!  It's all in her head!  Get it?  Yes, Darren Aronofsky, I got it thirty seconds into the movie when the first meat cleaver got me square between the eyes, thank you very much.  This movie is so bloody obvious that I began to wonder if Aronofsky simply doesn't want his audience to use their brains while watching one of his art house movies.  (We're making Art here, people, and curing cancer!)  Is he so threatened by someone else's interpretation that he leaves no possible room for interpretation?  Is that the reason for the meat cleavers to the face, Darren?  If true, I'd argue Aronofsky's got some issues that he might want to take up with his urologist.  There isn't an original moment in this predictable, so-called disturbing movie.  Disturbing?  It's disturbing that Black Swan was so bad it made me want to watch ballet!  To make matters worse, (if that's possible, and dear God in heaven, it is), there isn't a likeable character in the entire film.  Now, there's nothing in filmmaking 101 that says you have to have a likeable character in your movie, but basic storytelling will tell you that if you want your audience to connect in a way that matters, a likeable character might be a good idea.  In the very least, have an unlikable character find some kind of redemption at the end so that the audience will feel emotionally satisfied.  In Black Swan, every character is not only an obvious stereotype, they're repugnant.  (When Barbara Hershey came in as the evil ballet stage mother, I thought I was watching bad satire.)  I was like, well, geez, I can't stand these people, I have no hope for them, it's clear there is no hope for them because they're all crazy, so why do I care what happens to them at the end?  It isn't my fault that I felt this way.  It's Darren Aronofsky's fault.  When the end did finally come (thank God), was I surprised, shocked, horrified, confused, sad?  No!  I just wanted to get out of the theatre and see some ballet!  And this brings me to Natalie Portman's brave acting job:  Brave because she lets a hot chick go down on her and shows us her orgasm face.  Wow, that takes some talent.  (Porno stars do it all the time, but they're professionals so they make it look easy.)  Halle Berry did the same thing for Monster's Ball, and she did it better, longer and with Billy Bob Thorton--now that's what I call brave!--and at least Halle showed some boob.  All we get in Black Swan is Portman's worried orgasm face.  Of course, she'll be nominated for an Academy Award for Best Actress (because she was so brave--We're making Art here, people, curing cancer and bringing peace to the world!)  The Academy did the same thing to Halle, but Hollywood has a tradition of rewarding actresses who show us their orgasm faces in movies.  Put a famous actress in a movie where a guy or girl goes down on her and she shows us her orgasm face and you can be sure she'll receive a nomination.  Most of the time, they don't do that for the men.  (Sean Penn got an Academy Award for MILK, but he didn't show us his orgasm face or go down on a guy in the movie, so it doesn't count.)  It's usually just the ladies.  Hollywood's orgasm face double-standard, like this typical Hollywood movie:  A steaming pile of hubristic crap.",
      "total_reactions": 5,
      "user": "Heath"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "As someone who has been involved with ballet both as an aspiring dancer and an administrator I was looking for ward to this film with great anicipation, particularly considering the overall glowing reviews. It took about five minutes to dissolve. The rest of the time watching this film was utterly painful and a complete waste of time. An idiotic plot without drama (in spite of the gory blood and explicit sex), stereotypical characters, wooden acting and ridiculous attempts at making Natalie Portman look like a dancer. She does, when standing still, having achieved the required amaciated look but nothing more. Her very beautiful face is in every scene - but after a while even the most gorgeous looks become tedious, especially if it only has the one static expression of a stunned rabbit cought in the spotlight.",
      "total_reactions": 5,
      "user": "Onlyo1948"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "There are very disturbing sequences throughout this film of putrefying flesh and violated bodies, and these images do not make sense, either psychologically or artistically.  They are simply the usual manipulations of the audience employed by almost all films of the horror genre.  Such images play upon the morbid fascination that one feels when considering the loss of something that one considers to be essential to one's being, like a leg, or one's flesh, or one's face, or one's eyes.  Not even one of the characters is truly nurturing of either art or of the human beings who make it.  Even the mother of the lead character is revealed to be a falsely nurturing figure.  If that were true in real life, then there would be no art at all.  The movie left me with a feeling of dread that took several hours to overcome.",
      "total_reactions": 17,
      "user": "iamhe"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Lets be honest, in 5 years time people are not going to be looking back saying \" wow, remember that movie Black swan? It was amazing!!!\" Nope, Once it has finished surfing its current 'hype' wave, it will sit among the 'pretty good' movies of 2010! Ill give credit where its due, Natalie Portman gives so much of herself that you wonder what depths she went too to portray this tortured soul...She is absolutely spellbinding. The Director 'Darren Aronofsky' however holds the reigns as best he can, but with such a bleak pallet and morbid tone, his raw technique, digs deeper than it needs and seems lost in its own pretensions. The Final 20 minutes however are breathtaking, with all the forgotten loose ends brought together in a truly operatic finale. To be fair maybe it needs another viewing to fully appreciate its complexities, but the thing is, \" I don't  want to watch it again\"!!",
      "total_reactions": 24,
      "user": "Sausage"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 3,
      "text": "Portman sports a worried grimace through the entire movie, making the ending more of a relief than a climax. Should have been called The Emperor's New Tutu.",
      "total_reactions": 16,
      "user": "bhaverty"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Darren Aranofskyâ",
      "total_reactions": 9,
      "user": "SchwabAD"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Lame and boring. How can I use 150 characters to say this movie was lame and boring? Until the last 20 minutes, I was really wanting to just leave before I fell asleep. And I really went in expecting to be impressed. Maybe it's aimed at the artsy, NYC theater crowds. But here in Texas it just falls flat. And this was from the general consensus of the people we talked when leaving the theater.  Lame and Boring. Unless you live in NYC and have a thing for Ballet, skip this one",
      "total_reactions": 11,
      "user": "SGIT"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "I found this movie to be deceptively shallow--entertaining to watch but ultimately flimsy.  It is a psychological thriller and a conventional one at that, often dependent on predictable horror movie cliches.  It is generally well paced and effectively creates a mood of foreboding, but the payoff, when it comes, is not terribly interesting and is no surprise at all.  It confirms what you'd already anticipated and resolves whatever mild curiosity you might have had.  The acting is good.  Mila Kunis is terrific.  The relationship between Natalie Portman's character and her domineering, self-loathing mother is completely credible, and Portman is effective in playing an obsessive, egocentric, immature artist.    Unfortunately for her, that sort of emotional unintelligence does not make for an absorbing character--the interplay between reality and her own disturbed psyche is just not that interesting.",
      "total_reactions": 12,
      "user": "figman5000"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "I did not enjoy watching this movie and I would not see it again.  I had two serious issues with it: (1) the premise that an emotional lightweight could get the lead role of Swan Lake in one of the world's premiere ballet companies and (2) the overuse of stock surprise elements -- over and over and over again to the point of distraction (and exhaustion).  The basic story line is good and interesting, and some performances were very, very strong (especially Mila Kunis').  That said, the overall execution was very disappointing.",
      "total_reactions": 10,
      "user": "RobE_inSF"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Perfection--a major theme of the film and ultimately what it achieves. Portman is stunning. Aronofsky's direction is masterful. The cinematography and sound are interesting and integral to the story. This is simply a masterpiece in the psychological horror oeuvre.",
      "total_reactions": 6,
      "user": "Tony"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Kenneth Turan of the LA Times is absolutely clueless. This film was brilliant. The fact that you are unable to distinguish reality from psychosis is what is so compelling about the piece. Natalie Portman deserves an Oscar for her amazing performance.",
      "total_reactions": 6,
      "user": "egninco"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Thrilling, chilling, and mesmerizing is how I would describe this movie.  I was fully into the movie then entire time, even though I don't know too much about ballet.  Portman gives an incredible performance and the climatic finale had me on the edge of my seat.  At some times the movie was confusing but that is why it works.",
      "total_reactions": 4,
      "user": "Neilieo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Black Swan is an imperfect film.  But it is thought provoking and interesting.  I am not a fan of ballet; in person it bores me to tears.  But I do respect the athleticism and talent involved in the process.  The ballet in this movie is merely the context of the story, not the point.  This is also not about a rivalry between two ballerinas, which was written by another user.  That may be implied by the trailer but it is not what's going on; I bet that person did not see the movie.  This is about a woman who is losing her mind, imagining lots of things including a rivalry that is more about her limitations and flaws than anything else.  My only complaint about the movie is either about how Natalie Portman played Nina or how Nina was written or how Arronofsky wanted Nina  to come across.  I'm not quite sure which one.  The problem is that Nina is so sheltered and so scared and so naive and so timid and so repressed that her character doesn't ultimately make sense.  The time and effort that go into such a career are monumental, as is the amount of rejection and judgement to which these people are subject.  It simply is not realistic on any level that Nina could have gotten as far as she did in the world of ballet  while being on such a weak psychological precipice.  It makes the story easier to believe, Portman looks on the verge of tears many times in this movie.  But anyone who had gotten that far in such a difficult profession quite frankly would have more mettle.  But that person wouldn't psychologically crumble as easy as Nina.  Still it is interesting.  Is Nina's mom living vicariously through her daughter (because she had to give up her career) or is the mom so over-protective that she has kept her daughter in a state of perpetual childhood.  I suspect a little of both.  Is Lily a potential ally or is she the rival Nina perceives her to be?  Did Lily help Nina by giving her ecstasy or did that hasten Nina's downfall?  I had hoped that it would have been less clear what was real vs. imagined.  It sure seemed pretty obvious.",
      "total_reactions": 4,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "The performances were strong, but the story just was not credible. It relied too much on the idea that to be a great artist, one must be at least a little bit mad. Although many artists have fought madness, it's hardly a requirement. Furthermore, much of Nina's madness was hard to accept. Finally, I didn't find any of the characters likable.",
      "total_reactions": 4,
      "user": "emkadv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "If I would have seen just one more scene of her picking at her bloody fingers or back I think I would have walked out.  I am a fan of Natalie Portman so I went to see this movie with a friend.  We both had the same reaction - \"What is the big deal about this movie\"?  The film goes back and forth between reality and her dual personality which is a bit confusing.  The lead is supposed to be perfection at playing the \"white swan\", but Natalie Portman looks like she's about to cry even when she dances as the white swan.  Lots of mommie dearest scenes, drugs, masturbation, and festering bloody sores.  Not what I would call entertaining.  In the end, a very polarizing film.  You either like this style or not.  I didn't.  I have to give it credit for some great visual style, however.",
      "total_reactions": 4,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Black Swan is very good!. The movie is perfectly paced, great art direction and Mila Kunis is very underrated in this prestige film. I am not a big fan of Darron Aronoksy but this is a rare feat. I don't like ballet but it was interesting to have a better understanding of the art.",
      "total_reactions": 4,
      "user": "dnice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Mind-blowing and a horrific epic movie, '' Black Swan '' is one of the best dramas I ever saw. Natalie Portman plays, remarkably amazing, Nina Sayers, a ballet dancer who struggles with her role as the ''Swan Queen'', which she must both be the White Swan (the good side) and the famous Black Swan (the evil side, witch she loses control). Very artistic and interesting movie. The chemistry between the actors was brilliant ! You can really feel the emotion going on. It was very unique and even if you're not into ballet, you will still enjoy this thriller. But the ending disturb me a little bit. Everything was perfect until the last tiny ten seconds. It's still a amazing film. Definitely worth to watch",
      "total_reactions": 4,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Stupendous film, which could have at its core the would-be, the almost, the near-but-not quite great, the  jock who is on the brink of stardom but can't cope with the pressure, the constant stress and anxiety, the bodily abuse.  Except it's the mirror image, the almost great ballerina who is coping poorly (at best) with the stress/fatigue/injuries/obsessions/dedication/rejection/guilt trips, ya-da.  Definitely not for those who like fluff, Mr. Happy-Face, P or PG rating, or perhaps R ratings based on swearing or violence.  A true \"art house\", \"artsy - f--tsy\", \"thinkin' \" movie.  The remarkable finish leaves the audience stunned, astonished, agog.",
      "total_reactions": 4,
      "user": "Gary"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "As any movie, Black Swan has it's little defects. Even though i am willing to call it - Masterpiece. Natalie Portman's performance is breathtaking. We see Nina as a skilled ballet dancer obsessed of the desire of being perfect. She has the greet opportunity of playing the lead role in Swan Lake, but to take it she has to become the very best. Finally it results that the only obstacle on her way is her own personality. That is one of those love or hate movies. As you watch it you stop thinking about the other stuff and once it is over you spend several seconds or even a minute staring at the screen, processing the information, while wondering what exactly you just saw. As the time passes by the image becomes clearer and at the end you succeed in realising it's message. For me that's the idea of a brilliant movie, the one that leaves a trace behind in your mind and soul.",
      "total_reactions": 4,
      "user": "NickXoN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Really one of the worst movies of 2010. Pointless and dull, movie felt like a soft porno. This movie will only get little virgins excited about the sex scenes. This is not art.",
      "total_reactions": 4,
      "user": "Dorrbecker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I like lesbians so when that lesbian scene came up, I was all like \"Awh sweet, I like this.\" So if you want to catch some hot lesbian action, watch this movie. They lez out.",
      "total_reactions": 4,
      "user": "VFStein"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "Aronofsky is brilliant as a director and Natalie Portman as an actress. But \"Black Swan\"doesnt have the psychological impact of \"Requiem for a Dream\" or the connection viewer-protagonist of \"The Wrestler.\" The scares are predictable and somewhat ruin the atmosphere that Aronofsky tries to create. The music and cinematography are fantastic.",
      "total_reactions": 2,
      "user": "DiegoF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "\"Black Swan is a disturbing , shocking , moving sadistic tale , that is captivating , compulsive and a work of art just shy of a masterpiece and will be no surprise when Natalie Portmen wins the Oscar for Best Actress\" ... A-",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "It was beautiful that's for sure. But honestly, do they think their audience is stupid? The ending ruined the entire movie! Portman was fine, but the real praise should be going to Mila Kunis & Vincent Cassel who steal the show each and everytime they are on screen.",
      "total_reactions": 2,
      "user": "Dayna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 3,
      "text": "I understand what this film tried to do and what direction it took and why. But i couldn't help but feel so bored throughout all this film.",
      "total_reactions": 2,
      "user": "Unknownsock"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Outstanding Acting, Directing, and story.  One of the best thriller movie i seen. Outstanding performance by Natalie Portman and Mila Kunis. On of the year best films. This movie is going catch your attention from beginning to end. I enjoy this movie a lot. Natalie Portman gave such a good performance in this movie. I love thriller movies like this. I think this is a movie ever body would enjoy. Very crazy and amazing movie.",
      "total_reactions": 2,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "It is one film of the year where I walk out of the theater and went, Hmm, nice! Well, that doesn't mean it's better than some other films I saw this year, but this is an impressive. Black Swan offers plenty of drama, plenty of thrilling moments, and plenty of sexiness. With a thrilling and perplexed performance by Natalie Portman, and stylish directing from Darren Aronofsky, Black Swan can go far. The story is more complicated than you think it is. It is not just about a ballet dancer, it is about a ballet dancer with deep mental issues. Nina is professional ballet dancer who got promoted to play the key role in a ballet performance, the Swan Queen. With a lot of pressure on her, the story proposes that she is obviously hallucinating about her body being deform. At first, I thought all of this was real because Natalie Portman is so believable. But as the story developed, I know for a fact that this girl has some serious mental issues. A summary about the film really doesn't do it justice, go watch it and you'll see exactly what I'm talking about. Black Swan demonstrates how ballet is as exciting and thrilling as an action movie with Arnold Schwarzenegger in it. Natalie Portman might even win the Best Actress Oscar, that is if she beat Annette Bening (but she already locked herself an Oscar nod). Darren Aronofsky will probably snatch the Best Director nod, but Black Swan will definitely have a chance at the Best Picture run.",
      "total_reactions": 2,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Amazing visceral acting, cinematography, score, and most importantly, the film deeply immerses you.",
      "total_reactions": 2,
      "user": "swdel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "If you were a fan of The Wrestler you'll love this. If Requiem For A Dream flipped your stomach over, get ready for Black Swan. This movie was absolutely incredible. The story isn't unknown to the common movie-gower, but it doesn't have flashing signs and big arrows that yell \"SYMBOLISM\" or \"METAPHORE\". The surrealism mixed with the psychological torment of competition gave this film a VERY realistic feel for any person once involved with competitive theatre or dancing. All the actors were terrific and Mila Kunis was not shadowed by Natalie Portman, she stood her ground as her black swan and was a terrific supporting actress. Do what you can to see this movie. Do it.",
      "total_reactions": 2,
      "user": "officerbukowski"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Natalie Portman does for Black Swan what Mickey Rourke did for The Wrestler.  Both players pushed themselves physically and emotionally to lend gravitas to an art form that isn't widely respected or understood.  She brings such life to her roll.  She embodies anxiety, fear, excitement, frustration, and sexual confusion.  Every other character in the film represents some external source of emotion.  None of the supporting players gets three dimensions.  Each fills a role: \"the mother,\" \"the director,\" \"the rival,\" \"the former star.\"  To that end, each of those characters inspires a different sort of anxiety, curiosity, dread, or fury in the central character, and Natalie Portman brilliantly evokes the oftentimes subtle distinctions between those emotional responses.  It's fascinating to watch.",
      "total_reactions": 2,
      "user": "MadAlfred"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Aronofsky's dizzying and dazzling new film grabs the audience and take them on a ride through the intense trials and pressures on a increasingly unstable ballerina played masterfully by Natalie Portman. Aronofsky's engaging camerawork places you directly in the action and dares you to join him on his feverish trip through Nina Sayers' mind. Although Aronofsky's film may not be  \"perfect\" like Nina's final, suicidal performance, it comes close.",
      "total_reactions": 2,
      "user": "DCLeahy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "He pulled it together by introducing Kunis' character and a solid ending, but the opening half hour is atrocious. overall, it's a bit overwrought for my taste, but i did appreciate the campy humor and quality acting.",
      "total_reactions": 2,
      "user": "kormac66"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Making a deep art experience a horror film is a big, big flaw. Making a horror film a deep art experience, a big sin as well. Aronofsky has usually a deep insight and great, great imagery, but like in Requiem for a Dream the one-dimensional plot is a problem and it can be summarized in \"drugs are bad\". On the Wrestler, that's a perfect example of a good main character. In here, instead of creating two faces of a same character (depth!), he keeps playing with one dimension in two characters. Where's the moment that the actress mixes the two swans and get in control of that? Besides the 'actress-killing-rival-before-premier' is quite worn out already. I was expecting a true transformation, a true character, and all that was shown is a girl that cannot stop whining and an alter-ego that is a plain murderer. Everything else was stunning, and brought high art to the masses: the songs, the grace of the swans, the art environment, and a specifically good scene where the teacher, tryint to seduce her, shows her (and us) the true meaning of ballet. I just think it needed characters with more depth to add verisimilitude to it.",
      "total_reactions": 2,
      "user": "sergioltf"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "the lead actress is very nice. She had a superb acting. the movie is good but it is not as exciting or thrilling as I expected it to be. Since from the beginning I already guessed that Nina has psychological disorder so its not thrilling for me anymore. however, it is still a bit confusing.",
      "total_reactions": 2,
      "user": "moviebuffer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Darren Aronofsky's latest film, soon after his fantastic movie, \"The Wrestler\", is a thrilling joy ride that keeps a swift and dramatic touch throughout the film. \"Black Swan\" tackles a much different subject than the \"The Wrestler\", dealing this time with ballet. Nina (Natalie Portman), a New York City ballet dancer, is trying to get into a ballet pagent, directed by her teacher (Vincent Cassel). Then, Lily comes along and competition beaks out. But, things start turning strange and Nina comes face to face with some of her darkest fears. The film is beautifully done with its art direction and costume design. Of course, a great thriller, with an unexpected twist, \"Black Swan\" is definitley a film worth checking out. 8/10 [R]",
      "total_reactions": 2,
      "user": "MrFugiReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Visually stunning, artistic, brilliant performances from everyone involved, Natalie Portman was spectacular. It Was Creepy and strange and like nothing I've seen in a long time, Almost perfect 9/10",
      "total_reactions": 2,
      "user": "Lukuzz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "Does Aronofsky do his best to cheaply thwart all of the viewers attempts at rationalizing an implausible film in an attempt to make an otherwise boring storyline interesting? Yes he does. Does his succeed? Debatable. But does Aronofsky create one of the greatest psychological thrillers of all time out of a story about a stressed ballet dancer? Without question.",
      "total_reactions": 2,
      "user": "HeyImBenMiles"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "Utter self indulgent crap... I wish Aronofsky would switch it up a bit. Same old drivel. If you really insist on watching someone unhinging, watch Roman Polanski's Repulsion. Oh Darren why don't you go out and have some fun the world isn't gloomy 24/7 as it is in yours. But whatever you do don't try comedy I couldn't stand waiting 5 minitues for each punchline.",
      "total_reactions": 2,
      "user": "JohnnyTwoCents"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "The movie is disturbing all the way to its closing scene, haunting the viewer with its brilliant cinematography and beautifully choreographed and shot dance scenes. The movie is intoxicating, fast-paced, and keeps you on the edge of your seat. The acting is all very good, and Natalie Portman certainly deserves recognition for her fantastic work. A fantastic film.",
      "total_reactions": 2,
      "user": "harlanpepper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "I really disliked this movie. I really don't understand how people can give this a good rating. Maybe it's just the men who are voting. Men who like to see Natalie and Mila gettin' it on. Black Swan was probably the scariest movie that I have seen in theaters. I warn all- do not see this movie with your parents or relatives. I was just begging for the movie to end. It was too intense for me, and for what? So the audience could see someone hallucinate and fall to their death? Not my kind of story. I'm not saying that every story must have a magical, happy ending. I'm not saying that by any means. But Black Swan had no substance or purpose. All I could see what a crazy girl getting molested every five minutes. I don't mean to ramble, but no one see this movie. Save your sanity.",
      "total_reactions": 2,
      "user": "analee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Well, y'know... It was a brilliant idea to pursue it with Natalie Portman in mind you know. She was just amazing and her depth! Oh how she scared the sh*t outta me? Dear Lord, your movie is the horror film of the year because of Portman and... Barbara Hershey! Scariest lady since Sylvia Ganush! Damn, I also commend Vincent Cassel and Mila Kunis! But oh, I couldn't put into words how much I admire this. Forget the Step Up 3D sh*t, this is the best dance movie of 2010!",
      "total_reactions": 2,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "I am deeply confused by Black Swan. On one hand it is an astonishing mix of twists and turns, displaying the very essence of madness and obsession. But it has quite a flaw. When I watch a film I feel for the characters. Whether its because I hate them or love them, I become attached and care about what happens to them. In Black Swan, I never really cared what happened to the characters. The director has created abominations. Extremely talented acting, but each portrayed in such a way as you cannot become attached to them. In it's main box office rival, the Kings Speech, I was infatuated by all the characters. For good or ill, i wanted to see what happened. In Black Swan, I was left un-moved.",
      "total_reactions": 2,
      "user": "MrCinnamon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Breath taking. That's the words I use to describe this movie. Simply brilliant. Darren is seriously one of the best living directors of our time. I fail to see how so many people are oblivious to this fact and would rather watch a Michael Bay movie. Whatever, this movie's packed with symbolism, psychology and a great look into the character Nina's world[view].",
      "total_reactions": 2,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "After seeing this movie (And really looking forward to it) to say I was disappointed would be an understatement. I really don't understand what all the fuss was about. I can say that I am happy I didn't spend money watching it at the cinemas, and only ended up wasting a few bucks on this load of disjointed tripeat the video store. I could also understand why fellow nominees at the oscars could feel ripped off that Portman scored an oscar for this, in what can only be described as an over-acted, predictable performance.  A sad hollywood attempt at what would have been much better left to an arthouse cinema. Bad plot, bad acting, deplorable ending, can't believe I stuck with it. Don't waste your hard earned on this one folks!",
      "total_reactions": 2,
      "user": "stocksy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "I disliked the main character, it isn't inspirational, it doesn't teach you anything, it isn't funny, most of the characters are empty, and it is a sexist movie, what a waste, it deserves a 0 out of 10.",
      "total_reactions": 2,
      "user": "riferrari"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "This movie is a horror flick and is not worth the money to see it.  The story and script are terrible.  Perhaps the acting is good, but it is wasted on this terrible horrific film.  Save your time and money and skip this one.",
      "total_reactions": 20,
      "user": "Man3"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Spoilers!!! Not that much of the plot revealed below would be surprising after watching the first 10 minutes of the film. 1. The premise is flawed. Why would they select such a spiritless, vapid, flat emotional wreck to carry Swan Lake.",
      "total_reactions": 17,
      "user": "carldamnit"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Make note: of the two idiots who gave this bad reviews, one did so to draw attention to a technical problem with the metacritic site and the other wrote his based on the trailer, which made him \"angry\" even though he doesn't seem to know what the movie is actually about. Frustrating. Oh, and by the way, the movie is one of the best to come out this year.",
      "total_reactions": 10,
      "user": "MkM"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Some may mockingly call it \"Repulsion in a Tutu\", but the movie works. The acting is top notch, lifting the heavy atmosphere of repression (sexual and otherwise) and body horror above the Grand Guignol theatrics into pure gut-wrenching psycho-terror and pain. Portman (in Machinist-style emaciation) is sublime in her descent into psychosis, Hershey is fabulously creepy as her domineering mother, Ryder does wonders with her few minutes on screen and Kunis is a great fiery and free-flowing opposite to the frigidly perfect Swan Queen. Aaronofsky is a bit heavy-handed with symbolism and uses too many of his trademark tracking shots from behind, the script could have been better, but there might be some awards here, especially for Portman and Kunis. Well worth a watch.",
      "total_reactions": 5,
      "user": "KundK"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Great film. Natalie delivers one of her best performances to date.",
      "total_reactions": 5,
      "user": "tinar1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "An excellent psychological-horror film.  The score does a wonderful job of setting the mood and tone, along with the excellent cinematographic.  The acting  overall is phenomenal.  It would be a shame if Portman did not get Oscar consideration for her role.  In a age where for some, being entertained at the movies is a rare occasion, Black Swan succeeds triumphantly.",
      "total_reactions": 5,
      "user": "athinnes"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "An excellent movie. Definitely a Best Picture. The acting is just brilliant and if you don't see it know I guarantee you will be missing out on an important piece of 21st century cinema.",
      "total_reactions": 5,
      "user": "Exordiom"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Wow. The one weak link is the screenplay (Cassel has to say some truly awful lines). I couldn't possibly care less. I haven't seen a film this visceral in years, maybe ever. Portman is career-best (by a lot) and Barbara Hershey is superb. Perfectly captures the weird dichotomy of the deathly serious and the absurd that any obsessive artist confronts themselves with on a daily basis... why do we let ourselves tear ourselves to shreds over something that, in the grand scheme, should be so trivial? Black Swan doesn't answer the question and doesn't seek to, but it does explore it through a totally committed performance from Natalie Portman that has to be one of the most difficult acting assignments I've seen someone take on in a film in years. A dizzy, demented film that doesn't give a damn about the line between reality and delirium. I love that.",
      "total_reactions": 5,
      "user": "drawkward86"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I've never used this word before but this movie was breath taking.  It started out a little slow but man does the pace pick up as the movie goes along.  Portman deserves Oscar consideration for an amazing performance.  The camera work was fantastic.  I've never attended a ballet before.  I think I'd like to go to one now.",
      "total_reactions": 6,
      "user": "martinex"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Definitely worth seeing. The acting is as brilliant as the psyches portrayed are perverse.",
      "total_reactions": 6,
      "user": "nomdiploom"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Bravo! Encore!  The best film I have seen for a very long time.",
      "total_reactions": 3,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "this movie is the best I saw in 2010, amazing, one of the best music underscore.! Portman just wonderful, everything was spectacular ... This combination of psychological drama is a mixture of feelings that you uncoordinated and keeps you glued to the screen until the last minute",
      "total_reactions": 3,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is stunning.  I just love a movie when, after you leave, you can't stop thinking about it and talking about it.  Well made and well acted, a must see.",
      "total_reactions": 3,
      "user": "Bama72"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Outstanding. No doubt one of the best films of the year. Best thriller/drama movie I've seen yet. Natalie Portman's performance is incredible, such as the other actors in the film.",
      "total_reactions": 3,
      "user": "Mary7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "\"Black Swan\" is a terrifying and beautiful psych-thriller which completely blew me away. I almost felt genuinely sick while watching the movie, similar to the feeling I had while watching the downward spiral that was \"Requiem for a Dream;\" but I can't say that it wasn't amazing. \"Black Swan\" hits you at your emotional core, and Portman's performance in the film may very well be her best outing to date. The film follows Nina (Natalie Portman), the main character and recently selected lead in her studio's upcoming production of \"Swan Lake,\" through the weeks leading up to the debut of the play (which is re-instated in a more simple form to attempt to defibrillate the struggling company). As her instructor Thomas (Vincent Cassel) states, the role is very dynamic, and requires her to get \"loose\" to play the seductive and deceptive black swan. She struggles at first, but soon finds darkness in a life filled with innocence, and becomes ensnared in the role. The movie turns into a nightmarish and terrifying struggle between good and evil, as Nina battles amongst herself to try to come to grips with the ballet role that is consuming her life, and her soul. The film is edgy, raw, and at times, outright frightening. It has that visceral and striking presence which Aronofsky is so masterfully talented at projecting, although it is purposely flawed so that you are sick to your stomach with Nina's mental health. It makes heavy work of symbolism and irony, and repeating themes include duality, hatred, anger, control and insanity. Personally, I loved the film. It is almost impossible to not be hypnotized by the intense cinematography, the outstanding performances, and the bold imagery. The entrancing score by Clint Mansell, a long-time collaborator of Aronofsky's, is real and powerful, and perfectly captures the essence of the film's most intense moments. I guess the one thing which kept me from giving it a ten would be that the film almost does too much at times. It is complicated, and although brilliantly conceived, it draws away from an audience which may more greatly appreciate it for it's terrifying reality, and not its symbolism and depth. Regardless, the movie is greatness in a bottle. If you haven't seen it yet, treat yourself over the holidays; you won't regret it.",
      "total_reactions": 3,
      "user": "ckary"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I really feel like Aronofsky has found a happy medium between Requiem for a Dream and The Wrestler with his latest masterpiece, Black Swan.  He definitely takes his interpretation of Swan Lake and All About Eve to some unique places with the film.  And he doesn't feel the need to have to make sense on a practical level, because he is using his chosen medium to express the torment Natalie Portman's character is going through as she prepares for the greatest role of her career.  And the film parallels both the stories of Swan Lake and All About Eve's storylines on a metaphorical level that is raw and provocative.  I have talked with many people who hated this film and our biggest degree of separation is the fact that I felt this film perfectly conveys what it is to put one's self out there on the stage, and what an actor (or dancer) must do to get to a certain place.  They felt that the film's unrealities derailed it from the point it was trying to make.  But I don't think a good filmmaker must be constricted by reality when trying to prove a point.  An artist must separate themselves from who they are and become what the character demands.  Portman's character didn't need to change to be the White Swan.  But to be the Black Swan, she had to abandon everything her mother wanted her to be.  Which brings me to the relationship between Portman and Barbara Hershey.  I personally know girls who have this EXACT relationship with their mothers.  I even know a girl who was named after Baryshnikov, who trained as a ballerina as a young girl, but ultimately gave up that dream and she has this exact relationship with HER mother.  So needless to say this relationship REALLY spoke to me.  The mother wants her daughter to remain innocent and perfect and be the ballerina in the box.  But she ultimately becomes the broken and chipped away figurine because that's what life does to us.  She has to rebel against her mother, her company, and even herself to find the darkness within that she needs to play this part.  And if people don't really believe this is what artists go through, they don't have to look as far back as Van Gogh severing his ear to remember the fates of Heath Ledger and River Phoenix.  Some artists who try and tap into the darkness wind up killing themselves in the same way Portman's character slips over the edge.  That's why I think this movie is so spectacular, and why Portman deserves the Oscar.  Her transformation was flawless.  And lovely to watch.  And Clint Mansell's hypnotic score ushered us along in perfect sync with Portman's descent.  For someone who has enjoyed ballets and operas and theatre in general, Aronfsky has given us a dour tour de force that should satisfy most pallets, whether they can handle the macabre elements or not.  I can't wait to see what he does with The Wolverine.  Haha.",
      "total_reactions": 3,
      "user": "jdolan74"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "F'in Masterpiece. F'in Masterpiece. F'in Masterpiece. F'in Masterpiece. F'in Masterpiece. F'in Masterpiece. F'in Masterpiece. F'in Masterpiece.",
      "total_reactions": 3,
      "user": "DKay"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Let's face it: the movie is poor. The only worth mentioning idea is the hallucinating part of Natalie; apart from this, i was very frustrated and nervous watching this movie. I somehow felt it from the beginning that is a poor movie, but i give it a chance. i was disappointed. It is for sure not worth the Oscar. It will be forgotten in time.",
      "total_reactions": 3,
      "user": "ovi_bz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "I am not sure what all the hype is about this flick.  It was interesting to watch but the blurring of reality and fantasy made it hard to watch and even believe.  Her relationship with her mom was \"on the button\" and I could feel the suffocation but everything seemed distanced and forced and unreal.  Portman does a great job but her character is down right painful to watch as she careens over her personal cliff...  Ilyich's music is used to great effect and the dancing scenes are fascinating...",
      "total_reactions": 3,
      "user": "TheTerp"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I really love Natalie Portman's performance ever in this dark twisted movie. She really scared everyone in the audience. Black Swan is a perfect film that shows a character who really wanted to become a perfect ballerina so she can be in the musical stage and then she got split personality on herself that she couldn't control herself all because of the fears of practicing ballet. But also,I really love for my personally favorite is to all of you men,that we love to see Natalie Portman and Mila Kunis are making out in this picture,that's it!",
      "total_reactions": 4,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Natalie Portman gives a career-defining performance as a ballerina who's been chosen to dance the title role in \"Swan Lake.\" Her lack of confidence and obsession with perfection rise to hallucinatory levels before it's all over. Director Darren Aronofsky knows how to create a character's world that's intimate and potent. This time he and Portman have plumbed the depths and emerged with a dark, compelling character study.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Leaving the theater, my friend and I overheard a man say, The lesbian scenes werenâ",
      "total_reactions": 4,
      "user": "WriteInk"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "The little girl in LEON: THE PROFESSIONAL (1994) had grown up now. Natalie Portman is at her peak performance so far. Team up with heavy-caliber Director Darren Aronofsky, they made a beautiful story but horrifying at the same time. Aronofsky is invincible, especially when he explored human desperation, like in his previous films REQUIEM OF A DREAM (2000), THE FOUNTAIN (2006) and THE WRESTLER (2008). For about 100 minutes of the movie, I felt like I was experiencing the theater performance, not just like a common movie. It filled with beautiful images and great orchestra. Nina (Portman) is a chosen ballerina to fulfil her dual roles all at once, to be irresistible innocence White Swan and also to become seductive evil Black Swan. Slowly but sure, the darker side of Black Swan absorbs her real life. I love the brilliant Cinematography. Aronofsky seemed to use two techniques of camera work. One was for The Long Shot, he used steady conventional method. And the second for The Close-up, he used Hand-held Camera. I had ever said that Hand-held Camera is modern technique in today cinematic world. Not only for Action, but recently for Drama as well, Hand-shake Camera is able to effectively drag you into the middle of ongoing situation, if you are not using Hand-held Camera, you are out of date now. The Cast is amazingly fit. Vincent Cassel is fit for provocative and ambitious Ballet Instructor. Mila Kunis is fit for seductive and ambitious Nina colleague. Barbara Hershey is fit for authoritarian and ambitious mother. And even a brief but impressive appearance by Winona Ryder as anxious and ambitious competitor. Yeah, it is all about ambition and you can see it in each character, all of them have their own ambition. However, the star of all stars above is Portman herself. She shows her darker side successfully, you could literally feel her pain, pressure and paranoia situation. The movie becomes more mysterious with some unusual sex scenes. For the last half hour of film duration, she drives us into beautiful but ironic condition, sometimes absurdity become the part of it. Those last scenes are extremely horrified, with broken fingernail, peeling skin and fractured bone for the elements. I almost could categorize thiz movie as a Horror movie. The movie emphasizes in every beautifulness of ballet, there is dark side that we never know before. Finally, I just want to say, It was perfect.",
      "total_reactions": 4,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "a pathetic man's fantasy combined with tricks to convince commercial retards that they're watching an intellectually challenging drama full of culture. Overly dramatic, poorly scripted,a used up ridiculous plot and zero entertainment. It was like watching a cheap street drug addicted prostitute wearing plastering cosmetics in her effort to look beautiful. Or college kids wearing trendy glasses, woolly scarves and holding a copy of War and Peace whilst secretly reading Twilight.",
      "total_reactions": 4,
      "user": "Goddessof_Blah"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "This movie was good but the story limited the effect as one knew what the outcome would be. They did a great job of keeping you rattled and not sure of what was real and unreal. Portman dazzled as did Hershey who creeped me out. This will make my top ten but not the first five.",
      "total_reactions": 5,
      "user": "JamesL"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Absolute garbage.  ...........................................................................................................................................................",
      "total_reactions": 7,
      "user": "Jake98"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "At the end of Rob Marshall's \"Chicago\", in an effort to clear up any lingering doubts from moviegoers about what they just saw, the titles proudly trumpet that the principal actors did all their own singing and dancing. So adept  were Richard Gere, Catherine Zeta-Jones, and Renee Zelwegger at both performing arts, some audience members may have presumed that professionals were called in to do all the heavy lifting, especially the dancing, where, as is the norm for any movie that requires multi-tasking(stunt work, stripping, etc...) of its actors, a double can be inserted whenever the camera catches the body without a head. Knowing this, the novelty aspect behind a Hollywood starlet, a veritable household name, casting vanity aside and trying to disappear into the role of a top-flight ballerina is dispelled, right off the bat, when the filmmaker establishes his subject's competence(or dare I say, mastery) in dramatic fashion. Dancing by herself, establishing shots of Natalie Portman in balletic repose, give way to a close-up of disembodied feet, whose legs, cut off somewhere above the knee, could belong to anybody, but are indeed Portman's, when a camera tilt, along with the dancer's contortions, reorientates the actress to her lowest extremities, right after those thought-to-be-anonymous feet go from horizontal to vertical(in other words, \"on point\"), and then in gilded motion, like a pro. It's a goosebump moment, believe me. It's really her, the stripper who wouldn't strip in Mike Nichols' \"Closer\"...doing THAT! With Portman's credibility issues out of the way, this neo-\"Repulsion\" story becomes the focal point, which wouldn't be the case if Nina Sayers, a woman-girl with mommy issues(and sexuality issues) who's losing it, was heavily subordinated by a Julliard-trained stand-in to do all the hard stuff. The camera doesn't lie, especially a hand-held one, a probing thing that gets in Nina's grille(on and off-the-job), and Portman's body, all sinewy muscle and bone, is the truth, and passes with flying colors. The unbridled passion and masochism and predilection for self-sacrifice that every hungry, up-and-coming dancer possesses is captured in unerring detail by Portman, who on a short-time basis, obviously, went through the same taxing process herself, because you can see, actually see, that she's thinking, as opposed to acting, like a dancer in the cut-throat world of New York City swan-making. When asked by her lecherous ballet director(Vincent Cassell) to embody the second swan with the same assuredness as its white doppleganger, the virginal Nina goes down a rabbit hole of repression and self-hatred when the unformed girl is forced to ruminate over sex, a subject she clearly deflects through overcompensation, in which ballet has proven to be a stunting mechanism for this grown woman(who still lives with her mom and has a room populated with a menagerie stuffed animals), thereby creating a vast disconnect between her emotional and chronological age. When you get right down to it, \"Black Swan\" is all about f*cking. In her room, Nina touches herself, and is made to feel guilty about having desire, all at once, upon discovery of her mother asleep in a bedside chair(or is she?), indicating a past history in which Erica(Barbara Hershey), a failed dancer who has mixed emotions about her daughter's success, impeded Nina's sexual development through calculated sheltering. Not wanting to draw comparisons with Michael Haneke's \"The Piano Teacher\", Nina and her mother sleep in separate rooms, but the disturbance created by Erica, her seeming entitlement to be in such close proximity to her adult daughter, suggests that the bedtime arrangements are still new. In a sense, the mother helped birth the black swan that haunts Nina. As a result of her psycho-sexuality, Nina stabs the dark bird, stabs Lily(Mila Kunis), for awakening her greatest fear, inflaming the fragile ballerina to stab herself, out of self-hatred for not being the white swan, mother's \"sweet girl\".",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Again Darren Aronovsky proves he is one fo the few directors trying to push the envelope of cinema. Black Swan is the story about an inner conflict pushed at it's limits, it is not a movie about ballet or the famous Swan Lake. This is a psychological drama, ballet is just a vehicle for that conflict and so ballet fans will probably be disappointed. In fact in the early versions of the script the story unfolded in the world of theater.",
      "total_reactions": 3,
      "user": "Pier"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "{Spoiler alert]    Very good movie in many respects.  The acting is good and, from a quite formal point of view, the film is well-structured.  One of the interesting things about the film is the many thematic references.  It references Freud in dealing with repression and the relation between a woman and her mother.  Jung is referenced in the story of how a person must come to terms with his or her \"shadow\" which is often referred to as a doppleganger.  Even French Symbolist poetry with its fondness for the swan, which in French is the \"signe\"--the sign or symbol, comes into play.   If you are a person who really likes things intellectual like this, you will probably get a lot out of this film.    However, on an emotional level, the film never takes flight.  We really never connect to the character.  There is very little emotional variety in this film.  It's the same emotion throughout with just an increasing intensity.  It may be a \"tour de force\" but after a while it kind of gets monotonous.   When I saw the film, audience members laughed at a scene of a dead body being dragged.  (A ballerina dragging a dead body is funny!)  I have heard of other viewings with hoots and hollers at the sex scenes.  I think people just get bummed out at such \"very serious theater\" sort of business.  At the end of the film, the main character dies.  I have yet to hear of anyone shedding a tear for her.",
      "total_reactions": 3,
      "user": "Dalem"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is like \"Requiem for a Dream,\" but with ballet. (Awarded an extra point for Portman's performance -- and actually, Hershey is excellent as well.) I found the mix of blood-sex-fantasy and lunacy quite riveting, but if you want a \"ballet movie,\" rent \"The Turning Point.\"",
      "total_reactions": 2,
      "user": "Lyn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "I just plain didn't enjoy this movie. I'd give it another chance if I thought I could sit through it again. It's not a ballet thing either... I could enjoy watching anything if I found the story engaging. Vincent Cassel is great at playing douches...there, I found something semi-positive. Did anyone notice that there was a lot of crotch grabbing in this film? That's all positive.",
      "total_reactions": 2,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "I enjoyed this movie rather more than I had expected to. The first thing I noticed was the novelty of an environment I am utterly ignorant of, a ballet company, rife with all its requisite ambitions and jealousies. Nina's paranoid delusions are completely random, and quite unsettling, giving the feeling that we are just as out of control as she since we cannot tell who or what is real at any given moment. What I found most intriguing of all was that for Nina to perform her role as black swan, she had to self destruct/let the crazy out that she (and her mother) had so assiduously kept contained. We are left to imagine the epilogue of this story, and I am rather grateful for that, because we the viewer can always write a better movie than some Hollywood hack factory, right? The movie ends just as Swan Lake ends, with a death, and that is rather clever in that \"Black Swan\" borrows from a master, to give us a subsidiary tale that can only exist in the shadow of that genius, but oh what a shadow! Tchaikovsky opened the door with his Black Swan, Aronofsky, Heyman, and Heinz merely dared to descibe some of the furniture within, with theirs.",
      "total_reactions": 1,
      "user": "egovirus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "This is one of my favorite movies ever! Natalie Portman deserved her Oscar for her amazing performance. Ever since I saw it, I have been obsessed with it. The acting, story, direction, screenplay, visuals, and music are all perfect. A perfect movie.",
      "total_reactions": 1,
      "user": "guitarplayer11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "'\"Black Swan'\": Horrifically Beautiful",
      "total_reactions": 1,
      "user": "MedinaReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "http://mushreviews.blogspot.com/2011/04/black-swan.html",
      "total_reactions": 1,
      "user": "Kingmush"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "There are just a lot of really good things about this movie, which includes Natalie Portman and the complexity of her acting role, the directing, and the story. Bravo to solid filmmaking!",
      "total_reactions": 2,
      "user": "AaronM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I cannot understand why people keep saying that this movie will be \"forgotten\". I don't think that I will be able to unsee the images I witnessed in this film, and for that, I applaud Black Swan. This is an incredibly beautiful, utterly disturbing film, which will leave you on tenterhooks the entire time. A must-see, and a must-have for the household (though the kids may not want to watch...).",
      "total_reactions": 1,
      "user": "GVirus16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Man what a film. Forget whether you do or don't like ballet, this is a surreal and intense thriller/horror almost in the vain of some of Stephen kings old stuff. Brilliant, disturbing imagery in parts, a great pace, always entertaining and suspenseful. Drags you deeper and deeper into madness and totally delivers at the end. A masterpiece really.",
      "total_reactions": 1,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "We manifest our own destiny; we either create our own brilliant success or our tragic downfall. Regardless of the situation, most of our problems donâ",
      "total_reactions": 1,
      "user": "Duke"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "This movie was excellent. Some of the scenes made you feel so embarrassed or ashamed for the main character, but I think that is exactly what Aronofsky was going for. This movie contains some of the best acting that I have seen out of Natalie Portman yet which totally validates my thoughts that she has been throwing her potential away thus far in her career. Mila Kunis, Vincent Cassel as the slimy Ballerina director and; surprise, Winona Ryder are also excellent. The movie also gets its message across and gets out, instead of lingering on needlessly like many art house type movies tend to do. This movie may be a little emotionally draining for some but I think that it is one of Aronofsky's best work. I'm not even that fond of Aronofsky's earlier films save The Wrestler, but I think he did a really good job with this one.",
      "total_reactions": 2,
      "user": "VAFranky"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "mila kunis eating the clung out of natalie portman please this is 10 out of 10 material it was a shame u didnt get to see the company director get up to his nuts in guts though",
      "total_reactions": 2,
      "user": "chotzy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Mila Kunitz + Nathalie Portman = Sublime! Awesome movie, weird, dark, spooky, yummy! One of the best film I have seen this year. Portman is a wonderful actress that finally gets the shot of her career.",
      "total_reactions": 1,
      "user": "bitburn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I'm not a big fan of this type of movies, but I'll still separate this film, because as far as the cast, this film is phenomenal, in terms of story, is simply great and I think this film, with all the awards and nominations he has received, is excellent. Strongly recommend that you look, whether in cinema or on TV.",
      "total_reactions": 2,
      "user": "InfamousPrince"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Aronofsky very much tries to make the case of Black Swan as a companion piece for The Wrestler... yet it isn't. Evidently, bi-dimensional Portman + sexy Kunis + perfect Winona + just a pinch of Cassel - botoxed Hershey = great cast. I was more moved by the Rodarte's costumes that the final punch. Nonetheless, this should be watched as a chapter in Aronofsky's career and most certainly Portman's. Can do without the french fiance-dancer. @cinemaquote",
      "total_reactions": 2,
      "user": "cinemaquote"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Great film. Cements Natalie as a solid actress capable of playing any role. This film twists the very foundation of art and makes one look at dance from a different frame - examining the damaging components. One of the strongest films to be released in 2010 for sure.",
      "total_reactions": 2,
      "user": "Syrnyk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Really good movie. Excellent acting from the cast, especially Natalie Portman. The scene with her and Mila Kunis in her bedroom was amazing. I left the theatre stunned, in a good way. Go see it now!",
      "total_reactions": 4,
      "user": "davidp1045"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Itâ",
      "total_reactions": 2,
      "user": "2GUI2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is two people. Darren Aronofsky is back to his deep psychological best and Natalie Portman in a definate Oscar nomination role. This movie will not be for everyone, but if you've seen Requiem For A Dream (in my opinion still Aronofskys best work) and could handle the tough but powerful scenes and performances then this is for you. A deep and dark delight.",
      "total_reactions": 2,
      "user": "allystew"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "I still haven't decided whether this movie was good or not; but it certainly was one of the most enthralling films I have seen in a long time (Gives new meaning to the genre of psychological thriller).  Portman's acting is out of this world, and the cinematography is certainly unique and complex.  Definitely worth a watch...",
      "total_reactions": 3,
      "user": "macks4386"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "From the opening scene to the final credits this movie had me completely wrapped around its finger for the whole time. Natalie Portman gives a performance of a lifetime. The story and direction are executed brilliantly. Though I could talk ad nauseum about the depth and message of the movie, it can simply be summed up by saying everyone involved in this movie deserves any award they are nominated for.",
      "total_reactions": 3,
      "user": "jbarkin13"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "(old review) Critics who don't get this movie or old prudes need not apply. This is one of the most beautifully chaotic yet intelligent movies I have seen. As long as you have good taste and a functioning brain you'll like it, and especially so if you are an artist yourself because it gives you, not so much a comment or exploration (fast becoming a cliche in the critical world), but a feeling of art and the excesses to which artists willingly go for their art. This is why I have a feeling some critics didn't \"get it.\" Critics too often calculate and add up too much to recognize their own feelings about a movie, and frequently judge a movie based on its adherence to a particular formula, but this movie tosses away a formula and creates its own impressionistic view of a situation, much like Aronofsky's Requiem for a Dream. There is an added bonus if you are an artist who has given themselves to a project and sacrificed something for it, because this movie shows you the extremes to which you can go for that feeling of having done your job to perfection. As an actor I sympathize mostly with Nina's desire to be perfect and to successfully fulfill her director's wishes, and I'm sure it would apply to so many other fields of creative art.",
      "total_reactions": 3,
      "user": "timeformime"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "In Black Swan, Darren Aronofsky creates a nightmarish world that the audience is viscerally thrown into, with continuous twists and surprises at every step of the way, never knowing what will happen next. We only hope there is some salvation at the end. Black Swan is created by one of the most passionate bright young filmmakers alive. The camera style is more regimented and thoughtfully composted compared to the cinema verite, looser, documentary style of The Wrestler. Every shot is perfectly thought out, and the use of mirrors in this film is simply magnificent. The monochromatic colour tone is stunning and at all times the colour palette of everything in shot is tempered to enhance the story. Especially in the wardrobe coloring. The Wrestler was based in the real world, the world we all live in, where a man is grappling with the failures in life, has a daughter, works part-time as a butcher, falls for a stripper and tries to resurrect his fledgling career. It deals with his ego and his determination. Its almost documentary in style. Black Swan is a film sprung from Darren Aronofsky's imagination, aided by a team of talented writers. It is a dark tale of ones inner struggle with perfection. In essence the film centers on the central character of Nina Sayers as she grapples with life as a star ballerina. She does all she can to find perfection within her self and with others. We go into the depths of her mind, and at times the film is as frightening as a Polanski film, at its best. Natalie Portman went on a rigorous training regime for this film and it shows, her performance is mature, dark and stunning. I can continue to write numerous pages on pledging my love for this film but I wont waste my time, or yours, as if you need further information on this, the web is abound with it. When Darren Aronofsky was recently talking about his next film, The Wolverine he made a very interesting point \"Iâ",
      "total_reactions": 2,
      "user": "tyronerubin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Almost certainly one of the best films I have ever seen. It has the same levels of intensity as a **** film, and uses the same black and white depiction of good and evil to visually emphasize the thematic progression. To say this film rocked me, frightened me, and amazed me would be an understatement. I have never, ever had to sit down in the theatre lobby after a movie to process what was just viewed - to do it for 30 minutes, only saying to my friends over and over and over again how good the film was, really made it clear that what I watched was something of great power. An important film in the history of film, I hope. Certainly an important film thematically, touching so many ideas and breaking so many expectations - leaving you confused and terrified for the truth....",
      "total_reactions": 3,
      "user": "criticalranger"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Warns that inexorable perfectionism may lead to insanity. Picturing two opposite, and problematic extremes of living: safe, or self-destructive; eventually leaving the audience to conclude for themselves, that it would be best to pursue a balanced middle way. Sympathetic character, some quite shocking moments.",
      "total_reactions": 3,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I just watched the film yesterday, and I can honestly say that \"Black Swan\" is, without a doubt, my favorite film of all times, (beating my former favorite: Fellini's \"Eight and a Half\"). In a sense, both films have lots in common. Both explore the inner turmoil and real-life hardships of people working in the entertainment business, or that of artists in general. Both films are centered on characters how are under massive pressure from the people in their lives, and both little by little fall appart because of it.",
      "total_reactions": 2,
      "user": "Goldheart"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Variously described as a psychological thriller, a body horror film or a descent into madness, the film follows the mental and emotional detoriation of a young ballerina attempting the lead role in swan lake.  Pressured by her overbearing mother living vicariously through her, her fiercly competitive peers and her psychologically and sexually assertive director her already frail personality deteriorates.",
      "total_reactions": 3,
      "user": "jsadams"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Wonderful film, both artistic and psychological approaches were fantastic. Nina didn't distinguish reality from imagination until the end, it was necessary for her to kill Lily so she could be her alter-ego (in the way it resembles Lily), certain psychological depth. She took the path of the self abyss, so when she could became perfection she died, has a being she could never achieve.",
      "total_reactions": 2,
      "user": "FranciscoAzenha"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "The best way to describe Black Swan would be to call it an artsy psychological thriller.  Darren Aronofsky goes from making us sympathize with large sweaty men hitting each other with chairs to making pretty girls in tutus scary as hell, and he does it with style.  From the first frame to the final fade Swan is a breathless descent into madness which left me breathless at the end.  I went into the movie expecting it to be intense, but I was in no way prepared for what was in store and I will say I left the theatre very happy.  Very disturbed, but happy.  Portman is amazing as Nina pulling the audience down into madness with her, making a gradual transition which is captivating to watch (which is good because she gets the vast majority of the the screen time).  Mila Kunis is frightening as Lily, changing from breezy and friendly to dark and scary on a dime creating a terrifying antagonist for Nina while also serving to be a great foil as well.  However the one dark horse in the movie is Winona Ryder, who doesn't have very much screen time but makes every second count making the audience deathly afraid of her character while still feeling an overwhelming sense of pity as well.  Aronofsky's direction is certainly felt, but it never gets in the way, deftly moving from scene to scene and gradually increasing the tension like a master.  The visuals of the film are nothing short of beautiful, even with the purposefully dark and grainy filming.  In my opinion it is one of the best of the year,  the best thing both Portman, Kunis and Aronofsky have done as well.  However the dark tone and graphic nature of the film is definitely not for everyone.",
      "total_reactions": 2,
      "user": "DPads"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "My full review is available on my blog at www.thecriticalfan.blogspot.com  My very general thoughts below:",
      "total_reactions": 1,
      "user": "ziggy2dope"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "A dark, twisted, haunting masterpiece. If Portman doesnt win her first oscar here I will be surprised. Aronofsky is one of the best directors currently in hollywood.",
      "total_reactions": 4,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The idea behind the film is pure excellence, especially when compared with The Wrestler. Portman is fantastic of course, but I felt quite bored through large chunks of the film. Good film but I can't say I'll watch it again anytime soon.",
      "total_reactions": 2,
      "user": "Surtr13"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "If you have watched Mr Magoriam With Dustin Hoffman you would know that Black Swan's star Natalie Portman stars alongside Hoffman ^she does deserve her GG & SAG nominations",
      "total_reactions": 2,
      "user": "LillyanneS1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "reaayggggggggggggggggggggggggggggggggvbnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn",
      "total_reactions": 3,
      "user": "Qune"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is definitely worth watching. Natalie Portman does a superb job as a dwindling and fragile young ballerina, and the beautiful artistic direction is wonderful to watch on screen. Within the first 20 minutes of watching, I had immediately decided that I liked the film. On the negative side, the dialouge was bland and Mila Kunis' character had no depth. Otherwise, this film is a must-see from 2010.",
      "total_reactions": 2,
      "user": "lyric555"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is imaginative and new. It's an experience. The use of mirrors in this movie was creative and unique. And Natalie Portman was phenomenal. Enough said.",
      "total_reactions": 2,
      "user": "Stephmeister02"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Darren Aronofsky has a flair for a finale. Black Swan blazes towards the finish line with the same incredibly devastating force Requiem for a Dream had close to the end, more than justifying the time you commit. Both films are uncomfortable but arresting viewing, and both are worthy of any praise they can be given. A return to form for Aronofsky and the inconstant Natalie Portman, and one well worth the Oscar buzz.",
      "total_reactions": 2,
      "user": "mattcarr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Iâ",
      "total_reactions": 2,
      "user": "fitchbuck"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "When appraised as a melodrama with all the heightened sense of reality of the ballet within the film, the barbed accusations of overacting and lack of believability seem rather less sharp. Similarly, there's a sense of inevitability to the tragic climax that renders accusations of predictability mute. Natalie Portman puts in a career-defining performance that puts the ghost of the Star Wars prequels well and truly to rest. Darren Aronofsky paints a surprisingly chilling picture with a vibrant palette. The audience is perpetually on edge, and it is this tension that ensures the film's eroticism never becomes gratuitous titillation. The climax is a stunning crescendo of sensory overload that will leave even the most manly men clamouring for tickets to the next production of Swan Lake.",
      "total_reactions": 3,
      "user": "holloway"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Let's make this short and sweet, Natalie Portman was outstanding and I wouldn't know how to make a movie about ballet interesting but Darren did a hell of a job. There was a little but of confusion on my end as to what was real and what wasn't but all in all this movie was fantastic.",
      "total_reactions": 3,
      "user": "Aiden26"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Black Swan was, by far, the best movie of the year. Going into the movie, I didn't quite know what to expect besides that it was a dark ballet movie. I was honestly blown away with what I received from that movie. To take ballet and transform it into that is just amazing. Great movie from start to finish, especially that of the last twenty or thirty minutes. That was the truly breathtaking segment of the movie. All that needs to be said about Natalie Portman is amazing and best actress of the year. And for Darren Aronofsky, best director. This movie, hands down, deserves those three Oscars.",
      "total_reactions": 3,
      "user": "nk40699"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Portman delivers a brilliant performance in this beautifully illustrated film about a girl picked to be the White Swan in her Ballet group's next performance of Swan Lake, only to go mad from stress and her fear another girl is trying to get her part.",
      "total_reactions": 2,
      "user": "Spyke"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This movie pulls you in demanding an emotional response and keeping you on edge.  Surely this is what movies are all about: making you invest in the story and want to see the outcome, no matter how nail-biting the ride may be.  The final ten minutes are stunning, as is Natalie Portman's performance.  I could feel her pain and uncertainty.  I went away thinking that it was the best performance, and transformation, since Meryl Streep in \"Sophie's Choice\".  And, having had a schizophrenic child in my household, complete with his delusions of grandeur and hallucinations, I can completely understand the darkness in Portman's character. When she said, \"I want it to be perfect\" I knew her at once, without the obvious bulimia or scratching or delusions.  The people around her had tortured her into becoming the caged animal waiting to break out.  Bravo!",
      "total_reactions": 3,
      "user": "ranmancarmel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Beautiful. Real. Spellbinding and intense. Natalie Portman is timid and fragile and utterly hopeless incapable of dancing the Black Swan. The stress and strain of the dancing world is deeper the physiology...it's a state of being - in perfection. The quest for it is at the loss of so many other things. A loss? Nay, perhaps a worthy compromise. Black Swan is not the fragile, delicate ballerina movie you might expect. Nearer is the comparison to The Sixth Sense, with gripping ferocity amidst bashful vulnerability.",
      "total_reactions": 2,
      "user": "Critic_Please"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Black Swan offers a bizarre and overwhelming look inside the mind of a psychotic artist. Viewing the film leaves any perceptive audience questioning what caused the heroine to become so twisted, and what causes her sadistic supervisors to keep believing in such a frail and inept person. Some scenes fit into the clichÃ© horror film, some others are so psychologically disturbing it leaves you breathless. Natalie Portman performs greatly accurate and clearly crosses boundaries in her acting the script would've otherwise kept lesser great actresses from. Mila Kunis is an unusual but perfectly fitting addition to an artsy, brilliant cast. In conclusion, the movie is scarier and more surprising than it's beginning promises - a must see, but not for the weak hearted.",
      "total_reactions": 1,
      "user": "Yumny"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "While I thought this movie was very good [and intense], I would never watch it again, or own it on DVD. There are only so many manic depressive ballerina movies a person could handle.",
      "total_reactions": 1,
      "user": "jrmint"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I admit, that as a teenage guy it was a little hard to watch a movie that focused on dancing. But as it turns out this movie is quite good. The entire movie has an art type feel to it, which im sure the movie was trying to portray. The symbolism is beautiful and im not surprised to see it nominated for best picture. (though it wont win)",
      "total_reactions": 2,
      "user": "BathtubTom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "If someone stole the whole show was Natalie Portman. She delivers the performance of a lifetime. Forget \"Star Wars\", \"V for Vendetta\" and keep a bit of \"Leon\" and \"Garden State\"... You are not the best young actress at the moment but you are definitely on the top one! If Natalie doesn't deserve an Oscar for her portraying of Nina Sayers then nobody ever did. This movie takes the story of dual personalities to a whole new level of unknown, which is beautifully portrayed by Natalie Portman, taking her to a spot where the Oscar doesn't look like just a dream anymore. It's a touching story, based around a small group of characters, and that's a place where Aronofsky is at his best (i.e. Requiem for a dream). Also, it would be unfair to forget Vincent Cassel, who showed himself in a totally different manner creating a strong, patriarchal character. In the end, this work of art is worth every single dollar and minute you spend on it. It's a guaranteed classic!",
      "total_reactions": 1,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "One on the most disturbing movie i have ever seen! Portman it's just amazing. Darren Aronofsky made a wonderful direction with this movie. The music of clint mendell its probably one of the best soundtrack of all times.",
      "total_reactions": 2,
      "user": "Mr_dYb"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "I just want to say this is my inaugural review on Metacritic. As they say in the sports radio world, I've been a \"longtime listener; first time caller.\" in regards to Metacritic. But, you know, with reading and writing. Having said that, let me say this about Black Swan Here's my review... -------------- Black Swan. \"The gripping tale of a schizophrenic's quest for the ultimate orgasm.\" I just don't know how else to tagline this movie. Portman is transcendent in this deeply psychological role. I don't see her losing the Best Actress Oscar. And Mila Kunis holds her own -- and some of Portman's -- in a deftly turned supporting performance. The music is beautiful, as would be expected, and the film gives you a greater respect for ballerinas as expert craftswomen. At least, it did for me. The story itself seems more a lattice upon which the performances flourish like ivy, as opposed to the characters driving a strong, riveting story. This may be a disappointment to some who desire a more traditional three-act story with a clear resolution. And one last thought. Kudos to Winona Rider for her particularly dark, near-cameo turn as a past-her-prime prima ballerina. Quite riveting. My Verdict: Three and a half Stars -------------- Check out my taste in movies here: http://bit.ly/MyMovies",
      "total_reactions": 2,
      "user": "Efreet69"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This is the type of movies that elevates cinema as an art to a whole higher level. There's been a very few in the last decade, and \"Black Swan\" is one of them. It's transcending. It's something else. Makes you remember/realize how powerful movies can be and how they can truly be masterpieces and have a life and a full universe of their own. As disturbingly beautiful as Munch's \"Scream\" is.",
      "total_reactions": 2,
      "user": "Ufandetchitchu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "One of the best movies I have seen in a while.  The directing was absolutely spectacular, and the way the main character's transformation mirrored the storyline of Swan Lake was excellent. Portman is absolutely deserving of an oscar for her performance.",
      "total_reactions": 2,
      "user": "BShea423"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is one of the best. It has suspense from beginning to end, the actors are great. I love these thrillers. History is great, the script is great. The soundtrack of a touch of suspense in the songs. One of the best films of 2010 to 2011.",
      "total_reactions": 2,
      "user": "CarlosAugusto15"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best movies of all time. Natalie is great, Aronofsky in his best moment, everything PERFECT! And the OST is amazing, i can't stop listening that.",
      "total_reactions": 2,
      "user": "Phelipe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Great acting and storyline had twists and turns that kept me interested throughout the whole film.  The best movie I saw all year.  Great to see an original movie, when all that is being put out right now is sequels and remakes of a TV shows from the 80s.",
      "total_reactions": 2,
      "user": "dlynch18"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "An amazing movie with the best spectacular performance of Natalie Portman. It's another good movie by Aronovsky. Undoubtedly worth seeing. Go to the cinema!",
      "total_reactions": 2,
      "user": "steve_stiff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I LOVE J/PhycoLogical Horror!",
      "total_reactions": 1,
      "user": "Dylanmc12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "While I'm a bit appalled by its premise, Black Swan is embracingly intense, indescribably frightening, and seductive, with wonderful performances by Natalie Portman and Mila Kunis.",
      "total_reactions": 1,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "With echoes of â",
      "total_reactions": 2,
      "user": "JuanmaFernandez"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "It pretty obvious whats going to be the ending, but its beautifully delivered. The actors are beyond expectations. Great production team. The dialogues are poor in a few parts. One of the best movies i have seen. Worth watching.",
      "total_reactions": 2,
      "user": "Juggernaut"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is easily the best of the year. The film is as intriguing as a Christopher Nolan film and as beautiful as any movie. Natalie Portman is at her best in this movie. Mila Kunis showed us that she is able to do more than just dumb comedy television. It seems that this could be the jumping off point for a very long career for a very talented actress.",
      "total_reactions": 2,
      "user": "timmcd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "This is Natalie Portman's best role, period. She nails her role as a tortured ballerina that is slowly losing her mind. The plot isn't extraordinary, but it is still griping from beginning to end. The music and cinematography are absolutely beautiful. It was thrilling and many times gave me a chill. There were multiple times where I cringed at what was occurring on screen. When I first heard about this movie, I thought it was going to really about ballet, and it did not seem to interest me that much, but it is far from it. It involves ballerinas, but it is more about being able to be a little crazy to reach artistic perfection. It was thrilling and occasionally scary at parts, and I definitely believe that Natalie Portman deserves the award she received.",
      "total_reactions": 1,
      "user": "Wheezy247"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Great movie in a bad year for movies. I think 2010 was just a very bad year for movies and that just helped to make this movie look better than it was. I'm not saying it was a bad movie, I'm just saying that this year in movies is making it look better then it really is.",
      "total_reactions": 1,
      "user": "highwiredays"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I'm a very picky person, and I only have a very short list of mives that are my all time favorites, and not is Black Swan in that list, but it tops off that list. It is simply the best film I've ever seen. Number one Natalie Portman was phenominal in her role as Nina. It was a very hard role, and she had it doen to a T.  She totally desereved her Oscar. The real star though is Darren Aronofsky. His direction in this film was absolutley breathtaking. He is one of the best filmmakers left in Hollywood. His movies are always good, if not great. The way he directed this film was a spooky and creepy. The way the classical music was used in this film was absolutley genius. The cinematography in every scene was excellent. It created the tension for the film and never let you go until the last moment. The use of black and white as symbolism was also a very good mood and the love scene between Natalie Portman and Mila Kunis was beautiful. It wasn't gratuitous or exploitative. It was forced or thrown in. It went with the movie.  The film creeped me out, it had at the edge of my seat and at that final moment, it had me tearing up. Why didn't this movie win any more Oscars? It was absolutley perfect. This film stayed with me even after I watched it and I have a feeling that it will stay with me for a long time.",
      "total_reactions": 1,
      "user": "schmageggey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Just... perfect.........................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
      "total_reactions": 1,
      "user": "jacobo23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "10 because watching it at an independent cinema about a month after it released was the best cinema experience i've had. If this film was watched at anything less than a home cinema, it wouldn't have been anywhere near as enjoyable.",
      "total_reactions": 1,
      "user": "farlcoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Natalie Portman deserves a lot of props.   she was excellent in this film.   it was gorgeous to look at.  the ending was the best.  it was acted to perfection by Portman.   the choreography was good.  Natalie Portman deserved the Oscar",
      "total_reactions": 1,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "One word describes the entire film phenomenal !!!!  I loved the cinematography and the fascinating plot that keeps you on the edge of your seat ,and left you craving to perceive what was approaching next . This  film easily sucks you in and won't let your interest vanish.",
      "total_reactions": 1,
      "user": "ImmortalGeorge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Definitely more a ch... err woman's flik, but I still enjoyed it.",
      "total_reactions": 1,
      "user": "randomdude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "I finally saw this movie recently.  If I were rating this on a scale of ballerina/dance movies, it would get a flawless 10 out of 10 score.  I never would have thought that a ballerina/dance movie could be this interesting.  A lot of the credit goes to Natalie Portman, who is phenomenal in this movie.  All that being said, as a movie, it's just pretty good.  It simply wasn't entertaining enough, and there were too many scenes that didn't seem to have much of a point.  Worst of all, I didn't feel much of a connection with any of the characters (as good as Portman was).  I've heard some people compare this to the Wrestler (which seems pretty fair).  The difference between those two though is that Mickey Rourke's character seemed so much more human than Portman's character.  It's pretty hard to really like Portman's character in this, considering she's a borderline pyscho.  Decent movie, overhyped, probably won't see it again, but don't regret seeing it.  Certainly gets points for originality.",
      "total_reactions": 1,
      "user": "keep_yr_bias"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "This is the most OVERRATED movie of 2010, it has pretty bad picture, the story was kind of interesting but at the same time it make me think that it was just someone's wet dream brought to the big screen. It has a very bad ending too. Couldn't see the artistic part of the movie. But it may be a good option to watch on a weekend if you couldn't find anything else on the T.V.",
      "total_reactions": 2,
      "user": "kublay0880"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "sorry to break it to you fan boys but this movie is overrated  the story is confusing  Natalie Portman  performance was solid but that can be said about anyone that will take her part in the movie  the writing was awkward and don't even get me started on the homosexual parts of the movie.",
      "total_reactions": 2,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "I really enjoyed this movie. I am now a fan of Natalie Portman - who played both naughty and nice in the same movie pertaining to her actual role as black swan. The movie left me confused in many parts but I do understand its use of psychology of those that delve into perfectionism. This movie was not something I looked forward to watching - but I'm glad I did.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "Even though it starts out bland the latter part really digs into me with its disturbing imaging and artistic nature. I was hoping for the thrills to come sooner and I was just about to walk out when all of a sudden, I see Portman run into Kunis' arms. Things got really interesting after that. While not one of the greatest movies of all time it is still one of the best I've seen so far this new decade.",
      "total_reactions": 0,
      "user": "percy972"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Natalie Portman did a great job portraying this insecure, shy, wanna-be-perfect ballerina. Her performance was tremendous and Oscar - worthy. this was her role and she will be remembered by it. I won't be surprised if she wins an Oscar for best actress. Honestly i want her to win. I' ve never saw her this perfect. She gave her all for this movie, and she killed it! A great film, definitely a must-see.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I found the movie to be artistically good ,scary ,disturbing scenes at times but over all a great performance from Natalie Portman. Would I say is it a movie to watch again I would say less likely",
      "total_reactions": 0,
      "user": "thystrif"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Darren Aronofsky's companion piece to The Wrestler is one of the most elegant, disturbing, striking and unique films in recent memory, pushing the boundaries of what the public is willing to pay for. Sure, the \"indie\" cinema has been making movies somewhat akin to this for a while, but finally, the viewing public cared. This is not Dogtooth or a Michael Haneke flick, sitting gleefully in its inaccessibility. Aronofsky invited the average audience into his dark vision, and created something beautiful and bleak.",
      "total_reactions": 0,
      "user": "NKOAS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "I really, really enjoyed this movie. It's a masterpiece, one of the best movies in the last decade. It's all about the heroin's personality, feelings, reactions and interactions with other characters; which are all just so beautifully portrayed by Natalie Portman, she really deserved that Oscar. The whole movie is centered on Nina and you experience every emotions with her, which is very stimulating. Truly a masterpiece. A work of art. I can only hope you get to feel the way I did. Otherwise, well.. you'll end up putting a bad score on it.",
      "total_reactions": 0,
      "user": "Roeyl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Black Swan is an inscrutable film that makes for uncomfortable viewing. It's actually a little harrowing in it's own way, sporting a type of psychological darkness that both repulses and intrigues. The film is excellently acted across the board and throws up a whole bunch of unhinged surprises. Black swan does wear it's obtuse tendencies feverishly on it's sleeve, thus it tends to bury the needle a touch too far into the pretentious. Overall, Black Swan is a good film and one that will baffle and inspire debate. A strong stomach is required!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "A deep and passionate ride that tickles your mind with a psychological twist. BS might cast level 5 confuse on you if you don't give it your full attention as it is compelling as it is bewildering.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "At first, I was hesitant towards this movie seeing as melodramas and ballet dancing aren't really my thing. But when I saw it I thought it really was rather good, at least in the wonderfully directed and choreographed dance sequences. It also makes a very effective thriller at times, with some horrific hallucinations that actually shocked me. The acting is over the top and the plot is very overly complicated and confusing, but if you like classical music, ballet and drama at its highest level, go see this film.",
      "total_reactions": 0,
      "user": "TheNewSpielberg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "MMM...Psychological thriller. What great cinematography. What good handling by Aronofsky of the duality of self, of good and evil, of black and white and gray. I think that there are very powerful moments in the film, and the calmer moments are never calm, but in contrast to their counterparts, calm-er.",
      "total_reactions": 0,
      "user": "POV"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Considering my disinterest in ballet this movie kept me interested until the end. Brilliantly directed with some excellent camera work it is an interesting tale of a ballerinas slow degradation into insanity. May not be for everyone but it is well worth watching",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Natalie Portman certainly deserved the Best Actress awards because her performance in this film was superb. The whole story was just fantastic, it has depth and excitement. I can really feel the mood of the film which makes me ecstatic. This is just a fantastic film..........",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Black Swan, as has come to be expected from Darren Aronofsky's films, is not an easy watch. It's multiple layers of reality, heady themes and dark, surreal imagery may put some viewers off. If you enjoy challenging, original filmmaking that works on multiple levels, then Black Swan could be the ideal film for you. There is no weak link in the casting. Natalie Portman quite rightly won the Academy Award for Best Actress, and her powerful and intricately complex performance as the massively paranoid ballet dancer Nina Sayers will remain with you long after the end credits roll. Mila Kunis, Vincent Cassel and Barbara Hershey all leave their own marks on the film as Nina's rebellious but talented rival Lily, her womanising director Thomas and her over-protective, domineering mother respectively. Also worth a mention is Winona Ryder playing Beth MacIntyre, a huge ballet star forced into early retirement and replaced by Nina - it's a relatively small but crucial role, and Ryder's best performance in years. The film looks fantastic, with Matthew Libatique's cinematography and Andrew Weisblum's editing evolving with the mood of the film - as story becomes more fractured and erratic, the camera movements become less smooth, the editing choppier and more jarring. The style of the whole film is designed to create a steadily increasing sense of unease, so as Nina steadily loses her grip on reality, so do we as viewers. We don't quite know what is as isn't real from about halfway through the film, so much of it is open to interpretation. My only gripe is in the final act where Nina appears to physically transform into a swan with the assistance of expensive-looking CGI. I almost wish Aronofsky saved his money here, as the simpler visuals he employs are far more effective (Portman's reflection moving of its own accord is a far creepier way to represent Nina's fractured identity as a result of her obsession with the black swan role than her physically sprouting feathers). Despite this minor annoyance, Black Swan remains an extremely powerful, intelligent and thought-provoking film that you'll be hard-pressed to forget.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2016
      },
      "score": 2,
      "text": "So depressing, I gave 2 stars for the actors great performance    .",
      "total_reactions": 0,
      "user": "jeanphilt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Mila Kunis steals the show, to be honest... Her character was easier to love but that's not to diminish Natalie Portman's performance, which was remarkable. The art direction and cinematography was brilliant, as was the directing.",
      "total_reactions": 0,
      "user": "DylanVDW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "A great theatrical experience. From the very first frame I was submerged in this world and more importantly, inside Natalie Portman's performance which is what really tells the story. She is more telling of her character when she is not talking, I believed her every second she was on screen. I sympathized with her and went through all the dark emotions played out with her. She shouldn't get all the credit though. Darron Aronofsky does a tremendous job with the camera and the visuals, all subtle and eerie. He has created a great dark fantasy.",
      "total_reactions": 0,
      "user": "AVCITY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I wanna start by saying that this is probably, the best movie i've ever seen in my entire life. I mean Natalie was PERFECT, The screenplay is amazing, the cinematography is amazing, everything is perfect about this movie. I can't think of anything bad to say about this masterpiece. Darren Aronofsky is definitely one of the most talented directors in the movie industry. Even Vicent, Barbara, Mila and Winona were great in this movie. Amazing, amazing talent. This is the one that should've won Best Picture, instead of \"The King's Speech\".  I felt everything while watching this movie. I highly recommend it!",
      "total_reactions": 0,
      "user": "DanielaNovo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I really enjoyed this movie.  I would see it again. I always like Natalie Portman in any film. ......................................................................................................................",
      "total_reactions": 0,
      "user": "micamouse983"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Two things are vital in pulling a movie so histrionic and artsy off. The first is directing, where Aronofsky displays his natural talent as a director, as he weaves the scenes flawlessly, in an odd combination of lo-fi hand-held naturalism, and hyberbolic artsiness. He is a true visionary. The second is the performance by the lead, Natalie Portman, which, needless to say, is a revelation. Many will criticize it as being over-the-top, which it certainly is, but it seems natural all the way through, largely due to her obsession with the art form. And that is the underlying terror in Black Swan. The need to unleash your dark side to master art, but being afraid of what might come out.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "It's a truly masterpiece.  Aranofsky's amazing direction is aided by a good supporting cast, a cinematography of highest level and a brilliant, terrific and memorable performance by Natalie Portman.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Depuis son rÃ´le dans LÃ©on, Natalie Portman n'a plus eu de chanche pour nous Ã©blouir. Avec Black Swan, nous pouvons admirer cette actrice une nouvelle fois, Ã  sa juste valeur, dans un film en tout point prenant, sensuel et superbement mis en scÃ¨ne. Drame, \"Ã©rotique\", thriller, horreur...presque tous les genres se sont donnÃ©s rendez-vous pour faire de cette oeuvre l'un des meilleurs films de cette annÃ©e!",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "There are few directors working today who are as talented, original, and fearless as Darren Aronofsky.  From Requiem for a Dream, to the underrated The Fountain, to The Wrestler, he is constantly pushing the boundary and creating compelling works of art that will stand the test of time.  Black Swan is one of his crowning achievements.  It is such an odd blend of moods and textures, styles and images; it is a thrilling, bold statement about art and madness.",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Every Scene of this film were so intense, but in a good way. She was always trying to reach perfection, and in the whole film there's a balance between reason and emotion, and Nina couldn't reach both, until the end of the movie, when she says \"I was perfect\". So overall i though the movie was amazing, all the cast was fantastic, especially Natalie Portman, Mila Kunis and Barbara Hershey, but this was really Natalie's biggest performance in her career, her expressions, emotions, the dancing, everything, she was actually perfect, and a big thank you to Darren Aronofsky, not only he already deliver films like Requiem for a Dream and the Wrestler, now he comes with Black Swan, a Beautiful Psychological Thriller about a Ballerina who wants to be perfect (off course there's more to it), so thank you very much for this masterpiece.",
      "total_reactions": 0,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Black Swan is a disturbing and intense cinematic work that is nearly the definition of perfection. Natalie Portman's performance is simply spectacular.",
      "total_reactions": 0,
      "user": "claw01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Bizarre and frighteningly passionate, Black Swan shows signs of grace and beauty yet still shows a dark and sinister plot. Crammed with superb directorial skills along with a breath-taking and truly astonishing performance by the one and only Natalie Portman.",
      "total_reactions": 0,
      "user": "williamobrien"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Black swan is the most beautiful and interesting film of the year from a genius as Derren Aronofsky.Nina Sayers is a young professional dancer in the New York city ballet company that dreams to become the prime ballerina in the new production of the Swan lake by the artistic director Leroy(Vincent Cassel).She has an obsessive mother,Erica(Barbara Hershey), that makes her life somewhat complicated as she is driven by jealousy towards her daughter. After the former prime dancer Beth Macintyre(Winona Ryder) is forced to retire by Leroy,Nina successfully is cast as Odette,the swan queen.But a mysterious new dancer Lily(Mila Kunis)becomes her most dangerous rival.Darren Aronovsky is a master. One of the greatest director out there.His direction is visionary and everything but ordinary.The pace of the film is really engaging and the script has truly original aspects.The movie has really absorbing moments as the transformation of Nina in the Black swan and her desperation that it is difficult to not be drawn.The depiction of her obsession for the perfection and increasing mental disorder is quite fascinating.The soundtrack is outstanding although it's not original but it's taken from the musical.But it adds to the general beauty of the film and express the characters feeling and the roles they have in the story. Natalie Portman,in her first adult role,excels as the leading character.This is her most complex role and she is exceptional and her first great turn after Closer.Her Oscar Award was completely deserved. Mila Kunis is adequate to the role,but honestly I didn't catch all the praises she gained for her performance.Her role is the easiest and she is an average actress. Vincent Cassel plays \"extremely\" well the same character(that is inspired by his own personality)in every movie.That's all.And not too much I have to say. Barbara Hershey is truly a gem and she deserved more recognition for her complex role ,she is never over the top although her role could have been played with exaggeration.She is a really great actress.She should have been nominated for an Oscar. Winona Ryder,in her brief role as the fallen prime dancer,was a scene stealer.In only three scenes she is haunting,damned, desperate,intoxicated and angry and was truly mesmerizing.My vote is 10/10",
      "total_reactions": 0,
      "user": "francesco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Black Swan is dark, intense, beautifully acted and thought-provoking. With Natalie Portman's excellent performance and Darren Aronofsky's bold direction, Black Swan is one of the best psychological thrillers out there. 4/4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was certainly not for everyone. But I liked it because it was different; the story is so unique. It's beautiful yet at often times gruesome. Must see.",
      "total_reactions": 0,
      "user": "J_B"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Visceral, tragic, disturbing, beautiful, inspiring, terrifying, sexy, passionate, and surreal... Black Swan is one of my favorite films. It shook me to my core when I saw it. The ending is absolutely beautiful and had me in tears, and the score is beautiful and creepy. Portman's best film. Inspiring and terrifying on many levels.",
      "total_reactions": 0,
      "user": "Sevvy88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Great movie. It's got a lot of passion and talent on stage. I love Portman's sensibility in this film. Sometimes it seem boring or long, but it isn't. I really like it",
      "total_reactions": 0,
      "user": "brunogabriele"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "La pelicula mas impresionante del aÃ±o tanto en historia y complejidad sino tambien en espectaculares interpretaciones. Oscura, brillante, compleja, espectacular, sorprendente, magnifica y sobretodo impresionante. Natalir Portman esta espectacular uno de los mejores films del aÃ±o",
      "total_reactions": 0,
      "user": "josecastro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Such a beautiful and disturbing movie with fantastic performances by its cast. Natalie Portman is preparing for her role in Swan Lake while going through her own version and the psychological impact it has on her. I could feel the pain and suffering her character had to endure. The three characters that have a big impact on her are the director, a rival dancer, and her mother and all are key in her character's downfall. However, in the end, the one person she has to overcome is herself.",
      "total_reactions": 0,
      "user": "Zal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Darkest and most meaningful movie that I've seen up to this point. It absolutely has something new to say and it doesn't  bother the audience by old ideas.",
      "total_reactions": 0,
      "user": "houyarm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Black swan is a fantastic and dark film. the acting my Portman is flawless. A daring a film with scary moments at times but never boring. some might be turned off by the ballet part but trust me this film delivers stuff for everyone to enjoy.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "Never lost my attention for a second. My mind was so invested into what would occur next. Natalie Portman and the rest of the cast were great. It was freaky and passionate which makes it truly stand alone.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Nina Sayers wakes up in the morning and shares the marvelous dream she had with her single mother, Erica. She was on stage, performing the lead role in Tchaikovsky's ballet masterpiece, \"Swan Lake.\" Other hard-working female ballet dancers also dream of this role, and with great reason. To star in an event of this magnitude is not only to share your love for this art. It also provides an opportunity on the grandest scale to finally show the world the passion that you, for so long, spent years to perfect.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "Black Swan is a breathtaking psychological thriller. Its cast and their performances were absolutely perfect. Natalie Portman did a great job and her acting was one of the best of her career and she deserves the Oscar she won on Academy Awards. Mila Kunis gives also a very good performance. Vincent Cassel , Barbara Hershey and Winona Ryder were also very good in their supporting roles. The direction of this movie was also excellent , Darren Aronofsky gave us a great result. But this movie is so good because of its marvelous story by Andres Heinz. There's nothing else to say , all the things in that movie were the best , the story , the direction , the screenplay , the soundtrack , the cast and especially the outstanding performance of Natalie Portman came together to give us a masterpiece!!!",
      "total_reactions": 0,
      "user": "Paschalis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Wow! One of the best psychological thrillers of all time! The movie is beautiful throughout despite the dark journey it follows about perfectionism and obsession.  A movie that you won't forget.  A masterpiece.",
      "total_reactions": 0,
      "user": "wesker2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This Is My Favorite Movie Of All Time (Excluding Everything Studio Ghibli)",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Darren Aronofsky is quickly becoming one of my favorite directors and Black Swan is a shining example of why that is happening. Here, he crafts a film that perfectly fits the bill of \"psychological thriller\" as this one is absolutely terrifying at times, but always leaves you searching for answers as you are never quite certain what exactly happened. Throughout, we follow the clearly disturbed Nina, played by Natalie Portman, who absolutely kills it here. Her descent into madness is beautifully constructed and portrayed by Aronofsky as it almost makes us feel as though we are going insane right along with her. Mila Kunis and Vincent Cassel also have good supporting roles here. The only thing against this one was that it was a little slow going in the beginning, however, once it really kicks in high gear, it is completely engrossing as you follow every twist and turn and try to wrap your head around what you just watched. This film is certainly jarring and is \"perfect\", just as Nina would want. Really, this one deserves all of the plaudits it received and really lived up to the hype for me.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "I like how Aronofsky can make that depressive atmosphere in his movies and you feel that tension and constant menace all along. This one is even more a thriller rather than a drama. Very good characters by Natalie Portman, Vincent Cassel, Mila Kunis and Barbara Hershey . Also Winona Ryder made a decent job though I didn't even recognize her.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Absolutely a critic and a show, this movie it's exposing the bad and competitive side of the dance, and also showing the process of paranoia and perfectionism, and what they can do with us, great single history and message. Watch it!",
      "total_reactions": 0,
      "user": "BrunoZrZr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "This is a psychological movie. It is all within the mind, or is it? Dark, daring and incredibly well acted...this may very well be a classic one day. I enjoyed i! Great acting, script, direction. A thriller!",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Yes! Another brilliant masterpiece from director, Darren Aronofsky. For me, Black Swan is the perfect example of a modern classic film. A true piece of art, simply astounding in every way.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "How far is able to get people to achieve unattainable perfection? because in this film, Aronofsky shows us how a simple ballerina, destroys everything around it for only perfect in an innocent role (in my opinion) and white swan and the evil Black Swan in the famous production of lake of swans, but all it gives a great turn and finish destroying it completely. 'black swan' talks about what to sacrifice a performer to embody a role. Leave out the downside because the script demands it can be a way to open a Pandora's box that was better than remain under lock and key. Using all the resources of traditional horror, such as sound scares, sudden apparitions or visions, confusions  Aronofsky creates numerous situations of fear, coupled with the interpretation and dramatic context of the rest of the film, may seem out of tune. The film is borderline, and with a tap to the side, lose balance and be grotesque or ridiculous. But the movie has its own elegance in its production design, but the music reminds me a little of the music of Harry Potter, not me, I just rang me. Of course not all the music, just a song, because as the same sound with Potter, it may not be true, but that I think. We are facing a psychological horror film, a genre that I like a lot but here sule used that concept very well, the large team of writers has done an excellent job of being able, not only to portray the madness and spreading despair, but also to exploit the full potential, but without going over, though, as I say, they were close to the line.",
      "total_reactions": 0,
      "user": "forestville"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Black Swan has all the sexy hype, but it's not a finished movie. It's half baked at times. The photography is brilliant and Darren has good direction after his past films. Natalie Portman was great as Lily and Kunis as Nina. The film is visually good but the story is very cheesy. It's dark and romantic, but Black Swan holds its barriers till the end- which dissapoints. It's a twisted and psychic film. It works for the most part.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Aronofsky brings to public a film full of anguish. \"Black Swan\" is Odyssey of madness. Nina leads us to obsessive way. Since first moment, you known that Nina isn't right. It could be horror, familiar and professional pressure but Nina brings us self-destructive spiral. We are witnesses of beautiful insanity. Film is wonderful but it is not totally original. Satoshi Kon's \"Perfect Blue\" is more perfect than \"Black Swan\" although \"Black Swan\" is great too.",
      "total_reactions": 0,
      "user": "mapizarro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "Good trailer.",
      "total_reactions": 0,
      "user": "Jacobparker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Great script with a strong, engaging storyline. Excellent acting throughout but a film about a ballet dancer losing her marbles just didn't interest me enough",
      "total_reactions": 0,
      "user": "westbrook21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "Every thing about this movie is amazing, the acting is flawless, the character development feels real and natural, and the story unfolds in a darkly beautiful way. The camera shots and atmosphere are also very hauntingly gorgeous and help create the tone for the movie. This movie is definitely worth your time and is without a doubt one of the most spectacular movies I have ever seen.",
      "total_reactions": 0,
      "user": "Johnluna1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "This film was extraordinary like Requiem was. Natalie Portman was more than fabulous and gorgeous. The plot is really smart and first-saw. Mila Kunis was great too. I liked the ending and that twist that it had. Black Swan is one of the greatest thriller ever made in the history of cinema and i think it's a masterpiece",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Dark, frivolous, psychotic, schizophrenic, ironic, surreal, astonishing. A great allegory. A complete success regarding filming, scenes, scenarios, performances, plot and twists. A crazy precious pearl. A slap in the face and mind.",
      "total_reactions": 0,
      "user": "jotaeseche"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Buenísima película. Excelente trabajo de todos los actores y actrices, en especial de Natalie Portman y Mila Kunis. Una excelente película para ver, entretenerse y pensar. Recomendable",
      "total_reactions": 0,
      "user": "alonsomerin0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Disturbing. I questioned my own sanity after watching this. I started doubting every single reflection in the mirror, in the bathtub. This movie is hauntingly realistic, with Natalie Portman's acting dragging me into this wormhole.",
      "total_reactions": 0,
      "user": "philosophorse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Black Swan was a pretty good movie, very well acted, but it was so disturbing at times that made me have to take a breather because it was THAT disturbing.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "Not a type of movie that I would typically enjoy but I did enjoy this one. It was really dark and played with your mind a lot which I though was really well done. Good acting by all makes this an enjoyable watch.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "A dark psychological thriller that orchestrates a unique plot and theme, a great cast from Natalie Portman and a great execution from Darren Aronofsky, for this chilling nightmare.",
      "total_reactions": 0,
      "user": "SushiStoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I don't even know where to go with reviewing this movie. It's a dark, thrilling, disturbing, and even terrifying movie that succeeds primarily because of Natalie Portman's fantastic performance in both acting and dancing. Black Swan begins as a simple drama about a ballet dancer that just wants to succeed and get the leading role in Swan Lake before taking a very dark turn into a disturbing horror film about how this ballerina completely loses touch with reality and delves into a living nightmare. Black Swan is grotesque, beautiful, and dramatic all at the same time.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Natalie Portman is very good here, as is Mila Kunis, but unfortunately I just couldn't get into it. Just like ballet in real life, I just have no interest. I did really like the cinematography though.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "I know that this is late and all, but after watching this movie; it completely blew my mind. The direction, the imagery, the performances, the classical musical score, and the cinematography is just absolutely amazing. And let's try not to forget Natalie's performance, her performance is just brilliant...",
      "total_reactions": 0,
      "user": "LatinCritic13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Imagine being so lost in a movie that you are the person there, the things they face you face and what happens to them happens to you. Such is the life of Nina Sayers, the Swan Queen. We're so immersed in her world that we don't know which way is up, which way is down, and we certainly don't know what's happening to her and which elements of the ballet are in her head. We watch her spiral into darkness, a place where she abandons her old life and the person she was–gives it all up for this role that consumes her and really transforms her into the Black Swan. She wants perfection, she wants to be this person so badly that she turns into that person.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "\"Black Swan\" is a film that leaves you with intrigue in every part of its plot. Natalie Portman basically Pike in this great film, with great scenes that remain in the memory and a very strong rivalry between protagonist and antagonist, in addition to a distinguished presentation of \"El Lago de los Cisnes\", is one of the best films of drama I've ever seen",
      "total_reactions": 0,
      "user": "thecriticboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "The Black Swan, as a film, is finely crafted. I really enjoyed the way it was shot, and also the nice cuts and effects. The story is easy to follow and has strong pacing. Natalie Portman makes the lead work as this crazy yet sympathetic character. The film is as simple or as complex as you like, and I recommend it.",
      "total_reactions": 0,
      "user": "RobertBrogan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2015
      },
      "score": 1,
      "text": "worst movie i've ever seen in my whole life!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! it has lots of disgusting shows.",
      "total_reactions": 0,
      "user": "Noura"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "First time I saw this movie I had a very good impression. A few years later, someone told me to watch an animation called Perfect Blue. I am not a huge fan of animated movies, but this one is very intriguing! More interestingly, it resembled Black Swan quite a lot for me, but it was from the 1990s. Then I watched Black Swan again and, oh my god, it is such a close adaption (not to say a rip off with one mask or two).  However, the way the conflict wraps up in the animated movie is a thousand times more twisted and the main character is so much more profound, that I desired that Black Swan was just a self-aware live action adaption of Perfect Blue. I do like the ballet better than the background context used in Perfect Blue though.",
      "total_reactions": 0,
      "user": "TLHG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Black Swan usually just combines best moments from any kind of movie and call it a loving movie filled with absolute experiences from many emotions. Don't miss this at all.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}