{
  "mc_avg_user_score": 8.3,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Blackfish",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 100,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "Director Gabriela Cowperthwaite creates a fascinating character study of Tilikum, part of a revered species without a single confirmed kill of a human in the wild. Captivity is where Blackfish's evidence continually points the blame for Tilikum's deadly behavior."
    },
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "For the most part, Cowperthwaite keeps the preachiness in check, letting the scientists, former SeaWorld trainers and other witnesses tell it as it is. Indeed, the scary training scenes - uniformly gripping - do most of the talking."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "It’s true that the number of whales in captivity isn’t huge. But they’ve now become the mightiest symbols of our cultural hubris — of our inability to manage creatures we have the power to capture and imprison. It’s a metaphor for the ages."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 100,
      "summary": "An extraordinary, must-see examination of what humans do to killer whales so that these amazing creatures can become one more entertainment."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 100,
      "summary": "Righteous, captivating and entirely successful as single-issue-focused documentaries go, Gabriela Cowperthwaite’s film draws on startling video footage and testimonies from former orca trainers, building an authoritative argument on behalf of this majestic species."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 91,
      "summary": "The movie makes a strong case against the captivity of killer whales under sub-circus conditions, but the stance is made even more horrifying because so little has changed in the history of the organization. Blackfish is less balanced investigation than full-on takedown of a broken system."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 90,
      "summary": "Cowperthwaite builds a portrait of an intelligent but profoundly traumatized animal who was taken from his family in the North Atlantic as an infant, and has been driven to anger, resentment and perhaps psychosis after spending his life in a series of concrete swimming pools."
    },
    {
      "critic": "Read full review",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 90,
      "summary": "Unapologetically designed both to inform and affect, Gabriela Cowperthwaite’s delicately lacerating documentary, Blackfish, uses the tragic tale of a single whale and his human victims as the backbone of a hypercritical investigation into the marine-park giant SeaWorld Entertainment."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 90,
      "summary": "The movie is revealing, wrenching, and important, a reminder that what feels wrong in our gut—the effort to turn free-roaming and unknowable beasts into caged vaudevillians—is always worth investigating."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 90,
      "summary": "Focusing on the notoriously aggressive orca Tilikum, this gripping film presents a persuasive case against keeping the species – and by extension any wild animal – in captivity for the purposes of human entertainment."
    },
    {
      "critic": "Janice Page",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "What’s on camera is both damning and expertly assembled, a filmmaking effort worthy of standing with 2009’s Oscar-winning documentary about dolphin abuse, “The Cove.”"
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "It’s upsetting and scary to watch the footage of orca attacks collected in Blackfish, a damning documentary about the treatment of the animals by marine parks."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "Very few of us would like to think about the physical and emotional toll that life in captivity takes on these magnificent creatures. Gabriela Cowperthwaite's powerful, heartbreaking, and beautifully crafted documentary, Blackfish, forces us to do just that."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 88,
      "summary": "This is as thorough a take-down of a business and its practices as you’re likely to ever see."
    },
    {
      "critic": "Kimber Myers",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 83,
      "summary": "It succeeds not just because of the gripping footage and troubling stories of the spectators and trainers close to the incidents, but also because it consults experts in the field who offer insights into killer whales’ biology and psychology."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Blackfish is a disturbing movie, one that will make you rethink parks like SeaWorld and their value."
    },
    {
      "critic": "Jenny McCartney",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "As an indictment of the industry, this is strong stuff."
    },
    {
      "critic": "David Parkinson",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Impassioned and disturbing, this documentary matches \"The Cove\" for marrying cool intellect with real fire."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Like a more obvious underwater twist on Herzog’s \"Grizzly Man,\" Blackfish presents a persuasive, passionate argument: wild nature’s right to freedom demands respect, cock and all."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "More persuasively still, Blackfish — an Indian name for orcas — argues against the very concept of quasiamusement parks like SeaWorld that turn giant creatures meant for the wild into hemmed-in, penned-up entertainers."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "Blackfish, a troubling exposé of Sea World’s hazardous entertainment trade, does much to restore a realistic sense of danger, interviewing former park workers who detail their shoddy, nonscientific training, and chronicling the much-suppressed history of whale-on-human violence."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "Today, 54 percent of Sea World’s whales have Tilikum’s genes, which is a terrifying thought."
    },
    {
      "critic": "Bill Stamets",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "Dispiriting as Blackfish is at times, it offers beautiful advocacy for orca freedom. Anecdotes and data indicate these mammals are highly sensitive and social. Treating them as we do for our entertainment and profit is unconscionable."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The film may be depressing. But even with a terrible, watery musical score, it's also good."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "One glaring question the film doesn’t raise: Why, given his history, is Tilikum still entertaining in sea parks?"
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "Forget \"The Conjuring,\" Blackfish may be the scariest movie around."
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The Frankensteinian rebellion of orcas against their corporate captors turns this doc into a sort of showbiz horror film."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "The film, it should be said, does not blame Tilikum for his actions. It posits instead that, like a disenfranchised youth driven to a life of crime, Tilikum is a product of his upbringing."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "Taken as a whole, Blackfish does an admirable job of preaching without force-feeding, seamlessly blending opinion with reportage, and addressing its central issues from enough angles to make a series of end-runs around dubious viewers."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "Blackfish, named after the Native American term for orcas, remains decidedly one-sided. But when that \"side\" is such a vital, convincing proponent for the greater protection and understanding of such evolved and majestic creatures, it can't help but win."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "It’s unlikely anyone who sees Blackfish will be trekking to Shamu Stadium this summer."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 67,
      "summary": "Blackfish’s strongest argument against the existence of parks like SeaWorld is how much more gorgeous orcas look in the open ocean than leaping about an oversized swimming pool. And the audience won’t get soaking wet watching them frolic in movies, either."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "As more than one orca expert points out in the film, when you take a creature born to roam thousands of miles of open water and stick it in a pool to do tricks, there’s going to be some behavioural blowback. In Tilikum’s case, it’s actually described as a form of induced “psychosis.”"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "An effective piece of filmmaking.   I now want to do something to help these beautiful giants.   There's so much disturbing evidence displayed here to show the cruelty inflicted on these creatures, as well as  a real understanding of the orca's emotional intellect and sense of family,  that  you can't walk away from this and not be affected.  Which is what all good documentaries are supposed to do.  Well done.",
      "total_reactions": 4,
      "user": "jfk049"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Whether the cam footage is exciting enough to be in a movie is beside the point, or goes against it. Blackfish builds a strong case of something that hasn't been to my attention at all, exactly because it's drowned out by showbiz. As a portrait of a huge wild animal, it works well too. The focus on the trainers' portrayal of the whales makes for an intimate and passionate retelling of events. Recommended.",
      "total_reactions": 2,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "To be honest, this documentary proved to be much more political than what the brief summaries provided on the streaming website let on (I watched this on Netflix), so a word of caution to those who thought it was simply another nature documentary. It's pretty narrow in terms of opinions provided on the subject, providing very little counterargument, but is informative and  no less eyeopening to what goes on in the blackfish-based theme parks.  You don't need to be a die hard animal rights activist to sympathize with the cases presented in the film. I work at a wildlife rehabilitation center, and it's sad to say the killer whales aren't just an isolated case; we can apply the same troubles to just about any other facility that handles wild animals and other exotic species that were never meant to be put behind plexiglass and bars. While the argument it tries to make has its merits, it comes off a tad idealistic with unrealistic solutions to a greed-riddled world.",
      "total_reactions": 2,
      "user": "cmyk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Explores the specifics surrounding the OSHA/Seaworld trial thoroughly and brings to light issues I didn't even know existed. Interesting and enraging story that really changed my viewpoint on parks like Seaworld.",
      "total_reactions": 1,
      "user": "Kelliente"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "People need to understand that these animals have a natural instict and they are very powerful as well. They are the rival of the great white for god sake.",
      "total_reactions": 1,
      "user": "aGUYtoREMEMBER"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "excellent documentary exposing the harsh brutality of SeaWorld who ruthlessly abuses Orcas and hides what they are doing to the public. Reveals how SeaWorld negligently exposes naive trainers to fatally dangerous situations in which several young trainers have lost their lives.",
      "total_reactions": 7,
      "user": "swetepi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Another case of people interfering with and destroying nature in the name of greed. People never cease to disgust me. With our apparent intelligence what other reason would there be to imprison such beautiful, intelligent and wild creatures unwittingly submitting them to both physical and mental abuse. The end result, of course, ends in disaster for the humans. This doc is compelling and at times grippingly told and whilst heartfelt there is a certain naivete to the good intentions of the staff of these amusement parks who are as culpable for the whales suffering and the ensuing tragedies as indeed are the captors and, ultimately, the audiences of these questionable attractions.",
      "total_reactions": 3,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "This is a devastating look at how these Killer Whales are treated.  This was a difficult watch with many tears shed for these majestic creatures.  I know this has affected Sea World's business and rightfully so.  A-",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "One of the fine documentary with a fine message. Snubbed from the Oscars and I felt really bad for that. It should have been in there compared to the other nominees, including the winner. This was like another 'The Cove' which spotlights the human torture to the non human species. This documentary is not for entertainment, but which brings the public awareness of the serious issue that still taking place around the world in different venues.",
      "total_reactions": 2,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Excellent documentary that will make you so angry you might go out and steal a whale Free Willy style. It is shocking the extent to which Sea-world have gone to lie and cover things up, some may say it is unbalanced as no official representative from Sea-world responds to criticism but the filmmakers have approached them again and again with no response. Hopefully this film will deal a blow to their profits which is the only way to truly get back at them.",
      "total_reactions": 1,
      "user": "Interpaul"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "This film was a huge disappointment. It lacked a clear focus and was not at all what it claimed to be. This seems more like a sideways attempt to sling mud at SeaWorld in a circumferential manner, though it seems this claim may have some merit (there seems to have been some deliberate or negligent mismanagement). This film is nothing like the great Planet Earth series.",
      "total_reactions": 8,
      "user": "bwall-e"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "An insightful look into the disturbing treatment of whales and sea-life at SeaWorld over the past thirty years. We are captivating and easily feel the cruelty inflicted on innocent animals.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Whether through brilliant editing and brilliant subject selection or through genuine portrayal, the trainers come off as wholly sympathetic.  And it is clear that many of them are distressed over the treatment of the animals in their care and over their own participation in the exploitation of killer whales.",
      "total_reactions": 0,
      "user": "Corvin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Blackfish certainly lays down a compelling argument against keeping Orcas in captivity, and I was pleased with the filmmaker's decision to give some former trainers with opposing opinions a bit of screen time.",
      "total_reactions": 0,
      "user": "ambender"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "What I liked:",
      "total_reactions": 0,
      "user": "Dymphna2102"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "A very well made, well-written documentary that only comes short in that it comes across as a political piece rather than a balanced report. The filmmakers pushed to dig out the full story of Tilikum and clearly tried to get all sides of the story on the table, so that effort has to be praised. There is also incredible footage of the orcas in their natural habitat providing stark contrast to enclosure life.   But what is lacking is a clear reckoning of the value Sea World brings to conservation and to animal wellbeing outside the tank.  Agreed we should free the orcas (or put them in open water enclosures), and certainly let's tighten OSHA regulations.  But without a more balanced view of the contributions these parks bring to animal welfare it comes across as a shrill piece of Hollywood activism, leaving the viewer to wonder if everyone had a say. That's unfortunate, because this is a very good film.",
      "total_reactions": 0,
      "user": "uncatena"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "The documentary, Blackfish directed by Gabriela Cowperthwaite was a great film that",
      "total_reactions": 0,
      "user": "dsierras"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "'Blackfish' is a chilling and disturbing, if not, revealing, documentary about how these Killer Whales were forced into being the main attraction at Sea World. Anybody who is not aware of these incidents where many trainers were killed by these mistreated Whales should see this before taking a trip to a place like Sea World. It's a documentary that makes you think, and one that you will never forget.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2017
      },
      "score": 10,
      "text": "An excellent and riveting documentary that covers all bases - that's all that there is to say! I really enjoyed the watch and it made me think and contemplate.",
      "total_reactions": 0,
      "user": "Henry_b1"
    }
  ]
}