{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Bless Me, Ultima",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 8,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 100,
      "summary": "Carl Franklin's film is true to the tone and spirit of the book. It is patient and in no hurry. It allows a balanced eye for the people in its hero's family who tug him one way and another."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 90,
      "summary": "A deeply satisfying feat of storytelling, Bless Me, Ultima makes a difficult task look easy. It combines innocence and experience, the darkness and wonder of life, in a way that is not easy to categorize but a rich pleasure to watch."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "Writer-director Carl Franklin offers up a tone of heightened reverence that weighs down the material, but there are small, lovely moments when the magic realism approaches the magical."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 75,
      "summary": "The movie is at its best when it’s at its smallest: when Ganalon quietly watches Colon coax a dying young man into vomiting up his “curse,” or when Ganalon is getting laughed out of his classroom because he has a burrito in his lunchbox instead of a sandwich."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "This material would never have attracted a major studio, so Christy Walton — heir to the Wal-Mart fortune — financed the picture herself, not because of any desire to become a movie mogul but simply because of her passion for the novel. She allowed the filmmakers to work without major stars or obvious commercial hooks added to the story. Although the film doesn’t always sustain dramatic impact, its fidelity to the spirit of the novel is impressive."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 70,
      "summary": "Offsetting stiff acting with rich atmosphere, visuals and music, this long-awaited picture hits the novel's key plot points without denying its spiritual soul."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 67,
      "summary": "Although Bless Me, Ultima can feel a bit overstuffed, it’s an honest and naturalistic kids’ story about growing up Mexican-American."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "What might have made Bless Me, Ultima more powerful would have been additional scenes with its mystical title character."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Obviously a labor love, and its very existence in a godforsaken marketplace is a minor miracle."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "The results are pretty, and sometimes beautiful. They're also a tad stiff, and the dialogue and voice-over narration sometimes has the ring of a scrupulously faithful adaptation."
    },
    {
      "critic": "Ernest Hardy",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Volumes are said about class, assimilation, and the ways the assimilated sometimes shame and scar those who haven't shorn themselves of ethnic or racial signifiers. There is pungency in this shorthand, in these sketches that are richly evocative without saying too much or giving too little. You can't help but wish the movie had more of it."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The film often stumbles in translation, trying to define too many characters in too little time."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The film isn’t overlong. But it tries to fit so many themes into its brief running time — that it merely touches on most conflicts instead of exploring them in depth or with any delicacy."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s an engaging yarn, set in a place, a time and among a people rarely represented on the big screen. But “Ultima” is a poetic novel that becomes prosaic on the screen."
    },
    {
      "critic": "Glenn Heath Jr.",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The film's interest in social themes remains background fodder within a far more generic good-versus-evil narrative."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Unfortunately, Franklin isn't quite as successful at capturing the depth of the traditions for which Anaya's source material is so well known."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "The lyrical book is filled with touches of magical realism. On the other hand, the movie is sorely lacking in both magic and realism. It’s all very empty and blah."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "If you're tired of the usual Hollywood loud special effects films, or the extended bad sit-com movies, this might be an option for you.  Slow paced and dialogue driven, spiritual, and completely watchable.  The success of the entire movie depends on child actor Luke Ganalon, and he does an excellent job in the title role.  One day an elderly medicine woman (a \"Curandera\") arrives at young Antonio's home to spend the final days of her life, and there is an instant bond between the two.  She teaches him the ways of her healing and magic, and the special relationship Man shares with the earth.  Curanderas are both revered and feared in their culture, and she is seen as an evil witch by some.  The only problem I had with the movie is that it is narrated by the older Antonio in parts, and it is never explained who he has become as an adult.  Still, a well done film.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Picked this movie on a whim. Glad that I did. Convincing performances, although Castulo Guerra's portrayal of Tenorio seemed a little over the top at times. I thought the storyline was pretty taut, and the themes of spirituality and justice are played well. Would not be surprised if this made many critics' top 10 lists for 2013.",
      "total_reactions": 2,
      "user": "Gwen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Hm-m, where do I begin? Yes this movie is different from a typical Hollywood movie. Does it necessarily mean better? I don't think so. Not in this particular case.",
      "total_reactions": 2,
      "user": "netflic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "Read professional critic reviews scoring equal to or less than 50...Yeah, what they said.  Excited when I saw this offering on streaming video, I watched patiently for an hour and thirty-four minutes, ignoring the depictions very broad strokes.  Stunned I was when I realized that the filmmakers had utterly failed to capture what, to my mind, is an iconic moment in literature, akin to Gandalf standing his ground on a narrow stone bridge over an abyss.  Good to see film treatment of a great story too-long neglected; bad because a \"reboot\" will, likely, never happen.",
      "total_reactions": 1,
      "user": "stund"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "The film poster says that it was based on the controversial novel. I don't know anything about that, but I feel it was referred like that for the marketing purpose. Anyway, it was a good, an unexpectedly good movie that came my way. Being a fan of the kids movie I loved it very much. Not only that, the diverged story with often the plot that meets fantasy and reality at a certain quantity was told in a great quality. It might be a story of the kid, but many stuffs were cruel and violent that I doubt does it fit for children to watch. As it set during just after the second world war, I think the harsh side of the story was extremely essential. And also being true to the book.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "I watched this movie (rented on Redbox) and was pleasantly entertained. \"Bless Me, Ultima\" is a coming-of-age movie the tradition of the genre. Directed by Carl Franklin adapted from the novel by Rudolfo Anaya, the movie follows young Antonio (played exceedingly well by Luke Ganalon) and his relationship with Ultima (Miriam Colon), an elderly medicine woman. Set in a small, rural village in 1940s New Mexico, Antonio comes to terms with his Catholic upbringing and the old shaman magic of Ultima. The old woman serves as a mentor to the boy.",
      "total_reactions": 0,
      "user": "ADGUY"
    }
  ]
}