{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 81,
  "mc_mixed_rating_frequency": 38,
  "mc_movie_name": "Blue Valentine",
  "mc_negative_rating_frequency": 61,
  "mc_positive_rating_frequency": 246,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 100,
      "summary": "It is beautiful, and it is difficult to watch. It is heartwarming, and it is heart-wrenching. It is absorbing, and it's unsettling."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 100,
      "summary": "Sounds depressing, but Blue Valentine is a reminder that well-measured and expertly acted pain is as thrilling to watch as 3-D spectacle."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 100,
      "summary": "Extraordinary and beautiful."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Blue Valentine is lushly touching and gorgeously told."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Gosling and Williams have the most palpable chemistry of any screen couple this year, never striking a false note in this achingly tender tale of a love that implodes before our eyes."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Halfway into Blue Valentine, a work so beautifully acted and emotionally honest it is my choice for best movie of the year, there's an amazing flashback scene you hope never ends."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "It's an emotionally claustrophobic drama, played with frayed nerves and raw emotions, and it serves as an unrelenting glimpse into relationship hell. It could easily have devolved into sweaty, pretentious melodrama or ersatz John Cassavetes if Cianfrance and his actors didn't maintain perfect control over the material."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Blue Valentine has a quiet, resigned wisdom to it."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "Blue Valentine is about real life, warts and all, over narrative conventions like action and plot mechanics. It is brutal, compassionate, beautiful in its ugliness and one of the bravest films of the year."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 90,
      "summary": "Once it's done, you feel terrible for these people, for their lives, for their daughter, especially. Is that entertainment? To each his own, but it is compelling and, yes, rewarding."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 90,
      "summary": "Williams plays this tired, disillusioned, chronically angry woman without a trace of actorly vanity. It's a performance noteworthy not just for its intensity but for Williams' ability to communicate inner experience at a micro-level of detail."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "Here's one vote for the most affecting, anguishing, revealing and prophetic scene of the movie year-and yes, it's all of those things at once in a powerful film that alternates between moments of earlier happiness and later pain."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "An intimate, gorgeous and wrenching portrait of a working-class marriage in what may be a state of terminal decay."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "Cianfrance and his actors, Michelle Williams and Ryan Gosling, have not made a cold or schematic film. They aim instead for raw emotional experience, one that's full of insight into the ways a relationship can go astray, but mostly feels like a slow-motion punch to the gut."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 88,
      "summary": "Two superb actors etch an unflinching portrait of a young marriage doomed never to grow old."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 88,
      "summary": "The cumulative experience leaves an aftertaste that, although not bitter, is too strong to be easily washed away. That's the mark of a worthwhile motion picture."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 88,
      "summary": "It's true that the movie is both emotionally violent and sexually explicit. Yet these scenes from a marriage are crafted with such attention to detail and overarching honesty that Blue Valentine touches the heart."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 88,
      "summary": "After 30 minutes, I wondered why I was watching a drama about a quarrelsome couple who seemed so obviously wrong for each other. After 60 minutes, I knew. After 90 minutes, I cared. By the end, I was riveted."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 88,
      "summary": "There isn't a moment in the entire film that doesn't feel genuine."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 88,
      "summary": "Derek Cianfrance, the film's writer and director, observes with great exactitude the birth and decay of a relationship. This film is alive in its details."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "A small but shattering film that marks its writer-director, Derek Cianfrance, as an artist of real depth, observes relationship dynamics at a molecular level, welling with as much understanding as Ingmar Bergman's \"Scenes from a Marriage.\""
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Ryan Gosling and Michelle Williams give two of the most explosive and emotionally naked performances you will see anywhere. Just know you're in for a workout."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 85,
      "summary": "The faces of these performers - particularly Williams' - are the key to Blue Valentine."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 80,
      "summary": "The performances are so gripping that the movie works despite its diagrammatic structure, which focuses on ironic rhymes between past and present and leaves out the entirety of the couple's marriage."
    },
    {
      "critic": "Nev Pierce",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 80,
      "summary": "A raw but beautiful picture of love uniting and dividing: tender, real and heartfelt."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "That meandering dialogue can be difficult to control, and at times the film feels as if the director has stepped away from the vehicle, leaving it to veer off the path. Still, it's an experiment that works more than it fails by giving Gosling and Williams both the motive and the means to create something extraordinary, a valentine that actually says something true about being in love."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Blue Valentine leaves you with the shattering vision of its truest victim-the one who'll someday look for safety in places it might not be. And the psychodrama will go on and on …"
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Nothing out of the ordinary happens in Blue Valentine, and that, together with the vital, untrammelled performances of the two leading actors, is the root of its power."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "The scenes cut so close to the emotional bone that you can understand why they might cause a panic amongst MPAA boardmembers, although of course, it's nothing to be afraid of: just the realism of love in its varied forms."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "On balance, this is a meaty, strongly realized dramatic work of considerable accomplishment."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "Writer-director Derek Cianfrance, who with Blue Valentine makes an astonishing debut."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "It's Williams you never question, who makes every detail and close-up and impulse natural. She's spectacularly good."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "It's a gritty, almost ugly to look at film, and Cianfrance isn't shy about including a random blast of unwarranted shaky footage."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 67,
      "summary": "Those moments, as affecting as they are, can't surmount the overworkshopped feel of the whole film."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "There's a loose, vérité vibe here, and times when both Williams and Gosling root down deep to deliver something resonant and true. But this modern-day kitchen sink drama is ultimately too painful, too labored, to care much about at all."
    },
    {
      "critic": "Ray Greene",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "The kind of grim, character-based movie that needs a strong performer to anchor it. Director Derek Cianfrance has been fortunate enough to land two: Michelle Williams and Ryan Gosling."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "It wallows in misery so much that the two-hour experience ends up being about as much fun as a real divorce."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "All the movie's good style goes to waste on a not terribly compelling conceit and loosely sketched characters."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The film's time structure is splintered into shards of past and present, which is probably just as well – a strictly narrative chronology would make this wallow seem even sloggier."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Cindy and Dean remain, for all their sustained agony and flickering joy, something less than completely realized human beings. Mr. Cianfrance's ingenious chronological gimmick, coupled with his anxious, clumsy plotting, leaves them without enough oxygen to burst into breathing, loving life."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Even when transparently plumbing for depth, Cianfrance's film is frustratingly surface-bound in ways that reflect, if not out-and-out misogyny, then at least a lack of interest in imbuing his female character with the rich interior life and complicated morality he gives his male lead."
    },
    {
      "critic": "Duane Byrge",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Ultimately, the heavy-handed and annoyingly obvious aesthetic wears thin."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "The dog isn't moving; he's not the only thing that's dead, but she'll deal with her blue heart later on. First things first, there's the blue dog to deal with. Cindy(Michelle Williams) discovers him on the other side of the highway, presumably hit by a moving vehicle, or maybe it was fate. Perhaps the floodgates were overdue for an opening. Little does she know it, but her bad morning is only going to get worse. While the still body lies in the trunk, Cindy walks down a deserted school hallway; it's a walk of shame, the finishing touch on a life gone horribly wrong. Inside the crowded auditorium, her daughter's pageant is already in progress. She's late, in more ways than one, and not for the first time. Six years ago, when her younger self was late, Cindy almost had an abortion. She was going to be somebody, a doctor; she really should be somewhere else, but the baby was his, so she called off the procedure. The nurse has been living with the consequences of that decision ever since. She's late again, but this time, it's a relief. Her pageant, this marriage in trouble, isn't worth saving. When Cindy breaks the news to Dean(Ryan Gosling), the directionless man she had wedded out of love, the broken woman accouters him with the ammo he needs for retaliation. Dean knows that he disappoints her. The housepainter berates her inexorably for not locking the dog's gate. It's his golden opportunity to point out that Cindy can be a f*ck-up too. Accused of being a child just hours ago, due to his lack of gravitas at the breakfast table, Dean proves her right, when instead of being there at a moment of crisis to provide comfort and understanding for her animal-related transgression, he plays the blame game, like some petulant boy, and makes his wife cry even harder. Outside the school, Frankie(Faith Wladyka) asks about the dog, and rather than give her a straight answer, he tells his daughter that the family pet decided to head out west to try his luck at being a \"movie dog\". Cindy says nothing; she lets her husband's sugar-coated lie hang in the air. Any questions that Frankie may have concerning life and death will have to be postponed 'til a later date. For now, there are more pressing matters to deal with. Unbeknownst to Dean, but by evoking Hollywood, and more pointedly, dreams, he opens up a can of worms; he tears the lid off of Pandora's Box. Back at the house, as a home movie featuring Megan plays on the television in memoriam, Cindy makes a connection, and suddenly, their marriage is irrevocably wrecked, overrun with worms and a laundry list of unmanageable problems. Harking back to Dean's rehashing of a Dino-centric episode of \"The Flintstones\", she can plainly see, fiction be damned, how Megan never made it to Hollywood. It serves as a painful reminder that the once-promising medical student never lived up to her potential either, dropping out of college like she did after making her future husband's acquaintance. And now, Cindy pays attention to her blue heart, as she fights the interspecies transferrence with all her might. She doesn't want to end up like the dog, whom Dean buried in the backyard of their modest rental. Cindy becomes deathly afraid of her husband's shovel; she doesn't want to live and die here. She doesn't want to be next. Therefore, Dean's timing couldn't be any worse when he makes reservations at a cheap motel, where they spend a night in the ironically named Future Room, since the future is both a present which her past self could never have imagined, and a myriad of hypotheticals that Cindy wants to tackle on her own. \"Blue Valentine\", a movie whose narrative goes backward and forward in time, shows how hindisight can sometimes be one big fallacy. The evidence shows that she was powerless to his charms. The flashbacks tell the story of her doom. After all, the warning signs were there, absolute dead giveaways that Dean was the rebound, the antidote to her college boyfriend, a real jerk, and not the man she was supposed to marry, but alas, whom she ended up loving too much. Memories are ephemeral, they don't pay the rent and put food on the table, and Cindy is paying the price for getting involved with a lovable, but shiftless townie, and yet, she has these memories, moments of pure bliss that some people may never get to experience. For instance, her grandmother, who answers in the negative to Cindy's question about ever having been in love. From the old woman's point of view, Cindy is blessed. And from our point of view, we may feel the same way, too.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "The movie focus is the depiction of a broken marriage between two working class people,Dean and Cindy.What could have been a great movie becomes a failed occasion to portray an emotionally absorbing tale of an ended love story(as it was in a terrific movie such \"Eternal sunshine of the spotless mind\"). Despite the movie boasts great performances by the two leading actors,particularly by Williams,the big problem is the lack of a solid script that doesn't offer the chance to know about the characters and their love story.I would not call them insignificant informations because when you decide to make a movie about a couple and their fallen marriage you have to provide the audience of a plausible explanation of their relationship.Without that we struggle to be involved with the two leads.With \"Blue Valentine\" we exactly don't know why they fell in love and why after years they can't stand each other and why their love ends.We are left with a series of disjointed bouncing back and forth scenes of their former happy days that have not much to say,except that they go quite well together in the first chapters and scenes of their declined relationship.As I said before,the acting is solid(to compensate the holes in the script).Ryan Gosling was very good but it's Michelle Williams who gives a great performance that is the best thing of the entire movie.She deserved her Oscar nomination for her outstanding performance.Gosling portrays a man who tries to understand why her wife doesn't love him anymore and a good father although he has a scantly work that clearly makes Cindy feel quite disappointed and he is often drunk.I suspect that Cianfrance takes the side of the female lead although she is the most unlikeable of both of the leading characters and due to the troublesome script we hardly understand why she was in love and why she became so cold towards her husband.I simply found \"Blue Valentine\" the most overrated movie of 2010 and I don't know if this movie wouldn't have struggled to win many praises if it wasn't for the Weinstein campaign.My vote of the movie is 5/10.",
      "total_reactions": 1,
      "user": "francesco"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Cianfrance's directing is laid back, as in he lets the actors do the story telling.  The emotional bond formed by these characters can be seen and felt, due to the two spectacular leads. The soundtrack provided by Grizzly Bear highlights the emotional strain just right.",
      "total_reactions": 5,
      "user": "DC19"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Absolutely devastating. This story stuck in my head for hours after the film ended. Michelle Williams and Ryan Gosling give the best performances in their short but wonderful careers, and Derek Cianfrance's script and direction so clearly come from a personal place that you can't help but feel emotionally drained afterwards.",
      "total_reactions": 4,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The film was well done; great acting, great scene writing, great structure, but emotionally it was very cold. In cold, I mean I felt detached. I also think the theme was very unoriginal. You repeating what your parents did to you has been done many many times. I also think Michelle Williams character was totally unlikeable, and I didn't think she deserved him, so therefore I didn't want them to work and that took away what I should be rooting for in the film..... It is the definition with what can be wrong with independent film. The realism takes you out of the film.",
      "total_reactions": 3,
      "user": "Matteo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This was an excellent film with Ryan Gosling giving another riveting performance.  I do have a couple of criticisms about details that the director, or actors, or someone should have noticed.  In the first scene the adorable child is seen with a very expensive, & hard to maintain, haircut.  This family would not be able to afford such a haircut.  In a later scene, Michelle Williams French manicure is very prominent. First of all, her character works in a doctor's office & her manicure would not be appropriate, secondly, the character would not have the money, time, nor energy to have & maintain such a manicure. I find it hard hard to understand why someone involved in the film would not have noticed such jarring improbabilities.",
      "total_reactions": 3,
      "user": "kcunning"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Stars Ryan Gosling and Michelle Williams were also executive producers of this film, which explains the self-indulgent acting exercise that they've turned into a downer. It runs two parallel courses, when they meet and fall in love and several years later, when their marriage is falling apart. It took 3 writers to create the mundane dialogue and a director with a claustrophobic camera. Granted, the performances are award material, but the film is grim and painful for the characters and for us.",
      "total_reactions": 8,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Outstanding film - makes my top 5 for 2010. Don't want to say much about it lest I prejudice your experience with it. The crowd I saw it with was sufficiently stunned when the credits rolled.  (I've never seen credits presented quite like those, by the way.) Do what you can to see this one soon.  It's not an \"easy\" movie - you'll carry it around for a while, but it's worth it. I'm ready to see many more films by this director.",
      "total_reactions": 4,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "\"Blue Valentine\": Love Story or Mockumentary?",
      "total_reactions": 4,
      "user": "MedinaReviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "I will give the director and the actors and actresses credit for making such a gritty film. Unfortunately, there was no reward or satisfaction gained by this viewer. Grim and depressing films can be enjoyed. This one was not able to deliver that.",
      "total_reactions": 4,
      "user": "JamesL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "All I can say is that after 30 minutes into this movie I knew exactly what was happening and luckily the movie didn't try at all to do anything interesting at all. Can't get much worse dialogue or boring of a story.",
      "total_reactions": 2,
      "user": "rabage"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "expected so much more of what i looked in it , But at the same time is not that bad comparing with the 2010Â´s movie . It can easily  get over so much movies of the last year. But at the same time i insist that i expected so much more of it .",
      "total_reactions": 2,
      "user": "bluemilk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "After watching Blue Valentine all I could feel was disappointment. The screenplay didn't do justice to the cast, who gave an outstanding performance considering.",
      "total_reactions": 7,
      "user": "darrrn"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Very disappointing considering this is my kind of film. Anyone who thinks this is great must not be familiar with what great films look like. Check out Bergman if you want to plumb human emotion. Or Bertolucci. This is a very superficial and stylish film that comes up empty. Great acting, but the dialog and the storytelling are quite weak. The events are so simplistic and heavy-handed. All in all a huge disappointment.",
      "total_reactions": 9,
      "user": "kormac66"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "NoOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
      "total_reactions": 6,
      "user": "VFStein"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Musicfan you may beg to differ and yes I did watch the film thoroughly and from what I can gather many other people feel the same as I did.Dull Dull Dull.",
      "total_reactions": 3,
      "user": "juliet1000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "This is a very good movie, albeit imperfect.  The acting performances by Williams and Gosling are near perfect, with Williams having the more dynamic character.  This is basically two dysfunctional people falling in love and growing apart:  Williams' character grows up and wants and deserves more than Gosling's character is able to give.  While is is neither Bergman nor Bertolucci, it is interesting and real.  People like this exist and make bad decisions every day.  It is very interesting, at the very least, to see the devolution of a relationship that did not even begin under the best circumstances.  The narrative structure of the film is disjointed, probably intentionally, which detracts from the emotional impact of some of the scenes.  There was a great deal made about the sex in this movie.  Really?  Why?  It's not particularly graphic.  Two of the scenes (aggressive jerk old bf and husband wanting a new baby) were critical to the movie's plot.  On some level, all they shared was sexual compatibility, at least early on.  That's part of what this film is about.  The MPAA is nuts, as are people who \"hate\" this movie.",
      "total_reactions": 2,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is the perfect recipe for an American indie and more. Cinematography -outstanding (watch the end credits, endearing), actor's direction -supreme, soundtrack -perfect for 90s and the performances are literally breathtaking. Gosling makes you forget he was once a stereotype. The story of deterorating love is heart-wrenching. A must see! @cinemaquote",
      "total_reactions": 1,
      "user": "cinemaquote"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Wow Juliet1000,  if all you can talk about is Michelle Williams lying on her back, it makes me wonder if you even really saw this at all! Little interesting dialogue and slow pace!? Well, I beg to differ. I thought WIlliams and Gosling were both fantastic, and I was deeply engrossed with this film. If Natalie Portman didn't give such a great performance in Black Swan, I would give the Oscar to Michelle Williams. Granted, if you are looking for escapist fluff, don't see this. However, if you are looking for great acting with a great script then definitely see this!",
      "total_reactions": 1,
      "user": "musicfan1066"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I was very encouraged to find this site. I wanted to thank you for this special read. I definitely savored every little bit of it.",
      "total_reactions": 1,
      "user": "tinanicole"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "An economized story that could only function with two leads that exude intelligence, charm, wit, and dare I say: grace. Actors with the ability to exercise these God given gizmos as they were commonplace among us all - and shut them down when necessary, for the sake of our betterment - to instill good in the name of art. \"Blue Valentine\" was ten years-plus in the making - an absurd figure to the laymen - yet, when leaving the theater - as my sister ran away ahead of me to weep in privacy - I realize how meager this world is of beauty and thoughtfulness - we follow two stories in the film - one full of expectancy, desire  and young flesh - buttered with  evenly layered sunlight - while the other is crippled, fluorescent, and thoroughly defeated.  Civilization, by default, propagates neurosis, sorrow, and dysfunction.  Some people collapse into it from exhaustion - some people give in - some relent - move to the country - yet, it follows.  \"Blue Valentine\" imbues tragedy by way of sacrificing two superior specimens - the best mankind can conjure-  it does so for our sake.  This is an allegory of too many things to encapsulate in a review - it's not a simple tale of \"love gone bad\" or what have you - it's poetryâ",
      "total_reactions": 1,
      "user": "Deathromp"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "'I am Sam' meets 'Raging Bull', and if you've seen either of these movies, then you don't need to see this one.",
      "total_reactions": 2,
      "user": "harrison"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Blue Valentine is the slow rise and fall of a relationship. I'm sure some people watched this and thought \"why would anyone want to watch a downer movie like this.?\" Well I think because it's a honest portrayal of what can happen in a relationship and some people find that hard to watch. Movies like this aren't full of bells an whistles and don't leave you with happy feelings at the end. What it does do is a give you a look into the birth and destruction of a relationship and how we are capable of hurting the ones closest to us. This will be too close for comfort for most people.",
      "total_reactions": 1,
      "user": "breezegirl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Great performances by Michelle Williams and Ryan Gosling makes the movie worthwhile.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "The fact that these actors seem so real makes this movie-watching experience pretty miserable -- different, from, for example, a movie like \"The Break-Up\" in which you never believe a moment of the Vince & Jennifer hook-up and so can't be much bothered when the \"relationship\" fails. I though Gosling and Williams were equally terrific; I know she got the Oscar nomination, but suspect she got extra points for nudity. One problem I had was that, with the back-and-forth between the beginning and bitter end of their relationship, we lose some understanding we needed about how they coped in the middle. In this some of the reviews & previews are misleading . . . it's not about a relationship that started out wonderful and went downhill. It's about a relationship that started out with big, serious problems and somehow endured for a while.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Strong acting with a competent script, what could go wrong? Not always the easiest movie to watch since it's about the breakdown of a relationship, and one where the power is WAY out of balance. Sad. Not certain who the target audience is, but, if you like drama, there's plenty here with wonderful performances from Michelle Williams and Ryan Gossling. Some scenes had me crawling out of my skin. The one minor detail I didn't personally care for were the number of tight shots, which arguably added to not only the tension, but a sense of voyeurism / viewing from a safe distance. Nothing here is over the top, everything is nicely understated, and pushed just far enough, which is never easy to accomplish. Nicely done.",
      "total_reactions": 0,
      "user": "egovirus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "An intimate wrenching and emotionally honest portrait of the birth and decay of a relationship.  Subtle direction and pitch perfect acting from both Gosling and Williams alike.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I am absolutely baffled that Ryan Gosling didn't get a Best Actor nomination for this and Michelle Williams did.  Don't get me wrong, I thought she did a very good job too, but it didn't compare to Gosling, who I think is quite underrated.  The story is told in a non-chronological, retrospective view.  But the order and direction of the story is the most beautiful part.  It is kept a bit mysterious, but easy to follow and understand where in the story you happen to be. The middle of the film did drag out and it didn't have to be a 2 hour movie.  The most memorable scene was when they were walking and started singing and dancing.  I think it was the apex of their relationship and showed that they could be happy together.  It gave them that little bit of hope in their minds that they could hold onto their relationship and work it out. Overall it's a good story with good acting.",
      "total_reactions": 0,
      "user": "Onear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "The two central performances from Ryan Gosling and Michelle Williams are truly excellent. They take the audience through a whole range of emotions and back again! The film is shot using quite a lot of hand-held camera; but not too shaky; which makes for a realistic feel to the drama. To me it seemed a little odd to show just the beginning and the end of the relationship; maybe I missed something, but I wanted to know what happened in the middle. Could be it was doomed from the start. I enjoyed this one and would watch it again (making sure I was in the mood first); definitely worthy of my recommendation.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "It was okay, considering that halfway in you begin to realize that Cindy and Deans' relationship was reaching its peak in the present time and that they were showing the birth and death of their relationship.",
      "total_reactions": 0,
      "user": "Stephchan1901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Feels like real life, I strongly sympathized with both characters at different points. The movie is totally absorbing. Both actors do an absolutely fantastic job!",
      "total_reactions": 0,
      "user": "nohobobo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "This movie has been one of the best romance ever seen in my **** life. Michelle and Ryan are amazing, everything you need to broadcast that film was memorable, I loved",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Love it. Very good screenwriting for this film. The story line is very good. Very good acting in this movie. This movie should of got nominated for an Oscar. I don't know why this movie up for best movie. Really good movie that i suggest every body should watch. It keep you into the movie. Very good romance and drama movie. also comedy this movie had some funny parts in it. I think everybody will enjoy a movie like this.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "A movie so relentlessly depressing that by the end I felt defeated. There wasn't one moment in the film that made me cry or feel a wave of sadness, but as the credits rolled I realized just how sad I felt. The characters are so frustratingly stuck that it was devastating to watch, and even more devastating to realize just how realistically they acted. I grew up in a home where my parents fought constantly, and Ryan Gosling and Michelle Williams perfectly emulated that experience.",
      "total_reactions": 0,
      "user": "throwinken"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "blue valentine is too much; too real, too close to the heart, too close for comfort. it not sterilized and the rawness of the movie - fueled by great acting and cinematography - may be more than what audiences can take, especially if they can relate on a personal level to the inexplicable demise of the bonds that bind and define us.",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Tension is the name of the game for exhaused lovers Ryan Gosling and Williams. The film cuts and back and forth in time filling in the gaps. The authenticity of this film cannot be understated.",
      "total_reactions": 0,
      "user": "eliteco3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "The movie centers on few things in life like love,relationships,instant marriages due to some unwanted reasons and other **** portrays\"the **** quite beautifully and how complicated it really gets for some of the families out there which might have formed due to some or many unavoidable reasons.I personally felt that the female character was at fault here - young,restless,prone to committing some serious mistakes and later bend life at her own will with adjacent to the mood swings which we have seen getting portrayed regularly with some of the really major romantic movie genre.And which actually sucks for all the goody tissue guys out there who are not good with money but actually respect the integrity of their family very well and are willed to do anything to keep it at its best state of condition.",
      "total_reactions": 0,
      "user": "Mukul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Mesmerizing picture of love and marriage. Magnificent performance by two its lead, Ryan Gosling and Michelle Williams. Love, even its hurting you, it still beautiful, and... never try to surrender with the tests.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "I think the most accurate description of this film would be \"beautifully depressing\". I was left wondering why Ryan Gosling wasn't also in the oscar conversation. Definitely a movie that makes you think, especially after its conclusion. I think this leaves all people in relationships asking themselves \"that won't happen to me, will it?\" Really makes you think about where you stand in your own relationship.",
      "total_reactions": 0,
      "user": "BShea423"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is tired from the start, hard to watch, and really only useful for those who can view this as something they might have been through....but then it might be to painful to watch and depressing...I will add surprisingly, wonderfully acted and painfully real. If you want pure cinema well this is it, if you want to have a movie pity party well this is it, if your looking for a warm feeling and happy disposition when the credits role you might want to try morning glory. Finally ....good cinema....but I like to think story's like this can ruin a good time.",
      "total_reactions": 0,
      "user": "EyesWideOpen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Very good movie. I do not like drama movies, but if they are good, I can stand them. This movie is slow, but I do not mind slow movies. It is not for one who just wants action and a fast pace movie. But it really does a good job showing the contrast in the couples life.",
      "total_reactions": 0,
      "user": "MonopolyBag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "A story about the end being there from the begining. You search through the non-linear unfolding of the couple's life, for signs that they are not the one for each other, and the signs are there. And that's great. Because this film points out, pulling masks from many of us, that some people stay together because of need for attachment and fear of aloneness, and that not everyone decides to be together just because their neuroses can match and they'll make each other happy. Sensitive Michelle Williams, Tender and moving Ryan Gosling.",
      "total_reactions": 0,
      "user": "POV"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "I really admire Ryan Gosling. I mean, how many actors would go so far as to make an apology film to make up for previous cinematic slip ups. In Blue Valentine, we have the complete anti-thesis to the schmaltzy, overly sentimental, \"The Notebook\". I can almost envision him in an interview promoting the film stating, \"Look guys, I'm really sorry about 'The Notebook'. You have to understand, I needed to do populist film to bolster my career. If I didn't do it, I wouldn't have been able to be involved with films like this.\" Thanks Gosling! Melodrama is replaced by stark realism and there's mutual loathing instead of romance. The hand held camera is stylish with out ever becoming annoying and the sensational acting goes along way towards complementing these cinema verite techniques. Perhaps the most compelling aspect of the film, is that, despite the mundane subject mater, the film succeeds in being lovably charming. I'm not going to lie, I giggled on more than one occasion because of Dean Pereira's (Gosling) antics. So I say again, Thanks man.",
      "total_reactions": 0,
      "user": "Simonjo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Raw, real, and unapologetic in it's story, acting, and emotional resonance. This is not a film that one can watch over and over again, but the performances are superb, especially with Gosling. One of the year's finest films!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "I like these two actors and they do a good job acting in this movie but the movie is just..we'll it is a REAL downer. I don't require that movies always end happy or be happy. I like 21 Grams it was sad but deeply meaningful and interesting. This movie does not come off that way, this movie is just sad....period.  Remember how you felt as a kid when your hampster died? That is how you will feel at the end of this movie.",
      "total_reactions": 0,
      "user": "lususgreene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "The film is definitely bleak but not at all depressing.It shows the development and collapse of a relationship in a scarily realistic way.Gosling and Williams are superb.It's not an easy watch but it's emotionally rewarding.",
      "total_reactions": 0,
      "user": "AlexS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Blue Valentine presents both the \"blue\" and the \"valentine\" of love. I found much of the beauty of the film in its editing, cutting between past and present seamlessly, blending the unexpected arrival of love, its ability to heal and surprise those whom it strikes, and then, sadly, following its destructiveness when lost. All of this is done with cleverly subtle direction, and passionately powerful acting.",
      "total_reactions": 0,
      "user": "cafergy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "It's quite slow, yes, but it's also quite beautiful - just like life. It's a great romance and well done acting. The credits on this movie were also exceptional. A very good movie.",
      "total_reactions": 0,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Blue Valentine is well made but it does suffer from uneven pacing. However in the end you feel for these characters and so deperately want them to find love. It is Gosling and Williams that carry this film because much of it seemed unscripted and was left to the actors to fill in the blanks and this technique works marvelously.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Beautifully acted with compelling moments. Gosling plays the underdog romantic victim (w/ or w/out a substance abuse problem) very well. (i.e.The Notebook, Half Nelson, Lars & the Real Girl) There's the suckerpunch of comedic expectation that is woven with flaw and vulnerability to create an emotional stronghold on the audience. At every turn there was unpalatable devastation that never let up. I left feeling like I'd been hit by a truck. A few distractions: Williams had an impeccably maintained manicure and they owned a newish, seemingly well-maintained car. It really didn't make sense for a couple that seemingly struggled to make ends meet. Overall, I think Gosling truly deserved an Oscar nomination for this role. There were several remarkable key scenes: overwhelm and anger on the bridge, tormented begging after the fight at the end, and especially the desperate search for his wedding ring in the bushes). I'm not in the film industry, but as a viewer, Gosling's performance made the space between my eyes and nose hurt--that sort of sting before you might cry...perpetual upset.",
      "total_reactions": 0,
      "user": "FunnyGirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This is already in my top 10 - definitely one of my favorites. I absolutely love this movie. It's really beautiful to me in so many ways. The brilliant cinematography complimented the realism and truth in the acting. Gosling and Williams have such passionate, beautiful, and tragic chemistry and it really flows through the entire movie. The plot of intertwining past and present is very smart and, despite what one might think, does not confuse the audience - it helps to give meaning and emotional value to events throughout the film. The ending is my favorite part. With the audience knowing in their hearts that it's truly over between the two characters, they're still hanging on to that one shred of hope that they'll somehow work it out. The mise-en-scÃ¨ne of the last few minutes of the film going into the credits is complimented with its perfect match of cinematography to convey a beautiful representation of the Americanism in the separation of Dean and Cindy. The wonderful use of a telephoto lens to separate the planes of the characters and the scenery really makes the scene. When Dean is walking away, the fireworks present a great symbolism of America and how divorce is very American - a lens that was previously used in the film to bring these two characters together on the screen is now used to tear them apart on the screen. In the final moment when Frankie runs to her dad but is sent back to her mom, Dean and Cindy are never on the same plane on the screen. When Dean is in focus, Cindy is blurred, and vice versa - this is just a really creative, subtle, yet brilliant way to show these two characters being separated after all they've been through. I really grew to love and care for these characters. Blue Valentine made me smile, it made me laugh, it made me cry - it got inside my heart and tugged at its strings in almost every way possible. I give this 10 stars because I could not find a flaw in the film if I tried.",
      "total_reactions": 0,
      "user": "JohnTibbitts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Blue Valentine is such a richly alive piece of cinema that I canâ",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "Is there really such thing as eternal love? With excellent oscar-deserved performances from Ryan Gosling and Michelle Williams and a heartbreaking but brutally honest script and direction from Derek Cianfrance comes \"Blue Valentine\", a harrowing film that examines the relationship between love and tim as broken people find and lose love for each other in a road leading to nowhere but pain and regret. An excellent movie that really makes you think about the questionable existence of true love.",
      "total_reactions": 0,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "I am so tired of the mid-late 90's documentary film approach of what could otherwise be a captivating story. Personally, I just can't absorb myself in the story or even connect with the characters when you are so obviously looking over someone's shoulder at their life. I watch movies to escape my reality for a brief window in time and the film style used here actually distances the viewer from the story rather than pull them in. Don't let my opinion turn you away though, as they don't use this approach across the board but it is present enough to ruin the experience for this fan of escapism.",
      "total_reactions": 0,
      "user": "Annamika"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Blue Valentine is a masterpiece. Why? Because there are amazing performances by Williams and Gosling, naturalistic script and shot. The movie shows the real life.",
      "total_reactions": 0,
      "user": "schrodinger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Much like life, Blue Valentine is often difficult to match and experience. It's unsettling and heart-wrenching throughout. Almost simultaneously, beauty is able to arise within. Ryan Gosling and Michelle Williams both give some of their finest performances to date.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "I think the most accurate description of this film would be \"beautifully depressing\". Definitely a movie that makes you think, especially after its conclusion.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "There's no denying that watching Blue Valentine, a film that tells the story of the complete breakdown of a couple's marriage is not an easy watch (especially for someone just married!) and is certainly an intense, claustrophobic experience, as the audience never really gets a break from the two characters but honestly I was slightly disappointed that the film didn't turn out to be quite the emotional heart-breaker I was expecting. Perhaps in anticipation I had turned my heart to it's complete stone setting. That's not to take anything away from the film's leads who gave brilliantly sincere and convincing performances as the troubled couple. Special comment for the 'Future Room' which with it's tacky futuristic decor and lighting must have been director Derek Cianfrance's ideal shooting location!",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "A deeply tragic film about falling out of love, Blue Valentine is only tangentially about romance. Instead, it is a larger examination of life and how we are ultimately doomed to become what we do not want to become: our parents and unhappy. A bleak and dark film, Blue Valentine is an uneasy examination of this and what appears to be director Derek Cianfrance's incredibly sad world view. Whether you agree with what the film presents or not, Blue Valentine is undeniably brilliant. With well matched leads in Ryan Gosling and Michelle Williams, the film consistently presents tough and depressing moments juxtaposed with truly happy and passionate moments to further your heartbreak while watching the decay of this once strong and united couple. The lighting and cinematography are brilliant, as the realistic and truly emotional writing here that helps to craft truly multi-dimensional characters that act like real human beings when confronted with tough situations. Overall, Blue Valentine is not a movie for date night. Instead, it is a good movie to watch after a tough break-up in order to get all the crying out and to say \"f*** love\".",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Heart-warming in its beauty, yet heart-wrenching in its tragedy, Blue Valentine is the perfect romantic drama. The chemistry between Gosling and Williams sizzles and crackles, while everyone and everything else is just a nullified rush of noise.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "Realistic and honest, and both beautiful and tragic, Blue Valentine grips you and never lets go. Gosling and Williams give astounding performances, truly heartbreaking, devastating performances. This film is unforgettable and powerful. One of the best films of 2010!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Beautiful.It shows two different parts of the relationship. The only really big criticism I have is to not know what happened between them that led to this.",
      "total_reactions": 0,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "\"Blue Valentine\" portrayed all the aspects of relationships other films are too afraid to capture; the raw emotion of vulnerability to the apathy of love lost. With its laid-back direction and cinematography, Michelle Williams and Ryan Gosling give a performance that really makes you think.",
      "total_reactions": 0,
      "user": "gretta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "blue valeintine was the sad,honest  movie of love.the love which sopuse to be endless,but it is ended long ago,at least for her.",
      "total_reactions": 0,
      "user": "maryam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Finally, a romantic film that has not a happy ending. I was waiting for a movie like Blue Valentine for many years. I liked the originality of the film and Ryan  Gosling and Michelle Williams should have won that oscar. I like the fact that it is realistic as many romantic movies go with a happy ending which is often bad and lame. Blue Valentine is a great movie and maybe one of the best of its kind",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Contemporary cinema is a juggernaut producer of romance films tracing a couples' elevation of compassion to a seemingly immortal love. This commonplace depiction of love certainly evokes a grandiose falsity: love is easy and love invincibly endures. When the last frame vanishes from the screen, the dominating denouement is of course one teeming with superficial catharsis. With Blue Valentine, it's as if Derek Cianfrance, the film's co-writer and director, felt that the phrase \"gag me\" had floated through his thoughts one too many times. Just as Dean (Ryan Gosling), the husband of the film's centerpiece marriage, ruefully admits, \"Maybe I've seen too many movies, you know, love at first sight?\" Among the ubiquity of portrayals of conquering affection, Cianfrance's Valentine audaciously confronts the pernicious obstacles of relationships that other films apprehensively hurdle and dodge.",
      "total_reactions": 0,
      "user": "reeltoreel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "With great performances from the leading cast and the very few supporting actors/actresses, Blue Valentine is a wonderful film about the tragic road of love; moral of the story love comes in many forms and sometimes the forms that is comes is not pleasant.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "Blue Valentine sucks, worst movie ever, yeah that's a spoiler for anyone who thought it wouldn't suck! Unless you like stupid flashbacks and an unfinished story #LazyDirector #LazyWriter the only good part was Ryan Gosling. ZERO OUT OF TEN WOULD NOT RECOMMEND. Also the chick was soooo dumb, punk didn't even have a personality she was just yucky twenty-four-seven.  Peace out. I would have rated this -7 but the lowest was 0 so that will have to do. You're better off watching Handy Mandy.",
      "total_reactions": 0,
      "user": "BluValntineSUKS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "An intensely acted, minutely observed attempt to convey the arc of a romantic involvement.",
      "total_reactions": 0,
      "user": "ReelViews94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "Blue Valentine was a very realistic romantic film that gave us a nonfictional portrayal of love and marriage. A message that it doesn't always end in \"happily ever after\" and the chemistry between Ryan Gosling and Michelle Williams helped aid that meaning to existence. Unlike most films in it's genre, this demonstrates the reality of love and marriage and not just overused sequences of unrealism to get the fictional point across.",
      "total_reactions": 0,
      "user": "Antgiog1202"
    }
  ]
}