{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Blue Caprice",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 100,
      "summary": "A riveting first feature of startling maturity and intelligence."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "Proves a highly auspicious feature debut for Moors and Porto as well as a much-deserved return to the limelight for Washington. Don't miss it."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "The key question is whether this procedural—as in, here we watch killers proceed—contributes to any greater understanding. I believe it does."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 90,
      "summary": "Precision-honed performances and a nonsensationalistic approach distinguish this impressive first feature from French helmer Alexandre Moors, which avoids pat explanations as it offers a speculative glimpse into murderous minds."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 88,
      "summary": "Blue Caprice takes a minimalist, documentary-style approach that proves harrowingly effective."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 88,
      "summary": "Blue Caprice is a cinematic punch to the gut, a mind-bending meditation on how to mold a killer, and one of the most potent and provocative true-crime movies ever made."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 88,
      "summary": "The filmmakers are more interested in questioning what brings people to commit senseless and merciless acts than they are preoccupied with the historical record."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 83,
      "summary": "Washington’s performance is one of the best of the year, a high-wire act that is careful not to dip into survivalist caricature."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 83,
      "summary": "Moors isolates a well-known drama with the fleeting nonfiction prologue and explores it from the inside out: It's not an attempted reenactment, but it does aim to get at certain truths."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Moors is neither showy nor exploitative in his telling of the story. He just lays out the details, making “Blue Caprice” not just a story of horror, but of tragedy."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "Moors' film is at its best when it worries at notions of how evil is born, fostered and brought to bloom."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "The Beltway sniper case was solved a long time ago. But in some respects, Mr. Moors’s haunting film suggests, it is still a mystery."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "It finds no clear answers, but that suits both the horrific event and this haunting, elusive film."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "The film’s a character piece with a tightening noose of suspense, and while it has its artsy-indie-dawdly moments, it’s disturbing in ways that aren’t easy to shake. Is the movie necessary? Do we need a “John and Lee: Portrait of Two Serial Killers”? Because it shines a light, however hesitant, into the cramped, resentful mind-sets that fester in the corners of America, I’d have to say yes."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Even more impressive is young Tequan Richmond (TV’s “Everybody Hates Chris”) as the quiet, intense Malvo, a kid so desperate for a father figure in his life that he becomes putty in the hands of a killer."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Blue Caprice only spends a few minutes reenacting their crime — the movie shows us exactly how they did it in just a couple of scenes — because the facts of the case aren’t the movie’s focus. Instead, this lyrical, frightening film is a portrait of a man consumed by self-hatred who decided to take it out on the world."
    },
    {
      "critic": "Nick Schager",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Blue Caprice otherwise proves a deft mood piece, one that probes its characters’ states of mind while remaining wholly unmoved by their grievances and hang-ups."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Blue Caprice is a chilling portrait of motive, manipulation and mass murder."
    },
    {
      "critic": "Matthew Kassel",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Blue Caprice, a disturbingly intimate look at the Beltway sniper attacks of 2002, isn’t a horror film, but it certainly feels like one."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 63,
      "summary": "As admirable as Moors’s oblique style is, though, Blue Caprice doesn’t offer the sense of catharsis or closure, let alone new information, that makes it more than a cold, if disciplined, directorial exercise."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Director Alexandre Moors turns the project into something of an art film, requiring patience for repetitive editing and slow-burn scenes before the movie ultimately works itself under your skin."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Blue Caprice is probably what more post-9/11 cinema should have been: desperate for explanations, inchoate and wrapped in unspoken loneliness. Even though we can stomach it better a decade later, we’re still not healed."
    },
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "Blue Caprice tells its story in fragments, a provocative strategy that sometimes works to chilling effect, sometimes not."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie substitutes milky, washed-out color and funereal music for insight. The murders are purposely un-fluid: When you see Mohammad or Malvo take a shot, you don’t see the impact of the bullet. When you see the victim struck, you don’t see the shooter."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "For all its tasteful spareness and eerie, diaphanous mood, Blue Caprice feels, in the end, insubstantial. It’s a true-crime story that illustrates little about the crime in question and a character study whose characters, even when haunting, remain stubbornly opaque."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "This is an attempt to paint a psychological portrait of infamous Beltway snipers who killed 10 people in 2002 and terrorized Washington D.C. area for two weeks. I am not sure if the authors were successful to answer the question \"Why did they do it?\" There are many people angry at the world, some of them are trained to kill, whether by State or by themselves, some of them are deranged to different degrees but they do not become what these two did. This couple is not shown as simple evil-doers. A man rescues a stranger, a vulnerable teenage boy, from a suicide attempt. He stands up to become a fatherly figure for the boy, builds up his character, teaches his things, only to exploit him later as a killer or innocent people. No gun laws can protect a society from such people as these or Unabomber, or other mass killers.",
      "total_reactions": 0,
      "user": "netflic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Ominous and tense throughout, \"Blue Caprice\" is a slow burn that builds to an unsettling boil, leaving  you with a known outcome that's hard to digest. Director Alexandre Moors crafts a deceptively eerie depiction of Lee Malvo and John Allen Muhammad, and to its credit, the movie never pretends to have the answer. Moors stunning debut captures a horrific and confining tone of the tragic three weeks in October of 2002, when ten people were assassinated in a random series of attacks spanning across Washington DC, Maryland, and Virginia. \"Blue Caprice\" features two fantastic performances from Isaiah Washington and Tequan Richmond portraying the Beltway Snipers, John Allen Muhammad and Lee Malvo.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "This is film that while put together well doesn't deal with the underlying reasons for this evil just to say that John Allen Muhammad felt wronged by society.  Nevertheless a worth while effort.  B",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "In 2002, ten people were randomly assassinated in the Washington D.C. area by a duo called the Beltway Snipers. Blue Caprice, a film by Alexadre Moors investigates these events.",
      "total_reactions": 0,
      "user": "theseparator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "In my opinion Blue Caprice is by far on of the best films of this year, the story is really interesting, the development is great, the script is awesome, the performances are amazing. Excellent movie!",
      "total_reactions": 0,
      "user": "MarkDetrel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "BLUE CAPRICE is a slow, meandering, quiet and brooding character study that does not translate into any insight or depth. This is just a lot of stuff. Then it ends.",
      "total_reactions": 0,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "This work takes the story of the Beltway killings and strips it of any sentimentality.  Like its subjects, this movie is cold and calculated in its study of the perpetrators and their descent into psychopathy.  These men were depicted as anti-social in the most diagnostic sense of the term - they were amoral, capable, logical killers, completely confident in their mission to expose mankind to its own demons through premeditated acts of violence.  Why then, with such compelling subject matter, did this film feel so long and redundant?  The lack of dynamics in the story telling would be my best guess.",
      "total_reactions": 0,
      "user": "leeofthedell"
    }
  ]
}