{
  "avg_user_score": 5.6,
  "metascore": 40,
  "mixed_rating_frequency": 35,
  "movie_name": "Brick Mansions",
  "negative_rating_frequency": 18,
  "positive_rating_frequency": 28,
  "pro_critic_reviews": [
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "See it for Belle. See it for the parkour. And for the wonderfully magical spectacle of a man flying."
    },
    {
      "critic": "Bernard Besserglik",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 70,
      "summary": "The movie contributes nothing new to the genre, but disbelief is suspended willingly enough once the action gets up to speed."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 67,
      "summary": "In Brick Mansions Walker is understated and tough, a continued testament to his frequently overlooked accomplishments as a performer. You just wish the movie surrounding him was better."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 67,
      "summary": "It’s a beat-for-beat remake of a movie whose plot was never meant to do anything except get characters to jump from rooftops, made by a less confident director (Camille Delamarre, one of the studio’s go-to editors) and set in a culture Besson has never been able to grasp. It’s also a silly pile-up of exaggerated action clichés—and much of the time, it’s pretty fun."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 63,
      "summary": "The action may be serious, but Brick Mansions doesn’t take itself too seriously. It’s a ridiculous movie that has the decency to acknowledge that it’s ridiculous."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 60,
      "summary": "Director Camille Delamarre and Luc Besson, who co-wrote the screenplay, relocate the story to Detroit and tone down some of its (admittedly broad) social satire — although the Parkour remains centre-stage, and is mostly hair-raising."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Brawny, dumb and preposterous, it nonetheless comes tantalizingly close to being a high-impact allegory of race, class and real estate in a postindustrial, new-Gilded Age America."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 60,
      "summary": "Delamarre knows his way around an action scene and keeps the proceedings moving briskly enough, even if the picture clocks in at about 10 minutes longer than its taut, 81-minute predecessor."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "A tediously faithful remake of French filmmaker Luc Besson's terrific 2004 international hit \"District 13,\" the Besson-produced Brick Mansions might have been mildly interesting had it been made a decade ago."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "The thematic stuff, while well-intentioned, is also clunky, and ultimately beside the point. Action, obviously, is what you’re after."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Whenever it features feet flying through the air, Brick Mansions is a pleasure. Asked to do anything else, it’s one stumble after another."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 50,
      "summary": "Mansions is like “Vehicle 19″ or “Takers,” dumb, noisy junk."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 42,
      "summary": "It's fun to watch at first. All that twirling and sliding is a nice change of pace from the usual seat-shaking pyrotechnics."
    },
    {
      "critic": "Chris Klimek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 40,
      "summary": "This is an almost scene-for-scene remake — but not a shot-for-shot remake, which likely would have been more enjoyable."
    },
    {
      "critic": "Jamie Neish",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "It's essentially a collection of shoddily edited action sequences, underpinned by a monotonous narrative that has no purpose, let alone moral heart to reward viewers' waning attention."
    },
    {
      "critic": "Trevor Johnston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "Chases on foot and four wheels keep the thing moving, but apart from a thematic wrinkle where Besson’s clearly siding with the hood rather than the lawmakers, it’s all pretty predictable."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 40,
      "summary": "The parkour is breathtaking and the plot twists are off-the-charts ridiculous."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 38,
      "summary": "Brick Mansions is a non-starter: It chokes on its déjà vu, the hyperactive Mixmaster editing is exhausting and the characters’ banter is so leaden it might violate federal emission standards."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 38,
      "summary": "There's no fun to be had here and if an action movie doesn't make the grade as escapist entertainment, what's the point?"
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 38,
      "summary": "Only the very charitable would characterize this strain of providence as anything other than dumb, or at least incredibly forgetful."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2014
      },
      "score": 37,
      "summary": "Visually, Brick Mansions is a duller and more conventional film than “District B13,“ which was, if nothing else, a sourball-flavored form of eye candy."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "It’s hard to take your eyes off Walker in his penultimate film appearance, cognizant of his mortality and the way he was gracefully aging much in the same way as another fair-haired, blue-eyed actor named Paul."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "It should be wilder, funnier, nuttier."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 30,
      "summary": "Brick Mansions, Paul Walker's penultimate film (prior to \"Fast & Furious 7\"), is a dumb and ugly action picture that works strictly as a reminder of the late actor's head-turning good looks and modest charisma."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "Dystopia’s supposed to be worse than what’s in the papers, fellas. Try to keep up."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 25,
      "summary": "Faced with a story that doesn't make much sense, the filmmakers switch gears and try for a sociological statement - something about the marginalized and the neglected. This makes for a funny last five minutes, but sad, too, because Walker was better than this, even if his movies sometimes weren't."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "If nothing else, it's consistent — consistently stupid, with things like character development and story advancement never getting in the way of another parkour stunt."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 20,
      "summary": "The film is put together too choppily to appreciate the bounce-off-walls athleticism of parkour. That’s a shame, since “District 13” star Belle is known as a founder of the sport."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "It was great to see Paul Walker again - what a loss!  Other than that, this was FAR too similar to the original French film, and the \"bad\" dudes weren't nearly as menacing, for some reason.  And the plot twists toward the end are completely ridiculous.  But the parkour is great fun.",
      "total_reactions": 3,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Wow. The only reason I went to see Brick Mansions was for Paul Walker, and it seems like this was an instant cash in after the great actor's death. That's why Brick Mansions was so hyped. I didn't want a movie like Brick Mansions and IAM sure that you won't too after watching it. The parkour is excellent, the sense of vibe and energy fills the screen with great action and parkour skills. David Belle is on the top of his game. But, if you have watched District 13, there is actually no point in seeing Brick Mansions. Sure, it has some great action and parkour but the exact same story, same twists, some bad acting- ESPECIALLY RZA. Director Camille Delamarre just wanted a washed out version of the great original by Pierre Morel. The acting and the friendship of Belle and Walker plays out well with great acting by the duo. But RZA makes the movie fall though, his character- a coward boss of Brick Mansions slows down the movie on its great potential. The stunts are great but there is no sense it Brick Mansions it feels like a straight-to-dvd movie if it weren't for Paul Walker. One time watch for fans, but really do you want to see District 13 again in theatres, with washed out story and screenplay? Take that in mind before buying tickets for the movie. If you are a die hard Paul Walker and parkour fan, give it a watch.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "The film's opening sequence features French Parkour star David Belle's athletic acrobatics as he outruns and outsmarts dozens of bad guys…and it's downhill from there. He teams up with Paul Walker as a renegade cop (is there any other kind?) to bring down the gangstas. The plot is so ludicrous that it's not worth outlining, but suffice it to say that it's an extremely dumb framework for an onslaught of mostly mediocre fights and frantic chases. The action is usually shot too blurry and edited to frenetically to appreciate the effort. Hopefully, the next \"Fast & Furious\" will be a better film, because this would be an embarrassing sendoff for Walker.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "THIS IS A B MOVIE!!!!  Anyone that rates this movie above a 5 is just feeling nostalgic for Paul Walker. This was the cheesiest/low budget  B movie that I have ever seen in a movie theater. I imagine it was going to go directly to DVD/Bluray but since Paul Walker passed away, they decided to put it in theaters.",
      "total_reactions": 2,
      "user": "Kastle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "While it offers a decent amount of cool parkour action, Brick Mansions fails to justify that. Wooden dialogue, weak characters, a derivative plot and lack of entertainment hampers this down.",
      "total_reactions": 2,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "It's really sad that Brick Mansions is Paul Walker's final movie and since he meant everything so much whether it's fast cars, beautiful women, or the exotic models in or outside of the Fast and Furious series, he made a smile out of everyone to come out and support his loyal fans what a charistmatic and entertaining star he is and now he's in heaven right now. R.I.P. Paul Walker. I felt that Brick Mansions feels too short of a remake of the cult classic \"District B13 (Banlieue 13 in French).\" The good news is that Paul and David Belle did some incredible moves and backflips and it was awesome. The bad news is that director Camille Delamarre and producer Luc Besson of La Femme Nikita fame has really made the film look difficult and sometimes it's hard to understand why you want to remake a 10-year-old French classic. But the script feels weak, I don't know about RZA's performance. It's a so-so but blatant effort and Besson, however, has too much pressure on what's his next goal and hopefully he could fail another movie. Even though it's hard to put Paul Walker on that role, but I think Brick Mansions is a \"thanks, but no thanks\" good but betrayed movie of the year.",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Its better than spidey 2, xmen, capt america 2.  more entertaining than lots of stuff out there. action is legit. would watch it again when it hits cable and that is really the test.  sure the plot is thin and the acting is kind of weak in spots. worth a look if you're looking to waste a couple hours and don\"t want to think or get a message.  similar to jet li movies.",
      "total_reactions": 1,
      "user": "kurasanwich"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "This film is just there not much more than that.  You really don't care about any of the characters and while some of the action is cool other scenes are filmed in that awful slow mo.  There's just nothing to this movie.  C-",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "must admit this film is going to be a flop it started amazing but got silly in places nothing you can take serious it again is average 6/10 but the action was good and there is alot",
      "total_reactions": 1,
      "user": "BrutalBran95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Basically a by-the-numbers action film that would/ should have gone straight to DVD if it wasn't for the Paul Walker thing and the presence of some parkour guru. But those things don't stop it from being a cliched and boring sequence of set pieces.  Car chase, parkour, fight, hot girl, repeat. We all know how it's going to end right from the start. We all know the plot makes no sense and is no more than thinly veiled set up for the action sequences. I left before the end and only stayed that long because I bought a large popcorn.",
      "total_reactions": 1,
      "user": "TheBlob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "A bunch of talking, punching and kicking, car chase, repeat. That's basically the structure of the entire film. However, it still manages to be one of those kinds of movies where it's so stupid and ridiculous that it's somewhat fun to watch. That's how I felt about this film overall. Unfortunately, there's little to no plot in this film. Paul Walker gives a worthwhile performance in his second to last role (Fast and Furious 7 is his final next year.) David Belle pretty much plays the exact same character he did in the original District B13. RZA tried, but made for a rather wooden and undeveloped antagonist. Overall, it's wreckless, but slightly entertaining at the same time. As long as you go in expecting some entertaining action and nothing more, you won't be too disappointed.",
      "total_reactions": 1,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "Horrible style on the plot, likely only way people would see this movie is for Paul Walker as this being his last finished movie.  It has it's moments, but not enough to save this movie.  The poor acting by the french guy and latino lady is another nail in the coffin.",
      "total_reactions": 1,
      "user": "chiefkewj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "I was alone in the movie theater, 200 seats. The problem with this movie is that it´s basically a rip off of the great original banlieue 13 movie, i didn´t except it to be that close to that original, a lot of scenes are 1on1. The banlieue movies are one of my favorites, so brick mansions felt more like a bad deja-vu than an interesting new interpretation. Banlieue 13 has way more style and more important, with raffaelli, belle had an equal skilled partner; cause Walker as a fighter is just **** he looks better behind the wheel- or not. Without the comparison to the original movie, i would´ve rated it higher because it´s a nice little, diverting movie",
      "total_reactions": 1,
      "user": "iCronic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "Cartoony - but has heart.  Part of me wished it was grittier (there's a jail scene that shows how cool it could have been), but once I realized it was supposed to be fun, I just enjoyed the movie.",
      "total_reactions": 2,
      "user": "eponymous_angel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "I never liked the series of films Brick Mansions. Stupid story like music too, I did not like. Generally put the film 2 out of 10 but as it is necessary to recall the old days it will add a little Paul. So toga 5 out of 10.",
      "total_reactions": 2,
      "user": "Riko1590"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Even if we saw this movie a few years ago entitled \"District B13\" an interesting indie film that introduced the world (in a small portion) to the depth and creativity that parkour stunts captivate. So where does that leave us?... ah yes.. District B13 dubbed in French is actually called.. you guessed it, Brick Mansions",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Exciting pakour and fun action are present, but the real appeal for many here is going to be Paul Walker (R.I.P.). Unfortunately he seems wasted in this film. It's the very definition of a dumb American remake, that will probably leave even the most forgiving Walker fan disappointed with one of his final projects.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "\"What a loss. But it's good to see Paul Walker back in action. The trancheur French-parkour, David Belle's action was still hardcore than District 13. RZA was just another good looking villain trying to changed the roles to good-guys. The minor villain such as K2 was really a bad idea for Luc Besson. Hope there is a sequel coming up...\"",
      "total_reactions": 1,
      "user": "GamerStream"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "A great fantastic action-parkour movies featuring Belle new action stunt. Many have disappointed over Walkers death but, he still got his action on Brick Mansions. Still, some kick-backing action was still cooler and awesome!",
      "total_reactions": 2,
      "user": "SeanGamerDays"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Excellent , Great n fantastic movie i must say.......awesome parkour stunts.....Villians good....everything goood Paul waker's last finished movie...so it adds up to these and make the film very \"VERY\" good..",
      "total_reactions": 2,
      "user": "Vzone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "While it offers a fair amount of cool parkour action, the Paul Walker vehicle Brick Mansions fails to justify that. Wooden dialogue, weak characters, a derivative plot and lack of entertainment hampers this down.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "An American remake of the French film 2004's District B13-ten years after the original came out. I wonder what legal issues that represents...as the original is still out there for sale in the big stores like HMV. The remake was a good film-but it wasn't anything different than the original. I would have thought that filmmakers would rather come up with new ideas so they don't have to pay royalties to other producers for using their work as a basis for a \"new\" film. There has been a lot of that lately-Robocop was redone-and the original was also American-and then recently there was a US version of  The Girl With The Dragon tattoo in 2011, a scant two years after the Swedish movie by the same name was made. I don't think there is much you can really say about Brick Mansion's other than it contains Paul Walker who is now no longer with us. The film is OK if you are stuck for something to see or are just curious about the remake. Whats next I wonder-remakes of remakes? They should try to bring new idea to the screen and stop relying on things other contemporary filmmakers have done, in order to sell tickets.",
      "total_reactions": 0,
      "user": "emeraldcity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is NOT good! It is a VERY poor rip off of the original Banlieue 13. That was a good movie, good story, with much better acting. The disturbing thing about this movie is much of it follows the exact same play line, fights, car chases, kidnap the hot chick its all the same. The entire 1st seen is practically exactly the same as the one they ripped off. Even the main man Not the cop Paul Walker, the other guy who is much better all round, he is the SAME guy.",
      "total_reactions": 0,
      "user": "Whydoit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Brick Mansions es una película de acción simple, con momentos clichés predecibles y escenas a veces \"ridículas\" la historia se centra en la rebelión del pueblo contra el gobierno, pues estos se encuentran en una zona abandonada sin apoyo, hasta aquí todo bien, pero la trama cambia por completo cuando aparece un tipo parkour intentando salvar a su chica, creando una trama totalmente distinta y dejando a lado lo principal, Paul Walker, de ser un policía (típico papel de el) que no es maestro del parkour, en menos de 10 minutos es un experto ¿PERO QUE? Si es algo estúpido, pero la película así de lo pone, el final es el típico de una película de estas, un giro inesperado que hacer que los buenos sean malos y los malos sean buenos.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Routine all the way, although Belle's moves are thrilling to watch.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}