{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 85,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Bridegroom",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "Despite the pain, sadness and vast emotional upheaval depicted here, Bridegroom is also a movie filled with hope and passion, dignity and pride, and many stirring pockets of joy."
    },
    {
      "critic": "David DeWitt",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "What Bridegroom celebrates is not simply gay rights; it’s the human spirit."
    },
    {
      "critic": "Ernest Hardy",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "Without forcing the material into facile uplift, Bloodworth-Thomason still edges it into the realm of inspirational, never overplaying the anguish or soft-pedaling the bigotry at the heart of the story."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "It may not be balanced or especially sophisticated filmmaking, suffering from a misty-eyed oversimplification of what relationships (gay or straight) actually demand. But for many, it’s precisely the sort of emotional eye-opener needed for young people to find inspiration and naysayers to reconsider their attitudes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "This is the most moving film I've watched in a long time. It was really touching and I'm not sure how I feel about the world after watching it  partially inspired, partially saddened, but this film is definitely a conversation starter and a must watch. I wish Shane all the best and this film really captures the turmoil he went through with his partner's death. I hope Tom's parents come to their senses one of these days and realize how shameful their actions pre and post-death were.",
      "total_reactions": 1,
      "user": "East56"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "This was the most heart-touching documentary I have ever seen in my life. It captures your full attention just the way it starts. Loved the way how the story is narrated after it. I would be lying if I say I did not cry while watching this. I was sad for an entire week thinking how it must feel. Shane is very strong and his courage and strength inspired me very much. For me, Shane is the face of LGBT rights.",
      "total_reactions": 1,
      "user": "Ssheoran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "A bona fide tearjerker! I am oblivious of Shane’s youtube videos, which kickstarts this feature-length picture, but the film needs to be seen by literally everyone, whether for or against the same sex equity, it is deeply heartfelt and perspicaciously educational, I think whoever as long as hold a small fraction of mercy in their hearts, regardless of their religious convictions, after watching this film, it will be a game-changer for the prejudiced and a touchstone for a mightier love above social class, creed, race, color and gender.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "This amazing documentary is at once both life affirming and heart breaking. It tells the story of Tom and Shane who genuinely come across as 'the perfect couple' only to have their idyll shattered by a tragic accident. The film traces the now all too familiar story that they, as gay men growing up, suffered at the hands of small town mentalities. Testimonies lovingly articulated by family and friends bear out that their six year relationship really was one that most people would aspire to. Events following the accident appallingly demonstrate how cruel and selfish the actions can be by the people who purport  to love us the most, our parents!",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "I believe this movie provides a different view for the people who may not believe in gay rights. It allows the viewer to think, \"Wow, what if that was my significant other.\" I enjoyed this movie because it gives a different outlook on love.",
      "total_reactions": 0,
      "user": "nk96paysour"
    }
  ]
}