{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Buck",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 100,
      "summary": "Buck is a movie to be revisited again and again, like passages from a satisfying self-help book. Riding experience isn't necessary to realize how extraordinary this man and his calling are."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 100,
      "summary": "It keeps you fascinated, even enthralled; elicits astonishment, even wonderment, and makes you grateful for the chance to meet someone remarkable."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 91,
      "summary": "The result is a portrait that expertly mirrors its subject: Buck is shaped with the same economy, restraint, and unfussiness as the man, to unexpectedly inspiring effect."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 91,
      "summary": "The riders who appear in Buck seem almost uniformly exalted by their contact with Brannaman and his methods."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 90,
      "summary": "A haunting, beautifully told tale about a genuine American original."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 90,
      "summary": "Meehl, in her directing debut, is attuned to the rhythms of Buck, who's attuned to the horses."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 90,
      "summary": "In some sense it was beauty that saved Mr. Brannaman, that of his conscience and that of horses, which, having been tied to humans long ago, became companions, workers and for some, as this lovely movie shows, saviors."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 88,
      "summary": "Seeing Brannaman work in the warm, sun-dappled documentary Buck makes it clear why he was such a perfect fit for Redford's film: Few people can handle horses the way Brannaman does."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 88,
      "summary": "Beautifully but simply wrought by director Cindy Meehl, this deft documentary is a poignant reappraisal of what it means to be human."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 88,
      "summary": "You don't have to be a horse nut to fall for Buck, one of those rare documentaries whose subject is so inherently fascinating that a fictional character could hardly compete."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 83,
      "summary": "The character who emerges in the breezy, somewhat meandering Buck is plain-spoken, heartfelt, compassionate, witty, and wise.  His horse-training technique is based on understanding the psychology of animals and on attuning his human and equine clients with one another."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 83,
      "summary": "Buck Brannaman, the subject of Cindy Meehl's engaging documentary profile Buck, has a warm presence and knows how to tame horses better than anyone else."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "Warmly engaging Buck is a portrait of Buck Brannaman, a trainer whose remarkable way with equines provided a model for \"The Horse Whisperer\" in both novel and movie forms."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "Buck has the air of a beautiful little mystery; even knowing the uplifting outcome, you wonder at the strength that brought him to this place."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "The film is deeply moving yet never maudlin in telling this hard-knocks-but-hope-infused story."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "Soft-spoken and stoical, Brannaman is a firm but sensitive presence in front of the camera and facing down a spooked horse."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "This film's effectively wrought communion between once-spooked man and animal is more than enough for any entertainment. It rides easily into your heart."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 75,
      "summary": "The documentary shows Buck over the course of a year, as he travels and teaches. Along the way, Robert Redford is interviewed about Buck's contribution to \"The Horse Whisperer\" (1998). Redford likes him, so he can't be a phony."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 75,
      "summary": "What I was left with was the goodness of Buck Brannaman as a man. He was dealt a hand that might have destroyed him. He overcame his start and is now a wise and influential role model. He does unto horses as he wishes his father had done onto him."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 75,
      "summary": "Perhaps Brannaman's art is too subtle and instinctive to be captured on camera, but it's a shame Meehl doesn't do a better job of capturing exactly what makes him, by all accounts, a miraculously successful trainer."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 70,
      "summary": "Possibly the touchy-feeliest cowboy movie ever made."
    },
    {
      "critic": "Mark Holcomb",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 70,
      "summary": "Meehl finds the real story in Brannaman's fractured past as a child celebrity trick-roper who, along with his older brother, Smokie, was systematically abused by his alcoholic father."
    },
    {
      "critic": null,
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 70,
      "summary": "A quietly captivating portrait of an unlikely character, Buck is as modest as its subject and wins viewers over just as easily."
    },
    {
      "critic": "Ray Greene",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 70,
      "summary": "What makes this movie truly special is that the source of Buck's uncanny gift is actually an acute childhood sorrow."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2011
      },
      "score": 63,
      "summary": "Brannaman is a fascinating character, but Buck is so tightly focused that only avid horse lovers will find it appealing."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 63,
      "summary": "The man's mythology precedes him, and it's the movie's failing that we don't understand how or whether he uses that mythology because he knows it's good business."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 63,
      "summary": "Taken on its own merits, this profile of \"Buck\" Brannaman is a pleasant and touching but somewhat superficial insight to the man and his methods."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "Even if we can't live his cowboy life, Buck Brannaman's world is well worth visiting."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Meehl's documentary features plenty of interviews with cowboys and ranch hands who've had their lives – and their horses' lives – changed by Brannaman, but it lacks the literary or cinematic magic of either version of \"The Horse Whisperer.\""
    },
    {
      "critic": "V.A. Musetto",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Buck is best left to TV, where it will land soon. It's \"The Horse Whisperer\" that should be seen on the big screen."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "Life lessons abound in Buck, most of them tied to endlessly reiterated comparisons between man and horse."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "A good documentary is entertaining, educational, informative and usually makes you leave the theater thinking long after the movie has ended. While many documentaries have a political or moral stance, it is the rare documentary that fulfills all of the criteria for a good documentary, yet really has no purpose other than to enlighten. \"Buck,\" is the documentary of real-life horse whisperer Buck Brannaman, his path to the life he chose, the lessons he learned as a child and how he took the right path as an adult in spite of his past.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Buck is someone we all should learn from, and a remarkable man.  This movie doesn't quite do him justice.  Unfortunately, this movie could have been culled down into an hour tv documentary and probably have been just as good.  The producers may have borrowed from Buck a little too much and failed to plum the depths of the man, instead merely letting us hear a whisper of him.",
      "total_reactions": 0,
      "user": "Eden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Truly this is great movie for all ages.  It has a unique style of a movie with a critical look at the side of the animal as part of our lives.  The acting is a real pleasure to watch with the reality of both living and helping others to help themselves and their animals fit together in our lives.  The family aspect was vital in making and location filming adds so much to its poignancy.  Each member of the family with Buck work together and become a important force for each family and  animal they help. Outstanding filming and narration from friends, coworkers, put this movie into the top 10 of the year for me. Hope it can get vital distribution throughout the country.  A screen gem ! 5 out 5 for me",
      "total_reactions": 0,
      "user": "Veshay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "I thought the movie was very real.  Because it was real, it said a lot about the frailties of humans, even the frailties of Buck.",
      "total_reactions": 0,
      "user": "Mhbytb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A truly inspiring emotional movie about a fascinating individual. Pulls at the heartstrings without pandering and is a nice little piece of Americana as well.",
      "total_reactions": 0,
      "user": "toemac65"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Although Buck may not appeal to most people (that goes for me too), this short documentary demonstrated that it deserves the title of \"unexpected treat\". The story itself is not very rich or elaborate, but Buck Brannaman's analogies and his real life story are enough to steal anyone's heart. \"Horses are incredibly forgiving. They fill in places we're not capable of filling ourselves.\" ~Buck.",
      "total_reactions": 0,
      "user": "CamilloPiarulli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "This documentary is the best ever and a keeper, no matter if you're a horseman or not. Also, as a person whose family and extended family has experienced emotional and physical abuse, many more great documentaries about this very subject need to be made, because this is really quite crucial to all our understanding (also considering all the other bad films and forgetful nonsense coming out these days). I have now viewed it a few times in the year since it came out and am still mesmerized by it. Personally, I'd probably give Buck my presidential endorsement. Also, the fact that the average review on here is not 5 stars (which is what this deserves!) is definitely a sign that there is still much abuse and callous insensitivity going on in America, and in secrecy, and I know this to be the case!",
      "total_reactions": 0,
      "user": "pdw123"
    }
  ]
}