{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 74,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Bully ",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 37,
  "mc_pro_critic_reviews": [
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 90,
      "summary": "Bully forces you to confront not the cruelty of specific children - who have their own problems, and their good sides as well - but rather the extent to which that cruelty is embedded in our schools and therefore in our society as a whole."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 90,
      "summary": "A documentary as vivid as any horror film, as heartbreaking as any Oscar-worthy drama."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "The best social documents on film do more than show you what's wrong in the world – they make it personal. Bully does that with a passion."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "Bully forces audiences to face actions that are unthinkable, inexcusable and excruciatingly sad. It offers no solutions, only the testimony of brave youths."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "The purpose of Bully is to educate and promote discussion. If the problem is not solved, there will be more Columbines and additional stories like Tyler and Ty's."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 88,
      "summary": "Lee Hirsch is certainly one who is making a difference. I endorse him and his brave, powerful movie and urge you to see it for yourself. You might leave Bully with rage, but you will not leave Bully with indifference."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 85,
      "summary": "All I can add to the discussion is the fervent hope that any parents, teachers, administrators or students who see it will immediately start clamoring for it to be shown at their next PTA meeting."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 83,
      "summary": "Some movies uses make-believe to make you squirm or cry or rise to righteous anger.  Bully does all of that with reality."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 83,
      "summary": "As long as the MPAA is issuing its cavalier decrees, though, they're the ones acting like bullies."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 80,
      "summary": "This is nothing if not an important film. It is important for the bullied to see, if for no other reason than to realize they aren't alone, and it is important for the bullies to see as well as for the parents of both groups so everyone can understand just how devastating the problem is."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "The film's power is undercut by its narrow geographic focus, which seems to associate bullying with conservative or working-class areas in red states. The filmmakers could easily have found similar cases involving the children of urban sophisticates."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "If you feel like you've already read quite a bit about the documentary Bully, you have. But that still won't prepare you for the experience of seeing it."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "An earnest and moving documentary made for and about tormented preteens and teenagers."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "An intimate reflection on the bullying epidemic that makes its points quietly and succinctly."
    },
    {
      "critic": "Ronnie Scheib",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "Lee Hirsch's \"The Bully Project\" serves as a call to action against abuse of students by their peers as it follows, over the course of a year, five sobering case histories of unrelenting schoolyard persecution."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "The best Hirsch's film can do, in the end, is remind us that bullying means more than we admit, and its effects aren't always immediately clear, even to loved ones."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Bully is a sincere documentary but not a great one. We feel sympathy for the victims, and their parents or friends, but the film helplessly seems to treat bullying as a problem without a solution."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Bully is no more incisive than a Dateline NBC segment on the subject, although with a PG-13 rating it now can be a classroom tool for discussion."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 75,
      "summary": "Indeed, like all bureaucracies, the educational version is a bit of a bully itself. In Sioux City at least, the official response to bullying is to recognize its existence but to deny it's an \"overwhelming issue,\" and retreat behind the comforting bromide that \"kids will be kids.\""
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "It's powerful stuff, and probably a more effective approach than a series of talking heads decrying bullying, which is estimated to affect 18 million American children."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "It's true that the language in the film can be harsh -- but it's also very obvious that kids are hearing this kind of language in schools every day, much of it directed at them."
    },
    {
      "critic": "Benjamin Mercer",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "It has a clear and calm approach to storytelling and some interest in the quality of its handheld images."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "Lee Hirsch and Cynthia Lowen, the filmmakers who made the moving documentary Bully, don't try to answer any questions. They avoid charts and graphs, talking heads and sociology. Their approach is more direct and, perhaps, more effective."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "Bully is repetitive and not especially artful, but children who allow themselves to see the world through the eyes of the film's victims will never be the same."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 67,
      "summary": "There are many appalling moments witnessed and described in Lee Hirsch's documentary Bully: children beaten and humiliated, ostracized by their peers and misunderstood by their parents, left to face an apparently heartless world without a soul to turn to."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 65,
      "summary": "Bully is much better when it sticks to simple storytelling. And storytelling, not grandstanding, is the thing that just might grab the attention of, say, school administrators, people who can have some effect on how bullies are dealt with."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Bully is a good start to a necessary conversation, but its loving voice is likely to be drowned out by haters who hide their own wounded hearts behind Internet pseudonyms and broadcast microphones."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "This intimate, straightforward, often wrenching portrait of five families dealing with bullying and its aftermath doesn't hold many surprises at a time when such campaigns as \"It Gets Better\" and special programming on kids' cable networks are bringing the issue to the fore."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 63,
      "summary": "Bully contains some moments of real alarm and, in the school bus, one nightmarish motif."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Incredibly enough, it seems many people still believe that bullying is just a matter of \"kids being kids.\" Until that attitude changes, this film should be considered required viewing for every parent, teacher and teenager in America."
    },
    {
      "critic": "Nick Schager",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Graceful cinematography captures the loneliness and isolation of these kids with understatement, even when the director succumbs to twinkling piano that pulls a tad too hard on the heartstrings."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "This antibullying advocacy group could not be more well-intentioned or needed, but suddenly, the sneaking suspicion that you've merely been watching an extended PSA for the grassroots organization starts to take hold."
    },
    {
      "critic": "Kalvin Henely",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Leaves us moved by poignant scenes of victims' shattered lives, but, for reasons unclear, keeps the bullies themselves largely out of our reach."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "This is a review of the movie, NOT the message. It follows several parents and their middle school children, who are subject to taunting and physical abuse by their peers. There's too much filler footage of people walking and performing mundane activities, which renders the pacing tedious. Also, the camera loses or racks focus at least once a minute. Even if this is a stylistic decision, it's simply shoddy filmmaking. This could have been a moving 30 minute short, but there's simply not enough drama or emotion to compellingly convey the impact of bullying.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "You know, I don't need this to tell me what I think everybody already knows: Bullying is bad. This is all just a collaboration of tear jerking families; please note that I do feel bad for the families who's children are being put in these horrible situations and in no way am I ignoring the seriousness of the topic, but that's all this is. It just shows these families who's kids are being bullied, and that's it. The major problem with this is that it doesn't offer any solution, and personally I think because there is no solution. Bullying is evil; to an extent, and we all know that with good there's always going to be bad. It's how the world works and we may wish for a world of purity and innocence, but then it wouldn't be called living. Unfortunately though some people have bigger misfortunes than others, we feel sympathy for them for their loss, but it seems almost wrong to release their stories as a theatrical film. That's another thing that bothered me, if the director wanted to spread the word of this, why didn't he/she just put it on a website or something? The film wasn't a great success at the box office, so is it because people don't care or because they don't want to see a cruel and just downright depressing feature. I personally think that one could get the message across better if they made it not as depressing, but at least offered some positive atmosphere as well.",
      "total_reactions": 2,
      "user": "Skullgirlsfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "It's simply asinine that the MPAA would refuse to give this film a PG-13 or even a PG rating.  For the life of me, I can't even remember a point in the movie where the F-bomb is spoken.  This movie needs to be seen in middle school assemblies across the country to draw greater attention to this scourge.  I remember when David Toma visited thousands of schools in the 80s scaring the hell out of us kids about the dangers of drug and alcohol abuse.  It was effective!  This movie clearly has its faults - I would have loved to have seen at least one affluent community included in the mix.  Bullying is by no means limited to rural, Bible-belt, and middle-class communities. There are mean girls, social media predators, etc. in big cities, on the coasts, etc. Obviously, they had to pick a small slice of the country in which to examine the issue, and it's largely effective. Obviously, I don't have all the answers, beyond simply urging those to befriend and stick up for those being bullied. I would urge school administrators to red-flag bullies on their permanent records with a standardized \"bully\" label that would follow these kids through their college application process (though college is probably not a high priority for many of these students). Suspensions and expulsions for bullying need to happen with greater regularity. I feel for the parents of those deceased bullying victims and applaud them for speaking out, which I'm sure is incredibly painful.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Hard hitting, thought provoking, heart-rending and timely, \"Bully\" is a documentary that approaches an all too familiarly overlooked subject in a way that hasn't yet been explored; its graceful, and sure to pull on the heartstrings. However, unlike its unimpeachable intent and central message, \"Bully,\" the film, undermines the totality of the subject by avoiding to satisfy it on an intellectual level; not a single interview with the titular contributors (bullies) or even a mere statistic solidifying the real-life gravity of the issue. For everytime a tear is shed, another opportunity is flubbed away from making it truly great and equally, memorable. As it is, \"Bully,\" is a \"cause for change\" docupic that does offer moments of arising deep-seated pathos and stirring those around those emotions, but the erratic editing and the degree of simplicity derived from the omission of key tangibles, keeps back what could have been a game-changing medium for ages to come. Still among the best documentaries of 2012.",
      "total_reactions": 6,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Awesome documentary really. The development of the documental y really exactly. Bully is a demand for this actual problem that much kids live, and be a good pack.",
      "total_reactions": 5,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "If this video needs to be seen by everyone, why donâ",
      "total_reactions": 3,
      "user": "Derpa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "â",
      "total_reactions": 0,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This is an incredibly sincere documentary about a very real problem plaguing today's public school system.  Bully wisely opts to simply tell the stories of these young victims thus allowing us to put ourselves in their place.  Still, a part of me wishes that the film would have gotten just a little bit angrier at times and called the bullies onto the carpet to explain their actions.  But change has to start somewhere and Bully is a promising step in the right direction.",
      "total_reactions": 0,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "Bully is only sad for about 3 minutes, but that doesn't mean it's a no-good documentary. The message is meaningful and many of the tales depressing, but it seems to be a bit volatile and have many of its morals jumbled up. It barely ever touches the side of the bullies (which may seemed biased, but bias is the only proper method of propaganda), and seems to show a girl who brought a gun onto a school bus as a hero and not a wrongdoer. This film is well made with good cinematography, and is very atmospheric and emotional. Overall, Bully is good, but it's hard to fully agree with what they are trying to make this movie out of.",
      "total_reactions": 0,
      "user": "cameronrules36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Today kids are killing themselves and each other at an alarming rate. The one thing all these cases seem to have in common is bullying. There was bullying when I was a kid, but 3 PM meant the end of the trouble. We had the rest of the day, the weekend, and the summer to recover. The advent of social media and cell phones has made the respite obsolete, as now, bullies can torture their victims 24/7. Bully is an award winning documentary that looks at the problems of bullying and shows the effects it has on children's lives. What I like about this film is that it showed a whole group of students from different economic, social, and ethnic backgrounds. What I took away is that anyone who is even slightly different in anyway, could be a target. What I didn't like was the solutions the film offers. Their solution is to tell someone and to stand up for kids you see being bullied, but anyone who has been bullied will tell you that those are not good ideas. Often times telling someone will anger the bully and make it worse, and as for standing up for other kids, often times that makes someone who wasn't previous bullied, a target. I think the answer is two-fold, in that first, parents need to tell their kids, from a very earlier age, that being unique, different, and even weird are admirable qualities in a person. I also believe the schools need to be tougher, because honestly, does anyone really think that giving a bully detention, telling them they're not nice, and that their hurting other kids really does anything? I think bullies need a taste of their own medicine, to feel those powerful emotions for even for just one day. You can talk until you're blue in the face, but you don't really know what something is like until you've experienced it for yourself.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "It",
      "total_reactions": 0,
      "user": "libbycritiques"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Bully is honestly a very darkly themed documentary, but pushes on an issue that should be stopped. I think it is also a very well filmed movie as well, and really tears at your heart. It is sad, yet inspiring as well. Seriously I think any one and every one should watch this movie. Weather your in middle school like me or just an adult.",
      "total_reactions": 0,
      "user": "melli06"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "If you can watch this film without tears coming down your face, well I'm convince you don't have a heart. Purchased it for 10 dollars at our local Walmart. For ten dollars there is no excuse not to own this if you're a parent. I plan on showing my daughter this film when shes old enough. Powerful documentary. I've seen a follow up on it on CNN's Anderson Cooper lately and its incredible to see how this film gave one of the young men who was bullied some new found confidence. Truly awesome to see! This film has the power to change lives. When making a documentary you couldn't ask for a better outcome than that!",
      "total_reactions": 0,
      "user": "WayneThomas412"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "An emotional thought provoking movie.  It makes you wonder if you've done enough in your life to make a difference.  It is well put together and makes you think about what can be done to change such bigotry and hate.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "THIS IS AN EYE OPENER. I never viewed bullying like this. Its a MUST SEE. I do caution the average viewer of this film, because it is full of mourning and sadness, for it expresses the FULL story of every kind of bully instance that has a harsh result.",
      "total_reactions": 0,
      "user": "calebstamm"
    }
  ]
}