{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 33,
  "mc_movie_name": "Buried",
  "mc_negative_rating_frequency": 69,
  "mc_positive_rating_frequency": 135,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Anyone who denies the greatness of this film simply couldn't stomach it. Even though-evidently-some find it difficult to watch, I found it not as bad as the whiners claim it is.  You'd typically expect an entire film set on once scene to get boring but believe me, THIS WAS AWESOME! Ryan Reynolds has won me over.",
      "total_reactions": 1,
      "user": "acescarter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "This film is about one man inside a six foot wooden box.  Where will the movie go?  Will he get out?  How would you feel if you were in the same situation?  What happens when Ryan Reynolds is given more to do that be wide-eyed and good looking in sub-par chick flicks?  The answer to these questions and more can be found by watching Buried, an original and well-crafted tense thriller/horror which is a pure antidote to high-octane ensemble cast blockbusters but no less thrilling for it.  A must-see.",
      "total_reactions": 1,
      "user": "schnide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Buried is a thriller, claustrophobic and entertaining flick than keeps you watching throughout the 90 minutes of Ryan Reynolds being buried in a coffin.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Director Rodrigo Cortes' \"Buried\" had a decent ending, but the movie 'buries' all of it with its slow building tension and a lone, powerful performance by Ryan Reynolds as Paul Conroy.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Unbelievable. Ryan Reynolds sure showed me. He plays Paul Conroy with such realism and intensity that I couldn't help but root for him. Buried is a very intense 90-minute thrill ride that never lets up. The pacing is absolutely amazing, especially for taking place in a small box during its entirety. This is an exercise in minimalist entertainment that had me rocking on the edge of my seat and gasping for air during the final 10 minutes. Searingly intense.",
      "total_reactions": 3,
      "user": "FrozenStar90"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "Such a fantastic film. There's so many thrills, and I watched this the day after I watched \"Unstoppable\" so it was another film that gave me tonnes of thrills. The ending was so unexpected and there were so many twists in the film that you couldn't help but go with it. Anybody into thrillers? You will love this. It takes a little while to pick up though, so the first 15 minutes is just Ryan Reynolds struggling and shuffling.",
      "total_reactions": 3,
      "user": "Kranitoko"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "I will admit- I'm not a Ryan Reynolds fan. Whenever I see him on TV or in a movie, I expect his role to be that of a comedian, or at least have some funny lines. But with Buried, my opinion has changed entirely. In this movie, it follows a journalist who has been buried alive in a coffin. All he has is his phone, a knife, and his clothes. The movie will keep you tense and on the edge of your seat, as the atmosphere in the movie is simply unmatched by any other film. And then there is the ending. It ends in a moment of extreme desperation, one that has you begging for a different last scene. If you enjoy movies with good atmospheres, there is none better.",
      "total_reactions": 4,
      "user": "Frostbite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "This movie is terrible. It was a 2 hour waste of time. He is stuck in a box the whole time, then he dies.",
      "total_reactions": 2,
      "user": "GrammyGrim0"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "After 10 minutes, I knew the whole movie would be a boxed movie. Nothing makes sense in that movie and all is overly exaggerated to make up ridiculous situations. I did not even feel any emotion when he was talking to his wife, his mom... it smelled fake all the way.  Or is it that I have just watched the great \"127 hours\" one week ago and I am still so invigorated from seeing it !  Similar type of movie but more intense. No need to make up fake discussions and extra situations (like a snake) to create intensity and emotions.",
      "total_reactions": 2,
      "user": "Xeliax"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "WOW! This was honestly the worst, cheapest, most boring movie I have ever seen! The whole movie is one actor in one box, are you serious? I think i payed more for the movie, then they did to make it! I was upset for wasting almost 2 hrs of my life on something that ridiculously dumb! DONT EVER WATCH THIS!",
      "total_reactions": 3,
      "user": "honeyNY"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "the movie started well.. was moving well.. but i was disappointed in the end because of its negative ending.. this is slightly an overrated movie..the ending definitely ruined the movie.. otherwise it would have been a great movie..",
      "total_reactions": 3,
      "user": "abi_abhiabi"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Worst movie I've ever seen! Holy crap! I can't believe there's not a flood of hate for this movie! Read the critic reviews and pay attention to the details: \"Ninety minutes of being buried alive with Ryan Reynolds\" \"Rodrigo Cortes keeps the action bound to the box, limiting his lighting to naturalistic approximations, so that much of Reynolds's performance consists of him grunting and heaving in the dark.\" \"Your enjoyment - if that's the right word - of Buried will hinge on two things: Your ability to tolerate situations in which characters are confined to very tight spaces, and your willingness to be emotionally manipulated in the cheapest way imaginable.\" Bottom line: the movie is 90 minutes of staring at a dimly lit Ryan Reynolds as he grunts and makes pitiful attempts at creating drama and suspense. Failing so epicly, I felt morally obligated to make an account on this site. If you value your time or your brain cells, take a PASS on this movie!!!",
      "total_reactions": 10,
      "user": "Florain"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "This was a terrible movie, definitely one I struggled to continue watching. The entire movie seems to have a predictable plot along with boring events happening, all of it being shot from in the box. To give my full feel of this movie, let me put it this way: probably the most expensive thing was Ryan Reynolds - half of the budget of the movie going to paying him for being in it. Otherwise, a box and other random items couldn't have been expensive, and weren't even used the best. I wouldn't ever watch this movie again.",
      "total_reactions": 4,
      "user": "Aniari"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "This movie is so bad that if someone made me watch it again i would ripp my eyes. i was going to throw my remote at the tv! at the end!  Would rather watch a tree for 12 years then to watch this again",
      "total_reactions": 9,
      "user": "bruiedsuxx"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "This movie has some merits, like make real the impression to be buried, but itÂ´s so boring the unique scenario. The scenarios are so expansive, then this movie is most cheapest of history. Because this all the thriller, tension, roles are concentrated in only actor and box. I really do not like.",
      "total_reactions": 8,
      "user": "RVale"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "If you can be patient and attentive to a movie about a guy being in a box, you still might not want to see it. I am mixed about the movie; watch it if you really have nothing else to do.",
      "total_reactions": 1,
      "user": "Blitzcrag"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "While I do appreciate the concept of telling a good story in a limited setting and budget and I have enjoyed many movies which have done this in the past, I did not however find Buried very compelling. The camera shots were the movies strength along with the changing colour schemes as the movie progressed, Reynolds was also well acted. However the story never seemed to be very interesting and I was bored by the end. There are some things to learn from Buried so I recommend to film makers but the over all story was not interesting. Pass",
      "total_reactions": 1,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Paul Conroy(Ryan Reynolds) isn't dead, but the American is halfway there; he's buried; he's a goner, so for all intents and purposes, he's dead, as are all the phantasmagorical residents of St. Agnes Cemetery, the people who know Francis Phelan, the patron saint of drunkards from William Kennedy's Pulitzer Prize-winning novel \"Ironwood\". The washed-up major league ballplayer's loved ones conduct their lives in pine boxes, under the dirt, an imitation of life, his parents, his infant son, subterranean and regimented. They're zombies who became mixed-up angels, playing the role of guardian instead of brain-eater. It's a lifestyle that the American in Iraq has come to know; his life, suddenly interrupted, when insurgents bomb a convoy of trucks driven by apolitical truck drivers, like Paul, the \"lucky\" one, the survivor, who stops being a zombie, perhaps realizing, finally, that he's complicit in the war, soldier or not. Alone, but not alone, since the Blackberry his captors leave behind, allows Paul to call for help, and more importantly, give people the vicarious experience of being him, attributable to the wireless gadget's video recording and subsequent transmitting of the hostage \"tape\" into cyberspace. Being her, being Saskia(Johanna Ter Steege), it's what the killer in George Sluzier's \"Spoorloos\"(American title: \"The Vanishing\") promises Rex(Gene Berloets), if he just drinks the coffee spiked with sleeping pills. Released during the pre-Internet days of the late-eighties, when rotary phones were on the wane, but still in use, in which the limitations imposed by an analog-based technology would have made it harder for millions of people to \"share the exact same experience\"(translated from the Dutch), the tortured lover, bereft of the futuristic hypothetical that Saskia's final moments could turn up on YouTube, ends up drinking from the cup, and becomes a victim of YouDie. Rex is the only one who knows how she died. When the effects of the drugs wear off, he starts screaming, having neither the technological means(a cell phone), nor kung fu(the hands of \"The Bride\") to escape; he doesn't have a prayer, as \"Spoorloos\" ends on an unsettling note of unfathomable suffering. The moviegoer never gets comfortable with the idea of being buried alive. Brevity is the key. \"Buried\" overstays its welcome. Whereas(in \"Ironwood\") Francis' father \"smoked roots of grass\" and mother \"wove crosses from the dead dandelions and other deep-rooted weaves\" as they lay in their graves, likewise, a semblance of culture makes burial seem almost tolerable, in which the Blackberry slowly normalizes Paul's once-frantic predicament, as the film's extended running time(as opposed to \"Spoorloos\") allows the moviegoer to orientate himself with the extreme spatial dimensions. Knowing this, the filmmaker resorts to cheap tricks as a matter of readdressing Paul's dislocation, like the episode with the snake, and the episode with his mother, shameless manipulations both, of our phobias and heartstrings, respectively. \"Buried\" may be experimental in form, but the content is pure Hollywood, depicted in a filmic language that's minimalist, but it's minimalism by default, dictated by the confines, not by existentialism. Paul is always doing something; he never just lies there and contemplates his inevitable demise, as Rex does, when he simply whispers his lover's name. \"Buried\" could not have been made without the advent of the cell-phone. Just like contemporary life, a person who relies on on-line friends, a whole host of faces and disembodied voices, doesn't need to be in a coffin to be isolated. Similar to Joel Schumacher's \"Phone Booth\", this paean to the information age represents a passing of the torch, as our phone booths slowly turn into ruins, without lament, by us, or perhaps, even by Superman. \"Buried\" is a perfect expression of our love affair with technology, in which man and phone are entombed in a parasitic relationship.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "great thriller. Every second has some sort of tension. Whether oxygen wise, or what he has to do, there's tension to he highest degree. The ending wasn't great, but its realistic. Watch it, its really worth the time. Plus, Ryan Reynolds was terrific in here.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Awesome movie! Great Ryan Reynolds, but above all this is one of the best executed movie of the year. The somewhat damning undertone about America and the Iraq war could have been buried a little deeper within the subtext but Cortes pulls off a pretty impressive feat with this hard sell.",
      "total_reactions": 0,
      "user": "uljanov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Truly, I feel a round of applause is needed for the director Cortes for making a skillfully crafted, vivid, nail bitting thriller inside the space of less than 0.5 square meters.  Not recommended for those who suffer from claustrophobia.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "http://mushreviews.blogspot.com/2011/03/buried.html",
      "total_reactions": 0,
      "user": "Kingmush"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "My friend who I saw this movie with hated it, thought it was boring. But I thought it was a good suspense/ action type movie. It showed only Ryan in the box but that is what made it so suspenseful for me. It really made me feel like I was buried with him. The suspense in this movie was alive. But the fact that there is only so much that can go wrong when you are in a box under ground I felt slightly bored in some parts of film, but the boredom only lasted for a couple of minutes. Recommended as a rental.",
      "total_reactions": 0,
      "user": "Kandraa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "A high-concept thriller that works solely because of Ryan Reynolds' performance. If a less talented actor was featured, this would have been a long-ass 90 minutes. Instead, it is an edge-of-your-seat thriller very much worth seeing in theaters. My only complaint was that the political statement it was trying to get at was kind of muddled and out of place.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I was a bit apprehensive about this one... 90 minutes with a single actor in a box. But it works, it manages to build the tension and sucks you into the movie. It is not the movie of the year, but it is truly an \"enjoyable\" experience.",
      "total_reactions": 0,
      "user": "joseross"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "This movie was spectacular, a true masterpiece, it's intense and honestly had me dying to see what would happen next, you think just watching Ryan Reynolds laying in a box for 95 minutes would be boring, your wrong, I've only watched one other of his movies, as honestly they just look stupid, but after the outstanding performance he gave in this movie I now want to watch his others, this is a must watch with only one scene involving a snake feeling unnecessary, seriously go out and watch this movie, you won't be disappointed.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Going in to this film i wanted to feel a claustrophobic as possible, luckily the cinema screen i viewed it in only had 4 rows of seats and about 5 people watching it with me. I do find Ryan Reynolds very funny so i felt it was time i saw him not be the funny man and i wasn't disappointed, i was with him every step of the way, i felt anger, sadness, hope and i did get a bit choked up at the end, reaching into the air like a mad man as though i could save him. This is defiantly in my top ten films of the year and i don't really understand why its not getting any award hype, must be some rule that rules it out.",
      "total_reactions": 0,
      "user": "doricdom108"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "**** A! This is what a real movie is all about. No need for flashy effects, just plain good acting and cool plot. It was pleasure watching great actor as r.r to perform in front of camera for 90 minutes without real partner it was sort of monologue-movie. Yeah, really liked it, everybody should watch it!!!!",
      "total_reactions": 0,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "This film sounds good. I'd like the ability to 'save' films to my profile so I have a list of them to watch later, which is pretty much the reason why I signed up, but apparently the only way to do this is to write a review.",
      "total_reactions": 0,
      "user": "wjw75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Brilliantly terrifying and emotionally intense, Buried is a suspense with a political allegory that gets under skin and haunts your subconscious. Pros: Ryan Reynolds' most groundbreaking performance; immensely unique direction. Cons: Some of the content is undeniably unreal.",
      "total_reactions": 0,
      "user": "KendylKlownfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "A suffocatingly well executed idea which surprisingly has a lot more to offer than you might think. The film is just as the title leads you to believe, Ryan Reynolds wakes up one moment and realizes he's been buried alive! Reynolds plays Paul Conroy a truck driver who's been contracted to \"rebuild Iraq\" (of course after we've invaded and destroyed it). Awakening imprisoned Paul does what everyone would do, screams as loud as he can for help and tries and force his way out. However the obvious solutions prove to be futile so armed with a flashlight, a lighter and a Blackberry Paul must escape or be witness to his own one man funeral. Latter, we come to know the reason for Paul's imprisonment is that he's being held captive for the sum of one million dollars, which if not transfered to a certain bank account he will be left to die. Paul calls everyone he can think of including family friends, the government and his company to prevent him from dying five feet under the ground trapped in a box. What can Paul do to satisfy his kidnappers and who can he call to get him out!? We'll you're going to have to watch the movie to find out. This film never leaves the box which is an amazing feat for a film. It stays underground and doesn't leave for surreal dream or fantasy moments like 127 Hours, which in my mind makes it a better film. Now you can debate this for hours on end but for me, putting the parameters of \"We are going to make a film about someone being trapped, and we are never going to cheat by leaving the space of the character\" is something to be praised for if done correctly. Buried delivers a story that few would try to attempt and manages to not only keep your audience interested in suspense but also brings up some very controversial topics about government, power and truth. The sound design in this film is amazing and the variety of shots this film pulls off with such a small space should make all cinematographers take notes. Ryan's performance is pitch perfect as you see his character ride a roller coaster of emotions of panicked, hopeful, and defeated. Even though you may hate the sound of this movie, that is exactly why you must see it. *spoiler alert If not for the ending this film would have only gotten a 7/10. But the ending has a twist at the end (which i didn't see coming) that packs a wallop of truth down your throat. For making the strong choice and not going hollywood I gotta give it another point. Well deserved.",
      "total_reactions": 0,
      "user": "DemiRonin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "A little film that does huge things with intensity and primal fear. Indeed, this is a small film, a one man show, but Reynolds delivers quite well here and the film is presented in an entertaining way, whilst being confined in a box for the entire duration. Definitely worth a look!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was absolutely thrilling. It grips you from the opening minute and it will never let go until the heart-racing ending. Paul Conroy (Ryan Reynolds) will make you laugh, he will make you cry, and he will leave you on the edge of your seat for the whole 90 minute duration. This movie will take over your emotions and it will mess with your mind for the whole ride. I didn't believe a movie filmed entirely in a buried coffin could be entertaining at all, but Rodrigo Cortes proved me wrong as you feel for Paul and what hes going through which makes it all the more mind-bending. If you love thrillers, and you are not claustrophobic you HAVE to watch Buried, you will love it and you will hate it, its that good. 9.5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Pleasantly surprised by this, was'nt expecting much (a ryan reynolds project does'nt normally amount to much) but thoroughly enjoyed buried. A taut, almost unbearably tense film with a terrific performance by reynolds. Recommmended.",
      "total_reactions": 0,
      "user": "paulyh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "This movie, works! I am not claustrophobic. But After watching the movie for 30mins, I started to be! Then I calmed down. When the main character started to get his hopes up in being rescued! The ending was sad, but very real! The movie is a solid 7 out of 10 stars!",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Claustrophobic sufferers beware, you're in for a scare. 'Buried' is good film, nothing to special but it features enough of a decent plot device to fill the full 94 minutes without feeling outstretched and bloated. At times, it does however, feel like Macgyver in a box, err, coffin. You can tell the director was inspired by **** as a filmmaker as there are multiple eerie influences by the grand master in this movie. Both the lighting and the camera angles are supporting characters in this film as they attempt to focus on a terrific Ryan Reynolds.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Deserves the 10 points just only for not boring me in 90 minutes while staying in a grave all the time. Besides, we've got an fantastic one-man-show by Ryan Reynolds here and also the cinematography and the music are stunning. Must-watch!",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "A lot of people won't like this film for one simple reason: It is so easy to criticise and so easy to dislike, but the man in the box IS the film. There are no flashbacks, there is no filmed back story, nothing. The camera is not taken away from him at any given point. Knowing this, I was intrigued as to how the director could go about making this standard length film entertaining, but I was definitely not disappointed. Firstly, and there is no other way I can think to put this, the 'phantom claustrophobia' you are made to feel in this film is impressive. The acting is brilliant especially considering how difficult it must be to have no set to interact with, let alone any other actors to play off. So hats off to Mr Reynolds for that. The story is intense and realistic. Sure, there are probably some technical details that are debatable but on the whole, this film is firmly based in reality and as such is that much more interesting yet often difficult to watch. The plot is deceptively deep in the sense that the political issues it touches upon are both real and relevant and as such, you will find yourself wanting to scream at some of the characters (or voices of characters, should I say) in this film. I found it thought provoking and different, I'd recommend it to the vast majority of people. It definitely isn't a fast pacing action thriller so if that's your thing then you may struggle with sitting there for 90 minutes. For others, I will say that there are parts which are difficult to watch and it is quite a 'heavy' film for a number of reasons, so you do have to be in the mood for that sort of film if you want to enjoy it.",
      "total_reactions": 0,
      "user": "Nixy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "It's rare to find a film that takes chances. Everyone wants to play it safe. But taking risks may result in being something completely new, something no one else will be able to measure for quite a bit. Buried does just that and succeeds.",
      "total_reactions": 0,
      "user": "rastapasta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "I loved it! What a total surprise, I mean I've heard mostly good things about this movie so I sort of expected a pretty decent film, but I was not expecting such a thrilling experience. First off, Ryan Reynolds is brilliant as Paul Conroy, he delivers the best performance of his career by far. He can act y'all! The performance is strikingly similar to James Franco's in 127 Hours, and in my opinion, it's as good. He completely surprised me with this film. Second, the writing is very sharp, emotional, intense, and effective; it truly adds to this film in many ways. Lastly, the direction and editing by director Rodrigo Cortes is absolutely fantastic! He did some very interesting shots from within the coffin that make this film not seem as claustrophobic as it really was. Yes, this film is nothing more than Ryan Reynolds trapped in a box, but at the same time it's so much more, so don't let that keep you from seeing this. Not only did I experience what Paul Conroy was feeling, but my mind was thinking and imagining what was happening outside the box. I really liked this brilliant little film and I cannot recommend it enough.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "A deeply unsettling thriller which does it best to maximise it's low budget intensity through relatively poor decisions and scenarios. However, the feeling of being trapped in a coffin is just devastating and fine performance from Ryan Reynolds shows it true. The ending makes you think however, that there was absolutely no silver lining to this plot of pure misery",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "this probably the best thriller's ever made intense to the max",
      "total_reactions": 0,
      "user": "ilovemovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "I think Buried is nearly as good as 127 Hours (both are similar). One point is even better: the claustrophobic atmosphere. But the cinematography and the ending are both worse.",
      "total_reactions": 0,
      "user": "MichMart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "A Shockingly amazing, bone chilling, emotionally thrilling film that showed a lot of powerful emotions and believable acting that made this film one of the best I've seen.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Buried is a great suspense film. The film is extremely thrilling and has a shocking ending, I didn't understand the terrorists methods, but overall, the film was well made.",
      "total_reactions": 0,
      "user": "Ihuarraquax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "Ryan Reynolds' s performance was definitely the highlight of the movie.While it's not the most entertaining story, it's an interesting movie and we want to see how the movie ends and what will happen to Paul. The ending is probably the biggest surprise of the movie. Buried is not a classic, nor is it a great movie, it's just an interesting movie about a guy trying to survive trapped in a coffin.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "The end was absolutely gripping and.....that was pretty much the climax of the movie. I rate '4' because the ending was quite incredibly devised but the rest of the plot was such a snore-fest. Also, the main role was acted out well by Ryan Reynolds. Very few good points overall about the film to be told.",
      "total_reactions": 0,
      "user": "lutfirhamzam"
    }
  ]
}