{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Capitalism: A Love Story",
  "mc_negative_rating_frequency": 42,
  "mc_positive_rating_frequency": 119,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "Even if what is said or shown in this documentary is true, I can't help but to feel some of the same anger shown here against the banks and capitalism towards Michael himself. Why didn't he release this movie for free, it's easy to talk but it's not easy actually doing what you preach.",
      "total_reactions": 2,
      "user": "Tubie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "While not quite as good as the other documentaries Moore has made (probably because of its much larger scope of the film), \"Capitalism: A Love Story\" is still rather engaging.  Showing the dark side of the American version of capitalism, Moore actively tries to push his audience to rethink their lives, values, and understandings and hopefully lead the charge of difference. This film, unlike some of his previous, ends on a rather optimistic note - we can bring change about; and that is rather refreshing when it comes to Moore. We have seen with our own eyes that the positive trends he had described are happening in Wisconsin, for example. It is a film that many Americans need to watch and, if nothing else, rethink their stances about issues the film talks about. Moore does not demand of you to become a Socialist and take down the US - he just tells you that there is another way. And that, quite frankly, is all that a good filmmaker can do: guide you, and hope you will make the right choice.",
      "total_reactions": 0,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Haven't heard people cheer and applaud a movie in a loooong time. At times harrowing but also uplifting to see how people have beaten such greed from banks and dirty politics. Lets just hope George Bush Jr. reaps what he sows one day.",
      "total_reactions": 0,
      "user": "StephenScott"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "As usual, Michael Moore mixes up some incredibly interesting factual information with absurd political ideas. It's worth watching for the ties between Goldman Sachs and the US Government. Unfortunately he ruins his expose with his personal politics.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "This genius epic, another great film by politically-aware Michael Moore, is filled with truth. There is even some humor. It makes true statements and talks about...well...you know...capitalism. Underrated and entertaining.",
      "total_reactions": 0,
      "user": "AndrewUltimate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Capitalism: A Love Story is a fine piece of political documenting. It's not overtly shocking or revelatory (rich people are greedy... Who would've guessed?) and it plays up the violin-swelling sympathy a bit too much, but it still riles the viewer up nicely and makes you want to start kicking things. Although, the half-hearted nature in which Moore starts to 'harass' Wall Street suggests that he might well balk at the very riot he's trying to incite.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Hilarious, shocking, sad. Michael Moore is amazingly talented in artistically putting together documentaries that make difficult topics understandable to almost everyone in an entertaining way. Highly recommended.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "It seems as if corporate America finally owns enough of us, our culture and our politics to obliterate the truths of this film and crush any hope of revelation much less revolution.  But I don't believe that, and Capitalism: A Love Story reminds me not to.  The giant is still sleeping is all.  When it wakes up, look out.",
      "total_reactions": 0,
      "user": "spacecaptain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Pretty eye-opening if slightly one-sided documentary.Interviews with certain families who have fallen victim to the capitalist regime are very haunting and provocative.It offers a certain hope while completely dismantling the system.Subversive and very funny at times.Everyone should see it.",
      "total_reactions": 0,
      "user": "AlexS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "\"Capitalism: A Love Story\" - Brief review. (B)",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "this is really a good movie ! It tell us about the bad side of capiitalism !!  But it just tell about economy, there still are many bad side such as: enviroment, etc",
      "total_reactions": 0,
      "user": "nightmoonlight"
    }
  ]
}