{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 38,
  "mc_movie_name": "Carnage",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 99,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 88,
      "summary": "Think \"Who's Afraid of Virginia Woolf?,\" but then think fun."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 88,
      "summary": "The film's an even four-hander, with awful behavior spread evenly among the characters and spellbinding performances by the quartet of co-leads."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 83,
      "summary": "Carnage gives Polanski the best opportunity to express his devilish sense of humor in decades, proving again that comedy really is tragedy happening to someone else."
    },
    {
      "critic": "Adam Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2012
      },
      "score": 80,
      "summary": "A quartet of pitch-perfect performances from a cast uniformly at its career best, together with a director on shockingly mischievous top form, this is a shot of pure, exhilarating cinematic malice. And if nothing else, it contains the most surprising puking sequence since Monsieur Creosote."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 80,
      "summary": "Relatively light-hearted for a Polanski film (no one dies), Carnage is fun verbal warfare cleanly filmed."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "Snappy, nasty, deftly acted and perhaps the fastest paced film ever directed by a 78-year-old, this adaptation of Yasmina Reza's award-winning play God of Carnage fully delivers the laughs and savagery of the stage piece."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "When a man whose wife was killed by cultists invites us to laugh at life's absurdities, the particulars are almost incidental."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "Among them, Polanski's four-person cast boasts four Oscars and eight more nominations, so these are big-league actors who are capable of carrying a film such as this through its occasional miscalculations."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "A lot of people have no use for Carnage, especially in its unapologetically hemmed-in film version. And yet there isn't a sloppily or casually considered shot in any of the 80 minutes."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "This is not a particularly memorable film, but Polanski brings a great deal of skill to its staging, and it looks as if the actors enjoy themselves."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "Is it entertainment? Is it satire? Is it art? It's probably a little of all three, and yet ultimately not quite enough of any."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "Scathing and funny and cynical about contemporary society and the hypocritical way we live now, Carnage may not be the dream movie I expected, but it has a dream cast of pure, unimpeachable ensemble perfection."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Fast, furious and often funny. But no blood is truly shed (except literally in a playground fight during the opening credits)."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "One doesn't have to look too closely at Carnage's final shot to marvel at the way Polanski refuses to haughtily indict his audience in the pettiness of his characters' behavior."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "The dialogue is superior, though, and director Roman Polanski has cast the characters well; Foster is particularly impressive in a stridently unattractive role, as the pinched, angry liberal who's orchestrated the meeting but doesn't get quite the apology she wants."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "A scabrous, amusing, and thoroughly predictable exercise in exposing the animalistic underbellies of grown-ups pretending to be civilized liberals."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "Seeing these four actors launching Reza's zingers at each other at high speed is pretty much worth the price of admission all by itself, and one thing you always know about Polanski is that he won't waste your time."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "Not only is Polanski very much in his comfort zone with this material, he also has cast it impressively, staying away from any of the actors who played the parts in either its London or New York productions and finding players who match up well with Carnage's juicy dialogue."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 67,
      "summary": "The script is chockablock with al dente amusements – obvious targets still make for wickedly funny one-liners – and the German actor Waltz (Inglourious Basterds) is terrific as the only parent unburdened by decorum."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 67,
      "summary": "If this was a quintessential Polanski movie, something malign would reside inside its heart: The sitcom would explode its boundaries. The movie is called Carnage, but the carnivores on display are toothless."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 67,
      "summary": "By the time everyone in Carnage has revealed themselves, we're left not with flawed human beings, but with monsters of banality whose company represents a brutal form of punishment in itself."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 67,
      "summary": "Polanski struggles to make the material more cinematic, toying with clever mise-en-scene to showcase the mounting tensions. However, Carnage repeatedly suffers from an internal tension between the possibilities of two media at odds with each other."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 65,
      "summary": "But it does mean you're always aware that you're watching filmed theater - a scripted pressure-cooker where playability is being allowed to trump plausibility as theoretically cultivated adults morph into savages - going from civility to carnage in 80 minutes flat."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "While the talented quartet play these hypocritical sorts with finesse, the story grows tiresome, its cynical point made early and often."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "Carnage suffers from a common problem that afflicts many stage-to-screen adaptations: too much artifice and contrivance."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "If anything, Carnage does too little to adapt to the new medium, and the result is a film that makes its audience feel as trapped as its characters."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "It's a shame neither actress can truly \"go for the jugular,\" as Alan says at one point. This is a work that would allow for it."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "Watch the director's 1976 \"The Tenant,\" and you'll know he can do more with less."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 58,
      "summary": "In such an audience stroker, where casting is everything (on Broadway, James Gandolfini brought exciting menace to the role of Mr. Longstreet), Winslet and Waltz jell while Foster and Reilly flounder, unable to make sense of what kind of people they're supposed to be."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The film isn't half as deep as intended, but parts of it are very funny - someone actually barfs onto a stack of art books - and the parts that aren't may as well be."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The entire point of Carnage is to poke fun at the fragile civility of the upper-middle class - they're all animals inside! - but how much more fun would this material have been if the story hadn't been about polite white people?"
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "Although the subject, school bullying, is as fresh as today's headlines, the treatment isn't. Despite the efforts of an impressive cast, the film starts out stale and then just gets tedious."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "Stiff, talky, and airless, a textbook example of that not-always-true cliché about the unfilmability of theater."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "The film version of Carnage hasn't just lost God from its title, it's lost the laughs from the play that brought it life."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "In the final stage of the film's programmatic chaos, Alan announces that he believes in the god of carnage and cops to the pleasure he gets from watching people deviate from social convention and tear one another apart. You'd have to agree with him in order to embrace this film - there's nothing else to see here."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "The performances are lusty and concerted, but they remain just that - performances, of the sort that may make you feel you should stagger to your feet at the end and applaud. If so, resist."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "The real battle in Roman Polanski's brisk, fitfully amusing adaptation of Yasmina Reza's popular play is a more formal clash between stage minimalism and screen naturalism, as this acid-drenched four-hander never shakes off a mannered, hermetic feel that consistently betrays its theatrical origins."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 40,
      "summary": "I was put off by the acting, or more properly by the spectacle of good actors dutifully following leaden direction, and equally by the writing, which is as thin as the veneer of civilization it purports to peel back."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 40,
      "summary": "As a portrait of anxious, status-conscious Brooklyn parents living in a chiaroscuro of self-righteousness and guilt, Carnage misses its mark badly."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 40,
      "summary": "At 78, Polanski has earned the right to pursue his career-long demons of confinement and anarchy even in a minor film like this. But Carnage is not the word for what he's perpetrated here. Minor irritation is more like it."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Carnage suffers from a bad script that is simply unfunny. The actors are quite good and know how to play there role, but they cannot save this 71 minute long film from feeling like a total drag. This is also the first polanski film that I have not enjoyed.",
      "total_reactions": 2,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Two couples gather for a civilized discussion about an incident between their young sons. Before it's over, barriers drop and things get real. It's a strong cast (Jodie Foster, Kate Winslet, John C. Reilly, Christopher Waltz), but with the exception of Reilly, they aren't known for their comic chops (and neither is director Roman Polanski). Making it worse, the script isn't funny. The film starts with promise and potential, but never escalates to outrageous or deteriorates to dull. It stays at the same, uninspired level of energetic ennui.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Carnage should have gotten meaner. Essentially a One Act play, the film features some fun acting in what is a black comedy, a bit of a critique of hypocrisy from Roman Polanski to the modern United States Culture that has banished him. Jodie Foster goes for the extreme the most, and comes away with the best of the 4 main performances. Instead of going for a War of the Roses level of domestic extremes, it's really a Virginia Woolf/Breakfast Club type movie where we aren't left with any major revelations, other than these are MISERABLE PEOPLE. It seemed like the actors had a great time making this movie, but not all of it came through on screen.",
      "total_reactions": 1,
      "user": "SirEddieCook"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Who's Afraid of the God of Carnage? would be an apt title for this film since it is reminiscent of  the Virginia Woolf play/film. Any film that takes place almost entirely in one room has to be be based on a play, and Carnage is no  exception. The four characters occasionally tread into the hallway and there's a trip to the bathroom, and that's it. The stage lends itself well to prolonged dialogues and dramatic monologues, but film demands some action.  The opening credits show the incident between the boys in the park; otherwise, the most action you'll see here is when Kate Winslet's character throws up all over uptight Jodie Foster's art books. Both actresses got nominated for a Golden Globe for best actress in a comedy, but there is not one line in this film that is even remotely humorous. The ancient Greek definition of comedy is any play that has a happy ending--Carnage still does not qualify. It has no ending at all. It seems to stop in the middle. We'll need a sequel to find out if the two boys ever reconciled like grown-ups or even to find out if the two marriages survived that disastrous encounter. At least Polanski remembered to tie up the loose end about the hamster--that was an enormous relief. In between the opening credits and the hamster, two civilized couples get together to talk about the fact that the son of Nancy and Alan Cowen (Kate Winslet and Christoph Waltz) bashed in the teeth of the son of Penelope and Michael Longstreet (John Reilly and Jodie Foster). The injuries are serious but will heal and perhaps will need some cosmetic surgery, but the boy will not be marked for life. The parents have the best of intentions--to reconcile with each other and set an example so that the boys will reconcile. The visiting parents of the offending boy are about to leave, twice, and the second time they make it to the elevator. By the end of the movie, you wish they had left, and there was no reason for them to be enticed back for a cup of coffee. It was an uncomfortable, unpleasant visit, and everyone wanted it to end, including the viewers. Instead it dragged on for eighty minutes, short for  most films but interminable in this film. The conversation starts out being politically correct but quickly deteriorates as both couples lose it, lash out at the other couple, and then spouses lash out at each other, and all the chinks in the armor of the holy institution of marriage get blown away so that there is no armor left, just the carnage. The play was called â",
      "total_reactions": 1,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I gotta say , at the start I thought the movie will be supper boring . The first 15 min was boring but finally it turned out to be really funny. Haven't seen this kinda comedy film in ages ! One Apartment , 2 couples fighting over something so silly and all with the phone and hamster amazing . Good actors and their acting and Kate was clearly the best among them. Nice directing by Roman and Really good screenplay too . Over all a different kinda fun movie !",
      "total_reactions": 4,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Im surprise Its getting Mixed ratings. This movie was actually pretty good. I like the dialog & acting was pretty great also. The script was a bit juvenile at times but it was actually able to keep my attention all the way through & this typically wouldnt be the type of movie I'd go for. It reminded me a lot of phone-booth only this is like the House Arrest version lol. I kept waiting for them to just leave but it never happens lol. I thought the whole concept (& message) was pretty cool also & it was very easy to follow; it even made me laugh at times! I was utterly shocked when the movie was over because it literally felt like only 40 mins long. Its not to be taken seriously though, I would probably give it a 7 because I liked the concept & the overall message so much 8.",
      "total_reactions": 3,
      "user": "Cazatuz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "script, cast and especially powerful dialogues that make this movie amazing, this movie proves that you do not have  a thousand extras and actors to do something flashy and entertaining.",
      "total_reactions": 4,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Its embarrassing. It fails dismally.  I can see how it could have worked as a play but unlike say , the importance of being earnest, its fails horribly in the movie version. The jovial twists and turns of the play do not work on the screen version.",
      "total_reactions": 4,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "I'm surprised this didn't get better reviews from critics, as it was very entertaining. Carnage is a small movie that runs in real time,  and only consists of four characters in an new york apartment. All this works well, thanks to its fresh and witty screenplay, and primal performances from our four principles: Winslet, Foster, Riley and Waltz. Christoph Waltz was probably the finest of the bunch, maintaining a chilly, aloof demeanor while the others slip into disarray. Jodie Foster gave a slightly exaggerated performance, but overall they were all fun. The abrupt ending did some serious damage to the overall movie, but its epilogue saved it.",
      "total_reactions": 1,
      "user": "lahaine"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "What an entertaining film! The 4 actors make the film good. It seems that they had fun making it too. For a movie that is set entirely in one apartment for 80 minutes, it's quite an achievement to keep the audience entertained throughout. I found myself laughing out loud a few times. At the end of the regular screening, a few people in the audience applauded.",
      "total_reactions": 2,
      "user": "marioping"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "This film was just hilarious.  The only gripe I had was that it was too short.  Each character:  Foster, Winslet, Waltz, and Reilly were amazing.  Yay for a movie that has excellent dialogue and doing more with less.",
      "total_reactions": 2,
      "user": "Tazmania32"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Size matters, right? even for Roman, after the brilliantly intricacy-crafted THE GHOST WRITER (2010), the scale of CARNAGE shrinks just like a hors d'oeuvre, no wonder its lukewarm feedback is percolating in spite of the lure of 4 Oscar-bounded leading thespians. Actually the response is par for the course, the film hinges on a more stringent time schedule (literally the exact time audience spends in front of the big screen), which is too featherweight to be considered seriously for the Oscar race (referring to other play-adapted Oscar dearest CLOSER 2004 or DOUBT 2008, both at least possess a decent time span), but which doesn't thwart all the fun one could obtain from a feature film. The disintegration of these two pairs of parents is intrigued bit by bit with derision, insult and disdain, the initial wrangle of two flatly unfamiliar couples are reflecting everyone's customary procedure of dealing with strangers, the approach of eclipsing others in a restrained manner in order not to break a fragile bottom line â",
      "total_reactions": 1,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "The general premise of two couples meeting to discuss their sons doesn't really work as a feature film, let alone a feature film directed by Roman Polanski. However the general idea of the film as alluded to in the title is that even in the most civil of all surroundings, things can fall apart into absolute chaos and Polanski shows this thanks to some brilliant performances by all four actors (Jodie Foster, John C Reilly, Kate Winslet, Christophe Waltz) and some resourceful direction. The film works as a drama but at its heart it is a very dark comedy that is outrageously funny in the way it slowly destroys these four people. Waltz's antagonistic lawyer is married to Kate Winslets uptight investment banker and they are avoiding the fact that deep down they hate each other. Jodie Foster and John C Reilly are the more liberal couple but they too are burdened by problems which are only exacerbated by Waltz and Winslets presence. The whole film seems completely realistic aside from the eloquent play like dialogue with a decent amount of twists and turns to keep things trundling along. The film blends physical and spoken comedy really well with both Winslet and Waltz showing great skill at the physical gags. There are some pretty interesting themes during the film with the key one being everyone is unhappy about something, you just need to know how to exploit it. Fortunately Polanski and his skilled cast know exactly how leading to some unbearably funny moments. Even if they don't want to admit it, each character is a deeply horrible person and watching them attempt to avoid their baser instincts and put up a facade is absolutely delightful. In essence, Polanski has discovered a way to make watching couples fight through their issues in a very public and embarrassing way both entertaining and painfully funny, which is wonderful in comparison to reality where it is extremely uncomfortable",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "A pitch-black, hilarious upending of social conventions. The entire cast is exceptional and John C. Reilly is especially entertaining, and the script (based off of the French play \"God of Carnage\"), is whip-smart and Polanski's direction is as usual exceptional, (although he lets the film speak for itself, there isn't much here that would discern it from other great directors, he lets the acting and writing to the heavy lifting). Overall, this is an intelligent, hilarious film for an older audience.",
      "total_reactions": 2,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Carnage is an absolute blast! Sickeningly hilarious performances from the cast - including Kate Winslet who is perfectly pissed - as well as Jodie Foster, Christoph Waltz and John C. Reilly who vie against each other with comedic perfection until the wicked end! Epically funny!",
      "total_reactions": 2,
      "user": "BradleyFilm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Before you watch this you should know that you're headed into a comedy, yes, but one that looks into the chaos of conflicting philosophies -new and old- as they try to grapple with modern expectations. It looks like this movie took some licks from reviewers who were expecting something with more flash and bangle. All the breadth of this great movie happens in your head, not in the scenery. Be ready to laugh AT the characters AT yourself and AT us (humans). Loved it.",
      "total_reactions": 2,
      "user": "Spiralus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Carnage is compelling with smart, funny and sharp dialogue with little Polanski's direction help. All four its leads performance are overrated. I have to say that I hate the ending, don't show us the rodent, I have phobia.",
      "total_reactions": 1,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Roman Polanski's Carnage is a well-made film adaptation of a stage play. The story involves two couples who agree to meet following a violent interaction between their children. Before long both couples devolve into bickering monsters who are arguably worse than the kids. Jodie Foster and John C. Reilly star as Penelope and Michael Longstreet, and Kate Winslet and Christopher Waltz fill the roles of Nancy and Alan Cowan. In short the Cowan child hit the Longstreet child with a stick and broke two of his teeth, though the general consensus is that either couple could be in the other's position. Penelope is introduced as a do-gooder type, while Michael seems ill-fit for the formality of the occasion; Nancy wants to end the matters quickly, and Alan is content to condescend when not being interrupted by his cell. The film proceeds as a comedy of manners and lack thereof, and its success is dependent on the performances. Both Foster and Reilly are adequate, but Winslet and Waltz steal the show. There is nothing in Carnage to suggest that it has been altered or improved for cinematic treatment; indeed it could be a filmed play, which may turn off many a viewer. That said it was rather enjoyable for its documentation of seemingly decent people indulging in indecency. It provides its capable cast with some great scenes. Its humor is brittle and caustic, and its characters are recognizably human. Chances are experienced moviegoers will know whether or not they want to see Carnage; those who want to see it will likely enjoy it.",
      "total_reactions": 1,
      "user": "Myffubs"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Hoooooooly **** this movie was crazy. the characters are **** INSANE, its all just by a minor problem, you start to think that the director was drunk when he had this idea,and the ending **** IT ALL!!",
      "total_reactions": 3,
      "user": "FlippySuper"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Taking place entirely in one room, Carnage tells the story of four relatively ordinary people,who soon bow to pressure to vent their frustration at the world, each other and themselves.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 4,
      "text": "Carnage from the surface doesn't look quite good but after watching the film it was quite entertaining. it had its funny moments but the last 10 minutes took it over the edge in a good way. a simple and short film that was solid all around. Trash of a movie",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Carnage is two films. The first half or so is a comedy. Mr Reilly is an excellent comedian. All the players deliver their lines with an air of being on the edge. They don't seem to be taking the material seriously. They are having fun as I was. Then the seriousness takes over as the combatants rip each other apart with innuendo through biting one-liners. Mr Reilly once again is excellent. Making the transition from light-hearted banter so machete like strikes. Ms Foster is way over the top; why did Mr Reilly marry her? All this \"stuff\" hidden behind a tight lipped facade? I was not roused to take action, just to utter an \"Are they kidding?\"  Perhaps it worked better on the stage but still worth a look.",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Write out of the box I knew this movie was going to be a winner. With an intelligent, hilarious, and ruthless script not much could go wrong, especially when it is supported for 4 talented actors. It was unique and memorable, which counts a lot in my book.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Quirky French play transferred to the big screen by Roman Polanksi and starring a strong cast of Jodie Foster, Kate Winslet, John C. Reilly and Christopher Waltz. Two sets of parents meet up to discuss the recent behaviour of their children with amicable intentions. The meeting quickly descends into a humourous farce as the four bicker and offend each other. All four characters take up allegiance with each other character at some point to verbally spar with the alternative pair. The script is witty and clever and all four actors give strong performances. Christoph Waltz's rude ignorant businessman father is the stand-out of the four, routinely answering his work phone in front of the couples until Foster reaches breaking point. All in all, an amusing and clever film showing that with the right material four actors and one set can be used to great effect.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "It's fun to see the thin layers as good manners, etiquette and politeness peel away as 2 couples discuss a fight which occured between their kids. It's very enjoyable but they could have taken it a bit further, more extreme but there's a chance that this would have undermined believability and made it somewhat ridiculous. Still worth a look though.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "i didn't get what was supposed to be funny about this movie. they just looked like a bunch of broken human beings. every time a character lashed out I took it  more seriously then in humor. though the characters were well acted.",
      "total_reactions": 0,
      "user": "cheeseberger11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "A realistic & deft study of a variety of real life human characters, skillfully acted out by the talented cast and masterfully directed by the legendary Polanksi.",
      "total_reactions": 0,
      "user": "jack977"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "A film very clearly based off a successful stage play. Roman Polanski sits a quartet of incredibly talented actors in a room and observes along with us.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "It may not have done much to differentiate itself from its stage counterpart, but Carnage is still a sharp and hilariously true satire that follows in the footsteps of Virgina Woolf and Abigail's Party whilst taking itself much less seriously than them.",
      "total_reactions": 0,
      "user": "El_Jacko"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "This is definitely not a film for everyone. But it happens to be my type of movie. And I loved it. The level of pasive-agressiveness is crazy. I laughed way too much. All four actors are horribly magnificent (if you do watch the film, you'll understand why I use \"horribly\"). But Winslet and Waltz - I mean - what else can I say?. Roman Polanski did something incredible here. Same set, same four actors, the entire film. Just recently I found out this was based on a play. Now it makes sense. The dialogue really plays out like a play and it works out very well here. At 88 minutes, it manages to not tire. What's more, I didn't wanted it to end.",
      "total_reactions": 0,
      "user": "carlosgz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "Adapted from a play, Carnage is set in a single room and is a dramatic and uproariously comical black comedy-drama from director Roman Polanski. Bringing together two couples who have to discuss an incident between their respective sons, the civilized encounter quickly turns nasty and shows the carnage of the situation between their sons. Opening wounds regarding their marriages, lives, and characters, the encounter soon descends into chaos with in-fighting and larger revelations about the world around us with the carnage extending far beyond expectations. Set in just the living room of one of the couple's homes with some scenes in the bathroom and hallway, the film is easily identified as a play, but is one hell of a play translated to film. One of the greatest accomplishments of the film, however, is how it characterizes each person. While the acting is exemplary, the characters are feasts for the eyes and have a lot of meat on their bones. This is largely examined when each is put on the hot seat and attacked by the other three people in the room, with the person on the hot seat constantly changing. What is crucial, however, is how fake each person is, which becomes apparent quite quickly.",
      "total_reactions": 0,
      "user": "Spangle"
    }
  ]
}