{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 111,
  "mc_movie_name": "Carrie",
  "mc_negative_rating_frequency": 60,
  "mc_positive_rating_frequency": 146,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "Long before the blood starts spilling, it’s clear the new team has mostly nailed it. The reboot is as good a Carrie remake as possible, though it’s not truly a scary movie; the film takes its time living up to its R rating."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "For all the psychological realism of Carrie and Margaret's relationship, however, this remake has a comic book feeling."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "In a way, the new Carrie is almost too easy to enjoy. Everything discordant and all the nagging weirdness and strange feelings surrounding the original have been smoothed down, and what we're left with is a well-made, highly satisfying and not particularly deep high school revenge movie."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s as affecting as drama as it is effective as horror. It wrenches, even as it unnerves."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "If you're going to take another stab at this tale of a taunted, traumatized teen who exacts fiery revenge on, well, everyone, then Kimberly Peirce is the director to do it."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Kimberly Peirce changes almost nothing in her rallying remake of Brian De Palma’s classic about a troubled telekinetic teenager. She doesn’t have to."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Ms. Peirce plays up the story’s religious themes and Carrie’s burgeoning power as she discovers her telekinetic gifts, even as the dread of the female body that deepens Mr. De Palma’s version somehow goes missing."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "Carrie has proved itself to be a remarkably resilient tale that’s not likely to be plugged up anytime soon."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "Peirce is gifted, but she lacks the ability of directors like DePalma to transform schlock into something deeply personal."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "But now we're a lot more accustomed to seeing movie characters mold their destiny through special effects, and since Peirce films the climax in a rather depersonalized, shoot-the-works way, Carrie comes close to seeming like an especially alienated member of the X-Men team. She blows stuff up real good, in a way that would make the devil — or Bruce Willis — proud."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "The acting's strong; in addition to Moretz and Moore, Judy Greer is a welcome presence in the Betty Buckley role of the sympathetic gym instructor. But something's missing from this well-made venture. What's there is more than respectable, while staying this side of surprising."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "One of the more solid ’70s horror remakes, but it lacks the verve and potency, romance and heartache of the original. Still, the haircuts are a vast improvement..."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "Moretz is unnervingly talented, but Carrie is not a role she was born to play. She hasn’t a victim’s bone in her body and fluffs the early scenes when the mean girls pick on her."
    },
    {
      "critic": "Mark Dinning",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2013
      },
      "score": 60,
      "summary": "A remake that doesn’t see the legacy of Carrie White burn in hell. But not one that adds much to it either."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Only Julianne Moore, as the Bible-thumping mom, has an instinct to go softer — how couldn’t she, after Piper Laurie? — and paradoxically, it’s a move that feels wrong, the role requiring its cantatory bigness."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Peirce has done a remaking rather than a reimagining."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Where Sissy Spacek seemed otherworldly and haunted in De Palma’s film, Moretz (“Hugo,” “Kick-Ass”) is sadder. She’s a terrific young actress."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "If De Palma’s version was one part adolescent dream, three parts nightmare, with a sly streak of satire running through it, Peirce’s is a more earnest yet still engrossing take on the story that should connect with contemporary teens. At the very least it might send fledgling horror buffs scurrying to their Netflix queues to watch a vintage masterpiece of the genre."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Director Kimberly Peirce’s intermittently effective third feature eschews De Palma’s diabolical wit and voluptuous style in favor of a somber, straight-faced retelling, steeped in a now-familiar horror-movie idiom of sharp objects, shuddering sound effects and dark rivulets of blood."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 58,
      "summary": "Alas, despite the timeless concerns of adolescent bullying and burgeoning sexuality, Carrie as a film fails to become its own satisfyingly whole interpretation of coming-of-age horrors both literal and figurative. Its bloodshed may be all dressed up, but it ultimately has nowhere to go."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "There are problems with De Palma's version, especially in its portrayal of the key relationship between Carrie and her mother, but it's a more engaging and insightful portrayal than Kimberly Peirce's too-slick remake."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "So yes, even if you know how this story goes, there are moments that work wickedly well in between the needlessly drawn out ones, by which I mean the entire, predictable third act."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Rather than offering new blood, Carrie is a purely cosmetic revamp."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "This Carrie comes off like a Lifetime film, adding little new and nothing substantial to improve on DePalma’s classic."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "This Carrie becomes less involving as it goes along, ceding its emotional power to special effects and unconvincing gore, and culminating with a closing shot so lame and uninspired, it’s as if the filmmakers just gave up and called it a day."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Despite the talent involved and the notoriety of the source material, Carrie feels strangely small, even television-sized."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 42,
      "summary": "It’s a strange thing to say about a movie so obsessed with the red stuff, but this Carrie is bloodless."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "The new Carrie isn’t atrocious — just flat and uninspired and compromised by the kind of mindless teen-movie “humanism” that De Palma so punkishly spat on."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Comparisons are unfair and inevitable. But even when taken on its own terms, the new Carrie rings hollow, a horror movie that is unsure of itself, with little to offer the uninitiated and less to offer fans of the first film."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "The new Carrie is a thoroughly dispiriting remake — “retread” is the appropriate word — that could have been directed by any proficient Hollywood hack."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "Why did these talented folks decide to take on Carrie when they had nothing innovative to bring to it and, by refrying the same blood sausage, risked invidious comparison to the original? To put it another way: If the most modest expectations cannot be met, indeed must be crushed, then What Is Life?"
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "Hollywood’s ongoing campaign to remake every horror movie of the 1970s and ’80s has finally caught up with the Stephen King-Brian De Palma classic “Carrie,’’ and the results are distressingly anemic, pig blood and all."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "When the end comes, and the suggestion of a sequel is left faintly lingering (though not in the way you’re expecting), weariness descends on just how unimaginative Carrie is and how easily it settles for the expected, rather than striving to be excitingly refreshing."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "In focusing on predominately kid-gloves portrayals of her teen players, Kimberly Peirce never properly addresses the machinery behind their doom, which is why the film is relentlessly lifeless when it's not literally ripping off De Palma shot-for-shot."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Based on Stephen King's novel, \"Carrie\" and the same name as the original in 1976, the new version of \"Carrie\" is about a poor innocent girl who has telekinesis and she went to a prom until those mean bullies are making a prank to her and she controls her power to destruct the entire high school into a disaster. Chloe Grace-Moretz is playing a main character as Carrie White and she did a pretty good job for portraying an emotional teenage girl, and she also gets the top that is near to the original Carrie. Julianne Moore plays Carrie's mother and she also did great for becoming an insane widow who wants to get rid of Carrie White's life, not as bad as the original, but the original mother stays the top. The story stays very close to the book and it goes different ways like the original movie, but I've seen Carrie White becomes an interesting character that we seen her back problems. She controls her telekinesis powers, she gets comfortable to her new friend, and she becomes insane for destroying everything in the prom for her bullies and to entire school that makes her prank. Even though the new version of Carrie is pretty decent and not as close to the original, but it's a good horror movie to enjoy with teenagers and to other Stephen King fans as well. Carrie is a good old fashion flick with great scares and some chilling moments that I've seen in Halloween, but a good one.",
      "total_reactions": 2,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "I like both the original and this newest version. The acting is actually pretty good and updated. The effects notwithstanding the story remains the best part of course. I would be curious as to what Mr. King feels but I can tell you that I enjoyed the entire film. Chloe Moretz does a very good job as does Julianne Moore in bringing us the emotion of the characters.",
      "total_reactions": 2,
      "user": "Stormcrow666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "An average movie for a great novel. Carrie is entertaining in its first half hour, but once the action starts, it becomes laughable. The cast disappoints, not even Julianne Moore could bring a nice performance.",
      "total_reactions": 2,
      "user": "dudu_95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "This movie was ok until the prom scene. The part where everyone was supposed to laugh at Carrie and her mother saying in her head over and over, 'they're all gonna laugh at you' was completely left out. This was a HUGE mistake. Whomever is responsible for this stupidass mistake should be ostracized from the film industry.",
      "total_reactions": 2,
      "user": "kyldesty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Perfect. For the sake of a review for a 'remake' I believe you should forget that it is one, and focus on how good this film is on it's own two feet. Carrie is an unbelievably good film; tense, gripping with brilliant acting and great rampant destruction... What more could you want?",
      "total_reactions": 2,
      "user": "JacobYoung68"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Loved the original and when I heard that this movie was being done, I had mixed emotions rushing all over me. After watching the movie, I knew that I have just watched a decent movie but if you think about it more, you will think that it was a bit pointless on making the movie. I considered the movie to be a remake and a bit of a re-imagined version. Remakes are made to fix problems that it's original had and to add something new that wasn't part of the original or it's source material. The only thing new added to this movie that wasn't part of the movie was the involvement of recording a bullying that was happening at the moment, with the use of cellular phones and making it viral. The other one was the rampage scene but if you have read the source material or the book, then you probably know that this was going to happen. The movie didn't fix anything that the original had and nothing memorable or new, was added that wasn't part of the original or the source material. So if nothing new happened in this film then what was the point of making this flick. Remakes should be new and fresh and should not entirely be the same as the original and source material. The movie was not terrible because it had excellent acting from Chloe Moretz and Julianne Moore. The CGI was decent but at least it wasn't horrible. Overall, this Carrie didn't beat the original but it was a decent movie, I still had a lot of fun watching the movie but it still gives me the feeling that sometimes the movie feels pointless. Carrie gets a 7/10.",
      "total_reactions": 2,
      "user": "jetstar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Carrie is a magical horror movie, not only it contains most of the",
      "total_reactions": 2,
      "user": "fadytouma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "I have to say that I really like the original movie and I think it needn't have been made again. I can't say that I actually dislike the reboot. It had it's moments and I did like the fact that it came off more as a human tragedy story than a horror flick. I must also say that it was a lot easier on the eye to watch pretty Chloe Grace Moretz than it was to watch Sissy Spacek, but the movie just somehow fell flat for me.",
      "total_reactions": 1,
      "user": "Cantandres"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Not a bad movie  but nothing amazing. This is the same Carrie you've seen or read before, but made with more modern effects and with a bit of a twist to make room for Carrie 2. I see a lot of low scores, and I see a lot of high scores by people with 1 review under their belt. This movie is average, an acceptable depiction of a story you already know, or a good way for youngsters to see the Carrie story  because no one wants to watch a movie from the 70's anymore.",
      "total_reactions": 7,
      "user": "Thordane"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 9,
      "text": "I LOVED IT! As a huge fan of the book I was very satisfied with how it was brought to life. It's a little derivative of DePalma's film but has a few touches of its own, enough that I found it enough to stand on its own. Although Pierce largely misses the chance to show the destruction Carrie brings to the whole town in the book (budget concerns perhaps?) and the ending doesn't match DePalma's, special effects elevate the prom and Chris and Billy's comeuppance (which is truly inspired and my favorite scene) past DePalma's, plus she found a good way to incorporate the book's meteor shower. Pierce also reinvents the film as drama that effectively builds tension more effectively than a simple horror film from the get go, plus Carrie's development of her power (which is well known to be a metaphor for burgeoning womanhood) progresses much more organically. Chloë Grace Moretz crushes it; it's been a common criticism that she's too pretty to be Carrie but upon seeing it, I'm letting it slide, because she not only pulls it off by bringing a heartbreaking frailty, it kind of makes things even more shocking, because you wonder just how messed up her life had to be to make her the kind of person she is at the start of the film. Not that anyone should hope for tragedy, but I found myself really praying that things would work out better despite the fact that we all know what's going to happen. Gabriella Wilde was also very good as Sue Snell, she make the sense of regret that leads to her ill-fated benevolence believable (it aways seemed far-fetched to me). The always reliable Judy Greer is in fine form as Miss Dejarden, and Julianne Moore chews the scenery as the part of Carrie's mom calls for (recreated by Pierce as a paranoid schizophrenic). The novel Carrie is one of my favorite books, so I wouldn't give it my seal of approval if I wasn't genuinely impressed. Tip of the hat to all involved.",
      "total_reactions": 5,
      "user": "stockton22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Filmgoers who are not interested in seeing a modern remake of Carrie are equally unlikely to be won-over by Peirce’s effort  since it tells (mostly) the same story without dramatically improving anything but the onscreen visuals. Nevertheless, for viewers who are open to the remake, the assembled cast and crew manage to accomplish their goal of updating the still timely Carrie storyline with a more intense (and gory) retelling of events for the contemporary movie market. While it might not have been necessary, the Carrie remake is still an adept, entertaining, and at times downright haunting, piece of filmmaking.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "It's a movie of two parts  the first, which includes everything up to the prom \"bucket\" sequence, is really pretty good.  The only weak element for me was Julianne Moore's character.  I generally love Moore, but this role is one dimensional and weak.  But again, the first part is similar to so many other movies of this type  Some Kind of Wonderful, etc. But the revenge sequence at the prom and following was just entirely crappy, boring, and stupid. Sure, she had to get some kind of revenge, but it could have been SO much more creative.",
      "total_reactions": 8,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "This movie has definitely gotten some mixed reactions from everyone whose seen it so far. While I did not see the original \"Carrie\" movie, this version still felt pretty predictable. But honestly, I enjoyed this movie. There are definitely good parts and there are definitely some bad parts. Chloe Moretz and Julianne Moore definitely make this movie work for sure, and there are some really gruesome and gory shots that I thought looked really cool. Yet at the same time, it felt like some of it really just grossed me out rather than really try to give me that true horror appeal. Plus, there are some very cheesy moments in this movie. Other than that, it's a pretty good movie overall. Some might like it, some might not, but don't take my word for it, see it yourself.",
      "total_reactions": 7,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I already knew that critics would be bashing this since it's a remake but this movie was great! Your feel the emotion and pain of Carrie throughout the movie and then she snaps and when she does it is intense I loved it! The only thing negative was that by the end I loved the intensity so much that I was craving for more! All in all a 10 out of 10!",
      "total_reactions": 16,
      "user": "mynameisnathan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Obviously Hollywood has never been amazing at portraying high schools, but this one however is the most realistic I have seen (still not realistic, just the least fake) the fake parts, like students snickering when someone mentions her name, or she walks by them... like come on. Another thing they should have done was to see Carrie from their POV, show us why they all think she's a freak... at most high schools, shy, quiet girls don't usually get made fun of this much... unless of course the real bullying started after the shower scene... But the performances were awesome, Julianne Moore can play so many different things and she was definitely pretty freaky in this. The movie is not that scary in anyway at all, but it is a fun ride while in it, and it gets the audience into it. I honestly feel like this has potential to be a halloween time classic. But I hated the pig scene. Screw that.",
      "total_reactions": 6,
      "user": "ROFLoom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "I think Carrie is one of my favorite underrated remakes of 2013 because I felt that the original version is way better than the new version of Carrie. Although I was a little worried that Sony and MGM were hoping to shed some light of Carrie after a unsuccessful yet unsatisfied 1999 sequel and a disappointing TV movie in 2003. The remake is good, but I don't know if director Kimberly Pierce (best known for the cult classic \"Boys Don't Cry\") haven't even saw or what the original Carrie is about. Carrie White (originally played by Sissy Spacek, now Chloe Grace Moretz) is a teenager who is scared and frightened (and sorta freaky), she lives with her abusive mother, everyone's laughing at her at school, learning psychic powers, she and Tommy were named prom queen and king until one bucket of blood changes everything (one of the scariest scenes I've ever saw). Since that bucket killed Tommy, you know what happens next and trust me, it's full of gore. Carrie turns from prom queen to a psychotic mentally-stabled zombie (sorta). I won't tell any spoilers, but the remake is incredible. Although it may not be as good as the original, but I gotta give credit to Chloe Grace Moretz (one of the best underrated child stars since Dakota Fanning), she did a great job portraying a sick and demented teenager who has a hard time dealing with all the emotions she has gone through at school and her devilish mom as we speak. I know the reviews were mixed, so hopefully we could see a future cult classic on this remake. But I still wanna check it out before Halloween. Not great, but still a good remake.",
      "total_reactions": 3,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "The new CARRIE is in essence a shot by shot remake utilizing much of the exact same dialogue and plot points. They needed a new screenwriter for this? Director Kimberly Peirce, BOYS DON'T CRY, adds some grit, makes it all more realistic but in the process loses depth and emotion. And then someone tampered with the ending, tagging on a quick silly series of denouements with no rhyme or reason other than a 2nd rate sequel. This all sounds really bad but actually, the story still has major bite and the two leads are wonderful but nowhere near Sissy Spacek or Piper Laurie from the original. There's really no reason for this remake.",
      "total_reactions": 3,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "The remake makes justice to the original film and to the novel. Well done!. The cast is perfect. We have the talented Chloe Moretz and the professionally Julianne Moore",
      "total_reactions": 5,
      "user": "Uba"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "this movie is amazing one of the best remakes q is an fact as it has a great performance moretz julian moore and a great special effects, great direction and modern twist King's novel needed",
      "total_reactions": 13,
      "user": "diego9901"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Moore is terrifying as a guilt-addled true believer, and Moretz caresses her role when she gets the chance. And the hot topics do indeed remain hot...",
      "total_reactions": 3,
      "user": "Nome352"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "The characters were to pretty difficult to relate to and the story was far less entertaining then what I was expecting it to be. I came into the theater with a lot of hype and was extremely disappointed, this movie had so much more potential but in the end it was kind of a let down, still a decent movie to watch if you are bored  interested in telekinesis though.",
      "total_reactions": 3,
      "user": "swaglord"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "in my opinion what i seen in Carrie 2013 ,it as too much action and special effects but why a remake of Carrie Sissy Spacek and Piper were nominated for the oscar for Carrie 1976 The Exorcist (1973) ,The Texas Chain Saw Massacre (1974) Jaws (1975) ,The Omen (1976) ,Carrie (1976) ,Halloween (1978) ,Alien (1979) the best horror movies of the 70's",
      "total_reactions": 14,
      "user": "barnet42"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "In Julie Taymor's Across the Universe(the 2008 musical that recounts the late-sixties by making narrative use of the Beatles' songbook), a high school girl expresses an unrequited love for, presumably, the golden boy, the star quarterback, in a languorous version of \"I Want to Hold Your Hand\", as she walks away from her thronged colleagues, the football players and cheerleaders. Because the audience is well-versed in the symbiotic relationship between these teenage kings and queens, it comes as a shock when Taymor cuts to the comely blonde decked out with school spirit, a P.O.V shot from the Asian brunette's perspective, sitting in the grandstands, making her erotic longings known through Paul McCartney's rock and roll poetry. When football practice starts, the lovesick cheerleader proceeds to walk through the busy field, untouched by a collision of male bodies who display complete indifference to the female presence, a set-piece in which the sports arena is juxtaposed against musical art that recalls the \"Is There Anybody Here for Love\" sequence in Gentlemen Prefer Blondes, when a similarly ignored(but straight) Jane Russell maneuvers her way through all those kinetic and self-involved Olympians going about their training. The intertextuality between these filmic texts posits that the closeted teen would have longed for Marilyn(not a swimmer or a gymnast); she prefers blondes, too. A lesbian cheerleader, of course, upsets the whole prep sports ecosystem. Sue Snell knows this. The filmmaker, a woman, who helmed Boys Don't Cry, remakes Sue, or rather, appraises the Amy Irving character's true nature, since she would understand the interior lives of girls better than the source material's male creators. Sadly, the filmmaker, barely strays from the narrative template laid down by Brian DePalma in the 1976 original(adapted from the Stephen King novel). Still, arguably, the filmmaker manages to resolve a plot point involving Sue and her boyfriend Tommy Ross that, to this day, leaves, for some, an aftertaste of contrivance; the plot point in which the \"nice\" girl, as atonement for helping corner Carrie against the shower wall with pelted tampons, asks her prom date to accompany the school misfit instead. Miss Collins is suspicious, and so are we, because no high school girl alive could possibly be that altruistic. Rightly so, the gym teacher tells Tommy, \"Don't you think you're just gonna look a little ridiculous when you walk into the prom with Carrie White?\" Now with the remake, Sue's charitable gesture makes sense. Not willing to put her image at risk, she sends Tommy as her surrogate. On a subtextual level, the filmmaker outs Sue, even though, in all likelihood, it never crossed King's mind that he was creating an ambiguous girl. The writer, however, has no control over how a story will be interpreted by the reader after its deliverance. As a commodity, a novel to be sold on the marketplace, the artist knows that it now belongs to the people, with a life of its own. Naturally, an aggressively straight male like DePalma would have a different take on the King novel than a lesbian, who, perhaps, knowing what it was like to be different at such an unformed age, wouldn't want Carrie to self-immolate in a fire, alone and unloved. But this production isn't an indie like her auspicious debut. Expected to meet the commercial expectations of profitability demanded by a major studio, she keeps the film in the closet, too, and goes through the motions of shooting a routine horror flick. You have to look closer for the movie that could have been. Right away, the filmmaker establishes a connection between the clandestine possibles, during P.E. class, when Carrie errantly serves the volleyball straight into Sue's back, whereas in the original, Carrie is isolated in the back row, unable to dig the incoming kill. Instead of raising her voice in anger, Sue just looks back at Carrie, a look that transcends physical pain. This time around, in the ensuing lock room melee, Sue is more of an onlooker than an instigator, considerably less pro-active; she doesn't tear off the tampon dispensary cover like her 70s-era counterpart. Later, in the backseat of Tommy's car, Sue looks distracted during intercourse, as if she's undergoing an epiphany about her sexual orientation, akin to Lana(in Boys Don't Cry), who knows Brandon is a girl when they have sex near her spinach-canning factory jobsite, because in a P.O.V. shot, she sees \"his\" clevage. Just before Chris dumps pig's blood on the prom queen, she texts Sue, and refers to Carrie as \"your girl\". Conspicuously, Sue doesn't clamor her way back into the flaming gymnasium to check on Tommy. In retrospect, we now realize that she doesn't love him enough to risk her life. This misplaced love, after 37 years, finds purchase in a burning house, where Sue, quite pointedly, bravely treads with the goal of saving her secret love.",
      "total_reactions": 4,
      "user": "Shiira"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "I have been looking forward to seeing this remake of Carrie for months now. Went to the 1st showing with my daughter as we are both horror buffs. My daughter is 15 years old and have been watching horror movies for 8 years. My daughter has not seen the 1st Carrie movie and she thought is was pretty good, like maybe a 7 out of 10 score. I saw the 1st Carrie when it came out long ago. I am giving the 1st Carrie an 8 out of 10 and the new Carrie a 5 out of 10 and here is why. It was as close to a remake as possible but lacks the suspense and horror compared to the 1st Carrie. What you see on the trailer is what you see in the movie which left no thrill. Watch the trailer and that is the movie all summed up in 2.5 minutes. Altho the acting is good, there was nothing new to bring to the table. The prom dance in the school was shorter than the first Carrie movie and not as good or exciting. Altho not near as exciting as the 1st Carrie movie, I did enjoy it but could have been just as satisfied watching it on TV. I was a little bit disappointed as I feel they could have made this movie much more exciting. The best part of the movie was spending time with my daughter. By the looks of what is coming to theatres for this spooky time of the season, its not looking good for us horror buffs. Its a sad sad year for good movies. I can say there were only about 5 good flicks for the year 1013 to date. Bring back the SAW movies. Pitch the Paranormal Activity movies as they are as fake as a 3.00 bill. Gravity sucked and I,m still scratching my head why that movie got good reviews. People who gave that movie a good review must ha been under a strong over dose of drugs or tripping. Captain Phillips was an awesome movie, 10 times better than Gravity. Who can rate a movie with a high score just to hear Sandra Bullock screaming 3/4 of the movie. And I love Sandra Bullock and George Clooney but not in the movie Gravity. Somebody must have needed some pocket change.I have been looking forward to seeing this remake of Carrie for months now. Went to the 1st showing with my daughter as we are both horror buffs. My daughter is 15 years old and have been watching horror movies for 8 years. My daughter has not seen the 1st Carrie movie and she thought is was pretty good, like maybe a 7 out of 10 score. I saw the 1st Carrie when it came out long ago. I am giving the 1st Carrie an 8 out of 10 and the new Carrie a 5 out of 10 and here is why. It was as close to a remake as possible but lacks the suspense and horror compared to the 1st Carrie. What you see on the trailer is what you see in the movie which left no thrill. Watch the trailer and that is the movie all summed up in 2.5 minutes. Altho the acting is good, there was nothing new to bring to the table. The prom dance in the school was shorter than the first Carrie movie and not as good or exciting. Altho not near as exciting as the 1st Carrie movie, I did enjoy it but could have been just as satisfied watching it on TV. I was a little bit disappointed as I feel they could have made this movie much more exciting. The best part of the movie was spending time with my daughter. By the looks of what is coming to theatres for this spooky time of the season, its not looking good for us horror buffs. Its a sad sad year for good movies. I can say there were only about 5 good flicks for the year 1013 to date. Bring back the SAW movies. Pitch the Paranormal Activity movies as they are as fake as a 3.00 bill. Gravity sucked and I,m still scratching my head why that movie got good reviews. People who gave that movie must ha been under a strong over dose of drugs or tripping. Captain Phillips was an awesome movie, 10 times better than Gravity. Who can rate a movie with a high score just to hear Sandra Bullock screaming 3/4 of the movie. And I love Sandra Bullock and George Clooney but not in the movie Gravity. Somebody must have needed some pocket change.",
      "total_reactions": 6,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Chloe Moretz is the new age-appropriate teenager with telekinetic powers and Julianne Moore plays her deeply disturbed, uber-religious mother. The plot pretty much follows the original DePalma classic with the addition of cell phones and the internet. What it lacks is any soul. Everything leading up to the big prom scene is uninteresting and even her blood-soaked reprisal lacks originality or flash (despite the fire). The performances are all uninspired…as a matter of fact, the whole bloody movie is anemic and downright dull.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Any movie starring Julianne Moore is a disaster waiting to happen. This one is particularly bad. Horrid acting, a lead character that is just too weird to feel any sympathy for, the question is: why the remake, if the original is just so much better ?",
      "total_reactions": 3,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Better than the monotonous dragged out original. This remake actually moves swiftly and has a bigger more exciting climax. All the filler story in between was funny and suspenseful at times.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "After over 150 viewings Brian De Palma's 1976 version of 'Carrie' remains my favourite film of all time. Therefore, if anyone was going to take issue with this remake it was going to be me. The first thing to be said about this new version is that as a film in its own right it does work. Kimberly Peirce is to be commended for doing a credible job in attempting to put a fresh slant on the material. The big question hanging over the whole enterprise, though, is whether a remake was really necessary. The answer to that has to be a resounding NO. However good Peirce's version is it compares unfavourably, in every aspect, to the sublime master class of De Palma's film. I have always viewed the original as more of a social commentary than an out and out horror movie and De Palma effortlessly switched gears between the comedy, horror and romance. This combination made his vision a very satisfying experience",
      "total_reactions": 1,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "La versión dirigida por Brian De Palma en 1976 fue un éxito total, que inició con la avalancha de las muchas películas (y algunas series) de Stephen King. Ésta versión es no del todo acertada, pero es entretenimiento para los que han leído los libros de dicho escritor. Recomendaría la película a personas que sufren de mucho estrés o quiere asesinar a alguien, ya que la película funciona muy bien en éste ámbito, pero sigue siendo una más del montón de películas de lo que va del año; nada que valga la pena recordar; solamente entretenimiento momentario",
      "total_reactions": 1,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 0,
      "text": "this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap this remake is crap",
      "total_reactions": 5,
      "user": "SalvaGonzalezz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "Horrible and a total waste of time and money ,this should have never been remade ,Everytime I watch it  gets worse and worse, and The originals usually surpass the remakes ,this is the only moved i ever walked out of in a theater",
      "total_reactions": 1,
      "user": "McFly1985"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Terrible Movie!! , Chloë Grace Moretz which I believe she wasn't right for the role , julianne moore as margaret white she looks like she was in a comedy movie of scary movies ,and all the cast very bad acting",
      "total_reactions": 1,
      "user": "Jordan20"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "Worst Unnecessary Remakes I Seen In My Life ,Psycho (1998). Carrie (2013). Planet Of The Apes (2001). The Fog (2005).  A Nightmare On Elm Street (2010).  Prom Night (2008).  The Day The Earth Stood Still (2008). Flubber (1997). The Stepfather (2009). Clash Of The Titans (2010). The Wicker Man (2006)",
      "total_reactions": 1,
      "user": "1990"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Another pointless remake of a classic, ruined , it has nothing new to say and works with an original that didn't need remaking , The writing is awful bad acting and it is funny",
      "total_reactions": 1,
      "user": "Kathleen1990"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "i'm sure if chloe moretz is not in this movie the people want like it , Imagine if  the role of Carrie White was unknown actress would you like this movie ? , in my poor opinion i think that  Kimberly Peirce ruined the movie.",
      "total_reactions": 1,
      "user": "Bane23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Awful acting,  i prefer watching Wicker Man (2006),  The Wicker Man remake is one the worst acting of Nicolas Cage but it is better than Carrie 2013,  Carrie 2013 wasn't scary it is a funny movie  ,and Wicker Man (2006) is a funny movie too , OH, NO! NOT THE BEES! NOT THE BEES! AAAAAHHHHH! OH, THEY'RE IN MY EYES! MY EYES! AAAAHHHHH! AAAAAGGHHH!",
      "total_reactions": 1,
      "user": "Caesar14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Seriously, Carrie 2013 is not a horror movie it is X-Men movies ,why Carrie White  fly in this movie and moves her arms she  looks like  her dad is Magneto , one of the worst remakes  I have ever seen.",
      "total_reactions": 1,
      "user": "Cornelius68"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Firstly I hated that she used her hands to move things as opposed to just looking at them ! It looked far too Harry potter for my liking, really annoyed me,  and yes this Carrie can fly has Superman and she can break the road as The Incredible Hulk  , this movie is not horror it is a  kid's movie.",
      "total_reactions": 1,
      "user": "Lena18"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "The worst remake i seen in 2013,  The 70's version was so much better....to me, it had more emotion....was much more touching....much better acting...Piper Laurie was great as a religious nut. Sissy Spacek was an excellent Carrie White.",
      "total_reactions": 1,
      "user": "Gina_H"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "Probably the biggest change in this remake is that it's set in modern times. The movie does a fairly good job of taking advantage of this. For example part of the torment Carrie's classmates put her through involves cyberbullying. It's a small new addition that is only mentioned in one or two scenes because the era source material fits in doesn't really make much room for new additions. Some of the book and original movie's dialog can still be found here and not all of it fits in well with the new time period. 2013's Carrie attempts to add some new elements do fall short here and there because of how closely it sticks to the original's formula, which was a fairly faithful adaption of the book in the first place.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Carrie is a competent horror remake that, predictably, misses out on some of the essence that makes the original such a masterpiece. Although fine, this remade version pushes the horror elements in your face all the time, where as the original was more subtle. Still... The climax is still fun.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "As a true fan of the original, I pretty much expected this to be trash, but here is a big \"Good Job Team!\" to the production staff on Carrie 2013.",
      "total_reactions": 0,
      "user": "TitusPrime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "You will watch it and probably enjoy it but it doesn't add much as a remake. I usually love Chloe Moretz acting but in this movie she just didn't impress me.",
      "total_reactions": 0,
      "user": "Akadrud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "In order for a remake to really work it has to have its own clear spin on the original template, unfortunately Carrie doesn’t really seem to know what it wants to be. For large parts it is more high school movie than horror movie (a montage featuring the song Diane Young by Vampire Weekend is so completely out of place as to be almost comical) and never comes close to recreating the creepy atmosphere of the original. The central performance from the talented Moretz stops things from completely falling apart, even when the dialogue is at its most clunky, but with the original still standing up fine this is an almost completely pointless remake.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Inspired by a bestselling children book, Cloudy tells the story of a young inventor who creates a machine that makes it rain food. Initially hailed as the towns saviour, things go wrong when the food starts piling up and he loses control of his invention. A visual treat with a clever script and great voice performances, Cloudy ranks alongside the best of Pixar and put Lord & Miller on the map.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "\"This 'reimagining' of Carrie (the classic 1976) is the best remake I have ever seen in a long time. Shouldn't be missed.\"",
      "total_reactions": 0,
      "user": "Leeway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "This movie wasn't the most incredible of the world, but I can say that is a good movie, because almost everything worked up. The actors were good especially Cholë and Julianne, they were very good, Julianne was so good that i was feeling a little bit of scared  because she is insane and Cholë was very good, because in the book she is ugly and weird and Cholë is the opposite so she had to be great to make everybody belive that Carrie is weird. But there is a problem in the movie that they could make a better make up on Cholë to her look ugly and also because some parts that are totally different of the book",
      "total_reactions": 0,
      "user": "rafa14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "This movie was a surprise to me! I was expecting it to be another typical horror movie. But this movie has a great story. well acted, well paced, very interesting! I watched the old \"Carrie\" a day later, and this new version is ALOT better!",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "The 2013 remake of Brian De Palma's classic and adaptation of Stephen King's novel of the same name makes up for enjoyable viewing, with decent performances and cinematography. But unfortunately, Carrie is damaged by poor casting, a lack of scares and plenty of unnecessary CG. Though it is certainly flawed, I still enjoyed this unnecessary remake.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "In a partly unnecessary remake, Carrie has lost some of its dread and now looks terribly dismal instead of frightening. With the change, and also Chloe Morets as the leading actress, it seems this version is trying to invoke more sympathy to relatable case of bullying than to scare the audience with terror, which in its credit, works decently well. The talents give relatively good performance, although some of the script and characterization are muddled with exaggeration. The movie barely offers anything in term of novelty as it follows the source firmly, furthermore the plot is highly predictable and very 90s, in the end Carrie feels like a mild psychology thriller at best.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Carrie is a 2013 horror film directed by Peirce Kinberly with Chloe Grace Moretz and Julianne Moore.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "There are some good things and some bad things about this remake of Carrie, hence the mediocre rating. Let's start with the bad things. First of all, the stereotypes are so absurd and overblown that the film is at times tough to get through due to the ridiculousness of it. Anyone who has been in high school can tell that the stereotype these films portray it to be is very off base. This movie goes further than most with it. Another weak element was the lack of development for the protagonist. The movie hinges on you pitying Carrie and all she goes through and then turning that pity on its head in the closing scenes. Without any substantial development, however, there is a disconnect between the audience and the viewer. This makes the closing scenes more superficial. Speaking of Carrie, Chloe Grace Moretz is one of the best young actors in Hollywood but she struggled at times, especially early on. I don't know if that's what the director was shooting for but her introverted behavior didn't feel natural at all. Nonetheless, there were other times when she was incredible, which brings us to the positives in the movie. The acting by most of the cast was very good and Julianne Moore was brilliant. She stole the movie, in my opinion. One of the best things about the movie, funny enough, is the alternate ending. I'm not sure why they didn't use that one but wow, it is so much better than the theatrical one. I'd suggest anyone watching this movie to watch that version.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "I don't know why I keep watching remakes, because it seems like I am always disappointed. I suppose I feel that with all the new technology to come along in the past 30 years, these films will only get better once they are enhanced and edited, but the truth is that they are always missing something important, and rarely do justice to the original. The remake of Carrie isn't all that different from the original, just modernized, as Carrie is a loser, who with puberty discovers an amazing power. She tries to hide it, but when pushed, ultimately uses it for evil, it's a classic Stephen King story, that most people already know and there in lies part of the problem. Assuming that most people know the story, a lot of information about Carrie is omitted, leaving the film little to go on. They quickly jump into the story and for a long time have nowhere to go with it. Kick-Asses Chloe Moretz stars as Carrie, and while her performance was outstanding, it is wasted in this film. They really played up the religious angel and Carrie's mother, played poorly by Julianna Moore. Yes, it was creepy and that's what they wanted, but it was so over the top and in your face, that it quickly becomes tiresome. The producers of this film had all the tools to recreate this Horror classic, but fail miserably, as their take on the story was abbreviated and way over the top.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Squandered potential....I was really excited to see this movie.  The book Carrie was probably one of the top three novels I've ever read.  I absolutely loved it.  As a man, I'd never sympathized with a female character like I did poor Carrie White, and really felt like I was feeling what she was feeling.  You felt so sorry and miserable for her from beginning to end and you just wanted her to be happy.  Of course it doesn't end up that way, and the terrifying finale is both thrilling and tragic at the same time.",
      "total_reactions": 0,
      "user": "Mixersan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Carrie is a great story, there is nothing to criticize. The movie of 1976 was an incredible adaptation. But this film is just one remake more for the list. The score that I give it is only awarded because of the plot. The only thing that it is actually good, is that this story is develop in the year 2013, so all the technology that we have is included on the movie; so Carrie has to face cyber bulling, in addition to the laughs and bad comments of the others. Beside that all the rest are pure fillers and silly attempts to be more accepted. The performances are not even close to the ones of Brian de Palma and most of them do not transmit the insanity, obsession, commitment, trauma and huge anger of Carrie, her mom, the teacher, Sue and Chris, respectively. Also the famous prom scene seems to be too exaggerated, I mean the protagonist only lose control, but in this movie was like a hunt; and her powers were beyond telekinesis. And the ending in the house was totally meaningless. Maybe Carrie should return form death and grab the arm of Kimberly Peirce, to take her to hell.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "A an excellent horror movie that doesn't rely on idiotic sound effects and cliché scare tactics but shows the horror through the characters. An entertaining film that kept its intensity from beginning to end.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "It has more scenes of drama than horror, so if you’re looking for that in this film, you won’t find it.",
      "total_reactions": 0,
      "user": "felipescavo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "I haven't seen the original version which was based on the novel by Stephen King, the famous horror story writer. Kinda simple and plain story, but very good. Better than modern gore movie on teen subject. Well remade movie from the director of 'Boys Don't Cry'.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Carrie was alright. It was disappointing compared to that badass teaser released earlier this year, but there was nothing wrong with it. I wasn't really interested in it, but i wasn't bored and I didn't hate any of the material or notice any laughable dialogue. It's a waste of time yeah, and you really don't need to see it, but if you do you won't want to leave.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Halloween has a very fundamental, ABC rubric in the cinematic film world; A usually stands for absurdity, and the countless absurd efforts to scare people in a genre that defines it’s own rules; B is for blood, lots and lots of blood; and C is for Carrie. Hailed as the most popular film to watch on Halloween, Carrie has been in the film world since its first adaptation in 1976, a performance made iconic by Sissy Spacek. Since then, the character has really struggled to find any solid footing in a sequel and a made for television movie. In its third attempt, director Kimberly Peirce (Boys Don’t Cry, Stop-Loss) delivers a surprisingly satisfying modern retelling of beloved horror novelist Stephen King’s first ever published novel. Serving more as an homage and ode to the novel and classic film, Peirce and company tip their hats and inevitably add small nuanced changes to the story as it appeals to a new generation that can understand the ridicule and embarrassment of traumatic high school pranks with the inclusion of social media and modern technology. Yes, Facebook and smartphones have a lot to do with Carrie’s demising high school reputation.",
      "total_reactions": 0,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "I don't think that remakes are unnecessary, invites a new generation to appreciate old classic with a new face, i agree that this new Carrie is not as strange as the old, but is so interesting like, it is not as dark as the old, but is so interesting like.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "I'm surprised to be giving this a recommendation really didn't expect much, but although there might not be much originality this film is a solid watch.  B",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Although we have talented performers in Chloe Grace Moretz and Julianne Moore (and I always love Judy Greer), they are mere shadows of the performances of Sissy Spacek and Piper Laurie. And let's not forget the supporting cast; William Katt with his Cali-fro and blissed out Redford smile, Amy Irving as the so damned earnest  good girl, and the lip lickin' evil duo of Nancy Allen and John Travolta playing it up gloriously. The present supporting cast? Made not a single impression. They could have come from The CW central casting. Ms Moretz is a fine actress and I've enjoyed her other roles, but I think she is just too attractive to play the mousy outcast. Sissy Spacek (although ten years older, but still believable as a high schooler) looked not only like an outcast, but like someone almost alien in contrast to her schoolmates. She truly transformed from duck to swan at the prom. Chloe just cleaned up well, and looks nice in a prom dress. There were some minor plot point changes, but it essentially DePalma's version gussied up with some (sometimes dodgy) CGI. Enjoy, if you will, but give me the original any day of the week.",
      "total_reactions": 0,
      "user": "jamess"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Pierce's version of the Stephen King novel can't help but feel like the remake that it is, but that doesn't mean it's not totally worthwhile and extremely watchable. Julianne Moore and Chloe Grace Moretz do fantastic work here, bringing the story to life for a newer generation. I think it worked quite well.",
      "total_reactions": 0,
      "user": "MavisGary610"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Although the scare factor was limited, it was apparent a lot of  effort went into the premise of the story, which was excellently executed and well acted. Carrie was an enjoyable movie, with several hiccups. But never failed to leave you bored or disinterested. Excellent pacing and tension really favored in the direction of the movie. Worth a rent.",
      "total_reactions": 0,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "Não entendo por que este filme recebeu algumas críticas negativas. Um remake muito bom! Muitos não gostam devido ao fato do original ser considerado um clássico - também prefiro a versão de 1976, mas em termos de produção e fidelidade ao livro esse remake é melhor.",
      "total_reactions": 0,
      "user": "Gzbernini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "The original is a classic and, all knee-jerk remake reactions aside, this 2013 update isn’t that bad…it even has some points that are better.  For the most part, not much has changed from the Sissy Spacek film so this remake can easily work in favor of fans of the original as it can be used as a gateway to gather interest in seeing the original (or it can be a point of hatred as it really is almost dead-on to the original).  Advancements in special effects also helped make the most meaningful moments of revenge a little more interesting this time around and, I have to say, Julianne Moore proved to be the best yet with playing Margaret White.  It’s easy to hate on a remake for no other reason than it’s a remake but “Carrie” keeps itself true to the original and Chloë Grace Moretz is fantastic as Carrie and really filled in Sissy Spacek’s shoes nicely.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Mundane or inept are the first words that come to mind when one thinks about his movie to long.  Might have been a bit better if the production used practical effects instead of CGI . Story and acting are very distant and fake.",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "I am giving this rating based off of this movie standing alone not compared to the original.  I loved the original and this one was also very good.  My only complaint is comparing this one to the original, that is they are nearly 99% identical and if you saw the first one absolutely nothing will be new or exciting.  Its a tough choice for me because I wanted something new but similar and what I got was a great carbon copy.  This is more for new watchers or someone who wanted to see the movie a second time.",
      "total_reactions": 0,
      "user": "mijxero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Firstly, let me say that I have never seen the 1976 version of the film. Therefore, I feel I am relatively objective in my review of the movie.",
      "total_reactions": 0,
      "user": "MrSquizz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "This remake of Carrie isn't bad; it gets all the social isolation, religious fanaticism, and bullying ingredients right. It's just that it offers nothing new to say about the characters or story. While she does a good acting job, Moretz is a bit too pretty to play the plain-looking Carrie, but Julianne Moore fits right into the role of Margaret. I especially liked the symbolism of Jesus at the end as she gets pinned to the wall.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2014
      },
      "score": 1,
      "text": "It's Impressive how these people try so hard to do a remake of a film that don't need, making a really good movie (the old ones) into this mess, small and tennager horror movie, this is really a \"don't need remake\"",
      "total_reactions": 0,
      "user": "TiagoRPG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Were this the only film version of Stephen King's 1974 first best-seller, I think most of its readers would be satisfied with the result; as it is a faithful, straight-forward cinematic telling of the story of Carrie White and her tormentors.  Further, those in the theater audience that were not familiar with the book or the story, would probably come away with a feeling of having seen a superior scare/gore-fest.  And certainly, Chloe Moretz was very, very good in the title role.  However, this film is a re-make of the original 1976 version, directed by Brian De Palma, with Sissy Spacek as Carrie.  It is not necessary to go into the many differences here; I would only ask anyone who has not seen the original, to seek it out on-line, and simply click forward to the beginning of the prom scene.  Afterwards, make your own comparisons.",
      "total_reactions": 0,
      "user": "mccallhall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "The first half of Kimberly Peirce's \"Carrie\" couldn't decide whether it wanted to be a horror movie or a \"b*tches-go-to-prom\" movie, and this made both side lacking. The second half was a fairly satisfying retributionfest except for an incredibly stupid final ten seconds. I went into Carrie expecting a scary movie and I didn't get one. Maybe that's my fault.",
      "total_reactions": 0,
      "user": "freemustard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "Thousands of kilometers behind the original acting. The new Carie is as scary as my little nephew when upset. The mother, just powerless. The gentle athlete, inexistent, Jacob's like. Nothing more to add for me.",
      "total_reactions": 0,
      "user": "maximax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "If your looking for a great creepy movie with some but less notably a bit of horror I definitely recommend going to see this movie. By far the best horror movie of this year, this remake does the original movie and Stephen King's book much justice. Chloe Moretz did a wonderful job embracing the emotions of Carrie and Julianne Moore is just downright scary. I recommend this movie for anyone, it's not over the top scary, it's got a solid story and leaves you with goosebumps as you exit the theater.",
      "total_reactions": 0,
      "user": "Thatonedude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "How do we solve a problem like Carrie? This film came off as the 'High School Musical' version of Brian DePalma's classic film.  Though it did add more texture seen in the book, this film was not scary, well acted or even that interesting.  Everyone in this film was so fit and beautiful it felt more like I was watching a blood drenched 'She's All That' than a remake of a horror classic.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "For a couple years the thriller movies were nothing but a parody movie material. But in Carrie (2013) you can see the real meaning of the thriller. The cast is very successful. Especially Chloe Grace Moretz. Remake movies have %30 of success in my opinion. And Carrie is the part of the lucky %30. It was great. 10/10",
      "total_reactions": 0,
      "user": "PrinceHybrid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "Carrie is an excellent film, keeps the suspense from beginning to end. Good actors, good music, script, photography, good special effects. A great remake.",
      "total_reactions": 0,
      "user": "Eddy_Ka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "I didn't particularly care for it. I don't think there is any way they could make the movie similar to the book. They have tried to do so multiple times and failed. This remake is no exception. The stones fell after the prom when they were supposed to fall when she was a little girl, too many people survived the mayhem at the school, and the girl who got pregnant was supposed to lose her baby in the womb. The movie gets a 4 from me because I think they did do a good job at making the movie in today's time period with cell phone cameras, laptops, etc. I appreciated the adaptation into the modern times and think that was the only positive quality the movie presented. However, once the bucket of blood fell onto Carrie that's where the movie flopped and fell onto itself. While the destruction and carnage was depicted well, it was obvious that the makers of the movie put all of their ideas and hard work into the other parts of the movie. The end phase of the movie started strong but severely lacked the flare it needed in order to finish off strong.",
      "total_reactions": 0,
      "user": "MrRandomGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Carrie is brilliantly acted and emphasises on a relatable problem but as a horror movie, it is just not scary.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "As a remake Carrie is a bad movie, on its own, its just as bad.",
      "total_reactions": 0,
      "user": "Motcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "\"Carrie\" (2013) A MoviesForever Review.",
      "total_reactions": 0,
      "user": "MoviesForever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "This movie was set in this era which I think was a mistake. The 70s is a more interesting setting and high school frankly was more interesting. This remake didn't need to happen and got a lot of hype for no reason. The original blows this one out of the water.",
      "total_reactions": 0,
      "user": "JC86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "Isn't dificult to undertand the history, it's nearly a \"BloodMary\" history, a girl witch everybody make \"bullyng\" with her and she has super powers and kill everyone, the stronger point isn't the Horror, but the drama, the movie shows how crazy a \"super religious\" mom is, and why Carrie is so strange, but she wants to be diferent and she will try to be diferent, the movie has some pretty good special effects, a good development, like the movie continues very well and mixed with some horror parts, the movie meets the genre and the objective very well, it's a good Drama and Horror movie in my opinion.",
      "total_reactions": 0,
      "user": "Paulo_Jorge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "I been waiting tor this movie since summer where the first teaser arrived. That had been all the wait worth. The movie takes on school bullying, and also a lot of blood too. If you like thrilling movies I recommend this.",
      "total_reactions": 0,
      "user": "Buttonmash1973"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "If you look at what the majority of what most critics were saying about this movie, I would say the majority of them called this movie a \"needless remake/reboot.\" Well if you look at this that way, most remakes/reboots are needless because how many of them actually reach the heights of the originals? Thats right, few don't. I never got to see the original Carrie so I don't have the classic version to compare this one to but for the sake of remakes, I found this Carrie to be surprisingly well done led by a very astute performance by Chloe Grace-Moretz who nails the innocent, sympathetic, shy girl with the psychotic religious zealot of a mother played by Julianne Moore. The movie isn't as scary as it is sympathetic as you really feel sorry for Carrie as a victim by the end of the film as she's driven to insanity by sadistic high school bullies and thats the only problem that I seemed to have with it at a whole. It seems more like a high school revenge flick than a pure horror/scare fest.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "A estranhesa da carrie ta muito moderna ela vai ao shoping, controla os poderes treina eles bacana adoro a Cloe mas ainda prefiro a 2 versao so filme onde a Sissy spacek",
      "total_reactions": 0,
      "user": "Deimonn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "It cannot compare to the original. Not only did the story arc advance in a nearly identical fashion to the original, but there was an abundance of recycled lines from the original scrip as well. With that, it lacked creativity and the only refreshing thing about it was having a modern context and special effects. Poor acting in a new film is naturally more unforgiving then in an old film. Brain DePalma's tones and themes remain more effective then adding a few cell phones to the story and brief CGI. Still an entertaining movie, but would need to be creepier and more heartfelt to actually do justice.",
      "total_reactions": 0,
      "user": "wilsonadams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "This movie is very good, but I think the directors could do a better job. Based on the Stephen's book, this film is somewhat true to the real story. Surprised me negatively.",
      "total_reactions": 0,
      "user": "gabrielsantana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "No es una mala película, pero pierde todo el sentido en la última parte. Es muy creíble todo el inicio, y parte del desarrollo, pero al final se torna ilógico y claramente irreal.",
      "total_reactions": 0,
      "user": "alonsomerin0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "I love Chloe in this movie before the prom mishap. Before all that, she portrays the tortured bullied kid-perfectly. Her mom freaked me out-which was the point.....but she did a great job.",
      "total_reactions": 0,
      "user": "bestcritic55"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "just because of great effects and Carrie's  prom action moments doesn't make a perfect film , the movie feels like a parody of Stephen King's work   , The acting sucks in Kimberly Peirce's verision of Carrie sucks. Watch the original instead. Grade D-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "One of the most hyped ''horror'' movie to come in 2013. But is it as worth as the viewers expected? The answer is totally NO. This is why",
      "total_reactions": 0,
      "user": "Skitte"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "But why a remake of Carrie , Sissy Spacek and Piper were nominated for the Oscar and the Golden Globes  for Carrie in 1977 ,Carrie (1976) is a classic horror movies of the 70's ,The Exorcist (1973) ,The Texas Chain Saw Massacre (1974) , Jaws (1975) ,The Omen (1976) ,Carrie (1976) ,Halloween (1978) ,Alien (1979) , the best horror movies of the 70's",
      "total_reactions": 0,
      "user": "Spider-Parker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "I haven’t read the Stephen King novel nor watched Brian De Palma’s (aka the original) version of the movie so I don’t know what I was expecting from this movie.",
      "total_reactions": 0,
      "user": "OpinionatedGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "I don't believe,  a girl with that age and beautiful as Chloë Grace Moretz, the boy's don't date her,  every nerds in school see a pretty girl as Chloë Moretz they want to date a girl like that,  cast Chloë Moretz for the role of Carrie White in this movie it was so wrong of Kimberly Peirce , i think this is the worst cast that a director or producer did in a movie.",
      "total_reactions": 0,
      "user": "R18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "I just seen Carrie 2013,  WTF this movie is a copy of Carrie 1976, what change in this Carrie 2013 is Carrie White and Margaret White,  There are sexy and beautiful and the cgi is bad and the movie is bad directed, Why a remake of Carrie 1976, that movie is creppy and scary",
      "total_reactions": 0,
      "user": "Slash1965"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "After almost 38 years Carrie 1976, people are still talking about the original film. It will forever be considered a successful classic film that people will remember and still talk about for years to come.",
      "total_reactions": 0,
      "user": "F_C1992"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Carrie (2013), you watch it once then you never watch it again! , The casting choices had a lot left to be desired,  Julianne Moore as Margaret White wasn't scary or creppy , i laughed my socks off when i see her in this movie.",
      "total_reactions": 0,
      "user": "John_R"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "I have noticed that Carrie (2013) is a copy of The Rage: Carrie 2 (1999), the scene when they are recording Rachel and Jesse having sex and in the end they play the tape in the party in the big screen, and that's scene is in Carrie (2013),  when the girls are recording Carrie when she had her first period, and  in the end they play the video on the big screen in the prom,  Carrie (2013) is a copy of Carrie (1976) and The Rage: Carrie 2 (1999).",
      "total_reactions": 0,
      "user": "Rumsfield_1989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "in my opinion, This are the worst remakes of the classics horror movies,  Carrie (2013). Psycho (1998). Halloween (2007) . A Nightmare on Elm Street (2010) . The Fog (2005). The Omen (2006) . Children of the Corn (2009) . Friday the 13th (2009) .",
      "total_reactions": 0,
      "user": "Frog-1987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Why the didn't cast unknown actress to play Carrie White ?,  i think they cast Chloe Grace Moretz because all the people loves the movie Kick-Ass,  and that is a pity there are so many unknown actress in hollywood who like to play that role.",
      "total_reactions": 0,
      "user": "Flash_G"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Carrie (2013) is one of the worst remakes with, A Nightmare on Elm Street (2010) i don't know why this got remade, and this remake of Carrie doesn't add anything new , the biggest flaw in this remake has to do with the ethereal beauty of its leading ladys, Chloë Grace Moretz and Julianne Moore.",
      "total_reactions": 0,
      "user": "GOTG_2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "The acting is bad, the special effects feel lumpy and are WAY too much, the scene transitions are confusing, and it deviates from the original story without adding anything of value. I love Julian Moore, but she could not capture the haunting feel Piper Laurie did in the original. This is a perfect example of how special effects can destroy a movie. I expected way more. Just go watch the original, because this one cannot hold a candle to it.",
      "total_reactions": 0,
      "user": "yeah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "The Alternate Ending is a copy of , A Nightmare on Elm Street 5 The Dream Child, Carrie (2013) has scenes of Carrie (1976) . The Rage: Carrie 2 (1999). A Nightmare on Elm Street 5 The Dream Child (1989). Carrie looks like Phoenix in X-Men: The Last Stand . The Incredible Hulk.  this movie is not horror.",
      "total_reactions": 0,
      "user": "Arnie1987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Carrie is brilliantly acted and emphasises on a relatable problem which makes for above average drama but as a horror movie, it is simply not scary enough.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "Why Hollywood, Don't know why this got remade. The final scene is just bad. The only thing interesting about this is the closing credits ,and what a waste of money,  and Hollywood don't do more remakes of the classic horror movies.",
      "total_reactions": 0,
      "user": "yeah90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "This film feels clumsy, uninspired and often ridiculous. This remake of 'Carrie' seems to bounce between a modern day chick flick and a gory horror, neither of which are done well. While the acting is for the most part relatively credible, the story seems to escalate in a rough, rushed momentum that doesn't take the characters along with it. Overall quite poor and at times unnecessarily bloody and over the top.",
      "total_reactions": 0,
      "user": "amfever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "The best remake made for Carrie so far and oh my goodness I love the way Chloe acts and the cast is AWESOME. I don't think that will be released some like this one.",
      "total_reactions": 0,
      "user": "Adson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "the biggest highlight of the film is Chloë Grace Moretz and her more than excellent portrayal of Carrie, yet the film had its flaws, most notably the slow build-up and Ansel Elgort's (Tommy Ross) bland acting. other than that, a very good remake.",
      "total_reactions": 0,
      "user": "timrichie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "No es un mal Remake, creo que el problema fue el que no se basaron directamente de la novela original, esta versión es una copia modernizada de la versión de 1976, fue un buen experimento, pero creo que si hubieran respetado la obra original, hubiera estado mejor. Las actuaciones son buenas y la dirección no estuvo nada mal, es entretenida y quieres saber como termina (pese a algunos errores y momentos innecesarios) Esta versión es pasable pero esta lejos de ser mejor que la original hecha por DePalma's",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"Carrie\" 10 Scale Rating: 6.5 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "No. This is Stephen King. SOMEBODY MESSED UP A STEPHEN KING ADAPTATION!!! What the **** I thought the original Carrie was pretty bad but this! This puts the original UP.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "it was poorly directed the acting was like dull that  I bet the script was actually the original film itself and the cgi film editing made it ridiculous THUMBS DOWN BOOYAH!",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "The story is about Carrie White, a young girl who is about to enter womanhood. Unfortunately she is the psychologically neglected daughter of a bible-beating nut-job. Bullied at school by some very cruel classmates, Carrie transforms into a force of supernatural vengeance on a path to self destruction. It is a timeless and poignant tale that is very familiar. This film isn't the first redo for the \"Carrie\" story but in my opinion it is by far the best.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "All I can really say is that this movie is okay. The acting is okay, the pacing is okay, the emotion is okay, and the directing is okay. I am disappointed as this could've been a much closer adaptation to the original novel.",
      "total_reactions": 0,
      "user": "RobertOBrien"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Sensitively directed and powerfully acted, the new version passes muster as a different take.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "As unnecessary as this film is, it does hold it's own. It's well acted, well directed, the camerawork is amazing and it lives up to it's R-rating. But some of the dialogue felt forced, the soundtrack didn't do it any justice, you can tell sometimes what scenes were cut out, the special effects were a little too obvious and overall, there's nothing new about it.",
      "total_reactions": 0,
      "user": "Live2Rise"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "Carrie isn't one of the best films that chloe grace moretz has been in the story line isn't the best but is still watched the film and have watched more than once. when it gets near to the end that's when it starts to get good but I like all films that chloe grace moretz is in because she is an excellent actor and I hope she is in many more amazing films to be watched. ;)",
      "total_reactions": 0,
      "user": "zachary99"
    }
  ]
}