{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Casa de mi Padre",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 15,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "Considered as a whole it's a wonderful and hilarious phenomenon, most of it is executed to Dadaist perfection."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "You expect the big joke in Casa de Mi Padre to involve Will Ferrell mangling the Spanish language. Instead, the movie is funny because of just how commendable the actor's Spanish is."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "This very funny spoof of telenovelas and classic Mexican westerns is decidedly offbeat and absurdly daffy."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Casa de Mi Padre is at its best (a relative term, mind you) when it's at its silliest and most surreal."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "As with \"Black Dynamite,\" many of Casa De Mi Padre's sharpest, most inspired gags riff on the source material's ingratiatingly amateurish production values and exuberantly incompetent stylistic choices."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "If you take the film on its own terms, as a kind of Elvis movie dipped in guacamole, it's quirkily engrossing. Ferrell is a good straight actor for the same reason that he's an inspired comedian: He commits himself to every moment."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "It's a funny movie, although rarely is the humor of the loud, obnoxious kind we have come to associate with Ferrell. It's not unlike \"Blazing Saddles.\""
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "Is the result - a slapstick, bizarro melodrama where Ferrell plays the Mexican born and bred scion of a wealthy farmer - meant more for Spanish speakers or stoned and giggly Americans? It's a tough call."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 65,
      "summary": "The film feels ultimately hollow, perhaps because mocking soap operas is the comic's equivalent of shooting fish tacos in a barrel. In fact, the concept for Casa de mi Padre seems born out of one too many tequila-infused evenings in the Funny or Die writers' room."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "Luckily, Ferrell is at his funniest being serious. Casa de Mi Padre, shot in 24 days for $6 million, is really an SNL-ish sketch stretched to feature length. But Ferrell is an hombre loco. Mi gusta."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "The fact that the entire film is in Spanish, and Ferrell plays a Mexican named Armando, are two of the tamest elements in the movie."
    },
    {
      "critic": "Matt Mueller",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 60,
      "summary": "Grindhouse with giggles, this potboiler parody offers just enough to avoid being a curio – not least Ferrell at his straight-faced best. Arriba!"
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "The oddest thing about the movie - and perhaps the asset that will tip it over into the plus column for you - is that it's a bona fide scuzz-Western."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "The humor doesn't only target south of the border. Like any good genre product, Casa also smuggles in rude social criticism."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "This Spanish-lingo farce plays very much like an SNL sketch. The only problem is that it packs about as many laughs into its 85 minutes as a good skit does in eight or 10."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "A likable enough lark that rarely achieves outright hilarity."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 55,
      "summary": "For a movie with a comedic premise this simple – essentially: can you believe we made a movie with a premise this simple? – Casa de Mi Padre can feel pretty exhausting."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "The giddy laughs that ensue, though sometimes inspired, are too few and far between."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Really, Casa de mi Padre is a skit blown up to a feature flick, amusing for a while until its welcome wears out."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "As a full-length feature, Casa is simply a funny concept that starts to go stale around the 10-minute mark."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "If the project was intended to enlarge the comedian's audience, it may be a wash: for every prospective Ferrell fan who can't understand English, there must be an existing one who can't understand subtitles."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "It's really strange, and it's really subtitled."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "A quick-sketch routine stretched - amusingly, absurdly, thinly - to feature length."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "More than anything Casa de mi Padre is an exercise - and to those who find it more clever than I do, a valid one - in tone-funny, as opposed to joke-funny."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Teetering between folly and genius, this Will Ferrell comedy masquerading as a Mexican soap opera-cum-horse opera unfortunately levels off somewhere near the undistinguished center."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie is only 84 minutes long, including credit cookies, but that is quite long enough. All the same, it's fitfully amusing and I have the sense that Spanish-speaking audiences will like it more than I did, although whether they'll be laughing with it or at it, I cannot say."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "It's a solid short film stretched to Silly Putty thinness."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "It's deeply committed to its own weird conceit, diminishing returns and all."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "Casa de mi Padre is flawed in that it wouldn't be particularly enticing in any language."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "With Casa de Mi Padre, it's often hard to tell the difference between when it's making fun of bad movies and when it's being one."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 20,
      "summary": "It's an unfunny Spanish movie that worked best as a two-minute trailer."
    },
    {
      "critic": "Diego Semerene",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "summary": "You know a film isn't going to be considered high art when the guy to your left at the press screening is a reporter from Extra and the guy to your right lets out a loud \"That's awesome, man\" after each scene."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Will Farrell heads the mostly-Hispanic cast as the black-sheep son of a Mexican rancher, who gets involved with drug dealers and romance. This mild comedy spoofs cheesy '70s  films and telenovelas, some of which is genuinely amusing. On the other hand, it helps to have an appreciation of the genres being parodied to appreciate all of the gags. Farrell plays sweet and dumb really well, but the jokes are often quietly witty, instead of laugh-out-loud funny. It's a  cute curiosity that's entirely in Spanish with subtitles. NOTE: Stay thru the credits for an absurd cameo.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "As one can expect, the offensively condensed and rudimentary Spanish-lingo, ethnic digs, spaghetti-Western gags, and inflated run-time all run stale...very quickly. Being a slightly more original \"MacGruber,\" yet equally moronic, not to mention subtitled, \"Casa de mi Padre\" is a full-length (84 minute) feature, diced into 5-minute 'SNL' skits, that when split accordingly, will make for great Youtube popularity. Ultimately, Ferrell's inundated, comedic dexterity, even his hailingly hilarious, puerile ignoramus self can bail out this feebly built spoof. This is the kind of flick where the foreground action becomes so untolerable, so uninterestingly involving, that the incidental details become the focus. So much, watching the various cigarettes being rolled up activated more cerebral cognition. As for Ferrell taking the time to \"learn\" Spanish for the film, at least he can now communicate with the native Mexican youth; that's about it.",
      "total_reactions": 5,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "It is a hard to swallow movie, but; if you do have an open mind, I believe, like me, you will love this pelicula (movie in Spanish)  I appreciate the risk taken by Will Ferrel and this production.  They were brave and as honest as they could get.  Casa de mi Padre is a comedy, but also a Satire; keep this in mind and enjoy...",
      "total_reactions": 3,
      "user": "Tishlinda"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Again? We need watching a film of the patetic Will Ferrell? I hate all his films, and Casa de mi Padre is the worst, what is te reason? the comedy is terrible in this movie, the performance of Ferrell is horrible, with same faces, and the worst is the form to represent the mexican people, this film os the worst of the year.",
      "total_reactions": 9,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Casa de mi Padre is a loving parody of Mexican \"B\" movies, and all the movie-making goofs that that entails.  There's fake-looking, obvious sets.   Horse riding scenes are done with mock-ups, not real animals.  Blown takes are kept in.    And it's all done on purpose.   In one scene, an extra smokes a cigarette--unaware that the camera is rolling and his character should be lying in a sprawl dead.   Casa de mi Padre bends over backwards trying to be a bad film, and does it tremendously well.  Troll 2 was bad, consciously bad, enjoyably bad--but still bad.  But Casa de me Padre stumbles, tumbles, and bumbles so well, it's actually good.  It's mistakes are worse, deliberate, avoidable, and far more consistent.  It made me laugh so much, tears were streaming down my eyes--it's that funny.  If you've never seen a subtitled movie, I can't think of a better place to start.  Full review on my blog.",
      "total_reactions": 3,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "In a word, \"perfecto\". It is what it is. Pulls no punches, and, you know, in the world of Tarantino does homage or spoof or exact copy replicas of the films he saw as a kid, this does one better. Funny, Violent, and muy corazon!",
      "total_reactions": 1,
      "user": "GOUGH"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "Will Ferrel has done a lot of movies and some of his more absurd comedies are some of his best. Especially he 'R' rated films.",
      "total_reactions": 1,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "This film has a lot of Tim and Eric style humor, as does a lot of Will Ferrell projects these days. I did laugh a good deal while watching this film, however the pacing was kind of off. Like a super ridiculous scene followed by a \"heartfelt\" one. It just felt kind of inconsistent. I think that's part of the problem of relying too much on surrealist humor, it can get old fast and too much of it makes the story incoherent, so it was applied in small doses. All that aside, Will Ferrell does an excellent in an all Spanish-speaking role. Fans of Will Ferrell's more recent works will probably enjoy this.",
      "total_reactions": 0,
      "user": "Human"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "A parody of cheaply made spanish, grindhouse westerns and cheesy soap operas. Most of the humor comes from how well it is mimicking the bad elements of it's inspiration. The poorly made shots, low budget special effects, and overly dramatic elements of the story are portrayed with mostly a straight face. The humor here is very meta.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "When I saw the trailer for the first time, I was thrilled and wanted to see it. After the first 15-20 minutes I already was quite disappointed. I think it had potential to be much more. They dumbed it down way too much for my taste, but I guess you could give it a go if you really have nothing better to watch. Most unfortunate!",
      "total_reactions": 0,
      "user": "Mantis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I can't believe how fussy the critics and viewers are about a film that is made to be a silly spoof in the first place. Lighten UP! and you will find a lot to enjoy here. The actors stay deep in character at all times, the story and scenes move along without stalling, and there are a lot if visual pleasures here. The purposely bad sets and effects not only spoof old Mexican films and telenovelas, but are refreshingly artistic in an era when even crappy American movies and TV shows have way too much budget dedicated to 'professional' production values that end up just looking boring by comparison. The art direction is really quite good. The title sequence alone is a beautiful tribute to 70's art. And if you understand Spanish and Mexican efforts at understanding English, the crazy subtitles are hilarious! My only complaints are a slightly long ending that sort of goes all over the place, and the film is a bit too violent in several places (for a comedy).",
      "total_reactions": 0,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "I loved this movie. Lots of  throwbacks at how movies were made and the puppets used are plain ridiculous. The whole movie is kind of serious but couldn't stop laughing. Favorite comedy of 2012.",
      "total_reactions": 0,
      "user": "Mo-teur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "This movie isn't for everyone but I actually enjoyed it. The low budget is pathetic but still hilarious how much they purposefully make fun of it. They mock traditional Spanish westerns and the like throughout the film. Will Ferrell is genius. Genesis Rodriguez is breathtaking. Overall, it's just a really funny and silly movie that doesn't take itself seriously. I can't give it a higher rating because it's not that kind of movie. That being said, it's still a movie that certain people will really enjoy, myself being one of them.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "This is the best way i can put this.  If you've seen \"Black Dynamite\" and liked it, you'll probably love this.  here's the caveat.  \"Black Dynamite\" is a movie about blaxploitation films that were churned out to cash in on the success of \"Shaft.\" Few of them really tried to be good.  This is a love letter to the tellanovella, in the form of an early 80's western.  I have a feeling that some of the people making tellanovellas actually believe that they're doing something with quality and weight.  This movie takes itself seriously, which makes it more absurd, but in a quieter way.  It really helps to have had spanish in high school, because you will read the subtitles much faster, since your brain already has some idea what's being said whether you know it or not.  This allows you to notice more of the subtleties.  There are so many consistency errors.  I'm not talking about the plentiful \"now he has a cig, now he doesn't, now he does\" moments.  I'm talking about extras being filled out with mannequins, or a wedding massacre victim casually smoking away because he doesn't know he's on camera.  At the same time, there isn't one single technology or fashion anachronism ever.  Comedy is like horror.  What one person finds effective, another thinks is terrible.  I thought this movie was hilarious, but I understand that few will agree.  Hope this lets you know if you're one of the few that does.",
      "total_reactions": 0,
      "user": "screamingmonkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Pretty funny. Will Ferrell is okay but the movie was really funny because of Diego Luna and sexy because of Genesis Rodriguez! The plot was not the best it could have been but hey it's a comedy.",
      "total_reactions": 0,
      "user": "tvchicano07"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "A film that pokes fun at the \"B level\" spaghetti westerns of yesteryear.  While I laughed, this can really only be enjoyed by film buffs or individuals who've had a few too many, so mass appeal is quite limiting.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Overall a pretty dull movie, but still it has some charm. It makes fun of spaghetti westerns and national stereotypes, there are some funny jokes (not many though), Will Ferrell is good as always.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "This film shouldn't be taken too serious I very much enjoyed the scenes and all the funny errors that we're in there. it's nice to see a movie again that doesn't take things too serious. I think Will ferrel did a very good job here. I wish there were more films like this out there instead of the typical blockbuster movies we have nowadays.",
      "total_reactions": 0,
      "user": "tuin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "This movie might gave been very low budget and might have not shown the action promised, but honestly all the low-budget quality made this film the FUNNIEST movie I have ever seen.",
      "total_reactions": 0,
      "user": "kewlgeek555"
    }
  ]
}