{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 9,
  "mc_movie_name": "Casino Jack",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Though Casino Jack never lets its protagonist off the hook for his misdeeds, it does underline the hypocrisy of those politicians who were content to take his money but then ran for cover in February 2004 when the Washington Post began to expose his fleecing of six different Indian tribes."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Casino Jack is so forthright, it is stunning."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Kevin Spacey gives a bravura performance as superlobbyist Jack Abramoff in George Hickenlooper's uneven but often loopily entertaining Casino Jack."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "One of the highlights of Casino Jack is Abramoff doing dead-on impressions of Arnold Schwarzenegger and Ronald Reagan, among others."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Above all, however, Kevin Spacey is the reason to see Casino Jack. This movie will stand alongside \"The Usual Suspects\" and \"American Beauty\" as examples of what the actor is capable of accomplishing when he is properly motivated."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "The facts really get in the way of the portrait here, and we are left hungry for more Spacey and more insight into a man with the hubris to wonder if he has disappointed God."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a sordid tale and, in Gibney's telling, a cautionary one."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "Spacey holds center. He's a bonfire."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "Hickenlooper too often approaches his subject with the filmmaking equivalent of a wry chuckle."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 58,
      "summary": "It's a heck of a character to chew into, and Spacey, never afraid to play a devil, enjoys himself a great deal."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 58,
      "summary": "Tonally scattershot and more than a little heavy-footed."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Despite his character's fondness for mugging and mouthing like Michael Corleone, Spacey (and by extension, his director and writer Norman Snider) can't quite catch the operatic wallop of Corleone's arc, possibly because the film is played top-to-bottom like a caprice."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Glib, fast-paced entertainment that barely leaves a mark - which, given the subject, is just plain wrong."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Tonally, Casino Jack is all over the place: exaggerated comedy, cartoonish high jinks, then heavy-handed melodrama (a third-act face-off between Abramoff and his wife, played with no center of gravity by Kelly Preston, comes out of nowhere)."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Casino Jack fails at its most critical mission: Laying out in clear detail exactly how and when Abramoff broke the law."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The entertaining work by Spacey and Pepper is a good thing because the film has problems, including an utter lack of subtlety."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The plot has so many moving parts - so many envelopes of money, dropped names, half-explained schemes and hasty flights - that it quickly becomes more frustrating than illuminating."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Though the film is peppered with one-liners tailor-made for Spacey to sling with stinging effect, it doesn't so much leave you laughing as just weary, and wishing this weren't a true story at all."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "The trouble starts with the casting. The usually reliable Kevin Spacey never quite gets a handle on Abramoff, an Orthodox Jew devoted to unorthodox business methods."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "This is fertile material for a darkly comic indictment. Instead, we get recycled cynicism (politicians are hypocrites! more dirty money, more problems!) and Spacey's gallery of impersonations-W.C. Fields, Stallone, Reagan-in lieu of a flawed, flesh-and-blood human being."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "In the grand finale, Abramoff fantasizes about using a Senate hearing to blow the whistle on the entire corrupt establishment. His rant offers a clue to how this otherwise pointlessly manic movie might have honed its political edge."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 33,
      "summary": "Spacey has made a career out of projecting the smarmy elitism of the powerful, but Casino Jack is so painfully clunky that he gets dragged down along with it."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "That's the problem with the whole movie, which lies halfway between poker-face documentary and broad farce."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "\"Casino Jack\" barely survives from its cliched plot and smart-looking-but-not dialogue thanks to Kevin Spacey.",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Igonore the mixed reviews and go see this flm.  It is a stunner.  Great story and terrific performances.  Just be prepared to pay attention - it's definitely not a \"sit back and let your mind go\" popcorn flick.",
      "total_reactions": 1,
      "user": "Giulius"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "Bill Maher is right. Be more cynical. If you think our government is still a democracy in its purest sense, you don't know Jack. If you believe our politicians serve their constituents with sound moral compasses, you simply haven't been paying attention. In some cases, they don't serve them at all. Pay to play, baby. Meet Tom DeLay, your worst nightmare. Back when he was in office, the former majority leader from Texas had the bright idea of turning our government over to market forces, and in the documentary \"Casino Jack: T.U.S.O.M.\", DeLay makes it perfectly clear that he would do it all over again, even though free enterprise, synonymous with capitalism, is responsible for what currently ails our country, still reeling from the unprecedented collapse of its financial institutions. When DeLay deregulated campaign financing(what one analyst describes as \"legalized bribery\"), he opened up Pandora's Box, setting the stage for the G.-L.-B. Act which turned our banks into gambling halls. In the non-fictionalized account of super-lobbyist Jack Abramoff, DeLay looked straight into the camera's eye and lied through his teeth, brazenly declaring, evidence to the contrary, that he treated the convicted felon no differently from any other special interest advocate. Taking its cues from the Alex Gibney documentary, \"Casino Jack\" shows without the shadow of a doubt that the self-proclaimed \"deregulation nut\" knew Abramoff. On a trip to the Mariana Islands, home of a thriving garment industry that Abramoff had protected from outside intervention, DeLay says, \"These people seem happy,\" while inspecting a factory, a seeming extension of American-style democracy. It's not until we're back stateside during a K. Street party that we learn, through a reporter's question posed to Jack, about the island factories being described as \"sweat shops and rape camps\" by watchdog groups speaking on behalf of the low-paid workforce. Although the film isn't called \"Island Jack\", what Abramoff concocted and unleashed upon this Pacific chain deserves a film of its own, and more importantly, the fallout shouldn't be short-shrifted with a single line as being the final word on the human rights violation matter. Like DeLay, \"Casino Jack\" itself avoids any contact with the indentured seamstresses, as if the filmmaker too was bought off with Abramoff's hush money. As a result of the film choosing not to document the systemic abuse that ran rampantly through these textile-based dictatorships, \"Casino Jack\" could remain an amiable comedy, perhaps out of an affinity for Jason Reitman's \"Thank You For Smoking\", another film that didn't fully actualize the ramifications of a lobbyist's handiwork. The filmmaker wouldn't be able to get away with humanizing Abramoff had he depicted an instance of employer/employee rape. This is not a John Sayles film, or Richard Linklater's \"Fast Food Nation\". In the 2009 doc, we hear the story about a factory worker trying to sell his kidney as a means of returning home, but even this highly-touted film draws the line at hammering a death nail in Abramoff's public image, since it leaves out the report that the lobbyist helped write a Texas congressman's speech which attacked the credibility of a Marianan teen sex worker's testimony about her island holiday. Like the documentary, \"Casino Jack\" has a sense of fair play, but here's the rub: this Harvard-trained former Young Republican is not a fair man, and shouldn't be accorded any special considerations. Back in the day, he and DeLay forged a friendship that would result in the two men irrevocably laying waste to the principles of our founding fathers. The \"Gimme Five\" scheme that Jack  and his right-hand man Michael Scanlon hatched and implemented like corporate cowboys upon the casino-owning Indian tribes was unscrupulous and certainly deserves its allotted screen time, but unlike the Chippewa elders who owned multi-million businesses, the Southeast Asian immigrants had nothing. Instead of their plaintive cries, we hear Ms. Abramoff's anguished sobs, and Jack musing aloud, \"I let down God,\" without a trace of satirical self-awareness. The film likes him. That's why \"Casino Jack\" fails to fully indict Jack as a villain. We don't need a fair and balanced film about a sociopath. There's still too many uncynical babes in the woods out there. Unlike Hustler publisher Larry Flint, who admits he's the worst, due to the abetment of the film's relatively positivistic spin on the lobbyist's persona, Abramoff can't do the same, when he surreptitiously passes off the blame to the system in a protracted daydream at his senate panel hearing, where he bursts into Al Pacino-like theatrics, screaming, \"You're out of order,\" like in Norman Jewison's \"And Justice For All\". In his twisted mind, Abramoff fancies himself as a folk hero. Does \"Casino Jack\" feel the same way, too?",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "If I had known this film was going to be campy instead of serious, I would not have gone. A disappointment considering the seriousness of the subject. Spacey needs an ego check as this almost becomes a B movie.",
      "total_reactions": 0,
      "user": "JamesL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Based on a real story and a real documentary releasing the same year, Casino Jack is just another fictional version of this fascinating story. Jack Abramoff, a super-lobbyist in DC, who's job is to influence the congress in voting the way he wants. In return, Jack gets a sum of money from the special interest group that the voting benefited. This job is perfectly legal and the law even states that Jack can accept the money from the groups. But in order to get the voting the way he wanted, Jack has to offer sporting events, private jets, hookers, vacations, and money to the congressmen that are willing to participate. THIS is perfectly illegal. In doing all of this most of his life, Jack found himself in a ditch once in awhile and decided to take the wrong path down the road. Performing illegal activities, involving in murders, and bribing congressmen. By the end, Casino Jack told the story of Jack Abramoff but did not tell a good one. Sure this is a fascinating story, but director George Hikenlooper added unnecessary elements to the story that made it a dull and uninteresting political crap. Kevin Spacey's Golden Globe nominated performance did help with the film's uneasy story-telling, but as good as it is, Casino Jack seems to fall flat while trying to shoot really high. OscarBuzz: Kevin Spacey, Best Actor (A slight chance)",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "I'm tired of Kevin Spacey a bit... every role seems to be done the same now. Ok story.. and it is nice to see a movie that might wake up a few people to how horrible government is. Things are not done for the majority......the corrupt and big business push \"their\" laws through.",
      "total_reactions": 0,
      "user": "pgmark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Fun show if divorced from reality.  In reality, a reminder of the corruption and who really controls our government.  I think Kevin Spacey did an excellent job.  Also, nice cameo by my Mayor and Governor-elect in his late cousin's movie.",
      "total_reactions": 0,
      "user": "katzmandu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "One of the best films I saw in 2010. Abramoff is a fascinating figure who was too smart and well connected to be dismissed as some vogue miscreant. Kevin Spacey does a tremendous job with the character, and while the audience and the broader public may never truly understand the man, this movie successfully draws the viewer into his world. The story of Abramoff is a powerful reminder of the institutionalized sleaze at the highest levels of government, and Hickenlooper is unrelenting in exposing this underbelly.",
      "total_reactions": 0,
      "user": "Powerslave77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Casino Jack is enjoyable enough, but lacks pacing or originality; i felt like I was watching bits and pieces from other (better) films the whole time. Nonetheless, Spacey plays slick lobbyist Abramoff with just the right touch, and is well-suited for the role.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "20 minutes in I did not know what was going on. 30 minutes in I wondered what I was watching. Is this a dark comedy? Why is the sniper guy from Saving Private Ryan in this, and in a suit. Where's his rifle? 40 minutes in I stopped to make tacos. After the most amazing tacos I tried again. 10 minutes later I stopped. What am I watching? There is about an hour left of movie. I'm not going to watch it.",
      "total_reactions": 0,
      "user": "Zebunker"
    }
  ]
}