{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "Cats & Dogs: The Revenge of Kitty Galore",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "When I was growing up the first Cats and Dogs came out, however I'm now all grown up and have no feelings of love towards it, so when I had to take my cousin to see it, you could say I was horrified I liked the original in the first place. Where to start, the acting, CG and story are all inept. I will say Marmaduke looks worse but that's not a whole lot of praise. Overall I'd say if your child is around 5 s/he be entertained. But at around 7+ I'd recommend renting something",
      "total_reactions": 3,
      "user": "NF123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "$85 Million Dollars was used to make this film. Where did the money go?!!?! Not in the story part of Cats and Dogs The Revenge of Kitty Galore. Seriously what company would wait for nine years to make a sequel to a film that didn't need one in the first place. I hated everything about this film. All it was was a rehash of the first films plot which involves a cat bent on taking over the world and some dogs trying to stop the mad feline. The only difference is that the dogs team up with the cats. This film made me laugh a few times, but not enough to recommend this movie. Plus the ending leaves opened for a sequel that will probably never see the light of day. Hopefully this is the final film in the Cats and Dogs Franchise.",
      "total_reactions": 2,
      "user": "TheCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "A disappointment...",
      "total_reactions": 1,
      "user": "ESS180"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "When I was growing up the first Cats and Dogs came out, however I'm now all grown up and have no feelings of love towards it, so when I had to take my cousin to see it, you could say I was horrified I liked the original in the first place. Where to start, the acting, CG and story are all inept. I will say Marmaduke looks worse but that's not a whole lot of praise",
      "total_reactions": 3,
      "user": "daddy_boglin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "\"This was actually overall a pretty decent flick , not great or anything , no where compares to its predecessor , but i did like Bette Midler as the villain , the 3D was unnecessary , and the movie was cornballlish and predictable so a mild recommendation\" .. C+",
      "total_reactions": 1,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I don't see why people don't like it. well I do. It was great entertainment, perfect visuals, and great comedy.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This isn't worth spending time watching. I would rather was dishes than watch this. My 3 year-old brother, 20 minutes into this movie asked if we could leave. How's that for a critic.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "This is not a good movie at all!  I can't believe I even went to see it!  The plot is so unoriginal.  It reminds me of James Bond, or some other secret agent movie.  The acting is pretty bad also.  It sounds like nails screeching on a black board.  To be fair here, this movie is meant for little kids, but I was fourteen when I saw this.  I thought it would be good, but it was terrible!  I don't even like dogs!",
      "total_reactions": 0,
      "user": "cub317"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "CATS & DOGS: The Revenge of Kitty Galore is a bad and highly unfunny or entertaining kiddie film that doesn't pay respect to the decent original and looks more cheaper than the first.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "A cute film, but don't expect anything too different or new from the first film.",
      "total_reactions": 0,
      "user": "PeppersReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "the first movie was funny and entertaining. This film was boring and bad. I saw it on 3d and the 3d sucked. I liked the scene with The silence of the cats. This one was good. All the other movie was flying cats and dogs talking",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "No, no, and no, this film does not get more. What I see is a boring and repetitive work, with bad dubbing and a villain that gives shame.",
      "total_reactions": 0,
      "user": "Mordovan89"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Cats and Dogs should not have added this piece of crap sequel. I fell asleep 30 minutes into the movie. This movie is definitely for kids 7 and under.",
      "total_reactions": 0,
      "user": "emlugo123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "Don't get me wrong, but I do love the attempt of cats and dogs fighting some evil (especially fighting Kitty Galore) and saving the day once again. Unfortunately, all of this was let down by the jokes this film had and it's not cool.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "While I love cats and dogs in real life, this was not what anyone really wanted. The plot is dumb, its dumb how animals would be fighting like this, and this is just no other reason to watch this hunk of garbage.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "The only reason why I gave this a 4 was cats are good. Still cheesy and Dogs should be bad guys. Not a dog lover here. Plus, the graphics were bad and this is cheesy.",
      "total_reactions": 0,
      "user": "StannyCartvski"
    }
  ]
}