{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "CBGB",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 8,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "CBGB has more of the original prankish punk spirit than it even recognizes."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Rickman is too theatrical, and too British, to vanish entirely into the person of Hilly Kristal. But he's entertaining to watch, and ultimately one of the more persuasive actors in a movie that suffers from as many odd casting decisions as Lee Daniels' The Butler."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Alan Rickman's lead performance highlights a sincere but insubstantial rock pic."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "You can’t help feeling as if Miller has missed an opportunity. Punk rock was all about manic energy, unbridled (and often unfocused) passion. CBGB plays more like a folk tale."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 42,
      "summary": "Punk may not be dead, but this picture is D.O.A."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "As a film, the result is static, like Ang Lee’s similarly muddled “Taking Woodstock.”"
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 37,
      "summary": "The absolute antithesis to the pioneering punk spirit it tries to portray."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "No doubt a decent movie could have been made about the behind-the-scenes life of CBGB, but CBGB isn’t it. It’s as flip about the club as it is about Kristal, the music, and the time and place that shaped it all."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 30,
      "summary": "In its stylistically flailing stab at authenticity, CBGB ends up merely a mess of caricatures."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "CBGB ain't no party, it ain't no disco, it ain't no foolin' around. It also isn't authentic for a second, and it provides zero insight into the birth of the New York City punk scene in the 1970s."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "The most distressing bad choice in CBGB, a movie entirely composed from them, is that those brilliant songs are repurposed studio recordings."
    },
    {
      "critic": "Charlie Schmidlin",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "Director Randall Miller (“Bottle Shock”) could do worse than render the early-'70s punk scene as breezy broad comedy. He adopts that tactic and still falters though, deflating any energy or humor possible with his limp direction, sitcom consistency, and unfocused tone."
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "As the film moves from one musical performance to another, the result increasingly feels like a series of celebrity impersonations set to a best-of-punk compilation album."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 20,
      "summary": "Transforms the glory days of Hilly Kristal’s Bowery punk/No Wave club into exactly the sort of moldy sitcom one might expect from writer-director Randall Miller."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 20,
      "summary": "There is no story to speak of. Just a series of anecdotes that gain very little when acted out on screen."
    },
    {
      "critic": "Brian McManus",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 20,
      "summary": "CBGB's biggest problem is that it's taken such electrifying source material and done absolutely zilch with it."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 20,
      "summary": "The film strives to cinematically reanimate that shabby underground lair; instead, it proves to be the most bastardized souvenir bauble of all."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "I was entertained from start to finish by this high energy movie.  The birth of punk music provides the backdrop for the story of Hilly Kristal who has a vision for a club where musicians play original music.  He starts out a ne'er do well and never really loses his messy, gritty persona while building CBGB.  Alan Rickman is outstanding as are many of the familiar faces, and the unknown actors playing the rockers are spot on.",
      "total_reactions": 0,
      "user": "cinebabe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "This is a very good movie portraying the birth of punk rock'n'roll. Are the music performances studio recordings? Yes, they are - so what?! They show exactly what the bands sounded like when they debuted their singles.",
      "total_reactions": 0,
      "user": "CallHercules"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 3,
      "text": "Obviously a love letter, but a haphazard, disjointed one at best. Scene after scene and character after character seemed to be included only because they must have been somehow important, but why they were important is never really explained. It seems more like an anthology of re-enactments of 2nd hand stories, cleaned up and recycled into an TV after-school special (and probably had the same budget, judging by the cheap Halloween wigs that prove to be incredibly distracting in their awfulness). This is especially notable in a scene where, apropos of nothing,  the guy from The Big Bang Theory offers a blowie to a guy we're supposed to believe is Iggy Pop...for some reason.  I assume it was supposed to be some of the comedy we were promised, but, forced in as it was,  it was just confusing.",
      "total_reactions": 0,
      "user": "RocktopusPrime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "Oh my gosh! Just dreadful. CBGB is so bad it doesn't  even deserve an OMG. It feels like it was made by a 12 year old that never left the suburbs during the 80s but dreamed about going to NYC and CBGBs. One after another some look alike actor comes out and lipsyncs a song. Then it ends.",
      "total_reactions": 0,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "I truly loved this movie!!  It is a love story to the man, Hilly Kristal, the one who started a movement in music.  He was a hero, rough around the edges, like the film, but I think that was the point the filmmakers were making.  The casting was absolutely super as well: Malin Akerman as Debbie Harry (Amazing!); Rupert Grint as punk rocker, Cheetah Chrome (Inspired!); Ashley Greene, the best performance of her career; Freddy Rodriguez was completely unrecognizable (Very very good!); Justin Bartha as punk rocker, Stiv Bators (F'ck'n awesome!); Donal Logue is always one of my favorite (Great!).   The bands were amazing as well, David Bryne and Sting and Television were spot on!!  Run, don't walk to see this film... its fun, its funny and its a great story about the birth of Punk Rock on the Bowery.  Don't listen to the critics they are DEAD WRONG!!",
      "total_reactions": 0,
      "user": "RockItHard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "A TRIBUTE TO THE GODFATHER OF PUNK ROCK",
      "total_reactions": 0,
      "user": "AnoopJoseph"
    }
  ]
}