{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 70,
  "mc_mixed_rating_frequency": 22,
  "mc_movie_name": "Cedar Rapids",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 58,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 91,
      "summary": "Sweetness makes the raunch in this honestly funny movie even funnier."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 90,
      "summary": "Tim isn't super anything (though he proves heroic), and what makes Cedar Rapids a low-wattage pleasure is its insistence that his ordinariness - with his decency and sense of wonder - is pretty extraordinary."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 88,
      "summary": "To ensure customer loyalty, Hollywood should promote more movies about workaday life in the provinces, but until there's a new wave of midcoast comedies, Cedar Rapids is the big kahuna."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 83,
      "summary": "This movie embraces its inner yokel."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 83,
      "summary": "Helms plays angelic insurance agent Tim Lippe with gentle nobility and hilarious naivete."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 80,
      "summary": "One of those sunny-natured indie comedies that comes out of nowhere to put a smile on your face."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "A really entertaining effort, aided by some terrific performances."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "The main thing about Cedar Rapids is that it makes you laugh-often and out loud."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "If that all sounds like a lot of good, clean fun, a word of warning. In what seems to have become the genre's raison d'etre, the dialogue is so blue at times that you'll probably feel the heat of the blushing cheeks on either side of you, especially whenever Reilly's fast-talking savant of smut shows up."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 78,
      "summary": "This is smart, quirky, frequently laugh-out-loud comedy, in all seriousness."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a farce with sexual come-ons and actual sex - the Boy Scout Tim's first encounter with a hooker and a crack pipe - but Cedar Rapids never loses track of the humanity of its characters."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Has an inordinate number of good laughs mixed in with the not-so-good ones."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "The ensemble rolls gleefully with the script's twists (which aren't all that twisty, to be fair), and the film piles up laugh after laugh agreeably."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "For a movie loaded with ear-scorching profanity, oceans of booze, and illegal drugs enough to keep all of Cedar Rapids in high spirits for a month, there is something fundamentally decent about the film."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "The movie shouldn't work, yet it does."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "As a satire of the insurance industry, and more implicitly of religious hypocrisy, Cedar Rapids is mild stuff. But the movie has a nice lived-in feel, and a sense that its comedy has been earned."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Nothing if not versatile. And, although perhaps not as funny as one might expect given the setup, it successfully grows the main characters beyond their stereotype roots."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Cedar Rapids had me smiling at hello."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "This is a Frank Capra-meets-Judd Apatow comedy with a sweetness-laced ribaldry."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "In addition to being funny and endearing and having a lively script and lots of nicely observed performances - is something of an education."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "The cast, anchored by sweetly goofy Ed Helms, redeems the film at every turn, adding humor and dimension to characters who might have otherwise drowned in tacky grotesquerie."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Modest in every way, the screenplay by Phil Johnston is enjoyable in the telling even when the details smack of contrivance."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Cedar Rapids has something of the same spirit of \"Fargo\" in its approach to the earnest natures of its small-towners."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "Often hilarious, although I found it so amped-up and overly broad that I was exhausted before the movie was over."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "It helps that Reilly is the opposite of a slob-comic. With his hangdog melancholy, he makes even the nonstop cunnilingus allusions poignant-the product of emotional longing."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "It's not exactly \"The Hangover,\" but the dialogue and situations often get distinctly gamey."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "Though not as uproarious as \"The 40-Year-Old Virgin,\" director Miguel Arteta's consistently entertaining white-collar laffer could do for Helms what that film did for Steve Carell."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 63,
      "summary": "It's a decent comedy, mind you, one with its fair share of chuckles. But it's really more amusing than it is fall-out-of-your-seat funny."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "Maybe the Midwest isn't actually like this, but if it were, would that be so bad?"
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Its appeal comes almost entirely from the cast members, who appear genuinely excited to invite us to their party."
    },
    {
      "critic": "Steve Ramos",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Reilly delivers another one of his trademark \"nutty pal\" performances that continue to win him fans."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Helms's screen persona-the stiff-necked nerd who triumphs through sheer doggedness-is heavily reminiscent of Harold Lloyd's, though Lloyd was handsome and endearing enough to succeed as a romantic lead."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "The movie just ping-pongs between empathetic chuckles at Helms's charming social awkwardness and putting him through a raunchfest ringer."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Like Charlie Chaplin and Buster Keaton before him, Helms plays a lamb trotting hopefully through the abattoir, blessedly unaware of the blades hanging just above his head."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "This is the reliable raunch-plus-sweetness comic formula that goes back through the Farrelly brothers, Adam Sandler's comedies, \"Revenge of the Nerds,\" \"Porky's\" and \"Animal House.\""
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a movie that needs to look down its nose for its laughs, which generally isn't the best place to find them."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "A mild comedy of embarrassment."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I don't watch The Office, but I like Ed Helms - especially in The Hangover. However, John C.Reilly dominates this movie, and he's hilarious. Absolutely makes the film. Anne Heche is also terrific - her career has been on a great path.  Love to see her in the more supporting roles.  She handles them with nuance.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Bringing more smiles than disorderly cachinnation, \"Cedar Rapids\" is a film whose low-key, ordinariness makes for a comedy that is innately delightful; braced by solid performances that welcome you at the door, show you around, and 'Got You' when you need them. Selling insurance never sounded so good!",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "The TV ads painted an unflattering picture, but I decided to give this one a shot. This was a fun little comedy with a talented cast playing their usual roles. Loved the cameo from Rob Corddry.",
      "total_reactions": 1,
      "user": "Akuto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Starts out like crap but slowly becomes slightly better as the movie goes, I can see why this went straight to DVD in Australia, I found it hard to watch but I stuck through it anyway, Helms is a decent lead but it's John C. Reiliy that steals the entire film. Support cast is pretty good as well with the likes of Anne Hesche, Stephen Root, Sigourney Weaver and the black guy from The Wire. this movie is best to be watched once and then re-visited when your bored of your DVD Collection.",
      "total_reactions": 1,
      "user": "Tranquilbez22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Judging by the insurance salesman's reaction to his roommate, racial diversity must not be one of Brown Valley's strong suits. Intruder is the salesman's first instinct. Via cell phone, he tells his lover Macy(Sigourney Weaver), \"There's an Afro-American man standing in my room.\" A black insurance salesman, imagine that. Tim Lippe(Ed Helms) is certainly not in Wisconsin anymore. Sent as a replacement for a dead colleague to the annual Two Diamonds Convention in Cedar Rapids, Iowa, in short order, the country mouse boards his first airplane, unknowingly gets propositioned by a hooker, and meets Ronald Wilkes(Isiah Whitlock Jr.), the aforementioned Afro-American who inspires fear and trepidation in the provincial conventioneer. Slow to make eye contact, Ronald's friendly comportment soon dispels the negative media images of African-Americans that may have collected in Tim's mind over his lifetime which would make the country bumpkin feel ill at ease without any provocation. Taking no offense to Tim's perceivable discomfort with the rooming arrangements, Ronald establishes common ground with the ignorant, but innocent naif, by reminding him that they're members of the same profession, showing him his billboard advertisement on the computer in a voice that would make Bryant Gumbel proud. Sounding more like Wayne Brady than Flava Flav, Tim settles down, realizing for the first time that not all black men are gangstas. Later in the film, similar to Brady's famous turn as a murderous pimp on Comedy Central's \"Chappelle Show\", Ronald puts on a little minstrel act when he emulates Omar from HBO's \"The Wire\" in order to rescue his white friend from further injury in a party brawl. Employing a \"blacker\" voice, Ronald says menacingly, \"I always keep one in the chamber,\" just like how Brady broke away from his white-friendly speaking delivery with gusto, delving into ghetto-speak with a vengeance, popping off such memorable bon mots as, \"Riverside, mothaf*ckers!\" and, \"Is Wayne Brady gonna have to choke a b*tch?\" During their getaway, Tim's previously misguided preconceptions about black people turns up when he comments that Ronald was talking like a \"gangsta person\". By watching Ronald play a character, Tim(and the moviegoer) gains some valuable insight to the social pressure that black people face from their brethren to be more \"ethnic\", or risk ostracization if they're deemed \"too white\" and educated for comfort. This masquerade of \"keeping it real\" works because those Anglo-American partygoers are confronted by(and believe in) the media's image of the black person, and not Ronald himself, who is as suburban as the next guy. It's a real possibility that he hangs around exclusively with a white crowd. Also in the fleeing car, along for the ride with this merry band of bacchanal agents(including a very funny John C. Reilly) is Joan Ostowski-Fox(Anne Heche), a married woman with two children, whom Tim has a brief fling with. Joan's ability to compartmentalize the ribald times she has in Iowa from her boring domesticated life back home recalls Alex(Vera Farmiga), the frequent flier with baggage who seduces the light traveler Ryan Bingham(George Clooney) in Jason Reitman's \"Up in the Air\". Ironically, Tim, despite being hopelessly naive and unworldly, practically a virgin when it comes to flying, is able to walk away from his one-night stand with the seasoned adulteress, whereas Ryan, the cynical and jaded world traveler, who logs more miles than can be counted, meets his match and is never the same again.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "It takes fifteen minutes to get going, but when it does, you're gonna laugh your butt off. I loved this movie and will probably go see it again before it leaves theatres. Great script, great actors, and flat out hilarious. Go see this movie today!",
      "total_reactions": 0,
      "user": "Matteo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I'm not sure the world needed one more \"clueless naive guy gets stoned for the first time and goes bonkers!\" scene in a movie. However, the overall spirit of this film is winsome and appealing. The supporting actors, especially Reilly and Heche, do a great job of making some basically sleazy behaviors seem not just amusing, but endearing, because people's hearts are in the right place.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "With John C.Reilly at full bore wacky hilarious you know you can't help but love this movie. I was so pleasantly surprised at how funny it is. One of the best comedies of the year that toys with Hangover territory and had me cracking up. It's a little slow getting in gear, but once John C.Reilly bursts on the scene all hell breaks loose in the extremely repressed world of star Ed Helms.",
      "total_reactions": 0,
      "user": "movieboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "Quirky, dry, at times vulgar, but this story of a coming-of-age insurance salesman (yes...I wrote that) played by the seemingly typecast Ed Helms as a naive, middle-aged man learning about love and business while trying to maintain his integrity and heart-of-gold.  About as unreal as it gets, the story is adorable and sweet with well-written characters played by a talented ensemble including John C. Reilly, Isiah Whitlock and Anne Heche.  This threesome embraces young-at-heart Tim Lippe while also learning a bit about themselves and the lives they've allowed themselves to get sucked into as tacky insurance salespeople.  The result is a warped moral and an unlikely happy ending.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Cedar Rapids hits and misses but most of the time it is a hit.  What brings this movie down from a 9 to a 7 is the obvious plot change at the 3/4 mark of the movie.   It was hard to follow, but John C. Reilly was the glue with his obnoxiousness and comedy.  Ed Helms played his role perfectly and surprisingly never got the show stolen from him by Reilly.  Solid Film and worth a watch, and a few laughs.  7/10",
      "total_reactions": 0,
      "user": "jdrandall38"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Its an Ok movie to go on a sunday. Don't expect it to blow your mind, the plot is not very elaborate, but at the same time you dont feel like the movie is going nowhere. It has fun parts and quiet parts making an overall decent movie. I didnt feel like i wasted my time or money watching it.",
      "total_reactions": 0,
      "user": "CBZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Usually today's movies are either crude for the male audience or sweetly romantic for the female. Somehow this sleeper of a hit manages to provide solid gross jokes while making you something for the lead characters. Ed Helms (Hangover) plays the perfect naive small-town guy thrust into the \"big\" world of a convention in Cedar Rapids. John C. Reilly is the obnoxious agent with a touching story driving the smokescreen, Anne Heche is the party agent escaping a dull, dead marriage, and Isiah Whitlock Jr. (The Wire) surprises us will a small, quiet yet critical performance. The innocence and coming of age without seeming stupid or dumb really makes this movie shine. The the twist at the end provides you with a reason to come back and see it again.",
      "total_reactions": 0,
      "user": "JacksonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "great movie.  i enjoyed it.   it was very funny.  John C Reilly and Ed Helms are funny as hell.  its a good solid movie.   this surprised me.  it was hilarious.  some scenes will have you crying.",
      "total_reactions": 0,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "In my opinion this is an overall good movie. The story is great, and very funny through out the whole movie. I also think the acting is great, especially Ed Helms, and John C. Reilly. If you are a fan of comedy, you should definitely see this movie.",
      "total_reactions": 0,
      "user": "bighead6000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "What's brown and sticky?  A stick.  Great movie.  Ed Helms is his amazing self and John C takes on more of a lovable role.  Very pleasant and definitely worth a watch.",
      "total_reactions": 0,
      "user": "penfifteen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "The cast is great in this film, John C. Reilly is particular is dynamite. I'm usually not a fan of his more comedic stuff like Talladega Nights and (the horrible) Step Brothers. When you have a great cast, you can make an average, predictable story very entertaining.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Iâ",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "Such a terrible slow start, what starts out as a corny mess of crap FINALLY becomes good about 40-45 minutes after you've been trying to convince yourself to keep watching anyway.  Seriously half of this movie could have been cut and it would have been better.",
      "total_reactions": 0,
      "user": "Sarganym"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Mr Helms should get an award for making me believe that there could be someone as naive and shut off from the \"real\" world as his character. But he does. Many times he was just on the brink of me saying\"No way; no one is that out of touch\". Mr Reilly, Mr Whitlock and Ms Heche are excellent turning in top notch characterizations. I was nodding in agreement as there characters developed. The story is the usual let's expose the two-faced leader of the pack and our hero does the right thing and comes out on top. And that's okay, just nothing new here. The acting is what makes it worth seeing.",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "It was ok but i just didnt like it that much. Very few funny parts and it wasnt all that interesting either. The acting was solid though ,as expected, and I am sure people would enjoy it but dont keep your expectations high.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "I really hate all these dry office comedies that are common place today. Films like Office Space and shows like The Office and Community, make me wonder if the people who watch this stuff are truly brain dead to what real comedy is anymore. I assumed that Cedar Rapids would be another of these films, but there is a difference, Ed Helms. Even before he was in films like the Hangover, I thought this guy was hilarious, and I am a great admirer of his work, so I gave this film a shot. Helms plays Tim Lippy, an insurance agent who went right from High School to being an insurance agent. He has never been anywhere, never done anything, and is completely oblivious to the world outside his office. That all changes when Tim is sent to represent his firm at a Midwest insurance conference in Cedar Rapids, Iowa. Alone and exposed for the first time in his life, Tim has a hard time just fitting in an letting loose, so he does what every insurance agent does, and turns to drugs, alcohol, and prostitutes. Cedar Rapids is the second film from Miguel Arteta, whose first film, Youth In Revolt, also surprised me. Neither of these films are the type of comedy I enjoy, but somehow Arteta has the magic touch. Cedar Rapids had me laughing to the point of tears, something that almost never happens, and for once, I saw how these ordinary, everyday situations could be funny. As for the star, Ed Helms, he was just amazing, his extreme anxiety and taking every emotion to it's absolute extreme just gets me every time. Cedar Rapids isn't your typical comedy and even after seeing the preview, I was convinced that it would be terrible, but the combination of Miguel Arteta and Ed Helms make this film a must see comedy classic.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "Didn't think it was that funny. Was a rather generic comedy that you would expect from an indie movie. It was ok and worth taking a risk on if you are a fan of Helms but other then that, It's worth passing on.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Great Funny movie. Really enjoyed it. Overall it's a great, fun movie to watch.    A.    .    .",
      "total_reactions": 0,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "A funny film which is well worth a view, Cedar Rapids surprised me as, if I am being totally honest, I was not expecting much from the picture. It was paced well and funny in a lot of parts, one of the hidden gems in a genre which is entirely dominated by one man, Judd Apatow.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "When a comedy has as little plot as Cedar Rapids, it should at least be funny. John C. Really is a great actor and can be downright hilarious; however, his character, who is meant to be the wild card, only made me frown.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Two hours of my life I will never get back.  Should have followed our instincts at about the 25 minute mark and bailed at that point.  Live and learn I guess.",
      "total_reactions": 0,
      "user": "rothjosh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "I found this movie to be really boring. Of course it had few funny moments, but overall it definitely was not my type of movie as it made me feel sleepy for most of it and first hour I watched hoping it will get better, but it didn't - so I just skipped through the rest and watched the ending.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    }
  ]
}