{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Celeste and Jesse Forever",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 100,
      "summary": "This film has a voice of its own. And at a time when the romantic comedy seems to be a lost art form, that's saying something."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 91,
      "summary": "I will say that it's been a while since a romantic comedy mustered this much charm by looking this much like life."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "It's hard to know whether this is a function of the sympathetic screenplay or of Krieger's sympathetic direction - or both - but Celeste and Jesse are endearing even when they do unsympathetic things."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "I'm not surprised that Rashida Jones took the lead in writing this screenplay; the way things are going now, if an actress doesn't write a good role for herself, no one else is going to write one."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 83,
      "summary": "It's as if we were watching one of those buddy-buddy bromances told, this time, from the perspective of the woman who is normally on the sidelines of the men's attentions and affections. It's a welcome angle."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 80,
      "summary": "It is a tremendous performance by Jones, who co-wrote the script with her own ex-boyfriend Will McCormick, who appears as a drug-dealing friend with surprisingly grounded advice for just about anything."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "To its credit, Celeste and Jesse Forever wants to be more than a formulaic farce. It succeeds to the extent that the neighbors keep up with Jones."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Unlike most rom-coms, Celeste and Jesse Forever delves into the complicated heart of relationships, exposes some painful truths and allows melancholy to co-exist alongside breezy humor."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Despite flouting Hollywood clichés, it nevertheless manages to be both romantic and funny even though it starts with the separation of the main couple."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Jones is first-rate (and her fellow writer McCormack is fun as the wild-eyed pot dealer, Skillz). The film has a conventional fake-documentary look, but underneath it is an honest concern about how to learn to treat people well and kindly after the end. Or to get to an ending, or a new beginning, in the first place."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "What really lifts Celeste and Jesse Forever above the rom-com herd, besides breakout star performances from Jones and Samberg, is the movie's willingness to replace clichés with painful truths. It's irresistible."
    },
    {
      "critic": "William Goss",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Forever doesn't deviate terribly from the can-we-be-friends-after-sex playbook, but it rarely opts for hysterics or contrivance to push our leads along, so long as you can swallow the amicability with which they initially divorce."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 75,
      "summary": "An honest and breezily melancholic film, thoroughly clear-sighted in its intentions and ideas and bravely committed to the emotional rigors of its central relationship."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "It's a highly imperfect movie - many of the gags are strained, a bit too pleased with their own finger-on-the-pulse zinginess - but it still represents a breakthrough of sorts, a way of looking at marriage that resists portraying a \"failed\" marriage as a failure."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "There are moments when the film is a little too precious, taking time to preen at just how clever it is."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Celeste and Jesse Forever creates a handful of likable and very human characters, so much so that halfway through you want the film to stop putting them through the emotional wringer so that you can just spend time with them."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "While Celeste and Jesse is decidedly conventional in most respects, it's pretty swell as an exploration of a relationship between a man and a woman that's no longer predicated by mutual desire."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "It ends up being surprisingly touching, despite the fact that you start rooting for the cloyingly cute Celeste and Jesse to break up almost from the first frame."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 70,
      "summary": "Jones is great in the part, even if this movie doesn't quite prove she should be carrying films on her own, and the actress makes her character's clumsy heartache feel like more than a plot point."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 67,
      "summary": "The whole thing is a step above studio romantic comedies, but that's not saying much."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "The movie is sardonic, hip, heartfelt, surprisingly white, and for all its ensemble pleasures, it's squarely about a furiously prim young woman and how she learns to bend."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "It may have the faintest relationship to any kind of reality, but Jones' tart performance cuts through the saccharine."
    },
    {
      "critic": "Ellen E. Jones",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "This honest, if not funny, comedy is all about Celeste. If anyone can make you sympathise with affluent LA yuppies, Rashida Jones can."
    },
    {
      "critic": "Matt Singer",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 60,
      "summary": "Jones writes herself a couple of powerful scenes and plays them well, but she and director Lee Toland Krieger don't find many memorable uses for Samberg as her blandly schlubby hubby."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 58,
      "summary": "Well-intentioned but underdeveloped and self-satisfied, it feels at times like the ultimate movie for the millennial generation, or at least its stereotype."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Celeste and Jesse Forever engages in Bridget Jones-like comedy of mortification, sending its heroine down a path of self-discovery that ultimately seems more cruel than revelatory."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "If nothing else, the shaggy romantic comedy Celeste And Jesse Forever establishes that Parks And Recreation's Rashida Jones is a movie star."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 50,
      "summary": "Celeste & Jesse Forever earns points for bucking formula, but its fusion of snark and sincerity has a calculated slickness that rings increasingly hollow."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 42,
      "summary": "If you prefer hipster romantic comedies that are unromantic and not too funny, Lee Toland Krieger's movie may be your grande half-caf caramel mocha frappe."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 40,
      "summary": "A low-fi indie that swiftly slums into terminal feyness."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "Celeste and Jesse Forever isn't a movie many people will outright hate, but if this is the most original romantic comedy that Hollywood can muster, forever can't come soon enough."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "The more these two likable people rattled on, the more I found myself thinking about the elusive distinction between characters talking genuinely smart talk and simply chattering for the camera."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "Jones co-wrote the uneven script with Will McCormack, and one can't help wishing she'd aimed higher. Acknowledging cineplex clichés isn't enough if you still wind up embracing, rather than subverting, them."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 40,
      "summary": "Throughout, stereotypes are trotted out so that the movie can wink that it's too smart for them."
    },
    {
      "critic": "Ray Greene",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 30,
      "summary": "This movie will not find an audience. It's got likable stars, a reliable commercial genre and a decent supporting cast, but nobody will turn out to see it, even if it was a labor of love."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "You don't believe Celeste for a minute when she tells a new guy that she needs to be alone for awhile. You know he's coming back in short order to provide the happy ending. Here's hoping she doesn't want him to get a job, too."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "So why are they divorcing, you ask. Who knows? Certainly not the creators of the very confused Celeste and Jesse Forever."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Can a man and a woman just be friends?",
      "total_reactions": 2,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I think you'd be stretching the definition by calling this a Rom-Com, but I enjoyed it.  It certainly explored an original premise and played it out, which is nice.  Samberg can certainly play the dramatic roles, but Jones is the breakout star here.  I'd like to see her considered for more leading-lady roles.  Incidentally, if you're grossed out by dick jokes and that sort of thing, you might want to skip this. (I'm not, btw. I enjoyed all of it.)",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "I still think this is one of the best pure romantic comedies of this decade. It's a shame it didn't get more attention or a wider release. I don't get it. There's nothing about this that feels too hard or real for a mainstream audience.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "They're getting divorced, but this cute-as-puppies couple are still best friends. What's wrong with this picture? I would say the honest, endearing Rashida Jones, and Samberg to a lesser extent, keep this always-unrealistic concept going pretty well.But they are so believable as \"pals\" that you never quite buy them as passionate. Similar plots have been done amusingly (\"It's Complicated\") and horrendously (\"The Break-Up\"), with this film falling in between.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Started off beautifully, this endearing romantic comedy has enough funny moments as well as moments of truth to make it an enjoyable film to watch, which is defined by the realistic performance of Rashida Jones.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "I really, really find Rashida Jones attractive, and I even liked her character in this movie. Nothing sexier than an earthy, naturally beautiful, sarcastic intellectual for me. But I didn't like any of the other characters, and the script was weak and the dialogue full of cliches. Her husband was very annoying, and her sort-of boyfriend even worse. The drug dealer guy? I won't even say.",
      "total_reactions": 0,
      "user": "MrThistle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Enjoyable film though it's something you've seen before in the same setting, but with different characters. Andy Samberg's Jesse is a great subtle change from his scene-stealing on SNL, while this is to Rashida Jones (who co-writes this, as well as stars) what \"Bridesmaids\" was to Kristen Wiig. Jones gives an incredible performance showing incredible range. This is a good date movie, but an even better movie for the brokenhearted.",
      "total_reactions": 0,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Rashida Jones' writing debut is a breakthrough. She's managed to capture audiences immediately in what I'd like to call a \"lo-fi\" independent romantic-comedy. Not to mention: she and Andy Samberg are magic together.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "My expectations weren't high for this one but thanks to a great script from Rashida Jones and Will McCormack that takes the tired, same-old-same-old romcom genre and gave it some heart and authenticity, I was pleasantly surprised with this one.  The only real downside I had for this one was that the supporting characters don't have a large enough presence in the story but the film is touching, funny and Andy Samberg and Rashida Jones are incredible to watch and that easily makes up for any shortcomings the film has.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Charming,Sweet and heartfelt describes this rom-com.  Rashida Jones and Will McCormack's script is touching and original, however the comedy i do not find the humor material funny. Andy Samberg's performance is somewhat good since his other comedy roles. Grade A-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "It supposed to be a comedy but instead it's not. I love this story. It's actually gave me a great message about relationship. It's pretty awesome. I thought Andy Samberg would be the main point of the universe but it's just about him, in bad ways. I'm proud of this movie. I'm glad.  The cinematography also good and they gave lots of scenes and they were all important. Many of love drama or comedy romantic movies, they gave us many scenes but none of them really matter, but this one movie, each of scenes gave me different issues. The movie put the plot as the impressive story line. Made me being moved, actually. 10? #yes.",
      "total_reactions": 0,
      "user": "RoraEst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Celeste & Jesse Forever was a surprisingly original romantic comedy that seems to me more common these days after movies like (500) Days of Summer and The Spectacular Now. The cast in excellent in this movie and I really did care about the two main characters played by Rashida Jones and Andy Samberg. The film is surprisingly emotional at points but can also be quite light hearted and funny as well. Rashida Jones is so great in this movie. I have loved her since Parks & Rec and I thought she was just so easy to latch on to and so easy to love that you just have to keep your eyes on her for the whole run time. This movie would be great for date night.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "\"Celeste and Jesse Forever\" 10 Scale Rating: 7.5 (Very Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "This movie has a lot of things going for it, like a stunning and talented cast and the beautiful backdrop of LA, but somehow the whole thing managed to fall flat.  The character of Celeste herself, who dominates the film first with her upbeat acceptance of her marital separation, and then with her downward spiral when she discovers the hard way that she isn't as over things as she thinks, is compelling and interesting in her struggle.  But the movie spends a lot of time acting out rom-com stereotypes but with a meta-wink so that we know they're too clever, which is wasted time and often unfunny--Elijah Wood is completely unbelievable and not at all entertaining when his character makes a conscious attempt to be the over-the-top stereotypical gay friend, and of course Rashida Jones has to give a slightly drunk maid-of-honour speech at her BFF's wedding.   There's also a weird but somehow not awful interlude where the adult Rashida Jones strikes up a friendship with the young pop star (played by Emma Roberts, who brings just the right amount of attitude and melodrama to the role) Jones' workplace has recently signed, in which Jones somehow finds clarity in the comfort and company of the younger woman--definitely an unexpected plot turn, and not very believable, but Roberts' was charming enough in the role that I didn't mind.  Still, the charm of the cast couldn't make up for the lack of direction in the story, which strayed into shapelessness.",
      "total_reactions": 0,
      "user": "heatherm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "A great rom com with great dialogue and enough funniness to get through the sad moments. Andy Samberg & Rashida Jones work brilliantly together as two best friends who love each other but can't make it work. One of my personal favourite movies.",
      "total_reactions": 0,
      "user": "TechnoElf"
    }
  ]
}