{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 164,
  "mc_movie_name": "Chappie",
  "mc_negative_rating_frequency": 83,
  "mc_positive_rating_frequency": 507,
  "mc_pro_critic_reviews": [
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 80,
      "summary": "This hugely entertaining oddity could never be mistaken for the work of any other filmmaker."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s a good sci-fi action movie, too. Far be it from me to give this movie the kiss of death by making it seem too serious for its core audience. Chappie is everything it has to be — but it’s everything it should be, too."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Between the charming Copley performance, the ingenious visuals, the absolutely incredible all-electronic Hans Zimmer score (seriously, this is one of his best ever), and the propulsive narrative thrust (Blomkamp is rarely singled out for how swiftly he moves things along, plot holes be damned), there is a lot to appreciate and even love about Chappie."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 70,
      "summary": "There's something fearlessly uncool about the film, which suffers mostly from being made 30 years too late."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 67,
      "summary": "With a titanium body and a child's mind, Chappie is a fascinating figure, vividly rendered, enough so that you wish there was a better movie around him."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "This is a well-meaning film with a good idea that unfortunately stumbles on its way to its less-than-satisfying end."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Chappie boasts so many entertaining elements, particularly the lead motion-capture performance by Blomkamp’s go-to guy Sharlto Copley, its shortcomings don’t sink the movie."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Chappie is meant to inspire questions about what it means to be human, and at times it does. However, director and co-writer Neill Blomkamp doesn't explore its intriguing premise deeply enough."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Even at his shakiest, Mr. Blomkamp holds your attention with stories about characters banding together to emerge from a hell not of their own making, a liberation journey that just isn’t the same old, same old when a director was born in South Africa."
    },
    {
      "critic": "Matt Maytum",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Like its title character, Chappie is stunning to behold and easy to like, but it’s still some way from fully developed."
    },
    {
      "critic": "Chris Hewitt (1)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Blomkamp’s third movie has just about enough spectacle and quirk to overcome some fairly major flaws, not least of which is an unappealing central trio."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Chappie is a broad, brash picture, which does not allow itself to get bogged down in arguing about whether or not “artificial intelligence” is possible. It has subversive energy and fun."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s a brawny, inventive action romp that’s as happy firing rockets at helicopters as it is contemplating the Cartesian model of mind-body dualism, which gives it a satisfying, sweet-and-sour tang of its own."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Now, with Chappie, the director/co-writer returns home for an uneven showcase of impeccable visual effects and lackluster emotional affect."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Criminally underwritten characters result in actors like Hugh Jackman, Sigourney Weaver, and Dev Patel (Slumdog Millionaire) having little to do."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "When we’re first introduced, he’s an overwhelmed infant, and by the time the credits roll, he’s John McClane. Is that an accurate representation of how artificial intelligence can evolve? Absolutely. Does it make for compelling drama? Not particularly."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Chappie has a nothing-to-lose Roger Cormanesque quality about it, low on budget (except for the CGI robots) and low on meaning, but full of high-velocity chases, helicopter pursuits, and weapons blasting around empty warehouses marred by graffiti and trash."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "A movie about a robot policeman given a childlike conscience, Chappie is one of those incongruous Franken-films that’s simultaneously bombastically brutal and treacly. Like E.T. the Extra-Terrestrial crossed with Transformers, or RoboCop starring Jar Jar Binks, it’s a recipe guaranteed to produce aesthetic indigestion."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The technology is seamless, the movements are eloquent and the problem may be my own misprogramming, but the robot still looked to me like a man in a robot suit."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Chappie feels like Blomkamp and his co-writer Terri Tatchell had three or four different films they wanted to make, and instead of figuring out which one actually worked, they just made them all at the same time."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Like \"Elysium,\" this rusty A.I. story is basically just \"District 9\" with a new coat of paint; it’s distinguished only by the jabbering, irritating personality of its title character."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Blomkamp regular Sharlto Copley is quite good — as Chappie, in a motion-capture performance. (He also provides the voice of the robot.) If this were somehow a commentary on man's increasing lack of humanity or something, that would be fine. Instead, it's just good work buried inside a movie made up of intriguing ideas that never really go anywhere."
    },
    {
      "critic": "Travis Clark",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "While it has a few appealing qualities, as a whole it amounts to a well-intentioned bag of missed opportunities."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 42,
      "summary": "The movie's glaring problem is the design and execution of Chappie, whose look is unremarkable except for a pair of polymer rabbit ears ready for meme posterity."
    },
    {
      "critic": "Graham Fuller",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Chappie is as subtle as a sledgehammer. The latest sci-fi action spectacle from “District 9” and “Elysium” director Neill Blomkamp is also sprawling, bombastic, deafening, ugly and ultra-violent."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "It never winds up with anything particularly interesting or effective to say about life, intelligence, religion, the nature of consciousness, or any of the other big themes it deliberately evokes. It does, however, blow up a lot of stuff."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Chappie is a bucket of bolts, Blomkamp’s desire to say meaningful things outdistancing his ability to say them compellingly."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "It’s too bad that neither the philosophy nor the pyrotechnics on-screen in Chappie can distract you from your own sinking feeling that you’ve seen almost all of this before."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Blomkamp and his wife and co-writer, Terri Tatchell, stack the deck. Instead of awe, we get \"E.T.\" - aww."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 37,
      "summary": "Despite Blomkamp’s efforts to make some kind of commentary about the human soul, which the auteur bolsters with his trademark social consciousness — a tone of preachiness that, after three films, has worn out its welcome — the movie exhibits precious little humanity."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "It’s not just that Chappie is a mishmash of familiar ingredients whose story quickly slides off the rails into a swamp of action-movie clichés, or another misbegotten project from the Land of Intriguing Premises. It doesn’t have an intriguing premise in the first place. It’s cluttered, goofy and incoherent from beginning to end, and much too long."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "With unappealing one-note characters, retread concepts and implausible motivations, Chappie is a further downward step for director Neill Blomkamp."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "Intelligence, artificial or otherwise, is one of the major casualties of Chappie, a robot-themed action movie that winds up feeling as clunky and confused as the childlike droid with which it shares its name."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "An exhausting slog through overly familiar cliches that is nowhere near as profound or touching as it clearly thinks it is and is utterly lacking in the kind of intelligence and artistry that it so often pays lip service to in the dialogue."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "“Short Circuit” meets “RoboCop” — with asides to “WALL-E,” “E.T.,” “The Road Warrior” and many other better movies — in Chappie, an interminable, violent, incoherent and wearying R-rated sci-fi action comedy."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "The film's exasperating atonality washes out any legitimate idea about identity, education, nature versus nurture, or artificial intelligence that Neill Blomkamp hoped to evince."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Wrongheaded in conception, eye-rolling in execution, Chappie is a childish blend of the cute robot goofiness of “Short Circuit,” and the bloody-minded mayhem of “Robocop.” Neill Blomkamp, the director of “District 9,” has utterly exhausted his supply of South African sci-fi ideas with this disaster, an excruciating two hours of your life you will fear, quite rightly, ever getting back."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Chappie is a movie about the evolution of artificial intelligence that's as dumb as a post. It also marks the continuing devolution of the work of director and co-writer Neill Blomkamp."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "summary": "A misjudgment from metallic head to titanium toe."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 23,
      "pos_reactions": 25,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was the best movie of 2015 in my opinion so far it was really fun to go see and I love the idea of how Chappie is like a kid and has to learn just like a human",
      "total_reactions": 48,
      "user": "Gruntygrunt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Chappie seemed disorganized at first but ends up with compelling sci-fi ideas. Blonkamp needs to package his concepts out of his South African roots and culture if he can get more exposure worldwide.  On par with District 9, but unappreciated in the box office. Too bad.",
      "total_reactions": 3,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "One of those movies that can get incredibly right some parts, a perfect 10, and screws so badly other themes and scenes that make you cringe in disbelief,  \"wtf have I watched?\". My score could not be other than 5.The movie has Blomkamp signature: fast yet clever, good characters with enough development, that forces you to ride with the movie to get the whole scenario, and this was incredibly awesome. I think this was the first movie this year i cared about the characters, \"good and evil\", if there are any. But at the same time it gets so cheesy and vain that you can't believe it's the same movie.",
      "total_reactions": 3,
      "user": "The_hamur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "I was greatly anticipating the new Blomkamp offering, and this didn't disappoint. Beautiful character design, eclectic performances and a thoroughly engaging storyline made for an excellent experience. Knowing Die Antwoord prior to this really helped, and I'd anticipate that audiences unfamiliar with them may find them, and the South African subtext, unsettling and somewhat difficult stylistically. Some truly poignant moments are interspersed with a delightful humour and, though some of the themic content needed more care, this is another unique exploration of the nature of humanity and the soul dealt with in a playful, rather than sombre, fashion. The dialogue was occasionally weak, bordering on charicature, and the cinematography was generally well executed. Overall this was a fast paced, sometimes poignant and always engaging experience. 8.11/10",
      "total_reactions": 3,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "There's something here for everyone, except stuck up film snobs apparently. It's a fun movie, just adjust your expectations. Far more human and interesting than Ex Machina",
      "total_reactions": 2,
      "user": "Loucetios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I did not have high expectations for Chappie when I tuned in. Neil Blomkamp didn't impress me with Elysium and I had heard similar things about Chappie. I enjoyed watching Chappie develop as a character throughout the movie and its hard not to be interested in him as such an innocent form of artificial intelligence. I thought there were some pretty good performances in here. Dev Patel is pretty good and its pretty hard to criticise Hugh Jackman either, its a nice change to see him as the villain. Still Sigourney Weaver was very underused and Ninja the South African rapper hogged a lot of the screen time acting like an idiot and trying to promote his band Die Antwood. I found Ninja incredibly annoying at points and I hope we don't see him again in any major role. Other than that I enjoyed the action that Chappie had to offer and I think that if you are a fan of Blomkamp's other films you will likely enjoy this one.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "This was great. I don't usually laugh at the endless forced jokes in America/British/Canadian movies but this had me cracking up. Think of this as Sci-Fi Comedy, the trailers don't really do it justice and you go in expecting grim misery.",
      "total_reactions": 2,
      "user": "Parith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "I had high expectations from this movie, since I absolutely love District 9 (same director in case you didn't know) and thought Elysium was very decent as well, but... Chappie exceeded my expectations by far. Such a fantastic film.",
      "total_reactions": 1,
      "user": "OhTheDerp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Yet another great movie where the critics fail totally. If this movie did not have \"from the director of District 9\" on the cover there is no way I would have hired it. I mean a robot with gold chains and dollar signs around it's neck? As such it can have somewhat negative first impressions, and the unlikable main characters do not help in this regard either.  But hey great movies are not  about pleasing you, and this movie certainly does not.",
      "total_reactions": 1,
      "user": "Nevermind"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Best unintentionally hilariously brilliant movie of the year!",
      "total_reactions": 1,
      "user": "Shaunjcw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Neill Blomkamp successfully blends the aural & visual wizardry of Elysium with the scrappy charm & smart storytelling of District 9 in his third feature-length film, \"Chappie\", which starts off like a South African spin on 1980's sci-fi, but then diverts from the pack and becomes its own thinking and feeling beast. Blomkamp's signature blend of raw violence and human sentiment is still on display throughout, but is more potent here since the director (and his wife Terri Tatchell) focus purely on the struggle between children and adults, and the hardships that come with growing up. The film also doubles as a tight, compelling meditation on what it really means to be alive. I think the critics missed the ball here.",
      "total_reactions": 1,
      "user": "Handyman003"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Blomkamp did it again, wow what a movie. Enjoyed it immensely and so did my friends. It is as touching as it funny and believable, can't believe how I didn't watch it in theaters just because of low critics score, well that's a lesson I learned, critics have a weird taste in a movies, so from now on their opinion is to be avoided. Watch it and you won't regret it",
      "total_reactions": 1,
      "user": "zouz123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "It's not 'District 9' (in any way) and maybe bumps into a lot of sentimental and action-genre clichés, but \"Chappie\" is an undeniably entertaining and funny fable. Oh, and Hugh Jackman(!) is in it, too.",
      "total_reactions": 1,
      "user": "ednunez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Very good fun to watch. Chappie is a generally loveable film with an interesting plot, good characters and even though Die Antwoord don't act, they did it pretty well. Recommended to watch.",
      "total_reactions": 1,
      "user": "MatHay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Chappies mildly entertaining, at times it's funny as it features a foul mouthed robot but essentially it's unoriginal. The film feels like Elysium all over again and some of the robots are stolen right out of robocop (the moose). I wish the acting had been better but essentially the main characters that should have carried the film for pop stars with little acting ability",
      "total_reactions": 1,
      "user": "tjman09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "This is one movie I should have went with my instincts, and that was to pass it by!  What a mess of a movie, never holding it together at all.  The acting was horrible and you could tell even some of the main actors such as Hugh Jackman were thinking what was I doing when I agreed to be in this movie!  The bad guys and robbers were idiotic and uninteresting and way overdone, and to add to insult looked like they come straight out of a comic book with tats and funny hairdo's.  They acted like they had IQ's under 50, and made the movie even worse than it already was.  Overall the movie was a mess and I would never recommend this to anyone!",
      "total_reactions": 1,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Chappie is not a bad movie by any means.I get how people can hate it but I love it because it is a good movie.The Director does a great and awesome job at this film just like he did in Elysium which is a film that not many people liked either but I loved it just as much as this one.Chappie gets to start from the very beginning and even tho he is in the midst of bad people that we hate at the beginning,he is not a bad robot and wins everyone's heart in the movie and outside it.",
      "total_reactions": 1,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "A heartwarming R-rated sci-fi action flick about what it really means to be human.  That should have been the tagline for this film.  I honestly feel that this was a great movie.  Every bit as good as any action film made in the last few years, including the Avengers.  But I take it for what it is.  It isn't supposed to be the next AI.  It is meant to be an engaging movie more along the lines of a cross between Robocop and Short Circuit.  Too many film critics have compare-it-itis.  They want every film to be better than the last.  They want deep thought-provoking transcendent films and anything that takes the risk of just being enjoyable gets hammered for it.  Chappie is not brilliant  but it is a mix of adulthood and childhood and innocence and violence that allows it to stand on its own as an honestly enjoyable film.",
      "total_reactions": 1,
      "user": "HandsomeHank"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "es una gran película la cual te mantiene muy entretenido en todo momento por la gran actuación de chappie y la creatividad de poder inventar un software para darle sentimientos humanos a un robot por eso se merece un 10 esta pelicula",
      "total_reactions": 1,
      "user": "Carlos94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Entertaining! I like it a lot, I am confused as to why critics are giving such negative reviews. Some parts are a tear-jerker and some are fun to watch.",
      "total_reactions": 1,
      "user": "LadyCrimson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "the people who rate this 6 or below what are u thinking this movie is great in all the ways possible.It may be a bit gruesome but it is still one of the best movies ever.",
      "total_reactions": 1,
      "user": "chappie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "If you go into \"Chappie\" expecting an even more profound retake of \"District 9,\" you will be disappointed. If you go in hoping to see a fun (and funny) popcorn movie with fantastic visuals, entertaining performances and some softly-delivered social messaging, then this is a perfectly good way to spend two hours. I'm really bothered by the criticism of Neil Blomkamp for supposedly becoming \"M. Night Shyamalan 2.0\". Just let the man make his weird movies. His vision is fresh and his movies are well crafted. Giving  rappers Die Antwoord (Ninja and Yo-Landi) major roles was a big risk that mostly paid off in the final scenes (and reinforced the distinctly South African feel of the movie). My advice? Ignore the haters and relax. \"Chappie\" might be a spiritual successor to \"Short Circuit,\" but it actually has a soul. That's no small feat in today's studio scene.",
      "total_reactions": 1,
      "user": "Triakel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "As I think, a movie becomes best when the viewers find something unexpected at the end of the movie. But, this movie ends with a normal ending. when Deon got hurts, Chappie, as a robot shows humanity and try to save him while his battery was going to over. By my opinion, the end of the movie can be better if the director presents that Deon stay wounded and when polices enters into the hall Chappie's battery would down and it would be dead. Because, the human brain can never be transmitted, i believe, death can never be ignored. But, the movie shows that with the  neurotransmitter helmet human consciousness can be transferred to a new body which is totally impossible and unbelievable.",
      "total_reactions": 1,
      "user": "Khan_Showmik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "An iconic Sci-Fi movie. I liked the storyline, but felt it's true worth was in the cinematography, graphic art, and sets. The conclusion left me on a high note. I liked the relationships depicted in the movie. I also liked Hugh Jackman as a bad guy. I think he is naturally good at this.",
      "total_reactions": 1,
      "user": "hendrikchipman"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I don't get the negative press, I really don't. This movie's take on AI isn't exactly the most scientifically accurate portrayal, but as a fun popcorn movie, Chappie takes a little bit of cerebral, a larger bit of Neill Blomkamp action, and a lot of South African weirdness. If you're expecting just a cameo from South African rappers Die Antwoord, you're wrong. They're surprisingly in focus.",
      "total_reactions": 16,
      "user": "ahnehnois"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Truly beautiful movie about what makes us human. I enjoyed it a lot and I can't understand why Chappie wasn't more succesful. The action sequences were also pretty thrilling. I do like the actors too, although everyone seems to dislike them. Interesting lead roles who play their parts very convincing. I love it ! 10 out of 10.",
      "total_reactions": 4,
      "user": "Ivan3392"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Great film,",
      "total_reactions": 4,
      "user": "yopi12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I Massively disagree with the \"critics\" that are reviewing this film. I for one massively enjoyed it and thought it was great fun. it was interesting to see Chappie grow and the mannerisms and personality that he develops is brilliant.  there are many \"critics\" who say there wasnt enough character development for Hugh Jackmans character or any of the others, but there is plenty time given to developing Chappies character and thats really all you need.",
      "total_reactions": 11,
      "user": "Afrop"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Chappie is such a great movie. Shame the critics don't like it. IGN gave it like a 75 which I thought for them was way low. I'm into the sci-fi stuff so if ur not u may not like it I'll say that about it. Although its not a homerun for everyone, The ones who do like movies like pacific rim and district 9 this movie is a 10. Go see it don't believe the hate. Its def a ride worth taking.",
      "total_reactions": 7,
      "user": "killab1984"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Let's face it.  The critics are often wrong.  I read reviews before I saw this film and it was like they were talking about a different movie.  Frankly, they just didn't get it.  There's some shoot 'em up stuff, of course but at it's heart Chappie is a story about family.  Dysfunctional but caring.  There's comedy and pathos and a really interesting twist on the \"what is consciousness, what is human\" theme.  It's a freaking character study of Chappie and his found family.",
      "total_reactions": 10,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Chappie isn’t a failed mission more than it is a missed opportunity. Because despite the many, many critics firing at it to its post-apocalyptic hell and back—specifically targeting director Neill Blomkamp’s 2009 commercial and critical breakthrough District 9, calling his success a “fluke” after 2013’s disappointing Elysium and considering him a “one-hit wonder” among the sci-fi genre—I, however, found Chappie to be both conceptually and visually involving when it wasn’t balancing on a tightrope between Chappie’s Short Circuit’s innocence-meets-Iron Giant’s naivety and the “gangsta” glorification or glamorization of their respective stereotypes. It’s one of the rare occasions where the R rating felt quite restrictive and main protagonist Chappie’s awe-inspiring lightheartedness and the supporting characters’ vulgarity and ugliness and the film’s gritty nature crossover in what appears to be Blomkamp’s identity crisis of whether he wants his ‘80s sci-fi influences to tug audiences at the heartstrings or the attention span.",
      "total_reactions": 16,
      "user": "asjklasjklas"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This is a movie not just entertaining but also refreshingly create a very solid and foreseeable future. Though it might have peppered with some unreasonable moments and few screenwriting drawbacks, it's still an awesome action-packed movie (and heart-wrenching sometimes) in a way that as well enables me to wonder if we are more human or robot if conscience could be transferred from human to a robotic body comparing to a self learning sentient android that could develop its own \"conscience\"...",
      "total_reactions": 12,
      "user": "KPJason"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This movie was great! The Wife and I really enjoyed it. Very well done and they did an amazing job of helping us the viewers connect to Chappie. Being a parent it was quite an experience seeing Chappie behave as a child and grow as a being. Really well done, fun movie!!",
      "total_reactions": 9,
      "user": "Lubetek"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "The critics are snobs, dont read them. Amazing movie, I never post here or any review sites but seeing the harsh critics I had to.",
      "total_reactions": 9,
      "user": "Archikuus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Chappie has gotten mixed reviews, but I think it is mostly because people come in expecting it to be some action robot fighting movie or a super realistic robot movie. Instead of being a pure robot action movie, they try to take on the when does something become truly alive. If a mechanical device becomes self aware and has the ability to learn in its own, should it be thought of like a human.",
      "total_reactions": 6,
      "user": "kevtheobald"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "What do all the haters want from this movie.?This is basically an adult version of short  Circuit... With an awesome central performance from sharlto copley. .. That is both humerous and touching.",
      "total_reactions": 6,
      "user": "Panzerfaust666"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I don't get what all of the negative press is one about this movie is up  there for one for my favorite movies this year. I the AI is pretty accurate and Blompkamp still makes the most realistic robot vs human fights ever!",
      "total_reactions": 6,
      "user": "mindfreak789"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "The reviewers totally misunderstood this film. It's not about Artificial Intelligence, Die Antwood, Robocop or South Africa. This is the quintessential 'outsider' film. Everyone character is alone, from Sigourney Weaver to Hugh Jackman. Even the gang members aren't united. Blomkamp hands it to us on a platter with the 'Black Sheep' story but the critics overlooked it. It's a film about trying to find your identity. It's about bullies. Its about how cruel and selfish  people can be. 'You all lie!' A couple of plot holes, yes, but hopefully, in time, this film will find it's way into acceptance. A shame for all involved as there's much to discover, not all so obvious.",
      "total_reactions": 3,
      "user": "TheRimRider"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Although Chappie improved toward the end, the movie is very amateurish. Chappie is like a film student's final year project. Employing rappers to act in the film didn't help. The first 10 min were District 9.5. Many of the plot elements had question marks, like the guy could create artificial intelligence but couldn't program it to understand English immediately? Overall, Chappie is crappy.",
      "total_reactions": 3,
      "user": "ozymandias79"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "(spoilers ahead) So I'm a pretty big fan of these critical thinking movies, and there's a lot of thinking and philosophy to be gained from this movie and the movie does a great job with the whole theme of god, humanity, immortality, and loss of innocence as we watch our main character Chappie come to terms with the world. But here's the thing that personally got me and that's the ending, it wasn't terrible but int the whole build up of Chappie essentially dying and with this looming death overhead he tries to find other means to try and live even breaking his promise with Dion saying he will do no crime so there's the loss of innocence as he ignores Dion and get's tempted by everyone else to do commit crime, and in the end it should of been a confrontation with him and Dion (his maker) who is kinda portraying god who at the end of the movie is dying from a fight but Chappie believes he can save him by transferring his consciousness into another robot essentially letting him live forever, but this is successful and Chappie does come to terms with his death happy to sacrifice himself so that his maker is alive and well but Dion then say he can save Chappie too and this is successful. I am saying that a sadder ending would of been miles better in delivering a message about humanity and all but in the end the overall movie is visually stunning with his robotics and does provide a look on someone growing up and facing hardships making him stronger for it (even though the movie is being held within the spam of a week). I was actually sort of thinking the story would of been different like the police were abusing their power and a guy who made the robots get's another point of view and decides to help by trying to create a robot that will help rise against the oppressors and this goes with the theme of Chappie growing up and is being pulled by two sides as both argue a somewhat valid point like one guy suggest going against the robots and that'll take the power for the corrupted another suggest go for the head of the snake and kill the corrupted so they can instead have the power.",
      "total_reactions": 3,
      "user": "Muzzle131"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Went in to Chappie thinking it would go one way and it ended up going a completely different direction. That's not necessarily a bad thing. I enjoyed this movie a lot and fell in love with Chappie. Thematically, it is a very strong movie. It touches on struggles with mortality and the balance of good and bad just to name a couple. The science fiction in this movie is very interesting.",
      "total_reactions": 3,
      "user": "codyeff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Awesome movie was a bit of a letdown from Elysium. I was surprised how many people were in my theater when it was over halfway empty. The robot was very funny and I actually had feelings for the gang members.",
      "total_reactions": 3,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Bad acting and gratuitous, fringe pop-culture(violence & profanity). Watkins leads the ham with Dev Patel and Jason Cope adding the cringe for the male roles, Sigourney looked tired and old in female support to a Capetonian Zef star, Yo-Landi. The characters tried too hard and the story remained predictable making the ending an anti-climax. Blomkamp needs to progress beyond local talent or suffer the consequences.",
      "total_reactions": 3,
      "user": "directproduce"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "If you're a fan of Die Antwoord, you're not going to want to miss this film. It has a huge heart, and I really enjoyed it. Perhaps my super-low expectations based on the critical reception laid the groundwork for my warming up to it, but I had a huge smile on my face for most of the film. Dev Patel as \"The Creator\" and Yo-Landi Visser as \"Mommy\" are both terrific. The action is brilliant, and the direction is solid. This movie is SO much better than Blomkamp's previous film Elysium, which was so bogged down in social politics that it forgot to make a living, breathing, feeling story. One critic suggested that Chappie might have been better suited for cinemas 20 years ago, and I can't disagree. Maybe even 30 years ago - E.T. style. But I greatly enjoyed this in the here and now. Especially given how BAD movies have been lately.",
      "total_reactions": 17,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "The Critics seem to have taken an offence to this film and have literally badgered the ratings in Rotten Tomatoes and Metacritic. They feel this film is worse than Elysium and it’s Neill Blomkamp’s worst film. “Robocopy”, “Jar Jar wept..”, etc. were the exact comments critics came out with. One of them has even quoted “I haven't been as happy to see a movie end since the third Transformers.”",
      "total_reactions": 14,
      "user": "Kisholay"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "You wouldn't know it from the ads, but Die Antwoord definitely makes this movie. I couldn't believe what I had just seen. Wow. Must see for any Die Antwoord fan.",
      "total_reactions": 14,
      "user": "ericx13"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Apparently this is just a movie everyone needs to see and judge for themselves. I am SERIOUSLY baffled by the negative reception from critics! I loved this movie, and I thought it was a very well done analysis of consciousness and self/self-identity. A beautiful coming-of-age film.",
      "total_reactions": 11,
      "user": "philray"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "We came out of the movie raving about it. There are plenty of other movies out there already that have tackled the subject of AI, consciousness, etc, but: this one did it much, much better.",
      "total_reactions": 8,
      "user": "Poisonthemonkey"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I've been shocked by reviews before, but I have never been more blown away than by the critical response of Chappie. This movie is damn near perfect. I think it might be the South African sensibility of the whole movie. This is one of the most fundamentally sound films I've seen in a very long time. It's an action-comedy love letter to the musical duo Die Antwoord. I'm a Die Antwoord fan but even if I wasn't I would understand what Blomkamp was trying to do. This was like a modern day Yellow Submarine with more movie than music and Die Antwoord doesn't suck at acting like the Beatles did. Ninja and Yolandi were actually very solid actors for this being their first film. The rest of the cast crushed it because they're all incredibly talented especially Patel. I hear a lot about Jackman's two dimensional villain and how bad it was, but that's what kind of movie this is. It's a serious movie that never takes itself too seriously. I swear to Science that film critics these days are so far up their own a***s that they wouldn't know a good movie if it puked in their face. Chappie is a solid flick and deserves praise. I think Die Antwoord should be praised for how solid they were in this movie.",
      "total_reactions": 8,
      "user": "vrildox"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I am a twenty-year-old male cinephile. Films like \"Life is Beautiful\" and \"All Quiet on the Western Front\" have brought a tear to my eye, but \"Chappie\" is the first movie to ever make me break down and cry. It's a truly brilliant film; even its action sequences affirm the humanity of the movie's title character. Its refreshing, idealistic (and ultimately proper) view of human nature is something we sorely need in an era where nihilism dominates our culture. It's a hopeful film and a wonderful one. It's also brilliantly written, acted, and shot. Don't believe the critics on this one. The cerebral could broadside them with a club and they'd still cast their bids for Oscar-bait trash. \"Chappie\" is a magnificent exploration on what it means to grow as a human person. If you've even an inkling of hope or creativity in you, then this movie is for you.",
      "total_reactions": 13,
      "user": "jazzagenomad"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I loved it, of course it has it's weak spots but i didn't had any expectations of it being a \"Metropolis\" caliber kind of sci-fi; it's cute, pop cool and the violence is there to make a point. Calm scenes are lovely shot, the technical aspects of chappie the character are phenomenal, for a moment i thought he looked too real to be cgi. Die Antwoord's presence in the film was an unexpected surprise & even more memorable than big stars Jackman & Sigourney.",
      "total_reactions": 15,
      "user": "blizzardblue"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Lots of fun, emotion and fantastic action! Chappie character was charming, funny, mean and ghetto, couldn't be a cooler robot movie! Loved it! Very entertaining!",
      "total_reactions": 15,
      "user": "brainfreeze"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Seems like 2015 is the year where the credibility of reviewers all over the globe and in all media finally comes to an end!",
      "total_reactions": 10,
      "user": "kraenk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I am officially a Neil Bomkamp fan. I loved District 9 and I loved Chappie. Sadly, I don't think this movie will get the recognition it deserves due to what seem to be dismal box office earnings. The movie was not as hardcore as district 9 in that it wasn't trying to make a comment on the human condition. It was a genuinely funny, entertaining movie. Could not recommend enough. Don't listen to the artsy fartsy critics.",
      "total_reactions": 10,
      "user": "aeroplasma"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Crazy to think consciousnesses and moral are what really define us as human beings.",
      "total_reactions": 10,
      "user": "Bshop"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "The critics are coming off as narrow-minded and superficial. Whether this is due to philosophical bias, or whether this is due to its failure to include \"Hollywood's Best and Whitest\", it does show a blind spot in their collective ideology.",
      "total_reactions": 10,
      "user": "Bio-Machine-Abh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "This was a great movie. I couldn't help but laugh and 'awww' at Chappies dialogue. It is well worth the watch.",
      "total_reactions": 5,
      "user": "Benzilla08"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "No other movie in years has entertained me, moved me and made me laugh like Chappie did. This movie really spoke to me. It's definitely not your typical robots, action and explosions movie, like I first suspected based on the trailer, which sucked. It has some great action, effects and cool music, but that's definitely not all it has to offer. First time in my life I'm going to see the same movie twice in cinema. It's a good movie, no bullsh*t, so do yourself a favor and go see it right now, I'm not lying, it's even better than District 9 and Elysium! 10/10 :)",
      "total_reactions": 5,
      "user": "D13613"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I really don't understand the hate from \"critics\" about this movie. I thought it was a great movie filled with action and big ideas about the inevitable ai \"consciousness\". It was fun to watch chappie grow up rapidly during the movie. Screw the haters and watch this movie.",
      "total_reactions": 14,
      "user": "papadrew7"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "The movie is awesome! It encompasses the incipient phases of socialization of a sentient android. Even though the ending might seem far fetched one should bear in mind that this is the extent of a youthful imagination of a being who is the epitome of children who discovers reflexivity.",
      "total_reactions": 14,
      "user": "Plescar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "A fun ride. This movie is a pure entertainment experience. The story isn't the new religion like alot of critics were wanting and that's good because this is an entertaining movie that touches on some larger concepts but doesn't try to beat you down with them. This was a gangster movie wearing the clothes of a hard sci-film, grimy and cartoonish but a hoot none the less. A dog becomes a god, a man transcends life and Hugh Jackman sports a business mullet. Chappie is the number one gangster.",
      "total_reactions": 7,
      "user": "raidendaigo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Chappie is a very creative and thought provoking film from the Director of District 9 and Elysium. It covers the topic of human Consciousness and Artificial intelligence in robots witch some films may have done in the past, But none make you feel this attached to the characters involved. Watching Chappie's intelligence evolve like that of a child's but faster is what really makes you feel compassion and attached to him. Chappie really steals the spotlight in this film but the other stars Huge Jackman ,Sigourney Weaver and \"Die Antwoord\" who all do a sufficient job but the acting of \"Ninja & Yolandi\"(Die Antwood) could use some work.",
      "total_reactions": 7,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I'm not sure why people are being so hard on it.  A movie is a story, just because the story doesn't go the way you want it to, or because it makes you think then that makes it bad?",
      "total_reactions": 7,
      "user": "ice05"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "A sense of belonging seems to be writer/director/producer Neill Blomkamp’s greatest asset when it comes to filmmaking. The man behind the revered District 9 picks up the pieces of his fumbled second feature film Elysium by introducing us to the second cutest robot to ever grace the silver screen, Chappie.",
      "total_reactions": 9,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Chappie was the best movie I have ever seen since Tron: legacy, the Hobbit and the dark knight. I highly recommend that every body should go see chappie. If you like action chappie has. If you like emotional movies chappie has it.",
      "total_reactions": 9,
      "user": "Natbob123"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Chappie was slated by the critics for no reason. We saw it last night and loved it. It's better than Elysium and almost as good as d9. There were some silly p lines in the movie but overall was funny but emotional for chappie.",
      "total_reactions": 11,
      "user": "DMT"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Beautiful to look at and interesting main character.",
      "total_reactions": 13,
      "user": "beladrim"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "This years Transcendence, CHAPPiE is a hugely disappointed film and a major step down from the once great Neill Blomkamp. No character development, horrific acting, and an absolutely ridiculous third act makes CHAPPiE nearly cringeworthy.",
      "total_reactions": 16,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "In my opinion , this film is better than Elysium . but worse than district  9. I just don't quite get why there is so much negative critic reviews. Most of them try to find some inner meanings in Chappie. Other just say that Chappie setting is similar to the District 9. IMHO , it's just a  SCI-FI  fairytale with artificial intelligence and robots, which tells us how hard it is to become a MAN nowadays.",
      "total_reactions": 6,
      "user": "IgorSkripnikov"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "SCREW the critics. Seriously, this movie was great. The interactions between Chappie and Die Antwoord alone are reason enough to love this movie. Ninja wants desperately for Chappie to be a gangster so he can help him with heists, but Chappie's mind is that of a child. But Chappie starts to see them as parents and wants to make them proud. This movie is funny and endearing, but at times hard to watch. It kept me on my toes the whole time, but mostly because I thought I had a general idea of how it was going to end (which the actual ending surprised me).",
      "total_reactions": 6,
      "user": "BillJobbensmith"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "I had pretty low expectations because of the scores all over the internet, but the movie turned out to be okayish. I didn't like all that Die Antwoord stuff, just too much of it. Also there were some lame points in the story, but overall I mostly enjoyed the movie.",
      "total_reactions": 4,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "The most fun I've had at the movies so far this year. Beautiful visually with amazing action sequences and a lot of humor. Don't believe the negative hype machine. See it and judge for yourself.",
      "total_reactions": 4,
      "user": "finnigan37"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "I went into Chappie expecting to fully hate it, as I am not a big fan of Neil Blomkamp and his lack of subtlety when dealing with social differences. But once I realized this was more a science fiction action comedy more than a political diatribe, I was pleasantly surprised.",
      "total_reactions": 4,
      "user": "DelCast"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Wasn't expecting this to be as funny as it was, haven't laughed this hard in ages, actual comedies these days don't come close to it.",
      "total_reactions": 4,
      "user": "KKaneIRL"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Chappie isn't a technically good movie but it is an enjoyable movie. honestly i thought it had it's good moments and had some really cleaver themes but it doesn't make the most of them. hugh jackman is a villain that need more time devoted for backstory and Chappie should have spent more time with Dev Patel's character but instead we stuck with the gangster who are the worst part of the film. it had some cool action and i thought Sharlto Copley was great as Chappie and it is an entertaining movie it just could have been better and i'll think it will pale into insignificance when compared wit Ex-Machina and Time Of Eve",
      "total_reactions": 4,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Yes, this movie has a huge plot holes. Yes, it's AI and consciousness approach is rather unscientific. But this movie is as much ALIVE as Chappie himself - sometimes naive, sometimes stupid, I don't know how to describe it.. it has a genuine SOUL. And, as we can see in majority of reviews, this soul resonates with people's cultural and genetic notions of parental love, redemption and hope. That's why we give such a high scores despite primitive and aggressive methods of delivering those emotions.",
      "total_reactions": 4,
      "user": "Exemplis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Great movie, really fresh and also love the way they use the Die Antword's world, I don't understand why such a bad review with this movie, critics as alway doing their jobs.",
      "total_reactions": 4,
      "user": "benjamindc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I must not have seen the same movie as the critics because this film has become one of my top ten movies. Neill Blomkamp has created a unique film, however critics seem to only be looking at it as copying other movies with robots in them. Chappie tackles issues about family and nature vs nurture. He has a creator looking out for him and hoping to nourish his mind with art and poetry while the people with custody over him influence him negatively leading to gangster activities. Another common complaint is that Ninja and Yolandi were horrible actors. I disagree Yolandi had me genuinely interested. She is a very unique person and had a motherly side that I grew to love. Ninja also achieved the his characters point. He abused his son and forced him to conform to his style of life and do what he wanted, rather than allow his son to become who he wanted to be. Another issue that was tackled in this film was spirituality and consciousness. How do we define consciousness? Blomkamp creates a robot that can think. i immediately fell in love with Chappie. His mannerism and outlook on life was extremely interesting to watch. I was emotionally distraught in scenes were Chappie was beaten or mistreated in anyway. This kind of emotional response is what a good movie can create. I understand that the ending may not be for everyone but the way that a Blompkamp takes two characters and ultimately they are one in the same. I actually felt like the robot Chappie was another human inside the shell of a robot and I think that is what Blompkamp was really trying to get across. I believe that this film's major flaw was that it was marketed in two different ways. One was a movie focused on violence and the \"oppressive police force\" as some descriptions call it, however never once in the film are the Scouts in anyway oppressive. They are simply doing their police work effectively. Another way the movie was marketed was a way that seemed to be trying to appeal to families. I believe some people thought the movie would be something that children would enjoy and then when they found out about the R rating they dropped interested. Among all of the criticism I think people should stop listening to others and see Chappie for themselves and experience a truly entertaining experience.",
      "total_reactions": 4,
      "user": "bumblestripe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Just saw the movie, and while a few things were a bit over the top, i can say i really enjoyed it. It depicts real world unanswered issues such as consciousness and self awareness, but also has a somewhat goofy tone. Die Antword were ok as well.",
      "total_reactions": 4,
      "user": "Cuddlehead"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I am not sure what is going on with all of the critics' reviews of this movie, but I thought it was thoroughly enjoyable. I liked it way better than I ever liked any of the Robocop movies (which it was compared to). I liked it better than Wall-E (although, I enjoyed that movie, too). I enjoyed the acting of Sigourney Weaver, Hugh Jackman, Die Antwood, and Dev Patel. The special effects were amazing. The songs and score used in the movie added to the great atmosphere of the movie. There were some great scenes done really well, such as the time Chappie gets really good at stealing cars. I did not enjoy Elysium that much, but I loved District 9 and I loved this movie so I am still a big Neill Blomkamp fan. I also really enjoy Sharlto Copley's acting.",
      "total_reactions": 4,
      "user": "mrc77"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "From an Engineer's and Computer Scientist's point of view, Chappie explores the ideas of computer intelligence, robots as tools, the basis of consciousness, human nature, mortality, creation, and many other important themes.  Chappie is surrounded by realistic characters that have a desire to create better intelligence and people who fear computer consciousness, people who view machines as lovable and those who view them as merely tools.  Chappie must sort through these views and face his own mortality just like any person would, without the over the top action of Transcendence or the muddled physics of time travel from Terminator.  I have not only seen these themes examined, sometimes badly, in other pieces of art, but these are themes that real scientists and engineers are exploring with current technology, such as emotional bonding with robots based on vocal and facial cues.  I eat this stuff up, and I hope that at the very least it will make everyone think about these themes in a meaningful way.  I think much of the negativity toward this film is based on either not understanding the field of artificial intelligence or not identifying with what could be considered a \"good\" character, but I urge that even if you do not view robots as \"human\" that you at least consider all sides of the discussion critically.",
      "total_reactions": 4,
      "user": "Raymond0256"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I have always felt it important there be a dialog about computers versus society in general. Neill Blomkamp  adds a modicum to this complex notion we must face. As many science fictions have written about these sorts of things in the past modern day  film makers have the tools to present us with their visions. Like a brochure to sway our thinking it's a niche study ongoing. It's not black hole theory but plays on our emotions like some cheap trick. Some psychosis we have for formative adolescence development. I have kids and I bear a responsibility \"What have I born upon society?\" some kind of Frankenstein notion. But let's have context I think Neill Blomkamp is having fun and he wants us to have fun to. We wish we all had access to Chappies programming but the movie is not interactive. My scope is weakening and maybe the critics would like it that way since that is the reason I'm writing this in the first place. There seems to be a wide discrepency between viewer and critic. And it might just be new movie shock. I am no critic only a person who tries to keep his finger on the pulse of popular notion. This movie rocks.",
      "total_reactions": 4,
      "user": "recentnamebrand"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Neill Blomkamps masterpiece chappie is really creative. I liked this more than district 9, but district 9 was still good. Chappie is now my favourite character.",
      "total_reactions": 4,
      "user": "ripatti"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "I do not understand the reviews for this movie. There were a few clangers and plotholes, but underneath a good, earnest, positive, interesting and engaging movie. Much better than you've been told.",
      "total_reactions": 4,
      "user": "tomcoates"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I can't understand the mixed reviews from the professional critics? This film is very, very good and very much worth your time. Chappie explores; what it means to be human and consciousness, our emotional complexities and behaviours, crime and law enforcement and our ever growing dependence on technology. A lot like Neill Blomkamp's other two films it has a great focus on poverty. This film is trademark Blomkamp, who is very much becoming a filmmaking auteur. If you like District 9 then you'll love Chappie. The robotics in Elysium were no doubt the most intriguing aspect of the film and they have explore them further in this film. Chappie is a thrilling and emotional joyride and excellently made. Superb science fiction.",
      "total_reactions": 4,
      "user": "DukeOfFluke"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "The Best Movie Of 2015 Chappie Ofers Great Acting Intense Drama And Exiting Battles And Story All The Charecters Are Perflectly Acted The Only Thing I Slightly Dont Like Is The Ending It Just Is Sudden And We Dont Get To Know What Happend To Chappie His Creator The Bad Guy The Robotics Company Nor Any  Of  The Characters And It Seems To Be Itching For A Sequel",
      "total_reactions": 4,
      "user": "svenzo1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Chappie is one of the most unique and compelling sci-fi movies that I've seen in years. I found it to be an engaging and enjoyable expereience from beginning to end, even if not all of it's elements felt fully realized. Even with an almost two hour running time, writer and director Neill Blomkamp seems to be struggling with getting everything out he wants to say with this film. Because of that some disjointed moments in the narrative occur and there is a slightly rushed feel.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I will have to stand up for a movie that is so unique, that most critics will not understand it. Critics of these genres never expect change. This movie breaks the boundaries of how we see AI and human development.",
      "total_reactions": 2,
      "user": "FUZZCOOKIE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 0,
      "text": "Garbage movie dull and predictable robot movie, with terrible acting. South African actors are terrible please stop trying to help them out, Neil bumpkin is overrated hopefully he does better with alien 5",
      "total_reactions": 2,
      "user": "BlackFox81"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "\"Chappie\" is isn't exactly the best cinematic experience for average movie goer, we can agree that this film isn't perfect artwork . But it looks good and a watchable piece of  fine art. Director/co-writer  Neil Blomkamp and other writer Terri Tatchell, keep trying to focus on three or four stories, to make a film but an order to make good-looking film you have to focus on one story. Not even the actors Hugh Jackman, Sigourney Weaver, and Dev Patel can save this film from a script were we have Chappie. Die antwoord the band stars as the lead characters as gangsters, it's confusing on how they star in it  but they don't play them selves? their music is bad and we don't buy their acting. Sharlto Copley's motion capture performance is astonishing and that's what sold the movie \"priceless,\" this could of been an A movie but it's a B+ movie. Since Blomkamp (\"District 9 and \"Elysium\"), is taking over the \"Alien 5\" franchise i think we should worry? or  i could not have been more concerned? will he make his A.I robots fight with the aliens? confusing. Grade B+",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "What a load of garbage! \"Chappie\", like most Neill Blomkamp's offers, is visually striking and boasts a well-chosen cast, but unlike Neill's other movies, \"Chappie\" is hampered by unlikable, underdeveloped secondary characters, heavy-handed narrative elements and a familiar message. It's depressing and manipulative in some sense. I apologize to those who liked it, but I couldn't stand it.",
      "total_reactions": 2,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I really enjoyed this movie!  The pacing at the beginning felt a little too fast or not quite right, but it really found its legs about 1/4 of the way through and picked up its game.  The graphics were some of the best I've seen - absolutely flawless.  Really interesting ideas too!  A few floors in the plot, but overall I thoroughly enjoyed this.  Bring on the next Blomkamp movie!",
      "total_reactions": 2,
      "user": "ChazzRabble"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Same or a bit better than Elysium, worse than District 9. Another great performance by Sharlto Copley. Great visuals. Lots of funny moments. Hugh Jackman is pretty good. But the movie was just pretty good. The ending is WAY TOO LONG. It also seems that most of the bad stuff that happens during the climax is fixed in the end. Kind of takes you out of the experience. Nothing too original. Not as bad as the critics say. But just as good from the director that brought us one of the best Sci-Fi movies of the past 10 years. Shame he cannot reach that height again.  Hope he does better next time. Maybe it is not Blomkamp's fault. But it is a shame seeing pretty good movies after a fantastic one.",
      "total_reactions": 2,
      "user": "Terraapex"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I've come to understand if \"professional critics\" don't like a movie usually us common folk consumers do. This movie does a great job of not taking it self too seriously with drawn out plot points and extreme overacting. It keeps a fast pace with a healthy mix of comedy, drama, and action.",
      "total_reactions": 2,
      "user": "SynysterSlayer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "If you just sit and relax, you can enjoy a GREAT sci-fi movie that is full of heart! Yes, it has it's flaws, but they are those little things that you can simply forget if you just focus on enjoying the movie.",
      "total_reactions": 2,
      "user": "JavierChile"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I don't get the **** negative press. Pros: Action, Sci Fi. Cons: Action, Sci Fi. It seems like all these **** old-head ass reviewers want is civil rights movie after civil rights movie, and WWII movie after WWII movie.",
      "total_reactions": 2,
      "user": "Fantasy_Critic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Chappie was a cute movie that doesnt do anything new, but doesnt do anything really wrong either. The plot wasnt an A to B tale, which is why people are complianing it has no plot. chappie was cute and the was quite a bit of tounge in cheek humor. It doesnt deserve any awards but it was still a good way to spend a couple of hours.",
      "total_reactions": 2,
      "user": "wbiker569"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I loved it.  It was unexpected, thought provoking, emotional and things blow up - sometimes substance is in the absurdity.  The only thing that really kind of annoyed me was how close Chappie and Ninja's voices were to each other.  Brandon Auret, Ninja and Yolandi were awesome.",
      "total_reactions": 2,
      "user": "khrysg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Niell Blomkamp has outdone himself in Chappie. I couldn't disagree more with the people calling the movie, \"A washed up version of district 9\" or a failed remake of some other popular science fiction movie. The grit infused into the movie is almost tangible as Blomkamp finally delivers a believable dystopian South Africa. Hugh Jackman's performance is stellar. His role as a paranoid ex-military man was flawless. Niell shows a future South African drug gang society that is as much captivating as it is frightening while somehow dispelling needless violence. Even with an R rating for language and violence, none of it is misplaced. Character development was done well also, giving not just \"enough of\" an arc for every main character but instead completing their story in a fulfilling way. My only complaint has to do with the \"gangster\" sideways shooting method that Watkin Jones teaches Chappie in one scene. However I do not want to oversell the movie either. There's a few reasons I didn't give it a ten or even a nine.",
      "total_reactions": 2,
      "user": "HipsterDonuts"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "It speaks volumes about how I connected this film and the character of Chappie that I felt more for him than more than half of human characters I have encountered in my cinematic journey thus far. At points, I genuinely felt very afraid for Chappie but equally touched with his, arguably, naive humanity towards other living things. And to those critics who complain about the plot hole or contrivances - I am willing to bet that a few of the so called classics they would put in their personal favourites have their fair few plot holes in them!",
      "total_reactions": 2,
      "user": "Godzilla14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Chappie is an action packed movie that in certian instances had me wondering about things that seemed kinda weird but cool.",
      "total_reactions": 2,
      "user": "Ripper89"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "After viewing the reviews for this movie I made an account to provide a more proper review. I am an avid movie viewer and watch several new movies a week. In the past 24 hours I ave watched American Sniper and Chappie in theaters. I didn't want to watch American Sniper because I assumed it was a movie made for rednecks, but after the slow beginning it was amazing and had me in tears, but that's for another review. My expectations for Chappie were not high. I listen to Die Antwoord and I was prepared to cringe at their acting and the overused plot. In brief, the movie was stupid and neat. Stupid neat. I enjoyed it. The target audience for this film are R&B; lovers, gangsters by heart, nerds, cultured people that can put oddness aside, and people with an interest in technology. I can understand the mixed reviews because not a lot of people fit into these categories, and I would not recommend the film to these people. I fell under the near market, and the previous exposure to Die Antwoord market. This film is not going to win most original, best picture, or acting but as for a movie to go watch with a friend on a Saturday night, I give it an B+ or an A-. It exercised the mind and your inner gangster. After the movie I had pulled up Die Antwoord on Spotifiy and drove to their South African R&B; beats and it was fun. There were plenty of cliches that are associated with this type of film, but among the recylced plot was its own touch of creativity. Their were vivid colors, not too much focus on stupid violence, and things that you won't see in any other AI film. There were plenty of silly plot wholes that act as conversation starters after the film, such as security protocol. So I would call this a social film. Go watch it with a friend that fits the markets.",
      "total_reactions": 2,
      "user": "1Rab"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Another excellent movie in Blomkamps signature style of movies like District 9. Chappie is excellently crafted and you really do care about him. The CGI is second to none, the robot designs are incredibly detailed and looked so believable you couldn't tell it apart from the real thing. The story is pretty good if a little bit tropey, but it gets the message across. Better than Elysium, but not quite as good as District 9. Great movie, highly recommend it.",
      "total_reactions": 2,
      "user": "troutmonkey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Chappie is a clever story line that rides the fringes of current futurist discussions on AI yet keeping a compelling story. Great acting, culturally unique, great CGI and thrills me to no end the public and professional critics have such a diverse rating, disruption for the win, black swan if you will. The people have spoken. Chappie keep that swag up.",
      "total_reactions": 2,
      "user": "Lavahead"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "way better then expected. im a fan of blomkamps movies I have to admit. they are somewhat formulaic but it kind of always works because its an actual original idea. yeah Elysium was kinda weak, but it was better then most of the garbage that's being pumped out these days. I was excited to see this since the 1st trailer I saw. marketing was solid as it wasn't constant bombardment of ads showing only the cool stuff. so its always surprising how the story unfolds, but then the critics, my god, the critics hammered this movie. I almost didn't want to see it. but it was perfect because when I eventually did see it my expectations were considerably lowered, and I was pleasantly surprised with a solid sci-fi future action flick. critics all said it was really blomkamp-y being filmed in s. Africa-again, but it actually wasn't as bad as elysm, which looked like they used the D9 set. it was gritty but it only added to the whole futuristic dystopian blah, blah, blah. having unknown actors was cool, I guess theyre actually famous for something, but ive never heard of them so it works out perfectly. s.african/English accent is brutal to listen to, but you get used to it as the movie goes on and begin to understand what theyre saying, chappie as a kid and learning was a dope idea for the movie, but the plot holes that came along with that story were the only downside to the movie. but chappie's development and personality were great. the critics made him out to be jar jar binx or something, but really was not that bad. silly in some parts but not outright annoying. the bad guy was basically the same bad guy as in D9, elysm. I mean really the same-exact-character. but aside from that I didn't see the whole Robocop comparison, I mean yeah the robots did look similar, but different story.",
      "total_reactions": 2,
      "user": "SynthaMechatroN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "I'm not sure why the critics didn't like this movie as much.  I came in expecting one story and walked away with another.  Chappie (who was brought to life with stop motion technology) was incredible to watch.  Coupled with the voice acting, Chappie can be truly moving at time.  You have a robot who doesn't know who he is or what his place in the world is.  He's a child in a harsh environment and doesn't understand why things are the way they are.  He want's to be good but the world around him is against him and others push him to be bad. The action and violence added a whole other dimension to the story. The exploration of consciousness, humanity and how we treat those who are different really had us thinking when the movie was over.  The movie is worth watching. In fact my family and I are watching it again right now.",
      "total_reactions": 2,
      "user": "BigPapa2015"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Chappie fares far better than Blomkamp's previous- Elysium,  a muddled drama with an unsatisfying payoff. But, even with Copley's excellent motion performance and Jackson's furious engineer, the movie suffers from bad story elements. The visual effects are brilliant, and Blomkamp doesnt hold onto his ghetto Johannesburg that looks lush and gorgeous. Dev Patel is presentable as Deon Wilson, the creator of Chappie. But, Die Artwood steal the show with their emotional acting, that will surely fare better on in their careers. Look, Chappie isnt a bad film, it is coated with beautiful visuals and great acting, but beneath that layer, there is a movie that shouldn't have been made. Blomkamp's work wasnt used to its limit in Chappie,  and that is what fears me, he is one of the best directors in Hollywood, and Chappie isnt his best work.",
      "total_reactions": 9,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Finally a clever, thoughtful movie about artificial intelligence and robots. Finally a movie that doesn't judge robots as a \"thing\" in itself, but show how AI and robots are just what we humans make them.",
      "total_reactions": 7,
      "user": "Clyssandre"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Disastrous. Juvenile. Insulting.",
      "total_reactions": 15,
      "user": "Damion"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "What an inventive story! If only there wasn't so much r-rated stuff, this would be great for young boys, maybe young girls. In less than two hours, we watch a consciousness grow and learn. It was cute, but also thought provoking. Some minds grow up to be honorable, other minds have no interest in honor. Because of that, the idea of A.I. Is scary and this movie shows why.",
      "total_reactions": 5,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Short version: don't be discouraged by the negative reviews, give it a chance in the theaters and then decide!",
      "total_reactions": 5,
      "user": "DrZoidberg4Life"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "District 9 was an outstanding movie. This isn't unfortunately. It follows the District 9 formula nearly to the letter, basically the same movie. The fake realistic talking heads opening, the robots who are off the same drawing board as the the D9 aliens, the urban decay shots the same. The overhead ghetto shots the same The plot line the same. The final showdown the same. The final scene rebirth analogy the same. The sets and locations are the same.",
      "total_reactions": 8,
      "user": "JamesIrish68"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "What was Neill Blomkamp thinking? This incredibly awful offering from the talented director of \"District 9\" misses the mark in virtually every way conceivable. The filmmaker serves up an overlong, implausible tale full of plot holes, continuity goofs, overacting, cloying dialogue and a derivative narrative that pieces together elements of \"Short Circuit,\" \"Robocop,\" \"Avatar\" and \"Transcendence.\" Its constant switches in tone, from dramatic to campy to action-oriented, grows ever more annoying with each passing minute, making you beg for the end to come.",
      "total_reactions": 12,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I didn't have high hopes for this movie because of the director. (I was not a big fan of District 9) However, I thought Chappie was great. Chappie looked and felt so real! It wasn't perfect, but it was still good!",
      "total_reactions": 9,
      "user": "leeshmarshall"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "These reviewers are crazy. Loved this movie. There are so many scenes with just this incredibly painful emotional resonance. It's a beautiful story about a child growing up in an abusive home and a **** world, developing his own sense of morality and becoming his own person. There is some weak dialogue and poorly resolved characters. Normally I'd dock it more points for that, but nope. It's been a long time since I saw a movie that made me FEEL like this one did.",
      "total_reactions": 6,
      "user": "phildog"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I loved Chappie. But then again, I am a scifi robot and AI movie fan. A lot of critics gave static for this movie. I guess they weren't scifi fans. Character arch is rushed but solid. Still considering the moral dilemma what is worse, kill someone's maternal figure or drive a pacifist to hurt someone.",
      "total_reactions": 6,
      "user": "hiddenpheonix"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Watching this movie, it is clear that the majority of the budget went into animating the robots, much to the detriment of Everything Else. This extends so far that the director had to take footage from the South African Special Task Force documentary and use a wireless mouse USB receiver as the main plot MacGuffin.",
      "total_reactions": 6,
      "user": "StdUsername"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Guys, Movie is EPIC. I don't know what's wrong with the critics (probably they weren't be paid at all). But this is MUST SEE type of movie. Action, Story, Acting, Picture, Music, everything is there. I'm really said seeing movie like that are ranked so badly.",
      "total_reactions": 6,
      "user": "hitthissht"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "After the disappointment of 'Elysium', 'Chappie' at the very least marks somewhat of a return towards the successful style of 'District 9'  even though it falls very short to Blomkamp's stellar debut. The thing about 'Chappie' is that it is a film of great moments and depth but riddled with some bizarre choices in the storytelling that serves to undo all the great work that Blomkamp manages to achieve. The character of 'Chappie' himself is a technical triumph and just oozes life and feels natural within the landscape whilst also providing the film with its main source of charm and comedy. But the most glaringinly odd choice that Blomkamp makes with this is having the main character supported by 3 unlikeable criminals who then act as the main focus of the narrative instead of the more obvious character Deon (Dev Patel). It's such a strange choice especially since initially there appears to be nothing redeemable about them and intially it doesn't work at all. However by the films climax, you do kind of feel a connection to them and their relationship with Chappie somehow seems to 'redeem' them by the time all hell breaks loose without you even realising it. It's all rather odd and just screams out as a bad idea and yet somehow it does work even though I would say that Chappie's relationship with Deon feels rather forced in comparison and doesn't really need to be there. The action is better, the characters are more interesting in spite of the issues I mentioned but I do feel that too much is going on at different times and I feel that the balance isn't quite there. It's definitely not a disaster by any means and while I look forward to Blomkamp's upcoming Alien film, 'Chappie' is a fair indicator that Blomkamp isn't quite the one hit wonder some might have feared.",
      "total_reactions": 3,
      "user": "TheBear"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "With is third sci fi outing Neil Blomkamp turns his attention to AI. In a world where robot policemen are the norm, Dev Patel has created the worlds first robot with the ability to think for itself. For some reason his superiors aren't interested (why??) and before he can fine tune his creation it is stolen by a gang and is taught to act gangsta! Visually the film is excellent, where it falls down is in the script, storytelling and the acting. Plot holes abound, the security company at the heart of the story looks more like Wrexham Hogg from The Office, with security measures to match, and the acting of punk pair Die Antwood (in two lead roles) is truly appalling. Lets hope for his future films Blomkamp employs a script writer and story editor so that the rest of his films can match up to his stunning visuals.",
      "total_reactions": 3,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "Random thoughts: Why do the robots have to sound like **** 1960's sci-fi movies?  Even google's voice to speech sounds waay better. I thought this was supposed to be like the future or something.   Consciousness.dat stable?? Why the crappy actors?",
      "total_reactions": 3,
      "user": "Qgal5kap"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Now, I'm confused. Should I choose Baymax or Chappie?",
      "total_reactions": 3,
      "user": "RoraEst"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Chappie: \"I've got blings?... I've got blings!\". That's the kind of dialogue you get from this movie and I was actually forward to this until I sawed.",
      "total_reactions": 3,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Was expecting more of a Short Circuit type screenplay.  Was very disappointed overall with the acting & dialogue. Kids might like it more but overall this is another overrated movie on this site by others",
      "total_reactions": 3,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "THIS MOVIE WAS AMAZING ! i have nothing to complain about this movie either that the fact that the bad guys/good guys  who want Chappie to be bad are played by a freacking music band ! what the **** !?",
      "total_reactions": 3,
      "user": "louisthemovie"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "As I was watching this, the one thing that kept standing out to me was just how amazing the CG was. It was really hard to tell when it was CG and when it was a model which is a testament to the post-production work.",
      "total_reactions": 7,
      "user": "njlake"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Really bad movie. Did not like it at all. Story did not make sense. Not a well done movie. Would not see it unless you like action and killing. Did not like how they made Johannesburg seem like such a horrible place and was a war zone. And why did the Maker not fight more for his Robot he made. And just left Chappie there with people who were not good influences and bad people. So dumb! But that is just my opinion.",
      "total_reactions": 7,
      "user": "Kira2341"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "2 stars for 2 scenes which had action in it. Charming movie, but disgusting story and zero development of characters. Don't go in expecting an action movie, or you'll be leaving sorely disappointed. Elements of the movie that attempt to appeal to emotion are far fetched and seem to insult my intelligence, and one has to try their utmost best to believe elements of the story. Comedy is inserted at absolutely random intervals, and seem to work against the movie. There is absolutely zero build up, and no gut clenching finish that I was expecting.",
      "total_reactions": 20,
      "user": "Unfearing"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "'Crappie' would be a far more apt title in my opinion.",
      "total_reactions": 16,
      "user": "lenny68"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Chappie is a reasonably entertaining movie, but there are times when it tried my patience and strained my suspension of disbelief pretty severely.  The gag of having a robot speak in the gangster vernacular and strut around wearing chains that say \"hustler\" got old pretty quickly, and the lightning-fast jumps in capability and understanding toward the end of the movie left me very skeptical--even in the technology-rich future that Blomkamp presents, and even suspending my disbelief as a viewer as much as I could, it was a bit much.",
      "total_reactions": 8,
      "user": "heatherm"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "I can't believe how dumb everyone is giving this movie above a 5... This movie is anything but original and has no sense of reality. So the movie rips off Short Circuit especially at the end of the movie. The plot is basically the same as district 9, but instead of human becomes alien with alien companion, human becomes robot with robot companion.",
      "total_reactions": 8,
      "user": "InfernusTigris"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "What's advertised as an action film is actually a somewhat soppy sentimental story. Future Johannesburg is patrolled by a force of mechanized police that have restored order to the crime-ridden streets. A trio of criminals ends up with a rogue robot that's been programmed with consciousness, giving it a child's innocent mindset. Instead of cool fights, there's lots of rash dialogue, hurried activity and numerous efforts to create an endearing creature out of Chappie. The South African duo from Die Antwoord, who have major roles, are raw and unusual looking, but not especially strong as actors. There are fallacies in the logic that border on ridiculous and only one good final battle (with yet another machine). Still, director Neill Blomkamp manages to keep it interesting and the creation of the robot itself is pretty compelling.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "CHAPPiE does alot of good doings in his role. He is having an issue with his life, and completly, he felt sorry, & wanted to have this... mystical kinda s--t. The movie was amazing. I was hopping for another one... But, I know that won't happend, since The director & Sharlto Copley given a 41 by Metacritic :(",
      "total_reactions": 4,
      "user": "SeanGamerDays"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Just awful in all regards.  Without Peter Jackson to hold his hand Neil Domkop fails again.  Hopefully after this they will yank the Alien sequel from him before he ruins it.",
      "total_reactions": 25,
      "user": "Fyendo"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Complete trash. Poorly cast. Characters saying and doing things that don't make any sense. Dialog is horrible. The goonie accents almost unbearable. Here's one for you. The guy who invented the robots to make robot company very successful goes to CEO claiming he invented a \"sentient\" A.I. (in his studio apartment filled with old Ataris and extension cords) that could be smarter than a human. Asks CEO if he can test it on some soon-to-be-crushed robot parts. CEO says \"No way! Are you crazy??\" Really??? That's what a CEO would say to the inventor of their primary asset?",
      "total_reactions": 21,
      "user": "Sesshomurai"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "One of the worst movies I have seen in my whole life.",
      "total_reactions": 17,
      "user": "anti666"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This movie is absolutely terrible. The acting is unprofessional, its worse than a direct to dvd title. The writing is horrible, hard to believe anyone greenlight it. On top of that is the shameless and crass product placement. Sony Pictures represents everything wrong with the movie industry with movies like Jack and Jill, The Smurfs 1 and 2, Grown Ups 1 and 2, and The Amazing Spiderman 2.",
      "total_reactions": 14,
      "user": "Wanderlei"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "I really like the character Chappie, but Chappie the movie that's a different story.  Chappie himself along with the moments with his maker are easily the best part of this film.  Then you get Ninja and Yolandi two criminals that teach Chappie the ways of the world.  Those two bring this film down, they're in the movie way to much and their characters (especially Ninja) are just awful people.  Plus you get a wasted Hugh Jackman and Sigourney Weaver.  C",
      "total_reactions": 10,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "A better movie to watch if it was muted. Awesome visuals... AWEFUL story telling. 90% of this movie was watching chappie grow up to be a degenerate gangster. The only satisfying part of this movie was the last 20 minutes with the exception of opening it up for a sequel.",
      "total_reactions": 5,
      "user": "WatPalders"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Unfortunately, only a weak film.",
      "total_reactions": 5,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This film is one of the greatest in the history of Cinema...Why? because it's a great story, great actors, great special effects, great sense of humor, great emotions, great feelings, everything is great about this movie, you will love the robot, the director, and Die Antwoord, maybe you can hate hugh jackman, but you can't hate this movie, even if you don't like this kind of sci/fi movies you can really enjoy it. I really don't know why this movie is not on many cinemas or why it has received bad reviews from sites like metacritic, imdb, or rotten tomatoes, everyone should see this movie, it's better than gravity or birdman or any other oscar winning movie.",
      "total_reactions": 5,
      "user": "punkmexic"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "The WORST Movie I Have EVER seen in my LIFE (And Believe me I've seen a lot)..",
      "total_reactions": 17,
      "user": "PerfectCritic"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Херня для молетней пиздюшни. Для детей 5 лет. Которые не знают что такое сознание и сам человек. ТАКОООЙ ВЫСЕР Я БОЛЬШЕ НИГДЕ НЕ ВИДЕЛ В СВОЕЙ ЖИЗНИ!",
      "total_reactions": 11,
      "user": "KRONRUSKA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Chappie is a film of poor execution. Never in a movie have at times I cared for the a character and hated them so much. The inconsistency of the robot Chappie is simply unbelievable considering its the centerpiece of the movie. Some scenes are done well while others are atrocious. Same goes for the music, the characters, and tone. Its just a film filled with inconsistencies from start to finish.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Chappie was an okay movie, but not great. It was certainly entertaining and had moments that made me smile and chuckle, but otherwise it didn't really bring anything else to the table.",
      "total_reactions": 1,
      "user": "gd01skorpius"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I movie with great potential and an amazing story sadly tainted by being turned into a 2 hour long advert for the rap group Die Antwoord, whose music is used constantly in the movie - only serving to kill the mood and generally just p**s me off. The final straw was seeing one of the main characters standing with a shirt of the rap group's name, and the camera being zoomed in on it. It's like product placement, and really ruined the movie.",
      "total_reactions": 1,
      "user": "slicshuter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "An Outstanding performance by Sharlto Copley doesn't excuse that this film is quite messy. Hugh Jackman's character was a massive stereotype piled with average acting and it was very hard to like any of the characters in this movie. I liked seeing how Chappie learnt about things and evolved through a difficult society that exists today in South Africa which is why I didn't rate this lower (contender for best character of 2015 in my opinion, really impressive stuff) but for everything else, pretty damn lame.",
      "total_reactions": 1,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "hmm I have very mixed feelings about this one... The beginning got me hooked... The progression after with chappie growing with the gang was not what I was expecting and kinda brought the value of the movie down in my eyes. Some point between the middle and the end got a little interesting but certain parts towards the end (especially the big fight scenes) made the movie seem corny and poorly thought out. The concept is a really good one. I know because that was what got me hooked on seeing the movie. However, the execution left a lot to be desired. Overall, a decent film with so much unrealized potential. 6/10",
      "total_reactions": 1,
      "user": "chidime"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "This movie's been rattling around my head since I saw it a few days ago, something I can't say for most movies of its ilk. While I can't bring myself to say it's that good, in fact in some ways it's pretty terrible, it certainly is compelling. What really struck me most was how Die Antwoord simply hijacked the movie, and I say that with a sense of admiration rather than criticism. Their asthetic, their music, their t-shirts for crying out loud are all over this joint. Really, the movie's about them and the robot is a side story. For most of Americans who have barely heard of them (if at all) this movie will likely seem to come straight out of left field as we lack the context to understand them or where they're coming from. Their style is certainly unique, and odd, and the two of them seem more alien than the robot.",
      "total_reactions": 2,
      "user": "llayam"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "A mess with boring characters, some terrible actors, a lot of horrendous action scenes and inconsistencies, makes the film to be really forgettable. What happened to you Neil?",
      "total_reactions": 2,
      "user": "PfenderStrat621"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "After seeing Chappie I am a lot less excited about Neill Blomkamp (District 9) taking over the Alien franchise. It's about criminals who steal and teach a special police droid how to be gangster. So he can help them with a heist. While Chappie's creator (Dev Patel) tries to reach out to teach him right and wrong.",
      "total_reactions": 1,
      "user": "Jim222001"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "I wanted to like this movie so bad. There was so much potential. But sadly, Chappie is a giant mess with terrible characters, wasted actors, and a message that gets confused within itself. At least Chappie himself is a solid character and the cinematography is good, because that's about all this film has.",
      "total_reactions": 4,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Oh, well. I was really expecting this movie, and I actually was pretty excited to watch it. It was a big disappointment. First off, the good things. It has nice special effects, truly realistic, and the fact of just watching the robot Chappie is awesome, you can really feel for him.",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "............AWESOME MOVIE ...............",
      "total_reactions": 1,
      "user": "PRAJEE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Neill Blomkamp delivers an interesting premise like the one who defined Elysium and District 9, but its like this one took all of its concentration in Chappie's character and forgot about the rest, leaving a disappointing sci-fi flick who could have being marvelous.",
      "total_reactions": 1,
      "user": "Jalumbi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "I was very, very disappointed in Chappie. It has made me question if Blomkamp is the exciting talent I thought he was after District 9. Every element of this film except the effects seems poor and dated. The acting is diabolical and the dialogue is even worse. Chappie is essentially a robotic Jar Jar Binks and I couldn't force myself to be sympathetic and stop hating him. Such a waste.",
      "total_reactions": 1,
      "user": "CWARD009"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Incredible movie! Very entertaining and different. To those who did not enjoy it and rated with overly negative score: Go watch some paint dry. That would cater to dull taste.",
      "total_reactions": 1,
      "user": "pseudonym1234"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "Chappie's ultimate storytelling and impressing sad moments surprised the audience to give it a good score. Unfortunately, Chappie is not getting away with a good score coming from me.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "Chappie was heavily underrated by critics. Calling it underdeveloped seems like a miss. I was confused by the need to drop in South African duo Die Antwoord into major roles within the film but they did fine enough to warrant belief in those characters and carry part of the narrative. Neil Bloomkamp has a great, consistent string of movies. They all feel a little familiar - futuristic but dirty (and it's generally through a South African lens). If a movie that walks you through the training of a robot as if it were an infant while offering some good action to keep things going, Chappie is really worth the watch. It's silly that critics couldn't feel the same.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "Chappie shouldn't be named after a penis as he's really a big vagina. He's so pathetic it's untrue. This film would have worked if it hadn't of been so sentimental, which just clashes with the violence badly. It's full of cliched, annoying characters and it just doesn't know how to be different.",
      "total_reactions": 0,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "Chappie is a mildly amusing Robocop knockoff. There was a lot of potential here, and it seems a shame that the lion's share of it seems to have been squandered. The simple fact is that the Robocop reboot was a much more satisfying film. Come on Bloomkamp... Get your stuff rewired correctly for your Alien film!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Please, do you a favor and IGNORE all the bad reviews. The movie is great. Of course it won't have the best plot ever, but as any other Sci-Fi movie... you have to make an effort and actually believe what you are watching on the screen.",
      "total_reactions": 0,
      "user": "darthvladi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "The underlying elements of any traditional black sheep story are thought provoking and moving. Not every piece of science-fiction strikes with such emotion - but when it does, it's worth it. Chappie does it well - and we have fun along the way.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "This science fiction movie held my attention through out the time in the theater. Good story and good action scenes and a likeable caricature made this a fun fiction movie although a little like I-Robot with different looking robots and story. Still good piece of entertainment.",
      "total_reactions": 0,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "After the largely negative reviews, I figured I would wait to catch Chappie until it came out on DVD and I am bummed to have waited so long. I have no idea why the critics hated it so much. No, it is not as good as District 9, but it is still a good action science fiction movie from a guy, Neill Blomkamp, who seems to be quite adept at making socially conscious action movies. But heck, don't listen to me, I liked Elysium too. To me, Blomkamp is a very good director who is very ambitious in his films. They do not match his ambitions more often than not, but the end result is also quite positive. The themes here are similar to the rest of his films and Johannesburg will certainly continue to be viewed negatively worldwide due to its portrayal here, but all the same, it is a very fun and well made film. The cast as a whole is good and quite believable in all of their roles. I know Die Antwoord got a lot of criticism for their performances, but I truly believed them and they did not stick out at all. The development of Chappie was great and he is certainly one of the best characters in a film in recent times, in my humble opinion. The film really delivers in the heady sci-fi elements viewers come to expect from the genre (as well as a ton of Biblical elements, such as \"genisis\" and referring to the guy who created Chappie as his \"maker\", plus some characters being obviously religious). The action is well done and the film can be quite adorable (thanks to Chappie) and funny throughout. It is also oddly touching, as it always amazes me how much I can be made to care about a robot. Overall, Chappie does have flaws, namely in the way of plotholes or points where it feels like the story just skipped ahead a bit. It also manages to cram a lot into a short time period, which is a unique criticism, but one I feel is justified. All the same, Blomkamp's films always are very sleek and stylish and the way the robots are designed is super cool (just as the aliens in District 9's design was great). As a whole, Chappie was unfairly torn apart for some of its flaws, while many ignored the many positives it delivered. Not as good as District 9, but Blomkamp certainly took a step back in that direction here, as it is better than Elysium. Definitely looking forward to his Alien film (hopefully set in Joburg, because why not).",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Amazing movie, very much alike District 9. A shame the movie felt so short even with its 1.5 hour of playtime, left me want for more, expanding the universe of District 9 and Chappie would be the best thing ever. A shame popularity is more drawn towards Lord of the Rings or Star Wars, these movies are just amazing art that no other comes close to.",
      "total_reactions": 0,
      "user": "Roberts91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "This movie was my introduction to Die Antwoord, and for that it deserves a 10. It's been a long time since I've seen something so real on screen. They really stole the show, and as the movie went along I was looking forward to their scenes. Hugh Jackman is also awesome in his role.",
      "total_reactions": 0,
      "user": "Fb29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Things that are good:",
      "total_reactions": 0,
      "user": "Chaeote"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Its a sci-fi age and robot rules.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Chappie is a movie that has too much going and rarely pauses to establish a character or develop a relation such as the one that was at the center of District 9. The movie hurries from one scene to the next and the scenes are sometimes unrelated, sometimes messy, sometimes awkward and sometimes unintentionally funny. It feels almost as if the movie is made on the go without knowing where to go next..",
      "total_reactions": 0,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "One of those few cases were reviewers are too hard on a film nobody knows why. No, it´s not sensational and no, it doesn´t feel as innovative as it could have been if released years ago, because now we have seen this kind of stuff many times. But it still is an interesting take on humanity, machines and how the world works. Not so engaging in its first act, the viewer ends empathizing with the characters and especially with Chappie. The final part is unexpectedly moving and it has a nice and different outcome. Very enjoyable film too harshly judged by some.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Blomkamp offers what could be described as a sequel to District 9. He steps in familiar territory - while not a condemning direction to take, especially with a film as grand as D9, there's a feeling of sameness in its script when compared to his predecessor that stops Chappie from reaching its true potential.",
      "total_reactions": 0,
      "user": "Aijixe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "The acting of the southafrican actors was just awkward, real real bad english, in every sentence you heard its not their mother tongue. I mean my english is not the best too, but i dont act in movies in which i have to talk english. They talk english like 5 year olds and the characters are very poorly written. They could be taken from a 90's trash movie. The super freaky looking bad guys with all their weird haircuts and clothes, the indian IT-Specialist and other **** Sigourney Weavers acting is ok, but you dont see the professionals much in this movie. This is the first movie after a long time i stopped to watch after about 30 minutes. Bad acting, poor characters, poor english with a way too heavy accent. The special effects are good, i loved the introduction of the robots as police force.",
      "total_reactions": 0,
      "user": "hierax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Neill Blomkamp's third endeavour into the world of science fiction CHAPPiE is a movie full of ideas and concepts which it fails to fully utilize. Despite these shortcomings, the film is at least entertaining throughout.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "Oh COME ON;",
      "total_reactions": 0,
      "user": "xolve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "It seems the film industry has a lot to answer for in terms of original plots and actually coming up with fresh new ideas. Unfortunately for those of you born in the 90s, you're not really all that likely to see an original - a truly original - film. If you go through every film imaginable in the 70's and 80's (and I practically did, having parents who ran a video store back then), I'll tell you now that there is not one shred of originality in this film. If you want to see where the idea for this most likely came from I'd like to direct your attention to D.A.R.Y.L. - which is an old film, still easily found on the internet if you have a mind to look for it. The similarities between this film and that film are so mind-blowingly obvious it's a joke. Kid robot turns bad or does bad things, etc etc...it's been done before. It was done pretty well. Someone tried to rewrite that and it ended up being released and looking like crap. I wish producers would come up with original stuff for once.",
      "total_reactions": 0,
      "user": "MadJaples"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Really stunned at the negative reviews by the critics. I watched this not knowing much about it other than the occasional commercial  and expecting the typical action flick with little to no story. I found a realistic  and thought provoking take on how AI could come into this world and what might happen. I felt  all the acting was solid and the story kept me guessing up until the end. The voice acting for Chappie was spot on and the South African setting and accents lent this movie some originality and grittiness. I felt the story really came to a head when Chappie is talking with Deon his \"maker\" and asks why did you make me just to die? i would love to hear what Roger Ebert would have thought of this film he was the only critic I ever really respected, God bless his soul. I plan to  buy this on Bluray",
      "total_reactions": 0,
      "user": "Mrvictor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Despite having semi-good effects, realistic robot movements, this movie is an insult to the genre, everyone are plainly stupid and much of decisions don't make sense, you can not expect better from a hiphop/sci-fi hybrid.",
      "total_reactions": 0,
      "user": "Zoup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Have you seen Short Circuit? Did you wish it had more gang violence, carjackings, and gratuitous gore?",
      "total_reactions": 0,
      "user": "adpirtle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Neil Blomkamp's Chappie is a completely uneven film with fantastic visual effects and thought provoking ideas unfortunately complemented with weak dialogue and underdeveloped characters.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Pro: Acting, Some of the parts in the movie are interesting, and Intense Action.",
      "total_reactions": 0,
      "user": "Kooledud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "This film is well acted and well crafted, with some very clever visual effects and a terrific soundtrack from Hans Zimmer. Unfortunately Neill Blomkamp's narrative and direction wander all over the place. It just can't seem to find it moral feet. Is it a religious allegory or statement on race relations? And it becomes very violent, which just doesn't work that well for me. Add to that that the plot seems to be lifted from the RoboCop films and it just becomes a mish-mash of technical effects and very clichéd characters. Not Blomkamp's best effort here.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "I'm amazed at all these positive reviews.  Payed per viewed it and I'm stuck. I can't get past the robot's \"rebirth\" at the gangsters hideout.",
      "total_reactions": 0,
      "user": "LINUSSPACEHEAD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "What on earth were Sigourney Weaver and Hugh Jackman doing wasting their time in this drivel? What could have been an entertaining story was ruined by abysmal acting and an unbelievably bad script.",
      "total_reactions": 0,
      "user": "royphishooh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Жаль, что про роботов все фильмы грустные. Что человечеству рано ИИ. Да и юмора маловато,  можно было и  чуток добавить моментов.  не понравилось что там была,  реклама   песен Die A ...",
      "total_reactions": 0,
      "user": "Zoorax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Blomkamp gets back on track. Elysium was good, but lacked story and wasn't near a long enough run time for and epic Sci Fi film. Chappie clocks in at about 2 hours which i felt was perfect. Really loved the sound design and music. Junkie XL nailed the atmosphere almost perfectly. Usually metacritic is fairly accurate but this is one film that I don't agree with critical consensus.",
      "total_reactions": 0,
      "user": "djryang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Neil blomkamp's most recent movie Chappie is a good movie, but a flawed one, and a bit of a disappointment from the director, as District 9 became a Sci-Fi classic. What I loved in the movie was Chappie himself, he is the cutest in-human movie protagonist since E.T, and some of the best pats of the movie revolved around Chappie growing up, and I loved it. I also liked how Chappie represents Children living in places like South Africa or Rio, who, while pure at heart, are corrupted by money and the criminal lifestyle. However, there were many things I didn't like about the movie. I didn't like the gangsters who took Chappie away from his owner. I realize they are part of a south African rap group, but you never grow to love ther. their mean people who do despicable things to chappie, and while the movie tries to make you feel sorry for them, I never rooted for them through the whole movie. Other than that, i just think the plot and the scripting were  little off, but i still enjoyed the movie. I would recommend this movie to any Sci-Fi fan, and even though its a bit underwhelming coming from Blomkamp, i'm still excited that he's directing the next Alien's movie.",
      "total_reactions": 0,
      "user": "ATrustedCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "The critics are wrong, this movie is a good flick. If your a cyberpunk fan you will most definitely enjoy Chappie. Really i cant think of anything bad to say about it.",
      "total_reactions": 0,
      "user": "doczellstoff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Chappie is a science fiction film directed by Neill Blomkamp (director of District 9 and Elysium) and stars Sharlto Copley and Dev Patel. The premise of Chappie is very intriguing, a guy decides to build a sophisticated A.I. that can think and feel. This movie, however, takes an interesting turn. Instead of becoming this sweet and lovable robot, he becomes an a****** and a gangster and completely ignore's Deon (Dev Patel) while committing various crimes. But, the movie does do a great job of how showing how a child's mind is so easily influenced. However, there are some major issues with this movie. First of all, the actors who played the gangsters who raise Chappie (voiced by Sharlto Copley) are completely terrible at acting. I mean, like Razzie worthy. None of the lines they say have any emotional depth and they can be extremely over-the-top and annoying as hell. The other big issue is the pacing, which is a complete mess. Some parts feel slow and some parts feel fast-paced. But all-in-all, Chappie is a good and thought provoking science-ficton film that conveys how the mind of a child can be so easily bended. 7/10",
      "total_reactions": 0,
      "user": "BB_Critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Even though chappie is a visually impressive film with good performances from Dev Patel and Sharlto Copley and does most certainly have a lot of effort put into production the narrative is very inconsistent along with a poorly written villain with a motive that is only briefly mentioned, the characters of Yolandi and Ninja are extremely unlikable, unsympathetic and annoying this is not something you should go for in terms of main characters! also while the films theme is noble it really started to beat you over the head of how chappie is only an innocent mind I mean it literally says reject on his forehead, the message could have used a little more subtlety.",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "A funny action packed movie and I really think movie critics have rated it wrongly giving it such low scores here. Anyway, if you like Die Antwoord you will really be into this movie, if you don't, you'll still find it funny and quirky and it was really entertaining until the end, even though some parts in the plot didn't make too much sense, but either way, I think it is one of the movies this year which you'll remember if you watch it.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Chappie is a movie that had great potential at the start but, like most movies nowadays, had a weak middle and got slightly better near the end. I say this because Chappie's start was flawless upto the point where Dion was captured. After that the middle section of the movie felt violent choppy and aggressive.",
      "total_reactions": 0,
      "user": "Kawai_overdose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Very, very, very underrated si-fi flick. I don't like the reviews this film got online at all. It has its flaws, mainly in the way the plot is delivered, but I was able to easily look past that and enjoy every single scene in the film. It's plot is very similar to District 9 in some ways, but that is not a good reason to give the movie horrid low scores.",
      "total_reactions": 0,
      "user": "NatT96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "As a fellow South African I had quite a few laughs. It is true that there is no new concepts in this film, but I still find it awesomely executed. Living in South Africa this would actually be a dream come true, and I think that is  why it hit a soft spot. The movie isn't quite inaccurate either , except for the robots of course :P, Two thumbs up.",
      "total_reactions": 0,
      "user": "bmaguire007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Very entertaining, the ending was astonishing. I re-winded twice and saw the ending again and again the way he starts as an incomprehensible child and grows into this misguided teen into a mature adult is very meaningful. Recommend, muss watch.",
      "total_reactions": 0,
      "user": "Movie_Critic123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "More involving than District 9 and crafted with more precision than Elysium, Chappie is a much better film than its unforgiving critical reception suggests. Sure, its tonal shifts are jarring at times and there's less political heft than expected of Blomkamp, but the film's gripping action, emotional pull and refreshing ending accumulates to a wonderful sci-fi.",
      "total_reactions": 0,
      "user": "EdgarReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "This movie is set in South Africa when none of the actors are South African or even black. The accents are terrible. No real plot, looks like it was made for immature young men. I don't see how anyone could give this movie much more than a 1. It has a lot of action and some cool graphics, but so does a hundred video games.",
      "total_reactions": 0,
      "user": "LM7889"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Neill Blomkamp is the best at mixing human with machine/tech/alien elements. Always good stuff! Chappie is  great! btw you can see what looks like later models of Chappie in Elysium.",
      "total_reactions": 0,
      "user": "schmexy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "A Heart warming story that contravenes the basic idea that AI is the new evil. This story is another the professional critics really fell flat on their faces on and is a must watch for everyone The tale will keep you anchored to your seat as a robot with a new AI grows and matures. and learns the meaning of what it is to be alive.",
      "total_reactions": 0,
      "user": "Tibs_Mclaire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "Why are some of these people on metacritic there not even critics if they think this movie is 10/10 sure theres some emotional parts but the dialogue is potato and characters are bland or have a poorly written script and or not so good at acting, dont get me wrong I dont just see 10 seconds of a film or just complain about every single detail, no I actually tried getting used to the characters but then I noticed there is no characters and more of robots taking over the earth message.",
      "total_reactions": 0,
      "user": "edpoopstuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2015
      },
      "score": 9,
      "text": "Seeing the reviews before watching the movie gave me low expectations for the film but after watching I loved the movie especially how Jackman played the antagonist of the film (loved how he played Angier in The Prestige). There is a great script for a robot who had a human development, from knowing nothing to knowing tons of hardcore science and knowing how to feel, how to love.",
      "total_reactions": 0,
      "user": "mcblancaflor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 5,
      "text": "Entertaining movie, not as bad as I expected from the metascore.  I was a bit surprised how quickly they switched from \"consciousness is a miracle that is not understood\" to \"never mind, we can store it on a thumb drive\".  The villain was also pretty cardboard, and there was one instance of shocking violence.  Chappie was adorable.",
      "total_reactions": 0,
      "user": "tethysdust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "The cool movie! I cried many times when viewing, the film has a great sense and it shows the cruelty of people and the modern world! Great story, Chappy just super!",
      "total_reactions": 0,
      "user": "Grizzzzzzzzzzzz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "A good film with some action in and an amazing storyline to it. The special effects in the film were also very good. Seeing the ending, I hope for a sequel to the film with more action in.",
      "total_reactions": 0,
      "user": "hulmej"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "Chappie had a promising premise however. that premise never truly evolve as the film has very stereotypical characters and language, add to that a weak story and characters. Overall, Chappie is a decent film.",
      "total_reactions": 0,
      "user": "geo333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "I personally didn't think it was too bad. I mean, Ninja and Yolandi were kind of annoying (how are we supposed to like these guys if their solution to everything is \"kill\"?) but the actual character of Chappie? Far from it. He just acts like an average human child so I bet those who say he's annoying don't even have kids. The movie could sometimes be a little ridiculous but at the same time, I found it enjoyable. I liked the way the character of Chappie developed ( acting at the beginning like a curious toddler before gradually behaving like a grumpy teenager). I'd listen to the users on this one. Good film.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "The humor is so fresh, fun and simple, it's free of bitter irony",
      "total_reactions": 0,
      "user": "alexa417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "The humor is so fresh, fun and simple, it's free of bitter irony.",
      "total_reactions": 0,
      "user": "tonimiller417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "I've been looking forward to seeing Chappie since first seeing the trailer and thankfully I wasn't disappointed. Neil Blomkamp has done it again with this film that really owes its inspiration to the likes of Robocop, WallE and many others. Great cast all round particularly from Sharlto Copley and Hugh Jackman (nice to see him playing the bad guy for once). In a time with so many robot films this is not one to miss, highly recommended.",
      "total_reactions": 0,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "A very underrated movie and I  had a great time with this movie. I still do not know why people hate or dislike this movie because no one tells we why. But in my opinion Iike this movie.",
      "total_reactions": 0,
      "user": "teddy1984lt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "A must see! i'm a sci geek and the humanizing aspect of Chappie touched me!",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "I consider a movie to be a 10 when I do not want to stop watching. Chappie is without equal in my opinion, which makes the critic's negative reviews just mind-blowing. It was fun, entertaining, heartbreaking, hopeful, and surprisingly realistic; pretty much everything you could ever want from a movie. I am certainly not a fan of Die Antwoord, but I feel like their portrayal of the slightly dim-witted, but seasoned Johannesburg gangsters in the near future, was pretty spot on. Yolandi and Ninja step into their roles flawlessly with the former naturally taking on a caretaker role and the latter being the one-track-mind gangster that sees Chappie only as a tool for survival.",
      "total_reactions": 0,
      "user": "Arcangel_Loki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2017
      },
      "score": 6,
      "text": "If the intention here is to make this movie heartwarming, then Chappie kind of succeded. Yeah, it was pretty good, not only the idea, otherwise some values that are enjoyable for people. But this movie, which intentions were supposedly for young viewers, has explicit blood and scenes too. So it doesn't match with the audience. Chappie just shows a kid learning things from the real world and adapting it (but instead of a kid, a robot) also there were fewer action parts than I expected, because the reason of seeing the movie was that, however it does a decent job on those few parts. But talking about the other things, adding the real life situations showed, they did an entertaining work. Not very good, but at least enjoyable (56%)",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "Chappie is a funny, but totally dumb sci fi thriller about a police robot designed to kill the police and commit carjackings, murders, and cause mayhem. Chappie however doesn't agree with that. So the bad dudes trick Chappie into commiting crimes, like the carjackings. The acting was sub par here. It was an okay way to spend 2 hours.",
      "total_reactions": 0,
      "user": "RickyReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "I am fascinated with AI, however this movie fails on so many levels. If you want to see a ghetto robot than this movie is for you. The only part of the movie I like was at the end when they were going on about Artificial Intelligence and consciousness transfer. Other than that, this movie is a complete waste of time, even Hugh Jackman was bad in this movie.",
      "total_reactions": 0,
      "user": "michael_malo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "I am a huge fan of Dire Antword. I really enjoyed this movie. very Short Circuit meets Iron Man or something but it was decent. I had a lot of laugh out loud moments but also even found myself wanting to cry. Something I will probably watch again in the future.",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "Neill Blomkamp's Chappie, is an artificial intelligence robot-theme film. Another visually stunning movie by the director but Chappie feels interesting at times, yet uninteresting at other times too. It also can feel clunky & confusing. I did enjoy it to a certain extent.",
      "total_reactions": 0,
      "user": "amai2739"
    }
  ]
}