{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 15,
  "mc_movie_name": "Charlie St. Cloud",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 18,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "I could have given 2 more points if \"Charlie St. Cloud\" knew what morale it was going to present. Guess it didn't do its homework...",
      "total_reactions": 4,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "Pretty bad. As a fan of the book I was pretty dissappointed with this movie. I don't think the acting was the issue. The issue definitely was the writing. A few details from the book remained unchanged but the majority of it was thrown out. This was the second biggest let down for me this summer. No movie will ever be as bad as The Last Airbender.",
      "total_reactions": 1,
      "user": "MPVahalik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "Charlie(Zac Efron) sees dead people, but he's not dead, technically. As the surviving brother of a fiery car accident, the film oversells the point of Charlie being dead inside by having him kill time in a graveyard. Yes, we get it. Time can stand still for the living, too; the living dead, like the caretaker, a selective clairvoyant who only sees dead loved ones. Played by Zac Efron, the star of \"High School Musical\", to everybody's surprise, didn't fare badly last year in Richard Linklater's \"Me and Orson Welles\", as he ingratiated himself admirably within an ensemble cast. But does he have the stuff that lead actors are made of? Like any young enterprising former teen star, Efron doesn't want to be singing showtunes in \"High School Musical 37\"(an old teen like Jeff Conaway in \"Grease\"), but the actor in transition plays it safe this time around in \"Charlie St. Cloud\", catering to his female devotees by remaining, against all probability, flawlessly handsome, since the car he was driving performed a couple of rolls on the highway. At Sam's funeral, Charlie, for the sake of versimilitude, should be in a wheelchair, or at the very least, have his arm in a sling. In other words, sport some evidence of having been involved in a vehicular crash. Poor Efron has to communicate emotional pain and inner turmoil with an unblemished face and undamaged body. A band-aid on his nose couldn't hurt. Johnny Depp, who once donned scissorhands and a face full of crosshatching scars to distance himself from the sex symbol status he attained from \"21 Jump Street\", would have insisted on that band-aid(a la Jack Nicholson in Roman Polanski's \"Chinatown\"), for starters. Depp treated his face like a curse. Efron won't go anywhere until he eschews vanity, and plays \"ugly\". Not only physically, but emotionally, as well. The moviegoer waits for the moment when Charlie tells Sam(Charlie Tahan) that he'll never be a starting pitcher for the Red Sox, an emotional climax to the utter futility of practice, but the moment never comes. As it turns out, it's Charlie who holds Sam back, even though the younger St. Cloud whines all throughout the movie about remaining loyal to their pact. \"Charlie St. Cloud\" is a lot darker than it lets on, but thanks to the film's unabashedly Christian underpinning, its good-naturedness and oversentimentality negates any real fallout(drugs and alcohol) from materializing. If \"Charlie St. Cloud\" went there, would Efron have the acting chops to follow? \"Charlie St. Cloud\" never captures the tragedy of wasted potential because the moviegoer can't truly feel sorry for somebody who looks like an underwear model.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This was an amazing movie!  The acting had depth, and the audience was able to easily connect with all characters.  If you are stuck in lifes' little moments or are looking for a more purposeful direction, one should really consider viewing this movie.",
      "total_reactions": 0,
      "user": "SandrainCanada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "It has good acting, but the story is very shallow. The unpredictability is common here. The lesson that you could've learned from this is missing.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Zac Efron gives all his dramatic acting talent (which isn't much) and tries really hard to save this clear rip-off of the lovely bones. Sadly it fails worse than I described om the first sentence. I give this movie 15%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "This isn't normally the type of movie I watch. I decided to check it out though, because people have been raving about it. It also features Charlie Tahan, who is one of the biggest up and coming stars around. Charlie St. Cloud also has some awesome cameos and let's face it, Zac Efron was pretty good in 17 again, so I took a chance. Sadly though, even with all the film apparently had going for it, Charlie St. Cloud was a boring flop. The story follows a young man's journey to re-discover himself following a drunk driving accident that claimed the life of his little brother. It's a solid story to build on, but that's just it, it really doesn't go anywhere from there. Charlie is consumed by what happened and even years later spends hours in the woods talking to his brothers ghost. If you watch the first fifteen minutes of the movie, there really all there is to see. It had a lot of potential and fairly good cast, but honestly I found the film to be boring and really  depressing.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "[SPOILER!] - So the brother dies sitting in the passenger seat and Charlie (Zac Efron) makes it out alive without a single scratch, cut or broken/fractured bone? Not very convincing. Touching movie - it's really hard to depict the emotional struggles and pain of a teenager dealing with the death of a loved one; especially close sibling in this case. Zac Efron did a great job communicating to the audience the pain behind that.",
      "total_reactions": 0,
      "user": "SShao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "This is a powerful, touching, different kind of movie that starts strong, continues like that almost all the way to the finish, but in the end something just happens (well, for me it felt like that since I'm not into romantic, happy conclusions). Still an awesome movie.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "Charlie St. Cloud is not a good film in any sense of the word. A compelling premise is ruined thoroughly from beginning to end with the film's insistence on being a teenage rom-com fantasy film. The acting is lackadaisical to say the least and the little brother is annoying and needs to go away to make this film better. Aside from the truly far fetched and overly sappy direction taken by the film, the initial premise and overall message is good: do not mourn forever because life will pass you by, the person you are mourning will want you to move on. Decent message, but instead it is drowned out by gratuitous shots of Zac Efron's abs and teenage rom-com tropes. Overall, Charlie St. Cloud is a bad movie.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Believe it or not I actually thought that Zac Efron gave a very commendable effort in this difficult film. It has a heart-wrenching story but the story seems to hold still in several places. The twist was a little predictable but it wasn't the worst ending in the world. I wouldn't watch it again but I don't regret watching it either.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I've always really liked this movie. I watched it again and expected to see it's flaws, and I still really enjoyed it and bought into Zac Efron's performance.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This film is very good, I like the story, good acting Zac Efron and Amanda Crew. I recominedo for those who want to see something especially romantic love.",
      "total_reactions": 0,
      "user": "Hermione07"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This is a very clever story portrayed by talented actors. A very sentimental film allowing you to grow attached to the individual characters and really sympathise with them. On a whole a fabulous movie.",
      "total_reactions": 0,
      "user": "Maisie_T"
    }
  ]
}