{
  "mc_avg_user_score": 8.3,
  "mc_metascore": 75,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Chasing Ice",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "This amazingly beautiful, and amazingly frightening, documentary captures the immediacy of what climate change is doing to the Arctic landscape."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "The film doesn't just serve up Mr. Balog's amazing and undeniably convincing imagery. It also records his personal struggles as knee problems threaten his ability to hike the difficult terrain to get the shots he wants."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 85,
      "summary": "In Hollywood these days, such epic transformations are rendered with computers and called \"morphing.\" Offering a lesson both to filmmakers and climate-change deniers, Chasing Ice demonstrates how much more powerful it is to capture the real thing."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 83,
      "summary": "When we finally see the time-lapse images his cameras took, they're awesome and terrifying - a meltdown out of a poetic horror film."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "The before and after imagery of Balog's project speaks for itself, with the power and strange beauty of the evolving landscape strong evidence that something is indeed happening, now and fast."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Chasing Ice aims to accomplish, with pictures, what all the hot air that has been generated on the subject of global warming hasn't been able to do: make a difference."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Orlowski does share Balog's smoldering rage at a society that refuses to face the consequences of its actions, and that rage forms the necessary spine of Chasing Ice. This is an agit-doc with no apologies and a lot of sorrow."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Heart-stopping in its coverage of the brave and risky attempt by a scientist named James Balog and his team of researchers on the Extreme Ice Survey, where \"extreme\" refers to their efforts almost more than to the ice."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "Still and live-action footage captures the ice sliding into the sea with exquisite grace, which makes it all the more wrenching. Are such images enough to convince the naysayers that something unnatural is occurring? Doubtful."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "A documentary so stuffed with eye-soothing images one prays it can seduce a climate-change skeptic or two."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 70,
      "summary": "Following the exhaustive efforts of photographer-scientist James Balog to capture irrefutable evidence of the world's glaciers in retreat, first-time helmer Jeff Orlowski's documentary supplies a heroic human-interest angle on global warming that's ultimately less remarkable than the grandeur of its arctic imagery."
    },
    {
      "critic": "Alison Willmore",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 67,
      "summary": "As someone who admits to having harbored skepticism about climate change himself, two decades ago, Balog is trying to present an image-based response to all the denialists featured in the news montages scattered through the film, people who scoff at the numbers and lack of scientific consensus on whether global warming exists, and what it entails."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "The impact should be visceral and gut-wrenching; instead, it's cool and cerebral – after all, we're being lectured in a lecture hall."
    },
    {
      "critic": "Thomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "If you need it, the documentary offers a devastating, and often beautifully shot, reality check."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "His personal efforts are praiseworthy, but if glacial melting is in fact the \"canary in the climate coal mine\" (his words), the movie might have given us a bit less of Balog and a bit more of the startling sequences he produced."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "There is no doubt this film is beautiful and powerful. It offers both irrefutable visual evidence of melting glaciers and a brief but impressive bio of National Geographic photographer James Balog. But the focus is blurred when, for example, we balance a global crisis with Balog's ailing knee. The film might have offered a single solution over a non-compliant-patient subplot. That said, it's still worth the price of admission for the photography alone.",
      "total_reactions": 2,
      "user": "Tim-T"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Visually amazing, but I just kept waiting for the science to come into the movie and it never did. Saw it in Boulder with James Balog in attendance and the only thing I got out of his comments was how proud of himself he was.",
      "total_reactions": 3,
      "user": "jiffer2387"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "I first saw this at my city's International Film Festival, then later thankfully I was able to watch it with my son, who was 9 at the time, when at a friend's place for one of the big 3 holidays, it was on Netflix. Brilliantly conceived and carried out, over a long stretch of time, by the filmmakers, it led to a fine father-son discussion about the environment, its importance, what is wrong with it and what can be done to improve things on Earth. Its importance is inestimable, and I highly recommend it to everyone. It is something everybody needs to see, think about and actively discuss, regardless of one's personal priorities or political sphere of influence.",
      "total_reactions": 1,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Chasing Ice is as strong a documentary as I have ever seen concerning the issues of global warming, and that includes Al Gore’s terrific Oscar winning Inconvenient Truth. It centers on a man named James Balog, a National Geographic photographer, who with a team sets an array of advanced cameras focusing on various glaciers in Greenland, Iceland and Alaska in order to see the change in the ice coverage over periods of months and years. At first the complex and fragile nature of such a program leads to great technical difficulties, but eventually they do get the program on track, and the results are no less than stunning. The film is not overtly political. It begins with a montage of “skeptics” of human caused climate change. Balog, who claims to have himself once been a skeptic, ends up getting deeply involved in the project to the detriment of time with his family and the numerous surgeries he gets on his knees. Throughout the film the science of global warming and it’s general effects on the planet is tiptoed into, but primarily it lets the visuals do the talking. This film is beautiful and disturbing literally at the same time with treks across ice sheets viewing the melting in real time, images of glaciers breaking off into the sea, and the main focus the time-lapse footage.",
      "total_reactions": 0,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "A film or documentary that will need your fullest attention, not only does James Balog, the photographer whose work is the basis of the film, tell us that we will never see some of the events that his time lapse experiments captured, but the lasting memory is on his memory cards, and this film will live on with you, as clear evidence and concrete proof in visually spectacular yet devastating fashion is shown to the world, proof again that one of the most debated issues of this generation is indeed in full swing, severe climate change.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "An issue that concerns all humans, fantastic images, and a portrait of a determined achiever. There's even a few dramatic moments related to the quest for photographies. Highly recommended!",
      "total_reactions": 0,
      "user": "mrnice"
    }
  ]
}