{
  "avg_user_score": 7.5,
  "metascore": 63,
  "mixed_rating_frequency": 5,
  "movie_name": "Cheap Thrills",
  "negative_rating_frequency": 0,
  "positive_rating_frequency": 26,
  "pro_critic_reviews": [
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 83,
      "summary": "Savagely assaulting the desperate state of a blue collar family man, the comedic thriller Cheap Thrills establishes a ridiculous premise early on and takes it to various extremes, again and again, until you just have to accept the crazy venture on its own terms or simply give up."
    },
    {
      "critic": "Nigel Floyd",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 80,
      "summary": "The casting of comedian Koechner as the sleazy host is a masterstroke, but all four actors relish the salty dialogue and farcical cruelty, as the film moves towards a bleak but satisfying ending."
    },
    {
      "critic": "Owen Williams",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 80,
      "summary": "A grimly funny social allegory that doesn't pull a single punch."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "This is dark comedy indeed, and if viewed as such, it works deliciously."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "Katz has a clear investment in Healy's character and convincingly depicts his choices as inevitable even when they become anything but."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 80,
      "summary": "The performances are perfectly attuned to the material, with Koechner dominating his every scene as a kind of demented ringmaster, and Healy adroitly demonstrating the potential for both humor and horror in a character with nothing left to lose."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "This is a solid thrill ride all around, especially for those who like their Faustian parables with a bit of the bloody red stuff."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 75,
      "summary": "Unlike most movies that use the current economic crisis as a dramatic backdrop, Healy's character is vibrant enough that the audience can make an easy connection and go through the journey with him."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "It's not an easy ride, but it is ultimately a satisfying one."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2014
      },
      "score": 70,
      "summary": "Healy and Embry commit to their enervating roles with a heady mix of desperation and gusto, while Koechner is cleverly modulated as the evening's madman emcee. But Paxton, as the complicit yet impassive Violet, remains mostly a shiny accessory."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 70,
      "summary": "The film advances some harsh truths about the spoils of money-grubbing savagery. But Cheap Thrills doesn’t take a scolding tone: These lessons come in the form of a rowdy, midnight-movie entertainment that keeps its considerable ambition under wraps."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 67,
      "summary": "Even if Cheap Thrills isn’t always plausible, though, it’s still a fair amount of twisted fun, thanks mostly to a surprisingly, effectively low-key turn by Koechner as the game’s emcee."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2014
      },
      "score": 67,
      "summary": "Erich von Stroheim might have made the definitive film about human swinishness way back in 1924 – sorry, Gordon Gekko – but Cheap Thrills cuts deeper, darker, and straight to the bone."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 63,
      "summary": "A nasty, elemental thriller, basically a four-character play with blood and guts and sex and drugs and dares"
    },
    {
      "critic": "Leslie Felperin",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 60,
      "summary": "The script is smarter than the premise sounds, with writers David Chirchirillo and Trent Haaga dispensing enough information to make victims both sympathetic and despicable, the instigators charismatic and sinister."
    },
    {
      "critic": "Patrick Gamble",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "Cheap Thrills is a commendably flawed experiment in imbuing social anxiety with genre shocks."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "It’s well-acted, especially by Healy (The Innkeepers), who makes you feel the pain of every wound, the ratcheting torture of every dilemma. But the film’s also a gimmicky exercise whose hollowness and credibility are constant problems."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 60,
      "summary": "Katz stages the contests with infectious energy... Too bad the last half hour feels like Katz is rubbing our face in the several turds he shows us, reminding us that people are awful. Of course they are. What else do you have to tell us?"
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "If Cheap Thrills ultimately does carry us along, it’s due largely to Healy’s performance and presence. He’s a figure halfway between schlemiel and criminal, and the film effectively works that full range."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "This is not a movie for everybody, but that assessment is not exactly intended as a thumbs down. Alarming thrills are guaranteed."
    },
    {
      "critic": "Steve Macfarlane",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2014
      },
      "score": 50,
      "summary": "The film's clearest winner is Pat Healy, whose depiction of a man willing to corrode his entire life to provide for his wife and kid feels true despite the script's silliest moments."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "In Cheap Thrills, a committed cast elevates what is, ultimately, a gimmicky thriller. It dissolves into a puddle of blood-tinged hypocrisy."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 40,
      "summary": "Cheap Thrills is little more than low-budget torture porn for the doobie-addled dudebro contingent."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "I watched Cheap Thrills months ago at a local film festival and I have to admit that I loved it's dark sense of humor. It's a simple movie, with a simple concept, and a very dark & desperate outlook on life. The idea behind the film is pretty basic but fortunately there are a few good plot twists to break up the increasingly violent and dangerous cash offers the two main characters are tempted with. Cheap Thrills won't be for the faint of heart, but if you're looking for something dark, and surprisingly well-done then I would recommend giving it a shot.",
      "total_reactions": 1,
      "user": "Thordane"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "A gross-out movie based around a simple premise of what someone would do to earn money to save their family and their life (when you have little to none of course). The dares escalate as more and more money becomes involved, and it's all pretty intriguing stuff. But it's hard to shake the feeling that it could have done more with the premise and some of it is just outlandish for its own sake instead of being button pushing in a truly authentic way. The ending is also a bit of a let down. It makes sense, feels inevitable, and as a result, also a bit contrived.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "My expectations started fairly lukewarm. I saw good reviews from critics, which was reassuring, but the premise seemed too trashy to be anything more than shock value meaningless entertainment. I was partly right. Cheap Thrills is trashy and shocking. But what I was wrong about was just how trashy and shocking it was going to get. This, weirdly enough, most reminds me of Big Bad Wolves, an Iranian film that was equally graphic and arresting, though, I'm gonna be honest, I think that, while Cheap Thrills is less artistically worthwhile, it is the better film. This movie is so entertaining and FUNNY, I found myself quite pleasantly (and unpleasantly) surprised. The entire concept is ridiculous and some of the extremes are a bit too absurd to be feasible, but the film isn't asking to be taken seriously, which makes it simultaneously succeed, yet also not amount to much more than a genre picture (but what a picture it is). Pat Healy is fantastic and remarkably expressive compared to the other roles I'd seen him in, like The Innkeepers (also starring Sara Paxton) and Compliance. Ethan Embry's character isn't handled with quite as much grace, but he certainly manages. MOST IMPORTANTLY, David Koechner is absolutely riveting here. He adds a strange level of depth to a character that would, on paper, simply come across as a one-note sadist. He truly delivers his finest performance of his career in this movie. I'm being straight up. Check out Cheap Thrills. I recommend it entirely, especially for fans of the low-budget showmanship of Joe Swanberg, Ti West, and Adam Wingard.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Shockingly, Cheap Thrills manages to cleverly create a entertaining experience by pitting friend vs friend, adding dark humor, a well assembled cast, and a storyline that pushes the boundaries of independent cinema.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "The story wasn't original but it's always interesting to see where people would go for money. The acting was good and the movie was very entertaining. I'm not a big fan of the ending but it's still a good movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "There is plenty to like about this film, which takes what is usually the (entertaining but) outlandish premise of people preforming extreme tasks for cash, and people willing to pay big sums of money to be entertained, and turns it into a satire on society’s obsession with self-deprecation in the pursuit of easy money, and its seemingly insatiable need to be entertained by greater and greater extremes.  Cheap Thrills taps deep into that.",
      "total_reactions": 0,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "At first the film poster reminded me of a comedy movie, especially with the whammy guy upfront. but it´s not a comedy, it got a couple of funny scenes, but this **** gets dark and serious quickly. Reminded me a little bit of an actual movie version of dirty sanchez. They do anything for money. Towards the end the movie gets extremer, proving the R rated mark. I liked the idea of the movie, it got that b-movie feeling but cheap thrills has that special potential. Unexpected End, great last Shot",
      "total_reactions": 0,
      "user": "iCronic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "From reading other revues, I expected some comedy in this film. I found none. It was darkly engaging and there were a couple of moments that, perhaps in some other film, may have been humorous but in this film were more horrific. The musical score and direction didn't allow me to laugh at things I may otherwise have.",
      "total_reactions": 0,
      "user": "TheBuffalo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "The first half of cheap thrills is very entertaining and funny but once the second half rolls around that's when the shock value wore off and by that point they were trying to hard to make the audience go ughhh while the two leads give good performances I never really bought that they were once friends the way they interacted with each other just seemed like they just met.",
      "total_reactions": 0,
      "user": "TheDude-"
    }
  ]
}