{
  "mc_avg_user_score": 8.3,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "City Island",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 47,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "An amusing comedy-of-errors flick that blended dysfunctional-family cliches with some truly touching and original moments -- such as the son's unusual fetish that was handled with an apt combination of sincerity and weird wonderment. I also enjoyed seeing Andy Garcia and Julianna Margulies together again. (Both were really good in 2001's \"The Man From Elysian Fields.\")",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "With creative mastery and verve, writer director Raymond De Felitta steps outside the Hollywood formula in the refreshing indie comedy City Island. City Island, a mostly Italian-American fishing village in the Bronx, is marked by the Rizzo family's strong ties and passions writ large. Each Rizzo harbors a secret, and the resulting clash of lies and half-truths keeps conflict sauteing.",
      "total_reactions": 0,
      "user": "SecretAgentGal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "Entertaining, ok story line, a little off beat, and makes for a fun movie rental nite. I'll recommend this to my friends and family. Even teenagers would like this film. It was a Redbox rental for us. You can't beat the price.",
      "total_reactions": 0,
      "user": "lazydean"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "A truly great film with multi-faceted scenes and such a diverse story. Such eccentric dark humour with a complex look at family and all of its problems.",
      "total_reactions": 0,
      "user": "beelzie14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "A slight premise (a dysfunctional family unable to be honest with each other are brought together by an ex-con who turns out to be...) which could easily have been wrecked by poor casting is brought to life by excellent, empathetic performances by Andy Garcia and Julianna Margulies. There are a few bum notes (a wince-inducing turn by Emily Mortimer as an ever-so-English aspiring actress and a cringeworthy scene where Garcia over-emotes as an amateur actor under-emoting to win a role) but it's all likeable enough, particularly when they all stop shouting and start listening to each other.",
      "total_reactions": 0,
      "user": "CharlotteP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "It could have very easily been annoying, but thanks to the strength of its cast it becomes a funny, heartfelt, and endearing story of a dysfunctional family.",
      "total_reactions": 0,
      "user": "Seriosity"
    }
  ]
}