{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 159,
  "mc_movie_name": "Clash of the Titans",
  "mc_negative_rating_frequency": 129,
  "mc_positive_rating_frequency": 131,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "The original 1981 Ray Harryhausen special effects designed and produced  fantasy adventure is a film of magic wonder, excitement, adventure and mysticism. The 2010 remake or re-imaging if you prefer  \"Clash of the Titans\" is centered around a young  fisherman named Perseus  who  after a personal loss  sets  out  to the city of Argos to  take up the task of saving the whole city from the brink of destruction by the hands of the Kraken.  With a small group of brave soldiers Perseus seeks to take on some of the most foul and feared creatures in Greek mythology and save Argos from there fate.  While at sometimes, you may feel this film is a little too underwhelming and heavy-handed Louis Leterrierâ",
      "total_reactions": 1,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "clash of the titans has a simple script. gods and humans are fighting against each other. humans are taking revenge against gods. but the thing is that , a demi god is there perseus .... who fights for humans",
      "total_reactions": 1,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "The new, so-called \"up-dated\", version of \"The Clash of the Titans\" does not go very in-depth and into very much detail about the vast universe of the subject matter it is attempting to tackle. I'm speaking, of course, about Greek Mythology and the tales surrounding the hero Perseus. The overall pace of the movie seems very rushed, as if the filmmakers were trying to squeeze as much of the storyline as possible into a picture meant solely as a summer blockbuster. The acting is terrible, aside from a few of the minor characters throughout the film. Sam Worthington's acting is about as good as it's going to get, which is completely stale and uninteresting. The scenes involving the slaying of Medusa were the only somewhat enjoyable moments of the entire film, to me anyway. I say somewhat because the computer-generated animation of Medusa was difficult to stomach, as it seemed too \"cartoon-like\" to be considered realistic in movement as well as appearance. If they had used a real actress to portray at least the upper-half of Medusa's body then I would have enjoyed the segment much more. Overall, this movie was a waste of my time. I give it a 6 out of 10.",
      "total_reactions": 1,
      "user": "MattCon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "People crack me up.  This movie was roasted when it came out.  So much so, that I didn't go see it in the theater.  As a die-hard fan of the original, I couldn't bear to see them make it too serious, which would eliminate the beauty of the original's adventurous cheese, or make it too cheesy as well, thus insulting the original. Well, I finally decided to watch it on DirecTV.  Granted, my expectations may have been low, but after watching Louis Letterier's directorial follow-up to a superb reboot of The Incredible Hulk, I am convinced people are absolutely crazy.  This movie was fantastic!  I read that it was cheesy.  Yes, it had some cheesy elements to it, but have you seen the original?  It DEFINES cheese!  I read that the Kraken was disappointing because it was too octopus-like.  Uhm...do you KNOW what a Kraken is?  It is based on a GIANT SQUID.  If anything, the original movie's Kraken was wrong!  Louis Letterier did as good of a job remaking this classic than anyone could have done.  He didn't insult it and wasn't so serious to make the original look cheesier than it already is.  It was absolutely fantastic.  The action, the CGI, even the elements of the story they changed.  Yes, the acting was very bad in parts, but knowing the bad acting and effects from the original, can one really be THAT critical of this one?  No, Gone With the Wind it was not, but it wasn't meant to be either.  I question who could have expected more.",
      "total_reactions": 1,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Based on the 1981 movie of the same name, this remake tells the re-imagining of the Greek mythology and also tells the story about Perseus, who learns that he is the demigod of Zeus and the only one who can stop Hades from summoning the Kraken that would wipe out the Titans and cause chaos to the world forever while being aided by Argos finest soldiers.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "If you like action movies or movies about Greek mythology than this is a movie you will highly enjoy, an ultimately enjoyable movie with likable characters and a great story, some stale moments and one or two plot holes are the only things holding it back, a great movie from beginning to end.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Thiz movie is remake from the original version in 1981 which still using stop-motion techniques. Now on CGI era, CLASH OF THE TITANS resurrects back to live. Perseus used to play by Harry Hamlin, now replaced by Sam Worthington. The Director is Louis Leterrier, the creator of THE TRANSPORTER (2002) and INCREDIBLE HULK (2008). I noted there were three enormous actions in thiz movie: Giant Scorpions Battle, Medusa Hunt and Furious Kraken scene. The special effects worked well. But in the close-up fight scenes, the camera did not focus and too fast, we did not really see what was really going on. The dialogues were a little bit lame and lack of interlude jokes. However, I like The Gods Gathering on Olympus as describe on thiz film. It is better and way beyond of what we saw earlier thiz year on PERCY JACKSON AND THE OLYMPIANS which also based on Greek mythology. My school teacher used to say, Sometimes what we saw in movie-trailer is what we saw in entire movie. It really happened on thiz movie. Worthington was not on his best, compare to his latest performances in TERMINATOR SALVATION (2009) and ground-breaking AVATAR (2009). There is emptiness during his appearance on thiz movie. Anyhow, I think we will see many of upcoming Worthington appearances. Thiz man could be new Schwarzenegger. It looks like we got a new Titan in Hollywood.",
      "total_reactions": 1,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I agree on the script. The writers need to shoot themselves in the head. but the movie is AWESOME!!!! Also the actors are good in the movie too. But when hes fighting the guy whom kills the chick guide he jumps dramatically for no reason.",
      "total_reactions": 1,
      "user": "garza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "With terrible acting, a pathetic script, miserable 3D, a tedious plot and derivative elements, Clash of the Titans hits rock bottom in showing what a movie can be.",
      "total_reactions": 1,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "The biggest problem with this film is the acting, but it didn't stopped it from being a very good film.The special effects are outstanding and this is a big plus because if you don't like the film you can still be amazed by the realisticnes of this special effects and computer animation. But i didn't liked the film because of that but because it tells you about the Greek mythology, witch to me is all I need. Sure, it has got bad acting, and is a little cheesy but it is still a good film. Not great but also not bad movie. Solid",
      "total_reactions": 8,
      "user": "Falling_Hammer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Pretty good visual effects don't make up for it's cruddy story and writing.",
      "total_reactions": 7,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "It's a shame that Sam Worthington comes across as so terribly humourless in this movie. Ultimately distinguished from the other warriors only by his incongruous buzz cut and beardless aspect, Sam's Perseus grimaces his way through every scene; his accent (now Australian, now American, now - gasp! - English) was the only unpredictable thing about his performance. Had he appeared to be enjoying himself, perhaps we would have too. As it was, the movie seemed like a randomly strung-together sequence of tenuously related events overseen by Perseus' perpetually frowning visage, culminating in a not-terribly-engaging monster battle.",
      "total_reactions": 9,
      "user": "CharlotteP"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This movie rocks!! It's far from perfect, with bad writing and acting, but its still awesome!! It's full of nonstop action, adventure, CGI effects, and fantasy. A great tribute to the films of Ray Harrihaussen. The critics and the haters don't understand that its just a big, dumb, epic action spectacular!!",
      "total_reactions": 15,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "COTT was underwhelming, and I expected more out of it.  With such problems as one-note characters, some very dull dialogue, an anti-climatic plot, and an ending with no pay-off whatsoever, COTT cements its place for this year's biggest dissapointment.  Thankfully, it features some enjoyable fight scenes, and of course, a great turn by Ralph Fiennes as Hades.  Which by far, is easily the best thing about this film.  I give it a 5/10.",
      "total_reactions": 6,
      "user": "Harbinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "This is one of those films that you go into not expecting to be funny, but then you laugh so hard because it is so bad!!!",
      "total_reactions": 2,
      "user": "smijatov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "Clash of the Titans takes Greek mythology, Ralph Fiennes, Liam Neeson, giant scorpions and Medusa and manages to make them all boring. There was almost nothing to enjoy in this movie, even the action felt largely dull. An underwhelming disappointment and I sincerely hope that the proposed sequel is much, much better than this mess.",
      "total_reactions": 2,
      "user": "Cotts1988"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "The movie was so obvious, I just retreated to my house from the theaters.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "THIS MOVIE TOPS THE F*****G LIST-IT BYPASSES THE LAME ORIGINAL BY A LONG SHOT. I SAW IT 2 TIMES BECAUSE I LOVED IT SO MUCH. IT WAS ONE OF THE BEST 2010 MOVIES",
      "total_reactions": 3,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I really enjoyed this movie. Hades was awesome, and so was much of the rest, especially Medusa. The CGI was incredible. There was not a boring second in the entire movie. Simply fantastic.",
      "total_reactions": 5,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "a very shallow film that is action packed with some nice visuals . the original was better as it usaully goes with remakes . they basically trimmed out more story for more CGI. its a ok film but forgettable .",
      "total_reactions": 1,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Bad movie. I wasn't expecting more than a plotless, full of random action movie and still, i was disappointed. The characters are poorly made, the plot, well, there is none, and the fight scenes (the only thing I actually hoped to have had some quality) were simple and unrealistic.",
      "total_reactions": 2,
      "user": "Razv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "Clash of the Titans is probably the worst movie of the year with a pretty bad script that doesn't even relate with Greek Gods as it should. Not only that but the acting of Sam Worthington is pretty bland for a hero that we must suppose to like and support. The movie definitely has the high productions of visuals and sound, but that's just not enough to ignore the fact the movie never seems to have a truly exciting moment or an emotional one. You just simply wait for something interesting to happen, and when you think it will, it fails to make an impact on you. And in terms of its mythology that is based on, it frankly uses it badly by re-creating visually the gods badly with pathetic costumes and situations that just don't seem to fit very well.",
      "total_reactions": 2,
      "user": "Sonicphoto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "This movie has really entertaining action, really good CGI, and somewhat good lines. The acting is meh, Sam Worthington and Liam Neeson definitely stand out. And the ending, with the kraken, It was good, but way too short. It took maybe 5 minutes to rise from the depths of the ocean, and 3 minutes to die. But it's an entertaining movie.",
      "total_reactions": 1,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "Clash of the Titans : Clash of the writings, Clash of the actings, Clash of the actions, Clash of the 3D 's, Clash of the critics, Clash of the lovers, Clash of the haters. Clash of the reviews.",
      "total_reactions": 1,
      "user": "opix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "While the 3D was poorly done, I still thought the movie was decent, and that means a lot coming from someone who's not a big fan of movies based on Greek mythology.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "The tone of the film is inconsistent and bothersome. At times it takes itself far too seriously, and then the next scene will have over-the-top scenery chewing. Thankfully I saw it in 2D because everyone I know who saw it in 3D said it was unwatchable. And I'm not really on board the Sam Worthington train having not been terribly impressed with his performance here or in \"Avatar.\"",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Alright, I haven't seen the original, so I can't compare the two versions, but heres my review It wasn't that good Things are a bit rushed throughout. We see Perseus with his family for barely 5 minutes and then they're dead. Pegasus appears only twice: once to introduce him and the second for Perseus to ride him. Theres no bond signifyed between the two, so we can't believe in their companionship like we would Ash and Pikachu Gemma Artertons character is basically summed up as \"Appear, dispense wisdom, dissapeer, repeat above until tedioum sets in, make googley eyes with Sam Worthington, flee from scorpions, die, resurrection\" and shes Perseus' love interest. Andromeda shared less scenes with Perseus, and I felt more of a connection between their characters. And Andromeda and Perseus are meant to be together! Ignoring that is like having Guenivere go with Merlin instead of King Arthur. The Djinn. Unimpressive. They were cool characters, but seriously, they reminded me of Seamus from Family Guy. They were tree men! Scorpions. Pretty cool, and I liked the Djinn riding them and the two guys fashioning a scorpion shield for Perseus. Medusa. I liked how her snake physicallities extended from just her hair to her being part snake. But thats all I liked about her, really. The rest, her firing arrows, toying with prey, just meh for me. The Kraken! Talk about unimpressive. I watched an episode of Better Off Ted the day before, where they named a piece of meat they were growing Blobby. When I saw the Kraken, the name Blobby just stuck in my mind. Zeus' armour. Seriously? Sparkly like Edward Cullen? Boo! Ralph Fiennes is brilliant as always, as the evil Hades (thats who he was, right?) but the black tornado look when he first appears in Argos is crap The robot owl was a nice throwaway gag. The guy who convinced citizens of Argos to sacrifice Andromeda, he gets my award for \"Biggest **** of the film\" simply for being annoying and having the ugliest look since, well, ugly All in all, Good in places, but the bad points outweigh the good.",
      "total_reactions": 1,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Big budget fantasy adventure let down by a poor script, poor acting and a waste of the talents of Liam Neeson and Ralph Fiennes. Will appeal to anybody who like the action thick and CGI heavy but it's predictable nonsense that get monotonous about half way through, prepare for the inevitable sequel.",
      "total_reactions": 1,
      "user": "rotku"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "If you look at the two latest Hollywood takes on Greek mythology (Percy Jackson and this snorefest built around epic cliches), Clash of the Titans may be set closer to the period. The wonderful talent carrying it were wasted by a script that's obviously trying too hard. It has nothing to boast but spectacular visual flash. But what I discovered here is that there is range in Sam Worthington's acting. If he wants to keep up the claims that he'll become the next Russell Crowe, he should go more to dramas than in epics that give no damn to mood and character.",
      "total_reactions": 1,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "There is so much potential in Greek mythology for a great movie but this is boring and the action lame. I never cared for any of the characters or events in this film and ended up rolling my eyes through most of the drama. Sam Worthington is only one step above a horrible actor. Clash of the Titans is disappointing and a missed opportunity.",
      "total_reactions": 1,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "This is what happens when a film depends too much on CGI.  Mediocre acting, a mediocre plot, and too many deviations from the actual mythology makes Clash of the Titans and utterly underwhelming hour and a half.",
      "total_reactions": 1,
      "user": "CRL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "Just awful. Terrible acting, poor script and story. I like the Desmond Davis film so was looking forward to this but it failed on every level. Even actors you can normally rely upon struggle to lift this dire excuse for a film (Leeson, Postlethwaite, Fiennes). The only positive thing I can think of is that Gemma Arterton is stunning in this movie. I guess the effects are OK too but nothing special.",
      "total_reactions": 1,
      "user": "nomad4life"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This movie may not of had the best story but the action sequences kicked ass!!! there were moments were you literally feel like jumping into the movie to punch the hell out of the monsters LMAO and just one thing is this movie totally eclipses 90% of other movie climaxes THE KRAKEN!! Big Budget Blockbusters FTW!!!",
      "total_reactions": 1,
      "user": "J-P-M"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "terribly stupid badbadbadbbbbbbbbbbbbbbbbbbbbbbbbaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd. nver seen such a stupid corny movie",
      "total_reactions": 1,
      "user": "freeride1993"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "The film benefits from cool action and great special effects but there aren't enough of those things to actually save the film because it lacks adventure and strong performances. I give this movie 33%.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "It was ok. The acting was far below what I expected, Especially from their A-list cast. Also everyone seemed really out of place, It didnt feel like a movie taking place in ancient times. The only person who really fit perfectly was Mads Mikkelsen, He stood out to me for some reason. The action was average and is never good nor bad.",
      "total_reactions": 1,
      "user": "spadenx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "How dare they? I don't understand who allows these things into the theaters. Am I the only one that was tricked by the awesome trailer with the excellent music and exciting STABBING scorpions? Shame on me, right?",
      "total_reactions": 1,
      "user": "MattCarterWA"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Horrible movie, is really boring, the screenplay terrible, have good effects, but a terrible 3D, I think that Wrath of the Titans is better than this part.",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "To put it simply Clash of the Titan is horrible film. Acting was so bad people on sci fi movies would have done better. Visuals are disgraceful and story is nonexistent. Why would anybody make a film like this, oh is it because of the money. FYI the movie was a flop at the box office. RELEASE THE KRACKEN. HOW STUPID.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Unfortunately, this was a waste of money and talent (where applicable). In the olden times they had stories but no way to put the spectacle on the screen. Now, when the imagination is the only limit, they cannot make a coherent story even based on the Greek mythology - the treasure trove of some of the greatest stories in the history of mankind. It is best to ignore this mess and watch the original in all it's cheesy glory and than rent the other Harryhausen masterworks. Compared with this, Prince of Persia was deep, complex and three-dimensional.",
      "total_reactions": 0,
      "user": "KundK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "I really wanted to like this film.  I actually really thought it had potential from watching the original trailer but as Clash of the Titans is now, it's a completely average and underwhelming film.  Which brings me to the Kraken.  Throughout the film the ever present threat of the Kraken is supposed to build up anticipation of what this monstrous thing looks like and the power it must posses.  Then at the end of the film they kill off the Kraken within five minutes!  Seriously monsters throughout the movie were stronger than the wimp they made the Kraken out to be.",
      "total_reactions": 0,
      "user": "theshermanator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "This movie could have been worth the money if only Liam Neeson would have proclaimed ... \"Wee-lease the KWAKEN!!\".",
      "total_reactions": 0,
      "user": "mark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "I grew up watching this film and hoped the \"remake\" would be the same story with newer special effects......WRONG! The acting sucked, the story was changed and the only part that made sense was Liam Neeson as Zeus. When will Hollywood learn to stop remaking the classics (which they obviously cannot top) and start coming out with their own ideas? This movie did nothing more that infuriate me as the original was one of the best films ever made. Whats next...a remake of Beast Master, Mary Poppins.....? What a waste of an hour and 45 minutes of my life. The director and main actor should be shot!",
      "total_reactions": 0,
      "user": "Chaunte"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "This was a good time kill but Clash of the Titans is left to be a memory rather than sat on my DVD shelf. The special effects are good but at times, itâ",
      "total_reactions": 0,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Not as bad as critics make it seem, not not as good as the trailer made it look. The first 20-30 minutes were very entertaining, but after that I started to get bored. The action scene were drawn out and in some cases really poorly edited. As for the story, it was interesting. I don't remember much from Greek mythology, so I'm not sure how \"accurate\" the characters are. There was one thing that keep on bugging me, why did Gemma Arterton go with them, what was her reason? Was it to protect Perseus? And how did she find them since she didn't leave with them? She just walks up the Perseus when they're in the forest, and they make no attempt to explain why she was there. The acting was what you would expect from an action movie. Ralph Fiennes basically played Voldemort for the first half of the movie which I thought was amusing. As for Sam Worthington, he was not that good. But oddly when I was watching the movie I noticed that he didn't speak that much, not sure if that was a deliberate attempt to mask his acting or not. The special effects were cool, they reminded me a lot of Transformers they way they had the light make those horizontal streaks on the screen. In all it is a below average action movie. 5/10.",
      "total_reactions": 0,
      "user": "pinattar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Ok, i screwed up and accidently wrote 10 on my last review. there is no romantice appeal to this movie and nothing ive never seen before. Overall this movie was dry. like a desert fire in my mouth. DRY",
      "total_reactions": 0,
      "user": "FLOPAD180"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Clash of the Titans reminds me of old school adventure films like Sinbad & The Eye of the Tiger or, uh, Clash of the Titans. It's certainly not high art but then those movies never were. This Clash of the Titans is, however, good clean fantasy fun.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Ok, so my last review sucked. I don't usually review movies but I know what makes a good movie if I ever bothered to make one. I'd make sure the movie makes sense to a wide audience, I'd generally avoid 3D, I'd make sure the actors ar good, I'd make the movie plot innovative and original, I would make sure the movie isn't obviously greenscreened or have over the top special effects and I'd have to make everything perfect, even if it costs a lot of money. No \"That'll do\" will be allowed.  This movie did sound kind of intresting, but it was a flop. It was none of those things above which make a good movie (well at least from my point of view). First the good points: (this won't take long) This movie will appeal to hardcore greek mythologist enthusiasts and if you've ever wondered what a turd that gives you seizures looks like, you're in luck. In a kind of good way. Now the bad points: The plot did not grab me one single bit, even at the start. I was thinking \"Fail\" in the first second of the film. The greenscreening looks like a homemade Star Wars film. The characters were boring. Unoriginal. Yes, you could even do originality with Greek mythology. The special effects were over the top with constant flashing and constantly suffling through scenes back and forth, kind of like a turd that gives you seizures. The battles and the choreography were not well done, not even acrobatics could save them from being boring. The acting is bad. Not in a Michael Jackson way, but the traditional \"The Domondedovo Airport terrorist attack was bad way\". And then there's the worst part: The ending. I could not catch the name of the mythical creature that destroyed the town. The main character defeated it in a strange way that was weird. Then Hades showed up, hoping for a spectacular finale. The main character finishes it in a boring way in seconds. Ok, after THAT long review, bottom line: Avoid it please. $100 Million US dollars shoved into a turd that gives you seizures.",
      "total_reactions": 0,
      "user": "Bathmat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "CLASH OF THE TITANS may have terrible acting, writing and 3D, but it is still pretty entertaining with great special effects.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Acting was mediocre, the story was tolerable, and the special effects were great. I'd say the dialogue could have been better in some parts however.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "The trailer of this movie is one of the worst I've ever seen (scene after scene of fighting without actually revealing anything of the movie itself other than it seems to have a lot of characters - and a lot of fighting); I was really hoping the movie would be better, and it was.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Clash of the Titans is definitely enjoyable, and has exiting action, but too much of that \"exiting action\", the director's gotta just calm down and slow the film down to create a more relaxing and emotional do, the action can be kept, but not all of it. The director concentrated too much on the action and special effects, which made those parts great, but everything else is dumbly acted and scripted, this doesn't stop the film from being enjoyable, far from that, but all you see is awesome action, special effects, and filming, everything else is dumb and fairly poorly done. If it was less fast-paced, had actually good acting, a main character that's not too generic, and a well written script, I'd be giving it a 9/10, but no, it's too in your face with constant action and cheese, so I give it... 6.7/10 (rounded up to 7).",
      "total_reactions": 0,
      "user": "skyminster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Clash of the Titans is not particularly good from the acting and writing perspective- in fact, its pretty terrible. But the action and adventure and scope of the film are enormous fun, and that compensates for what it lacks in other areas.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "This movie is exactly what it says it is. Anyone who sees it should know that. It doesn't matter how bad the story is in this film, it doesn't matter that it's a remake, it doesn't even matter that there are so many parts of the story that are truly \"deus ex machina\". What matters is that this film delivers intense action and it's great to see with friends. The sword fights have amazing choreography, the CGI is astonishingly good, and Sam Worthington and Liam Neeson shine out as great actors in this film, although the Djinn Headman (the sorcerer guy in the desert) is the most creative and awesome looking character in the movie. Overall I give it a 9 because it's fun to watch and it has amazing action with amazing CGI for the monsters. Definite 9 for being advertised for what it is.",
      "total_reactions": 0,
      "user": "Midge115"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "First off, this is a 9 out of 10 movie. Acting is all right. Notbamazing, but still good. Score is great. Adds to the epic sequences they happen. Also, it has unbeleiveable great epic set pieces. They're really good. Visual effects ate great, and the story is good. Overall, this is a good movie. It may not be amazing but still, it's a great movie.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "Mind bobbling piece of trash. Disgraceful acting and story that is intertwined with thoughtless action scenes that are incredibly banal. An embarrassing attempt at creating entertainment.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Standard fare epic fantasy historical action film in the vein of 300. Louis Leterrier, of Transporter fame, leads Sam Worthington as Perseus into combat against the gods of Olympus. Worthington fits the bill as the all-Greek action hero but has little to work with in the script department, often finding it cliched and riddled with cheesy one-liners. The cast includes some big names, Liam Neeson, Ralph Fiennes and Danny Huston but these characters are given little screen time in comparison with Worthington, with the exception of Fiennes, notable for his terrible portrayal of Hades complete with Voldemort voice. Worth mentioning that the visuals and special effects are excellent as one would expect with a film that relies upon them so heavily.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is horrible,with a poor script and bad performances This remake to 1981 classic is probably one of the worst remakes Warner brothers has already produced.",
      "total_reactions": 0,
      "user": "rodrique"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Not a good film, I prefer my films to require brain cells to watch. I love Greek mythology but this was an abomination of classic mythology. I think viewers who enjoy 'popcorn action flicks' may enjoy this film but even they may think that this was just not good enough. The ironic thing is that I actually think the acting was fine.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "It's the movie event of the year, if your a ten-year old boy that is.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "How mediocre.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "Although some of its other lesser-billed cast members do fairly well here, \"Clash Of The Titans\" unfortunately cannot lift itself up and over the hurdle of poor writing.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "I thought it was decent. The CGI didn't look that great at times though (the giant scorpions). I'd say it's slightly more enjoyable than the Percy Jackson series, and IMO way better than the similar Hercules movie with The Rock.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "Very flawed, but the special effects were great. Also, casting Liam Neeson and Ralph Fiennes as important characters was a great choice. A decent film.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Some decent action and a handful of cool fight moments. Excellent special effects for sure. Standard becoming a hero to save the world plot. Writing is subpar and some of the acting is pretty bad, though I think partly because of some terrible lines. As a big Greek mythology fan I was disappointed in how inaccurate it was.",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Good story line, for a movie that I thought was going to be horrible, but the acting wasnt great. They didnt really seem to be in character at some points. Not enough fights and battles and most of them were kinda boring and took too long. And the movie was also too long, I got bored right away. It is still a good movie too watch once then never watch it again.",
      "total_reactions": 0,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Jaw dropping special effects matched with a failure of a story line.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "The action was good and it had good plot. Much better than the sequel. it was enjoyable. I liked it i can say",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Adventure, pure adventure, regardless of complaints about story, acting, etc. The effects were ok. Maybe the mythology was used superficial, but, anyway, why should we be so serious about mythology in this century?! It's just a spring for new art, that's it. Get over it!",
      "total_reactions": 0,
      "user": "morfil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Comparisons with the 1981 original are inevitable. I see this new version of the Clash of the Titans as more of a reimagining of the story than a remake of the original. This leaves us with two completely different stories that are each outstanding in their own right. Although the story is pretty straight forward it is told as an epic quest that the demigod Perseus experiences as he wrestles with his identity while battling fierce giant scorpions, the three witches, the Gorgon, Medusa, and the condemned Calibos culminating in a final showdown with the giant and terrifying Kraken, mythic sea creature set loose by the gods to destroy the city of Argos and the beautiful Andromeda who is being sacrificed to assuage the wrath of the gods. The motive for this epic quest is that the humans have rebelled against the gods and after killing Perseus' earthly family Hades has used the human rebellion as a means to defeat his brother Zeus to become King of the gods but he must also contend with a vengeful Perseus.",
      "total_reactions": 0,
      "user": "Gojira63"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I personally liked this movie, the action was good and the casting choices also worked. The plot was a bit weak as well as the dialogue but still a pretty good movie",
      "total_reactions": 0,
      "user": "kubathereviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "I've never felt so betrayed the trailer was so epic i thought they were going to give us what the original missed on but no. The ending is a miss it has many problems. But fun to watch it was entertaining.",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "The titans clash with mediocre flash.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "Unmemorable, pointless and soulless remake of one of the best 80s movies. Shame on you Mr. Louis Leterrier. I know you can do better. PS: Sam, go back to Pandora because that was more believable than this.",
      "total_reactions": 0,
      "user": "blowback"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "With terrible acting, a pathetic script, miserable 3D, a tedious plot and derivative elements, Clash of the Titans hits rock bottom in showing what a movie can be.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "If i were to sum this up in two words it would be this. NEEDS WORK. Even though the special effects are really good and the fight scenes even better the story is not very good. the story centers around the Greek demi-god Perseus (before he got his skull bashed in in god of war 2)  who has been tasked to find a way to kill the Kraken before it wipes out an entire city of people who have rebelled against the gods. Perseus and most of the other characters are never developed very well most of them are just there to be killed and i barley caught their names. the story is pretty bare but ancient Greek story's have never been complex masterpieces so i will forgive that. Over all it is a 5/10 looks good but dose not play out as good.",
      "total_reactions": 0,
      "user": "Mr_Movies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Um bom filme. Ele tem todo um brilho que reflete a sua obra original,o Destino de Perseu. Só acho que o filme se perde em algumas partes,mas não atrapalha em muita coisa.",
      "total_reactions": 0,
      "user": "f3l1p3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "\"Clash of the Titans\" was a very boring movie , about the script , ero was outstanding in CGI and plot, but Sam Worthington in Avatar would suit instead of this disaster.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "I felt like watching a bored version of fighting and clashing for the ultimate victory for exactly 106 minutes (as Metacritic told me so enough). We'll have to see about Wrath of the Titans soon enough.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "A hero's quest? No, a fool's errand.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "Histoire bidon incapable de s'inspirer au moins correctement de la -pourtant- si vaste mythologie grecque, scénario très poussif incapable de s'extirper de son remplissage auto-suffisant, ce qui signifie beaucoup trop de dialogues dont on se fout comme d'une guigne et trop peu d'action... avec un titre pareil \"le choc des Titans\" on attend toujours et je me suis endormi entretemps. Les acteurs sont en roue libre et du coup un peu à la masse ; quant à la réalisation, si elle s'avère correcte dans l'ensemble, elle ne fait que se reposer sur les effets spéciaux. Bref, très mal construit, branlant et bringuebalant de partout, le choc du film merdique en pleine face.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}