{
  "mc_avg_user_score": 7.7,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Cloudy with a Chance of Meatballs",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 171,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "\"Cloudy with a Chance of Meatballs\" doesn't take itself too seriously, but childishly. But the film uses it with pure love and joy, which makes it hilarious and entertaining.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "The only way to adequately describe this film is odd...really odd. It goes beyond quirky and verges absolute nutbaggery. It starts promisingly, and has some really nice effects, but at some point the plot takes a dive off a cliff. But maybe that's what the creators of Cloudy with a Chance of Meatballs were going for - an absolute rejection of the conventional fantasy animation. It's easily among the most surreal film experiences I've ever seen, and that has it's charm, up to a point. But it would be nice to have a bit more characterisation in the mix as well. Worth seeing if only for a jelly castle and spaghetti twisters being realised on screen.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I  had to give this movie a 10 to bump the rating up for all the idiots out there who think this movie is anything less than a hilarious brilliant film. It matches the children book perfect and is so ridiculous I was laughing during the entire film. If you like films like Hotrod then you'll love this film. A must  a buy in my opinion.",
      "total_reactions": 1,
      "user": "AaronAction"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Cloudy With a Chance of Meatballs is an undeniably funny, charming, quirky film with cute animation and a sweet message for kids to back it up even though we have seen the films heart many times before. I give this movie 84%.",
      "total_reactions": 1,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "â",
      "total_reactions": 1,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "It's just about as good as these type of movies gets. Great-looking, filled to the brim with humor, and riddled with great performances from it's star-studded cast.",
      "total_reactions": 0,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Do not get me wrong this film is not terrible but it is not great either. I guess I more shocked at just how much of a positive response this film has gotten especially via WatchMojo’s Top Ten list and Spill Review. The major turn off for me is the cliché writing and unoriginal story. The saving grace of this film though is the characters who are energetic, to an extent likeable, and have a lot of charm. But I am not the intended audience of the film. Cloud With a Chance of Meatballs is a film made for children and as kids films go its ok it’s only when you look at as a film do the cracks start to show. If you are a parent and looking for something charming and safe to so your children this is the film to show them. If you’re not a child I’d say you can afford to skip this one. Nothing bad in this but at the same time nothing spectacular just a cute little film that will keep kids entertained nothing more.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "This is a very weird film. That's pretty much the only defining characteristic - the humor (though little there is) comes from the odd scenarios and the satires-of-satires-of-stereotypes characters. I guess that's kind of good, but you'll probably just say \"What?\" most of the time. But it's not that bad of a movie. It doesn't make people more stupider than they are now. But there are FAR better comedies out there.",
      "total_reactions": 0,
      "user": "182crazyking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Yeah the movie was actually good. It's a great movie for families as well and I'll admit, it is watchable.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Inspired by a bestselling children book, Cloudy tells the story of a young inventor who creates a machine that makes it rain food. Initially hailed as the towns saviour, things go wrong when the food starts piling up and he loses control of his invention. A visual treat with a clever script and great voice performances, Cloudy ranks alongside the best of Pixar and put Lord & Miller on the map.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "I called it a rarity because of many aspects - very few films carry the easygoing nature of the film, and the comedian-studded casting, it's surprisingly fun, it's all about food and (best of all) it's as weird as it gets. After watching it, you can proudly say that you haven't seen anything quite like it before but you won't see anything quite like it either.",
      "total_reactions": 0,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "One of my favorite movies, CWACOM provides nice humor, impressive animation, an odd but enticing story, and great character moments. Highly recommended.",
      "total_reactions": 0,
      "user": "BlogDog123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "What a great movie! Super funny! fast comedy bits! a unique, interesting story. Great voice overs! This is one of my favorite cgi animation movies out there!",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "From the same directors that gave you the show Clone High USA, Cloudy with a Chance of Meatballs is a colourful animated feature with an a odd sense of humour that will amuse all ages. The film is highly creative with original character designs in a story filled with heart, joy, and many delicious treats. I do admit the film has some childish moments and the third act falls slightly thin in some areas, but other than that, Cloudy with a Chance of Meatballs is a non-Pixar CGI movie that is worth watching.",
      "total_reactions": 0,
      "user": "TipsyMcBee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "CLOUDY WITH A CHANCE OF MEATBALLS is a colourful, well animated and funny kiddie flick for all ages.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I really like the cartoony animation and cartoony feel throughout the film. Even with a slightly predictable story, it manages to be a lot of fun. The characters are great and there is a lot of humor throughout.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "The plot completely decimates many movie conventions (while embracing others) and there's a lot of heart and quirky humor that you don't seem to see in most other movies. It's leaps and bounds ahead of most family movies and even compared to non family movies it's still a pretty top notch production. This parody of disaster movies is ingenious and enjoyable in almost every way possible. Plus it's got Bruce Campbell and Mr. T in it.",
      "total_reactions": 0,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Cloudy with a Chance of Meatballs what a silly name for a movie. I don`t know why I attempted to watch a movie with a name like this, but it turned out pretty epic in a strange way.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "The book is better, and more sanctioned, but the movie is okay for a Saturday afternoon when the kiddies want to watch something and you have nothing else better to do at that moment.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "\"Cloudy with a Chance of Meatballs\" was released in a year where there were plenty of great animated films, but luckily, it doesn't get lost in the pack. It's funny, it's charming, it's pretty well-animated, it's inventive and it's an overall great time at the movies. Adapting a very short children's book to the big screen is always a risky proposition, but luckily, Phil Lord and Chris Miller managed to make it work. \"Cloudy with a Chance of Meatballs\" is a creative and fun animated film that I would highly recommend checking out.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Cloudy with a chance of itchy balls.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Although it is clichéd and undoubtely overhyped, Cloudy with a chance of Meatballs is funny and offers a visual treat which is hard to resist. (Especially for kids)",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Fantastic film, I'm surprised it took me so long to see it. Witty, always on the lookout for the expected event and foreshadowing it humorously, with a general lack of angst and forced drama, this wins my heart.",
      "total_reactions": 0,
      "user": "xolve"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "A vivid look into the world of cloudy with a chance of meatballs. Those who enjoy the book will definatly enjoy this new take on the popular children's book, Not completely like the book, but prety close. Overall a really enjoyable film for everyone.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "what a great movie . it is off the charts , brilliant . and better then the sequel . Grade A+....................................................................",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Although it is clichéd and undoubtely overhyped, Cloudy with a chance of Meatballs is funny and offers a visual treat which is hard to resist. (Especially for kids)",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "Cute,funny and entertaining are words that can be describe to this particular film.Cloudy With A chance Meatballs doesn't take itself too seriously and it is a masterpiece with a lot of funny moments that many people will surely dig in to.",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "cloudy with a chance of meatballs is an ok film. there a lot to like and a lot to not hate but to dislike. there is not muck to say about this film...",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "A fine animated film full of emotion, both see this film has already given me hungry , and I say jokingly, and surely you if you opened your appetite.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "The only problem i have to this movie is the title. Could be call \"Cloudy of Food\" or something like that. Anyway, i really like this movie. Its a weird concept and it does a really funny movie. It has good characters, it has a good animation and it has probably the best CGI slapstick i ever seen in a movie. It's a movie who knows who to laugh with the situations and jokes with his clever ideas. So much to say this movie makes me want to eat a Humberger o Pizza.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "It was creative and great. Despite not having much in common with the book of the same name.But as a stand alone movie.It was gooooooooooooooddddddddd.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "How come I usually forget to review movies like these? Oh well, you can't live up the hunger after seeing this. You can only think about food in this film and your stomach will growl so bad that it wants you to eat your TV screen. Can't.... think... about.... something... else.... while... watching... this. I mean really... raining food doesn't make it better for you, can it? Well... usually that question depends on your opinion.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "Cloudy with a Chance of Meatballs overall is a good film with a unique premise about food falling out of the sky! It has some good characters and emotional impact to it which I liked to see.",
      "total_reactions": 0,
      "user": "MasterRiley"
    }
  ]
}