{
  "mc_avg_user_score": 8.4,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 93,
  "mc_movie_name": "Cloud Atlas",
  "mc_negative_rating_frequency": 71,
  "mc_positive_rating_frequency": 821,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "Its too-muchness is also the source of its power; I was absolutely never bored, and felt surprised when the movie ended. It's an amazing, baffling, thrilling and (for many, it would appear) irritating experience, and for my money the most beautiful and distinctive big-screen vision of the year."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "It fascinates in the moment. It's getting from one moment to the next that is tricky. Surely this is one of the most ambitious films ever made."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 91,
      "summary": "It has laser gun fights, forbidden love, and a rollicking group breakout from a fascistic old folks' home. What more could anyone want?"
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 89,
      "summary": "This remarkable adaptation of the supposedly \"unfilmable\" novel by David Mitchell achieves near-perfection on virtually all levels."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "Superior filmmaking. Yes, it runs almost three hours - but you've probably seen 90-minute films that felt a lot longer."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "Cloud Atlas is certainly out to be a ''visionary'' mindbender, but the film's secret is that it's a nimbly entertaining and light-on-its-feet Hollywood contraption, with the actors cast in multiple roles as if playing a game of dress-up."
    },
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 80,
      "summary": "Don’t let its commercial nosedive in the US tell the whole story. Cloud Atlas is a tough sell, but a rewarding journey all the same. It’s an adventure into the very concept of storytelling: magical, enthralling and thrilling as much as bewildering, pompous and potty. In other words, up in the clouds."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "As is often the peril with movies of giant ambition, Cloud Atlas walks a crooked line between the glorious and the ridiculous."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "As inventive narratives go, there's outside the box, and then there's pioneering another dimension entirely, and this massive, independently financed collaboration among Tom Tykwer and Wachowski siblings Lana and Andy courageously attempts the latter."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Taken as little more than six disconnected shorts featuring the same group of players in different roles, Cloud Atlas works. It's entertaining and the manner in which it has been edited reduces one's tendency to lose patience with the less engaging stories."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Despite some weaknesses, a sense gradually emerges in this film- not just an idea, but a strong feeling mixed with an idea - about the dance of good and evil over time."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Measured scene by scene, the film isn't always successful, and its transcendent moments make it easy to wish it could reach that elevated pitch more often. But Cloud Atlas is the sort of work where the big picture matters more than the details. It's an imperfect film of great daring and tremendous humanity, a work of many stories, but a singular achievement."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 67,
      "summary": "Tom Hanks' appearances come across like scene changes between unfunny sketches on 'Saturday Night Live.'"
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Even at three hours, the film feels truncated, which raises the question of whether the entire adaptation exercise might have chosen the wrong form. Stretched out to 10 or 12 hours on cable television, Cloud Atlas, the series, would be the talk of the fall television season, and the stories, rather than the thematic scaffolding, would be the right focus of attention."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "The cinematography is gorgeous and the makeup amazing, but the story lines are too disconnected."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "While Tom Tykwer, Andy Wachowski and Lana Wachowski haven't necessarily expanded on Mitchell's book, they've done a superlative job making it legible onscreen. Cloud Atlas deserves praise if only for not being the baggy, pretentious disaster it could have been in other hands."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "If you're interested in the sheer craft of filmmaking, Cloud Atlas is required viewing - a rare example of a movie getting by entirely on technique and creative bravado."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Unlike \"Tree\" or \"2001,\" Cloud Atlas offers more answers than it does questions, and by the end of its nearly three-hour running time - which flies by surprisingly fast, all things considered - it feels like the most feverishly expensive late-night college bull session ever. There are glories here, but they fade in the light of day."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "For all the spectacular settings and visionary designs, Cloud Atlas left me feeling disconnected. Sad. But that's the true true."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "The movie doesn't really work, but it's fascinating in the ways it doesn't. Then again, I enjoyed the spacey insanity of the Wachowskis' \"Speed Racer,\" which they didn't even like in Asia."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Its ideas are paralleled, its themes twinned, sometimes breathlessly, sometimes fatuously, into what may be described as a 164-minute pop song of seemingly infinite verses, choruses, and bridges. Perhaps expectedly, it soars as often as it thuds."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "A grand folly that makes the Wachowskis’ \"The Matrix\" trilogy look prosaic, Cloud Atlas is a fascinating if flawed work that will leave you gasping one minute and gagging the next."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Where the book is sinuous and oblique, their film is galumphing and heavy-handed, its rare flights of lyricism stranded between long stretches of outright risibility. And yet there's something commendable about the directors' commitment to their grandiose act of folly."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "This is by no means the best movie of the year, but it may be the most movie you can get for the price of a single ticket."
    },
    {
      "critic": "Mark Keizer",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "The movie version has the exciting and challenging parts down but the moral awakening it so strenuously wants us to experience remains beyond its reach."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The result is maddening, exasperating, occasionally exhilarating – and mostly boring."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "This would-be epic is beautifully photographed, elegantly crafted and adventurously cast. Unfortunately, though, it plays like a gargantuan trailer for a movie still to be made."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Cloud Atlas is pop spiritualism, comic-book grandiosity, Zen for dummies. I can't say I didn't enjoy it on some level, but it's not the level of universal wisdom the Wachowskis and Tykwer would have us be on."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "A tale that ought to dispel the clouds of mystery surrounding life gathers them into impenetrable fog."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Most viewers are likely to be impressed more by the magnitude of the effort than the magnificence of the effect. Cloud Atlas is a Terry Gilliam movie without the kinks, a Wong Kar-wai film without the smoky dreamscape, a time-and-Space Oddity that remains frustratingly earthbound. Put it another way: this is no \"Speed Racer.\""
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Not quite soaring into the heavens, but not exactly crash-landing either, Cloud Atlas is an impressively mounted, emotionally stilted adaptation of British author David Mitchell's bestselling novel."
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 45,
      "summary": "The directors can make it fluid, comprehensible and gorgeous to look at, but they can't keep what struck many readers as profound on the page, from seeming profoundly obvious on screen, especially when every point gets reiterated six times."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2012
      },
      "score": 42,
      "summary": "Too long by at least a half hour, and both dull and repetitive as it goes on, Cloud Atlas reaches for envelope-pushing storytelling but never delivers on its promise."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Unfortunately, attempts to be original are not enough, they have to succeed, and this film's solutions tend to present themselves as alternately gimmicky and banal."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "For all its strengths, the film is cursed by an ADD-style structure and a flashy but inevitably ineffective casting stunt."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Each segment feels more like an extended trailer for itself than a sound narrative unit. Maybe this incompletion is purposeful, but it's a problem when what's invariably elided or taken for granted is the very human connection and commiseration that is supposedly the most vital force in the universe."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "For all of Cloud Atlas's pseudorevolutionary blather about upending the \"natural order,\" the execution couldn't be squarer."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The cast comes off like a third-rate stock company on the matinee after the night on which everyone got bombed on mescal (and possibly mescaline)."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "Tykwer and the Wachowskis' other twist on this karmic hokum - to cast each of their actors in multiple roles across the stories, regardless of age or race - is less successful."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "I'll grant that the film has many layers. All of them are terrible."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Cloud Atlas, surely the most incoherent waste of time and money on screen this year."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "Almost three hours long, a lugubrious sludge of mud soup called Cloud Atlas deserves a limp nod for pure guts, I suppose, but what I'd really like to do is burn it."
    },
    {
      "critic": "Karina Longworth",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "summary": "A manifesto in the form of an enormously budgeted quasi-sci-fi epic, Cloud Atlas is evidently personal, defiantly sincere, totally lacking in self-awareness, and borderline offensive in its gleeful endorsement of revenge violence against anyone who gets in the way of a good person's self-actualization. The rest of the time, it's just insipid, TV-esque in its limited visual imagination, and dramatically incoherent."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 6,
      "pos_reactions": 34,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This was a remarkable movie, and I enjoyed every minute of it. I did not read the book but now I intend to. I understand that this is not a movie for everybody, but it's a movie for adults. The music and editing was so well done and that is just a cherry on top of this homage to film, love,  life, freedom and what it all means to us. Brilliant!!!",
      "total_reactions": 40,
      "user": "BioHazardPark"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas places you in the lives of six individuals, separated by race, gender, time and culture, and establishes a feeling akin to walking into a library, filled with timeless books of the past, present and future, with no intent to leave. Each story is intelligently edited and narrated, as common themes and plot progressions flow into one another. The acting, makeup and imagery are also excellent. This is a movie about love, institution, freedom, power and the amazing simplicity of the human nature. I do believe this philosophical dreadnought could not be steered by any other than the Wachowskis, and is most aptly described by many viewers as ambitious for its scope and diversity. As one of the characters describes, \"A half-finished book is a half-finished love affair\", I would, too, feel truly incomplete if the stories met no conclusion and were stopped short. I am not disappointed in the book-movie incongruities, as these two items establish themselves with different goals and visions of the same plane. While I understand this type of movie is not everyone's cup of tea, you will most definitely leave the movie theater acknowledging that it was a few dollars well-spent.",
      "total_reactions": 22,
      "user": "Blaize"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas is a unique movie, and that should be enough to go see it. You want more? It's also emotionally powerful, funny in the right places, exciting on more than one occasion and it has a message it wants to deliver",
      "total_reactions": 24,
      "user": "gtroyp"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Never while watching a film, have I been so utterly perplexed. Even as the credits began to roll, my jaw was dropped, my eyes glued to the screen. What had I just witnessed? At that point, I wasn",
      "total_reactions": 19,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "I am in awe of this movie.  How exactly did this not get on most critics' Top Ten lists?  I loved it.  Just about the quickest 3 hour movie I have ever watched.  It was perfect.  Every aspect of it was remarkable.  So ambitious and brilliantly realized.  Surely history will be kinder to this movie than the critics were.  What a pleasant surprise.",
      "total_reactions": 8,
      "user": "hapycampr2002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "One of the only movies that has ever changed my way of thinking. Everything we do is connected to the future and how it will impact others. It gets you thinking that your life doesn't have a personal purpose, but rather a universal purpose that will affect all others someday. A beautiful, astounding, and perfect film. The masterpiece of all films for me.",
      "total_reactions": 3,
      "user": "Alexj420"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Excellent movie.  Unique, very engaging, and with a story that keeps you glued to it.  And the underlying message is one that everyone should hear, and yet many will deny they understand.  But if you like mindless--keep looking.",
      "total_reactions": 3,
      "user": "oldphoenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "A philosophical journey discussing how and why we live our lives and the ultimate repercussions of our actions on this planet. Sounds dull, you'd be dead wrong. Cloud Atlas tells many stories. In fact it tells 6 stories, each of them in different time periods, past, present and future. It follows revolutionaries in futuristic Neo Seoul, Composers in pre world war 2 Edinburgh and a group of elderly inhabitants of a dictatorial nursing home planning a jail break of sorts. Cloud Atlas isn't just adventurous and bold in its risk taking but its also informative. Cloud Atlas is an education in not just philosophy but film making and all the reasons it was created as a medium. It's the ultimate canvas where you can tell any story, no matter how ridiculous or far fetched. When I say Cloud Atlas is ridiculous it is not to ridicule it, in fact it is a compliment because it tells stories that shouldn't link and brings them together into a grand narrative that is at times naive and idealistic but never dull and always thrilling. Unlike the book the film is based on, the film cross cuts across its many tales instead of telling them in half chunks. It connects its stories through the many themes and ideas that makes the film so inspiring from love to adventure. The thing that binds these stories and makes this story jumping possible is the use of the actors in multiple stories. The actors play multiple roles through time and part of the superficial charm of the picture is spotting Tom Hanks or Hugh Grant in their many disguises or failing to spot Halle Berry as a Korean man. It's a film that is equal part fever dream and epic poem. The film unlike the book isn't so much about one life, one soul throughout the ages (although a strange birthmark seems to represent the idea of one soul throughout eternity) but about humanity, our collective consciousness through the ages instead. This film is a look into the idea of the butterfly effect, the idea that chaos theory can also be seen the other way, that one action can bring about good instead of evil for years to come. for example a self absorbed, opinionated composer (a terrific Ben Whishaw)  creates a piece of music used for years to come thanks to the actions of not just him but people long into the future. However it is a film that must build to its epic conclusion and for that reason the first hour is quite dense (dense as in full, this film is never stupid) and takes some concentration. Once you understand the characters, the ideas and stories you are being presented its easy to get lost in this idealistic look at the good we can accomplish as a race and the absolute evil we can cause by just not trying or choosing yourself instead of others. Overall its a near perfect picture because of its attention to detail and its desire to show something we rarely see at the movies, a movie that celebrates stories and the hold they can have on us.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This is a movie that affect human soul like a great symphony, It is not easy to tell a story about human eternity, but in this movie the \"holy music\" that I assume is beating everyday inside everybody's soul was successfully translated into some sort of convincing, beautiful, visual phenomenon.",
      "total_reactions": 2,
      "user": "duko_go"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "The movie starts off asking for forgiveness through, through a narrative, for telling a story simultaneously from different vantage points. I decided to give the story the benefit of the doubt, and settled in for a ride without criticising it as it unfolded.",
      "total_reactions": 13,
      "user": "Tick"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "i think it's one of the best movie's i've ever seen.  so hard to make, and they did such a good job.  it's kind of like an impossible stage play.  it has that literary adaptation quality to it, where it's almost rigid like a play at times, and yet so full of life too.  and it just keeps rolling.  it's very long and very entertaining the whole time.  i don't know what to say to make you see it....but give the movie a shot, it's awesome.",
      "total_reactions": 10,
      "user": "CalvinCrack"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Very unique movie. I was thoroughly entertained throughout! The scope and performances are exceptional. This is a MUST SEE. Ignore the critics! The public rates this movie above an 8 everywhere and believe me, it deserves it. One of my favorite movies of the decade.",
      "total_reactions": 18,
      "user": "Superduperjew"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is the best movie i've seen in years.  I'll admit that 3 out of the 5 people in my group could not grasp what the movie was going for or understand how each story was connected, but I found this movie to be engaging and keep my brain attentive and intrigued.  I liked the way it gave you a little of each story at a time and switched back and forth to the point where you're about to burst with excitement by the time they wrap everything up. It is immersive and fun, with laughs and wit trucked everywhere. If you have trouble following a seemingly random and rambling storyline or don't have an appreciation for the cosmic and endless battle of good verses evil, this movie may not be for you. I don't want to give things away or spoil the movie, but this is not a \"normal\" movie and if you don't pay attention, you won't get it and you won't like it. If you have an open mind and are looking for excitement and entertainment, look no further. Amazing movie. More than just a flash in the pan \"here's 10$ can I see some explosions and/or **** While it does have both, they are certainly not the focal poi t of this movie. Just go see it for yourself.",
      "total_reactions": 13,
      "user": "Bobaganoosh"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Epic Masterpiece - 10/10.  But, should you disagree let's see \"why\" those who would rate Cloud Atlas lowly do so:",
      "total_reactions": 13,
      "user": "harrylime1"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Probably the best movie I have seen in a long time. This movie is only for those people who are opened-minded enough to see it. It takes you on a whirlwind voyage from past, to present, to future and, the funny thing is, if you watch it with the intention of learning where your place is in the whole scheme of things, the 2 hours 50 mins playing time seem like it comes and goes way too quickly. I never got bored once and my attention stayed on the screen as you walk, drift, and fly with each character in his/her story. A wonderful vision the collaborative efforts of both the actors and directors that culminate in a movie I will most certainly watch time and time again. I'm hoping the extended version of the directors' cut comes out on blu. Read the book, it helps with the details as the movie moves just a little too fast leaving out some details that add to each story (as is expected when a novel goes to the big screen).",
      "total_reactions": 12,
      "user": "coreyg007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "To the critics who say that this is a muddled film devoid of clarity and purpose, you are wrong.",
      "total_reactions": 4,
      "user": "hjoy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Outstanding weaving of storytelling and philosophy and ontology of good and evil. It is true that every evil or good act lives on forever through the human chain of birth and death. It is a butterfly effect through time. The movie shows and tells though dialogue and subtext an interpretation of Love and Morality though time. I do not believe in reincarnation, but our deeds and our love goes on through time from our actions, for how else were each one of us born if not by an act of two other beings who met somehow in the complex web of life. The movie does require some concentration, but it is worth the effort by the lasting impression it creates in our minds. In my view, an adult \"Inception\" for mature viewers. Excellent film.",
      "total_reactions": 4,
      "user": "DECAMUS"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This was a fantastic film, one that deserves to be seen and hopefully, whether you love or hate it, you will agree. I have not seen a movie in recent memory that has critics so divided. At one end you have Ebert giving it an absolutely perfect score, and at the other professionals giving it almost a 0. The movie begs to be experienced and not described. Watching the trailer will tell you really all you need to know, and it will give you most of the story as well. This is about the thirst for freedom and finding love along the way, as some natural, unmovable phenomenon.  But it's also about simply being alive. Very worth a watch, but don't get up to pee, or you'll miss everything.",
      "total_reactions": 15,
      "user": "sirix"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is a must see movie by far the best movie of the year.  If you didn't like the movie it's probably because your close minded or you didn't pay attending. Movies like this are ahead of there time. I will be buying this movie when it comes out.",
      "total_reactions": 15,
      "user": "derekjaypost"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This movie will change you. You will love it or you will hate it, but you have to see it. Don't let the voices  of others impede you from having a truly incredible experience!",
      "total_reactions": 15,
      "user": "kamixbeat"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This movies near-perfect editing is astounding. Sure, it may be a little gimmicky, but the real masterpiece to behold is the way they seamlessly transition from scene to scene with a related topic, yet it transitions to a different experience entirely. Best way I can explain it; you're flipping the channel between 6 movies for 3 hours, but every time you change the channel it relates to the movie you switched to, and it all has a time-transcending theme. The 6 movies not only differ in time, or character, but they also differ in Genre. Historical Fiction, Romance, Suspense Thriller, Comedy, Sci-Fi, Post-Sci-Fi (post apocalyptic). How they manage to lump it all together into an ADD-reminiscent experience, yet still be successfully coherent is beyond me.",
      "total_reactions": 11,
      "user": "MusAddict"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is an amazing movie and I enjoyed it immensely.  There are commonalities in the different plots, but there's no need to strain to link them.  Using the same actors for all the pieces in roles they would normally not be cast creates unusual and unique faces - something very much missing in Hollywood.  The future-speak that some bemoan is a very cool touch.  You should definitely see this movie.",
      "total_reactions": 11,
      "user": "idioglossia"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Best movie I saw this year, probably one of the best I've ever seen. Wasn't bored for a single minute during the almost 3 hours. It had my complete attention. I can imagine why some people would not like this. It takes a certain amount of concentration and brain power to keep track of the six stories and to figure out how all of that is connected.",
      "total_reactions": 11,
      "user": "Koz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas is perhaps the most ambitious film ever made, with a masterful pay off. The spectacular inventive storing-telling is incredibly captivating. Cloud Atlas entirely redefined what a film could be. The film truly is a one of a kind masterpiece.",
      "total_reactions": 14,
      "user": "Civilization55"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I read the book about a year ago, and this movie coming out had me excited to see how the Matrix directors would treat the source material. Overall, the movie was very well put together, even to the point where I felt more informed by the movie than by the book. The editor for this film should definitely get an Oscar nomination for best editing, because the way the film is put together really helps with pacing. I could have done without the homosexual makeout scene in the beginning, but other than that it was worth seeing.",
      "total_reactions": 17,
      "user": "Fullmetal"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "An incredibly ambitious and gorgeous cinematic masterpiece. Cloud Atlas tells the story of the human experience and the transcendental traits that link us through time, race, gender, love and hate. The challenge of the movie is to not be distracted by the varying story-lines that are are at once intertwined yet wholly independent but to allow the entirety of the experience to exist as one fantastic homage to humanity in all its forms and epochs.  It is not one story but the entirety of the experience as it washes over you that you find the beauty in this film.",
      "total_reactions": 13,
      "user": "jbarkin13"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "It's somewhat difficult for me to pinpoint why exactly I love \"Cloud Atlas\" as much as I do, but i think if I were to find one thing above all else (and this is something that has been true of the Wachowskis throughout their entire career) it is that the movie is not afraid to expect a lot from its audience without trying to come of as exclusive. Far too often, big blockbuster films are sanded down to be as palatable as humanly possible. They can't be too complex or challenging or else they might scare off potential audience members. Similarly, movies that do expect a lot from their audiences generally proceed as though they are more interested in being ~artistic~ than actually engaging their audience. \"Cloud Atlas\" is a very rare mixture between the two. It is a very demanding film. It tries your patience, it doesn't try to simplify itself, and for some it will possibly offend. If some aspect of the film repulses you or you simply have a tendency to cynically disengage from films that actively try to be different or have a message, I imagine you will not enjoy this movie. And if you do wish to engage with the film on the level that it expects you to, then I can guarantee that you will feel exhausted by the end of it. But I also believe that if you do fully engage with the film, you will have a very powerful and deeply moving film-going experience. The film bounces between six different stories as a sort of stream of consciousness. The film is still somewhat chronological in that all of the simultaneous stories move along at roughly the same pace (you don't have situations where one film is climaxing while the other is still building) but the cuts between the stories ask you to multitask. Put one story on hold while you jump into another. As someone with ADHD, I would say this movie is the best way I could explain what it is like. Something in a scene sort of triggers a scene from a different story to pop out, leaving the previous story on hold until something brings it back. The movie is basically a stream of tangents that all end up moving together in the same general arc. Not only that, but all of the stories, while sharing the same basic themes, are vastly different in tone and genre. On TOP of that, the film makes use of makeup techniques that are inarguably racist in order to both maintain a sense of continuity and also to perhaps provoke that sense of racism so that we as an audience can carry that with us and connect it with our lives. This is a lot to ask of an audience, and while I acknowledge that not everyone wants to play along, the film is not taking these risks for the sake of self-indulgence. At least, that's not what I believe that it is doing. These decisions don't feel like they were made in order to be ~unique~ or whatever, but because they directors believed that they made the film better. I felt like the same conversation came up whenever they discussed how they should approach something within the film, if anyone involved expressed doubt that the audience would go for it, they insisted that they give the audience more credit than that. The film asks a lot of its audience, yes, but it's not shouting from a mountain of superiority, arrogantly proclaiming that if you don't get it than you are a simpleton. It humbly places itself into the viewers hands, respectfully asks for your patience, and then unfolds. It's true that I'm probably more inclined to be patient with this film than others might be. I've always been fond of the Wachowskis' work and pretty much all of the genres involved within the film are genres that I have some degree of affection for. Additionally, the film's unusual method of movement really clicked with me, perhaps because that tangential stream of consciousness is how my mind tends to work. But I'm not giving this film a 10/10 simply because I truly loved it, but because the movie was willing to be different in order to achieve that level of connection with the audience, even if it meant risking losing a part of that audience. And it wasn't just different for the sake of being different. Every time it did something that would probably make an executive nervous, it was for a very specific reason, and that reason was almost always \"To improve the film\". It wasn't breaking the mold for the sake of it. It was breaking the mold because there was no mold that could properly convey what this film was trying to do. The biggest problem with film (and other popular visual media) is that the creators are often afraid to say what they want to say exactly how they want to say it because it is generally believed that art should be able to speak to as large an audience as possible. The problem is that it is often misconstrued to mean that art should be LIKED by as wide an audience as possible. Even though \"Cloud Atlas\" won't work for a lot of people, it's not for lack of trying. \"Cloud Atlas\" knows what it wants to be and is very honest about it. To me, that is most admirable.",
      "total_reactions": 13,
      "user": "ddrussianinja"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "What an amazing experience watching Cloud Atlas was. The film on a visual level is astounding on so many levels. And what levels this film had. Too many critics have been saying how this film is about how we are all connected but they are mistaken. On a dramatic level I was thrilled and on a intelectual level I was engaged for three hours. When I guaranteed the Dark Knight Rises would be the best film of the year I did not know there would be as great as a film as Cloud Atlas.",
      "total_reactions": 13,
      "user": "cabrita"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Words cannot describe how amazing this movie was. I felt so many things while watching this movie and still felt them on the drive home. Go and see it!",
      "total_reactions": 13,
      "user": "RyStears"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "For a fan of the novel, this movie adaptation was a wonderful gift, much better than we had a right to hope for. It captured both the creativity and the feel of the novel and embodied its themes beautifully. I have no idea how the movie would seem to someone who hadn't read the novel, though.",
      "total_reactions": 13,
      "user": "LWJK"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "So 3 months ago I made this facebook group \"Cloud Atlas Changed My Life: The Group\" (look it up) to mingle with others who had their little minds blown by the 5 minute+ CLOUD ATLAS trailer. Now, after seeing the film last night and then sleeping on it, I feel it is one of the most ambitious, thought provoking, and dare I say \"Libertarian\" films of our time. In other words I LOVED IT. When I got home and began chatting in the group we were informed that the two editors of the trailer were hiding out in our group all along. It was the trailer that inspired me to do something about my weight and lose 40lbs since seeing it on July 27th. So I got to thank them, and I have to say that is pretty sweet indeed.",
      "total_reactions": 16,
      "user": "miknwilkes"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is simply the best movie ever made.  Nothing else in cinema history has ever come close to explaining what humanity is as cloud atlas details.  DO NOT LET NAYSAYERS detract you.  If you are a real person who makes real decisions and who has an attention span over three minutes you WILL appreciate this movie.  It touches base on every single **** thing a human could ever want.  I left the theater in tears, in a good way.  Explains all the mysteries in the world meaning it explains nothing and leaves all thought pondering questions aloft, just like we already had and like it.  GO SEE IT SHANIQUWA!!!!! ITS AMAZING CHANGED ME FOR THE BETTER",
      "total_reactions": 19,
      "user": "Nostalgic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "It's dedication to staying grounded in the reality of each narrative introduced could be this movie's Achille's heel, but it surpasses this by creatively connecting its numerous subplots. The level of performance from the actors is outstanding. To play such uniquely different characters must have been exhausting but a tremendous achievement in the end. This is a movie that you need to pay attention to while watching and even then you'll need to watch it again to miss the Easter eggs and subplots, etc  it is worth it. It makes you think about larger themes through the small details of a characters life. it tells you life can be big and amazing and sad and violent and things that start out small like a first glance can turn into soul mates who span the greatest of distances and ripple across time. To conclude: one great fantastic domino effect. And a great soundtrack.",
      "total_reactions": 12,
      "user": "Catcave"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "A symphony of film making.  Cloud Atlas tied together multiple story lines in a powerful and elegant way. There were six movements, all with intertwined themes, that tie together to create a moving piece.",
      "total_reactions": 12,
      "user": "rrohrer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I loved this movie. I had just finished reading the book which is an incredible read, the language is just beautiful,  and I was curious as to how they could film it, but they did an incredible job. It deserves to be seen on a big screen because the special effects are mesmerizing. And although they changed the structure of the book, which is triangular, the intercutting of the film actually connects the stories in a more coherent fashion. The use of the same actors over and over again is great fun and enforces the concepts of souls moving through time. It's my favorite film this year, all my friends have seen it and loved it, and we all want to see it a second time. Just beautiful and moving!",
      "total_reactions": 6,
      "user": "ErichSchoe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Great movie. At first, it is hard to separate each period, as it happened with Memento, but after a while your brain adjusts everything at its time automatically. Like watching six movies all in one.",
      "total_reactions": 3,
      "user": "sLm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "It was epic, funny, visually stunning, dramatic, suspenseful, mysterious, intriguing, bewildering, and ultimately entertaining from start to finish. The ethical ruminating was mostly subtle, with none of the ham-fisted navel-gazing of the second and third Matrix movies. And if you were a fan of the first Matrix, then the Sonmi-451 sequences will have you riveted. A unique movie adapted from a unique novel.",
      "total_reactions": 3,
      "user": "marooncritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Ambitious, featuring six stories all set in various time periods. Often times with a film like this, there is always that one storyline that is just not as good, or in the case of Cloud Atlas, 2 or 3 storylines that fail to compare to the others. That's really the main problem I had with this film, the performances, music, and visuals are all top notch, but not all the stories were that engaging, diluting the effectiveness of the major themes. I still really enjoyed the film. My favorite parts were set in Korea and the 1970s.",
      "total_reactions": 3,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Possibly one the greatest movies I've seen. The Wachowski's have done it again. I created an account just for the sole reason of writing a review on this film. It inspired me so much. This is what visionary cinema is all about. Yes, its 3 hours long. Yes, it's complex. Yes, there where moments where I couldn't quite work out what was happening, however, I accepted this challenge and the rewards were immense. If you are awoken, you will see the undercurrent to this movie. That's the people giving it 10 scores. Those who give this anything less than 5 should perhaps restrict themselves to movies such as the Expendables or the Transformers franchise. Something that lasts 1hr15mins to keep the attention and with a plot line you could follow as a 5 year old. This is NOT that film. I've never watched the same movie twice at a cinema.. this will be the first. It's a master piece and will be a cult classic. And the soundtrack is glorious!",
      "total_reactions": 3,
      "user": "notjustacritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Incredibly incredible and amazingly amazing. Some say that the six stories are not connected, I would say you are not paying attention. The stories are so separated and united at the same time, all is about the theme of the film that \"our lives are not our own, we are bounded to others. Past and present, by each crime and every kindness, rebirth our future.\" Those are the lines that connect all the stories so tightly.  It's about Karma and causality, that we still have to be responsible for what we did in a way or another, sooner or later.",
      "total_reactions": 3,
      "user": "shunxu"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "It's obviusly that some critics don't understand this amazing  masterpiece. Cloud Atlas is one of the best movies of this year. The trama is complex but is excellent the development. The performances of Tom Hanks, Halle Berry, Hugo Weaving, Jim Strugess, Hugh Grant and the rest of the cast are awesome. And the screenplay, uff, is excellent. Cloud Atlas is one of the most wonderful movies of this year.",
      "total_reactions": 17,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Not quite understanding all the hate for this film. It's really like nothing else I've ever seen, with each parallel story differing in scope and scale but matching in emotion and entertainment value. This movie gives you a lot to think about when you leave the theatre, but while you watch it, it washes over and envelops you like great cinema should.",
      "total_reactions": 17,
      "user": "Smick"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "\"Impressive\". That's the best description I could come up with after being asked about my thoughts on Cloud Atlas immediately following the film's second-ever public screening in September at TIFF. This may be one the most ambitious and epic films I've ever seen, demanding rapt attention from viewers as they're taken on a two hour and forty three minute odyssey that spans the globe over 500 years and hopscotches between numerous interwoven storylines that incorporates just about every film genre available, featuring actors playing several different roles each. Cloud Atlas is based on British author David Mitchell's best-selling 2004 novel and was a huge challenge for the filmmakers to adapt and finance (its estimated budget of over $100 million also makes it the most expensive independent film ever made). The architects of this beautifully twisted madness are directors/writers/producers Tom Tykwer (Run Lola Run) and The Matrix's Wachowski siblings, Andy and Lana (Lana was Larry until a gender transition that was completed about five years ago). The Wachowskis, notoriously press shy, were surprisingly on hand (along with Tykwer) to introduce the film's second screening the morning after its star-studded TIFF world premiere on September 8th. A movie this expansive should have a large cast, considering how many characters appear - not so in this case, though. Principal actors Tom Hanks, Halle Berry, Hugh Grant, Jim Broadbent, Hugo Weaving, Jim Sturgess, and Xun Zhou each take on multiple roles that plays loose and fast with the actors' ages, races, and genders (Susan Sarandon, Keith David, James D'Arcy, and Doona Bae also have smaller roles). Having so many dimensions to explore with all of their characters must have been acting nirvana for this lot. For the most part, they pull off the various requirements of the roles, many of which require a significant amount of prosthetics and makeup. Several of the roles were so well disguised that I was completely clueless that a certain actor had played the role until the end credits visually made some of the big reveals. Sticking around until the end is an absolute necessity for Cloud Atlas - the oohs and ahhs from the theatre audience as they discovered who actually played some of the parts was a wonderfully unique filmgoing experience for me. For all of the positive aspects that the race bending and gender bending idea brings to the film, there is the distinct whiff of gimmick attached to it. Things do get a little silly when you have Weaving seemingly playing an Asian character whose makeup produces more of a Vulcan look (which may have been intentional on the filmmakers' part), as well as in full drag playing a Nurse Ratched-like character. The latter obviously has parallels to Lana Wachowski's own life and although the nurse character provides some decent laughs, I was a little hung up on how it seemed one of the character's main functions was to generate laughs purely based on the surreal sight of Weaving playing one truly ugly looking woman. Perhaps I'm reading too much into it. Weaving does provide one of Cloud Atlas' most memorable roles, as the seriously creepy Old Georgie, who terrorizes one of Hanks' many characters. Hanks does some of the best work I've ever seen from him, playing four different characters that range from an unscrupulous doctor in the 1800s to going far against type with maybe the film's standout character, a modern-day thuggish British writer named Dermot Hoggins who gets the ultimate revenge on a critic for a bad review. Berry is excellent with her main roles playing an ambitious reporter in 1970s San Francisco and a political figurehead (from what I could grasp) aligned with one of Hanks' characters in the far future, in one of the film's few storylines that doesn't quite work. Also great is Broadbent as both a composer and playing a man tricked into living in a retirement home, who provides the film's best comic relief. The weighty Cloud Atlas themes of interconnectedness, philosophy, reincarnation, oppression, and destiny, along with the film's highly challenging pace and complex non-linear storytelling construct will prove daunting to many - I was certainly lost a number of times. This is the type of daring film that demands multiple viewings to completely grasp the filmmakers' grand scope and there's nothing wrong with a little audaciousness from Hollywood once in a while. Even with a big-name cast, it'll be very interesting to see how the otherwise difficult-to-market Cloud Atlas will fare at the box office come late October.",
      "total_reactions": 17,
      "user": "MediaboyMusings"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "I think cloud Atlas was a non stop action heart pounding movie, I love everything about this film. I think it should be up for best picture. The academy awards choose a movie this should be the one. The graphics were amazing and the frightening high places and death stunts were so frightening. There were plenty of wonderful story lines from so many amazing characters in the different roles they all played in the pass and the present. One have to pay very close attention to this movie to understand where it is going at or you will miss the point, plain and simple. Halley and Tom did a splendid and job in acting and in action parts together. This is one movie I have not seen made before or I haven't seen a remake of this film either. This film was very original and very humorous at times. I also think the elderly seniors were very hysterical and very lovable, so hats up to them. I can not wait until it hits DVD.",
      "total_reactions": 13,
      "user": "Lynette"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Once you suspend your desire for a coherent story, you can relax and enjoy how the movie as a whole advocated a coherent theme. While the constant bridging between disparate stories can get on your nerves if you're looking for a full-film length fleshed out arc for each character, when you get upset over that you miss the greater beauty of the movie. Relax. When I focused on the big picture I truly enjoyed it.",
      "total_reactions": 13,
      "user": "19ben90"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Not a good film for the dumb. What you are experiencing is a complex weaving of lives, all of which are basically the same, lived from different points in time and space. The best way to understand the film is to walk around a populated area and image yourself as the other people. That old black woman, I was her once. She was me once. And so on. \"Our lives are not our own.\" It's not all THAT complicated. But that's the gist of the film. Reviewers who didn't like how it was done didn't stop to think about why it was done that way. That is exactly why it was done that way.",
      "total_reactions": 5,
      "user": "frugal_frogger"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Luminous but nearly undone by its own ambition, Cloud Atlas inspires nonetheless. I've read the negative reviews from a very small number of film nerd nitwits, and I seriously cannot comprehend the vitriol. I saw this film with a bunch of Hurricane exasperated New Yorkers in a packed theater, and the audience was stunned and riveted. Just see the film.",
      "total_reactions": 5,
      "user": "Jude0013"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas was a great movie, although obviously not a movie for everybody. It makes you think and easily fills its two hour, forty-five minute run time. The acting is spot on and the story is compelling. I will certainly be buying this when it comes out. Best movie I've seen since Hugo.",
      "total_reactions": 5,
      "user": "ironman443"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "If you have no philosophical, reflective bones in your body I doubt that you will like this movie.  There is a steady flow of poetic thoughts about the meaning and mess of our lives scattered through the movie.",
      "total_reactions": 5,
      "user": "iTheViewer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Loved this movie! Truly one of the best movies I have ever seen. I can see why it might not appeal to everyone but I think most people will appreciate the unique story and sheer entertainment value of this movie. It has a little bit of everything that makes a movie great!",
      "total_reactions": 5,
      "user": "msbooboohat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I just want to tell the world what a wonderful movie that is. I came out of the movie theater as a changed man. Can't stop thinking about it and I'm definitely going again as that was the shortest 3hrs I've ever experienced. I want, no, I NEED more. Already bought the book too. Do yourself a favor and go see it. Now.",
      "total_reactions": 5,
      "user": "andvaree"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas is going to seriously divide audiences. It is one of the most ambitious films of all time, and every once in a while it falls flat under the weight of it's own ambition, mostly due to hugely inconsistent makeup. But it makes up for that by pushing the boundaries of storytelling, editing, artistic vision and hugely personal ambition. It's hard not to admire and respect this film for reaching to the stars in a time where very few movies try anymore. It flows wonderfully like a beautiful piece of music, which makes the near 3 hour running time a luxury and not a boring chore. We need more films like this, or else I have great fear for the future of cinema",
      "total_reactions": 5,
      "user": "Brasiliansoxfan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "One of the best pieces of art that I have ever perceived. Weak minds, or distracted viewers, will give this film a bad name, please do not listen to them. I have the impression that this film has spoiled me; from now on I want my art as sophisticated, complex and captivating as this. If anyone who had something to do in this film reads this by any chance, I just want to tell you thank you. : I sometimes cry at films, and at the part of ''how do you imagine heaven?'' and the door being opened, I asked to myself ''why am I not crying?'', and realised that because it was something too beautiful to spill tears for; the music, the scene, the movement, the nods that were tied to that moment, simply amazing.",
      "total_reactions": 5,
      "user": "papirri22"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas may be the best movie the Wachowskis have ever made... and nobody is seeing it.",
      "total_reactions": 5,
      "user": "hamlet9000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "As polarizing as The Tree of Life, Cloud Atlas is an original and ambitious film, blending too many genres to count and making bold risks that should only be admired. Taking place in the distant past, the far future, and everything in between, the movie tells six stories that are all interesting in their own right, slipping between the separate threads with surprising ease. Objectively, Cloud Atlas is superb on a technical level, a fact that should not go ignored. Another fact: the visuals are stunning, benefiting from the wonderful cinematography. What is more, the acting is terrific, with Tom Hanks and Halle Berry really giving their best performances in recent memory. As I hope the academy recognizes, the makeup in Cloud Atlas is masterfully done, rendering even the most recognizable actors unrecognizable. On one hand, Cloud Atlas is not, as some critics have tried to label it, pseudo-intellectual garbage . On the other hand, Cloud Atlas is not a pretentious film that prides itself in being too \"smart\" for the majority of its viewers to grasp, hiding behind the guise of \"art\". Fortunately, the plot of the film is easy to grasp if you are paying attention, and there is far less ambiguity than you might expect. Most importantly, paying nearly three hours of close attention is worth it; Cloud Atlas builds to a sensational, emotional climax that is impossible to forget.",
      "total_reactions": 5,
      "user": "saucyninja007"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "This multi-level film is based on the novel of the same name, which interweaves 6 stories from various time periods with actors playing multiple characters. This means elaborate makeup, as they cast Tom Hanks, Halle Berry and other cast members in as many as 6 roles. The messages of universal continuity and connectedness are hammered home as the drama and action unfolds. While it's realized with masterful skill by the Wachowskis (best known for the \"Matrix\" series) and Tom Tykwer (\"Run Lola Run\"), the slow-moving stories take up almost 3 hours. Visually, it's often spectacular (despite the sometimes embarrassing makeup), but as entertainment or inspiration it gets downright tedious.",
      "total_reactions": 12,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "From reading the mixed reviews, I expected Cloud Atlas to be an incomprehensible, wildly uneven mess of a movie, but that could not be further from the truth.  It is an ambitious triumph of film-making audacity.  If you pay attention, there is a strong theme - that in life one must make choices, and these choices are irreversible .  Those that make courageous choices are celebrated.  We also see that the consequences of brave choices are variable, but that each choice a person makes has consequences that ripple out across whole worlds of people.  The concept of spiritual connectedness is explored in great depth throughout all six interrelated stories.  The ending is very moving.  If you are contemplating seeing Cloud Atlas, but are afraid it will lose you in its complications, don't be.  It is one of the few complicated epics I've seen that really works, even if you are left with questions afterwards.  A really fine return to form for the Wachoiwski siblings and Tom Twyker, and a wonderful, sophisticated movie-going experience.",
      "total_reactions": 7,
      "user": "dhearn3"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is a fantastic attempt at adapting a book which many considered unadaptable. The disparate mishmash of genres that make up the movie somehow come together brilliantly when taken as a whole. Of course, there are 'weaknesses', as is the case in almost any work of art, but that does not prevent this from being a brilliant, audacious movie. We need more risk taking and original films like this from the big studios!",
      "total_reactions": 7,
      "user": "cameron326"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "What to say about 'Cloud Atlas'? It is perhaps the most inspiring film I have seen in a long time. It's not perfect, but I couldn't stop smiling once the lights came back up.",
      "total_reactions": 12,
      "user": "NathanR"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "This is an outstanding epic of a movie. Daring, brilliant, compelling, tragic, triumphant. It is one of the finest movies I have ever had the pleasure of watching.  This is a genre busting work of mad genius that does justice to the book while being completely satisfying as a stand alone telling.",
      "total_reactions": 12,
      "user": "zer0sum"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "If you don't have an imagination, like to ponder, dislike thinking or feeling, don't watch this movie. This is one of those movies where you may have to watch a couple times to see all that it has to offer, for me that's a good thing, but some may not like that aspect.",
      "total_reactions": 8,
      "user": "ZenFury"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Cloud Atlas is a daring film that juggles multiple story lines strewn across different time periods while wrestling with the notion that all mankind is bound to one another across space and time.  It's never dull, but it never quite enthralls either.  The stories never really feel connected to each other which is the film's ultimate downfall.",
      "total_reactions": 6,
      "user": "BKM"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Anyone who doesn't like this movie is just stupid.",
      "total_reactions": 6,
      "user": "seantimothy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I rarely use this rating. But I left the theater saying and feeling that the movie was PERFECT. Well paced and cast. The Movie has so many small details that cause you to want to go back and rewatch it over and over again.",
      "total_reactions": 6,
      "user": "Nami87"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "This is the type of movie where the first time you see it, it is merely an introduction.  I can see myself watching it countless times over and over on blu-ray picking up things I did not realize before.  AWESOME film. It is a shame that so many critics blasted it. If you check the movies that the critics that blasted this one rated high, it is evident that they have no business being critics lol.  I won't give it away, but there is a hilarious and truly gratifying scene involving a critic. I am guessing this scene is part of the reason some of them were sour in their reviews. 10+",
      "total_reactions": 6,
      "user": "ekhatch1435"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Cloud Atlas was a singularly phenomenal achievement; a testament to the presence and power of human dignity across time, cultures, genders, and genres, and the possibility of redemption for even the most sinister souls. I am unequivocally in love with this movie.",
      "total_reactions": 6,
      "user": "mikeybelcher"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "It seems that most of the negative reviews about the coherence between stories are similar to complaints about Inception when it first debuted - it was too confusing to follow all the different layers.  If you have a small attention span and cannot follow complex plots, skip this movie and catch something a little simpler.  If, however, you are able to follow along (not a difficult feat, mind you), this movie will astound you.   It's beautiful and moving in ways that not a lot of films are, and it will definitely stay with you for a while.",
      "total_reactions": 6,
      "user": "lexwaltz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "Really disliked it. Couldn't connect or relate to any of the characters. The 6 stories were a low blow and a badly made one at capitalism, but they didn't seem to connect at all. The stories were bad individually and collectively they are worse. It's three hours but it feels like ages. In my opinion it was also one of the worst performances made by Tom Hanks...",
      "total_reactions": 6,
      "user": "catrapi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Cloud Atlas -- I don't get it. While I was mesmerized by many breathtaking scenes and actor's playing different roles, I just didn't get the point of the whole story. None of the stories made me care. I found myself trying to figure out which actor was behind some heavy make up.",
      "total_reactions": 4,
      "user": "marioping"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I went into cloud atlas with fairly high expectations. A close friend of mine was raving about it being a return to form for the Wachowskis. It's now been around 4 days after leaving the theater and the movie is still on my mind. I was amazed to see the backlash the movie received from the critics. In my opinion, it was a remarkable and moving epic, evoking themes rarely visited in cinema let alone any art form. I'm planning on seeing it again; it is easily my favorite of the year.  It seems that the people that came away disappointed were focusing on the details of each individual story not realizing that the big picture is what this move is all about. Don't get bogged down with the reincarnation theme. The spectacular stitching of stories and tone makes the six stories into one; strengthening the motif of interconnectedness of people between the times. I rarely get choked up when watching movies. Cloud Atlas is an emotional masterpiece.",
      "total_reactions": 4,
      "user": "Defacto"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "They say its too long.  They say it doesn't make sense.  I was very surprised by these comments.  At 3 hours I didn't want it to end.  It takes you through the human experience and it doesn't spoon feed you.  if you snooze while watching you won't get it.  It's about getting involved with the stories.  I Just loved it. Saw it twice and enjoyed it even more the second time.",
      "total_reactions": 4,
      "user": "Lsherman3"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "The movie is very complex, it consists of six different stories occurring in different time periods, but all of them are somehow connected to each other. The stories keep you thrilled during all three hours of this movie. There are some deep ideas here, though I'm sure that a lot of people will find this movie boring because of lack of action scenes. Summing up, I'd say that this is probably The Best Movie in 2012.",
      "total_reactions": 4,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "It's crazy and mind-blowing.",
      "total_reactions": 4,
      "user": "trevortalks"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "I was so excited to see this film and i ended up being pretty disappointed. I think it was a good idea but executed entirely wrong. I will give a nod to the actors, it was not their performance that ruined it for me but the storyline was just plain confusing. It kept jumping from era to era and with the same actors playing mainly different roles I had trouble remembering what story I was in. I would suggest seeing it but prepare to be fully confused for the 20 minutes and then slightly confused for the rest. I think it takes a certain kind of person to like this movie. It just wasn't my cup of tea.",
      "total_reactions": 4,
      "user": "natmazz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "A genre-breaking classic!!!! One of the best movies I have ever seen!!! EPIC!! Tom Hanks is at his top of his career, and I am sure that in the next 3 years he will have won an Oscar!!! Watch this movie!!",
      "total_reactions": 4,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Impressions and expressions do matter. I did travel in past lives using new method techniques and this motion picture conveys something like that. I really admire the impact this movie caused in me. I would say it is the truetrue continuation of the matrix series.",
      "total_reactions": 2,
      "user": "Zsolt77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "How does this movie show how one persons action changed the future? Wouldn't you need to shoot two endings for that? This movie is confusing and annoying, the only decent timeline is the Asian lady's in the takeout shop. Everything else seems more like a filler. Oh the racist boat timelines also good. But everything else just dampens the major message of the film.",
      "total_reactions": 2,
      "user": "kris2fur"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "A confusing morass of six story lines and a seventh that serves as epilogue and prologue--this film gives new meaning to the question, “What just happened?” A cast of eloquent and well-known actors plays multiple roles where in some cases they are virtually unrecognizable. The most outrageous include Hugh Grant as a tribal chieftain who is a confirmed cannibal, and Tom Hanks as a murderous physician from 1849 as well as a frustrated and equally murderous 2012 book author who kills his harshest critic at a  party by throwing the arrogant and presumptuous cad over the balcony. Hanks is also a father figure in a primitive clan in 2346 Hawaii, although there he is highly recognizable, even though he is speaking a barely comprehensible pigeon English that can only be described as Hillbilly Jive. (To say “that's the truth” is “that's the true-true.”) Strangely enough, Hanks lapses into standard English in a few instances where he has to explain an important plot point. Subtitles would have been beneficial.",
      "total_reactions": 2,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Watched it and I ended up with an head ache in the end because of spending 3 hours so much concentrated to see how would the plot turn up in the end, just to face some \"nice\" and \"profound\" truths about stuff we see in so many movies. Stuff like, \"believe in yourself\", \"never give up\", etc etc. No greeeeat revealing truth or something that tied all stories. Yes, the movie starts and ends with about 4 or 6 stories, all mixed up and you just learn whats up along the way  we, the viewers, are totally left in the dark. 3 hours watching a movie to see what it leads in the end. It's frustrating. I rather see Dances with Wolves enjoying all the movie and not wanting to see the end because it was a cruel one, rather than waiting 3 hours to see if what I've watched was worth the wait and find out there's nothing interesting about it. The acting was nice, nothing wrong with it. Just the plot and how it was told and its end.",
      "total_reactions": 2,
      "user": "jamesensor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "If the source novel from David Mitchell is claimed to be \"the most impossible one to be adapted to a feature film\", the true grit behind the director trio alone merits some accolade. But the critical box-office feedback firmly suggests they will never retrieve the gargantuan budget (over 100,000,000$ for production and nothing else), while being under the barrage of divisive reviews from the critics, an ominous pre-watch hunch could never be dissolved until I finally watched it on the super-big screen (not as large as an IMAX) in the cinema, and I must confess it comes out far \"stunning\" than I had expected.",
      "total_reactions": 2,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Cloud Atlas is a curious film. It sets its ambitions to astronomical levels but at the end of the days does what it does well but is not at all a revolutionary film nor is it free of flaws. There is an emotional prize at the end if you can bear with the long convolution plot with six distinct stories played by a handful of the same actors and actresses that transcend race and gender. My biggest gripe with the movie was without a doubt the inclusion of unnecessary scenes in the movie. Sure, the 1936 plot involved a bisexual male but did they have to really articulate homosexual innuendos to such degree? Its one thing to vouch for gender equality rights and another to gross the crap out of the audience. Every single person in the room who saw this film with me felt extremely uncomfortable at the gay scenes involving the 1936 music composer. I mean, sure he's gay we get that and we can empathize with his lovelife but I felt that the Wachowski's went overboard with the 'feel sorry for homos' stuff. On the other hand, was the revealing if mercifully brief sex scene involving Sonmi really necessary? A kissing scene would have sufficed. If I want to watch the intimate shots of an Asian woman GRINDING on some guy's penis, I would simply go to a porn site. Oh and what the hell is with the White-guy-with-Asian-makeup-to-make-them-look-Asian **** I dont mind the gender swaps in some of the plotlines. In fact, it just shows how talented actors like Weaving, Berry, Hanks and Grant be. Putting prosthetic makeup on a white guy to make him look Asian is not only laughable at viewing but is also ultimately offensive. Why not just hire a Asian actor? Would the plot really have suffered if they had not used the same actor seen in other plotlines? Apart from those little niggles, the film excels in other departments. Cinematography is excellent, the acting brilliant and the film score...one of the best in recent times. I just felt that the Cloud Atlas Sextet is ultimately underutilized in the film as a whole. Its often too faint to be heard or too brief to make an impact. Thankfully, the credits serves this purpose but at the end of the day, had they used the score more and in appropriate scenes, I felt that the movie would have benefited a lot more. While all six plotlines are great, in the end, the ones that felt most well done and enjoyable are without a doubt Rey's 1973 plot, Cavendish's 2012 plot and the Post-Apocalyptic Zachary plot. On the note of Zachary's story, it actually got me intrigued on the premise of it - so apparently the world collapsed under some cataclysm and humanity had been reduced to primitive tribes and a handful of still advance humans. I would've love to hear more about what happened at The Fall, how the Prescients had survived this and where they were in this era, what happened to the empty lands of the world after The Fall and on the colonies on the other planets. All in all, Cloud Atlas is a brilliant film that rewards the viewer with an emotional gift but at the expense of sitting through nearly 3 hours of elongated  plotlines filled with action, drama and dull, unnecessary moments. This should've been a 2~2.5 hour film in this standard OR a 3 hour that's filled with info. Instead we get a 3 hour film that is essentially a 2 hour film stretched to its brim with rudimentary moments. You may hate it, you may love, but at the end of the day, it will have an impact on your movie-watching experience. An ambitious title that could've been a lot better had its significant flaws been ironed out and the Cloud Atlas sextet been utilized more frequently.",
      "total_reactions": 2,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Cloud Atlas is a visionary wonder. It is a movie that gives you so much and even at a 3 hour length, the six story lines each have their brilliance. A movie that connects in so many ways.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "Ambitious but ultimately flawed.  Long stretches of near endings, six separate story lines to keep track of, and all interconnected to the freedom of human blah blah blah....The two hour mark I surrendered.",
      "total_reactions": 2,
      "user": "JamesCannon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "As if Speed Racer wasn’t enough, the Wachowskis were able to convince Warner to fork over hundreds of millions of dollars to embark upon the mission of Cloud Atlas, an impossibly ambitious adaptation of David Mitchell’s novel that spans space, time, and all varieties of viewer patience. Any film that focuses on cyborgs and spacecraft will appeal to a certain sci-fi demographic, but Cloud Atlas is  ironically enough  all over the map, just as interested in secret early 20th century gay affairs as it is in robotic ethics. It’s fascinating to watch simply because the Wachowskis (along with co-director Tom Tykwer) swing so wide they can’t possibly pull it off. Enlisting A-listers like Tom Hanks and Halle Berry to play multiple parts  some of which involve Cro-Magnon growling and grunting  and putting their effects team to work with gusto, Cloud Atlas quickly becomes fascinatingly big for its britches. This is kitchen-sink filmmaking at its most audacious: it can’t be argued that Cloud Atlas goes out of its way to do everything it can to connect with those tolerant enough to stomach it. There are cavemen and Farrah Fawcett-Majors haircuts, futuristic automatons with delusions of grandeur, gruff musicians and the suicidal boys who love them, airplane explosions, ultra-vivid car crashes  again, Cloud Atlas has a lot of dramatic real estate to offer. Yet while its vastly ambitious intentions of representing the implicit entropy of the universe are uniquely inventive, the whole thing feels like an expensive, convoluted mess. But sometimes grandiose missteps like Cloud Atlas end up being ingenious time wasters. On Blu-ray, experiencing the Wachowski/Tykwer vision frequently prompts viewers to ask themselves, ‘Who green-lit this?’ Any movie with Tom Hanks’ name above the title is bound to sell a ticket or two, but fantasizing about Warner brass seeing the final print of this kaleidoscopic rubbish is too delicious to resist. Let’s leave it at this: Cloud Atlas is a mess, but few movies from 2012 were this jaw-droppingly stupefying.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "This movie is one of the most polarizing movies right now. It's basically like Animatrix with 6 mini stories that's related to each other. The environments for each timeline is appropriate, the standouts being the 5th and 6th story which takes place in the future with awesome futuristic technology that I soooo want to have. One problem though, this movie is a complete mess. It regularly jumps all over the place from the past to the future then to the past again that I can't think of any other thing to say but \"what the hell does this movie want to be?\" Every timeline has different themes to them. First and second story is drama movie, 3rd is suspense thriller, 4th is a comedy,  the 5th and 6th story in the future is all action. The movie jumps back and forth between all the stories that it's just a complete mess. I tries to link them together by having the themes when it jumps similar, eg: a battle in the 6th jumps to a battle in the 3rd, but in all honesty it's completely unnecessary. The theme of the story is the first story leading to the next will influence the actions of each story's main characters, and that's it. It's better to just play it in order from the first to the last story like Animatrix or some other short movie compilations so it's easy to follow and fun to enjoy. Maybe one day someone on Youtube will do that, I'm looking forward to seeing these stories in order so it'll be more enjoyable to follow.",
      "total_reactions": 2,
      "user": "Jones21"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "The movie was nothing special. It was 40 minutes longer than it supposed to be. The stories (and the story as a whole) was cliché ridden and very predictable. The \"meaning\" or \"message\" of the movie could be told in 20 minutes. I did not like how the directors cast their actors to different sexes, races. I think it was very distracting at some points. I did not like that some stories were too \"funny\" (retirement home storyline) and some stories were very dark in tone (Neo-Seoul storyline). I didn't feel the stories were coherent enough. Maybe with less directors it could have been a better movie. Overall average.",
      "total_reactions": 21,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "It tries too hard to tell 6 stories that simply are not interesting either independently or related to one another.",
      "total_reactions": 18,
      "user": "MANDRiL"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Stayed true to a book that excited me and surpassed my expectations as a movie.  Some of the make up was stretch- Hugh Grant as a Korean and Bae Doona as a freckle-faced redhead were disturbing.",
      "total_reactions": 8,
      "user": "Bulsajo"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "When I went to see this film, I had just finished the book, and I decided to be mindful of the fact that the book is so uniquely structured and long, and as most people stated before the movie came out, \"virtually unfilmable.\" So let me start with the good: I have to applaud the filmmakers for their ambitious attempts and I don't consider the film and utter failure, however: they made some fundamentally bad decisions, starting with the cast. It's not that I hate the actors they chose (I have neutral-to-generally-positive feelings towards most of them), it's how they chose to cast them for multiple roles: they were trying to instill the idea of reincarnation, which I think they conveyed just fine in their many many overdone narrative monologues. I also found the choice to cast actors for multiple parts of such different races distasteful: I hear people talking about the film deserving best make-up awards, but I did not, for a moment, believe that any of the characters looked like the race they were supposed to be portraying. The attempts were unsuccessful and frankly, to me (a European-Asian-American), genuinely offensive. The actors themselves, were neither terrible nor great. The intercutting of the different scenes was, for the most part, clever, and probably the best way they could have translated the structure of the novel into filmic language. There are also immense plot changes that I won't even bother to get into, because they alone are not my biggest gripe with the film. Its biggest flaw is that it robs the book of its ideology and turns what is a very complex narrative into what is in comparison, a banal film about interwoven love stories. David Mitchell expressed his full support for the film, but if I were him, I would be appalled at the overromanticized diluted three-hour mess the filmmakers turned a great novel into.",
      "total_reactions": 19,
      "user": "ptbaur"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Ever since the first time I saw the trailer for this film, I've been intrigued as to how such an intertwisting of differing tales could possibly be portrayed coherently and, more importantly, meaningfully on-screen (or in any medium, frankly). Intent on finding out, I decided to read the book before the movie was released. I was much exhilarated by the boldness of the book, and only slightly disappointed by the weakness of some of the stories portrayed there. I say this not because the movie reflects such weaknesses, but because it takes the weaknesses and turns them into wild, weeping, glowing success. While the book follows each tale in a tiered, orderly fashion - alphabetically in chronological order: ABCDEFEDCBA respectively (A being the 1830s, F being some unknown date in the deep future) - the movie twists and contorts the entire story by switching almost randomly between each tale in a meaningful and telling way. Where in the book, a story may end on a somber and somewhat uneventful note, the movie wraps that ending amongst other happenings from the other stories to provide context the book fails to adequately capture or express. Albeit, this is mostly done by much-abbreviating each story and condensing general plot structures to super-saturated levels compared to the book's meanderings. Nevertheless, the movie does not fail to capture the essence of each.",
      "total_reactions": 6,
      "user": "MarkWarden"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 0,
      "text": "I have walked out on 3 movies in 46 years. 1. Eyes wide shut. If youve seen it you understand whether you want to admit it or not.",
      "total_reactions": 6,
      "user": "thaistick"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "This film is vast in scope. The downside is that, as a result of stretching so vast, some of the plots become rather thin. However, the synergy of these stories woven together still left me feeling like I had seen something epic and powerful. This movie has some staggering flaws that prevent it from being the masterpiece of cinema it could have been. Character development is one of the things that were spread thin, and in a movie like this, it needs to be paramount. The moral themes of the movie have all been beaten to a dead horse by other films. They're important themes critical to our worldview, but in Cloud Atlas it just comes across as preachy and obvious, which almost belittles the importance of these themes. On the plus side, the visuals and directing are amazing. Despite the setting shifting so drastically, they made all the stories somehow be consistent and interwoven well. That was critical in the main theme of the movie that \"everything is connected.\" That theme has been done in other movie and television shows before, but Cloud Atlas has at least done that one exceptionally well, although on first view it can be difficult to piece it all together. I consider myself a fairly intelligent viewer: I was able to watch things like Inception and Looper without an issue following the plot. But Cloud Atlas left me scrambling to put the puzzle pieces together. I'm still not sure if this is due to bad writing or an incredibly good job at being cryptic and subtle. For a movie that tries to connect everything, it will be mindbogglingly difficult for most viewers to do so. Most will give up and just see the stories as an incoherent, garbled mess. Fortunately, the more I think about the film, the more I realize about its connections. I might even watch it again, despite its 3 hour length. The person I watched the movie with absolutely hated the film and would never consider watching again. But I'm a patient person who likes these kinds of movies, even if they are a bit over the top and contrived at times. If you have no problem with the willful suspension of disbelief and love longwinded but heartfelt fantasy movies, definitely see Cloud Atlas. If you have an \"ADHD\" approach to media, you might want to steer away. This movie is not for the impatient. It's for the inquisitive--those who love to keep wondering long after the video stops rolling. Basically, if you liked the ending of LOST, you might like Cloud Atlas. Vice versa... perhaps not.",
      "total_reactions": 3,
      "user": "aleatoric"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This is probably one of the greatest movies I've ever seen. The problems with it are very minor that I see people making a large issue of, or it's that they didn't catch what the movie was portraying. Which I don't blame them. I didn't see nearly as much on my first viewing. The stories are very well tied together despite how it may make it look like they're not. They tend to focus a lot more on the storytelling than they do on the actual links between timelines. Understandably so, for the movie was already a bit long.",
      "total_reactions": 3,
      "user": "MathewRD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "I love the Wachowski Bros., but they should've made another movie after a 4-year absence since 2009's critical and commercial disappointment which is \"Ninja Assassin.\" I saw the movie this weekend and it was supposed to be 3 hours, but 2 and a half hours? Well, I got a mixed feeling about Cloud Atlas. Some reviews were good, others having difficulty on why the action almost takes it to new heights. I knew it was a disappointment for both Tom Hanks and Halle Berry since it can't match any of the Matrix success. But I'll just have to wait for a rental.",
      "total_reactions": 3,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "The Wachowski Siblings and Tom Tykwer join forces, and they deliver their best work since The Matrix and Run Lola Run, respectively. Cloud Atlas was quite an undertaking that tackles 6 different storylines from 6 different timelines; some of which hosts different genres - ranging from dark comedy to broad sci-fi action. Each story contains the reincarnate of all the main characters, which spans race and gender. And thanks to the divisive make-up designs, the actors were able to cross these demographics and respectively play their reincarnates (or past lives). This was such a creative move made by the directors and I do applaud them for that. I question the degree of connection between a few of these story arcs; but the film was made with so much structural complexity and such grandiosity, it",
      "total_reactions": 3,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "It has been interesting to see the great divide among critics on this film. I have to say I can understand anyone who either hates or loves this film. This is because I fall in the middle in so many areas. This film is divided into 6 distinct parts with most of the actors playing a different character in each section. This is both the problem and everything that is right with this movie. There are 4 sections of this film where the story is extremely intriguing, the acting is spot on and there is a nice emotional hook at the climax of the story arc. There is one time period that I wish would have been left out of the movie all together. I believe it is meant to be the comedy relief of the film. Unfortunately it doesn't get any laughs, has 3 or 4 characters that are reprehensible, and doesn't seem to be needed to tie the other stories together. There is also one story line that sums up the way I feel about the movie quite nicely. The plot in it is not particular interesting, but it does have one of the better characters in the movie in it, and is very necessary to tie together some of the other time periods.  Much has been made about the makeup in this movie and again I see what a lot of people have found disturbing about some of these makeup jobs, there are 4 that are really poorly done and can take you out of the movie. While I was watching this film I had mixed emotions as well. For probably the first hour I was wondering if I would ever be interested in any of these characters and at times was quite bored. Then the movie picks up steam and I became quite intrigued by what was happening. By the third act I was hooked by the 3 or 4 of the story lines, and the payoff in each was very good. I do have to add my favorite parts of this film come in the direction. The way that the time periods are cut together and the transition devices they use are phenomenal. The score for this film is also fantastic. The way this film is put together and the quality of a couple of the time periods will have me revisiting this film in the future.",
      "total_reactions": 3,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Genres can be a constriction on a film, letting itself be restricted by boundaries set by the type of film it is. It is more often than not, the movies that defy their genre which intrigue and",
      "total_reactions": 3,
      "user": "Paganostaghetti"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Cloud Atlas is a cornily enthralling sci-fi. It seems to be like cramming the entire plot into 1. It's more like a pulpy middle brow trip. Its strange but cool",
      "total_reactions": 3,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "amazing movie,i need to see it again!",
      "total_reactions": 3,
      "user": "CavGab"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "This is a profoundly 'good' film. Not only in it's production, it's plot and the quality of the directing, acting, music and visual effects, though all are impeccable.",
      "total_reactions": 3,
      "user": "AtomicGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Cinematically beautiful with a great cast but definitely played out like a bunch of trailers all ready and willing to make the next great film. The music in the film tried too hard and was over exaggerated half the time as well. This movie also could've told its story in less time, it drew out scenes which became confusing at times.",
      "total_reactions": 3,
      "user": "cinecept"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "shockingly bad, confusing and seriously disappointing. i fell asleep several times I was that bored. I expected great things but after seeing Django Unchained last week (a fantastic movie that has you gripped throughout) I felt it necessary to comment on this. I would have walked out but my fiance wanted to see it through. Glad I got free tickets or I would have been even more disappointed.",
      "total_reactions": 3,
      "user": "dudleydog77"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "6 crappy stories chopped up, wasted 15 bucks on the DVD, I would not buy this DVD for $1, if there was time in my life I wish I could get back it would be watching this load of garbage.  The actors were wasted and uninspiring, the dialogue was drivel.  I had my finger on the fast forward for most of the movie it was that bad. I thought less of these actors after seeing the movie, I can only guess they all needed something to do on their weekends or needed to buy a new car or two.",
      "total_reactions": 3,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "\"Cloud Atlas\" was ambitious and could've been done right, but the Wachowskis just weren't up to it, rare miss. First, they didn't have to use the same six subplots in the source material, they could've substituted far more interesting stories instead. Second, the subplot jump-editing style is fine for two, maybe three stories but not six, it's too confusing to follow. Third, it seems juvenile with its pop-psych platitudes, more suitable for tweens than for film-experienced adults. Finally, it's a series of  gag  love stories, and the public should've been warned far more clearly. Yes, chix love this stuff but sci-fi guys hoping for mind-twisting action, bitter disappointment.",
      "total_reactions": 16,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "A rather major (though not entire) misfire. The ostensible reason for switching back and forth among stories is that viewers could not follow the presentation in David Mitchell's original book where the stories are suspended in the middle and picked up hundreds of pages later, as well as to develop the \"transmigration of souls\" theme (which is also reinforced by the casting of the same actors in all six stories). The problem with this approach (apart from the fact that the reincarnation idea is neither essential nor clearly developed in the book) is that the integrity or coherence (and hence effectiveness) of each of the stories is sacrificed in the process. It's hard for me to believe that anyone who has not read the book could possibly follow each of the stories as presented in the movie.( the stories could have been presented in serial order without interruption, or in an interconnected way that was perfected by, say, Robert Altman.)  But over and beyond this, the degree to which each story is fractured and the speed with which the directors move back and forth among stories is completely unnecessary for their cinematic conceit.. In addition, much of the storytelling here, unlike Mitchell's book, is almost cartoonish in its exaggeration; and the Wachowkis' turning of the Somni-451 story into a Matrix/Star Wars epic is totally unforgivable for anyone who claims to have an appreciation of the novel. (The Somni-451 and the post-apocalyptic Hawaii stories are, admittedly, the weakest part of that novel--which is itself a bit overrated, in my opinion--but they certainly deserve a better translation than they receive here.) The attraction of Cloud Atlas as a novel is the way in which Mitchell presents six different stories in six different literary styles recalling or imitating six different literary genres. This feature is completely (and unnecessarily) obscured by the movie. What an expensive shame!",
      "total_reactions": 7,
      "user": "metamotivcritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "If I had written this review right after I walked out of the theater, I might've given it somewhere around a 3. The story isn't very coherent, and you get the impression that it takes itself way too seriously. The messages and themes are also not very subtle. However, the longer I think about this movie, the more I appreciate it. It does a very good job at showing how powerful certain decisions can be for the future. It has strong emotional power during several scenes, and it definitely makes you think. As a movie fan, I've been growing tired of seeing so many similar movies, no matter the genre or style. Action movies, emotional dramas, and comedies, mostly seem to each blend in with the other movies of their genre, so it was nice to see something unlike any other movie. It is thoroughly entertaining, and while you might get the immediate impression that it is pretentious, self-indulgent, and not deep or intelligent enough to back that pretentiousness up, just let it gestate it your head, and I think you will come to appreciate it for what it has to offer.",
      "total_reactions": 7,
      "user": "MichaelDN"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "This movie tries so hard to be emotional by cramming in as many characters and story lines as possible, without ever making the audience care. Everyone that says it is so great, is in denial. This movie will not win any awards. I guarantee it. I have never walked out before the end of a movie until I saw this. Terrible.",
      "total_reactions": 7,
      "user": "Briancl25"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "An epic, sweeping assembly of  stories, each interwoven into its siblings. The genre's range from sci fi action, to comedy, to period tragedy and more but the parallels in each are continuously reinforced through narration and visual symbolism. The biggest complaint I've heard so far is that the stories seem incoherent and don't mesh. Not sure how anyone paying attention could arrive at this. Reoccurring themes of  human interaction, institution vs progress, absolute truth, and more are interwoven throughout each of the stories to the point that the sheer task of editing these pieces together is in some ways more impressive than the acting, makeup, and cinematography (all of which are great.) I can't guarantee you'll like it, but I feel fairly safe in saying you've never seen anything quite like it, which in a world of sequels and remakes, should be a valid argument on it's own.",
      "total_reactions": 7,
      "user": "DavidC"
    },
    {
      "neg_reactions": 26,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "Cloud Atlas literally comes down to a jumble of incoherent stories that were supposed to be tied together in one way or another. However when attempting to tie these stories together the movie fell short and the only reasoning it gave you for why these stories are linked is the recurrence of characters and that is it besides some loosely based similarities in the stories that my friends and family sadly attempted to convince me of. If I were you I would save the money to go see this movie since I doubt most will be able to make any sense of the movies plot. I will only give this movie on more shot when it comes out on DVD and I can snag it for $1 at a RedBox to attempt to try and understand the story one last time. I say once more wait for this movie to come out on DVD and you get rent it for $1 because that is about all the movie is worth.",
      "total_reactions": 35,
      "user": "BGYeti"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Cloud theoretically tries to be the best movie marketing event in history, balancing the whole \"sphere\" of what something can be to everyone in a single piece of art work. But in some ways I feel like Cloud is a movie version of Starbucks. Cloud tries to dominate delightfully bowing down to film makers everywhere throughout the movie.  But I have to admit even... I... love Starbucks. So punk rock, anti-modernist, or hippie roots aside, this is still great coffee despite it's single flaw of domination.",
      "total_reactions": 4,
      "user": "jjnoahjames"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "One of the most incoherent horrid movies ever. A complete disaster from start to finish. Story was unbearable, emotion was nonexistent, and everything in between make this movie terrible. Some might say it is a one of a kind movie; I say it is pure stupidly.",
      "total_reactions": 4,
      "user": "Trev29"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Quick summary of Cloud Atlas: a movie that ties 6 stories together, they all suck, so it's necessary to keep them alternating in order to avoid a lot of focus in an specific one, otherwise anyone would notice it's innumerous flaws. Also, why does Cloud Atlas tries to teach you \"life lessons\"? It's ridiculous, it's like the writer though his philosophy was the only truth so he has to put in the movie things like \"you have to help the others\", \"afterlife exists\", etc. That is pointless, what about this: anyone believes in whatever they want and period.",
      "total_reactions": 4,
      "user": "riferrari"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "This is actually not one, but 6 great movies in one nice packing. The movies are connected by the idea of modern humanism (mostly the idea of freedom), by the recurring actors (some play up to 6 different roles) and certain catch phrases. Agent Smith is brilliant in all his roles, especially the female one. This movie has a little bit of everything: futuristic sci-fi, drama, action, a little bit of comedy, a little bit of a detective story, some love, some friendship, but at the same time it's very different from what Hollywood usually has to offer in a good sense of novelty and originality.",
      "total_reactions": 4,
      "user": "Azurim"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "If you didn't like this movie then you weren't intelligent enough to get it. And if you were obsessed with believing that this film is racist in any way then you REALLY didn't comprehend it. That's all I have to say on the matter. Wonderful piece of art.",
      "total_reactions": 4,
      "user": "FrannieLW"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "Cloud Atlas is attempting to be an intellectual film, and had the storytelling devices been different, maybe it would have succeeded. Unfortunately, the movie was too long, too badly cut, to create a coherent whole.",
      "total_reactions": 18,
      "user": "yhibiki"
    },
    {
      "neg_reactions": 56,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "Incoherent. Had about 40 places where it could have ended. Worst movie of the year. Just lost 3 hours of my life never to retrieve. Beware the same fate.",
      "total_reactions": 70,
      "user": "Proteus"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "If the six stories were disentangled and laid out separately, it would be clear that none of them has much depth or surprise... Very hard to follow! Plot was not developed well and I feel like the whole movie is about all the special effects, CGI and costumes..  DO NOT WASTE time or money watching this movie.",
      "total_reactions": 15,
      "user": "moe07728"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "My wife had read the book and thought the book to be  excellent. However, we both thought the movie had little if any any value on any level. It was pretentious, gratuitously violent at every turn, and came off as a murky vapid redundant stew of ludicrously trite pseudo-intellectual bunk. If you want something new, exceptional,  with depth and quality, go see A Late Quartet before it's gone from theaters.",
      "total_reactions": 10,
      "user": "makrtik2"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "There is so much wrong with this sludge of a \"movie\" that 5000 characters will simply not suffice to mention all the stupidities & failures. So I'll make it short: SECOND.WORST.MOVIE.EVER. (Tree fo Life is still holding the No. 1 position)  Banging your head against the wall for 3 hours will be less of a torture than sitting through this abomination.",
      "total_reactions": 10,
      "user": "andytimber"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "My wife picked this movie....that's the last time I let her do that. If this movie wins even one Oscar I might boycott movies. This movie is like that one kid in school who tries way way way too hard. Awkward and ultimately tragic. The only reason I'm not giving this the lowest score possible is because it has Halle Berry.",
      "total_reactions": 10,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 32,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "text": "This is the first review I've written on a movie. I actually went out of my way to make an account and write this review so no one else has to waste 3 hours of their life on this epic piece of garbage. This is the SECOND WORST movie I have ever seen in my life, the first being Gigli (rated 2.4/10 on imdb).",
      "total_reactions": 39,
      "user": "L4ZAR"
    },
    {
      "neg_reactions": 25,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "An overly-long mess of a movie.  Dialog that is either too low/unintelligible to hear, or in a \"future-dialect\" that can only barely be understood.  For some reason, the same actors play multiple different roles in the various different storylines.  At no time did I feel I understood what was going on, or what the point of it all was.  Maybe you had to have read the book.  The best part of the movie for me was the popcorn.  I want those 3 hours of my life back.",
      "total_reactions": 30,
      "user": "PRT940"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "Don´1 know, what this movie was all about. Boring and potracted.",
      "total_reactions": 6,
      "user": "Caestus"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "One: Hugo Weaving and yellowface don't mix.  Two: all the religions in the world is supplanted by a hot-chic-asian-submissive-cloned-prostitute-prophetess with nothing substantial to say other than, \"be excellent to each other,\" minus the, \"party on dudes.\"  Three: the Irish doctor Tom Hanks plays is ironically exactly what Tom Hanks looks like without makeup and plastic surgery, he's magically delicious!  Four:  There are more flashbacks and flashforwards in this one movie than I have seen in a lifetime.  Five:  If this is reincarnation than Karma is broken.  Six:  Oh I get the Soylent Green line now, a little \"foreshadowing\" thing going on there; hint hint wink wink.  Seven:  WTF?!",
      "total_reactions": 6,
      "user": "Bobbo"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "Last year the movie",
      "total_reactions": 20,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "I knew this was going to be bad. But I didn't know it was going to be THAT bad. Turned it off after 20 minutes. Seeing Tom Hanks pop up in a bunch of different roles was just too distracting.",
      "total_reactions": 9,
      "user": "greygoose"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "Cloud Atlas is one of the biggest pieces of unadulterated crap that Hollywood has released in a number of years, and god only know they had there share of Sh-t. Its all over the board. There are a number of books that should never be brought to film and this \"pure puke of a movie is one of them.The writers should be stoned!!",
      "total_reactions": 21,
      "user": "imaxed2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was so amazing . I love the screenplay and visual effects. They did a good job with adapting the story into a great movie. The directing for the movie is superb. The story is a grat blend of genres. The movie might be a little to arty for but for the ones that enjoy movie that tell the story from the style of directing and visual effects , you will love the movie. I live all the characters to the movie, this is my pick for movie of 2012. It is a very risky movie to shoot and it should have more buzz than it has now. The score to the movie was .outstanding .",
      "total_reactions": 1,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "too much for nothing... the trend of overfictioning philosophical meanings of life and mankind - inception and few others got it right, but not this one.",
      "total_reactions": 2,
      "user": "BaLaura"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "One of the characters gives empathy a divine virtue status by saying that 'the ability of looking through someone else's eyes is the truth'. Best sentence to be in a movie ever,",
      "total_reactions": 1,
      "user": "siedem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Incoherent, dull, lacks a narrative and characterization. Nothing spectacular visually, baffling - no, embarrassing decision to use prosthetics to make western actors look Asian. A few interesting ideas, but ultimately; six supposedly linked sub-par stories. In one respect the film was faithful to the book: terribly boring and overblown.",
      "total_reactions": 1,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "It is the first movie I saw on this year and I am already convinced that will be the best, I don",
      "total_reactions": 1,
      "user": "Itsukki"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Most brilliant movie I have seen in years, possibly in my life. A true under appreciated master piece. It saddens me that this movie is not well known and the ratings are lowered by people without the intellectual capacity to understand it. No there is no guts, blood, explosions or non stop action which most people these days love. But there is an amazing story, perfect script, beautiful scenery, costumes, design and amazing actors and their portrayals of the vast number of characters. The movie raises and inspires your imagination in so many different levels. I am disgusted the Academy awards did not nominate this movie for best picture. Just goes to show you how politics play a huge role in everything these days. If you're like me a loved this movie, I think we should write to the Academy Awards committee which decides on nominations with our anger that this movie didn't get included.",
      "total_reactions": 1,
      "user": "DonMega"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Truly epic in both scale and accomplishment, Cloud Atlas delivers a powerful, moving, thrilling experience that is sure to entertain on every level. May leave the audience scratching heads at the beginning, but it's worth sticking around the entire 172 minutes it takes to sweep you off your feet. This movie takes you from the life of a composer in 1936 to the life of a Fabricant in a Blade Runner-esque Korea in 2144. Truly amazing on every level, Cloud Atlas is brilliant enough to warrant several viewings.",
      "total_reactions": 1,
      "user": "PrimalHunter70"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "This is by far the most inspiring, emotional, exhilarating, funny and action-packed 21st century philosophical work disguised as a really good movie! The brothers have done it again!",
      "total_reactions": 1,
      "user": "Lumenfaust"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Everything about this movie screams 'cult classic'. Critics are decidedly mixed but most can find something good in there. It is too well acted by the cast to be dismissed as a resounding flop. I left the cinema with my head buzzing with questions and wonder and even now find myself returning to scenes in my head to play them through and see if I missed something. It is exceptionally rare for a film to do this.",
      "total_reactions": 1,
      "user": "Mloclam"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "If this film does one things it's show off what state-of-the-art make-up artistry can do: a select all-star cast plays a ton of different characters across six different timelines which are all interwoven and interconnected. The plot (and film) is meant to be epic -it does look it- but it doesn't feel like that to me. Somehow dispite all the exellent VFX, make-up, acting and poetry-like dialogue it fails to connect emotionally. It is however commendable that they at least try to engage the audience with a more complex story than say robots and screaming teenagers, but the utter failure of this movie at the boxoffice doesn't bode well for the more intellectual type of scifi entertainment -even if it doesn't fire on all cylinders like this one. Even if you might end up hating it I would recommend spending the 3 hours coz it might be a long time before we see something similar again :/",
      "total_reactions": 1,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "A three-hour investment to watch a film that has generated ridiculously bad reviews from most of the major critics is such a risky decision especially when the film has also failed at the box-office meaning that not even the audiences have liked the film. BUT! Cloud Atlas is much more than that. This is not a child's play to incorporate six different storylines in a single film especially when they all are so complex and their interrelation seems nearly impossible at times. Hats off to the Wachowski Brothers and Tom Tykwer for their tremendous effort by making a film whose novel is already complicated but the way they have executed the entire film is marvelous. I don't have words to describe how impressed I am with their work on this film, it is utterly excellent. Honestly, at first, the film seemed like a disappointment to me, I was trying so hard to figure out what does all of it mean which was preventing me from the main purpose i.e. enjoying the film. But gradually, throughout these three hours, I started understanding what is going on and it finally started making a LITTLE sense. Of course, everyone has their own interpretations about the film but the real and common one is that \"everything is connected, your past may affect your present as well as your future.\" This can be thought of like that every individual's actions in a particular storyline affects the actions of other individuals in the different storylines. It can be seen like a phase in a human life, in which a person is bad at first, then he realizes that he is doing wrong and then in the end, he finally stands up for what is right. But this explanation doesn't fit all the individuals' stories like Hugo Weaving, he is evil in all of the storylines and maybe it's because his soul never realizes that it is doing wrong. Neither does it fit Tom Hanks' stories because he is a bad, greedy guy in the first storyline and then he becomes a good person and after that he becomes a bad person again and then finally, in the last stoyline, he becomes a good person, which doesn't make any sense. The more you try to figure out the plot of the film and interpret it in different ways, the more you start finding different explanations of how it could be possible. The film's brilliant (and far more complicated than I first thought) storyline is supported by phenomenal performances by the entire cast members. Every single one of them has played his/her roles wonderfully and that is also supported by the factor of beautiful make-up and styling to completely adapt them in their respective roles in different storylines. It completely blows you away, you can't even recognize that there are the same individuals in all of the storylines. Visual effects are great and so is the cinematography. Screenplay is really clever, because I have been reading that it varies from the novel and inverts the ending of all the storylines and it still has been incorporated properly and doesn't seem wrong. I might not read the novel because if I do, I'd be confused again and I don't want that. This is really not an all-audiences film, most of the people are not liking it because of the complications in the storylines and the confusing narrative but what it actually demands is your complete concentration because without it, you cannot understand what the real message and the purpose of this film really is, what exactly are the Wachowski Brothers trying to deliver to us, why did they choose to make this movie. All of the questions are answered if you watch the movie with complete attention and remember everything from the beginning until the end, it is really important. Cloud Atlas is easily one of the most complicated and daring films I have ever watched in my life. From the rough idea, you can guess that it would fail miserably but the Wachowski Brothers still made it for us because it is necessary to remind everyone what the real power of filmmaking is!",
      "total_reactions": 1,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "You'll probably ether love or hate this movie. It blew my mind, so many amazing things happened throughout it, but it is pretty hard to watch, and it took me till about 3/4 of the way through to realize what the movie was actually about, but that's the magic to it I guess.",
      "total_reactions": 1,
      "user": "Ezekius"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "An unexceptionable film. One of the best I have ever seen, in fact. The movie is an amalgamation of 6 lives and how their karma effects their reincarnation into difference spaces along the path of time. Some characters learn and grow, and others fall further down into the wellspring of bad karma, but the overall themes of the film, that love grants salvation, is something everyone can relate to. It may require at least two  sittings to pick up all the details of each story line, but this film is worth every moment. The idea that karma does not distinguish between race, gender, or even space and time is repeated through several timelines, and while it make take you a moment to work out how they are all connected, when you go, the aha-moment will have you falling in love with this film. At times gruesome, at times poignant, at times amusing, but always entertaining and fulfilling.",
      "total_reactions": 1,
      "user": "DrChocolate"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Possibly the greatest but certainly the most ambitious film of the year. Watching it for the first time I knew i was in for a movie that would require and invite repeated viewings. Absolutely breathtaking. Every is storyline is spectacular and gets enough screen-time in the near-3-hour timespan. The only complaint, albeit a very minor one, is that the casting decisions are sometimes a little distracting.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "If your looking for a relaxing movie that will help you fall asleep, you have found the movie you are looking for.This movie has a few thing that kept my interest, but I feel like they could have done it in a much better style.I had to fast forward through the last hour.",
      "total_reactions": 2,
      "user": "oblique15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "I went to see the movie with mixed expectations. I had read reviews beforehand that warned of a messy plotline with multiple stories. I was positively surprised on how untrue that was. The stories play well out in terms of pacing and characters. There are a lot of them in total, but each part (or you could say \"act\") has only a couple central characters, like you would expect from any typical story. The different stories are very easy to follow because they are so different, yet they are the same on many levels. I specially like how the film expects you to think. You can watch this movie just for the visuals, but to really appreciate it, you need to think what happened and because of what. Some reviews I've read say that the stories are not connected. I would say that if that is how you feel, you did not pay attention at all and were expecting the movie to give everything pre-chewed to you. Instead the movie expects to you to fill the missing bits, notice references between the stories and to imagine what has happened between the transitions from one story to another. There is even an exchange of lines in the movie which can pretty much be summed up as the characters saying to the audience that we won't tell you everything, you can imagine and fill the blanks yourselves.",
      "total_reactions": 1,
      "user": "Damorg"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "I not entirely sure how to sum up my feelings about this film in all honesty. I went in knowing it would be very in-cohesive so I assume that's the reason I didn't hate it, although I loved the idea anyway. It has you thinking that people are just reliving things that happened in past lives and the storylines of each 'segment' doesn't connect whatsoever to the next  which is true. However, there's an absolutely miraculous moment at the end that makes the entire thing fall into place and I genuinely believe it's one of the most beautiful moments in the history of film. This moment makes the entire thing connect and it's so overwhelming and empowering that I couldn't help but sob a little.",
      "total_reactions": 1,
      "user": "Jackdasplat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Entertaining and engaging. What else is matters? The stories piece together (some better than others) in a way that is a little confusing at first but soon feels natural and fluid. Great job with the editing. I can't imagine many films that'd be harder to edit than Cloud Atlas.",
      "total_reactions": 1,
      "user": "sa_nick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "This film will be unappreciated, mainly because of its complexity and length. But it is one of the best films I've seen this year. It has many themes and a great immersive story.",
      "total_reactions": 1,
      "user": "jul320"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "This movie is the kind of stuff that often splits people in two: those who enjoy life as it flows, no matter if good or bad, and those who always keep checklists at hand, hoping that assessing and measuring everything will encompass reality and maybe prevent them from harm. This duplicity in audience approach to the movie is embodied in the film itself, and to me that is a proof of its importance. Tons of stories about light vs. darkness (and about their being insolubly inter-weaved) have been told throughout the eras; this is another great opportunity to clinch the message, not to find some never-expressed-before meaning. The way it's conveyed makes it worth to experience Cloud atlas. His holiness The Matrix itself wasn't free from referencing: we cannot neglect culture, after all, we're all imbued in it. So turn off the judging critic inside your mind and just enjoy the ride in the depths of complexity, it's one of those you",
      "total_reactions": 1,
      "user": "moonce"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "The day after the election, I slept in late, watched Obama's acceptance speech, and saw Cloud Atlas, a film which perfectly examines the main themes of the election: love and charity and duty and patriotism. Connectedness. Oh, and greed, cruelty, and the 1%. It's the only action-scifi-romance I've seen where I checked the credits for Howard Dean and George Lakoff.",
      "total_reactions": 1,
      "user": "LindaW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "that is a really great Film from director of matrix that i have expected ,  but that is unacceptable  to take 55 number for this film , if i were a Critic  i will take 100 to this film",
      "total_reactions": 1,
      "user": "ArminAfshar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is not that complicated as some think and it's not trying to be, it's just puzzling, so you will need to pay attention and see it in one shot, otherwise you'll think just like many others, that it's a bad movie, but it's not and it's not your usual kind of movie, aside the story, like make-up, visual effects, soundtrack, etc, are well done.",
      "total_reactions": 1,
      "user": "Shinkasen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "I don't want to give the Wachowskis or Tykwer all the credit, or even too much, because the real visionary here is David Mitchell, and this is a much more faithful adaptation of his book than anyone could have hoped for, I think, and whatever issues one could have with the spiritually far-reaching narratives on display stem from his nested story structure. And there have been issues galore. I don't think I've ever had so much fun witnessing a film's critical divide. This is a film critics secretly want to be soaring over people's heads, something the critic can understand and explain to the masses. Alas for them, it's a film Tykwer and the Wachowskis wanted everyone to enjoy. And so I did...very much so. This is indeed sprawling and ambitious but the biggest surprise for me, and maybe disappointment for others, was its solid delivery of an old fashioned experience  a celebration of heroism and romanticism delivered with a dark sense of humor and a go for broke joy in delivering the goods without apology. Mitchell may have written the book, and he will openly state that he wrote it simply to see if it could be done, but the film seems to have been made by its three creators with the same sense of daring and flirtation with folly, one-upping the already mammoth scope with an equally daft notion of having all the actors play outside their genders or ethnicities. The whole business with the actors and the makeup and the noses may not work all the time, and it may not work at all for certain audiences, but it will always be inherent to me of the three filmmakers' attempt to do something totally insane, and too few in the business of making movies are even trying to push any envelope anymore. I came to love the use of the cast and the makeup when I realized about halfway through first viewing that the filmmakers had done so as a way of adding some heart into what Mitchell had created. There are some very bold and moving things being said in this film about love, responsibility and individuality that wouldn't have been so poignant without the utilization of the cast reappearing in each time period as a radically different self. This is not a folly. The fact that this not only works but has become one of the most addictively watchable movies in my memory has also made it one of my all-time favorites. And there are many reasons it works for me, one of them being that the film was made, I believe, with a strong yet sly sense of self-referential humor and the other being that the schematic structure of Mitchell's book has been replaced by a freestyle, musical approach. I don't think since 'Short Cuts' has there been such a major film of such length which has truly relished such a cascade of rhyming images and sensations simply for the enjoyment of it, like listening to a great album. One can be daunted by the many worlds on display here and try too hard to get on top of it all but the real fun is letting this movie just play in front of you, doing its free association dance through time. This is like the iconic shot in '2001' of the pirouetting bone which jump-cuts into a ship rotating around the earth, played out like a symphony. This either works for you, or not at all. For me, it's one of the great movie experiences of my life.",
      "total_reactions": 1,
      "user": "MHsmith84"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "I could watch this film a dozen times, something I can't say for but a handful of movies. I like movies to clock in at 100 minutes, and I thought that the Dark Knight Rises was forty minutes long, but this film deserves the time, and it deserves a few rewatches.  Its more of a work of art that you can't experience in a single visit to the museum  you have to live with it, experience it multiplie times.  In keeping with the themes of the movie, I'd say it requires six visits.   There are layers of complexity, and they are worth unweaving. The Wachowskis ask sincere questions about who were are and why we are, and they make science fiction films that explore our metaphysical possibilities.",
      "total_reactions": 1,
      "user": "texs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Cloud Atlas it's the most amazing film that i seen ever. I don't know how you can't love this film. The plot is so exciting that you can not tear your eyes from the screen for three hours.",
      "total_reactions": 1,
      "user": "twittagra"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "I think this movie says truth. No enforcement, No comfirmation. Just  shown that how does a phenomenon function. And it is not bad that action of this movie, Awsome impersonation, multiple acting is great.",
      "total_reactions": 1,
      "user": "paraotuks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Epic in scale and in ambition. Cloud Atlas just falls short of brilliance. Ultimately it turns out to be too confusing for it's own good. It is however, never short of riveting. So, even if you are unsure what is happening, you continue to watch, hoping that the next time jump will solve a piece of the puzzle.",
      "total_reactions": 1,
      "user": "darthstatto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Life played out like beautiful jigsaw puzzle, each piece a fascinating piece of color and wonder, but in the end quite putting the big picture together. Time well spent and entertaining to behold. I both aspects much like life it self, I guess",
      "total_reactions": 1,
      "user": "moellemose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Unusual, amazing and mysterious. The plot is so twisted it grabs you from the very beginning till the end. But to be honest way too twisted. I had to review the movie to understand it. I don't know is it good or bad. Nevermind me, movie is awesome and worth watching.",
      "total_reactions": 1,
      "user": "Violett"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "A visually stunning and groundbreaking epic. A modern art masterpiece. It's really impressive, the visuals were just out of this world. The characters were amazing. I will tell you this, the movie is a very dividing movie, some people for me consider it the modern art classic of today (I'm one of them) and other consider it a piece of crap. But I LOVED this movie. Its beautifully made and acted extremely well.",
      "total_reactions": 1,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Over rated this be . Can a movie have more pretension and blatant killing of subplots that are sub par . Reincarnation is a gradually change of betterment that you , other people or the world effect you . Actors gave some great persona changes and performances but the story was jacked and camera work was terrible . Also boring and full of hot air .",
      "total_reactions": 1,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Cloud Atlas conveys a great message, and it is surely complicated, but when you use something as powerful as \"karma\" as a plot device, the message get lost. Karma is like \"deus ex machina\", and should only be used for comedy.",
      "total_reactions": 1,
      "user": "dokisame"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "This movie is really 6 good movies in one. 5 of the 6 stories are very compelling, memorable, even haunting, with the six being just good. The only drawbacks to this film are that some of the stories have only tenuous connections to one another and sometimes the makeup they put on the actors to make them look like different races (or even demons) looks ridiculous. That being said, the characters and environments created in each segment would be memorable enough to stand on their own as feature films, and I find myself thinking about the characters, worlds, even languages portrayed in this film long after the end credits rolled.",
      "total_reactions": 2,
      "user": "Kelliente"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "A lot of people do die in this movie and there are many main characters.  However, out of the main characters the homosexual commits suicide and the Asian \"clone\" is executed.  The rest of the main characters go on to live happily ever after.  I guess if you put Tom Hanks and Halle Berry together at the end of a movie, surrounded by a bunch of children, then close with a view of the stars in the sky (shooting star included) all can be forgiven.",
      "total_reactions": 1,
      "user": "LordGoogoo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "This film has some of the best acting and production value that audiences completely ignored. My only complaint about this fantastic movie is that the staff didn't assign a bigger marketing budget.",
      "total_reactions": 1,
      "user": "UncleEarl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "The truth is I actually liked some of the stories of this film and for the most part it was good and visually beautiful. And yet in the end Cloud Atlas is like a fruit that looks gorgeous and juicy from the outside but that you cut open only to reveal green rot inside.",
      "total_reactions": 1,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": ".............WARNING............WARNING..............ATROCIOUS MOVIES ALERT..............ATROCIOUS MOVIES ALERT. BEYOND STUPID. i cant even.... oh man.",
      "total_reactions": 1,
      "user": "Gmork"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "I picked up this movie to rent, thank God I didn't pay to go see it at the movies!  What a hot mess, hard to follow, and you will totally try to lose your mind watching the whole thing.  You can tell by my ratings on other movies I usually give an honest effort the benefit of doubt, not on this one.  Should really have given it a O as I see no redeeming value in the movie and an actor of such great movies like Tom Hanks, it is beyond me why he would do such a movie!!",
      "total_reactions": 1,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "Strikingly dull and incoherent. The movie moves through stories in order to hide the fact that if you were to see each storyline in sequence, the \"mystery\" or \"surprises\" would be as inane and as easy to spot as the \"twist\" in the Sixth Sense.",
      "total_reactions": 1,
      "user": "TheBlacksmith"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Okay, okay, a lot of people like this movie far more than I. I am not a stupid person...PHD in mechanical physics from MIT before the age of 25 ( I'm not saying this to brag, but to set up my premise ) but I can't for the life of me tell anyone what this movie is actually about. Completely stumped here. It's only saving grace as far as I'm concerned is that it is visually stunning and the actor's performances were noteworthy. Other than that...I found no real plot to follow and frankly didn't give a damn what happened after the first hour.",
      "total_reactions": 1,
      "user": "Cantandres"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Cloud Atlas is an unbelievably ambitious film that makes the head reel when thinking about structure and logistics. The movie requires patience as it's opening third is genuinely baffling. But Cloud Atlas finishes strong, with a good emotional kick and a life-affirming message.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "What you might feel after watching thiz movie? You may be confused, you may be disappointed or if you watch closely enough, you may find a hidden philosophy inside. Thiz movie has six stories with six different time periods, from little island in South Pacific to the post-apocalyptic Hawaiian Islands, from the primitive year 1849 to far in the future 2321. The stories come from any direction and finally meet at one point. The story is meant to be connected to one another, however, don’t be surprised if you eventually find that the connection is very minor. In point of fact, you may miss the connection if you’re not careful. “Cloud Atlas” is the latest project from Tom Tykwer and The Wachowskis, starring Tom Hanks, Halle Berry, Hugo Weaving, Jim Sturgess, Jim Broadbent, Ben Winshaw, James D’Arcy, Susan Sarandon, Hugh Grant, Doona Bae and Xun Zhou. All Actors have more than one role during different time periods. As a matter of fact, some Actors are so buried underneath their makeup that we could hardly recognize them. To make things even worse, some of them are seemingly drawn into comical performances such as Hugo Weaving, James D’Arcy, Susan Sarandon and Hugh Grant. The better performances come from Tom Hanks, Halle Berry and Ben Winshaw. And the scene stealer is definitely Doona Bae who depicts a genetically-engineered clone named Sonmi-451. Doona Bae delivers a complex and inspiring character. On the directorial side, Tom Tykwer carries out 1936’s, 1973’s and 2012’s segment. On the other side, Andi and Lana (used to be Larry) Wachowski handle 1849’s, 2144’s and 2321’s segment. Personally, I prefer Wachowskis’ direction. They can keep up the pace of their stories and prevent it from being boring. It reminds us of how good The Wachowskis really are when depicting futuristic tales, just like what they did in “The Matrix” (1999). On the other hand, even though I love the previous Tom Tykwer’s works such as “Run Lola Run” (1998), but thiz time, he seems to have put anything one-dimensional. In other words, Tom Tykwer’s direction is boring. If it’s not because of the intriguing futuristic tale of Sonmi-451 which is directed by The Wachowskis, thiz movie will undoubtedly become an unnecessary B-Class movie. In the end, thiz is something bigger than you think. It’s all about a belief in the universality of mankind. Basically, there is no difference between countries, races and even genders, where white can become black, black can become white and white can become Asian. We are all one, we are all the same, learning and strive for a better condition. Visit My Blog on JONNY'S MOVEE  http://jonnyfendi.blogspot.com",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I simply do not understand why some critics didn't enjoy this. A truly unique and ambitious film with an ensemble cast and great story. I personally think the film did well at mixing all eras instead of doing it all chronologically.",
      "total_reactions": 0,
      "user": "benoski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Going into the movie, I didn't expect much.  Hell, I didn't even think I would hit the 3 hour mark but I wanted something to watch while playing video games.  40 minutes in, and the storyline just felt confusing...but then, at the hour and a half mark, everything began to come together and this curious film started to take on a disordered order, and I found myself completely disinterested in my game and staring intently as the plot became to take shape and form before my very eyes.  I am a critical person of works, and I usually am quickly annoyed by small flaws but this movie didn't feel like a movie....it felt like 5 movies playing at once, all interconnected in different and strange details.",
      "total_reactions": 0,
      "user": "Metalsand"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Simply, I thought it rocked.  It was incredibly entertaining, with some pretty strong performances and great special effects.  It's obvious while watching it that it is a movie that will polarize audiences.  Personally, I want to watch it again to put more pieces together.",
      "total_reactions": 0,
      "user": "monster_meal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "This was certainly a rather....unique movie. I have neither read or heard of the book before, nor this I really know what the movie was going to be about. I was in for a mixed surprise. I really liked the concept of there being multiple stories within multiple time periods and the transitions between them are seamless. However (at least in the movie) these stories seem to be connected rather loosely. The only thing you get to see is how these individual stories are being transferred. (For example the first guy writes a diary which is read by someone in the next time period. That guy writes letters to his lover about his story and so on and so forth.) At first I though that if this is the only way these stories are connected, that's kind of lazy. But then came the credits in which you could see which actor played whom. This is probably the most revealing part of the movie, which now that i think about it is actually rather amusing. Still, i decided to do some research about the story to get some explanations about things that I might have missed. And so i found out that this movie was supposed to be about reincarnation throughout time periods. This makes sense after seeing the credits, but it's not really explained throughout a movie. As a movie, this kind of fails because important things that might have been explained better in the book are not really to be seen in this movie. However as an experience, this certainly was interesting. Do some research before you watch this movie. You'll certainly be enjoying it more afterwards.",
      "total_reactions": 0,
      "user": "AxeFish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Ambitious, beautiful and utterly breathtaking. With impressive visuals, an awe-inspiring score, seamless editing, and fantastic acting and directing, Cloud Atlas is a successful attempt to turn an \"un-filmable\" novel (one of my favourite novels) into a well-adaptated masterpiece. Even though the film is not perfect, it struck me on a personal level and its powerful nature, like the novel, made it overcome its issues. One of my favourite film adaptations and one of my favourite films, regardless of any issues.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Sprawling, and incredibly cast, Cloud Atlas is a film that surely has divided everyone who has seen it.  Is it another self indulgent effort from the Watchowski Siblings, or a Masterpiece?  Based on what is considered as an unfilmable novel, Cloud Atlas starts of as a project of such high risk, that the Watchowskis have difficulties finding the right investors.  Why not? It is an Art Film with a Blockbuster budget. At its heart though, it is one of the more contemplative film that they have made since the Matrix, using every trick in the book a film that pushes the envelope so far, that it flops miserably.  Only time will tell whether it joins the pantheon of 'visionary', 'much beyond its time' film making such as 'Blade Runner'.  The question is will anyone give the Watchowskis', one of the most daring visionary film makers of their generation, another set of budgets after two flops in succession?",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "This is a difficult movie to place a score on. The message of the film, I think, is an eternally important one. The only people who would say it is \"cheesy\" or \"cliche'\" are the most jaded of us. It's cliche' because it's true. It's a vulnerable message that Cloud Atlas tries to bring home, and I think it is a message that is disturbing to the American mainstream mindset. Cloud Atlas wants you to know that you aren't safe from other people... for better and for worse. It succeeds in doing that and it feels satisfying. What drags the film down though is the length and the multiple storylines. I appreciated the purpose they served, but felt I could have done without so many. There were several characters I simply wanted \"more\" of, but didn't really get. It left me wanting more development for individual stories, but then again, maybe that's just another way Cloud Atlas drives home its central message.  It's a good movie. See it with someone you care about.",
      "total_reactions": 0,
      "user": "Sevvy88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "This is one of those movies that had such a trailer I wasn't sure I wanted to see the actual film or not. Luckily, the actual movie itself proved to be more than about that one song - although \"Cloud Atlas\" rather interestingly carries through most of the stories in the movie.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I was skeptical at first with this movie. I dind't get many good review from my friends and great part of the internet was telling me not to give it a chance, but... I gave it a shot. And, hell, man, it showed me things I would never expect finding in any 3 hours of my day. All the storys are evolving. I laughed, I got excited, and, sometimes, even bro tears almost appeared. I cannot give less than a 10 to such wonderful piece of art. I'm going to give a chance to the book, and if I find something half as good as the movie, I'll be more than satisfied. Don't listen to the haters. Do it as me: Give it a shot. You won't get dissapointed.",
      "total_reactions": 0,
      "user": "Androu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "This is one of those films that I figure that it would be really good, but in the end, it's not a big disappointment, but it's not what you expected. I mean, the scope of the film is big with some really good acting, but the character development behind the characters are pretty weak. It's also too long.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "One of the most epic films ever made. Amazingly beautiful, and a huge tear jerker. It is incredibly visceral in places, and never really gets to the point for some plot lines or actions. Its very well executed, but the well discussed theory of the 'Cloud Atlas effect' is rarely actually demonstrated in the plot. You're never really shown how some of the separate storylines connect.",
      "total_reactions": 0,
      "user": "BeatHour"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "This film was absurdly ambitious, and it sort of succeeds. Each separate story thread is compelling and visually amazing, but I feel it just falls short of creating an overly succinct story when put together. However it is still entertaining, if a little overlong.",
      "total_reactions": 0,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is AMAZING. I don't know why there's a meta score of 55, but it doesn't matter. Cloud Atlas is a masterpiece, even if after reading the book, it could have been better, but the movie itself is pleasant, great to watch, and far better than the others at the same time in theaters, for example.",
      "total_reactions": 0,
      "user": "Stockilleur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "After deciding to watch this film with little to no expectations I can truly say that I was blown away. Every story in the film was extremely interesting and the idea of interlocking lives was great. The cinematography was stellar and the soundtrack went extremely well with how beautiful the imagery on screen was. The film is ambiguous but in a way that allows for you to really think about what you watched and not in an infuriating way. I will bet that years from now critics will reevaluate Cloud Atlas and it will become a classic just like other films, such as Blade Runner, that at the time were snubbed by film critics but revered now.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Cloud Atlas is a really impressive work from the Wachowskis that is incredibly deep philosophically and incredibly expansive as a film. Featuring numerous different time periods and the same actors playing different characters (but not really), Cloud Atlas is wonderfully directed and though it takes a bit of adjusting to, if you are willing to go with the film, it is quite enjoyable. An interesting film that touches on thoughts of reincarnation, our purpose in life, karma, and the importance of our actions, Cloud Atlas is wildly ambitious. Most certainly a film I will need to watch again, the cast in its entirety is fantastic. Tom Hanks, Halle Berry, Jim Broadbent, Hugo Weaving, Jim Sturgess, Doona Bae, Ben Whishaw, Susan Sarandon, and Hugh Grant, in particular are all fantastic. Every actor plays a variety of roles, which makes the film that much more compelling and also gives them all some extra chances to show off their great skill. Overall, Cloud Atlas is incredibly long and can drag at times, but never becomes boring and is, above all, a wildly inventive and compelling piece of philosophy that is worthy of further study.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Tired movie, dragged the script not the big thing else has an interesting proposal, but thanks to its slow pace and great length makes this film a miserable experience.",
      "total_reactions": 0,
      "user": "Iky009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Visually brilliant and outstanding, Cloud Atlas is one of the most unique and well done movies I've ever seen. I was quite shocked and surprised when I first heard the nominations for the 2012 Oscars and didn't hear 1 category for Cloud Atlas. Particularly make up, visual effects, or original score. I've watched this movie three times now and still havn't quite figured out how each time difference is connected. But that's what is so great about this movie. Is that you really don't have to get or understand it. It's still just amazing to watch.",
      "total_reactions": 0,
      "user": "hardkor33"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Many movies bore at times and seem predictable at times. Cloud Atlas has its story telling in a buzz and the storylines of each individual time should of been a little longer and more in-depth. But don't judge its quality by the complex plot, the movie blended in beautiful themes. Its mystery, romance, comical relief, dramatic, and actiony si-fi themes fit perfectly in one and I would probably never find a movie that did this again.",
      "total_reactions": 0,
      "user": "KevowOfRice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "It might take a capable mind to fully understand its endless swath of challenging structural nuances, but, with that trained mindset, one should clearly be able to ascertain that \"Cloud Atlas\"   with its great performances, cinematography, script, and editing  is truly quite a sight to behold.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "I wanted this movie to have more, and I waited until the credits, disappointed. The idea is smart, but I felt that it just needed a better edit (maybe a year or two from now?) that would make it more seamless and the ideas presented stronger.",
      "total_reactions": 0,
      "user": "EDGECRUSHER"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "What an amazing experience. Not unlike the one I had upon reading the book the first time. In the beginning I was skeptical, and it took a while to get used to the narrative structure, but at a certain point I was sucked in and completely enveloped in the story. I have to say it was masterfully edited to keep my rapt attention throughout. The way they conceived it for the screen was brilliant.",
      "total_reactions": 0,
      "user": "finnigan37"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Easily one of the top 10 films of 2012! I was worried after all the mixed reviews. In fact I waited until 2013 to see it. I totally regret it. I would have loved giving my money to see this in theaters. The film is like 2 hours and a half long and I never got bored, in fact, without even noticing it, I was more and more into it as the film progressed. By the last hour I was absolutely surprised at how much I was loving the experience. Only bad thing I can say is some of the make-up doesn´t look good, but even that was probably done on purpose. Each one of the stories adds something different and are totally enjoyable. I felt like the futuristic ones could have been a film on its own, with great and innovative special effects. The film is truly memorable, I plan on watching it several times in the future. My favorite story was the boy who was a musical genius, that was the one with more heart and with the best acting in my opinion. But really, all the actors are on point, and it´s absolutely incredible to think how they even managed to put all this together and make it work. Outstanding body of work, emotive, epic, funny, sad and everything in between. What an experience. One of those very few cases when I strongly disagree with the critics rating. But time puts things in its place, and I´ve already seen several of them taking back their negative opinions. Memorable.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Cloud Atlas is a hot mess. There is about half a good movie here. The themes presented are relevant: love, dignity, freedom. Unfortunately they are sometimes presented in such a way as to seem trite or even cliched. There are also some strange and baffling elements that just don't work.",
      "total_reactions": 0,
      "user": "Jay_Sherman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Humanidad, rebelacion  y amor. No puedo pensar que en un solo segundo pudiera captar la esencia de una vida entera y la realidad de un hombre como es valiente en todos sus ambitos. La mejor pelicula que he visto en mi vida y una obra de arte que merece ser llamada la verdad. Somos el reflejo de lo que creemos y producto de lo que preservamos.",
      "total_reactions": 0,
      "user": "SebastianRR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "To be honest I don't think the movie came together well, but I did enjoy some of the individual stories and the film is well directed.  I think the film is worth watching at least once.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "For now this is my favorite movie of all times. I asked everyone I know to watch it. It's about love, about eternal souls and about the idea that not only our souls but what if our love can survive our death? What if we can meet each other the next time and feel, know and fall in love again? I saw it three times and every time I had tears by the end. It's... it's unbelievable.",
      "total_reactions": 0,
      "user": "Connor_Lake"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Clever writing, most unique film I have ever seen in a long time. I loved the Cinematography done by Frank Griebe & John Toll. Of course you're thinking it's the Wachowski's... but they do have Matrix under their belt along with Jupiter Ascending coming soon, and Sense8 a new tv/netflix show.  The Wachowski's have never disappointed me ever! I've enjoyed all their films including this one, probably their most weirdest, trippy, original, and mind-blowing visual movie to date!!! Although you got to sacrifice about 2 and a half hours. I think it was worth it!",
      "total_reactions": 0,
      "user": "blockofcheese"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "This film I guess is a valid attempt at a great film like \"The Hours\" that just fails to hit the mark. Pretty vapid and bad, the metaphors the morals, the quotes, the philosophy's expressed the time sliced plot switching are all awful, the parables trite, if this is representative of the novel, I pity the novel to. This film seems to be a barometer of those who think they can identify a quality film, whereas really its just an idiot test. The themes are played too much Hollywood  Disney style similarly the stereotyped characters, the oppressed winning through, the cultural reversal, the playing upon other story's too greatly, soy-lent green anyone  its all so very child like and ham-fisted. And not helped by the fact they have used the same actors for so many parts with only poor make up, to set the characters apart as different from the small range of the actors faces used, and it doesn't really work, nor is it convincing or even logical, and certainly if the intention was to make the cross time parallel character scenario pairings rub nose obvious, its awkward and unnecessary, European's trying to play Asian's, Asian's trying to play western belles and Mexicans etc it just comes off as awkward in fact I don't see how its any less racist than blacking up, you want to portray people of a certain race  why not simply hire people to play such roles  instead of using makeup and prosthetics to this extent  or was it a budgetary constraint  yes one can quite clearly see how it would tickle an actors ego, to be in such a film as they get to attempt to demonstrate their range in the same film, but really its just jarring for the film and there is an effort to try to crudely and artificially stitch the time lines to each other in some ways cross time to end up with some many lives interacting metaphor etc, but some of the lines in this film are heinous and hackneyed, most of the scenario and character relationships you see coming before they're even on the screen practically. The fact this film is rated is so highly is an indictment, I find it hard to believe people cant see through this films general film flam. Its valid to attempt such films but when it fails, its seems more dis-ingenuous, then those films that are at least honest about limited intellect popcorn schlock. It also mildly wreaks to some extent vague populist propaganda of white European's and intolerance of any sort to anything as bad and other globally exported American cultural philosophies. Worst point it plays to a American multicultural audience with ponderous stereotypes, the pseudo Mexican Asian woman (again real bad makeup) who quips \"don’t call me a wetback\" over the corpse of the evil white gunman who she has bludgeoned to death for shooting her Chihuahua dead, this is cheesy playing to the audience style humour. The philosophical lines such as  \"love could outlive death\" and \"it will never amount to more than a single drop in a limitless ocean\" which was sadly followed by  \"what is an ocean but a multitude of drops\"  I mean really really  if this kind of trite display of child philosophies that appeal to the masses then I guess my review is nought more than  let me see  which rubbish metaphor shall I pick?  A drop of intelligence in an ocean of ignorance?",
      "total_reactions": 0,
      "user": "ancientscream"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I realize people throw 10s out for movies that they kinda sorta liked because they're trying to balance all of the 1s that a-holes throw out just to be jerks, but I am not one of those people. This movie truly deserves a 10, it is nothing short of a masterpiece.",
      "total_reactions": 0,
      "user": "SeanAnderton"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Cloud Atlas is one of those movie which try something new. Sometimes it works, sometimes you just want to cry because you spend to much money to watch this movie in cinema.",
      "total_reactions": 0,
      "user": "Jeanny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "To kick off let's talk about the first impression you can have, if you are not focused in the film since it starts you could probably have some problems on understanding the film but, surprisingly, you can an overall idea of what's happening because the film is at the same time hard and easy to understand, it seems like a contradiction but it's not:",
      "total_reactions": 0,
      "user": "gerar17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "I really liked this movie. Yes, it was long. Yes, it was hard to follow, but it was an intelligent film with a profound message of perseverance and continuity of the human spirit  soul with aspiring to all that is good in this universe. It contains within its core an explanation for the very reasons why we should do good for ourselves and others, how the consequences of our actions really do have a tremendous impact on not only our lives but the lives of all we touch, and how the only truly lasting and meaningful lessons we can derive from our existences are the ones shared interpersonally. I appreciate the message that through all our lifetimes together, the only thing of significance we are really doing with each other is learning how to transcend from the carnal, savage and selfish to the giving, loving and joyful which is the true essence of the universe.",
      "total_reactions": 0,
      "user": "Mrtylerdurton"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Probably a beat to death opinion but its a movie that you probably have to watch twice if you weren't able to keep up.  I got the chance to watch this film with a few friends and I gotta say it was definitely a trip.",
      "total_reactions": 0,
      "user": "Steamcausedthis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "One of my favourite books now on the screen. David Mitchell's book is engaging, extremely clever, and ambitious. While the film is quite different in its structure and the way in which it flags the labyrinthine interconnections, it is equally ambitious  and for that alone it is worth the ticket price. In fact, this is the sort of film that gets better with multiple viewings. Once you get past Tom Hanks, almost everything else works extremely well. The few clunky bits are completely overwhelmed by some breathtaking action, laugh out loud comedy (courtesy of Jim Broadbent and Hugo Weaving in story 4), and sprawling and tragic love stories. After reading reviews I didn't expect to like this movie near as much as I did. Forget the naysayers, this it top cinema.",
      "total_reactions": 0,
      "user": "Muzmarinator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "While not without its flaws, Cloud Atlas is an ambitious, thrilling, and emotionally gripping film that explores the interconnectedness of human lives throughout time. Despite its long run-time, I was engaged in the movie throughout and felt compelled to keep watching until its exhilarating finale. Its unique style of interweaving multiple stories throughout (but to my relief, still giving a lot of screen time to Tom Hanks' multiple roles) was unlike anything I have seen before. Stay focused through all 172 minutes and you will be delightfully rewarded.",
      "total_reactions": 0,
      "user": "rudhcris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "The 3 hours passed quickly and I wanted it to keep on going, though at the same time it ended each of the story lines in a today and reasonable fashion.",
      "total_reactions": 0,
      "user": "iadao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "It was entertaining and had a wide variety of emotional and memorable moments butt it felt a bit too loosely put together. The film was rather long and the plot progression was good but ultimately was too drawn out. Overall the movie is good but probably could have been more impactful if it was somewhat shorter.",
      "total_reactions": 0,
      "user": "sloppyjoes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "A film that's epic in scope and features some genuinely incredibly acting by Mr. Hanks, Cloud Atlas is an ambitious project that suffers from style over substance.",
      "total_reactions": 0,
      "user": "Aijixe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "A stellar ensemble cast, undeniably fantastic script, and stunning visuals make this cinematic masterpiece one of the greatest indie films of all time.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "A true film masterpiece. A beautifully written adaptation of the novel of the same name. Although there are differences to the novel, the film takes a different approach and links all the 6 mini-stories in a non-linear mosaic.  This is art with a beautiful story behind it with many layers of meaning and symbolism.",
      "total_reactions": 0,
      "user": "Larkfeast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "I GIVE THIS A 8.5 BUT IT GETS AN EXTRA 0.5 TO COUNTERBALANCE ALL THE HATE.",
      "total_reactions": 0,
      "user": "N0rthWind"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "If you can't appreciate the story, then appreciate the way it was told. This is the most underrated film I have ever seen. It took three film crews across the world, three writers/directors to adapt a screenplay from a book that was deemed impossible to do. I don't care much for parts of the story, but the themes, editing, humour, suspense, and eye popping makeup design and special effects are sure to please any viewer. I've never seen anything like it, nor will there ever be.",
      "total_reactions": 0,
      "user": "wilsonadams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "One of the best movies ever made.",
      "total_reactions": 0,
      "user": "keemt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Visualy stunning. Storyline like a puzzle. It's interesting, fun to watch. One of those you can watch over and over again, not get bored and always discover something new. Costume design, props and make up effects are amazing, great job on that!",
      "total_reactions": 0,
      "user": "HighPriestesa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is wonderful! The way all the events connect to each other is just amazing. The music, the ending and many more things are just beautiful. I'm planning on reading the book as soon as possible. Also, those negative critics are just - sorry for using such a childish word - dumb. This movie needs to be watched at least a couple times to be understanded completely. Most critics probably didn't do that, which is fine, but they shouldn't judge it so early. I'm no adult nor critic, and therefore my opinion on this movie may not count that much, but I can say I enjoyed it much more than many other movies (sorry if I misspelt something, Italian here).",
      "total_reactions": 0,
      "user": "artexplosion"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "Clearly 10. A truly original piece of cinema.",
      "total_reactions": 0,
      "user": "Introduce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "With Cloud Atlas, the Watchowski deliver a true masterpiece, mixing a large number of genres, from comedy (often funnier than the average comedy) to science fiction. Everything works. Every single actor is awesome. The soundtrack is great. The whole movie is so well film it achieves what many book adaptations fail to do: not being useless, and even transcending the source material. I could watch this over and over without ever getting bored. The film is so complex and clever you'll discover tons of new things every time you watch it.",
      "total_reactions": 0,
      "user": "My_name_is_Khan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "\"Cloud Atlas\" 10 Scale Rating: 9.0 (Amazing) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "It isn't hard to understand just why this movie didn't do itself justice at the box office. Given that dumbing down is so prevalent and the average consumer attention span struggles to come to grips with any script containing substance or integrity. This is not a movie, it is a masterpiece, a work of art, a peephole into the soul of humanity. The continuity alone is beautifully orchestrated. Colourful, rich, vibrant, affecting all emotional responses. A rare standout movie in a time of shallow plagiarism. Six stories entwined in one, offering sci-fi / love / suspense / action / drama / thriller. Conceptually majestic, daring production, quality performances and captivating stories provide an exquisite palate.",
      "total_reactions": 0,
      "user": "MCRR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Fantastic film. Whoever rates it poorly should ask himself did he manage to understandand it at all. It seems most critics that gave poor rating should watch film again",
      "total_reactions": 0,
      "user": "Sitnalov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 3,
      "text": "Los Wachowsky sin duda alguna, han perdido el norte hace mucho tiempo, y si pensaron que con esta película iban a recuperarse, lo llevan claro. Si con 'Matrix' dieron el pelotazo y se fostiaron con 'M. Reloaded' y 'M. Revolutions', luego con 'Speed Racer' se hundieron más aún, con ésta, se han tirado a un pozo sin fondo.",
      "total_reactions": 0,
      "user": "Barbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "3 hours, 6 stories and different times are blended in this tedious movie, it was better for the director to keep this story in the book, I didn't enjoy in this movie but I feel confused and trying to figure out what's going on?!.",
      "total_reactions": 0,
      "user": "mohamad91hk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "A movie that transcends all structure for a meaning much deeper than can ever be written in clarity.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "I watched this movie when it first was released on DVD and hated it.  I then read the book, watched to movie again, and only after seeing it twice and reading the book did I come to fully understand the impressive magnitude of this movie.  This is one of the most under-appreciated films in recent history as most people dismiss it as boring and uninteresting.  Watch it once and you will want to watch it again and again.  It has amazing cinematography, terrific music, and great acting overall in an amazing story that stays true to the amazing book it is based off of.",
      "total_reactions": 0,
      "user": "philip3242"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "An absolutely amazing and inspiring film. Eloquent, poetic, uplifting. For the spiritually aware and connected this movie will strike your heart and soul.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 1,
      "text": "Los Wachowsky sin duda alguna, han perdido el norte hace mucho tiempo, y si pensaron que con esta película iban a recuperarse, lo llevan claro. Si con 'Matrix' dieron el pelotazo y se fostiaron con 'M. Reloaded' y 'M. Revolutions', luego con 'Speed Racer' se hundieron más aún, con ésta, se han tirado a un pozo sin fondo.",
      "total_reactions": 0,
      "user": "AngusBarbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "I originally went to watch this movie in the theatres because the name caught my attention and the reviews were so divided.",
      "total_reactions": 0,
      "user": "ESeTyRC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2016
      },
      "score": 1,
      "text": "Horrible plot, acting, and theme. The idea behind it seemed airy-fairy and new-agey. Could have been so much more epic. I see what they tried to do but just missed the mark, by a lot-shot.",
      "total_reactions": 0,
      "user": "drewtheredguard"
    }
  ]
}