{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 73,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "Cold in July",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 53,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ernest Hardy",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 90,
      "summary": "While Hall and Shepard nail their parts, Don Johnson, still magnetic after all these years, steals the film as a sardonic private eye with a vintage cherry-red convertible."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "There’s a lot to admire in Cold in July, but its chief virtue is unpredictability. Most movies these days sleepwalk through their formulaic paces, but you’ll never guess where this one is going based on the way it begins."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 80,
      "summary": "A character-driven thriller with more twists than an off-the-map dirt road, awards-quality performances from the three leads, a rare sensitivity to the after-effects of horror and a sure directorial hand. Mickle and Damici officially segue from ‘promising’ to ‘delivering’."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "It is a brutal, beautifully shot movie that starts out to be about revenge but then becomes something more, something even more primal and disturbing."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "Before you quite know what’s happening, you’re swerving into another sort of movie altogether. And then another. You might not buy them all, but what a great ride."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "Tense and violent, it grabs you from the first moments and rarely loosens its hold until the last body drops."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "One of those movies that arrives every now and then with no fanfare but a canny sense of how to grab our attention and hold it in a tightening grip."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "\"Dexter” fans will enjoy watching Michael C. Hall as a bumbling everyman terrified of violence. But there’s plenty more to appreciate within Jim Mickle’s gripping adaptation of Joe R. Lansdale’s pulp novel."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "Cold in July never actually turns into the film you think it's going to, and even if that means there's a few unanswered questions ricocheting around your head as the credits roll, it also provides real, rich pleasures as it zigzags into the darkness."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "Any film that teams up gruffer-than-thou icons Shepard and Johnson is bound to go heavy on the testosterone, but Mickle undercuts all this strident manliness with a rich vein of self-mocking wit and paternal angst."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 80,
      "summary": "A superior piece of Texas pulp fiction that starts out like a house on fire, sags a bit in the middle, then rallies for an exuberantly bloody finish."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2014
      },
      "score": 78,
      "summary": "The neo-noir Cold in July operates at a steady sizzle. A body turns up dead before the film’s opening credits: It becomes the opening salvo that propels the characters into a confusing vortex of guilt, revenge, corruption, and vice."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "While Shepard just does his grim, weathered, Sam Shepard shtick, and Hall seems oddly miscast as the tense, prickly Dale, Johnson's easy, gritty charm is a much-needed buffer between their colliding obsessions."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Pulp fiction doesn't come much better than Cold in July, a gritty, grisly - and perversely giddy - crime yarn directed by Pottstown-born indie-film provocateur Jim Mickle."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Then there's the acting, particularly that of Sam Shepard, as an old ex-con without much in the way of limits."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Cold in July has all the qualifications of a midnight movie in the making."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "The first half of Cold is tense and suspenseful, albeit in a conventional way; the second half is sickeningly compelling. It’s hard to watch and hard to look away from."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Get ready to squirm. Be sure to seek out this twisty and terrific sleeper in theaters or on VOD. It's a real find."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "July is solid throwback storytelling, a crime yarn that may not blow you away but can cut to the bone."
    },
    {
      "critic": "Matthew Kassel",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "It has a seedy underbelly that will appeal to hard-core Mickle fans; it’s more deranged than it initially seems."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Johnson ties some of the film's looser ends together and makes you overlook the ones that stay untied. Between \"Eastbound & Down,\" \"Django Unchained\", and now Cold in July, Johnson has a nice little streak going of turning seemingly disposable characters into indelible scene-stealing rascals."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 75,
      "summary": "Cold In July doesn’t always work and it takes quite a long time to get adjusted to its coiling rhythm, but it’s far better than it has any right to be and perhaps, more significantly, is unusually absorbing and memorable."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "As the movie’s resident live wire, Mr. Johnson, obviously having the time of his life, is a hoot, and the feisty camaraderie among these three men gives Cold in July a euphoric goofiness."
    },
    {
      "critic": "Noel Murray",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "Even as Cold In July’s overall arc approaches something of a dead-end, the individual scenes and performances are remarkable."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 67,
      "summary": "As entertaining as it is to watch Cold In July drift, the film has to eventually pick a lane — and that’s where this otherwise accomplished suspense picture runs into the ditch."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 63,
      "summary": "You may be put in mind of HBO’s recent “True Detective” — the low-down Southern locations, the time period (here the mid-1980s), some truly horrible crimes, a general air of diseased moralism — but Cold in July, while stylishly done, isn’t close to that good."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2014
      },
      "score": 63,
      "summary": "While Jim Mickle's compositions lose much of their verve in the film's later half, his regard for the analog does not--and at the expense of perspective into his characters' emotional torque."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 50,
      "summary": "The film's retro, John Carpenter-esque synthesizer score, composed by Jeff Grace, further pushes viewers away."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "I wouldn't expect many people to remember Cold in July come September, when the movie-award season gets underway. But as a guilty-pleasure May release? You could do far worse."
    },
    {
      "critic": "Daniel Green",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "Though not without merit, Cold In July finds Mickle happily stalled in front of the drive-in cinema screens of his youth. Let's just hope he can find the exit."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Cold in July is deceptively unassuming, it's quiet in building the suspense then it savors the violence in healthy dose. The movie aptly delivers a story with twists and turns, surprisingly changing tones as new mysteries reveal themselves. The actors are great, they produce wide range of characterization and ensure their respective personalities are convincing. Its contrastingly dark and bright visual innovate the covert flair without making it looks like a retro detective noir flick.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Featuring a trio of fantastic performances from Michael C. Hall, Sam Shepherd, and a rejuvenated Don Johnson, sporting an off-kilter 80s-esque electro score, and an engaging plot ripe with welcomely subverting turns in direction, Cold in July will probably go down (unfortunately) as one of the most underrated films of the year. True, the film adds little new context to the repercussions of violence and the expectations of masculinity that impose upon simple men. There is also a kind of corn-brained logic to some of the plot twists, but it never comes across as ridiculous, more campy and fun. If I had to compare this film tonally to something else from this year, Blue Ruin comes to mind, as well as the Nicolas Cage vehicle, Joe. While not nearly as seamless in presenting it's thrills as Blue Ruin or emotionally resonant as Joe, Cold in July still earns merit for being a competently made thriller that has characters more rich than we've come to expect from the genre, as well as an unbridled momentum that builds to a (albeit, predictable) satisfying finale. Worth recommending.",
      "total_reactions": 1,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Director Jim Mickle is creating a strong bounty of dark and seedy films that contemplate the American nightmare. COLD IN JULY is not as strong as his masterwork STAKELAND, but it haunts with its brooding tone and sense of sadness. COLD IN JULY is anchored by three wonderful performances from Michael C. Hall, Sam Shephard, and especially the amazing Don Johnson who is at his best.",
      "total_reactions": 1,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "A real thrill ride. The movie changes course quicker than you can believe. It keep you glued to the screen throughout. The three leads were fantastic.",
      "total_reactions": 1,
      "user": "scartwright49"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "Not the best but a long way from the worst, if we use OUT OF THE FURNACE as the worst example.  Yes the story line/plot has some holes in but over all the acting and attention to detail in direction and production is very good. Really catches the 80s vibe. Don Johnson is reborn of late and loving his appearances more and more.",
      "total_reactions": 1,
      "user": "seventhseal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "It's a great history, plenty of turnarounds and spectacular suspense moments. The 80's synthpop soundtrack brings a good atmosphere for the movie. I do recommend it.",
      "total_reactions": 1,
      "user": "car149tobase"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Michael C. Hall sports a trim mullet and 80s moustache as the mild-mannered man who shoots an intruder in his house late at night. The burglar's ex-con father (Sam Shepard) shows up and the intrigue begins. The film starts tightly-wound and produces some early tension, but once the convoluted plot starts to develop, it poses more and more mystery without much payoff.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "Great cast and a director from kinder surprise. What a pointless piece of work. It`s starts with questions and mistery and then John Cleese (almost) shows up and says: And now something completely different! Real waste of three great actors.",
      "total_reactions": 3,
      "user": "Nowak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Cold in July is a fantastic crime thriller from director Jim Mickie with outstanding performances from Michael C. Hall and Sam Shephard. Mickie does a great job wringing tension out of the premise and the end result is that the viewer is constantly on pins and needles awaiting the next twist the film is going to take. Once you think you have a grasp on where the film is headed, it frequently pulls the rug out from under you and changes course yet again. The film is incredibly detailed, right down to the different filters on the film, which transition from blue to gold to red in the film. It is really the defining factor in why this film has really fantastic look. The cinematography ain't too shabby either though. Overall, Cold in July is not perfect, but it is the exact kind of film that crime thriller fans are looking for and, beyond that, it is incredibly well crafted and is one that will definitely stick with you for a bit.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Disappointing to say the least despite having a trailer which makes it look so exciting. The scenario is very promising, beginning as it does with a house burglary that is not all it seems to be, and one settles down to enjoy what should have been an accomplished thriller. Unfortunately, edge of seat thrills are what is sadly lacking. Scenes start promisingly enough, but tension is never sufficiently generated and the film sinks under a morass of unfulfilled expectation. There are twists and turns along the way, but these are not handled skilfully enough to make the film a winner and only a couple of moments come close to creating any kind of frisson. To be fair the last 20 minutes, although very violent, offer some compensation. Overall, though, one is left feeling well and truly underwhelmed by it all.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Kind of so good till Jim Bob Luke's entry.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "A real interesting film that that works in almost every way.  The performances are good and the story will keep you intrigued throughout, also the score was really cool.  It was really close to an 8 but it's currently my highest 7 of the year.  B+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Dexter karakteri olarak karşımıza çıkan Micheal dizi sektöründen sıyrılıp sinemada başarılı işler yapabileceğini bize kanıtladı. Muhteşem olay örgüsüne sahip olan film yüksek puanıda hak ediyor...",
      "total_reactions": 0,
      "user": "Cinemayorumlari"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "This movie is a must watch!!! Stunning performances from lead actors (Especially from Mr. Michael C.Hall), dark but gripping. Also great 80's enactment from the director. Truly, this movie is a gift. We need more like this. Well, to sum up, you do not need a great budget to make a great movie.",
      "total_reactions": 0,
      "user": "MuratBaykurt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "A story that has been done before loads of times in movies but this movie takes that story and gives it a twist. Micheal C. hall plays a family man with a wife and child, and he is a good man, but one night he hears a nose in the house and he goes to check it out by bringing a gun with him; he saw a mysterious man with a flashlight look at his family photos so Micheal C. hall points a gun at the stranger a shouts him by mistake, and throw out the movie he has to deal with some big problems and he has to risk everything to try to make everything right. The music in this movie is like a electric rock music that works so well in this movie that it reminds me of the drive soundtrack. The acting is freaking brilliant in this movie and the directing is outstanding in this movie.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "pretty unique movie. well acted. Somehow manages to keep you constantly on the edge of your seat without much really happening. overall I would recommend Cold in July",
      "total_reactions": 0,
      "user": "Derek1127"
    }
  ]
}