{
  "mc_avg_user_score": 5.7,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Cold Souls",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 2,
      "text": "The critics missed this one in a big way. Not funny, not quirky, and flat-out boring.  I love Paul G., but he's wasted in this film.  Looks like \"Being John Malkovich\", but Cold Souls doesn't hold a candle to that masterpiece.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Charles Kaufman's Eternal Sunshine Of The Spotless Mind is perhaps one of the most cerebral and innovative films of the last decade, winning best screenplay back in 2005. It is no wonder that this film has influenced other works in cinema.  However, although most movies are not too original, Sophie Barthes's debut film resembles Kaufman's work way too closely to Eternal Sunshine and Being John Malcovich, which was also crafted by Kaufman.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "A very strange and clever comedy starring Paul Giamatti as a semi-biographical version of himself.  The soul-swapping premise is perfect for a 90 minute run time... unfortunately this runs at least 10 minutes longer than that.  Subsequently, it gets a little draggy and derivative at times but the overall film is quite good.  Another fine Giamatti performance to add to the long list of fine Giamatti performances!",
      "total_reactions": 0,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "A surreal comedy, with dak humor, about a actor (Paul) who is having trouble with acting (because he can't separate himself from the character he interprets), and see a advertising of a service who retrieve the soul from the body (and thus you don't feel emotions), and storage them - they can borrow you a soul too. The same company also works with a Soul Black Market in Russia, with a mule scheme (and in this points enter Nina the other protagonist), from this point the story of the movie unrolls... it's a well acted movie, with a unusual and interesting theme. My score: 6,7 / 10,0.",
      "total_reactions": 0,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "Un sujet fascinant que l'étude de l'âme qui aurait au moins mérité qu'on le définisse clairement avant de commencer d'envisager d'en faire un film, un film qui ne sait pas sur quel pied danser, celui de la comédie ou celui du drame ?",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}