{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Comet",
  "mc_negative_rating_frequency": 4,
  "mc_positive_rating_frequency": 55,
  "mc_pro_critic_reviews": [
    {
      "critic": "Katie Walsh",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 91,
      "summary": "Anchored by career-best performances from Long and Rossum, and a juicy script that bravely dives into the darkest parts of breaking up and making up, Comet is an original and inventive retelling of an age-old and universal truth."
    },
    {
      "critic": "Michael Nordine",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "There’s an actual pulse and beating heart to Comet; it feels vibrant, alive."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "It features career-best work by Long and Rossum, both eagerly devouring Esmail’s witty script. Yes, some of it is overwritten and a bit too clever for its own good, but more often it’s an engaging character piece."
    },
    {
      "critic": "Nick Prigge",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "Its time-jumping strategy cleverly illuminates the way in which we go over and fixate on isolated incidents in our minds of breakups past."
    },
    {
      "critic": "David DeWitt",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "The visions (a meteor shower, Paris) are romantic and lovely, and there’s a sense of commitment to the enterprise that pretty much overcomes the near bathos and proves involving."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "There is just enough in Comet to keep it from fizzling out entirely – largely in the performances of Long and Rossum – but its conceits also get in the way of its characters, making it feel fussy and convoluted when it aims for something more simple and elegant."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Give credit to Esmail, however, for coming up with an inventive way to tell the story, even if the execution doesn't live up to the idea. He shows great confidence as a director, and the film has a unique look, with heightened reality providing clues that this really is a different world, or worlds, even."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The dialogue has its moments of perception, and Long and Rossum deliver it with conviction and spark."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "Sam Esmail’s fractured romance is beautifully shot and creatively structured, but he never gives us a single reason to root for his mismatched couple."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "Sam Esmail’s first film has a visual assurance that suggests the arrival of a gifted director, but the characters he’s created are so off-putting that viewers aren’t likely to appreciate the beauty surrounding them."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "Although there’s talent on display in all aspects of this time-jumping, visually distinctive independent that rests its commercial hopes on the names of leads Justin Long and Emmy Rossum, Esmail strenuously overplays his hand with the torrent of obnoxious dialogue he asks his male lead to deliver, which is enough to make one want to run out several times for a breather."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "Lapses in the screenplay are mitigated only slightly by the natural chemistry between Long and Rossum."
    },
    {
      "critic": "Matthew Dessem",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 20,
      "summary": "No amount of cosmic fireworks or woozy strings can hide the nice-guy passive-aggressive bullshit squatting at the center of Comet—it’s like a dreamy, swoony De Beers ad that stars Cecil Rhodes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "In Comet two individuals meet, and change throughout the story, which is told in a non-chronological order. This can sometimes be confusing, but has never weakened the message this movie wants to pass.",
      "total_reactions": 3,
      "user": "Joesan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "The concept is interesting enough and the actors give it a good try but ultimately it just doesn't work. It never feels quite right and lacks the complexity to pull off such an ambitious plot line.",
      "total_reactions": 0,
      "user": "dinojay2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "I was strangely disappointed yet enjoyed this film anyways. I was drawn in to the idea of parallel universes but nothing about the film seemed to represent parallel universes, just different points in time. Other than the major disappointment of a misleading description, I thought this was cute and interesting anyways.",
      "total_reactions": 0,
      "user": "Jaelle"
    }
  ]
}