{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 38,
  "mc_mixed_rating_frequency": 23,
  "mc_movie_name": "Confessions of a Shopaholic",
  "mc_negative_rating_frequency": 28,
  "mc_positive_rating_frequency": 23,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "If you know how to use your eyes is a good film which critics the rampant consumerism of capitalist society, talking like a heavy thing, but the movie brings reflection in a cheerful and humorous! Super Hollywood, but really liked it! A movie really interesting to see while the world is undergoing a financial crisis. A movie that besides being very funny, makes us think a little about the real value of things, consumer goods considered, perhaps, futile... and rethink this a bit absurd consumerism and publicist who are bombing targets daily.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "I don't really understand why people didn't like this movie. My best guess is that a lot of the people who dis-liked it had read the books. I have never read the books or really had any desire to do so. I ended up watching this movie because my wife wanted to see it and I actually ended up enjoying it. The acting was solid and the movie moved it's self along at a nice pace. There were some parts of the movie that were a little clunky and out of place and some of the characters could have been deleted. Overall it's a very enjoyable movie and a good date movie.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 1,
      "text": "CONFESSIONS OF A SHOPAHOLIC was like a chick flick gone terrible. I can admit that I do enjoy some chick flicks (such as SWEET HOME ALABAMA and JUST GO WITH IT), but this was one of those, \"OMG! It's SHOPPING day! We gotta get down and PARTY girls! Let's go to the MALL!\"-type of movies. Is that really your type of movie? Even if you are a \"shopaholic\" (quote-unquote) yourself, it just appears stupid to waste a whole hour and forty-four minutes of your life watching a stupid chick show that she CLEARLY doesn't know how to handle her money, along with keeping away from her ex-boyfriend (\"'cause OMG! He's such a stalkerrrrr\").",
      "total_reactions": 0,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "It's not bad. You have to know what to expect. It's simply a cute movie. You just have to know that, and you'll be fine with it. It's the kind of movie I'd recommend for a rent, or to watch when it comes on tv. Will you be moved to tears or bust out of your chair laughing? Probably not, but if you just want to watch something easy, that you can just sit down and enjoy, this is a good one.",
      "total_reactions": 0,
      "user": "ilovekelly75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best romantic-comedies I've ever seen. I don't know why some people hate it that much. It used jokes, which are so dull, so smartly, that you could do nothing but laugh. The fact is, that even though, the cast was excpetional and the message of the movie was unique, the plot was kind of expectable. It always is hard to transfer a book into a movie! Fiser is really talented and the portrayal of a shopacholic really suited her. It was an enjoyable movie, with much laugh and amazing message. The fact that it was expectable, isn't important, because as I was watching the movie, everything happened so fast, that you didn't think: ''Oh  I was sure this was going to happen!   Very optimistic and with promising actors, in my opinion.",
      "total_reactions": 0,
      "user": "enfer99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "This is a real rom-com! Hilarious dialogue, amazing cast, an adorable couple, and lots of trendy fashion! Isla Fisher and Hugh Dancy are both very talented.",
      "total_reactions": 0,
      "user": "kat267"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "I know it's really predictable but I still think it is amazing comedy and plus a real romance.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}