{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 31,
  "mc_mixed_rating_frequency": 45,
  "mc_movie_name": "Cop Out",
  "mc_negative_rating_frequency": 48,
  "mc_positive_rating_frequency": 51,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "\"Cop Out\" is plain terrible. Bruce Willis and Tracy Morgan fails to show any 'buddy performance'. Instead they succeed to present the true meaning of 'preposterously idiotic'. Way to go, Kevin Smith.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "Pathetic...Most of the user comments don't understand what a movie is meant to be. This movie is as good as any video that you can find on Youtube. Bad plot, a slightly funny joke every so often and easily forgotten after 5 minutes.",
      "total_reactions": 2,
      "user": "Leinad177"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "With Bruce Willis and Tracey Morgan i thought this was a good match and it would be funny. It just plainly wasn't at all. The occasional joke that made me laugh didn't over come the amount of time i sat wondering when this was going to end. I'm sorry Bruce but this was not one to be proud off.",
      "total_reactions": 1,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I don't get what was so bad about this movie. It was hilarious! And thanks to this movie, I am now a Tracy Morgan fan! Usually, I was never a fan of Kevin Smith's movies, but this movie mad me change my mind about him.",
      "total_reactions": 6,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "A Film Review by: Sam Fragoso",
      "total_reactions": 1,
      "user": "Duke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Not drop-dead hilarious, but it was still a funny ride from start to finish.  I wouldn't mind seeing it again.",
      "total_reactions": 0,
      "user": "DME"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "Incredibly stupid, but still funny. I really like Tracy Morgan in this, and laughed most of the time he was speaking. He is the only reason this movie was anything good.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "What makes a good cop buddy film? I have seen so many I could give you a list. There are a lot of possibilities involving the cop buddy genre. Unfortunately, Cop Out has none of the factors that make a buddy cop film. Itâ",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "this film is essentaully parodying the old 80s and 90s buddy cop films and has a few funny moments but most of it feels like it just belongs in that era and not 2010. this movie came out 15 years to late even then would just be considerd a ok film at best if it did.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "I'm from Kevin's generation.  Not just chronologically, but also inspirationally.  Fletch is one of my favorite comedies.  As is Stakeout.  As is Lethal Weapon.  All elements clearly and intentionally paid homage (as Tracy Morgan humorously mispronounces at the beginning of the movie).  It was Kevin's not-so-subtle message (along with the cheap synthesizer and Fletch song at the ending fade) that he was about to show a film that had not one ounce of originality, but was meant to be an enjoyable popcorn film for fans of his, fans like him and those who just wanted to be entertained.  I had NO expectations coming into this movie as critics and viewers alike ripped it apart.  From a critical perspective, it's only slightly above average.  However, from the INTENT of the film, it was perfect.  The movie was fun, enjoyable and made me happy to see the genre revisited.  Thanks Kevin!",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "one of the funniest movies of 2010 the plot was dump but what do you expect from kevin smith. the movie made me laugh through whole time and so did the rest of the theater  i was in but i can see why many people didnt like it, its one of those movie either people like or dont.",
      "total_reactions": 0,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "It provides the laughs, but there are tons of better comedies and movies out there. It's funny at times and hilarious at others, it starts off poorly but quickly had me laughing. Surprisingly though the funny moments come strictly from Bruce Willis and the supporting cast, Tracy Morgan almost never made me laugh, the only times he did was when he was on screen with Seann William Scott, when Seann isn't on screen Tracy Morgan just ends up being an annoying character who you would rather see played by someone else. However even with it's (numerous) flaws it manages to be worth a rental if your looking for a laugh.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The film is more funny than not, a predictable buddy cop movie that's fun and enjoyable too watch most of the time, with dialogue laugh out loud funny, even if it does have it's share of it's lameness.",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Generally poor, seen it all before movie which never rises above the level of mediocre. The only section I found myself even remotely chuckling at was the good cop, bad cop routine.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "COP OUT is a stupid movie that isn't even funny, but somehow, I enjoyed watching it. I don't know how  I enjoyed it, but I did.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "Its got a few funny moments but The Other Guys is comparably better because the cop buddies in that movie actually seem like buddies.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "The stories Smith tells about the making of this movie and his falling out with Willis are a 1000 times funnier and more entertaining than this flick will ever be. It tries to mimic these 80's cop buddy movies and they even got Harold Faltermeyer to do the music but it just doesn't work. There is no chemistry between Willis & Morgan, the jokes are bland, the action is pretty standard and sidekicks like Scott can't save it. The plot is riddled with clichés and is as predictable as hell so it's surprising it was on 'The Blacklist' of best unproduced scripts. It had better stayed that way...",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "There is nothing intelligent about this piece of crap. Nothing makes sense. Morgan, as usual, is playing an annoying person whom I find aboslutely boring. Willis is okay, but this movie and its jokes are just...bad. Nothing positive to say about this, I'm afraid.   Diagnosis: Don't see it. The worst film of the year: Not \"thee\" worst, but one of the top 15.",
      "total_reactions": 0,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "It's funny, and funny makes up for a lot of screw-ups.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Cop Out is a true disaster. Every joke it attempts to make falls completely flat. It's rather disappointing because I was looking forward to it, and it was honestly just a lazy movie.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Uma comédia razoável,salva pela ação e por ter no elenco Bruce Willis e Tracy Morgan agradando com seu humor e o excelente Seann William Scott.Porém sim tem seus momentos!!!",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "Kevin Smith What are you doing i know you are better than this. Tracey morgan is annoying as hell and Bruce Willis looks like he's asleep or bored and with this script it's not hard to see why. the comedy falls really flat and why this isn't on more worst films of 2010 astonds me i'd easily say it deserves a space with the other terrible movies that came out that year like Jonah Hex, Last Airbender, Twilight Eclipse  and Alice in Wonderland",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "Willis and Morgan are a devilishly delightful down and dirty detective duo, as Kevin Smith releases their combo inner zany outlaws in a kind of Clerks with badges.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}