{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 12,
  "mc_movie_name": "Country Strong",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 14,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 75,
      "summary": "Country Strong rides pretty high in the saddle, confident in the remarkably realized world Feste has created for her characters."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 70,
      "summary": "Country Strong is a charmer that makes you forgive all of its false notes simply because the talent plays them with conviction."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "That rare ensemble piece in which all four principals are not only compellingly drawn but handled with an astute sense of dramatic balance."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 67,
      "summary": "Hedlund's got a hell of a voice, rotgut-ragged, and whether he's crooning or wooing, whatever he's selling, and no matter how cornpone, I'm buying."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "The glaring weakness of Country Strong is James, underwritten and ambiguous, more like Kelly's pimp than her manager."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 63,
      "summary": "Country Strong is a throwback, a pure, heartfelt exercise in '50s social melodrama."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "Country Strong feels powerfully familiar."
    },
    {
      "critic": "Simond Braund",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 60,
      "summary": "C&W; lovers will lap it up - look out for some stellar Nashville cameos - and there's big-lunged uplift to see you through the cornball plot turns."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 60,
      "summary": "What saves Country Strong from drowning in its own tears are the leads, all four of whom imbue Feste's unabashedly clichéd script with some genuine humanity."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 58,
      "summary": "The film keeps throwing things at you: drunk scenes, adultery scenes, \"All About Eve\" rise-of-the-young-rival scenes. Yet despite the presence of some appealing actors, none of it quite adds up."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "In Country Strong, the Oscar-winning Paltrow gets upstaged and outacted by the kid from \"Tron\" and the snotty brat from \"Gossip Girl.\" Who'd have thought?"
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Shana Feste's screenplay seldom rises above the level of daytime TV; the only actor who triumphs over her trite dialogue is Tim McGraw in a nonsinging role as Paltrow's husband and manager."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Patsy Cline. Loretta Lynn. Gwyneth Paltrow. If you buy that progression, you'll buy Country Strong, an unintentionally campy drama."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Country Strong has a pleasant soundtrack of conservative country music, many of the tunes newly written for the movie, some of them performed by old pros and some of them performed by the cast."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "A tough slog through emotional swamplands. It's murky when it needs to be clear. But Hedlund is the big news here."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Though seriously miscast as an unreformed alcoholic, the bronzed Ms. Paltrow gets by with a thin, serviceable voice (she sings her own songs) and an actor's confidence."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "Paltrow makes the part look natural. She's not impersonating an actual singer, so she seems merely like a twangy, alcoholic version of herself. She should be stopped from dancing in enormous arenas, but her thin voice is rather pretty."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 50,
      "summary": "My God is this script predictable. Each relapse and betrayal shows up announced, and then announced again, a little louder, by the dialogue equivalent of an aggravating doorman."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Country Strong is Feste's second film, and she infuses it with an earnestness that swings between too too much and appealing, the same earnestness that swamped her filmmaker debut last year with \"The Greatest.\""
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 42,
      "summary": "Country Strong is the latest and, in many ways, the least impressive entrant in the achy-breaky sweepstakes."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 42,
      "summary": "When she's (Paltrow) singing, she can pass for someone who's been listening to Tammy Wynette since the cradle; when the music stops, she looks like a tourist."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "Feste's ode to showbiz clichés is closer to contemporary Nashville pop: twangy enough to qualify as Southern-fried, but too slick and disposable to be truly deep."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 40,
      "summary": "Several good performances are left adrift, as the characters roam from scene to scene, singing (quite well) as they go. Even as a sort of long-form music video, it's disjointed."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "A little like modern country music - odd moments of sincerity, heart and authenticity peek through the plastic, the hype and the manufactured hokum."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 38,
      "summary": "Disjointed drama filled with one-dimensional characters and melodrama so Lifetime movie-esque that it careens into unintentional comedy."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 30,
      "summary": "Country Strong comes to spontaneous life from time to time, despite maudlin devices and manipulative set pieces."
    },
    {
      "critic": "Karina Longworth",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "Country Strong is sillier - and more tone-deaf - than Paltrow's advice website, GOOP."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 30,
      "summary": "Feste, who has one previous effort as a writer-director, last year's \"The Greatest,\" fails here to do the most basic thing -- give an audience a rooting interest, or any interest at all, in these four troubled people."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "Country Strong is a country music melodrama, but I'm not sure which country."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 25,
      "summary": "This lame-ass chick-flick sampling of \"Crazy Heart\" is more like country Kryptonite."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The highly anticipated Country Strong began in theatres everywhere on Jan. 7. Although a rather genuine motion picture as a whole, Country Strong certainly was not as strong as it seemed to be.",
      "total_reactions": 2,
      "user": "Sadye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "I personally really enjoyed this movie.  The acting was impressive, the music very good & the writing improved upon itself throughout the script...  I appreciated that Leighton Meester's character had more than meets the eye in the end...  Eager to download the soundtrack!  Now that I've seen it for myself, I agree with Roger Ebert that \"\"Country Strong\" is a throwback, a pure, heartfelt exercise in '50s social melodrama\"  & \"Its emotions are strong and visible. Its motives are clear. Its music performances are so good, we wish they lasted longer.\"   The metacritic rating for this film wasn't nearly as high as it should have been, but I guess worth is in the eye of the beholder and it a well-spent $12 for me!",
      "total_reactions": 2,
      "user": "Hadassah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "More tonally consistent than Black Swan or the Fighter, with a more optimistic and emotionally satisfying view of humanity than The Social Network or True Grit.  This movie authentically believes that human beings - screwed up, damaged, imperfect creatures that we are - can be happy.  That's an incredibly rare sentiment, not just in the movies, but in the world at large.  We should celebrate it anytime it arrives - any time it is expressed, in a heartfelt, emotionally coherent way.  This is a good film.  You should see it.  You probably wont.  You'll probably go to one of the many high profile films being fawned over by the academy this season.  They're all impressive - large, well engineered monstrosities with actors thinking and acting in ways that humans never think or act - and not one of them has the pure humanistic love that this film has for its characters and for people in general.  Go see it.",
      "total_reactions": 2,
      "user": "JamesGatz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I really enjoyed this movie. i mean its whatever you think but it was amazing to me & i read this other review that said city people did nt like it and i was like of course there not going to like it they are city people not country, the movie is COUNTRY strong not CITY strong. This movie is really good and its enjoyable. BEST MOVIE EVER YOU SHOULD GO SEE IT IF YOU HAVEN'T !",
      "total_reactions": 3,
      "user": "londaanmarie88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Bestt Moviee everr !! This moviee is thaa bestt aroundd ! I lovee it soo muchh i went to see it last nightt at 7:05 ! i wanted it to go onn foreverr !! it was sadd yett amazingg !! this is deff a moviee to rememberr ! no matter whatt youu need to see thiss moviee !! this is mostt deff thaa bestt moviee outt !! i havent seen a moviee as GREATT as thiss onee !!! i wishh i couldd watch it agiann or theyy couldd make a partt twoo and thats somthinn i would wanna go see and trustt mehh i suree would go to see itt !!!! i cantt even sayy how AWSOMEE thatt moviee wass !! i freakinn LOVEDD ITT !!!!",
      "total_reactions": 2,
      "user": "AddieLaurenn"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "\"Country Strong\" is country wrong. Sloppy writing gives savvy movie-cum-music fans the impression that this demographically challenged film doesn't know the difference between Nashville and Austin, or in other words, the schism which divides contemporary country music into its inimical sides: mainstream and alternative, just like rock, or any number of musical genres. Alt-country, an all-encompassing label first attached to Wilco frontman Jeff Tweedy's pioneering band Uncle Tupelo(their debut album \"No Depression\" serves as the namesake for the influential magazine that covers the scene), is an industry term which refers to country music made outside of Nashville; it's an antidote to the pop-oriented, ready-to-crossover hits which litter country radio. Sometimes a deconstruction(Lambchop), sometimes a revival(Freakwater), alt-country is a genre wide-ranging enough to please a multitude of disparate fans, all united in their growing disenchantment with the industry's pandering of the adult contemporary market. Alt-country pledges allegiance to Hank Williams. So what side is Kelly Canter(Gwyneth Paltrow) on? Well, the Grammy people don't normally hand out their statuettes alt-country luminaries such as Steve Earle and Lucinda Williams, let alone, six of them, which is how many gilded gramophones the recovering alcoholic has won over her Shania Twain-like career. On her comeback tour, Kelly is joined by two upstarts: Beau Williams(Garrett Hedlund), a rehab counselor whom she's \"dating\", and Chiles Stanton(Leighton Meester), a former beauty queen, disparagingly referred to as \"Country Barbie\" by Beau, just before she hits the stage and gets discovered by Kelly's manager/husband(Tim McGraw), despite being a diamond in the rough. She's coal, actually, but Country Barbie just happens to be a knockout. The moviegoer presumes that Chiles wants Kelly's career, that she will overtake the aging veteran and ascend from opening act to headliner, a modern day Eve(the understudy, played by Anne Baxter, in \"All About Eve\"), but as it turns out, the moviegoer would presume wrong. When Kelly plays her last show and the two performers go backstage to discuss their future plans, \"Country Strong\" does Kelly wrong, unwittingly, the very moment Bo discourages Chiles from recording the songs for her upcoming album. Too \"bubble gum\" for his tastes. His dismissal of the girl's careerism seems categorical, an indication that Beau owns an alt-country aesthetic and doesn't respect the career of his mentor. He's returning to the underground, away from the limelight, where the idealistic singer/songwriter can hone his craft in front of smallish bar crowds, and perhaps become a latter-day X, a Generation Y John Doe and Exene Cervenka(if Chiles listens to his advice and joins him). And yet, when the ungrateful snot performs, even as a total nobody during the opening credits, without having the pressure to cater towards the mainstream tastes of Kelly's fanbase, he sounds less like Jason Ringenberg of Jason and the Scorchers, or Woody Guthrie(and just about everybody in between both sides of the alt-country spectrum), than a multi-platinum selling artist such as Garth Brooks. Does the filmmaker realize that Beau lacks indie cred? A smarter film about country music would cast the would-be cowpunk as a Jack White-type, somebody who would encourage the aging legend to reject Nashville values and make an all-out roots album(similar to Loretta Lynn's \"Van Lear Rose\", produced by The White Stripes frontman himself), which would add creative tension to the preexisting atmosphere of marital discord between Kelly and her commercially-minded husband. Hedlund's character is too diffuse; you're never sure what his motivations are, because there's a disconnect between his musical values and songs. If Beau is so disenchanted with the state of country music, why does he go on a tour which will compromise his stance that the genre is something you chew and throw away? If it's solely out of concern for the potentiality that Kelly's sobriety could lapse, then his speech to Chiles should address the outpatient's self-destructive behavior, not the demerit points of mainstream country music. Does Beau sell out, then change his mind about the Nashville machine? Does \"Country Strong\" have a country clue? When Chiles inevitably heads out west to be with Beau, she's denigrating all what Kelly accomplished by choosing to be a singer-songwriter, as opposed to being a superlative interpreter. As it turns out, the character that Meester plays is diffuse, as well. One minute she's stealing a surefire hit away from her idol, and then the next minute, the Carrie Underwood wanna-be wants to be the next Neko Case. All this depth that the filmmaker instills in both Beau and Chiles(their rejection of fame and fortune) has the unfortunate effect of making Kelly seem shallow. Country weak instead of \"Country Strong\".",
      "total_reactions": 4,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "While not a masterpiece, this is a solid movie. Gwyneth Paltrow, a very under-rated actor, is convincing in showing the fragility, vulnerability of a country star is who is barely holding it together.  Story line could be cliche, but has enough twists and humanity to keep it interesting. While no Walk the Line (which was a great movie), I enjoyed this at least as much as Crazy Heart. However, I give an \"F\" to the brain-dead movie critics who dissed this film.  It did nothing to merit these attacks.",
      "total_reactions": 0,
      "user": "AlphaGriz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I must admit that I am not a huge fan of country music.",
      "total_reactions": 0,
      "user": "GarrettTanner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Because I had heard such terrible things about this movie, it wasn't as bad as I thought it would be. Paltrow was kind of adorable as a drunk, country music star, and the rest of the characters were likable in some way. However, if you want a great movie in this specific genre, check out \"Walk the Line\" - it has more depth and storyline; since this was slightly predictable and cliche. Still, not a total waste of two hours.",
      "total_reactions": 0,
      "user": "jrmint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "Gwyneth Paltrow gives an Oscar worthy performance, and the rest of the cast are solid too. Yet, the strange story and script, and way too over the top melodrama overcome anything that was making this movie Strong. I give this movie 32%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    }
  ]
}