{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 70,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Countdown to Zero",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 11,
  "mc_pro_critic_reviews": [
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "Walker was Oscar nominated for Waste Land this year, and while this occasionally unfocused doc doesn't hit those heights, it's still a valuable and scary film that should be seen."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "The people in this movie should be arrested for delivering this movie. Much of this movie is a lie if you ask me, nothing wrong will go with our nukes, I mean come on, do they really want us to follow along for attention like An Inconvenient Truth and Food Inc.?",
      "total_reactions": 3,
      "user": "Ransack"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "No surprise the new 'Countdown to Zero' disarmament documentary omits life-saving strategies from their genda of banning nukes, like advocating public Civil Defense, to try and better survive nukes in the meantime. The disarmament movement for decades has hyped that with nukes; all will die or it will be so bad you'll wish you had. Most have bought into it, now thinking it futile, bordering on lunacy, to try to learn how to survive a nuclear blast and radioactive fallout. In a tragic irony, the disarmament movement has rendered millions of American families even more vulnerable to perishing from nukes in the future. For instance, most now ridicule 'duck & cover', but for the vast majority, not right at 'ground zero' and already gone, the blast wave will be delayed in arriving after the flash, like lightening & thunder, anywhere from a fraction of a second up to 20 seconds, or more.",
      "total_reactions": 2,
      "user": "IRideRed"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This movie will shock you. It becomes evident after seeing it that it is really only a matter of time before the wrong people get their hands on fissile material. I really don't understand the negative reviews because the movie doesn't try to prove anything. It just shows how much uranium/ plutonium is out there and reviews well documented occurrences which it's nearly fallen into the wrong hands.",
      "total_reactions": 2,
      "user": "shaunmed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This was a documentary deals with the danger of atomic weapons, I would highly recommend it might not be a documentary worth of ten but at least it does a good job at proving its point, which is as long as we have atomic weapons, sooner or later, for one reason or another one is going to detonate. And in the world we live in more and more nations are seeking them, and the more nation have it the bigger are the chances of being used, and if one uses them they start a chain reaction and before you know it is MAD (mutually assured destruction)",
      "total_reactions": 0,
      "user": "byzan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "A film documenting nuclear warheads and how one single bond of atom can destroy the entire New York City. What else can we ask for in a doc? Countdown to Zero uses facts and expert opinions at the same time to convince us that nuclear weapons are, well, bad. With gather facts that director Lucy Walker (Waste Land) deliver so smoothly with great style, Zero is another great documentary that Walker had deliver in 2010. It is scary to see that highly enriched uranium is so easy to access and how terrorists can get it just about anywhere. It is scary to see how many mistakes were made over the years with nuclear weapons on hand. And it is scary to know that US, the nation of peace, was the one that started nuclear weapons. After seeing the film, it gave me a whole new aspect about nuclear war. Before seeing the film, I had no worries about nuclear war, now, I'm scared sh*tless! Countdown to Zero really is an informant that informs you to go out there and do something about this situation.",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "The history and the technological detail of the film is fantastic...That said, if I was a terrorist, then watching this film would be a fantastic way to get my knowledge base up on what it takes to build a nuclear bomb.  The film is almost a 'how-to' for dummies!",
      "total_reactions": 0,
      "user": "jbourk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "The film makers don't try to disguise their disarmament agenda behind this picture, nor should they.  It's eye-opening and upsetting but the mood is often positive and encouraging, as though this is still a threat but it's a threat that we're gradually moving away from through diligence and knowledge.  Recommended viewing for everyone!",
      "total_reactions": 0,
      "user": "CooterPatooter"
    }
  ]
}