{
  "mc_avg_user_score": 7.5,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 33,
  "mc_movie_name": "Crazy Heart",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 131,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 10,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I rented this movie on blue ray. I had to turn it off 1/2 way through the picture and send it back - it was that bad! This type of movie gets publicity from review whores who all jump to try to outsmart the other critics, but in the end, the critics are all full of s--t! This movie sucks!",
      "total_reactions": 10,
      "user": "zig16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Crazy Heart is a well directed film in which all the actors are doing a very good job. Some scenes are masterfully composed.  The script, however, is slow and predictable.",
      "total_reactions": 1,
      "user": "MattDaniel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Crazy Heart is a real American movie, it's not a remake or reboot. It's original work that needs to be seen. Of all the generic movies of violence and bad storytelling it's very refreshing to see a movie that cares for its characters and plot.  Crazy Heart tells the story of Bad Blake (Jeff Bridges) a washed-out country singer who's not a very likeable guy. He curses, drinks, and very lazy. He use to be the top dog in country but we can just tell he screw that up. His agent clearly forces him and yells at him to get up and do a performance and not to f@#k it up. He refuses to collaborate with another country singer named Tommy Sweet (Colin Farrell) which we get a notion of a disagreement between them from the past. Bridges performance is so good that we can tell the age of experience from his actions and mannerisms. We can tell his sadness from his actions with the way he acts and his judgments. All of these things start to change once he meet Jean Craddock (Maggie Gyllenhaal) a writer and her son. At first is sexual but then he starts falling for her and for his son. He decides to reinvent his life and people it's not easy for him.  Bridge's performance is downright awesome and finally the recognition he deserves. He comes from a huge career of movies and he nailed this one. He created a character that was believable. There were times when we wanted to cry for him and when we were angry with him. The supporting cast was very good as well. Gyllenhaal was very good and gave a very good supportive role. Colin Farrell as well who does more action flicks shows that he has more meaning and dramatic depths. Yeah the plot is familiar with music stars but the performances form the actors rise to another level. I think this movie shines a light on movies where we lost the effect that movie does for us. This is a movie who has important things to say, films are suppose to be teach aspects of life and to entertain. Some movies are satires and some movies are protests. You want to know what Crazy Heart teaches, see it yourself and let it teach you.  One of the best films of 2009.",
      "total_reactions": 0,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Crazy Heart might not break new ground, but it's a satisfying experience for the two lead performance. Bridges is totally worthy of his Oscar win as a down and out drunk and former music legend, and Maggie Gyllenhaal has never given a performance this good. On the other hand the great Robert Duvall as a supporting performance is woefully underused, and Colin Farell is just okay as a protegee that has surprassed Bridges in star power. This is a good little film, definetly worth watching.",
      "total_reactions": 0,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Understated, genteel movie making. Relationships realistically portrayed, without melodrama. Sad, but not at all maudlin. Not at all a blockbuster, just a great little film. Very pretty cinematography too.",
      "total_reactions": 0,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "Crazy Heart is a superbly acted movie that transcends the story.  Any less of a performance by Jeff Bridges or Maggie Gyllenhaal would have made this a sub-par film.  Story-wise it never connects with me.  Not enough time is spent on specific emotional elements between Bad and Tommy, Bad and his son or even Bad and Jean.  However, you can extract the pain from Jeff's performance alone.  He was extremely worthy of his Best Actor Oscar.  While I've seen him in a rugged role before, he takes a character that is clearly meant to exhibit a painful presence and, in spite of the strength of the story, makes you see and almost feel his pain.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "Crazyheart is a reasonably well-made film,but not worthy of an 83 rating. The pacing is uneven and even feels a bit lethargic in spots. Bridges is good but not truly outstanding in this part,but then the character  is incomplete. A common occurrence in films today. We see the surface behavior but  hardly any explanation for the self-destructive tendencies. Sometimes critics are very demanding  and want  all those bells and whistles and othertimes the film and the performers get a pass.Looks like they were in a good mood here.",
      "total_reactions": 0,
      "user": "zazou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "A portrait of a great but fictional songwriter. Message: Life's way better without the booze. Not very exciting, but well done. ----------------------",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Of course, Bridges steals the show. He IS the show. That's the whole point of this film.....following this country legend all around the west and feeling the envy he feels while witnessing the perfection he once had. We then witness his gains only to feel them ripped from his life after the mistakes me makes. The film never quite spikes with enough energy aside from Bridges singing the same song over and over throughout the duration. The performances are all there, but the energetic undertones are stagnant which can make this film drag depending on what mood the audience is in. Bridges makes this film interesting, and that's that.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Crazy Heart is a mediocre movie at best - it has a solid (but not exceptional) soundtrack, but the story moves too slowly and only approaches anything close to real drama in the final 30 minutes. The cast turn in a real mixed bag of performances. Despite the acclaim he received for the role of Bad Blake, I felt Jeff Bridges tended to coast through the film, churning out a re-hash of his washed-up loser \"greatest hits\". With the addition of a bored-looking Robert Duvall, and the ridiculously miscast Colin Farrell, Crazy Heart would be in danger of becoming a thoroughly unmemorable viewing experience, but thankfully it has a saving grace in a emotional, rousing performance from Maggie Gyllenhaal. Despite being a scene-stealer, her character, the single mother and music journalist Jean Craddock, makes some unbelievably poor choices of judgement that threaten to make the whole film's narrative laughable - I don't care how much you like country music, Jeanie, what on Earth would attract you that fat, alcoholic windbag in the first place, let alone make you think it was a good idea to let him look after your kid? In all fairness, Crazy Heart does get much better towards the end. From it's pretentious and plodding beginnings, it eventually becomes something watchable, has a pleasing story arc of downfall and redemption, and, perhaps most importantly, Bridges looks and sounds like a country music star. In the end, though it may have  the odd glimmer of brilliance, Crazy Heart isn't anything special. If I wanted to watch an engaging and entertaining film about country music, I'd choose Walk the Line over this any day.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "The Dude is the Dude. Bridges: he makes all the difference in this movie. There are many similar movies to Crazy Heart, but Bad Blake's history is unique for Bridges' ability to portray an old country star whose best days are long gone and their place is taken by alcohol. It's worthy to see just for the few scenes with Bridges and Duvall together: they are great actors because when they act they seem no actors at all.",
      "total_reactions": 0,
      "user": "JudgeHolden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "Crazy Heart is a slow, tiresome pile of country trash that falls into a depressing hole by the end. With Maggie Gyllenhaal being a miscast, the characters never connect and the movie becomes drawn out.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Jeff Bridges is most deserving of his Oscar for this role. The music works wonderfully to help tell the story of this man, and shows just how powerful a lyric can be. A very moving movie.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "Featuring a powerhouse performance from Jeff Bridges, Crazy Heart may not be a direct adaptation of any single musician, but it does feel like it. Crazy Heart follows the music biopic formula from start to finish and never deviates, showcasing all the classic trademarks: classic songs, broken friendships, failed relationships, and alcoholism. Aside from Bridges, the acting is good, but Crazy Heart's narrative formula is tried and true. While conventional, it is a good take on the music \"biopic\" formula and is a thoroughly entertaining film, heartbreaking at times, plus it has great music. That said, Crazy Heart is most certainly not too original and is far too typical to be better than pretty good to good. Jeff Bridges' performance is what truly lifts this one up and over the competition.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "You take a thoroughly realistic yet original plot,  combine it with brilliant acting, and you get a stunning motion picture. Jeff Bridges deserved the Oscar and then some. I really loved this.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Although it treads familiar territory, I really don't care because Crazy Heart is so well done that it's easily one of the most effective and satisfying films of its kind in years. The performances are great; Maggie Gyllenhaal is great (as usual), well deserving of her Oscar nom., and Jeff Bridges is brilliant and completely deserved his Oscar for Best Actor. Also, two key supporting characters played by Robert Duvall  and Colin Farrell really knock the film out of park. Solid script, great music, perfect cast, Crazy Heart is one of the best films of 2009.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Joshua Rothkopf from Time Out New York   so a manufactured kid-in-jeopardy climax and Blake’s rehab stint blow the mood. Until then, this is great American acting.\"",
      "total_reactions": 0,
      "user": "Masoud1986"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This Scott Cooper film without Jeff Bridges would be nothing, Jeff Bridges puts on the best performance of his career, and gets some nice supporting backup from the rest of the talented cast: Colin Farrell, Maggie Gylenhaal and Robert Duvall",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Jeff Bridges pulls off a pretty good performance in Crazy Heart. I find this performance a little overrated as the whole cowboy role is a role Bridges has been known to play on many occasions. He won an Oscar for best actor in a weak year but don't get me wrong his performance is still strong. I just wasn't blown away by it. Crazy Heart is interesting but certainly slow, I understand that its not for everyone. Bridges bond with the young boy in the film is really cute and the music is really good too. Who knew Colin Farrell could sing so well.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "A decent biographical film with good performances, but the story is just simply slow and boring. Also this relationship that is basically the center of the film was totally implausible. However the music is nice.",
      "total_reactions": 0,
      "user": "FilmQueen"
    }
  ]
}