{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 74,
  "mc_mixed_rating_frequency": 29,
  "mc_movie_name": "Cyrus",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 52,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Cyrus is one of those rare cinematic pieces that comes around every once in a while, and leaves you walking away from your theater seat with a bundle of different and mixed emotions. Reilly and Tomei dazzled me with their suprisingly great chemistry. The tension built up between Reilly and Hill is also noteworthy as you can feel the internal struggle between Reilly's will to stay with the love he much desires and needs and his urge to stay aloof from that love and her disturbing and age-regressed son who cause the couple endless turmoil. The character developments are what makes Cyrus a delightfully and, at the same time, bizzare spectical that can't afford to be missed.",
      "total_reactions": 2,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Although the actors here are doing a great job, the material they are given are mediocre to say the least.  This film could appeal to dreamers who think that at their lowest psychological point, a warm, caring and sexually hungry Marisa Tomei will come to their rescue.",
      "total_reactions": 1,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "This film is best described as a romantic drama not a comedy. there a couple of funny moments. but if your expecting a film like stepbrothers or superbad (like i was) The lol silly joke comedy films. then your not expecting the right thing. john c reilly is great in this film. so are the other two main characters. its such a strange film. and you might find it ridiculous how they overplay emotions etc and i couldn't argue with that.(matter of opinion) but its a deep film in a way, mainly focused on emotions it was such a different film i was glued to the screen the whole time trying to figure out the characters. and what was gonna happen. if your a thinker you might love this film. you really cant tell what is gonna happen next and that's something i really liked. the main character is really like-able and maybe you can relate to him. i think cyrus might act the way he does because of an over sensitive mother who doesn't put her foot down and no father in the picture? anyway i enjoyed this film i can understand why some people wouldn't like it. but i found it great. took me out of reality for 91 minutes.",
      "total_reactions": 1,
      "user": "greenpaint"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "What a stinker of a film. Dreary and dull, it drags on until the end credits. The rotting corpse of Humphrey Bogart, dug up and strung up like a puppet, would have emoted more than any of the three lead actors.",
      "total_reactions": 2,
      "user": "tinyleviathan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "i enjoyed this movie a lot.   it was dramatic and funny.   it was a good movie.   it was weird a little.  but the movie overall wasn't bad.  its for mature people.  if your not mature enough then don't watch this movie.",
      "total_reactions": 2,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "He calls her \"mommy\"; he is Frank Booth(Dennis Hopper), a very bad man who calls Dorothy Valens(Isabella Rosselini) mommy during a game of sexual role-playing. Frank is the \"baby\", and \"baby wants to f***\", to Jeffrey's horror as he peers through the closet slats, while the gas-huffing baby exerts his will on Dorothy. Jeffrey(Kyle McLachlan) is privy to the secret pecadillos of men and women he was never meant to see. While Molly(Marisa Tomei) may not wear blue velvet, she wears the burden of being manipulated by a man with psycho-sexual tendencies; her son Cyrus(Jonah Hill), a twenty-two-year old man who tricks his mother into thinking he's still a baby. Does baby want to f***? Maybe. As a visitor(or by the son's estimation, an interloper), John(John C. Reilly) can only hazard a guess as to the man-child's motivations when Cyrus slips into the bathroom while his mother showers. At some level, albeit a non-sexual one(we think), this familial unit fosters an intimacy that promotes the potential for transgressive conduct between adult and adult child, as demonstrated when Molly, prior to the uni-sex occupancy of the lavatory, looks more like Cyrus' lover than mother when she dances her way through the front door, unaware of John's presence on the couch. Molly is Cyrus' muse; she inspires his music and photography. The main reason that Molly goes to the party may be her realization that their close relationship could be on the verge of consumation. At the park, passersby probably see Molly as a \"cougar\", especially when John and his girlfriend(played by Catherine Keener) sit down for a picnic with their new friends, who seem more in love than anybody else in the movie. If only \"Cyrus\" had the intestinal fortitude of a film like David O. Russell's \"Spanking the Monkey\". Molly's heart-to-heart with her son could have turned into an admission that he led him on(that's what the moviegoer sees, but \"Cyrus\" doesn't acknowledge), but as its written, the mother merely takes responsibility for Cyrus' arrested development. Cyrus, after all, is in love with Molly. The last time we see the young man, he's headed for the garage, the potential site of a suicide attempt, like in Billy Wilder's \"Sabrina\".",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Hilarious movie! Jona Hill and John C. Reilly have get comedic chemistry. It's all about the characters and the awkward situations their put in together. Jona Hill has an acting turnaround here where he can be just as emotionally dramatic as he is funny.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "I loved this movie. It was funny, quirky, weird, and even suspenseful at times. Impeccably cast, and the acting superb. John C. Reilly, Marisa Tomei, and Catherine Keener are always a delight but I have a new respect for Jonah Hill's acting ability.",
      "total_reactions": 0,
      "user": "Cheryl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "I wasn't very into Cyrus. I appreciated the interesting and unique plot, however it was genuinely stupid, and is overrated. All of this positive buzz is just hype. I'd see it on DVD, but just telling you it was a pretty boring, crazy, comedy-drama-thriller.",
      "total_reactions": 0,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "This movie had so much promise. It started out just fine and actually makes you think that there are going to be some really funny moments and then it turns into the most awkward story that I have ever seen. Instead of taking the characters and playing to their strengths, the film puts them into extremely boring moments where you start to dislike each one of them. After about halfway into the film you start to wonder why they even made this script into a movie in the first place. This would have made a boring TV episode, so making a feature film out of it was ridiculous. John C. Reilly is a very funny actor but this movie wasted every bit of talent that he has. I couldn't tell if it was supposed to be a comedy, a drama, or some kind of new and weird genre that we've never heard of.  Overall the movie was boring, uneventful, and more than a little creepy. No laughs, no tears, just disappointment.",
      "total_reactions": 0,
      "user": "BroncosOwnYou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Solid performances from John C. Reilly and Jonah Hill, but Cyrus suffers from plenty of cliche writing and a really dull plot. Though it offers lots of drama and the style of directing is very bold, Cyrus doesn't and won't get anywhere with that boring plot. Because of the plot, the film sometimes gets really slow and very annoying.",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "although there is a relaxed, unforced feel to the movie which allows you to enjoy the great cast, after awhile the supposed tension between JCR and JH just wears thin and the directors seem reluctant to add any depth to it.",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Usual American Indie affair that lacks any of the charm or natural humour of the films it is so desperately trying to imitate. It's such a strange story to tell that it makes you wonder whether it's worth telling at all. It is nicely edited, with a good performance from John C Reilly (who is never bad, in anything) but it starts off dull and continues to be so throughout.",
      "total_reactions": 0,
      "user": "simlew86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "When you have 30 minutes to spare, watch it. Fast forward a lot and try",
      "total_reactions": 0,
      "user": "uwehook"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "I am a fan of  \"smart comedy's.\" Films that make you laugh but also have a message. This film seemed very genuine and realist. I like the character development off both Cyrus( Jonah Hill) and John( John C. Reilly).  Marisa Tomei also delivered a great performance as Molly the emotionally fragile mother trying to raise a son who problem leaving the nest and becoming a man.",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Considering everyone involved in this movie, it should have been much better. It was just extremely boring and the only comedic elements of the film relied far too heavily on annoying the protagonist. I could barely keep this movie going until the end. I'm severely disappointed.",
      "total_reactions": 0,
      "user": "JohnTibbitts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "I thought this was more on the quirky drama side than dark comedy. I didn't find Jonah Hill believable here which was a bit of a let down. Overall drab, and and kind of annoying. Much like its lead actor.",
      "total_reactions": 0,
      "user": "nickclarivette"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "A horrific nightmare is just the start. The movie was boring with a lazy script that seem to be made in 2 days. Not funny at all and I could barely get through this movie. Good thing it is a short movie because it was begginning to give me a headache.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "A near-perfect balance of comedy and drama.",
      "total_reactions": 0,
      "user": "wrightm1"
    }
  ]
}