{
  "avg_user_score": 6.1,
  "metascore": 52,
  "mixed_rating_frequency": 2,
  "movie_name": "Da Sweet Blood of Jesus",
  "negative_rating_frequency": 2,
  "positive_rating_frequency": 3,
  "pro_critic_reviews": [
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 88,
      "summary": "A dizzying hall-of-mirrors stunt, a horror remake as autobiographical X-ray, and a work of fantasy that serves as a decadently cleansing creative exorcism."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "This great-looking, often spellbinding film also shows Lee’s sometimes pervasive theatricality threatening to chomp into the story. But the swirling strangeness of “Sweet Blood” makes it his most mesmerizing work since the underrated “Bamboozled” (2000) and “25th Hour” (2002)."
    },
    {
      "critic": "Richard Brody",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "For all its loose ends and unanswered practicalities, its wild urgency is thrilling. It defies the expectations fostered by Lee’s prior films; it steps back even as it moves inward. It is, in the modern-classic sense, a late film."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "Unrepentant, uneven and unique, Da Sweet Blood of Jesus proves that Lee can still make a film worthy of the arguments it will most certainly start."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 67,
      "summary": "Whenever Lee ventures away from the outrageous particulars of the plot, \"Da Sweet Blood of Jesus\" transforms into a stylish means of exploring contemporary struggles in urban black America by depicting it as a ballet of navigating personal and practical conflicts alike."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Scored by Bruce Hornsby, Lee’s film veers all over the place tonally, juxtaposing scenes of spurting gore with soothing jazz. Hess’ WASP-y mansion, with its huge photo portraits of African warriors, is an interesting study in mashing up race and class stereotypes, though the film’s rambling plot may leave your brain feeling a little mashed, too."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "It’s a genre-bending mash-up, a non-vampire vampire movie about class, race, love, and cruelty. It consciously seeks to marry its diverse influences in an attempt to present something between schlock and art house, between passionate gore and urbane chill. It contains multitudes, and not always all that well."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "Da Sweet Blood of Jesus isn't entirely successful – and certainly offers few new insights into the nature of addiction – but it remains a welcome change of pace."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "While this return to indie roots frees up Lee's often gifted image making, his usual pace issues and penchant for jagged flourish over sustained feeling keep it from achieving a rich, strange, sexy and sad whole."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It’s not especially horrifying, or even very thought-provoking. It is touching, however, because it represents one frequently misunderstood, intermittently great filmmaker’s tribute to another."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Da Sweet Blood of Jesus is a bold but wildly uneven, bloody mess of a film, sunk in large part by the subpar performances by nearly every major character in nearly every major role."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "A ponderous vampire romance that surely ranks among the writer-director’s most sedate, immobile studies of black life in America."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Jesus, meanwhile, exhibits all of Lee's weaknesses — clashing tones, careless pacing, the straightest dude's hand-in-pants idea of lesbianism — but also just enough of his might and madness that the Lee-minded shouldn't miss it."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 50,
      "summary": "Da Sweet Blood of Jesus is at once too much and yet somehow not enough. On the one hand, it’s exciting to see the always envelope-pushing Lee working without a studio- or distributor-imposed safety net... But while the film never lacks for ambition, it fails to satisfy emotionally or intellectually in the ways Lee intends."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Never once does the film feel sharp on black identity (as did Bill Gunn’s original), and the terror is theoretical only."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Da Sweet Blood Of Jesus is the best kind of failure, impassioned and singular, but it’s a failure all the same— glacially paced, stiffly acted, shapeless, and for the most part tremendously boring. It’s an intriguing idea ruined by the execution. There’s a fine line between hypnotic and somnolent."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 40,
      "summary": "As allegory, the picture requires viewers to connect most of the dots without assistance, offering a preachy bit of dialogue once or twice but failing to use action or the camera to say much about non-sanguinary addictions."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 37,
      "summary": "Although Lee briefly engages in some fascinating ideas linking the vampire’s existence to cultural empowerment, preservation and survival, he squanders that potential in leaden soft-core cliches that usually wind up with him ogling the female form."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 33,
      "summary": "Da Sweet Blood Of Jesus is, without question, bold, distinct, and idiosyncratic filmmaking with its own voice. Unfortunately, that doesn’t necessarily mean it’s good or in any kind of reasoned key."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Spike Lee's latest is unusual and worth checking out. It's highly stylized, definitely weird & sometimes slow, but a constantly compelling experience. Soundtrack by Bruce Hornsby is evocative, creative & wonderful.",
      "total_reactions": 0,
      "user": "TVJerry"
    }
  ]
}