{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "Dark Skies",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 122,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephanie Zacharek",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 83,
      "summary": "Dark Skies is about the fragility of family, a muted meditation on how precious it is...it does affirm that genre filmmakers who work with their eyes, their hearts and their brains still walk among us."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2013
      },
      "score": 67,
      "summary": "More chilling than terrifying, this movie’s predatory aliens are creatures that mostly mess with people’s heads prior to abducting them."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 67,
      "summary": "While there are some scares along the way, Stewart foolishly gives away the whole kit and caboodle plot-wise with an opening quotation from Arthur C. Clarke."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 63,
      "summary": "Mostly, though, it all ends up feeling like a lost, minor episode of “The X-Files:” A little scary, a little silly and catnip for those who want to believe."
    },
    {
      "critic": "Ken  McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "As a shocker, Scott Stewart’s (Priest) film is solid, but it’s the thoroughly depressing backdrop that you’ll take away."
    },
    {
      "critic": "A.A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "The real mystery of Dark Skies isn’t who’s pulling the paranormal pranks — it’s lanky visitors from above, not vengeful spirits from beyond — but why Dimension is treating this reasonably effective potboiler like something that should be hidden away at Area 51."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "In the end, a pretty good buildup to OK payoff without any real surprises en route makes Dark Skies feel just enough above average to make one wish it had one memorable spark of conceptual inspiration up its sleeve."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Dark Skies certainly parades textbook genre trappings...But those elements are employed with consummate dexterity."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 58,
      "summary": "Good horror films are imprinted by the fears and anxieties of the day, converting real-life atrocities into abstracted scares; mediocre ones are imprinted, too, but with trends and commercial formulas. If Dark Skies resurfaced on TV or brain implant 20 or 30 years from now, horror fans would be able to carbon-date the film almost to the month."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Approaching the first half of the film fairly conventionally, Stewart then misses the opportunity to capitalize on shifting to more full-on genre mode."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie builds a moderate, if less than monumental, level of spookiness, regardless of your ignorance. It’s a workmanlike piece of suspense."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Alien abductions are a truly terrifying idea, and building an alien abduction movie on the template of \"Poltergeist\" is a great idea. But \"Poltergeist\" had one thing Dark Skies is sorely in need of: follow-through."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s a passably chilling bit of nonsense that builds on the past, the tropes of the genre, and relies on them for the odd jolt and the occasional ironic laugh."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "Really the biggest problem with Dark Skies is that Stewart can never quite decide just what story he is telling — a slow-burn horror parable or paranoid invasion flick — or whether to focus on this character or that, instead struggling to string together scares regardless of how they fit together overall."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "The pacing is so tedious and the action so unexciting that it's a real thrill when J.K. Simmons shows up as a wry alien expert — and a huge disappointment when he disappears a few minutes later."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 38,
      "summary": "In extending itself to reach a conventional feature length, however, it becomes a below-average programmer in which brief moments of interest are interrupted by long stretches of boredom."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "Dark Skies is a bore that even the most forgiving genre buffs will find difficult to defend or endure."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "Scott Stewart's Dark Skies is the definitive horror film for the Tea Party era."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 38,
      "summary": "The characters are reluctant to believe in the face of overwhelming evidence, mostly because writer-director Scott Stewart doesn’t want to play his hand too early. By the time the movie is over, it’s easy to see why he kept his cards close to his chest. He’s not really holding anything."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "I'm generally a fan of alien encounter movies and this one is not bad by any means but not that fantastic a thriller either. Unfortunately the \"scares\" are mainly a few scenes that make you jump. However, I found the story to be fairly engaging keeping my interest till the end. What keeps this movie from being a higher score in my opinion is that in comparison to other fantastic alien movies like \"Signs\" it just falls short in the key aspects of a great suspense/thriller with aliens.",
      "total_reactions": 1,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "Just boring. Offers nothing new to the genre. Some scenes had tension, but overall falls flat. I hope one day they will make something original in the genre, something that offers a new perspective to the subject. The acting was okay, but the whole movie was dragged out to 97 minutes, yet everything could be told in 20 minutes. We only see the aliens 5 minutes, and their motivations are totally unclear (they are extraterrestrials so we are not supposed to understand it...but I think their actions should make at least some sense. They can build space ships to travel light years, yet they pranking and scaring humans...) Not recommended.",
      "total_reactions": 1,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "This movies goes into the \"I was pleasantly surprised\" category. The trailer was a yawner and the apparent premise initially screamed \"overdone!\" A family is creeped out by a a bunch of weird, unexplainable things happening in their suburban home. While this movie is not original as a whole, there are surprisingly original and creepy scenes to entertain even the most jaded horror fan.",
      "total_reactions": 1,
      "user": "mbeckford"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "It’s the kind of movie you watch, enjoy and then forget about its existence. The suspense is well maintained, and the ending has a nice twist, I would recommend it for those days you have nothing better to do and wanna spend the whole day watching movies.",
      "total_reactions": 1,
      "user": "GabiiRRS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Anything that has to do with aliens i'm in. I Seen the trailer for this while i was at the theater and i called what it was write off the bat \"ALIENS YO\" even though it didn't look that good and while the film does the whole possession type thing i didn't find it annoying like the other films that have come out the past couple years about people being possessed. The film is not scary at all and is rare on the \"JUMP SCARS\" scenes",
      "total_reactions": 1,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Having seen the film twice now, I have to say it has been an amazing experience to watch this film. From the plot to the acting and the cast; the film represents the feelings of both parents and their children in a way that draws your attention to the film like many other films cannot manage doing. As a horror film enthusiast and having watched hundreds if not more than a thousand horror films to-date; I have to say this is one of those films that I will not hesitate to make my friends watch and re-watch myself again and again.",
      "total_reactions": 1,
      "user": "brightonguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Like I've said before, Blumhouse never disappoints. It's a great alien horror film, and the ending makes me want a sequel really badly. The mother is a great actress, and I would love to see her on the screen in a drama, love story, or comedy. Even more horror films! To sum up, this is a well acted and crafted horror film and if you are scared of aliens on earth, this will scare you a bunch.",
      "total_reactions": 1,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "A pretty entertaining movie with a nice twist at the end. The only negative thing I have to say is that the husband (Josh Hamilton) is a terrible actor. Other than that worth the price of admission...",
      "total_reactions": 4,
      "user": "nycbunny"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "Wait for the DVD, this movie sucked on so many levels! Of course the social media and pr managers of this \"movie\" will say otherwise (as indicated by the overly enthusiastic reviews by some here and on Facebook, which leads one to wonder, \"who's paying these people to give such glowing reviews for such an awful movie?\" If you value your hard earned cash just watch \"Close Encounters\", \"Poltergeist\", \"Paranormal Activity\", and \"Signs\"...all those movies were much better executed AND had better actors. On the plus side, there were some extraordinarily funny scenes, they were unintentional, yet funny all the same.",
      "total_reactions": 3,
      "user": "boydimages"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "This is the worst alien invasion movie ever. Weird, unexplained things start happening to a family. Turns out they're being tormented by beings from another planet, while we're tortured by the filmmakers. There's no logic behind what's happening, so instead of a payoff we get an ending that just… But not before we endure 97 minutes of dull family drama with endless ominous music, which is necessary to compensate for the total lack of suspense in the direction or editing. There's lots of portentous atmosphere with no payoff. Watch the trailer and you'll get the highlights.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Dark Skies is definitely a thrilling piece with impressive production value. Its not cheesy like many films of the same genre. Would absolutely recommend to friends.",
      "total_reactions": 2,
      "user": "ChristopherT"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "not good at all!!!!!!ZERO it was not good it was small potatoes it was cheap it was junk would not tell you to go see it very low rate no qualitynot not not not not not not not good at all!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! should be consider donation money to the actors just not likeable at all.",
      "total_reactions": 6,
      "user": "rose0684"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "The ingredients are delivered without much style of flair, and the results of the movie makes for a pretty bland dish. Stewart does possesses talent--but he just hasn't created a satisfying film with it. In all three instances \"Priest\" (2011), \"Legion\" (2012) and now \"Dark Skies.\" The potential for a compelling story line and terror is there--but not achieved to satisfaction.",
      "total_reactions": 1,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Good, scary but poor pacing and poor VFX but good scary as hell time!",
      "total_reactions": 1,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Dark Skies is an ET movie full of creepy and bizarre visuals. Entertaining and quirky at times. I really enjoyed JK Simmons role in the film! It's worth going to see.",
      "total_reactions": 1,
      "user": "funk336"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This movie was awesome had a few good scares and a well acted plot. The aliens in the movie were mysterious and didnt really show much detail besides sithoulettes. The characters werent bad like most scary movie casts. Overall a great movie that people should watch atleast once. The only thing I have to complain about is the bizare ending that has a clever twist but seems rushed. All in all a great scifi psuedo horror flick.",
      "total_reactions": 3,
      "user": "C3realkillah"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "Just watched the final thirty minutes of Dark Skies. That was enough. My immediate thought at the conclusion was this is an extremely edited version of the first 3 episodes of the 2002 Taken series. One of the pivotal characters even has the same name, physical stature and age as the former.  Some suspense, however if you're one of those who likes everything tied up in a bow, you WILL be disappointed. The only thing more terrifying than the suggestion of what happens after the conclusion, is that the writer(s) figured, \"I'll wait 10 years shorten it down to 2 hours, release it as a feature(?) motion picture, collect 20M and call it a day.\" I'm surprised somebody wasn't knocking on they're door. Steven? You be the judge.   K",
      "total_reactions": 1,
      "user": "KMariner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "I don't know what it is about this movie, but it got me spooked! There are moments of genuine terror in this movie that had me watching nervously. Wondering what would happen next had me nervous and gave me chills. I would love to see more alien themed horror movies, similar to this one, in the future. That being said the movie does have some flaws that get in the way of the fright. For one there are a lot of unintentional funny moments in this movie (the bird scene is hilarious XD), and I always hate when horror movies focus on things like family drama, which unfortunately this movie does. But when the movie is focusing all of its power and freaking you out with its mystery the movie is enjoyable and makes up for its duller moments. I wasn't expecting much from this movie, especially considering how stupid the trailers looked and how recent horror movies I've watched have not scared me at all. But Dark Skies proved to be the exception, providing some nice scares. I recommend this to any horror fans out there. It's really unique and we need more movies like it. It's just a shame that some of the goofier moments hold it back from being considered a truly great horror movie, instead of just a good one. Still I would rather watch a good horror movie rather than another crappy one.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Despite my love of Science Fiction, I had no desire to see Dark Skies. Someone from the groups Facebook page messaged me, telling me it was right up my alley, so I decided to give it a shot, and you know what, they were right! Dark Skies is portrayed as something completely different in the trailers and ads. I was under the impression that it was another of these crazy awful demonic possession films, but it was a whole lot more interesting than that. The Barrett family is experiencing some weird occurrences in their home that they can't explain. At first it seems like the kids are pulling pranks, but they come to realize it's much more serious than that. The family has become the target of an alien race known as the grays, and are fearing an eventual abduction. Felicity herself, Keri Russell, gives an interesting performance with a cold, quiet, intensity that was something to see, but the real star of the movie was young Dakota Goyo. Goyo is best known as the annoying little kid in Reel Steel, but he's grown up quickly, and was simply the most realistic character in the whole film. What makes Dark Skies unique is it's fantastic ending, which was very unexpected, and much more eclectic than one would expect to see in a film like this. Some fans complained that the ending was too reminiscent to that of 1408, and while it was similar, unlike 1408, the ending of Dark Skies wasn't nearly as predictable. The ending comes out of nowhere and as far as I'm concerned, it's the cherry on the sundae. Dark Skies wasn't as technical or scientific as the most of the Sci-Fi I like, but it was still quite entertaining and the ending made a good film that much better.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "You'll stumble upon this movie, on a cable movie channel. You'll think, \"this looks silly,\" but you'll keep watching, and soon you can't stop watching because even though (you tell yourself) the plot is silly the acting is so earnest. The movie suddenly ends, and you think, ok, that was mildly disturbing, but still, a silly premise. Yawn, time for bed. But this movie embeds itself into your subconscious. And in six months you realize, it is one of the most terrifying movies you've ever seen. This movie taps into something we can't describe but we know has something to do with why we are afraid of the dark and the abyss. It is literally chilling.",
      "total_reactions": 0,
      "user": "davidjden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "The movie is very interesting and intriguing. I was a bit skeptical about the movie because it was from the producers of Paranormal Activity, but the movies is very good. It made jump out of my bed a few times and bite my nails while I was waiting to see what was gonna happen. It makes you wonder what is going to happen next  and whatever happens next is not what you though was going to happen. I strongly recommend this movie.",
      "total_reactions": 0,
      "user": "kevin1616"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "This movie is terrible. I could barely even sit through the entire thing I was so bored. The acting is awful, and I feel like the writers went out of their way to make you hate all the characters. I hated every character in this movie, I couldn't care less what happened to them after it was over. The plot is terrible. Basically there are aliens that watch humans while they sleep, and then after like 6 months of watching people sleep they eventually take one of the family members. While okay in theory, it is a failure in practice. The aliens have a creepy presence, since you never directly see one, but they never really do anything. I don't understand why they have to watch people sleep for 6 months before they can finally take them. Also, almost everything that happens in the movie is completely unexplained. Watch the trailer for this movie and you can see every scary/creepy part of the entire movie. Literally. I knew exactly what was coming up every single time something scary happened. Note that these scenes never scared me, I could just tell it was the directors failed attempt at scaring us. I felt embarrassed for the directors multiple times throughout this movie. A kid wets his pants then screams for like 15 seconds straight for no reason whatsoever, and it did nothing but hurt my ears. I can't thing of a single good part of this movie other than the premise, which failed anyways. This movie is horrible, I would have been better off throwing $10.50 out the window than wasting my time and money watching this movie.",
      "total_reactions": 0,
      "user": "TogetherLemon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Yay! We have crappy effects with horror mixup! Good for you! I think Dark Skies wasn't really worth it. It's bland and boring nothing too dazzling about a stupid horrible family. Aliens! No just CROWS. CROWS make damage to your house and take over the skies. Cool and bad.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Joined Paranormal Activity, Insidious, The Apparition and Dark Skies left. It is a complete shame.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This film is OK but there is nothing new or overly inventive here.  This film is not a bad watch, but they basically take different things from other invasion movies and they turn it into this film.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Excellent Sci Fi/Horror movie",
      "total_reactions": 0,
      "user": "Jonathan117"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "One of the best alien encounter movie out there, it's a great thriller with horror elements! If you like alien setting, few missteps won't matter much.",
      "total_reactions": 0,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Dark skies es algo tipico y entretenido de Blumhouse que con sus interesantes ideas trae buenas peliculas con bajo presupuesto, es un tema interesante que logra desarollarse bien con los pocos escenarios, es decir la pelicula no se hace aburrida, cada vez se hace menos predecible cosa que no es fuerte de muchas peliculas de terror, buena actuacion y apariciones terrorificas entretenidas",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "Even though this supernatural thriller makes you jump multiple times, it is a bore from beginning to end. I was so very eager to see this movie because it was from the producer of Insidious, but this film is one real bad and boring horror movie.",
      "total_reactions": 0,
      "user": "kewlgeek555"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I was not expecting to like this movie, but it turns out it is a unique horror movie with a decent about of things going for it. I liked the aliens in this movie, they were quite creepy and they worked very well and felt very fitting. The acting and writing was also pretty good compared to most horror movies. What stands out as a flaw in Dark skies is it's lack of scares. There are a nice amount of scares in there but I would have preferred a tad more. Overall this movie is a good movie that is worth your time.",
      "total_reactions": 0,
      "user": "Johnluna1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 2,
      "text": "I lean in to both the horror and sci-fi genres.  As such, I felt very charitable toward Dark Skies throughout.  However, the ending is a complete punt.  This movie set out to tell a story, did so fairly well until the final 5 minutes, then completely ruined the movie.  I wish I had the time invested watching this back.  Stay away, even as a rental.",
      "total_reactions": 0,
      "user": "wrightjeff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Dark skies is not a bad film. It has suspense and a great dark atmosphere that will make you many times kind scared. It has much suspense and you will wait for something unexpected. However there is not a twist in that film and something that annoyed me was the fact that everything was planned from the aliens and that only annoyed me just because it reminded me Sings which is one of the worst films ever made. In this movie interesting things happen and it is easily watched. It has not any scares but it is good. It is better than Sinister as sinister had a really bad ending. The last scene of that film will make you scream and chill from disturbance. A good horror film.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Not at all is this movie bad, but its not great either. The movie is slow but that's how it gets its effect on the target audience. Its certainly better than most pg-13 movies out there. The acting is average from all accept Keri Russell she does a great job. Definitely worth a watch if your interested in extraterrestrials.",
      "total_reactions": 0,
      "user": "Mk_Ultra"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Dark Skies was an extremely surprising and very scary movie. It's like a haunted house movie turned upside-down. It has a couple of jump scares, a good amount of suspense, and a heavy atmosphere that all come together to create a memorable and terrifying film. Even if the pacing is a little off, Dark Skies is going to scare you. It's best not to know anything about this movie before you head in, and definitely watch it in the dark.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "In an ocean of horrible movies this horrible movie wasn't really all that bad by comparison. I am interested in UFO's and I am curious to hear what other people have to say about them etc. I don't know if I believe that people are abducted by them and this films basically about UFO abductions. There was a crispness to the film that I put down to the new technology used to shoot movies today. I thought the ending was a bit weak and it seemed that the family was subsequently being investigated after one of their sons disappears at the end. That created a funny ending. Not ha ha funny-weird funny. I think it is better to be less obvious when dealing with this type of subject matter-the film was a bit too obvious. Like they say, a good movie is 'a slice of life.'  It was that.",
      "total_reactions": 0,
      "user": "emeraldcity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "This film isn't a 10 but rating it higher because it doesn't deserve a user score of 6.5.  This movie kept me entertained.  Keri Russell is one of my new favorite actresses.",
      "total_reactions": 0,
      "user": "DRomeo916"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "Interesting mash-up of some standard horror tropes with alien abduction.  It had its tense moments, but it felt a bit incomplete by the end. It seems set up for a Dark Skies 2.",
      "total_reactions": 0,
      "user": "tethysdust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "This had great premise to start out with, and hte acting was decent (Keri Russell plays a better Keri Russell here) but it  was saddled with a weak story and abundance of cliche's that doesn't know how to use it.",
      "total_reactions": 0,
      "user": "SquintyReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Works perfectly well as a turn-off-the-lights (and be-willing-to-play-along) piece of sci-fi-sprinkled horror amusement.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "Bon, c'est très simple, il s'agit d'un gros épisode d'X-Files sans le célèbre duo du FBI mais en plus mou et plus chiant (ce qui est un exploit en soi). La routine de cet infâme navet est consternante : les proctologues de l'espace (les Roswell évidemment...) sont venus enlever l'ado de la famille, l'ado complètement con d'ailleurs, une nouvelle dont tout le monde devrait se réjouir ! et baliser une piste d'atterrissage devant la baraque pour célébrer l'occasion avec \"welcome visitors\" sur un paillasson géant.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}