{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 23,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Dark Tide",
  "mc_negative_rating_frequency": 5,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Despite a talented cast lead by Halle Berry, director John Stockwell fails to take more than a bite out of this lackluster shark thriller."
    },
    {
      "critic": "John Anderson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "It's a murky sea that surrounds Dark Tide. A soap opera with shark attacks, picture contains a few alarming sequences but loses its grip on its material -- and the viewer -- in a swirling vortex of visual confusion."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "Long before it ends Dark Tide capsizes and sinks with a sickening glug."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 20,
      "summary": "Dark Tide, directed with hopelessly flagging energy by John Stockwell, barely musters up enough interest to be thuddingly bad."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Great and realistic shots of sharks, but the movie is amiss because it fails to create the suspense it should have. I don't think the script was strong enough, or was it the direction that failed to capture the thrill it should have, hard to pick. The cast was certainly good enough and the shooting of the sharks was so good I doubt anyone can complain about that. We can see how fake the famous 'Jaws' sharks were when we see this movie, however the suspense of the Spielberg flick was unmistakable, whereas there is virtually no suspense here. The musical score of Jaws played a big part in the suspense building while the score of this movies just does not work for me, and I mean not one bit.",
      "total_reactions": 2,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "horrible, awful, i hate it, i never have seen a movie like this, bad, bad, bad guakala but the only thing good is effects but no more awful",
      "total_reactions": 0,
      "user": "sebastian1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "The only reason I watched this movie the whole way though was in anticipation of the action I was promised. The underwater photography was average but this was all that delivered. Overall  the new Smurfs movie was more of a thriller",
      "total_reactions": 0,
      "user": "jodavies"
    }
  ]
}