{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 81,
  "mc_movie_name": "Date Night",
  "mc_negative_rating_frequency": 44,
  "mc_positive_rating_frequency": 110,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "For a comedy with two very talented leads and several very good supporting actors, \"Date Night\" was incredibly unfunny and severely disappointing. I was saddened at the stupidity of this movie's jokes and the mediocre way it developed the film's recurring gags. Carell and Fey both need to rebound.",
      "total_reactions": 2,
      "user": "nboley08"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "Above the tedious Hollywood \"love comedy between married couples\" formula, \"Date Night\" is actually impressive because of its capacity to fuse action, humor, and romance.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Steve Carell and Tina Fey are effortlessly hilarious, and you get the sense that they could have done more for this film if given greater control of the somewhat limited script.",
      "total_reactions": 1,
      "user": "aabender002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Overall, not bad. Some clever lines and clever writing, however some slow lulls in the middle of the movie. A few lines were so funny that you couldn't help but laugh out loud, and of course Tina Fey is always a delight.",
      "total_reactions": 1,
      "user": "Cheryl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Perhaps the most prominent comedic figures on television, 30 Rock's Tina Fey and The Office's Steve Carell collaborate with Shawn Levy (Night at The Museum) in Date Night. First off, a movie such as Date Night  does not possess a goal to make a cerebral and qualitative experience; instead it aims its course to create endless laughs utilizing elements such as slapstick comedy.  This film performs this genre's criterion to perfection, as it ultimately creates a gut-wrenching humorous experience.",
      "total_reactions": 1,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Tina Fey and Steve Carell are a perfect duo of comedy and this is a great sit through. It does become hard believe at times, but the comedy takes the attention.",
      "total_reactions": 1,
      "user": "Fortinbras"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "The first time i watched it it was funny and i thought it was well preformed. The second time i watched it I thought it was HILARIOUS!! This was a great performance from two actors that really know each other well and made it the best they could. Certain areas were a little dragging but overall it was very good.",
      "total_reactions": 1,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "I am a huge fan of both Tina Fey and Steve Carrell, and had eagerly awaited this film.  I feel Carrell's comic skills are often marginalized, and I believe Fey is simply a genius of comedic writing and performance.  Having said that, I wish I liked this movie more. ________ The story is sufficient in that it keeps the pace of the movie quick and agile, and provides ample opportunities for both comedic absurdities and action thrills.  Carrell and Fey share a chemistry that works comedically.  Most of the movie is amusing, and there are a few genuine \"laugh out loud\" moments.  But overall, the movie has a bit of a generic feel to it., I would recommend it as a light, popcorn movie night rental. ________ Special mentions to Mila Kunis and Best Actor Oscar Nominee, James Franco, as they deliver an entire act's full of hilarity in one inspired scene.  Also to Common and William Fichtner in their respective roles as two of the film's \"heavys.\" >>>> My full cinema profile here: http://bit.ly/MyMovies",
      "total_reactions": 1,
      "user": "Efreet69"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "Date Night is a stupidity movie with randomly unfunny scenes. Carell and Fey weren't that funny in the movie. The lines and the script were pretty dull and not quite chuckle. I wasn't even laughing in the theater,when I saw some audiences were not laughing and have awkward chuckles,but little bit people were laughing that much. If only Carell and Fey could be more funny should be done written perfectly on this movie,not kid-friendly dull unfunny scenes in this stupid movie. I know that I seem too harsh for a good movie on Rotten Tomatoes and to all those critics who like this,but there you'll go,Date Night I can't live without.",
      "total_reactions": 2,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "The plot is a little bit weak, but Tina Fey and Steve Carell brought the whole movie up. They were hilarious together. It wouldn't be good if they weren't the cast.",
      "total_reactions": 2,
      "user": "carlthehero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "I don't get the low reviews? I thought this was an all around good movie. Carell and Fey were both very funny and the film had a solid story line. Worth a watch.",
      "total_reactions": 2,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 3,
      "text": "A Film Review By: Sam Fragoso",
      "total_reactions": 5,
      "user": "Duke"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "I've just watched the Date Night trailer, and it is both funny, slick and well made. If it is any guide, the movie will have thousands of hilarious gags.",
      "total_reactions": 3,
      "user": "NormanB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "Don't listen to the negative reviews, this movie was fantastic. I couldn't stop laughing, and the plot wasn't bad either. Un-realistic? For sure. But that doesn't mean it's a bad movie.",
      "total_reactions": 1,
      "user": "Misslove14xx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "If you are going to see this movie thinking that it will be slap-stick  funny,  you may be disappointed, I really liked this movie, it was very funny but it is funny in a more subtle way than other comedies. Much of the humor is based on real life experiences in a way similar to what you would see on the tv show \"modern family\" which makes it enjoyable because you can relate to Steve & Tina's characters (early scenes!). Steve Carell & Tina Fey do an excellent job of playing the normal married couple whose life has become somewhat mundane, there is plenty to like here, I'm really surprised at the negative reviews. It is even funnier the second time I saw it.",
      "total_reactions": 0,
      "user": "moviefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Originally I didn't like this movie as much, but after watching it again it had its moments. At time's it lagged a bit but for the most part you were kept in the thrill of the moment not knowing what to expect next.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "It's clear that Fey and Carell are trying to make the most of the material given to them, and they are mostly successful in rescuing what would otherwise me a very mediocre movie. Both leads are funny, charming, and realistic, proving their comedy chops. This definitely belongs in the same company as Fey's other film, \"Baby Mama\"--funny, but not \"30 Rock\"-funny.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "Date Night is a hilarious movie that really captures how not so young anymore couples act, the great chemistry between the leads makes it even better, it's ultimately a very hilarious and enjoyable movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This Is A Good Movie, Dont Get Me Wrong...",
      "total_reactions": 0,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Caught this on a plane while flying across the Atlantic and enjoyed it more than I thought I would. The script is pretty standard but the two leads, Steve Carell and Tina Fey as well as an excellent cameo from Mark Walhberg; make Date Night a fairly enjoyable way to spend an hour and a half.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "So, to begin with, you've got this screwball comedy starring Sarah Palinâ",
      "total_reactions": 0,
      "user": "10sne1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Steve Carell and Tina Fey are decidedly the strongest point of this comedy, as without their chemistry it would have been awful; the rest of the movie was a bit cartoonish and cheesy.  However, add to that leading duo a surprisingly hilarious Mark Wahlberg and cameos from Mila Kunis, James Franco, and several others, and you've got an enjoyable actor-driven comedy.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "A married couple (Steve Carrel and Tina Fey) stuck in the routine of life with two kids and separate jobs, have hit a rut.  They have their same date night, at the same restaurant, with the same meals and the staff knows their names.  They yearn for more, but seem to have lost the ability to really connect with each other.  After hearing their close friends, who they thought had a great marriage, are splitting up, they decide to have a fancier date night in the big city.  They take a reservation at a fancy restaurant for a couple that didnâ",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Date Night in short is a thrilling comedy which happens to include a married couple to bring a little romance. When Phil (Carell) and Claire Foster (Fey) discover their married friends oncoming divorce they decide to try a little harder with their own marriage by making a special date night in the city, after arriving late to a popular restaurant with no reservation the couple decide to steal the table of a couple of 'no shows'. A case of mistaken identities later and the boring married couple find themselves on the run from dirty cops and gangsters in a date night to remember.",
      "total_reactions": 0,
      "user": "unironedman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Date Night is a hilarious and funny comedy film that features great and comical performances from Tina Fey and Steve Carell.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Although the uneven story doesn't quite live up to the talents of it's two comedic stars, it still has it's moments of laugh-out-loud humor, action and romance. 2 1/2 out of 4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "I really enjoyed the film. The only bad parts are the 2 sappy parts in which Steve's character questions if his wife would leave him if given the chance because of their boring life. Then at the end in which Steve's character says he would relive his life the exact same way if given the chance. Besides those two parts, It was a rather good comedy that was filled with good cameos and good supporting actors.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Let's be honest this movie totally depends on its stars to provide the laughs if it wasn't for them this movie would be down there with the zeros. Carrell and Fey are the royals of comedy and have incredible chemistry in this movie and provide the majority of laughs. But unfortunately for every good laugh there is a worst off scene which totally destroys the movie, let's be straight the whole story line is kind of stupid and the \"action\" is a bit too low-key. Date night could have been a fun romp between two great stars, but it totally lacks the rhythm to keep a movie of this kind going.",
      "total_reactions": 0,
      "user": "Jefflyn90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "Despite an all-star cast, that reads like a who's who of comedians, the much anticipated, Date Night, from Night At The Museum Director, Shawn Levy, failed to deliver in a big way. Of course there is that old saying about too many cooks in the kitchen, but that wasn't the problem here, as individually, the performances were pretty good. What I didn't like about the film, was a lazy story that hasn't only been done before, but seemed to just run around in circles. The Foster family is going through your typical dry spell as a married couple with kids, and the news of a recent friends divorce has them worried about their own relationship, so they decide to start having a regular date night again. Not wanting to wait at a fancy restaurant without a reservation, they claim to be someone else, who are very late arriving to their reserved table. The Foster's think they're just stealing a reservation, instead they are stepping into the lives of two people who are wanted by many different people for many different things, leading to the wildest night of their lives. This story had some great potential, but once again, if these writers would stop worrying about PG-13 vs. R, in regards to who will go see their films, and just let the story take off in whatever direction it's going, the film could have been so much better. Instead, the writers hold back, because they don't want a raunchy comedy, they want a date movie, and the result is a mediocre comedy that should have been so much better than it was. Date Night is good for a chuckle here and there, but otherwise, the story goes in circles, it's predictable, and it wastes the talent of a terrific cast.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "It was funny and worth the watch if you have a few hours to kill but other than that it wasnt all that special. The plot was rather straight forward and rather stupid at times too. The acting was good and there was suprisingly a decent amount of action as well. It was ok but I expected better.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Pure entertainment. Tina Fey and Steve Carell are magic together. Whether or not the comedy is effortless, it's sharp and hilarious. Date Night is one of those films we don't want to end.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Let's be honest this movie totally depends on its stars to provide the laughs. But unfortunately for every good laugh there is a worst off scene which totally destroys the movie in parts.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Somewhat comedic. I liked it, but didnt expect anything that happened, i wont spoil, but lets just say go in with an open mind, cause everything happens at random. Not as funny as i thought it would be, but it was good. Overall very worth watching. Some suggestive parts, so i dont suggest children watch. And if your a teen, dont watch i with your parents. Awkward.",
      "total_reactions": 0,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Very subjective but I love Carrell. Never seen Fey before but love this movie. Wahlberg is awesome. 10/10",
      "total_reactions": 0,
      "user": "RogerLegrande"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "It`s a movie worth watching if you have a sense of humor, but don`t expect anything epic out of it. It`s an avr. comedy movie. No reason not to see it but won`t be missing anything if you don`t.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Despite its poor editing, frequent lapses in logic, and overuse of convention, \"Date Night\" is surprisingly made at least \"watchable\" thanks to a good handful of funny scenes from its two amiable lead performers.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "A decent comedy that gets a recommendation because of good chemistry by the leads Steve Carrel and Tina Fey.  Just don't expect to see a great comedy.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Date Night is a fine film for a Friday night, just nothing special. It plays into cliches of \"the people get thrown into dire situation and rise to the occasion\" and \"bored married couple's life gets interesting\". Nonetheless, it's just typical genre fare in the best sense it can be.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Carell and Fey's chemistry just chews up the screen with funny humor, great action. Director Shawn Levy's direction is to raunchy and he action was okay. Grade B",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Its a comedy that feels really long, yet rushed at the same time. There are funny parts, but the unfunny ones(there are quite a lot) seem to take the joy at the few chuckles this rather lame comedy has to offer.",
      "total_reactions": 0,
      "user": "ryanneevman"
    }
  ]
}