{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Daybreakers",
  "mc_negative_rating_frequency": 23,
  "mc_positive_rating_frequency": 107,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "\"Daybreakers\" portrays the rise and fall of democracy, but in a bloody dumb way.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "the movie is enjoyable but the plot is alot weaker then i though going to see it ,the acting is not to good not much to scare you the vampiers dont really act like vampires whitch is where i though the movie really diapointed me the most. If it is a boring raining day this movie will keep you enterained for a couple hours.",
      "total_reactions": 1,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Interesting premise, absurd fix. How does the sun cure their vampireness? Maybe I didn't pay enough attention to the movie, but I liked it as a vampire movie up until that point. And to think, I thought Willem Dafoe would only improve upon this one.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "Big, dumb and lotsa fun, Not ashamed to say I thoroughly enjoyed this late nite on TV. Some good frights, Willem Dafoe, what more could you ask for? Best consumed intoxicated, I imagine.",
      "total_reactions": 0,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "I wanted to see a real vampire movie because of the Twilight invasion. And I loved it. Very hard to pick out what's bad about this movie. Finally no more embarrassing sparkly skin when in the sun. They stayed out of the sun, because they would catch on fire if they were in the sun. Interesting premise, intriguing story, Great acting, a real vampire story, and its an entertaining story and its fun. Its a bloody good time.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Takes a bit to get into but it was actually rather good for the most part. I enjoyed it. The cast was decent ,I expected better, and the action was good. Its one of those films where you either like it or you dont and I liked it.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "In this movie vampires have taken over and the human race is almost extinct leading to a blood shortage, if a blood substitute or a cure isn't found soon the vampires will turn into even more horrible bat like creatures, yeah it's as goofy as it sounds, and it ends up being an ok movie that most vampire maniacs will enjoy but for everyone else, it's an ok movie from beginning to end.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "WHAT IFâ",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "This is one of those cases where the users know more than the critics, but Metacritic doesn't weigh the numbers right.  If you cull the people who don't like horror movies or are bored with vampire movies, you end up with people who see this movie for what it is:  a very imaginative variation on an old model, with high production values and fine actors, and a number of political and philosophical issues.  The plot is not without its imperfections, and at times it comes close to jumping off the plausibility track entirely.  But as a conceit of how societies get propelled by basic instincts that aren't evaluated or controlled, and lead to unexpected difficulties and political nightmares, it is a movie that provokes thought while delivering on the imaginative potential that the vampire fantasy allows.  Life vs. death as an option -- the basic vampire theme -- is often available to us in real life, for a while, anyway.  Or a better life with ethical compromises, vs. a poorer one with no such comprises.  Whole societies face those choices, and often choose the wrong option.  Sometimes societies stumble upon a cure for their ills that fixes everything,  almost by accident.  Sadly, that is more often a fantasy.  I give this movie an enthusiastic 7.",
      "total_reactions": 0,
      "user": "DLWilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "I liked it. Nothing special but worth the time spent. I can`t possibly deny the good try that was made with the story. I must say I haven`t seen anything like it. In times when everything about vampires is 'been there done that', this flick surprised me. I also appreciated the way in which the story got by. Make no mistake - there`s lots of blood and brutality in this thing. The special effects are cool, the idea about the de-evoluted vampires also got portrayed well. Ethan Hawke and Sam Neill did a good job, with Willem Dafoe one class above them. The drama and character development behind it are as shallow as they can get, although this did not cause the film to get boring in any way. The ending is not easy to forsee but is a little dissapointing. First of all original, good action movie.",
      "total_reactions": 0,
      "user": "MustisTheCat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Daybreakers has an interesting sci-fi/fantasy premise - as the result of a virus, vampires become the dominant species on the planet, and struggle to survive once the remaining human population, and their life-giving blood supply begins to dwindle. The film has satisfying and effectively moody visuals and good direction from the Australian Spierig Brothers. In the lead role as a vampire scientist searching for a human blood substitute to feed the starving vampire population, Ethan Hawke us just how consistent his performances are, and Sam Neill keeps your attention, with a quiet menace about his character, who's basically a vampiric bureaucrat. And of course, it goes without saying that Willem Dafoe looks cool with a goatee on his face and a crossbow slung over his shoulder. The film, as a new take on the vampire myth with a satirical edge that comments on world energy crises is, for the most part, far better than it has to be. It does have a disappointing finale, issues with pacing, particularly when we spend any amount of time away from the cool vampire world and with the dull, depressing humans, and there's the odd bit of clunky dialogue. The explanation of one of the key plot points is also incredibly unsatisfying. For what it is though, Daybreakers is a decent example - it doesn't bring many new ideas to the table, sure, but just about everything is done well, and I enjoyed it far more than another recent modern take on a vampire film - 30 Days of Night. There's potential for expansion of this intriguing world in a sequel too, but whether this will manifest at all, or as anything beyond a direct-to-DVD feature remains to be seen.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "I watched Daybreakers rather reluctantly due the average critical reception it received at release and after watching last night I indeed can confirm how average the movie was from its production values to its entertainment value. Daybreakers has onboard some good actors with a some what different take on the future of vampires, but unfortunately neither the actors nor the story premise are very interesting to watch. The characters are pretty one dimensional and fail to make us care. Was there a love story between two characters in this movie? Was it a friendship? I after watching I'm not sure. In the end of the movie did I care to the outcome of the characters dilemma? Kinda i guess, but I wasnt sure. As the screenplay plays out it feels awkward and muddled; and some of the editing during scenes feels unnatural. The vampire theme in movies has been used a lot now, A LOT, and as I mentioned earlier the premise seems interesting at first but the film makers don't do a lot with it and in the end isn't particularly bad but hardly memorable either. I give Daybreakers a 5/10, it does exist, it is watchable, but is average - not particularly bad, but not good either.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Daybreakerâ",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "DAYBREAKERS is a gory, well-acted and well-directed film that is quite interesting and visually impressive.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "I hate vampire movies! From Dracula to Twilight I find the whole genre absurd and have never enjoyed a film that has featured vampires, until now. I chose Daybreakers, because it is a new idea in an otherwise stale genre. It's about a modern day utopian society where the bad guys have actually won! Modern society has adapted, from industry and technology to entertainment, to accommodate a society run by vampires. Humans are nearly extinct and the vampires are looking for a blood substitute to sustain their population. On the other side, the small groups of remaining humans think they may have a cure, but need some willing vampires to help them. Even though this film features vampires, it's more of a science fiction film. about two groups trying to deal with the problems of a futuristic society, and it was really well done. Ethan Hawke stars as a vampire, who refuses to drink human blood. He feels empathy for the humans and doesn't like what his race has become. Hawke was one of these young actors who had nothing but looks. When he first started he was really nothing more than eye candy for bad movies. Since then, he's really worked at becoming a better actor and today, he thrives in Sci-Fi movies like this. He's paired with some veterans of the genre, Willem Dafoe and Sam Neill, both of whom add that aged wisdom needed to support this young cast. This film is a terrific example of how innovative and entertaining science fiction can be, but it's so much more. There are action scenes, romance, and even some gore thrown into the mix, and the result is one of the best Sci-Fi film I've seen all year. The violence and blood may turn some people off to the film, but for me, this really became a can't miss gem.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "It was definently interesting but overall a boring film. It also lacks originality as well. The cast is ok but I am a bit disapointing that Hawke wasnt better in this film. A little disapointing overall imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "With some pretty solid world-building on the part of the Spierig brothers, and an incredibly engrossing slew of sci-fi/horror visual effects, \"Daybreakers\" thankfully restores some faith to the vampire film sub-genre.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "A total surprise! I have consistently been dumbfounded by the vampire craze in movies and television as of late, but then a small film like Daybreakers came along in a month like January, and I found myself wanting to take back all my preconceptions. Daybreakers is so much fun! It's amazing concept that executed with style.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Daybreakers had an interesting story and at the end it was one of the best vampire movie i have ever seen.There is a lot of blood and the actors are really good.The only dumb thing is the cure,like if the sun would help them.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "This was a really good movie. Absolutely LOVED the plot. It actually had a meaning and showed just what people would do in desperate measures and times.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}