{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 79,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Dear White People",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 42,
  "mc_pro_critic_reviews": [
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 100,
      "summary": "Dear everyone – stop whatever you’re doing and go see Dear White People. One of the freshest, funniest and most vital films of the year."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "Dear White People isn't perfect. And yet the flaws really don't matter. This is the best film about college life in a long time, satiric or straight, comedy or drama."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 100,
      "summary": "Like the movie itself, every character is a beautiful swirl of contradictions."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 91,
      "summary": "Simmien both mocks and provokes the nature of our seemingly progressive times by illuminating misguided assumptions and fears embedded in forward-thinking discourse. But Simien's relentless screenplay is never too self-serious or didactic, instead pairing culturally-savvy brains with a goofy grin."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "Simien's film is one of those rare works that teach by appearing not to — you laugh at some of the antics, cringe at others, but the film is so entertaining you may forget you're learning something."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "You want to see this movie, and you will want to talk about it afterward, even if the conversation feels a little awkward. If it doesn’t, you’re doing it wrong. There is great enjoyment to be found here, and very little comfort."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 90,
      "summary": "The small miracle of the movie is that Simien finds so many laughs in what are genuinely bewildering issues."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "Although there are moments when the characters in Dear White People sound as if they’re reciting different sections of a thesis, overall Simien’s screenplay is tight, funny, smart and insightful, and his direction has just enough indie feel without becoming too self-conscious or preachy."
    },
    {
      "critic": "Steven Boone",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "It's fortunate that, like \"The Social Network,\" Dear White People is so charismatic in form and style that we easily forgive its surfeit of priviliged narcissists."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 88,
      "summary": "Dear White People marks an auspicious debut for writer-director Justin Simien, an African-American who laces his satire with delicious mirth and malice."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "Identity is the film’s true subject: As much as he pokes fun at the foibles of a privileged white America, Simien is more interested in the ways his protagonists conform, or refuse to conform, to society’s idea of them."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 80,
      "summary": "Do the right thing — take a break from summer spectacle to check out this assured and eloquent indie."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "The most impressive thing about Simien's film is his script, which he wrote. With multiple protagonists and multiple storylines to serve, he deftly manages to keep a number of balls in the air -- without losing sight of his film's purpose."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "The film is called Dear White People, but it might as well be called Dear Everybody. It’s hilarious, and just about everyone will wince with recognition at some point in the film."
    },
    {
      "critic": "Lorraine Ali",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "The complicated narratives don't distract from what this film does best: make you laugh about the things that make you furious."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "Comparisons to Spike Lee’s movies are unavoidable, particularly with a setting that recalls Lee’s “School Daze” and a conclusion that echoes “Do the Right Thing.” But Dear White People is a film of the moment, and an essential one at that."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 80,
      "summary": "A title like that needs balls of brass to back it up. Luckily, this fiery college comedy from feature-debuting writer-director Justin Simien, loosely inspired by a series of scandalous black-face parties at all-white fraternities, is full of punchy intelligence and barely concealed anger."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 78,
      "summary": "The cast is game and Siemen’s trenchant observations are the mark of a filmmaker with something to say – an increasing rarity in this day and age."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 75,
      "summary": "The pitch on Dear White People is that it’s “Do the Right Thing for the Obama generation,” which is both an oversell and a disservice to Justin Simien’s witty satire about race relations on a fictional Ivy League campus."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "This is an important movie, but it’s not a perfect one. It has one enormous flaw, and it’s a testament to the smartness of the writing and the inherent fascination of its viewpoint that it doesn’t wreck the experience: Director Justin Simien doesn’t know how to shape scenes or pull performances from his actors."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "It’s true that satire is the perfect weapon of reason, and Justin Simien deploys it with resourcefulness, cool assurance and eagle-eyed aim."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "The movie finds real power in its climax, a party that turns into a nightmarish orgy of leering white kids in blackface. And the end-credit photos of real parties just like it at schools across the country are a stark reminder of the ugliness that Dear White People, flawed as it is, wants to confront."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "The four main actors, all uniformly excellent, can wrap their tongues around Simien's verbose dialogue, but some of the minor actors have a harder time, resulting in several jokes falling flat."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "Simien focuses too much on the character played by his star, Williams, which seems a mistake. Scenes are underscored with classical music chestnuts, a trite way of suggesting “academia.” And the ending is an eye-roller."
    },
    {
      "critic": "James Rocchi",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "It’s an American film that talks about race with strong feeling, common sense and good humor; it’s an indie screenwriting-directing debut as polished as it is provocative; it’s a satire that also lets its characters be people; it’s a showcase of clever craft and direction as well as whip-smart comedic writing brought to life by a dedicated, charismatic cast that also conveys real ideas and emotion."
    },
    {
      "critic": "Justin Lowe",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 70,
      "summary": "Simien intensifies the impact of both action and dialogue with a self-reflexive directorial style that creates a marginally heightened sense of reality, revealing more about characters' motivations than would conventionally be expected."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 67,
      "summary": "The dose of reality is bracing and welcome after all the hothouse talk that preceeded it. Dear White People is a first feature, lively and intelligent and thought-provoking, by a writer-director whose best movies are yet to come."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "Although the characters don’t lapse into stereotypes, neither are they sufficiently funny or fierce to engage us in the issues they raise."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 63,
      "summary": "“It’s a little self-congratulatory and light on story,” says one student of another’s film project in Dear White People, which feels like director Justin Simien getting out ahead of inevitable (and accurate) criticism."
    },
    {
      "critic": "Aisha Harris",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Unfortunately, Simien’s many smart, relevant thoughts on race are more often wrapped up in an impassioned, didactic bow that rarely feels fresh—or, more damagingly, funny."
    },
    {
      "critic": "Noel Murray",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 60,
      "summary": "Simien is clearly a talented, witty writer, with a fantastic sense of character development and dialogue, but he makes a lot of rookie mistakes as a filmmaker, from trying to cover too much ground in one movie to making stylistic choices that render Dear White People visually incomprehensible."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "Bristling with arguments about the complexities of black identity in a supposedly post-racial America, this lively and articulate campus-set comedy proves better at rattling off ideas and presenting opposing viewpoints than it does squeezing them into a coherent narrative frame."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "First of all the movie title makes me uncomfortable because a movie called 'dear black people' would probably offend me before i have even watched it even if it was a comedy. Seconldy the movie is just not funny it just randomly stumbles over sensitive issues and terrible sterotypes. I knew she wasn't going to let the 'weave' comment go. Isn't the weave thing just tired now? Then the white girl saying she wants  her black boyfriend's big black manhood? Seriously? Two thumbs down. A younger audience might look past the prejudice, but the movie is still dull and incredibly slow.",
      "total_reactions": 4,
      "user": "nosma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2016
      },
      "score": 3,
      "text": "Is it about the student politics or racism?",
      "total_reactions": 3,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2017
      },
      "score": 1,
      "text": "It could have been a good movie that recognized the ridiculous identity politics on college campuses, the hate-filled propaganda pushed forth by old angry leftist professors, and the students who are just trying to get areal education in an environment more concerned with safe spaces, banning free speech that disagrees with leftist ideology, and bubbles than education, free thought, or free speech... but no it was mostly a propaganda film about how White people are stupid, entitled, and evil. They even make fun of the educated Black people who do not act \"Back\" enough.",
      "total_reactions": 3,
      "user": "aamerkastoff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2017
      },
      "score": 0,
      "text": "Instead of bringing people together it becomes the most racist thing out there.  MLK's dream is dead in this movie.  There is no attempt to even bring folks together.  There honestly shouldn't be a color.  There is no us vs them outside someone wanting there to be. Those claiming to fight racism in America usually are some of the most closeted racists of all.  Seriously the director tweeting \"F**K white people\" after Trump won kinda says it all.",
      "total_reactions": 2,
      "user": "maxmckay71"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2017
      },
      "score": 0,
      "text": "Racist, ignorant and distasteful! If anyone actually trully believes \"white people can't be victims of racism\" as they said in the movie, said person should (and would, in any minimally developed country) be criminally prosecuted, because... GUESS WHAT? SAID PERSON JUST COMMITED RACISM.",
      "total_reactions": 2,
      "user": "MarcioCavalcant"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Rubbish.  Yet another angry Black, get back at Whitie, piece of propaganda.  It was annoying in it's delivery and sophomoric in it's depth of characters.  Stereotypical racist (Black superiority) Drama with very little comedy.  I want my money back.  My girlfriend (Black) wanted it turned off after 15 minutes, we went through the entire torturous experience thinking there might be some comedy.  It's Garbage.",
      "total_reactions": 7,
      "user": "View2akill"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "The trailer for this film (click on the link below) looks like a sassy sendup on stereotypes. As happens sometimes, those are the only 2 1/2 minutes of comedy in the film. The rest takes a satirical, but serious look at racial dynamics, college politics and personal relationships. It's set at a fictional college where residential hall rivalries cause conflict. Surprisingly, in all the cultural discussion, there's a positive subplot about gay issues. The performances are genuine, but writer/director Justin Simien holds too tightly to his messages, which gives the dialogue too much didactic weight. Young people might enjoy the MTV-tinged drama, but don't go expecting lots of laffs.",
      "total_reactions": 8,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 0,
      "text": "This is some of the worst crap I've ever seen -- suffocatingly dull, absolutely devoid of wit, poorly acted and scripted by amateurs. The direction -- what the camera chooses to see -- is so static and uninventive that you'd think it was shot by a high school student working on a shoestring budget.",
      "total_reactions": 17,
      "user": "MargateBuff"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "I was really excited to watch “Dear White People” because there would finally was be a film that would spark a discussion on race.  I love how the film focuses on issues of not only race but sexual orientation, and general stereotyping as well.  Throughout the movie, a lot of great topics were touched, but I feel that the delivery was very poor and the story-line was a little confusing. At the end of watching the movie, I’m sad to say that, I questioned what the ultimate message was. Yes, the movie did touch on many issues on race but I wish that they would have focused more on why these issues exist and how we can solve the problem. I appreciate the humor throughout the movie but I feel that this movie seemed to be making fun of black issues rather than coming from a more serious approach. At the end of the movie, even as a black woman, I felt racism wasn't a serious reality for most and instead it’s something “funny”.  Many may disagree that the movie should have gone deeper and focused more on the struggles of racism, from a more serious approach, so that viewers could leave the theaters more willing for a change. It’s up to you to watch the film and see if you agree with this statement or not.",
      "total_reactions": 11,
      "user": "estaajustaa"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "A clearly racist and stereotyped movie against white people. Turn the title around and put Black instead of white and everybody would be up in arms. But its ok if other races do it. I for one am about being equal to all and not stereotyping anyone. This is a good example of why we are still so far apart with being an equal society with junk like this. By the way I'm black.",
      "total_reactions": 11,
      "user": "WhySoSerious54"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Its wit and smart direction as well as its relevant topic is what makes this film so essential to watch. The film's writing is superb as well as the acting. But what really resonates is its overall message and themes that become almost unbearable to sit through - yet, its necessary.",
      "total_reactions": 7,
      "user": "Eon2323"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "A very sharp and witty take on race relations on a college campus.  A few characters may be cliched, but the film is done in such a way you just don't mind. B+",
      "total_reactions": 5,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "It's a nice little movie.",
      "total_reactions": 8,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Prior to watching this movie I was already convinced that it was going to be hilarious and I would enjoy watching it. Showing up to the movie theater at Century City I was surprised to see that there weren't as many people that I would have expected, however, this was most likely because I went to catch the late showing on Sunday night. Not surprisingly, I did in fact enjoy the movie. Personally, I think it was clever, motivational, funny and educational all at the same time. I have to admit that although it was not my favorite movie of all time, I enjoyed watching a unique movie which did not use the typical cliché tricks to make a movie interesting.",
      "total_reactions": 11,
      "user": "Tandis"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "The beginning of the movie was excellent because it very quickly and efficiently gave a large amount of backstory without coddling the viewer.  I felt that the early scenes of the movie was where the movie was the strongest.  As a viewer It was easy for me to understand the plights of each of the four main characters on which the movie was focused on.  All of the actors performances were full of emotion and feeling, everyone carried their own.  As someone who doesn't pay as much attention as he probably should to issues of discrimination and prejudice, this film portrayed, and introduced a variety of issues in a way that I was able to quickly grasp and understand.  Instead of blatantly stating what part of Black culture that a character was supposed to represent, the film used context and imagery to achieve the same message.  The bread and butter of the film was showing the interactions and experiences that people of certain groups and orientations go through and what they feel during these events.  The film was also very friendly in its presentation and did not at all during any moment, come off as preachy or oppressive.  However, I thought that it was perhaps a little too friendly.  Instead of taking the opportunity to enlighten the viewer on some issues the movie read more like a safe and formulaic story.  The plot line was also a bit hard to follow because the story felt so much like simple life events.  Thats not to say that it was bad, its just not the usual overstimulating action flick that I would usually go see.  In conclusion, the movie was great, the actors were on point, the cinematography was quirky, and the story was educational for me but I somehow expected to see a more provocative film.  It was a movie that I strongly recommend you go see in theaters but I don't recommend that you buy on DVD.",
      "total_reactions": 9,
      "user": "PlumCrazyPurple"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "The indie film, Dear White People highlights an image that most non-white, college educated, ethnicities has seen their life. The image of walking into a college campus setting and see the abundance of blonde hair and blue eyes. Automatically may have someone with darker hue skin feel as if they are in the wrong setting.  Ethnic diversity is no longer hiding in the background but diversity holds place in front of our eyes. Dear White People is a reminder of things that I do, Hispanics are said to hardly leave tip and I sometimes do not. I try to justify why I tip a certain amount of money due to the service I was provided. I have once tipped of large amount so that I won’t be judged as a typical Hispanic that does not leave tip money.",
      "total_reactions": 6,
      "user": "elle_clove"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "one of the best films of the year so far. not a perfect film, and not the best of all time. but this should go down as a must see movie, now more than ever.",
      "total_reactions": 6,
      "user": "jrodfilms"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "A bitingly satirical, superbly written offering about racial relations and identity in modern-day America, unafraid to expose the cynicism and hypocrisy often tied up in these issues. The movie gets in your face but does so without ever going over the top or becoming preachy in delivering its message. Easily one of the best -- and most overlooked -- releases of 2014.",
      "total_reactions": 7,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Entertaining, well written and very relevant with interesting  character development..  I guess we aren't living in a post-racial world after all.  You should see this film.  It makes you laugh and makes you think.",
      "total_reactions": 7,
      "user": "JE61"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Definitely funny, poignant and just plain 'On Time'. Go see it!",
      "total_reactions": 8,
      "user": "OneYoungsta"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Dear White People is a really frank and relevant look a race politics that offers very few easy answers and has several layers which i believe a re watch will only highlight further. this is backed up with an excellent cast, great characters and writing that really offers no easy answers. it wasn't the film I was entirely expecting but that's what made it really good. if you want a smart Challenging film I would recommend this one.",
      "total_reactions": 4,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Much has been said about the good parts of DWP, I do have some minor nitpicks with it. All in all, DWP is pretty bland, for what is really going on in America. The survival rate for encountering a traffic cop is now at 50-50. DWP doesn't address that at all. There's an lack of clever one liners about the white - black thing",
      "total_reactions": 7,
      "user": "MelancholicAlc"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "I was first exposed to Dear White People by its trailer. The trailer was so promising it put the movie to a much higher level of expectation than it actually is so it could have only been a slight disappoint. The film is smart, punchy, and funny, for a film about racism and racial tensions.",
      "total_reactions": 4,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "couldnt ask for a better film!",
      "total_reactions": 2,
      "user": "thedankness"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2017
      },
      "score": 0,
      "text": "Racist movie, racist director. Hate-filled propaganda towards white people.",
      "total_reactions": 0,
      "user": "AntonioBernardo"
    }
  ]
}