{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "Deliver Us From Evil",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 47,
  "mc_pro_critic_reviews": [
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "For all its embarrassment of riches, “Deliver” never manages to transcend its bloody, screechy, pulpy origins. That makes the film both a horror tale and a tragedy."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "Buckle up for the ride that is Deliver Us From Evil, a highly intense and effective mash-up of police procedural and horror show."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "Scott Derrickson, the director, and his special-effects crew really deliver the creepy goods here, providing an apt climax for as taut and credible a movie involving demonic possession as you’re likely to see."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2014
      },
      "score": 67,
      "summary": "It's a dark and grimy film, and while I think it's juggling a whole lot of cliches, there is something genuinely admirable about the way it tells this story and the way it handles the supernatural onscreen."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 67,
      "summary": "It's all clichéd, of course, and has been since \"The Exorcist\" but it's still effective, perhaps more so with anyone who, like our hero cop, comes from the world of scented smoke and altar boys."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "Expertly serves shivers, buckets of gore — and pretty much every cliché of the genre."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "Though Derrickson offers some new twists on old tricks, and evokes a mood of menace with rainy streets, gloomy interiors, and the transformation of comforting everyday objects into something horrible, the story soon devolves into variations of many movies we have seen before."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Although everything here works for the most part, there is also a definite lack of oomph as the movie pushes toward the inevitable climax."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 58,
      "summary": "For all its darkness, [it] never really scares up anything new."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Like other entries of its pulpish ilk, the picture packs lots of violence, a fair bit of gore, and plenty of cheap scares."
    },
    {
      "critic": "Bill Stamets",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Director Scott Derrickson and his co-writer, Paul Harris Boardman, deliver a routine procedural with unremarkable frights."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "While the supernatural side of the film suffers a flaw or two — continued references to The Doors are superfluous and sometimes chuckle-inducing — its central conflict works."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Half the time, Deliver Us From Evil is genuinely interested in Sarchie's all-too-human demons, and half the time we're marking time until the big exorcism and an ending that keeps the door open for a sequel, should the market demand it."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 42,
      "summary": "In Bana and Ramirez, who share a palpable bro-mantic, odd-couple quality, the film finds its most charismatic element... but shoves it aside to deliver a movie that will dully meet the barest of expectations instead of trying to exceed them."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 42,
      "summary": "The action scenes are clumsily filmed and choppily edited."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "You’ll be jolted a couple of times, but these aren’t scares that will stay with you. How about retiring “based on a true story” in favour of “based on a good story”?"
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "Actually, Ramirez should probably have been cast in the lead, since things flatten out whenever he disappears."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "A professionally assembled genre mashup that’s too silly to be scary, and a bit too dull to be a midnight-movie guilty pleasure."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "Deliver Us From Evil is a professionally assembled genre mashup that’s too silly to be scary, and a bit too dull to be a midnight-movie guilty pleasure."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "Derrickson gives it everything he’s got, but when a film offers “Break On Through (To The Other Side)” as a spiritual pathway, it’s hard to take seriously."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "Deliver Us from Evil takes a very long time to deliver us from dullness."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "Even horror neophytes won't be spooked by a film that looks as if it were shot with a smartphone and an Itty Bitty Booklight."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "A jump scare isn't just a jump scare in the films of Scott Derrickson, which isn't to say this wannabe master of horror has entirely perfected the art of sudden dread."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 37,
      "summary": "The question at the heart of Deliver Us From Evil, a garden-variety serial-killer thriller tarted up as an exorcism drama, is not whether good will triumph over evil. Rather, it’s this: What in God’s name possesses good actors to make dreck like this?"
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 33,
      "summary": "This rote exorcism-is-real claptrap."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 30,
      "summary": "Bana is a likable actor, but he doesn’t bring any vulnerability or transparency to the part; it’s hard to tell what he’s thinking, if he’s thinking anything at all. And so, we move from one bleak, bludgeoning setpiece to another. But with each loud noise, the film loses us more and more."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 30,
      "summary": "Despite the screaming gore, the movie is so rote that it can’t even rouse us for the de rigueur exorcism."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "At best, it will be remembered as \"that exorcism movie with Eric Bana.\" More likely, \"that exorcism movie where everyone has a bad New York accent.\""
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "Little more than an ugly collection of tropes stolen from \"The Exorcist\" and \"Seven.\""
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "If this movie doesn’t leave you howling at the very idea of demonic possession, you’re in dire need of an exorcist."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "The mutilated, slobbering, howling possessed in Deliver Us From Evil crawl on all fours like animals, and furiously dig into surfaces until their fingers bleed, but they’re nothing more than a sideshow, freaks on display for your perverse enjoyment. It’s unsettling, but never terrifying."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "This is television-level moviemaking top to bottom, from its preposterous premise, scenery-chomping performances, idiotic sound cues and force-fed jump-scares. Deliver Us From Evil delivers formula, and in a formulaic fashion."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Other then some cheap animal scares and even worse mirror / camera scares there's very little to find scary in this movie.  The cops scenes all feel like they from a TV show and the climax is predictable at best.    Sorry but I just have a hard time recommending this.",
      "total_reactions": 2,
      "user": "Gauvoden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "This is overall your standard possession film, but it does have a few cool and unique things about it. I do like how they tried to combine the elements of a police film with a possession horror film. While it definitely worked in some ways, in others it felt all too familiar and cliche. Eric Bana performed his role well, as did Edgar Ramirez. The story was cool and had good elements to offer, however, the main problem is that it's one of those horror films that isn't particularly scary and it consists only of desperate jump scares. Overall, it's a cool to watch, yet forgettable possession film.",
      "total_reactions": 1,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Totally enjoyable but devoid of any real scares, DELIVER US FROM EVIL",
      "total_reactions": 1,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Aburrida... Deliver Us From Evil es confusa, la trama se desarrolla lento, muy lento (muchos momentos son sumamente innecesarios, ¿en serio, teníamos que ver como discuten por un partido de baseball? ¿o contar miles de veces el pasado del padre? Hay muchos huecos en la historia, la película al final de todo no se da a entender. esta es una película de suspenso con acción NO ES UN FILM DE TERROR, cuenta con muchos clichés (vistos en muchas otras películas del mismo tema) no ofrece nada nuevo, es muy pesada y en algunos momentos llega a aburrir, no recomiendo verla en el cine, es de esas películas que deben de verse solo en DVD o TV.",
      "total_reactions": 1,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "\"Deliver Us From Evil\" 10 Scale Rating: 4.0 (Bad) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"Deliver Us From Evil\" is not exactly a horror movie. Here, we have a blend between horror, cop drama and action. Despite the acting of Eric Bana, Deliver really impressed me, specially the well-developed suspense, the dark photography and the powerful (but not as chilling as it could be) final act.",
      "total_reactions": 1,
      "user": "renatomorais"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "One of the most boring horror movie ever! Predictable and uninteresting main plot, blunt characters, this movie doesn't have a single creative detail in it. No reason to see it",
      "total_reactions": 3,
      "user": "PeteStaiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "The term \"Inspired by True Events\" has been taken a bit extreme lately. Many fellow horror enthusiasts, such as myself, can agree to this. Films like; \"The Conjuring\", or \"The Quiet Ones\" use the term \"Inspire\" which is very loosely based on something that is somewhat accurate. The latest offender of this term; Scott Derrickson and his fright free flick \"Deliver Us From Evil\".",
      "total_reactions": 2,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Deliver Us From Evil artistically and successfully commingles two routinely disparate film genres: police crime drama and paranormal horror. Scott Derrickson skillfully and realistically captures the dark ambience common to both in powerful ways (via the depiction of aversive elemental and environmental settings; an absence of light; an absence of sound; an ominous musical score; and initially disbelieving characters driven to self-discovering belief through their exposure to overwhelming events). The film's portrayal of police tactics, dialogue and procedures is spot-on and its descriptive narration on uncommon subject matter such as primary evil, diabolical oppression, and possession is likewise noteworthy. Moreover, the explicit detail provided on the six stages embodying every genuine exorcism could have been given by the Jesuit Exorcist, Malachi Martin, himself. I give this film a 5 Star rating and predict that it will soon join both The Exorcist(1973) and The Exorcism of Emily Rose(2006) as cinema's ultimate expression of the preternatural realm at work in the real world.",
      "total_reactions": 4,
      "user": "Ecclesium"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 1,
      "text": "I am trying very hard to say something positive about this movie, but I cannot recommend it because it is more of a car wreck than a mash-up.  It is not the fault of the actors, who were quite believable, but the script was awful and the director uninspired. This movie made me believe that exorcisms and serial killers both should be retired from the screen, but perhaps there was just nothing fresh here. Very disappointing.",
      "total_reactions": 2,
      "user": "GinaK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "So here I am, just getting back from a week long cruise to the Bahamas with one thought in mind: \"I really wanna see Transformers again, but in IMAX.\". Unfortunately that didn't fly because I'm a firm believer in majority rule and upon the mention of \"Deliver Us From Evil\", my buddies jumped at the opportunity for something new as opposed to something we already liked. Usually I'm all in for a horror movie, and if you know me you know that I'm a huge horror buff. I love it, no, thrive on it! Games, movies, television... Comics? Maybe. Though regardless of my horror obsession and the weird need to be frightened every once in a while, I'm getting sick of the demonic possession movies. This is especially the case with those that are \"Inspired By [insert name or event here]\", which is exactly what this film is. Honestly, I'm beginning to think that all of these \"Inspired By\" stories come from schizophrenics who are paid by film writers to go on about what they 'saw'.",
      "total_reactions": 1,
      "user": "thatSTERLINkid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "The movie, “Deliver Us From Evil” could not have been made at a better time in our lives. It is a personal story of good overcoming evil. It is a story of redemption over sin. It is a story of Christ defeating the devil.",
      "total_reactions": 2,
      "user": "mgs4lord"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "I liked Deliver Us From Evil, but is it ever a frustrating film.  Its strong positives are only weakened by negatives that cannot be ignored, with an imbalance borne mostly of indecision throughout all aspects of the film.",
      "total_reactions": 0,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "I usually avoid watching horror films because I am someone who's afraid of almost everything but I must confess, I started to like horror films a little more because of this film!",
      "total_reactions": 0,
      "user": "hayashimegumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "I went to see this movie two days ago and i still think that it was money well spent.",
      "total_reactions": 0,
      "user": "fatluigi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "The horror scenes are really great , but I can't say the same about the script , they could've given us a natural exorcist film , like The Exorcist , but they went for the Supernatural . It started off like a police investigation film ,but then they made the bad guy *Spoiler Alert* talk to animals , break windows with his Evilness and walk around with a sliced up body . I was hoping they stick to the book with this one but , anyway , I did buy the book , I hope it has a better story .",
      "total_reactions": 0,
      "user": "JalalBlack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "A lot of really bad CG... cliches with no sound and suddenly BOOM bloody image in 500 miliseconds... a real cliche. This movie is really poor and have a lot of budget. theres a lot of good horror movies... this one... isnt",
      "total_reactions": 0,
      "user": "VonTalavang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Tedious for the most part and completely lacking in suspense, Deliver us from Evil suffers from cheap generic scares and a poor and very bland story line.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "If you have knowledge about Christianity, you will find that this movie is pretty decent. The production investigate about how such things work in real life. I recommend it ... this film exceeded my expectations.",
      "total_reactions": 0,
      "user": "smarteck"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Not a great possession film but it does have Scott Derrickson's style making it a solid watch.  Unlike Sinister Derrickson can't turn an under whelming script into gold just bronze.  B-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "The movie is enjoyable and the acting is actually good but,the movie was boring sometimes because there was barely no action and probably because the religion was barely a character in the movie because they are always talking about this.(I have no problem with religion or religious peoples but it is kind of boring in the movies).",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "Derrickson's previous horror ventures like ‪‎Sinister‬ and ‪‎The Exorcism of Emily Rose‬ packed in brilliant creepy factors that signed him off as a new age creative ghost director and all such accolades are justified since Derrick has gone pro behind the camera. Unfortunately in this flick what he endeavours to do is uplift a bland tale of devilry, savagery and diabolism and mashes it up with gore, dark and a lot of cop activity. Thanks to ‪Eric Bana‬ who works really hard to make the true story script appear top-notch otherwise there is nothing that makes you skip a beat in the entire movie at all.",
      "total_reactions": 0,
      "user": "Scottshak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Tries hard to bring some original scares by combining the horror genre with that of a police drama. It may be based on a true story, but it definitely isn't based on a scary story. At least that's how the movie makes it look. It's a drawn out affair that is devoid of fear, tension, and scares of any kind.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "This movie tries very hard to scare us with shocking scenes but even the somewhat decent acting and moody photography can't save the meandering and confusing narrative of this Exorcist wannabe. It's very chatty and attempts to use children in peril to make us feel gut reaction fear. It's not very good.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Does not live up to the producer Jerry Bruckheimer, can not understand the praise it received from those who attended, and was indifferent watch dawn, the film is pathetic.",
      "total_reactions": 0,
      "user": "Jacksonmedia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "This movie feels like  a **** no good horror film that has no gutty fun material on the horror genre, director Scott Derrickson's screenplay only focuses on  the \"blood,\" instead of making  an  awesome horror film . The actors did an okay job despite their cliche'd roles, basically we dumb two cops trying to solve an ancient a occult case. In my opinion Derrickson's 2012's \"Sinister\" was one of those films were you **** your pants while  enjoy a good horror film it's one of the  best of the year. Also based on a true story it just makes this movie dumber, even though the effects are bloodcurling, it can be entertaining at times. Grade C",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Deliver Us From Evil: 5/10.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "\"Deliver us from evil\" ou \"Livrai-nos do Mal\" é um filme de terror acima da média atual, possuindo uma boa história e uma trilha sonora incrível, usando música da banda The Doors como \"Break on Through\" e \"People are Strange\" que além de serem boas músicas e combinarem com as cenas, tem ligação com o enredo, tornando tudo ainda melhor. O filme tem certas falhas, como tentativas invalidas de assustar quem está vendo, mas possui muito mais pontos positivos e com certeza vale a pena para os fãs de terror. Para concluir, o filme não é perfeito, mas é muito bom recomendável para amantes de filmes de terror, e não para aqueles que esperam se assustar ou assustar alguém.",
      "total_reactions": 0,
      "user": "GabrielMetacrit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Considering how difficult it is to find a decent modern exorcism flick, it's always nice to find one that will be a visceral and sometimes scary ride. Deliver Us from Evil is one of those movies. Sinister director Scott Derrickson takes the helm of this cop procedural turned possession film Deliver Us from Evil which is based on NYPD sergeant Ralph Sarchie's allegedly \"non-fiction\" novel Beware the Night. I believe that this is based on true events about as much as I believe that The Conjuring and The Amityville Horror movies are \"based on true events\", but let's just roll with it. In Deliver Us from Evil, NYPD sergeant Ralph Sarchie, played by Eric Bana, teams up with a priest schooled in the rites of exorcism to investigate a series of crimes around their city. What makes this movie so much different than other exorcism movies is that it is primarily a cop procedural. A lot of the twists and thrills come from Sarchie investigating these crimes and finding new information and evidence, making this a uniquely gritty possession film. Deliver Us from Evil mostly thrives on the unpredictability of the plot rather than gross-out scares, Scott Derrickson's direction also allows some dense atmosphere throughout the entire film. Unfortunately, there are quite a few unnecessary jump scares littered throughout the movie. Some of the jump scares do actually work, but for every one that works, there are two more that fail miserably. It's the biggest drawback to an otherwise good film. Deliver Us from Evil, despite some horror cop-outs (pun definitely intended), is a gritty and surprisingly entertaining exorcism flick that should surprise and even scare you.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "A very good movie,liked it since i saw Eric Bana as main character...the only thing i didn't liked in this movie was the priest,his character was pretty **** up",
      "total_reactions": 0,
      "user": "Julian125"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "An unusual team of two to fight the evil spirits!",
      "total_reactions": 0,
      "user": "LeZee"
    }
  ]
}