{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Detachment",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 54,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Nobody's idea of \"Mr. Holland's Opus,\" but it winds up in a similar place, more or less."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Adrien Brody deserves superlatives for his acting in the alternately mesmerizing and maddening Detachment."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "When it stays in the classroom, Detachment is a scrappy testament - to the futility of even trying to reach students who are cut off from the possibilities of knowledge, and to the way that our teachers are slowly being driven nuts."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "A movie you keep expecting to fizzle because of its punching-the-air gracelessness, but there's something weirdly effective about the artistic desperation, which includes inserts of chalkboard animation and to-the-camera testimonials."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "Adrien Brody, delivering his finest performance since \"The Pianist,\" plays the central role of the disaffected Henry Barthes."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "People will either love Detachment or hate it, and either way it provides powerful testimony to the unrivaled passion and undiminished craft of director Kaye, whose notoriety in the film industry is matched by his near-total invisibility to the general public."
    },
    {
      "critic": "Sam Adams",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 67,
      "summary": "For all its untrammeled excesses - and Kaye has proved that he'd sooner torpedo his own career than accept a little constructive trammeling - Detachment is almost forcibly moving, body-slamming its audience into submission."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 63,
      "summary": "Ultimately, Detachment invites us to feel precisely what it warns against – detached."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 60,
      "summary": "The shriller its didacticism, the more unhinged it becomes. But even at its most ludicrous - when it is shouting into your ear - its sheer audacity grabs your attention."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Comes across like the creation of a precocious student. I don't mean that to be a damning critique, though Detachment is a mesmerizing misfire -- it's just that it has the uncomplicated earnestness and hyperbolic melodrama of teenage poetry."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "It's nice to see righteous anger in a movie. If only the education drama Detachment knew what to do with it."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "The movie is one big scream, clichéd and hardly credible as an oblique call to civility."
    },
    {
      "critic": "Ronnie Scheib",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Scripter Lund, himself an ex-teacher, delivers a story that lacks nuance, and mixes badly with Kaye's impatient edits, Dutch angles and extreme close-ups."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 38,
      "summary": "[Director Kaye's] dedication to the material is admirable, but his tactic of following one dismal development with an even more depressing one comes to seem monotonous and pointless."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "I didn't believe a word of the film and found myself feeling nothing but (I'm sure this wasn't Kaye's point) detachment."
    },
    {
      "critic": "Mark Holcomb",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 30,
      "summary": "Movies about teachers are flypaper for overblown armchair crusaderism, and this overbearingly cynical attempt gets my vote for worst offender yet."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "The movie has an undeniable visceral power. It is also a loud, grating wallow in dime-store despair, a cheap and hollow button-puncher."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "Detachment drives a coffin nail through a noble profession with such ruthless virulence that it makes no point at all."
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "Endng in risible bathos, Tony Kaye's urban high school melodrama is all about the cute teacher's crises and the girls who love him."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Adrien Brody's performance is very good, and the movie ends up being an inspiring drama.",
      "total_reactions": 4,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Superb movie with great messages for the US education system (and the worldwide one, too) !! A must for parents, students and professional teachers. Also, proof that small budget films are usually much much better than their blockbusters cousins.",
      "total_reactions": 2,
      "user": "AthanasiosT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Adrien Brody was fantastic as the frazzled teacher trying to live despite the world seemingly going mad around him. Sami Gayle was also impressive as Erica.",
      "total_reactions": 2,
      "user": "Helly77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Great cast Adrien Brody is brilliant it's nice for a change to go  see a movie that makes you sit up and think  about life and how every day is a challenge and effects people in different ways and how we make it from day to day with whatever problems we have its a must see movie which will hopefully give you a new out look on life.",
      "total_reactions": 1,
      "user": "scoley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Possibly one of the most underrated movies in 2012. \"Detachment\" gave an honest  though a little too pessimistic at times  insight into the complexity of how people cope with life's own complexity. With great performances from the cast, especially Oscar winner Adrien Brody and newcomer Sami Gayle and creative,story telling, \"Detachment\" is something really different and worth watching from the mixture of shallow scripted movies we are bombarded with in recent times.",
      "total_reactions": 1,
      "user": "mochainthesun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Detachment is not a movie or drama that you watch only! \"each movie is a life\", but do you use this sentence for all the movies which are on screen? absolutely no! Detachment is a lost part of our life. all the characters in this movie make a man, a human! This is movie about morality or high morality! It's Tony Kaye's never land. It is our surreal world among this bloody real world. Sometimes, I'm Henry, who is building his personality again. Sometimes, I'm Meredith, who is mixed up and need someone to be a permanent solution for her. somebody, after watching,  maybe say that this is not a film. it is an exaggeration! This existentialist world does not belong to this world, especially American world. Well, I said this is Tony Kaye talkie. This is a dream world  in his mind who thinks a better world among this corrupted real world. Who said that you must think all the characters are real and they are beside us? No, They our other moral parts!",
      "total_reactions": 1,
      "user": "Beingness"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Adrien Brody as seen better days (in terms of picking movies)... Detachment if off the hook providing the viewer an intense story about schools nowadays and great performances but fails short in terms of directing and a script so full of  pseudo-philosophy that can confuse most of the people. It´s good but hard to understand.",
      "total_reactions": 2,
      "user": "dodgingbullet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "La educación es una de las grandes esferas de la estructura social y siempre se relaciona con la otra base, la familia. Hoy ambas están en crisis y genera fenómenos de todo tipo. La denuncia o la simple mirada de la transformación que se vive hoy en la escuela, hace que la reflexión y el legado que se está dejando no auguren un buen futuro. Detachment es una película contundente que llega a confrontar el rol que todo espectador ejerce en esta sociedad, pasivo o activo, estudiante o padre, comprometido o no con un entorno cada vez más salvaje para las nuevas generaciones.",
      "total_reactions": 0,
      "user": "CinePlacebo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Altho the film is a nearly relentless downer, the acting is terrific.  All that makes my rating so low is that an awful lot of what the characters do makes little sense since we don't know who they are or what their story is.  That being said, is it worth watching?  Very much so, you might even leave with a pinch of hopefulness.",
      "total_reactions": 0,
      "user": "BobbyLip"
    }
  ]
}