{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 37,
  "mc_movie_name": "Diary of a Wimpy Kid",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 49,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "It is cliche, but it is also very funny and sometimes touching. Oh but it isn't good enough to recommend to adults but it is a solid experience in the movie theater. I give this movie 73%.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I loved this movie and knew there was gonna be a sequel! I think this was a great movie! Thanks to everyone out there that made the movie! Very entertaining movie. I'm not a long writer so i'm done!",
      "total_reactions": 1,
      "user": "robguy222"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "It's a lot like the book and was better then I thought but for me left out a few key bits from the book but don't buy it, rent it The diary of a wimpy kid 6.5/10",
      "total_reactions": 1,
      "user": "watithink123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "firts off, that preview picture is SOOF AKE i can see him right there yor not trikling me i can see him he doesn't look like that hes not there or holly either what your just gonna walk in? diary of a pig made me hate that one thing for seconts, 3th, i really dont think high scool goes like that im in highn scool right now and evry time i cannot find a good reason to tell you the movie there to watch the movier! NEVER AGAIN I SWEAR!",
      "total_reactions": 1,
      "user": "thefishslap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "was a good movie that you can watch with the family.  i would add it to my movie library. rowley in my book was the best actor of the flick. good all around flick was not to funny was not  sad. no love story involved unless u count best fiend love.. and i thought the story line was  unusual so i give it a 7 out of 10",
      "total_reactions": 2,
      "user": "shepardn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "It wasn't my favorite movie of the year, but good thing the comedy saved the entire movie.",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "It gives me great pain to give this film a one. Not that I feel sorry for it, just that I can't leave any zeros. This was a HUGE disappointment. For one thing, Greg in the book (the real genius) is supposed to be 13!!! The actor is like 7! I'm sure anyone could have been a better actor for Greg. ANYONE!! Left stuff out, added CRAP in. Wow! Congratulations FOX, you just brought out a stinker! Oh, by the way, THANK YOU, MikeJ., for your words of wisdom!",
      "total_reactions": 2,
      "user": "nintendoid13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Diary of a Wimpy Kid rocks!! Zach Gordon and Robert Capron form a great duo, and I loved Chloe Moretz. All the other stars were nothing, especially Rodrick! The plot is amazing, and the dialogue was even better! I hope all of the books become films.",
      "total_reactions": 2,
      "user": "blagoonga"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "Saw this film on a flight (sadly a captive audience), when I say \"saw\" I mean pulled out the headphones & started reading a book after 20 minutes or so.",
      "total_reactions": 4,
      "user": "ChrisB"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "This movie was decent, but it could of had a lot of improvement, the plot was good but the acting and the script just did not flow well with my point of view, THE SECOND ONE IS BETTER",
      "total_reactions": 4,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "one of the wors films ive seen i was being kind to give it a 2 i wanted to give it a one its gets worse as the film goes on it was a waste of money i have no idea what roger ebert was thinking giving it 88 he must have been drunk",
      "total_reactions": 2,
      "user": "796712"
    }
  ]
}