{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 83,
  "mc_movie_name": "Dinner for Schmucks",
  "mc_negative_rating_frequency": 48,
  "mc_positive_rating_frequency": 100,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "I was extremely dissapointed with this film. I really wanted to love it but it was too hard to do so. This isn't neither of Rudd's or Carrell's best work. Humour is extremely dry although the funniest moments take place with Zach Galfinakis. Your best to rent this one or wait untill it shows up on a cable movie channel.Sure it has a great moral about not judging a book by it's cover but it really lacks charm that these two comedic actors have. If you wanna see Paul Rudd and Steve Carrell work well together, watch the 40 year old Virgin or anchorman but not this.",
      "total_reactions": 1,
      "user": "Tranquilbez22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Look, i am not going to lie. I laughed a couple times, but that does not make this a good comedy. Sure, all being said Steve carell gives a above average performance and he really fit with that roll, but that again does not make a good movie. It could be a good movie but iit is held down by too many cliches that really took me out of the experience. That is really all that is to be said about this movie. Average.",
      "total_reactions": 4,
      "user": "Mattmcdonald"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Movie for schmucks...  Interestingly enough, I like Carelll, Rudd and Clement. I just hope I had watched them in a different movie; maybe a funny one.  This one cost around 50 million euro,  which is about 10 million per non-forced laugh if I'm generous.",
      "total_reactions": 3,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I thought this film was hilarious. There were some neat inside homage jokes (Jeff Dunham doing a turn as Wayland Flowers and Madame) as well as jabbing at the art scene and the human condition in general.",
      "total_reactions": 3,
      "user": "nomdiploom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Hilarious movie. Greatly exceed my expectations. I laughed throughout the entire movie.",
      "total_reactions": 1,
      "user": "Island7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is **** funny, it is hilarious. Steve Carell's character is a **** idiot (until the end). The artist is hilarious. The sexual scenes are kinda gross but funny",
      "total_reactions": 2,
      "user": "RyanLopez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "A Film Review by: Sam Fragoso",
      "total_reactions": 1,
      "user": "Duke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "Every once in a while or sometimes too often you sit in a movie theater",
      "total_reactions": 1,
      "user": "EdanAharony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "The film is quite different from many, is not a silly movie, and like all others, with very similar stories, is a different film, something that touches everyone, is a thrilling movie and at one point, talking about love, friendship and the sincerity and falsehood, Barry (Carrel) is a friend \"silly\" by Tim (PAUL RUDD) barry always tries to please tim, and attempt to be his best friend, always being honest, and always trying to help Since the tim has not always true, but in the end always comes clean .... Well, finally, the movie is different and touching and funny, one of the best comedy films have ever watched, I became a big fan of Steve Carell, and I hope great movies with him starring as this, I recommend ...",
      "total_reactions": 1,
      "user": "Nicholasandrew"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "this movie is so funny.The whole way through theres lol moments.its probly in my top 5 movie list.you also get attached to the character barrie in it because he is inocent and hes got no freinds so you feel bad for him the whole movie but he is the funniest character.if you havent wathced this movie yet I reccomend you watch it now",
      "total_reactions": 1,
      "user": "classic_rocker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "it is a funny movie that expresses emotion in friendship, and love and the passable joy of two friends etc. overall the movie it self is funny and moving 10/10",
      "total_reactions": 1,
      "user": "superman11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Steve Carell is always funny, but this time he's working with unusually bland and predictable script, even for mainstream comedies. There were a FEW laughs to be found, but overall it was quite forgettable in every way. The \"Artist\" in this movie is one of the most horrendously unfunny characters I have seen in a long time.",
      "total_reactions": 1,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I notice bad review for that film.",
      "total_reactions": 1,
      "user": "ryo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "To be honest, I find most movies in the \"stupid funny\" genre to just be stupid and a waste of time, but I like Paul Rudd and Zack Galifianakis so I gave it a shot, and I'm glad I did. It was definitely one of the funniest movies I've seen in a while.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Horrible movie. NOT funny! I laughed maybe twice. People were walking out of the theater. The only time I have ever wanted to. Can't even come close to The",
      "total_reactions": 0,
      "user": "judy777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "Acaso el peor remake gringo entre los nueves que se han hecho de alguna cinta escrita y/o dirigida por el maestro de la vulgar comedia de boulevard Francis Veber. Para lo unico que sirve este bodrio es para recordar la grandeza misantropica de la cinta original, Un Tonto a Domicilio (Veber, 1998).",
      "total_reactions": 0,
      "user": "Diezmartinez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The problem with people these days is that they think a movie where people take a benzodiazepine is the funniest thing ever.",
      "total_reactions": 0,
      "user": "Leinad177"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "I haven't seen French movie it's based on, but Dinner for Schmucks was very disappointing.  The trailer continued at least half of the truly funny moments in the movie, of which there were precious few.  It starts off fairly strong, but loses almost all steam in the painful-to-watch scenes involving Rudd's character's \"stalker.\"  The first scene just sucked the life out of the movie, and it doesn't really regain its footing until near the end, and even then still can't capture the strength of the first 15-20 minutes.  I really like the cast, but unfortunately the jokes just weren't there, and instead we get a movie that can't decide if it wants to be funny or poignant and winds up neither.",
      "total_reactions": 0,
      "user": "walrusgod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "steve corell has been on a downward spirel in his movies lately with every pretty much every thing being bad or mediocore . you can add this to the mediocore department . the jokes are eather not funny or are forced . the chemistry between corell and rudd is flat . even the last 15 minuites which you would think would be the funniest part was barely a few chuckles in it . i know corell is funny he was great on the daily show and in 40 year old virgin .",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Insanely funny. Even when things aren't as funny as the rest of the movie, Dinner for Schmucks never stops being entertaining. Recommend at least one viewing.",
      "total_reactions": 0,
      "user": "Maciech42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Good movie. Plot kept you interested. Steve Carrell's character is, as usual, way over  the top. But Carrell has a weird way of making those characters believable, somehow. Not the best movie in the universe, but it's worth your $10 to go see.",
      "total_reactions": 0,
      "user": "jhonka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "After viewing director Jay Roach's Dinner for Schmucks, The Movie Gal dubbed the comedy \"the most bipolar movie\" she'd ever seen, and that essentially sums it up - Schmucks is hilariously malicious, the kind of film that beats its characters to a pulp, then points its finger and laughs. You're supposed to be laughing too, but you may also find yourself shying away, averting your eyes while Schmucks continues to elbow you in the ribs, and laugh obnoxiously in your ear. More: http://cinewise.blogspot.com/2010/08/dinner-for-schmucks-2010.html",
      "total_reactions": 0,
      "user": "dubmc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "As I was watching this movie i kept thinking this is really stupid. But then a hilarious parts would just keep coming up between stupid parts. I was happy by the end of it none the less.",
      "total_reactions": 0,
      "user": "Bahlof"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "I thought this movie was great, probably one of the best comedy's of 2010. Steve carell and paul rudd are hilarious! It has a decent story and they don't just add in parts that don't need to be there to make you laugh. It stays on track and i give this movie an 8 out of 10.",
      "total_reactions": 0,
      "user": "Review9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This was a great movie starring two very recognizable and great actors. Paul Rudd (Tim) and Steve Carell (Barry) make for a hilarious comedic duo. Obviously if you have read the plot of this movie you should understand what you are going to see from this film. The tension and frustration Barry can bring in such a short period of time is astounding. Some of the jokes had me crying in laughter. If you have seen I Love You, Man; Paul Rudd (Peter) played a straight-laced guy who cut loose and had fun upon making a new friend. In this movie he has a very similar role. If you are looking for a lot of stupid and comical humor, this movie is sure to make you laugh.",
      "total_reactions": 0,
      "user": "MegladonicDino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Not as good as the original (Le Diner des Cons) which rates a 10. Could be tighter. There is an attempt to give the schmuck some depth, but it's not clear that it's a plus. On the other hand, the \"artist\" is a very funny addition.",
      "total_reactions": 0,
      "user": "RonG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Great partnership in Rudd and Carrell, both immensely likeable as always and sharing genuine chemistry, and although juvenile, you can't help but laugh along with the escalating silliness.  A fun, if slightly overlong, comedy with heart.",
      "total_reactions": 0,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Pretty funny movie. Well written and well cast. Jemaine Clement stole the show for sure. Who is Stephanie Szostak and why haven't I heard of her before? I would definitely kiss her face. The only reason it's not a ten is because I find it hard to give comedies tens. But definitely worth seeing",
      "total_reactions": 0,
      "user": "MPVahalik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "The movie centered on a lot of odd characters that made you laugh but it wasn't completely hilarious. I wouldn't say the odd characters they describe where completely far-fetched I have met some people that are too hilarious to believe that they actually believe themselves to be talented. Overall, the movie wasn't worth renting but I rented because of the two main actors. It was somewhat disappointing.",
      "total_reactions": 0,
      "user": "kingshahid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2010
      },
      "score": 1,
      "text": "Terrible film.  Forced jokes and a general lack of flow make each moment a pain-staking exercise in waiting for the next attempt at humour.",
      "total_reactions": 0,
      "user": "nickrussell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Wow... wtf?? That's really all I can say. Such amazing talent available and this is the best use they can make from it? What a waste. Every scene with Rudd jumps off the screen but are hard to watch.",
      "total_reactions": 0,
      "user": "Bibowski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Loved this movie. I can't really explain why Steve Carrell movies are so funny but they are. He has a certain flare for poking fun at everything without being degrading i guess. I instantly recognize his stuff is just poking fun without serious attitude and I guess I relate to his sense of humor. For me this movie was a blast. I do like immature stuff but if it pushes too hard it just becomes lame and embarrasing but that never seems to be the case with Carrell movies. I guess i would say if you like Carrell you will also like this I personally think if someone else was the main star/co-star the movie wouldn't have been as enjoyable.",
      "total_reactions": 0,
      "user": "aspentitan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "This troupe's act is getting old and rather predictable, and who wants to see Paul Rudd as the straight guy? Has Hollywood forgotten how funny this guy can be (take \"The 40-Year Old Virgin,\" for example)? Sure, I laughed a few times. Zack Galifianakis is hilarious. A fairly stupid movie that works if you're in emotional need of comedic xanax.",
      "total_reactions": 0,
      "user": "Fanshawe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Funnier than I was expecting, but still not a very interesting movie.  It has some funny moments, but not nearly to the level Jay Roach, Steve Carrell and Paul Rudd are used to providing.  Zach Galifanakis and his dynamic with Steve Carrell was the highlight.  There are elements of the movie that are unique, such as the whole \"mouse-scape\" hobby of the Carrell's character, but the premise is pretty dumb, no matter how much of the movie's talent tries to make it better.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Booooo. I spent 6 bucks on this and didn't even make it to the dinner (you know, the dinner for schmucks? I turned it off). There were laughs in what I did see, but very few and far between. Oh, and dumb, \"you won't crack a smile\" type stuff - There's quite a bit of that. Some very funny actors in a film with a sub-par script. Would there have been rewarding laughs if I had seen it through? I don't think that matters.",
      "total_reactions": 0,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "\"Funny from start to a \"very\" long finish. Dinner For Schmucks was funny. Tho some of the humor was a bit to much to handle at times , and the long running time just seem like the movie went on. But Carrel and Rudd are great together and flat out funny ...\" .. B+",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "Like many comedies before it, Dinner for Schmucks relies heavily on misunderstandings to fuel it's humor, which works here more often than not, but takes its sweet time getting there.",
      "total_reactions": 0,
      "user": "JustinSmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "I was hoping for a little more clever wit over madcap comedy style, but Paul Rudd and Steve Carell are pros and watchable, even tho this movie seemed dumbed down. it has a few good laughs. I know its just a movie, but  the stuffed mice look like cute little cartoon figures, and when can you run into someone, stop your car in the middle of the street, and then have a conversation for 10 minutes? only in the movies! Its ok for a Saturday night. Not a complete stinker.",
      "total_reactions": 0,
      "user": "ClarkstonGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "This was one of the funniest movie that came out this summer. Every actor was perfect for there role. The combination of Steve and Paul was just to fun to watch. Steve Carell (as Barry) did a very good job playing his role as an idiot. Paul Rudd (as Tim) a normal guy who wants to get his job. Also including Jemaine Clement (the guy from ''The Flight of the Conchords'') was hysterical, and many more actors such as Zach Galifianakis. What I like about this movie is that some of the funniest parts, were also very uncomfortable to watch, witch makes you feel guilty for the characters. So this movie wasn't the best of the summer, but it deserves it's credits.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "The only way somebody could break a smile at this dog would be if they were tripping. This would be worse if I paid to see it...or rather 1/2 of it. I had to turn it off it was so lousy.",
      "total_reactions": 0,
      "user": "zig16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "This film tries to use 60s screwball comedy with disastrous results. It's not only complete inferior to Le Diner de Cons which is what is based on, but I can't help the fact Steve Carell did it for a big paycheck. Skip it and see the original French version it has better writing and acting.",
      "total_reactions": 0,
      "user": "Tetsuo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "One of the goofiest movies I've ever seen that doesn't take itself serious at all, the plot may be a little predictable, and some of the laughs seemed forced, but it's still a funny and goofy movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "What dictates the enjoyment of any media is the viewers expectation beforehand. If you come in with the hopes that its the next Animal House then you won't appreciate it for what it is. Dinner for Schmucks is just a feel good movie. The quirky scenarios are well executed by the chemistry (or antichemistry) of Rudd and Carell. At the end it all wraps up in a namby pamby everyone happy scenario capping off on a well done feel good movie",
      "total_reactions": 0,
      "user": "Eguardo7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Very, very funny movie. Steve Carell was great. Nice plot.",
      "total_reactions": 0,
      "user": "ovi_bz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "What do you say about a comedy that isn't funny? Therein lies my predicament. Dinner for Schmucks is simply that: not funny. Whereas most good comedies find a balance between hearty laughs and emotional moments, the film seems to lean more on the latter than former. Painfully overlong, it's attempts at humor fizzle quickly. The obvious and proven talent of Steve Carell, Paul Rudd and Zach Galifianakis never shines through. Scene by scene you slowly begin to realize that the \"aha\" moment is just not coming. I didn't laugh out loud once, and barely managed a grin. In fact, I found myself so disinterested by the halfway point that I only paid attention so that I could give a fair review. There was certainly little entertainment value to be found. What is probably most disappointing is that the very title of the film and main event on which it bases it's story only lasts a few minutes. That's right, there is roughly an hour and a half build-up to the actual \"dinner with schmucks.\" And believe me, there is no payoff. In hindsight, I should have skipped this one altogether. I could have found more humor in doing my laundry or taking a shower. But perhaps I've now taken one for the team and others may be spared the colossal waste of time this film turns out to be.",
      "total_reactions": 0,
      "user": "sailoraide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "A shallow movie lacking genuine humor or sentimentality.  It lacks any sense of direction or thematic pacing.  If this movie had been edited down to 22 minutes, it would have made a suitable TV sitcom.",
      "total_reactions": 0,
      "user": "miragerf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Worse movie I have seen in a long time. Love Steve but this was not entertaining at all. 2 hours of pure boredom! Don't waste your time or money. Glad I got to see it for free!!!!",
      "total_reactions": 0,
      "user": "bpkrause"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "Without question, the least entertaining film I have ever seen. It's disgusting to me that this thing got off the drawing board and was actually made.  I don't even know where to begin. You could not pay me enough to watch this film again. The only reason I didn't turn it off is because the French actress was so absolutely lovely and  Jamaine Clement held his own. Beyond that, totally atrocious in every regard. I'll bury the last remaining shreds of respect I had for Paul Rudd and Steve Carell and say a few words.",
      "total_reactions": 0,
      "user": "Verichai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Entertaining.  Good message!!!!  Unbelievable? Maybe .... especially to the people who aren't able to admit they are more like the \"bad\" people in the movie.",
      "total_reactions": 0,
      "user": "crs221"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "This film took what seemed like forever to get going. By the time the actual \"dinner\" happened, I really did not care anymore. The lobster lady made me laugh, but I did not find anything else at the dinner very funny. Carrell's character Barry was truly an idiot, but more annoying than funny to me. Rudd's character was an even bigger idiot for putting up with Barry as long as he did. Finally, Lucy Punch's \"mistress\" character was beyond stupid. She was so good in \"Bad Teacher,\" and yet so terrible in this. Jay Roach's career as a director has gone down the crapper. He was promising in the late 90s when he started the \"Austin Powers\" franchise, but then the \"Meet the Parents\" trilogy was two movies too long (though to be fair he did not direct, only produced, the third film), and now with \"Dinner for Schmucks,\" he has hit as close to rock bottom as you can get without actually hitting rock bottom. Give the lady who played the \"lobster woman\" bigger parts in more movies. Everyone else needs to dial it back a notch and think more about the types of scripts/roles they choose.",
      "total_reactions": 0,
      "user": "jasher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "This movie blows it. Bad storyline and a waste of talent. Total bummer.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "Absolutely terrible movie. We ended up turning if off before they even got to dinner. I love Steve Carell and Paul Rudd but Carell's character was so annoying that it made the movie literally unwatchable. I was in a good mood before we turned this movie on and now I want to burn down a building and abuse my kids. Awful.",
      "total_reactions": 0,
      "user": "mjamrst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Dinner For Schmucks is a funny and sometimes hilarious comedy that is fun and sometimes stupid at the same time.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Could 'Dinner for Schmucks' forebode the return of the screwball comedy genre of film? Given how pleasantly good this movie was it very well could. Going against the grain for these type of features, Schmucks focuses more on quick-witted and edgy jokes instead of the standard toilet humour which proved to be a breath of fresh air. While the two leads were great, without question the stand out actor is Zach Galifianakis who portrays Therman Murch. He provides audiences with one of the funniest, freshest characters seen on screen in years!",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "It was better then I expected. The movie is hilarious up until the last 30 minutes. Then the movie gets so depressing and corny that it takes the entire experiance of the film down quite a bit. The acting was decent but it could have been a lot better (I expected better as well). Overall it was an ok comedy that will give you quite a bit of laughs.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "A few laughable moments, Decent acting but nothing outside the norm for a generic comedy, The dramatic parts of the film were really freaking depressing, I mean really sad stuff that sort of ruins the movie imo. Overally, It's a rather generic comedy with nothing special about it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Aside from successful performances from Steve Carell and Paul Rudd, Dinner for Schmucks is just that and little more. Relying on predictability is a big no.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Normally Steve Carell and Paul Rudd would be enough to save a film from itself but nobody can replace total stupidity. The only way to enjoy a movie like this is to be completely drunk and not all there.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "I really liked this movie. It was pretty funny and had some really cool things in it. Steve Carell played his part well, and his character \"Barry\" is one of my favorite characters Iv ever seen. One of those movies where there's so many awkward moments you just want to cover your eyes and feel bad for the characters.good movie.",
      "total_reactions": 0,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 4,
      "text": "I liked the concept of this movie and felt it had alot of potential, but was quickly craddled to sleep. Entirely too much time is spent  to build this movie and introduce the premise/characters. Fortunatly I woke up towards the end where the funniest parts reside which the strangest collection of oddities the group can collect interact. THIS is where the movie should be centered.......",
      "total_reactions": 0,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Normally Steve Carell and Paul Rudd would be enough to save a film from itself but it is just implausible and some what sadistic. There were a few moments which tugged on my heartstrings and I actually felt Carell played the serious, emotional parts of his character better than the supposed comedic moments. All in all, there weren't enough laughs to allow me to rank this higher than 4.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 3,
      "text": "I was very, very disappointed with this movie. The actors in it are undeniably good, but good actors alone can't save how lame the writing in this movie is. Steve Carrell, an extremely hillarious actor, works hard despite being given one of the most unlikable characters I've seen in a comedy in a long time, while Paul Rudd is just going through the motions here. The only actor that comes out looking good in this movie is Zach Galifianakis as the villian, which is more solid work from him. This movie is just really not very funny at all, and everybody involved deserves better than what they are given.",
      "total_reactions": 0,
      "user": "adouble"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Watching the way Paul Rudd handles each of the guests and his or her idiosyncrasies is priceless, but Schmucks has something unexpected- it has heart.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Though some moments of the film (including its premise) are fairly low, it still has its moments and Steve Carell does prove to be hilarious.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Dinner for Schmucks is pretty generic. There are a few points in this movie that are pretty but for the most part the jokes don't catch very well. Steve Carell and Paul Rudd do what they can in this movie but the concept doesn't have the durability for a almost two hour movie. I think this movie couldn't be that much better considering the story.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Other than the obvious fear of Rudds wife banging the animal man and the obvious fact that Carrels character is a loser....it turned out to be very funny the way Paul chose a guy who makes mice things....excellent time watching galifinakis and carrell do pretty much anything..-JRA",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "The movie was funny when it wasn't overly stupid. The reason why we laughed at those Pink Panther movies because there was a sense of possibility in all that stupidity. When you cross that line to no possibility, as this movie sometimes does, it becomes just stupid.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "that was a real comedy movie.i like it and i advice you to see that...................................................................................",
      "total_reactions": 0,
      "user": "zahabitaha"
    }
  ]
}