{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 81,
  "mc_mixed_rating_frequency": 110,
  "mc_movie_name": "District 9",
  "mc_negative_rating_frequency": 136,
  "mc_positive_rating_frequency": 1122,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "district 9 is the best movie i have seen up to this moment. i loved every bit of it. the action is brutal, the characters are believable, and there is a clear message. that's right: district 9 is about stuff! seriously, do not miss out on this movie!",
      "total_reactions": 1,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "An allegorical satire of Apartheid, represented by a sci-fi action film. Also comes into the film is its gritty violence, profane dialogue, and dystopian view of Johannesburg. The photography and CGI are stunning and astonishing. Sharlto Copley is under-exaggerated from his spellbinding performance. 'District 9' is a well crafted and wriiten political message of the horrid effects of segregation. Neill Blomkamp is a new breed of sci-fi filmmaker.",
      "total_reactions": 1,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "District 9 is more of a 6.",
      "total_reactions": 1,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This isn't just some action movie. This strange sci-fi movie is completely scary, dark, raw, and suspenseful. Sharlto Copley should have at least been nominated for the Academy Award for Best Actor. He completely nailed his part, and helps us to feel the emotion and horror.",
      "total_reactions": 11,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "It is a great movie, and every science fiction fan should watch it. The story is quite unique from one perspective, because in this movie the aliens are not the threat to us - we are the threat to the aliens. The story is also great and not hard to follow, the characters have very sharp personalities.",
      "total_reactions": 5,
      "user": "HomeCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Loved the documentary style at the beginning of the film. Although it wained slightly after that, the twist was a great move and the storyline very complex for a movie where Aliens and Humans get blown to smithereens.",
      "total_reactions": 3,
      "user": "Paxster"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "This bizarre SF movie, appropriately structured using documentary styled filming, is simply one of the year's best movies that effectively acknowledges the audience of racial discrimination.",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Next Peter Jackson's movie and next amazing movie!",
      "total_reactions": 5,
      "user": "DeGreZet"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "What a waste of a great premise! This movie starts out with a really interesting concept and procedes to digress into just another stupid action movie. It makes me very sad, this movie could have really unique and interesting but as the movie progresses it gets less and less unique and interesting and gets more and more cliche action movie explosions. Kudos for a great concept, and shake of the head for failing to do anything with it.",
      "total_reactions": 9,
      "user": "lususgreene"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is so bad I couldn't finish it.  If I want to watch raw news footage I can go to YouTube.",
      "total_reactions": 8,
      "user": "Vorlargen"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "I won't lie, I was expecting a great movie when I went to see this. It was terrible. The thing is, it's easy to trick americans into liking a movie with an original premise and neat special effects, not to mention the documentary filming style which made viewers feel intelligent. This movie is like the product of an intelligent person writing down a good idea, and giving it to mentally challenged filmmakers. Everyone seems to overlooked the annoying flaws of this movie: The behavior, the dialogue, the use of the line \"I'm not leaving without you\" and  various other cliches that you wouldn't expect to find in such an \"original\" film. There were dozens of moments of annoying stupidity that I kept trying to ignore. And there is no real excuse for all the discomfort in the movie. I usually forgive films for being stupid because they are still enjoyable. This movie had little to enjoy (except for when the robot shoots a man with a dead pig, I got a good laugh out of that) . Just the fact that it was original, the fact that it had allegories to apartheid and racism, and the fact that it was filmed like a documentary seems to have everybody won over. But I can't forgive all the stupid dialogue and behavior. I could just see through every silly second. For example; the love for cat food = Random aspect that makes the aliens seem more real. There was a lot of cheap little ways they tried to make the aliens seem more real. But right from the beginning, I couldn't help but see through them, and if I was less observant and more gullible I probably would have enjoyed the movie. I could write a book about all the things wrong with this movie, but I should not write so much in a movie review. I just can't be concise with this subject. I just want to end with this fact: I walked into that theater expecting a great movie. As the movie went on, I was struggling to convince myself that I was watching a great movie. I couldn't do it. Later I went to see Avatar, expecting a bad movie. I thoroughly enjoyed it, because it was honest and it's silliness was forgivable. James Cameron understands that its more important for a film to be enjoyable then it is for it to make a statement by being different.",
      "total_reactions": 4,
      "user": "thesantanafan"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "This movie was too freakin weird and disturbing as hell.  Too much swearing as well.  Every other word was the f-word.   I don't understand how you can enjoy this movie",
      "total_reactions": 9,
      "user": "GoldenEye16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Simply put, this movie is astounding. It provides an original sci-fi story, the acting is superb, the script is well written, the effects are fantastic for the budget they had, the action is heart-pumping, there's some great emotion, and even some funny jokes. Overall, District 9 is a great sci fi movie that will go down in movie history as one of the best scifi movies ever.",
      "total_reactions": 1,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "I'm a BIG sci-fi fan. I can watch a sci-fi movie, does not matter how bad it is. But this is the first one, I wasn't able to watch it trough. I would say that it is far the worst movie I've ever seen, but this is not even a movie, it's a 2 hours crap...terrible",
      "total_reactions": 4,
      "user": "IstvanM"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "My expectation before watching this movie was: if Peter Jackson is the director, it will suck. I was confirmed. I stopped caring after 180 seconds when the aliens were shown for the first time. These must be the most ridiculous aliens in film history. The pseudo-documentary style is horribly nauseating. There is not a single scene in this movie that looks professional, it is overly clear that the actors are...acting. It has the feel of a home video made by a child.",
      "total_reactions": 10,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is absolutely incredible, not only does it mix the idea of alien refugee's coming to a foreign world, but it also has a lot of content that relates to racial disputes during South Africa's apartheid.",
      "total_reactions": 1,
      "user": "VentXekart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Overall, kind of a dumb movie.  Wasn't exciting.. wasn't compelling.  Had good special effects, but all movies do nowadays.  I wasn't impressed, but it was unlike any other movie I've seen.",
      "total_reactions": 1,
      "user": "emeraldstorm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Satire and other allegorical pieces of fiction have a tricky job to do: They must offer commentary on something that we immediately recognize in our world, while creating an interesting enough world for those who are unable to recognize the subject of commentary. It is here where District 9 fails. For despite the powerful images one can associate with apartheid, the absence of the allegory leaves a confused, poorly-plotted, and (let's face it) trite human story. And then it closes itself by shooting everything up.",
      "total_reactions": 2,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "I lost my interest when the first image appeared on the screen. Such a bizarre concept that was just plain stupid. Nothing about it I could appreciate. Such a failure. Can't believe it was nominated for best picture.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "I've seen more exciting \"action\" on CNN, which by the way is how this piece of cinematic garbage is shot. The first 1/3 of the move is filmed like it was shot from some $30 kmart handheld camera. Think Blair Witch meets Transformers but remove all the good stuff. Do yourself a favor and don't suffer through this movie. It really doesn't get better as it goes on.",
      "total_reactions": 1,
      "user": "Dalgrim"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2013
      },
      "score": 0,
      "text": "This movie is just really crappy. So crappy that I made an account to say how crappy it is. Horrible plot, an ending that almost seems like it was never finished, and non memorable characters.",
      "total_reactions": 2,
      "user": "onewhoknowsall"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "This was an outstanding debut by the New Zealander Blomkamp. Consistently enthralling and keeping one at the edge of his seat. THIS is a recent film, like 'Master and Commander: The Far Side of the World', that should have spawned sequels. Much better than his follow-up, 'Elysium' (I haven't watched any others he's made since; hope he doesn't end up a cinematic one-trick pony like M. Night Shyamalan...).",
      "total_reactions": 1,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "this movie never stops entertaining you with its brilliant screenplay. it shows how disgusting the humans really are, than the aliens. this is the best sci-fi movie i have seen. believe me, you wont get disappointed after you finish watching this movie. i give it a perfect 10.",
      "total_reactions": 2,
      "user": "abi_abhiabi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "a fun movie with a almost documentery first half that feel alittle odd then picks up into a action flick last half. its a fun film to wach with some great action and a few moments of commedy . also any film with a mech in it im already sold . although it feels like half a film though when you see the ending and left me wanting more of a resolve to it all. it deffinitly felt different from your typical alien movie . which i felt overal was a good thing.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is an epic sci-fi movie. A fictional documentary style movie tht captures a persons attention and heart. I absolutely loved every minute of this film and can't recommend it enough.",
      "total_reactions": 0,
      "user": "1966Zodiac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Sorry, mechanical translation. Sentient Beings Our man-Wikus Van De Merwe  Sharlto Copley / MNU-Alien Affairs \"We meet at the headquarters of the Department of Foreign Aliens MNU. \"What we do here in this department ... is trying to establish contact with the shrimp, in the interests of MNU and humans.\"   Sensitive people of any age and during the movie experience a natural intellectual intuition, their thinking suffered a further violent jolt, a little later. Some goals are reassessed, some set aside, and others reformulated. Initially, the camcorder shoulder creates a slight sense of unease that is gradually disappearing when you start face to face with the new extra-refugees, their history and the many key points to ensure, without any filters. Why, for example, the Nigerian government has created a lot 'of problems with Sony's presence in the film of figure Obesandjo  Eugene Khumbanyiwa /? Everything has always been seemingly formless, mysterious, becomes perfectly understandable. The consequence of this new state of being, the reason will inevitably take place, is the unleashing of an infinite number of emotions. Even phobias, probably tend to decrease. The exoskeleton is not afraid, surely you realize that the real \"enemy\" is to be found in other forms of life, perhaps similar to ours in that? Shrimp, aliens, strangers, \"Poleepkwa\" or non-humans are sentient beings, that is fitted with a brain and a fully developed nervous system. And 'any sentient being who is suffering physically and mentally. We can not know why they come, are higher than humans, have a hard outer shell and a face full of tendrils mass, probably involved in chewing, but was not tried. They have a great forza.Christopher Johnson is one of them is a non-human, but very, very, special ... his history with the violent impact of Wikus Van De Merwe  Sharlto Copley / A question and some topics covered by the director. Wikus will be easy to trigger the clearing operations? Nepotism and factionalism. The role of the bureaucracy. Apartheid, its consequences. The DNA of the galaxy. Illegal weapons and cat food.  A not-too-happy marriage /. Elimination, cleanup and removal of mass effect. The choices of power vs. the power to choose. Disease and loneliness. Genetic mutation. Weapons of mass destruction. Science and Power. The Taste of Power. The media. Crisis and the end of a regime. The different origins.  A new friend Sir Peter Jackson  producer known to the general public for his work on The Lord of the Rings, he sensed in the script by Neill Blomkamp  director and co-writer / Terri Tatchell with a new, penetrating way of presenting a drama, epic, united in while a thin, bodily humor. He pointed and won. So I understand. Good Clicks!",
      "total_reactions": 0,
      "user": "RONGIU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "The film starts in quasi-documentary fashion with a strangely comic tone, but do not be put off. It gets much better. As much about the problems of the African Continent as a convential Sci-Fi. A well crafted highly original film.",
      "total_reactions": 0,
      "user": "tonyGreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Interesting film, I think the first 20 minutes were boring but then it became more entertaining. Simple storyline but the ending is a bit different aside from Hollywood cliche endings. I'll tell you that. Also the main character says **** a lot of times... It was unnecessary.",
      "total_reactions": 0,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "Great! I loved it. The aliens actually looked real and you can feel for them just by the look on their face. and the end battle sequences were awesome. and the scenes involving Sharlto Kopley's character's dilemma, were really well done",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "District 9 is a frustrating film. The movie opens with a fantastic set up providing a more realistic and believable version of contact with aliens. This premise could’ve lended itself to a brilliant social commentary on issues such as race and segregation but the film throws that out  the window turning into a dumb action movie with poorly developed characters and pointless shaky cam. If this film had just made itself clear that it was going to be a dumb action film from the start I would’ve been less harsh but the fact that this film opens with such a great foundation to a point where this would’ve been a 7/10 and then quickly throws that a way in favor of running and shooting. Check the film out if you are curious but don’t expect anything deep or meaningful.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "The InstaFlicka Index 3.86/5 ------",
      "total_reactions": 0,
      "user": "InstaFlicka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Grand.I wanna se halo movie to",
      "total_reactions": 0,
      "user": "spartan-117"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "District 9, a surprisingly emotional science fiction/thriller is one of the most unique and original films of the year. It starts off as a documentary, a very clever way to make the whole concept seem realistic. The concept is aliens arriving on earth and being kept in slums by the humans, and not being allowed to leave. Being produced by Peter Jackson, you would expect it to be a visual feast and it does not disappoint. The aliens, or 'prawns' as they are called, are incredibly realistic. It had a wonderful start and terrific ending, but faltered slightly in the middle when, in my opinion, all I wanted to see was how it turned out in the end. However, overall it is a fabulously unique film and deserves its Oscar nomination for 'Best Picture'.",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This film is amazing simply because it is so frickin realistic and you will have no idea what you have sat down to watch. And it is original because it pulls off everything every other movie has been attempting to do for years. A must see. GO NZ!!",
      "total_reactions": 0,
      "user": "KateM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Peter Jackson is very good at science fiction while making this huge entertainment. it displays a lot of xenophobia and racial discrimination based off the events of the apartheid, and it has a lot of nightmare fuel for the kids and its not for the squeamish. still, its great. we all know that every movie Peter Jackson makes kicks a**.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "An ugly, post-modern yet ramshackle and banjaxed picture that sidesteps convention so often it risks falling into the well that \"Limits of Control\" is currently drowning in.",
      "total_reactions": 0,
      "user": "Mornington"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "wow, this movie is some serious thing. the story is great, the script, the message, the everything! i'm not a big fan of sci-fi genre but this really amazed me.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "District 9 is an incredible action / SF movie. It really recalls some of the classic old films from the 80's such as Robocop or Total Recall with it's sense of gory fun. Yet somehow, I also find District 9's action sequences to be very moving. There's a sad streak that runs through the film and gives it genuine heart. Both the MNU infiltration scene and the final conflict leave me with a frog in my throat and a tear in my eye. District 9 is an SF film with deep subtexts, great acting, memorable characters and action sequences that both thrill and impact you emotionally. What more could you possibly ask for?",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "\"They must just go. I donâ",
      "total_reactions": 0,
      "user": "monkeybrainspit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Jaw-dropping, amazing, epic, masterpiece, touching... I could go on forever. The acting was unbelievably good (especially Sharlto Copley), and the message truly delivers. It makes you stuck to the screen till the end, and your heart pound faster throughout the movie. One of the best sci-fi movie in existence.",
      "total_reactions": 0,
      "user": "Dragons4Life"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "First off, a very original movie.   The story here is not so much interesting, as the way it is executed.  The viewer stick to the character of Vikus who`s just another yupie guy in pursuit of a career.  He is to lead the operation of transporting thousands of aliens.  It all goes wrong and he must fight to survive. In a matter of hours he becomes public enemy number one and has to flee to the alien camp. The aliens are interesting as they posses human like features. They resemble humans in many ways. They are not here to destroy earth or exterminate humans. They are stranded somewhere in the universe and it happens to be earth. The special effects are exceptionally well done, the music is great and acting is average. A very interesting story showing that aliens from another world don`t always have to be blood-thirsty invaders.",
      "total_reactions": 0,
      "user": "MustisTheCat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "At first, I was hesitant due to the overlong opening credits sequence but was blown away by the rest of the film. While I normally despise the overuse of CGI in modern cinema, this film is an example of how to use it both properly and effectively. The aliens look amazing and are nearly always perfectly in sync with the human characters. It is also a highly original concept; in most alien sci-fi films, the aliens come to Earth to destroy our planet, but here they want a peaceful co-existence with mankind, at least that is the basic premise of the plot. In other words, the cliche is reversed in that humans are seen as the main villains and not the aliens, due to the fact all the humans want to exploit the alien technology and make billions in profits. The film also sports some homages to earlier films of this genre, most notably Independence Day (1996), due to the huge mothership that is floating above the city of Johannes burg but never attacks or even moves, and of course the human-alien creature the main character gradually transforms into is a direct reference to The Fly, with similar make-up effects and scenes that show the phenomenon up close, without looking away. Overall, I thoroughly enjoyed the film as far as it went and I await a sequel with great anticipation.",
      "total_reactions": 0,
      "user": "TheNewSpielberg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "District 9 is an interesting , curious and different film for what we see very often. But, there are some stuff that don't plug and are tiresome, though, I like the theme that is presented for the crowd and messages that we can notice later on.",
      "total_reactions": 0,
      "user": "Watermelon789"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "District 9  Is a movie that has it's ups and downs. Nominated for Best Picture at the Academy Awards, this film proves to be what it's supposed to be. Nominated. Not winning. The true fact is that the whole thing isn't good, only the beginning and the end. At the beginning, the documentary style captivated me COMPLETELY. But after a while, suddenly it starts going to the \"normal\" style. Thats what I hated. But then, it turns back to documentary, then back to \"normal\", and so on. For like half an hour. Then, the story becomes interesting. It captivates me. And at the beginning, I have total DISGUST for the aliens. But somehow, the movie does it, and I realize they have feelings, and I also feel for them, as well. But that's not the best part. The middle might have been a lot of \"what the?!\", but the end makes up for it quite well. The intensity and sudden \"Whoa.\" is just half of what the ending does for your entertainment. The emotional alien attachment and the truth about the lead is the other half. If you put those halts together, you get a spectacular 2/5ths of a film. So an excellent first 2/5ths and then the last 2/5ths added together makes 4/5ths of enjoyable film time, and the other 1/5ths, eh, plots the film, i guess. But all in all, District 9 fell just short of the \"9\" in the title, and it receives an  out of 10.",
      "total_reactions": 0,
      "user": "Shahmeer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "An alien race, known by the human population as 'prawns', have been forced to live in a militarized zone in Johannesburg called District 9 for 28 years following their arrival on Earth. Confined to poverty tensions are starting to mount and a munitions company are contracted to forcibly remove the 'Prawns' to a distant compound.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "@All the people that gave negative scores, most of you people aren't even from South Africa. So don't call this movie racist or unrealistic if you don't understand the conditions here. It was very realistic and it was done with a relatively low budget. I don't like the unrealistic Hollywood movies of today, for instance:all the UFO's conveniently land in North America, and all the aliens are always hostile. The gore is NOT unrealistic, of course with that technology something like people exploding would happen. The script was also very realistic.",
      "total_reactions": 0,
      "user": "slapchips"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "First impression, wow. Just... wow. A gore fest, shaky documentary, stunning sci-fi and drama all in one, here is the first sci-fi splatter drama in ten years that can be considered a masterpiece. Directed by a newcomer named Neill Blomkamp, District 9 shows us a story of freedom centered on the turning point in the life of Wikus (a surprising performance by non-professional Sharlto Copley), a field operative fresh from promotion. He's hired to lead the eviction of the \"prawns\" (the creepy aliens) but something terrible happens to him that will change his life forever. A Blair-Witch-Project-meets-Independence-Day film, District 9 demonstrates beautiful storytelling. It's filmed in a documentary style that would recall Cloverfield. I guess that film contributed a lot to Neill Blomkamp, who deserves a best director Oscar nomination for this one. It's a blast directorial debut and I'll be patiently waiting for more from this Canadian filmmaker. District 9 is a very big achievement in terms of its technical qualities. The visual and sound effects were all complex. Add to that the voices of our sympathetic aliens. The pacing was also brilliant. All action, the film becomes more thrilling after the twist that'll very much change the life of our main character. Above all, District 9 is one of the best of the sci-fi genre. It's moving and terrifying (not to mention totally humble) in the same degree and I just love it. It's more than what most of us expected.",
      "total_reactions": 0,
      "user": "itz_giological"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "An outstanding science-fiction film which of coarse is not fully appreciated by a lot of viewers. The storyline and cast were very professional and believable, which tied in nicely with the morals of refugee cruelty. Visual effects and sound were also most impressive to accompany the stunning gore. Sharlto Copley is also worth noting, as he suited the role of Wikus nicely.",
      "total_reactions": 0,
      "user": "Alexander_N"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "District 9 was my favourite movie of 2009 and one of the best science fiction movies to be released in several years. The aliens join some of the best movie monsters in cinema and I found myself really caring for them and their situation. The ideas are well executed; the guns and action is thrilling and its drama works well for the most part. The movie does have some flaws; the lack of resolution to the premise is an issue, the amount of swearing is unnecessary and the middle of the film does drag a little. But District 9 is still an awesome sci-fi. Recommended.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is one of the best of 2009. It has everything a Sci-fi fan could want in a movie. Great special effects, good plot, and amazing action scenes.",
      "total_reactions": 0,
      "user": "pwnstar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "\"District 9\" - One Line Review! (B!)",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This film catered to me on so many levels it quickly became my favourite, I never tire of watching it. District 9 has a premise that would not have been out of place in a classic SF novella, frenetic action sequences informed by modern video game titles, it's funny, disgusting and exhilarating. Watch for the Afrikaans humour littered throughout.",
      "total_reactions": 0,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Not only is it an excellent sci-fi movie(Which is rare), it's an excellent movie in general. It has plenty of action, decent editing, and a lot more. Sure, the script may be so-so, but the rest of this is a fantastic movie. JUST NOTE THAT IF YOU DON'T WANT TO SEE PEOPLE BEING RIPPED TO SHREDS DON'T WATCH THIS MOVIE.",
      "total_reactions": 0,
      "user": "Overrwatcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Weird. A very hit and miss film which does more wrong than right, but will be entertaining enough for most to be worth a watch. I'm not a fan of films which are shot in a documentary style, and by far and away the best bits of the film are where it's shot like a normal film. The film treats the aliens and characters in general as far too disposable too - you really do just see them as cannon fodder and often find yourself asking 'why don't we just wipe them out?'. There's also massively implausible and unbelievable parts in the plot, which water the entire experience down too. So what makes it worth a watch? Well it can be quite emotionally intense in the odd bit, and the violence + action is done really well, with a good ending scrap. A throw-away film popcorn film which is suited to putting on in the background when you have mates round.",
      "total_reactions": 0,
      "user": "SpunkyMonkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Great film. Unique and highly enjoyable. From the click language of the prawn-like aliens to the properly done documentary style beginning, I enjoyed this film. A classic Sci-Fi on a small budget. brilliant. Sharlto Copley is brilliant.",
      "total_reactions": 0,
      "user": "JonathanC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "One of the best science fiction movie of the late 200x years.",
      "total_reactions": 0,
      "user": "skedar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Talk about breathing new life into a genre that probably has the most DIE-HARD fans out there. While science fiction features have been entertaining us for decades, District 9 breaks the mold and goes against the grain in terms of showcasing a completely different backdrop in contrast to the norm. While this flick deserves high praise for its originality, it is sadly quite convoluted in many parts. However, once the picture builds up steam, you eventually make sense of it all. Having said that, I still can't help but feel the director left it too late in the film.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "(September 25, 2009)",
      "total_reactions": 0,
      "user": "T-rAv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "District 9 is a sci-fi film of 2011 directed by Neill Blomkamp. In the 80s an alien ship stops over Johannesburg. The ship remains stationary and after three months the state of South Africa decides to send soldiers to explore the ship and find a group of aliens in poor conditions, because of their appearance, are nicknamed \"prawns\" (derogatory term with which they are called). Brought to earth the relationship between them and humans is very tense and difficult and therefore are confined in District 9 and controlled by MNU, a multinational company that says they want to help the relationship between humans and aliens but really want to discover the secrets of arms the \"prawns\". After 20 years since their arrival, the villagers are fed up and demand that the aliens are moved. It is the task of Wikus van Merwe to move the aliens. The film is really a very original: the aliens that are in all respects immigrants who are misunderstood and despised by humans. A film about various topics such as racism and integration. The whole story is told in the first part as a mockumentary and the second as a normal film starring a man (Wikus) and insecure coward who understand the hard way how they live aliens. Excellent special effects (especially the way in which they were made aliens).",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I wasn't expecting this. I kept hearing how awesome this movie is, and in the end, I was confused.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I love District 9! The way it's presented is original and fresh and provides a great new change to your typical sci-fi action film. The story is gripping and provides a great concept and is surprisingly believable and allows you to immerse yourself in the film. The acting is great and convincing, despite the unrealistic premise. The film is difficult to fault, however, I could say that it is inconsistent and switches to a very different action based film about halfway through which makes you forget about all the other interesting ideas and themes being presented previously in the film. Overall it's a must watch film!",
      "total_reactions": 0,
      "user": "Gman666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "As much as I love the plot, setting and supporting characters.  It is Sharlto Copley playing a Afrikaner bureaucrat who is reluctant, self serving, but not devoid of empath who makes this film.  The increasing level of insanities he has to endure make it exciting to watch and believable due to his performance.  The outstanding CGI helps too.  The 'Prawns' are as real as the brilliant pacing.  The music is excellent too.  'Christopher' the computer graphics alien engineer as believable as anyone else.",
      "total_reactions": 0,
      "user": "Hyperbole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "Really good movie, with a slow beggining, but an incredible conclusion. Worth watching. I hope they make a sequence for it. Just didn't like some incoerent acts by the protagonist part.",
      "total_reactions": 0,
      "user": "Androu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "A fascinating look at society through the eyes of South Africa and an alien invasion under the lens of an unusual documentary. District 9 is both one of the most peculiar films I've ever seen and one of the most interesting.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "District 9 is an excellent sci-fiction movie. The interesting story line makes the film different than other sci-fiction movies. The movie is  mixed with some comedy and strong visuals. It  is something you defenitly want to see.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "District 9 can be broken down into two halves, the situation and characters are introduced through a combination of documentary style interviews, both present and retrospective, and news reports. This approach serves first time director Neill Blomklamp well, as not only is it intriguing and different, but its a fairly cheap method (the films budget was only $30 million and it took in over seven times this at the box office). Following the introductory first half, the action switches to following Wikus as his troubles begin to increase. ﻿",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Overall a solid movie. Depicts a realistic scenario of alien presence on Earth, and the treatment of them by humans. Unlike many movies involving extraterrestrial activity on Earth, the aliens are NOT the antagonists, but rather a private military corporation known as Multi-National United. The movie is set in Johannesburg, South Africa during modern times. The visuals are stunning, and there is no shortage of intense (but not mindless) action. The weapons and technology the aliens use are also impressive. But the clear message the movie sends is that the aliens are not invaders, but rather intergalactic travelers who are shipwrecked on an unfamiliar planet, and fall victim to human evils such as oppression and discrimination. I thought overall this movie was quite original for a sci-fi action flick, and forces the audience to change their perspective of aliens coming to Earth.",
      "total_reactions": 0,
      "user": "hodub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "It's classic, thrilling, it's just amazing. From the acting and storytelling to the visuals and effects, it's a tremendous accomplishment. This intense sci-fi is a must-see.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "A Really Good Movie!",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "As a whole this movie is very cleverly structured and the cinematography is very effective in terms of maintaining the suspense and action that it is set out to capture. Also Sharlto Copley gives a remarkable performance as Wikus van der Merwe but despite all of this, the narrative of the movie is quite bland and doesn't really live up to its desired purpose of entertaining its audience. It manages to immediately suck you in to the story with the realistic documentary styled opening but unfortunately pushes you back out as the narrative progresses.",
      "total_reactions": 0,
      "user": "TeddyD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "This is a nice little twist on the alien action film, as here, the aliens are the good guys., which is a nice change. Sharlto Copley is fantastic in this role and this, combined with Elysium, showcase his great talent, especially while working with Neill Blommkamp. The film is also very well made and directed. The action sequences are well done and the story is told very well. The mockumentary style used at times was very unique and an interesting way of setting everything up. In addition, the special effects are stellar. The spaceships, weapons, and aliens, are brilliantly crafted and beautiful to watch. The story is very well written as well and the amount of emotion here is very nice and adds a layer of depth to the sci-fi action flick that this one is. My only concerns here are the, at times, excessive gore, which I am never a fan of and the inclusion of the Nigerians. I can see why the Nigerians took offense, but my personal concern is that it was very over the top and unsettling in a bad way, not a good unsettling, if that makes sense. Overall, District 9 is a very well made and acted science fiction film that has me looking forward to a possible sequel.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I loved the idea of this movie, but the  execution wasent best in my opinion, i was waiting for something else. First 20-30 minutes were amazing, i thought how noone had this great movie idea before but few things remained unclear for me. I also didnt really like the personality of actors,  sometimes it felt so stupid.",
      "total_reactions": 0,
      "user": "Xgashh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "Wow. This film is on another planet to most sci-fi films. A true classic that will surely develop a cult following in years to come. The emotional arc within the plot is truly outstanding and I really did not see the ending coming. Sharlto Copley was fantastic and though I found his accent hard to understand at times I did not mind as it is obviously a different accent to that of which we are mostly used to (unless you have some connection to South Africa). The underlying message was crystal clear for everyone to see and unless you are oblivious to all that went on in South Africa/Rhodesia you would be hard-pushed to find a more emotional sci-fi thriller. I had never heard of Neill Blomkamp before this but this would have been my choice for Best Picture, Best Director and maybe even Best Actor.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "District 9 is a sci-fi action movie about a huge alien spaceship which crashes onto Earth. Humans go inside the ship and find loads of aliens which look like a cross between a human and a prawn. All the aliens inside the ship were later enslaved and forced to leave the spaceship and live in a shanty town where they are being watched and guarded heavily by the military. Then there is a man who has taken a great interest into the aliens, he has researched the origin of the aliens and has learned their language. He goes around the shanty town asking aliens to sign a form. later on he finds a strange alien device from one of the alien",
      "total_reactions": 0,
      "user": "BlueBox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Neill Blomkamp makes his directorial debut with \"District 9\", a movie that caught me by surprise. The movie initially caught my eye when it was featured as one of the ten movies nominated for Best Picture at the 82nd Academy Awards, and I've had high expectations ever since. However, after watching \"District 9\" I can safely say that those expecations have been undoubtedly destroyed. Neill Blomkamp creates the most intelligently crafted science-fiction films I've seen since \"Inception\". He utilizes an incredibly innovative documentary-style cinematography to create a tangible sense of realism. Another remarkable aspect of this movie is the fact that this film was created on an incredibly modest budget, and it raked in about seven times the amount of the funds at the box office. Pretty good stuff. The movie also features an unbelievably affecting performance from then first-time actor Sharlto Copley. He really does a fantastic job at illustrating all of the trials that his character, Wikus Van Der Merwe, has to endure. I was entertained throughout the entire duration of \"District 9\" and I would gladly watch it many more times.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "This film really surprised me, brilliant in so many way. The thing that caught my attention right away was the documentary sections. I did not think it could be so appealing, but the mockumentary strategy really sets this film apart from every other lame alien movie. It makes the entire story feel so real. Brilliant filmmaking! For a relatively low budget, indie film, I was surprised by how great the special effects were. The action scenes were awesome, as were the aliens. I also really liked the gory parts of the film, it works. I was also very surprised by the acting, particularly by first time actor, Sharlto Copley. He gives a very strong and emotional performance that really carried the film and added a great level of emotion and intensity to the film. This is an absolutely fantastic movie. Right alongside Avatar as one of the best films of 2009!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Though Avatar overloaded on visuals, District 9 stomps all over Avatar making it the best sci-fi film ever{Besides Avatar was pretty bad anyway}. Its possible the best film of all time as well.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Although the confusion of humans understanding an alien language and vice versa is never addressed, this film emotionally involves the viewer to a degree most films cannot reach and keeps them focused and involved throughout its whole, original entirety.",
      "total_reactions": 0,
      "user": "InsanityOnABun"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This is a very tricky one for me to review as when it started I hated it. I thought it would end up as being terrible, but as it went on it slowly got better to having a pretty decent conclusion. I hated that it had to take so long to get there so it affected it's final score, but the overall concept was a great idea, it was just bad delivery especially in the first hour or so. Overall it's a bad film that had potential to be a very good film, but it seems most that watched it still loved it.",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "A stellar critique of apartheid. I really enjoy smart sci-fi and District 9 brought it. Can't wait for Elysium this august, which looks fantastic as well.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "District 9 is one of the best sci-fi movies of the past decade and the list doesn't stop there.  It's an incredible debut for both its director and its lead actor.  It was modestly budgeted but still managed to have some of the best visual effects around. And it's all held together by a lean, politically charged, and well realized script.  It even gets you to feel sad for the aliens.  It could have used less F bombs, but it's still a great movie, and it deserved all of its Oscar nominations.  It also deserves a decent sequel.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "What happens when Peter Jackson joins Neil Blomkamp in a sci-fi movie?. An original story, stuning visual effects, and a impresive acting by Sharlto Copley, makes and amazing movie",
      "total_reactions": 0,
      "user": "TheFineBro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "One of the most positive surprises of less known productions grabs the viewer by the throat and holds until the end. District 9 is Sci-fi only by definition, yet the underlying political and sociological themes are presented in enough subtle way for those who only wish to enjoy it only as an story.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "My favorite movie!",
      "total_reactions": 0,
      "user": "blogfirstlast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "If you watch cinema today you know originality has been down the  and there's been an almost severe lack of great science fiction (say \"2001\" or \"Blade Runner\"). However of all the films to come out in 2009 I feel \"District 9\" surpasses the likes of \"Avatar\" or \"Transformers 2\" proving that even on a incredibly lower budget that CGI is maturing rapidly beyond \"expenses\" and \"limitations\".",
      "total_reactions": 0,
      "user": "George-roots"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "District 9 is one of those few movies that sticks with you. It is baffling how great this movie, with such a simple premise. I'll get it out of the way quickly that the acting and cinematography are spot on, but what makes the movie great is that it surprisingly pulls you in emotionally, with very good, and at times very original action scenes and moments. The story keeps you guessing and gets more and more intense as it goes along, and there's really no reason not to recommend this movie.",
      "total_reactions": 0,
      "user": "NimbleReview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Neill Blomkamp has been recently regarded as a “fluke” by fans and critics, largely due to the commercial and critical disappointments of his fellow science-fiction follow-ups, 2013’s Elysium and 2015’s CHAPPiE—which, by all means, has fared well with fans more than it has critics compared to the former. But fortunately, Blomkamp’s dedication to his 2009 directorial debut District 9 shows that he has an ability to create modern sci-fi classics that can balance both grit and visceral storytelling.",
      "total_reactions": 0,
      "user": "asjklasjklas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Apartheid, political messages, action film, sci-fi, documentary....does this film balance it all well? I really don't know. What I do know is that this is definitely one of the best films I've seen this year. While watching it you are disturbed, you are disgusted, you are moved but ultimately you are most certainly entertained.",
      "total_reactions": 0,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "An excellent, modern sci fi interpretation of apartheid. Kept me captivated and enthralled all the way through. First you begin disliking the prauns, but as the plot progresses, I began to sympathize with them. The cinematography is phenomenal, a work of art in its own. The only thing that bugs me, and keeps me from giving district 9 a 10 is the ending. It's too ambiguous for my liking.",
      "total_reactions": 0,
      "user": "Bigzoobs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "District 9 blew my expectations, but it might not be as great for everyone.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "District 9 is my number one film of all time and deservedly so - it delivers its messages with substance and does too many things right to even consider negatives.",
      "total_reactions": 0,
      "user": "Aijixe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "A story that could have made an awful or a great film turned out to be the latter. Style of prose and filming really suited what the film was aspiring to be, and an all-time favourite for me.",
      "total_reactions": 0,
      "user": "Dr_Fetus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "At first I tought that it will be another action film from the bunch, but after I saw it I really appreciated that that was not the case, until the -almost- very end; I felt that became that part of the bunch that I didn't wanted it to become, but quickly moved away from it to focus on the plot. The political feel was amazing. It is something more than just a Sunday blockbuster.",
      "total_reactions": 0,
      "user": "CharlieW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "This film far exceeded my expectations. Seamless transition through genres, beautifully developing characters, extremely exciting and bizarely moving. Only one character that i feel could have done with a little more development or back story, but its only a tiny issue in an otherwise fantastic film. I think district 9 is original and clever and an altogether excellent film.",
      "total_reactions": 0,
      "user": "ingie44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Paths were ripped away before they were well-developed, and overall the movie should have been mediocre. Still, for whatever reason, I left the theater unusually satisfied.",
      "total_reactions": 0,
      "user": "entelejent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Innovative special effects, rousing performances and a smart, emotionally charged story with hard-hitting action all elevate a standard-looking docu-drama into something quite special. Director and co-writer Neill Blomkamp emerges as a promising force in film, along with lead star Sharlto Copley.",
      "total_reactions": 0,
      "user": "Handyman003"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Amazing effects,great story,great actors and great characters.The movie have everything you want:action,Sci-Fi and some horror.I don't know what to say the movie is just amazing.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "District 9 is one of those rare sci-fi movies that gets everything right. It manages to be a small movie while still being really good. Considering this, don't be quick to label this as some little weird hipster movie because it's not. It's reasonably sized and that balance is what makes it so awesome. Less is truly more in this case, but trust me there is a lot of solid action in it too. But it's meaningful because it progresses the plot.  It's a shame that it was overshadowed by Avatar because it outperforms that movie in every way: the characters are grounded and believable, the setting is dystopian, (kind of in the vain of Bladerunner, which is my favorite movie) and in contrast to the largely present cartoonish CGI these days, the special effects are shockingly convincing. All these components work really well to portray a gripping story that incorporates realistic themes, while still not coming off pretentious and self important (*ahem* Avatar!)  In short, the movie balances simplicity and complexity very well. Overall I left the theater feeling really satisfied. I really hope there's a sequel.",
      "total_reactions": 0,
      "user": "PrivateJoker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "District nine is an example on what a good sci fi thriller should be like, it has such a wonderful design and what would happen after aliens visited the modern world",
      "total_reactions": 0,
      "user": "xdhollywood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Over twenty years ago, aliens made first contact with Earth. Humans waited for the hostile attack, or the giant advances in technology. Neither came. Instead, the aliens were refugees, the last survivors of their home world. The creatures were set up in a makeshift home in South Africa’s District 9 as the world’s nations argued over what to do with them.",
      "total_reactions": 0,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "It is a good movie but it is very over rated. It has a good mix of action/sci-fi but it has some very boring slow parts which gives it a bad start. I liked it but it was too much of a documentary.",
      "total_reactions": 0,
      "user": "JudaMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Best movie I've ever seen! Although it started off a bit slow, the last hour was non stop action. So thrilling and action packed I had to create an account on metacritic and give this a 10/10!",
      "total_reactions": 0,
      "user": "Superficiality"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Hands down the best film I've ever seen! District 9 delivers a knockout! With the creation of a space ship hovering over Africa and a documentary shot sequence, D9 works its way to the top of a new generation of documentaries.",
      "total_reactions": 0,
      "user": "MrHouse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "District 9 is a unique film that explores ideas that have never been ventured in movies before. And it executes it very well, providing a strong film with good themes, good direction, and good acting.",
      "total_reactions": 0,
      "user": "Termin8ter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "One of the most interesting, fun, gritty sci fi films I ever saw. You have to swallow some major plot holes, but the atmosphere and good points let me overlook them and I had a great time with this. One of my favorites. So unique!",
      "total_reactions": 0,
      "user": "siltsunrise"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "It is universally acknowledged (at least by those who don't play with Transformers toys) that the best science fiction stories are those that use the devices of aliens, robots, and space ships to illustrate some greater truth. Star Trek (the TV series in its various incarnations and, to a lesser degree, the movies) understood this, and that's one reason it has become revered in some circles despite frequent lapses into dubious science. District 9, the eye-opening feature debut from South African filmmaker Neill Blomkamp, recognizes this as well and, in order to avoid the possibility of his message being overlooked, he abandons subtlety. Anyone who watches District 9 and doesn't think of Apartheid, Nazis, and Josef Mengele needs to spend some time reading a few history books.",
      "total_reactions": 0,
      "user": "CinemaSins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "District 9, simply put, is a slum. A place nobody particularly wants to be or even wants to exist, but nonetheless is there with millions of aliens inside. This all takes place in South Africa, which is such an interesting choice considering the subject matter. South Africa's past with apartheid lends itself well to this story of discrimination and segregation, because there's always someone on the bottom. Now it's the prawns. What I noticed right away was how negatively these aliens were portrayed. I shouldn't have had any opinion on them because I was only seeing one side of the story, yet I couldn't help myself and was further surprised when my opinion and sympathies changed again. Seeing both sides is vital.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "So strange but true, the beginning was the idea of ​​\" District 9\" , about aliens but that idea was criticized badly , it would be a disaster that would be horrible or what the users talks us a sh*t, but in the end it turned around and we wanted to see a movie of most coveted , interesting and very cool aliens , according to this, \" District 9\" has exceeded expectatives.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "District 9 is powerful, awesome, and heart worthy. You'll enjoy this the same way as I did and indeed you're going to love it. I give District 9 a district 9.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "If you're one of those people who can't enjoy a film with some major plot holes, done watch this film. Otherwise, it's a must see. District 9 is a film that's original at many levels. The CGI is beyond average. The dialogs are decent. The pacing is decent. The satire is successful. The location and choice of actors is unique. etc.",
      "total_reactions": 0,
      "user": "johnslegers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "A bad action movie with huge plot-holes blatantly coated with \"social justice\".",
      "total_reactions": 0,
      "user": "fedo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "It combined an excellent story line, great action, and characters you truly felt for.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2017
      },
      "score": 8,
      "text": "Neill Blomkamp’s District 9 was 1 of the best science fiction I’ve seen in a while. The plot was well crafted, very suspenseful. The set pieces were absolutely stunning and not to mention the action sequence was done nicely also. It had its moments, heart-wrenching moments. Altogether, a very enticing science fiction drama.",
      "total_reactions": 0,
      "user": "amai2739"
    }
  ]
}