{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 38,
  "mc_movie_name": "Dream House",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 197,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "It's painful to watch a movie like Dream House - well-acted, beautifully shot and directed with extraordinary care and attention to craft - only to realize that the story, the alleged backbone, is absurd."
    },
    {
      "critic": "Rob Humanick",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "A modest genre entry, Dream House also benefits from the fact that any movie with good enough sense to cast Elias Koteas is automatically better as a result, even if he is utterly wasted here."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 50,
      "summary": "70 minutes into the 90-minute process, I was engaged. Then it all collapsed."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 42,
      "summary": "The film's ambitions are woefully small and familiar."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 42,
      "summary": "This suburban gothic is a logy, convoluted mess."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "The director is going through the motions, and he doesn't display the cinematic skill, at least in the release version, to bring off an exercise in either Hitchcockian or Shyamalanian suspense."
    },
    {
      "critic": "Robert Koehler",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 40,
      "summary": "Impressive as the combination may seem on paper, having Sheridan direct this sort of genre fare reps a clear miscasting of helmer and subject, as he displays no particular feel for the material and is unable to overcome the story's generic approach, lack of striking psychological ideas, and literal-minded denouement."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "This crackpot thriller from the usually competent Jim Sheridan leaves only one mystery unsolved: what on earth was he thinking?"
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "With its telegraphed twists and clunky pacing, the film would be unbearable were it not for the fine trio of Craig, Weisz and Naomi Watts, all more or less slumming."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Despite the A-list talent involved, this haunted house tale is a thrill-deprived, inert misfire."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "Dream House is the full magilla, with imaginary images, sanity questions, peek-a-boo startles and the usual are-they-real-or-not? characters."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "So much is just so…obvious."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 30,
      "summary": "The story unfolds briskly in the polished mode of a classic horror movie, then tanks after a plot twist at the midpoint alters the mood and slows the pace. Jim Sheridan (My Left Foot, In the Name of the Father) directed an ill-conceived screenplay that could have worked only as camp."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 30,
      "summary": "Dream House also manages to commit a cardinal thriller sin: casting well-known actors in ostensibly inconsequential roles, which in this case reveals the real culprit before the mystery proper has even begun."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2011
      },
      "score": 20,
      "summary": "Dream House is neither haunting (as the marketing appears to promise) nor all that original. But it does, thank goodness for small favors, have Elias Koteas."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "summary": "The real problem is, when the film blindsides us with a mystery we didn't know existed, we're already too busy not caring about mystery we knew was there."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "I loved the movie, caught me since the beginning until the end of the movie. DonÂ´t hear everything people will say. See for yourself and make your own conclusions.",
      "total_reactions": 3,
      "user": "leandrosrds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The fact that this movie tells you everything halfway makes it that much more compelling. It isn't a thriller in the sense of what is going to happen to next but rather it allows you to believe that such a scenario could happen to anyone and they will have no clue. The character is the story.",
      "total_reactions": 3,
      "user": "ElReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "Some of the critics are unduly harsh on this movie.  Its engaging.  There are a few interesting twists.  Its not nearly as creepy as the ads would lead you to believe, but my teenage boys enjoyed it enough that they were still talking about it a week later.  No need to see it in theatre though, fine to watch at home.",
      "total_reactions": 2,
      "user": "Audiowombat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "This movie was interesting, but very predictable. This is not Daniel Craigs type of movies. He just didn't seem right for this film. There were a couple of entertaining moments, but this movie overall was kinda dumb. Very weak story, easily noticeable how the studio just threw this movie together. Entertaining at times, very predictable ending, but overall weak and boring, don't waste your money or time, its not worth it. 3/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "I'm sad to say that this was not a very good movie. The story line was good until the turn of events about half-way through the movie. The \"twist\" was not something that actually made sense (if you took into account the fact that no one at the institution recognized him), but it's something you had to accept. I found that I was often confused with how they chose to tie everything together - that is, with the beginning still being an important part of the story. Wait to rent.",
      "total_reactions": 1,
      "user": "BadezBladez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "The movie had a slow start, but became engaged. For us it was not predictable and definitely a psychological movie.  Reality versus illusion-What looked like reality was only an illusion.",
      "total_reactions": 1,
      "user": "Ochoa1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "I d not understand why people think this is a bad movie. I almost flew out of my chair in excitement. The beginning seemed a bit tiring, I suppose. But the rest of the movie was flawless. The acting as superb and the twists in it were outstanding. I absolutely loved it!",
      "total_reactions": 1,
      "user": "ImWeird4You"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "The film tells the story of an executive of a publishing house, who abandons his job  to spend more time with his with family, moving into the house of his dreams ... he discovers there, after a few events, that five years before, there was a massacre inside the house. The performance of Rachel Weisz and Naomi Watts (especially) are the best of the film: Daniel Craig can give dramatic air in the later parts of the film, but in scenes that he show more emotion as a father (happy ones), the thing is a little awkward. The script is well written in the early suspense  parts of the film, from the middle to the end, especially in the last one is weird, and rushed - the movie would have the potential to be a good movie, if he hadn't \"lost his breath\" and finished so abruptly, out of nowhere (and a brief scene with any connection to the main story appear at the beginning of it, to explain the end). Although I think it  is a unpretentious distraction as a movie, with and a story a bit unusual. My score: 4.0 / 10.0.",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The trailer and poster are not as they seem. The movie looks like a drama and a film is highly recommended to view one Sunday afternoon.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Don't listen to the critics, it may be a bit predictable but I thoroughly enjoyed it. Not t he greatest movie out there, but it gives me hope for good movies in the future. It's a bit similar to a title called \"Shutter Island\", which is a much better movie in my own opinion. Is it great? Not really. Should you watch it? Yes.",
      "total_reactions": 5,
      "user": "MrLonwol"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "The biggest mistake Dream House made was revealing itâ",
      "total_reactions": 2,
      "user": "Sir_Brandon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Very regular movie, boring and slow, however, really enjoyed the plot, it's entertaining, but you will get tired of it in a short time, i recommend it... well... I am not really sure..., 7.",
      "total_reactions": 1,
      "user": "Darkstarshades"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "This movie sucks! I was expecting for something really scary, but is just ta story for baby sleep.",
      "total_reactions": 2,
      "user": "DrostKai"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Not much in the way of redeeming qualities, Dream House is full of obvious plot twists, predictable dialogue, and miscast actors. I expected so much more",
      "total_reactions": 1,
      "user": "natfe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 5,
      "text": "The move is beautifully shot, carefully directed, and has some great actors in its cast. The movie seems to be going well, until about halfway through when everything seems to fall apart. From then on the movie turns into a dark, depressing, dreary psychological glimpse inside the mind of Daniel Craig's character. It becomes very hard to distinguish what is real and what is in his head. If the story hadn't been so arrogant and smug, thinking it was smarter than it was, the plot twist could've been unexpected and thrilling. Instead, the movie implodes into itself.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "The trailer ruined the movie for me, because it gives away the main twist. If you lost interest of watching it, well you should still give it a try, because there's actually even more twists. If I haven't seen the trailer, the story would have been more surprising and likable. So '' Dream House '' is pretty much what you think it is, but not really. It's similar to '' Shutter Island ''. If you have seen many psychological thrillers, then this movie will be predictable for you. There's nothing new about it, so it's not very original. Has a psychological movie fan, i'm a little bit disappointed. There was moments that were mysterious and intriguing.The part that captivated me the most was the end twist. The rest was quite boring and forgettable.The movie does have good points to. The ambiance was creepy (the music, the house, the trees, etc) and the acting was good. '' Dream House '' could have been better, it felt '' incomplete ''. It's an average movie. It's not worth seeing in theaters. You should rent it when it comes out on blu-ray and DVD.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "Despite a promising cast, Dream House falters due to a bland and generic narrative that becomes the film become less interesting than what it could have been.",
      "total_reactions": 0,
      "user": "BrandonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Don't know why this movie is so underrated. the reveal that he's actually an ex-patient at the mental institution had me react in a similar way to Will. I didn't believe it because it was so out of the blue and went against everything i had believed up to that point. I wondered if there was some sort of conspiracy against him. This reveal is pretty early and the rest of the film explores just what a man does when he's found out he's crazy and his happy life is gone.... and he's also homeless now on top. It was interesting to see whether he would accept reality or cling to the delusions.",
      "total_reactions": 0,
      "user": "Axelskull"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "It was a last minute decision to see Dream House.  Although I was impressed by the trailer I was not too inclined to see it , but overall I am glad I did, since it has many worthwhile moments. It is difficult to say too much about the film without spoilers which I will try to avoid.  It is an entertaining if slow film which starts well, blindsides you quite early on and then ends predictably.  The main performances are excellent, and it is also well shot with some nice scenes.  This makes for an engaging and intriguing film in many ways but it is just unfortunate that the story is not strong enough and the whole ends up less than the sum of its parts. A good (if not necessarily original) idea which maybe required a bit more work to make a really good film.",
      "total_reactions": 0,
      "user": "kemlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "It is such a shame that Daniel Craig, Rachel Weisz and Director Jim Sheridan didn't have final say on what the movie was going to look like in theaters. The plot itself is a very intriguing one, and if the trailer had been cut right, it would have been an intense movie with a great twist. Unfortunately viewers got more than a taste of what the movie would be before they stepped foot in the theater because of the spoiler trailer. Instead of the excitement I had in movies like Shutter Island or Identity, I was stuck wondering how this would get resolved or why I would care. Fortunately Craig did a great job and his real life and on screen wife had a great rapport with him that really kept me interested. Sadly it wasn't enough to make up for the terrible \"twist\" you didn't know about beforehand and the dreadful parts of Naomi Watts and the two villains. Definitely a pass.",
      "total_reactions": 0,
      "user": "Dagoblog"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "Despite a promising cast, Dream House falters due to a bland and generic narrative that becomes the film become less interesting than what it could have been.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Haunted houses are believed to have spirits and ghosts haunting them. A dream house refers to a person's home perfectly fitting their needs and desires. When these two terms blend together you should have a flawless screenplay for an awesome Hollywood thriller. Sadly \"Dream House\" is not it. The acting is quite good, particularly the performance from the lead actor Daniel Craig but how the storyline was directed was really awful in that it was hugely predictable. And the ending was particularly dumb. A shame.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "dream house is a very good movie but i did not get why the neighbors ex husband hired someone to kill her when he could of done it himself so the person he hired did not accidentaly go in the wrong house and kill liby and her two daughters. and was not suprised of what it was gonna be about because the trailer gives too much information of how the movie was gonna be about!i rate it a 9",
      "total_reactions": 0,
      "user": "10kaylyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Dream House has moments where it tries to build tension but more often then not fizzles to nothing.  When the twist comes along (half way through) it is a bit of a shock but is fairly uninspiring.  Waiting for the plot to uncurl further and introduce what part the caring neighbor plays also keeps the viewer guessing, unfortunately the movie ends unimaginatively and will disappoint most.",
      "total_reactions": 0,
      "user": "aucklanda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "Han sido muy duros con la pelÃ­cula, en lo que a mi concierne cumplio, me entretuvo mucho mas que otras, Daniel Craig es un exelente actor, y la verdad prefiero este final optimista, me gusto que al final se aclare todo, y no que sea como las peliculas de terror convencionales que dejan misterio, y te dejan con inquietud, sin esperanza, y triste, muy bien por Dream House",
      "total_reactions": 0,
      "user": "Arnaldodr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "No way near as bad as some people would gave you think. The three leads are all very watchable, it's shot lovingly, and there is some interesting ideas ( even if they don't all work out, and it loses its way at the end). Most of the films problems came from studio interference, so much so the director tried to disown the film, and Craig and Weisz refused to promote it.",
      "total_reactions": 0,
      "user": "FloridaDino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Dream House is a hard movie to review  or even describe  without revealing too many twists and turns of the plot. The film stars Daniel Craig (Girl With The Dragon Tattoo) as a writer who settles into a quaint home with his wife (Rachel Weisz) and two daughters, only to learn that their house was the scene of a horrific crime. When strange things start going bump in the night, the husband starts to uncover a connection to the tragic murders  but only the pretty neighbor (Naomi Watts) seems to know what’s going on for sure. Dream House was directed by Jim Sheridan, the man behind such great films as My Left Foot and The Boxer, as well as so-so films like Brothers and Get Rich or Die Trying. Sheridan is a skilled director (even when he’s working with half-baked material) so technically speaking, Dream House is visually sound and richly textured in its disparity between the warm hues and glows of a family home, full of love, and the harsh, blue-tinted, snow-ridden world outside that home  or, at times, the grit and grime of homes that have been overrun with rot and despair. The other strength of the film is its cast. Craig, Weisz and Watts are all skilled actors and keep a lot of the more ridiculous aspects of the story (more on that later) grounded in believable performances. Craig  often stone-faced and grim  displays some warmth and smiles in his role as a loving father, though he gets ample time to stone-face it as well. Weisz is good as a free-spirited wife and mother; she makes her character stand out as a unique and fully-formed person, while Watts is given a harder task, playing a pivotal character that has to be balanced just right to be believable at all. Watts almost pulls of that balancing act, but not quite. Guys like Elias Koteas and Marton Csokas are great character actors  though they’re given little to work with here. This is also a film that changes gears very drastically in its 1st, 2nd, and 3rd acts, and subsequently feels disjointed and episodic, rather than organic and cohesive. There are also a truckload of logical flaws, and plot holes so wide they are nearly impossible not to fall into. On the whole, the poor script reduces Dream House to a movie that is hard to get into  and stay into  despite the talented actors and director working to keep it grounded and engaging. Sometimes an idea just falls flat. There’s no harm in the trying. Certain viewers may watch Dream House and be thrilled by the shifting, uncertain nature of its plot (if they can avoid scrutinizing it and simply brush off the gaping holes). As stated, the film is well-constructed and well-acted, so it’s not a total nightmare. However, like the strangest of dreams, watching this movie will  leave you feeling muddled and somewhat upset about the experience.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "Could have been much more (spoilt by lazy ending). Mid picture plot shift gives leads opportunity to show \"human\" side but any tension ruined by very predictable finish. Is there an alternate ending version out there?",
      "total_reactions": 0,
      "user": "sracsrac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "I expected more but it was still good. The actors were ok. It is predictable but i liked it. However if oyu want to watch it it's not that bad. If you don't watch don't you wont lose a masterpiece",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Dream House is not the film it was advertised as, but beyond the wonky finale, reshoots, and strange editing there is an interesting tale to be told here.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}