{
  "avg_user_score": 6.5,
  "metascore": 24,
  "mixed_rating_frequency": 0,
  "movie_name": "Dumbbells",
  "negative_rating_frequency": 2,
  "positive_rating_frequency": 4,
  "pro_critic_reviews": [
    {
      "critic": "Sherilyn Connelly",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "Dumbbells manages to be pleasant and largely inoffensive despite early indications that it might turn into a T&A-fest.;"
    },
    {
      "critic": "Martin Tsai",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 50,
      "summary": "With verbal jabs and sight gags in equal measure, the script proves serviceably funny. As the film progresses, though, the hilarity does not escalate along with the outrageousness."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "If it was still the 1980s, then Dumbbells might actually be a hit."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 20,
      "summary": "The movie is so incoherent that its screenplay, by Mr. Drolet and Mr. Richards, might as well have been scrawled between takes as it was being filmed."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "summary": "Worst of all: Dumbbells is never as shocking as it so desperately strains to be. What is shocking is the fact that this movie is seeing the light of day in actual theaters  — even during the January dumping-ground time."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "summary": "A few barely conceived scenes allow Carl Reiner, Tom Arnold and Jay Mohr to show up for a quick paycheck. What’s that title again?"
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "I really liked this movie. It surprised me. I expected plenty of gym humor and hot girls (which there are -- Taylor Cole is movie star beautiful) but there's also a ton of hilarious talented comedic performances from the whole cast. Brian Drolet and Hoyt Richards are a great comic duo. The loan manager (who is that guy?) is priceless and Mircea Monroe is perfect as the ex-girlfriend from Hell. I guess you couldn't have a gym comedy without Fabio and he actually reveals some real comic muscles. Who knew? I thought all the cameos were fun. Carl Reiner, Jaleel White and Jay Mohr all scored. Overall, it just a lighthearted romp with tons of classic one-liners. This is one gym I'll be happy to go back to.",
      "total_reactions": 1,
      "user": "PhillyEagle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "To my dear metacritic coleagues I must say you are mistaken. In a world full of hate and negative boring people with any values, the movie spreads a big dose of Humor without any doubt. Creative fun only can be understood by smart people. Dumbbells is full of talented people like Brian Drolet and Hoyt Richards.Congrats to the crew. Maria R Gomez. English Language and Literature Graduate.",
      "total_reactions": 1,
      "user": "SpanishCriticMR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "I don't know what the critics are smoking. This movie is laugh out loud FUNNY. It has a great cast, lots of babes and hilarious cameos. Lighten up film snobs - it called Dumbbells.",
      "total_reactions": 0,
      "user": "Pioneer198"
    }
  ]
}