{
  "avg_user_score": 6.1,
  "metascore": 41,
  "mixed_rating_frequency": 33,
  "movie_name": "Dumb and Dumber",
  "negative_rating_frequency": 103,
  "positive_rating_frequency": 220,
  "pro_critic_reviews": [
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2014
      },
      "score": 60,
      "summary": "The plot, of course, is merely an excuse for an endless series of gags, and the percentage of them that score is fairly high. But since the jokes are based over and over on the fact that Lloyd and Harry are really, really dumb, a certain repetitive factor sets in."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Comedy Gold, there are so many humorous scenes in this movie if you do not laugh then you should see a doctor. The movie is a classic and it is worth your time seeing. Without Jeff Daniels and Jim Carrey this movie would have been a flop big time.",
      "total_reactions": 4,
      "user": "njkk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Usually, I don't pay too much attention to what the critics have to say, but in this instance they are unquestionably wrong, wrong and did I mention... wrong! 'Dumb & Dumber' is a fine movie, but more importantly it is one of the funniest flicks I've personally ever had the pleasure of watching in my entire life. It is simply the KING of the buddy comedy genre, even almost eighteen years after it was originally released in movie theatres. Directed by the Farrelly brothers who excel at comedy and starring Jim Carrey, it's no wonder why this movie is great.",
      "total_reactions": 2,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "It obviously wasn't destined to win an Oscar or anything like that but it's just so funny you can't help but laugh your head off.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "A comedic masterpiece.  Always puts a smile on my face no matter how many times I've watched it or no matter how many years since its original debut.  A timeless classic.",
      "total_reactions": 1,
      "user": "wesker2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "The funniest movie of all time!!! Jim carrey at his best! There is no better comedic duo.. i went to the theater w my dad when i was abt 13 years and it was just rib cracking fun! We laughed so hard we were in tears leaving the movie theater",
      "total_reactions": 1,
      "user": "jpwelsh101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Dumb and dumber is one of the greatests comedies i have ever saw, i dont know why it scored a so low rate in the critics review, it might be a little dumb but it's a great comedy.",
      "total_reactions": 1,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was so hilarious! One of the funniest movies of all time. The storyline was good. The jokes were awesome! Jim Carrey and Jeff Daniels were great in this movie. The dialogue was funny. Dumb and Dumber is one of the best comedies of all time and you should definitely watch it.",
      "total_reactions": 1,
      "user": "Mariofan"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Why does it get a 39 Metascore? This is  hilarious! I'm glad these users are exposing the truth, by getting it a rating of \"universal acclaim\". In your face critics! This movie was hilarious, clever, and stupid. A must see for all Carey fans and anybody else really.",
      "total_reactions": 15,
      "user": "sanddude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "It's kinda BS that this movie is only a \"39\" on this website from the critic views on this movie. It probably seems that critics don't comedy movies at all and they just negative reviews for the fun of it. This movie is funny and one of the best comedy movies off all time and the soundtrack is great too. Jim Carrey and Jeff Daniels make a great comedy duo and I wished that they make a great sequel to this movie.",
      "total_reactions": 3,
      "user": "jAbMaN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "The title of the movie pretty much explains it all. The appeal of this road trip style buddy comedy is watching it's two leads (Daniels and Carrey) act like complete morons. The shear stupidity of their character can lead can lead to some funny moments. However pacing moments a quite a few failed gags bring the movie down.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "This is a really funny movie with great actors but it doesn't hit my type of humor exactly and only because of that i point it not higher then 6 points.",
      "total_reactions": 1,
      "user": "JaySupertramp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Even if you \"like\" this movie you have to admit its stupid. Beyond stupid, it's borderline atrocious. But it's impossible to hate on Carrey and anything that featured his 90's talent.",
      "total_reactions": 1,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Dumb and dumber brings the laughs and the... well... laughs that makes this road trip comedy enjoyable, and by all means live up to It's name, literally.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "yes its stupid and yes its dumb like its title implies but its funny as hell. i laughed my ass off waching this movie. carey and danials do a bang up job as 2 dumb hapless idiots who find themselves on a adventure to return a womens briefcase. the comedy in this little adventure had me rolling on the floor. what i cant understand is ive wached this with some people who where laughing harder then i was to the point they where in tears . then wana stop waching it because they say its to stupid... that just doesnt make sense to me . you are laughing who cares how dumb it is . its doing it job. i see a comedy for only one reason thats to laugh i dont care about any thing els.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Can't believe the poor meta score, this is legendary comedy... so many great lines. People shouldn't take it too seriously, it's meant to be stupid, that's the charm. Love it.",
      "total_reactions": 0,
      "user": "TheJaijo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Classic comedy about two inept losers who somehow bungle their way across the country to return a lost briefcase. The gags are quick and cheap, but you should expect nothing less from the Farrelly brothers, and the acting is spot on. It's still one of my favourite comedy movies after all this time.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "Dumb and Dumber revels in its juvenile and crude behaviour, it's the sort of film I sometimes feel ashamed to call side-splitting and brilliant, not from start to finish but it's various moments where it is utterly impossible not to roll over on tears of laughter for the stupidity you are seeing.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "This is probably the funniest film I have ever seen. Sure, the plot's lame, but whatever! It's a comedy! Come on, critics! A 39! Yes, this film could have been bad if not put in the hands of Carrey and Daniels, but guess what? It was!",
      "total_reactions": 0,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "This movie continues to persist as a quotable, road-trip relatable movie.",
      "total_reactions": 0,
      "user": "Bshop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "It had been more than a few years since I properly sat down and watched this, but looks like I wasn't missing much. It's funny, yes, but just a tad too silly for my likings. While I love Jim Carrey there are much better films of his out there and I can't say I was a fan of his early 90's work, but if you're after a little mindless fun then there's nothing wrong with popping this one on and having a chuckle, but for a quality film perhaps look elsewhere",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "The current critics score is misleading because over the past 20 years they've really warmed up to it.  It's hilarious, gross, endearing, and one of the most memorable comedies of all time.  The reason this (the original) worked so well while the prequel and new sequel didn't is because even though the characters are stupid, it's actually a pretty clever and witty movie.  There's some sort of brilliance here that might be impossible to duplicate.  It's not completely perfect of course, but it's great all the same.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Funniest comedy i've ever seen! Dumb and Dumber is a masterpiece! Harry and Lloyd are going to boost your mod if you choose to watch it wether with friends or alone!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "one of those films that will never age in its comedy, and will without a single doubt, leave you with very achy stomachs after all the laughing. Critics need to stop being so serious all the time, as there's nothing here to criticize except the two characters themselves who are there to be slightly awful, and for the comedy.",
      "total_reactions": 0,
      "user": "Muddsjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A good classic comedy movie. This movie is filled with many good laughs. Seen this movie so many times but still laugh a lot especially at some memorable scenes. This is Jim Carreys best film in my opinion even though he has many good ones. Great chemistry with the 2 main actors and hilarious jokes make for a great movie.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "First one was novel and funny.  This one was way way way bad and the laughable silliness in the first film was replaced with just plain stupid silliness in this mess of a sequel.  Very disappointing --- no way this will be a trilogy, no way.",
      "total_reactions": 0,
      "user": "wadewilliams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "I watched this movie and never laughed once. The plot is bad and stupid. It's not funny at all, I didn't laugh once! Its so bad and I cannot believe I wasted my money buying it.",
      "total_reactions": 0,
      "user": "cwepahguy225"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Throughout the whole running time of the movie, you realize that it is actually entertaining, humorous and giggly although a bit annoying and straight ahead desperately trying to make you laugh, in which it falls flat most of the time.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "absolutely the funniest movie of all time Jim carry and Jeff Daniels are perfect in their roles their isnt one unfunny moment in this comedy.",
      "total_reactions": 0,
      "user": "cumovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "I do not know why, but I thought that the film is more awesome, more funny    .",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "One of the funniest movies I have ever seen. I couldn't stop cracking up. Don't listen to the critics when it comes to a comedy, because a funny movie isn't always about the plot behind it.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "a classic comedy,you see a young jim carrey who just burst on the scene and full of energy as pure usual and you see jeff daniels who takes on the a comical role the chemistry between these two dim-witted friends is out of this world",
      "total_reactions": 0,
      "user": "jamiecusack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "It's a good, funny movie, but sometimes a little too... INSANE. That's not a necessarily a bad thing, but overall, this was only a 7. It wasn't hilarious, just funny.",
      "total_reactions": 0,
      "user": "DudeUnknown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Dumb and dumber is an Hilarious Movie!.jim Carrey and Jeff Daniels did a great job portraying they're assigned roles.This Movie is funny and silly it may have a poor plot but the execution of it it's amazingly done. This Movie is very clever and somewhat stupid.Dumb and Dumber is an example of what comedy movies supposed to be,entertain us and make us laugh and giggle!",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Dumb and Dumber is one of the funniest comedies of the past 20 years being endlessely random and quotable the movie is just fantastic",
      "total_reactions": 0,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Absolutely hilarious. A timeless classic you can watch again and again and still laugh again and again. Jim Carrey is hilarious, as expected, and I gotta give credit to Jeff Daniels, as he is known as a more serious actor who is now most remembered for the scene in this movie when Lloyd (Jim Carrey) sneaks some pills into Harry's (Jeff Daniels) cup of coffee. Hilarity ensues.",
      "total_reactions": 0,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "It's no masterpiece, but Dumb and Dumber is a largely entertaining road comedy elevated by the delightful chemistry between Jim Carrey and Jeff Daniels. Both are in top form as the film's dim-bulb protagonists, and help provide the film with many laughs. Sure, it's little more than a string of gags tied together by a relatively thin plot, but in terms of entertainment, it certainly delivers. If gross-out comedy and \"dumb\" humour isn't your thing, I'd look elsewhere. For those who like Jim Carrey comedies, I'd recommend you check it out.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "This movie is great sure it is very immature but it is very good and entertaining wail doing so.The jokes are also great. Like the flashing headlights joke.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "A fun, yet dumb, movie for dumb people. You'll pretty much pull out the laughs throughout the movie. Even if not, it's still worth it giving it an 8 instead.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Dumb and Dumber is by far the funniest movie I've ever seen! This is Jim Carrey and Jeff Daniels at their comedic finest! I don't know how they were able to pull of some of the best scenes and make them as funny as they did without coming off as cheesy. A must see for all comedy lovers!",
      "total_reactions": 0,
      "user": "toddwilkerson"
    }
  ]
}