{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 31,
  "mc_movie_name": "Duplicity",
  "mc_negative_rating_frequency": 40,
  "mc_positive_rating_frequency": 43,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "Smart, fast-moving and reasonably entertaining commercial espionage movie which kicks off with an excellent slo-mo fight between Paul Giamatti and Tom Wilkinson. The latter is always a pleasure to watch, unlike Julia Roberts, who is only marginally sympathetic here as a bossy ex-CIA agent turned freelance spy. There's very little chemistry between her and Clive Owen and she looks, weirdly, more like a meerkat than a woman in some scenes. Clive Owen inhabits his role like a favourite shirt and his performance and that of most of the other players keeps things ticking along, which handily redeems a movie that might otherwise have been scuppered by Roberts' peculiarly humourless style.",
      "total_reactions": 0,
      "user": "CharlotteP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "How is this film so misunderstood? It's brilliant.",
      "total_reactions": 0,
      "user": "Dominic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Tony Gilroy is one of the most gifted under-the-radar directors of the naughties. Duplicity is both smart and intriguing. While it doesn't quite reach the peak of 2007's Michael Clayton, Julia Roberts and Clive Owen are fab.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "A stylish, yet flawed, romantic crime comedy, Duplicity is a mixed bag. With compelling twists and a great look at corporate espionage, this film from director Tony Gilroy is bogged down by a nonlinear narrative and a lackluster romance. As a result, the plot becomes hard to follow when the film jumps from the past to the present to the past constantly and, towards the end, stops helping you figure out where each scene is taking place. Even worse, these flashbacks are always dry, humorless, and chemistry-less when they put together former MI6 agent Ray Koval (Clive Owen) and former CIA agent Claire Stenwick (Julia Roberts). Lovers who work for competing companies, the film details the efforts of both sides to outwit the other and beat them in the marketplace. Of course, that is when the couple are not having sex in an exotic location.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "Film de vague espionnage industriel à la petite semaine qui n'en fait même pas une petite comédie regardable, ni au second degré ni au quinzième. Julie Robert a une tronche de cadavre et on ne comprend toujours pas comment le sémillant Clive Owen et le rigolard Paul Giamatti ont pu se laisser embarquer dans une merde pareille. Comme si ça ne suffisait pas, c'est long comme un jour sans pain, les minutes durent des heures et les heures des siècles. Bref, on en revient toujours pas de ce remplissage abrutissant. Consternant !",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}