{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 36,
  "mc_movie_name": "Eat Pray Love",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "Although the beginning temporarily had me questioning why this plot had made for such a best selling book, the movie picked up speed during Julia Roberts conversation with her friend about not liking where she was in life. I enjoyed her travels, but found them slightly disconnected. The ending was cute, screaming the typical Hollywood farewell of a movie. Eat Pray Love, if it did nothing else, left me with quite an appetite.",
      "total_reactions": 1,
      "user": "cinephile"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "Disjointed and hard to get into. You don't get a chance to know/like Liz before the drama starts, so it's hard to care as much about her journey as you should.",
      "total_reactions": 1,
      "user": "CorneliaL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is a slap in the face to everyone who is if only slightly interested in the spiritual content of life. It's embarrassingly shallow even for a romantic flick. The main character is boring, her story and morals are flat. By the time the movie was over I was completely annoyed.",
      "total_reactions": 1,
      "user": "czyorker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "The movie has a lovely, honest performance from Julia Roberts, but except that \"Eat Pray Love\" has nothing new or nothing bad to offer; its just bland.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "I hate the book, I hate the movie..hate hate hate IT!!  Never met anyone so needy & clingy, why did she cry again?? I think it's just a case of 7 years itch...but exaggerated...obviously she has money, not everyone can just take one whole year of holiday around the world..so really can see the meaning of the book n movies...",
      "total_reactions": 6,
      "user": "zaza"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "This movie is way too long and exaggerates too much on unnecessary details and is never clear on what is the message that the movie wants to project. It's not that it doesn't have great ideas, is just not shown as well as it should have been shown. It's a decent ride of a film but it never makes the whole adventure of Liz exciting for us to see or care about.",
      "total_reactions": 3,
      "user": "Sonicphoto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Eat Pray Love neglects to show what really happens to dumb, rich tourists when they venture too far from the mall. Where is the scene when Julia Roberts is chased by a troop of mandrills on her bicycle? Where is the scene when Julia Roberts eats unrefrigerated gado gado, then rests her head in a toilet bowl begging to die? And where is the scene when the sweaty, unshaven Javier Bardem spikes her mineral water with Rohypnol and defrauds her Amex card? Well? Answer me that.",
      "total_reactions": 3,
      "user": "RichardFroard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "The movie felt a bit slow to start but overall I enjoyed it. It was a \"make you think\" kind of movie. Julia Roberts is beauiful as always and the acting was good.",
      "total_reactions": 2,
      "user": "nunubell68"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Had heard about the book, but never read it.  Thought it was a very good movie.  Many people who go see the movie may not enjoy it for the fact they are not or have never been at a point in their lives where it is time to move along to something more.  Julia Roberts was excellent along with the rest of the cast.  Very insightful, beautiful locales.  Left the theater with a smile on my face.  Will be buying the book to get the more detailed version.  Go see it.",
      "total_reactions": 2,
      "user": "mpcbuddha"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "What a piece of freaking crap. Especially compared to Expendables and Scott Pilgrim. The characters are so shallow, the script is bad, and everything else sucks. Skip this movie.",
      "total_reactions": 3,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "A travelogue about a self-absorbed person's uninteresting time-out year.  Julia Roberts fairly glows, as do the settings, but swimming in any pool an inch deep leaves you unsatisfied, no matter how it might sparkle.  She eats glorious spaghetti.  You leave empty.",
      "total_reactions": 4,
      "user": "wordmaster"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I went into this movie with the intention of only getting laid for sitting through what I assumed was going to be a piece of colorful poop. However, this film ended up being the best film I've ever seen! From the very beginning I connected with Julia Roberts and up until the end of the film I didn't take my mind off of any of it. I have seen this movie two times already this weekend, and in this economy that is saying a lot! See it multiple times, you won't regret it!",
      "total_reactions": 8,
      "user": "thebrickknight"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "\"Eat Pray Love\" would be easier to mock if author Elizabeth Gilbert wasn't a National Book Award nominee(for \"The Last American Man\"), and had both her fiction and non-fiction works cited by The New York Times as being \"notable\". So if you're going to be a hater, categorically labeling the memoirist as being narcissistic, the latest offender of the \"me\" lit boom, heed her credentials, because Gilbert's navel-gazing is not your garden variety navel-gazing, like that of a populist hack, or a self-proclaimed, self-help guru flake-turned scribe. Arguably, \"Eat Pray Love\" should be mentioned in the same breath as Stephen Daldry's \"The Hours\", in addition to its obvious genre classification: the \"chick flick\", and sub-genre: a woman goes on a journey of self-discovery(e.g. Audrey Welles' \"Under the Tuscan Sun\"). Make no mistake about it. Elizabeth Gilbert is a literary writer, albeit not of the same caliber as Virginia Woolf, she is literary within the context of her times; her books belonging to a lesser canon, but a canon of sorts, nevertheless. As played by Julia Roberts, the Pen/Hemingway Award finalist(for her 1997 short story collection \"Pilgrims\") has an ironical spirit about her, when you compare the real-life Gilbert with Ruth Thomas, the sedentary island heroine from the writer's warring lobster fishermen saga \"Stern Men\". The fictional Ruth, in spite of being exposed to boarding school, was content to eat shellfish, and someday marry a man who caught them. Thanks to \"Eat Pray Love\", the reader can't help but psychoanalyze Gilbert through her prior texts. At the time of the 2001 novel's publication, it's only natural to speculate that the then-married writer was trying to justify the institution of marriage, the pros of settling down, since Ruth chooses the island over the world(well, if you consider Maine, the world); or maybe, more accurately, Gilbert was simply revisiting her seventeen-year-old self, back when the younger lass believed in home and family. Both a journalist and a novelist, Gilbert, amidst the other Indians during the film adaptation's strongest chapter, \"Pray\", wears her reporter's hat while lending her ear to a local girl, bemoaning the fast-approaching date of her arranged marriage to a boy she's never met. True to form, objectivist form, Gilbert doesn't share her contemporaneous prejudices against matrimonial unions with the beseeching young woman, a terrified bride-to-be who probably wanted an enlightened opinion, a western opinion, but instead gets a disappointingly stock one. Concerning nuptials, Gilbert, a feminist, as demonstrated through her counter-traditional actions, in effect, lies to the girl, which presents an existential dichotomy of the highest order. On one hand, Gilbert doesn't want to come across like some ugly American, who disregards the sanctity of Hindu law, but still, as the girl's friend and mentor, speaking woman to woman, independent of the cultural divide that separates the east from the west, the older woman owes it to the young girl to consider rebellion. Although Gilbert proves time and time again to be a wonderful human being(\"Eat\" is a lot of fun; Italy, a land of enchantment), she does, in this instance, come across as a hypocrite, but this flaw only makes her more interesting, since all artists live in their own moral universes, with its contradictions and blissful ignorance.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Eat,Prey,and Love looked great,but GOD that is so stupid! The movie wasn't too good and I couldn't focus on Roberts playing as a lady who is heading the world with three combining things that she needed  to do. The exotic locations are pretty good to see,but notihing interesting to see because the the story was so dull and it takes 2 hours to see the entire film with uninteresting things and it's just  partiuclar vacation photos and of course the novel wasn't based on the movie.Nothing interesting with the characters and it has a little plot points and I don't quite understand that the lady was thinking her life without nothing special with her ex-husband or her boyfriend and has no charm to their relationship. The only I like is Javier Bardem,he'e the only cool guy and he could make it intresting with Roberts at the middle. But please,they call the Bardem,Felipe and my name is Felipe too! Well Bardem & Roberts wasn't so bad in their role. Roberts I'm sorry and I luv ya,but your movie is too much dullness and too many plot points that wouldn't explain anything in the novel.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This is one of Julia Roberts' best movies. It's the perfect movie for for relief from stress and anxiety. I'm definitely glad I saw it and everyone else should too.",
      "total_reactions": 2,
      "user": "LeoTs3181983"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "Julia Roberts finds herself - and we rediscover her considerable talents - in a rare movie-is-better-than-the-book travel adventure, Eat Pray Love. Screenplay by director Ryan Murphy and Jennifer Salt redeems the navel-gazing memoir by Elizabeth Gilbert. Revealing an inner adventure that drags at first, the film soon falls into natural rhythm as a world traveler faces her inner demons and searches for love.",
      "total_reactions": 3,
      "user": "SecretAgentGal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 1,
      "text": "This is not a true story.  Liz Gilbert the Caucasian spokesperson who pretends to be the writer had nothing to do with it.  The real Liz Gilbert is black and went to ISRAEL (which was removed from the final draft) the final work is a work of fiction far from what actually happened.",
      "total_reactions": 1,
      "user": "pumbaz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Me esperaba más pero visualmente su espiritualidad es visualmente poética. Además Julia Roberts está guapísima. En Italia se muestra muy bien la comida, pero se olvidan de ella en la India y en Bali. Destacable como siempre Javier Bardem.",
      "total_reactions": 1,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "Julia Roberts once seemed to have the Midas touch, but here she appears a miscast. The movie is longer than needs to be and I did not feel the true enlightenment of this spoiled, self-centered, city-girl though her journey. Bardem remains one of my favourite actors.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "To obtain balance you must be in a state of equilibrium or equipoise. Liz is consistently searching for it and eventually does find it; pity â",
      "total_reactions": 0,
      "user": "Duke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "For a woman who has been divorced, going to three countries on the other side of the planet seems more like a temporary escape persay. Julia Roberts plays Liz, who sets out on a year or so to visit three countries, which as the movie title suggests, to eat, pray, and love. From watching the film in it's entirety, you can conclude that she likes the eating part best (Loads of Pasta). And for prayer, she visits India. The movie almost seems to run on in India, and more toned down. \"Love\" has had to be the hardest part for Liz to experience in Bali mainly due to soon realizing that maybe this entire getaway has been just trying to forget about love, and experiencing, or at least forcing her self to choose a more spiritual down to earth way of life. By the end, has she really found happiness? The story is told blankly, and I couldn't exactly connect with the movie because of that. It slowly becomes an expose' of Liz's adventures, with the warmth and sweetness not fully executed.",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "I had to watch this movie because my girlfriend forced me to watch it with her. This is not a movie for a guy, unless if your gay. In short, this movie is Sex and the City without the sex part. And itâ",
      "total_reactions": 0,
      "user": "JonnyTheGreat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Julia Robertâ",
      "total_reactions": 0,
      "user": "Katrina"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Tiresome plot made worse by Julia Roberts traditionally minimal acting. Roberts has always gotten by with smiles and wistful looks and not much else.It doesn't appear that's going to get her by anymore More of the same here with the cameras panning to Roberts who always has that phony looking serene smile.",
      "total_reactions": 0,
      "user": "alpha444"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "If you like to travel, I think you probably will love thiz movie. It is a real life experience of Elizabeth M. Gilbert who is in self-discovery by travelling to Italy, India and Bali (no one mentions Indonesia?!) in 2006. Eat at Italy, pray at India and finds love at paradise island Bali. Her book EAT, PRAY, LOVE was on New York Times Best Seller list for 110 weeks. The movie directed by Ryan Murphy who is the Creator of NIP/TUCK, POPULAR and musical phenomenal GLEE. His famous directing credit is RUNNING WITH SCISSORS in 2006. Julia Roberts did her typical Rom-Com Queen role for thousand of time. Three lovers around her Liz character are played by fine Actors such as: Javier Bardem, Billy Crudup, and Spider-Man best friend, James Franco. Bardem brings a relaxing and warm aura into his character. Another brief and believable performance comes from Richard Jenkins as a devastated man in India. There are some surprising performances by Indonesian Actors like: The toothless medicine man, Ketut (played by Hadi Subiyanto), Nyomo (I Gusti Ayu Puspawati), the little Tutti (Anakia Lapae) and senior Actress, Christine Hakim. Subiyanto portrays a memorable and key character, although with limited English. In the half hour at the beginning of thiz chick flick, the plot is kind of boring and flat, but after that we find plenty of funny moments and the story-telling goes better. At the end, I came to the conclusion that Liz Gilbert character was kind of confused and too much worried about herself, she left everything she had for irrational reasons. Thiz movie has been telling us, Each city and person has one word to describe it. Well, my word is: selfishness. One thing is for sure, the real exoticsm of Bali is more beautiful than it appears. I wont tell you, you have to visit Bali and check it out yourself.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "The movie explores the possibilities of what to do if the American Dream does not satisfy you. It definitely does show some alternative lifestyles to a stereotyped American way of life. However, even though it makes you want to go to Italy and eat some delicious Pizza, \"Love Eat Pray\" is lacking cinematic magic that would make you love the movie.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "While it may be visually pleasing, that's not enough to save this search for enlightenment. Creative changes should've been taken to make this adaptation more absorbing.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "so boring and the worst movie i have ever seen in my entire life. really horrible. hate the movie hate everything about it. the plot is bland, the script is bad, the acting was bad, the whole movie was tasteless and boring. i only saw half of it cuz i was so bored to death. dont ever watch this movie cuz its a waste of your time and a waste of your life. AVOID FOREVER!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "epicness"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "This isn't a chick flick, it is about self-discovery, even though that Roberts (which is an odd casting chose) who looks nothing the real Elizabeth Gilbert, Roberts performance is incandescent and does a great job as the character. Co-writer director Ryan Murphy (Running With Scissors) makes this film adaptation artsy and bright also makes the food look like ecstasy, Murphy and his screenwriter Jennifer Salt (Tempo) make this spiritual, relaxed. Writer Elizabeth Gilbert (played Julia Roberts) has reached a life crisis, without her husband Steven (Billy Grudup) realizing it they arrived in different and diverging places in their lives, Liz wants out of their marriage. While Liz and Steven are going their divorce papers, she meets an actor David Piccolo (James Franco) who meet while he's performing a stage play. After meeting him, her biggest problem she realizes is herself, earlier when a Balinese medicine man Ketut (Hadi Subiyanto who is amazing) gave her foretellings. So she maps out her journey. So Liz goes on an adventure to self-discovery first it's Italy where she she learns how to love food again the way she use to love it, then India to learn how to meditate and get some spiritual peace in her life, she meets Richard (Richard Jenkins) they start a friendship. The last part in her self discovery journey is Bolly, where she meets again Ketut to thank him, also give more insights in her life. As she was planning her geographic plan, she meets Felipe (Javier Bardem) they run into each other, they are both divorced they have a few things in common. Things don't go quite as planned. She gets lost by the end of her stay. Despite the Hollywood cliche's and the Hollywood film making, at times this feels like a different movie. Only in this movie in the middle, Jenkins gives his best Oscar performance despite his little screen time. The pacing is great at times a little bit rushed, it's predictable but who cares that's what Gilbert made out to make in her novel at times it's original. The character development is socko, Murphy and Salt successfully put character development in Jenkin's character despite his screen time and so does Bardem who is phenomenal. Grade A",
      "total_reactions": 0,
      "user": "lukechristiansc"
    }
  ]
}