{
  "mc_avg_user_score": 7.6,
  "mc_metascore": 78,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Enough Said",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 88,
  "mc_pro_critic_reviews": [
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 100,
      "summary": "The first date that James Gandolfini and Julia Louis-Dreyfus embark on in Enough Said - has to be one of the great getting-to-know-you encounters in movie history."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 100,
      "summary": "Feisty, funny, fizzy and deeply wise, Enough Said sparkles within and without, just like the rare gem that it is."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 100,
      "summary": "You could argue that Gandolfini doesn’t have enough screen time, but what’s there is, as they say, cherce. The scenes in which Albert and Eva get to know each other are delightful miniatures of emotional intimacy, two bruised romantics amazed to find someone still on their wavelength."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 100,
      "summary": "Line for line, scene for scene, it is one of the best-written American film comedies in recent memory and an implicit rebuke to the raunchy, sloppy spectacles of immaturity that have dominated the genre in recent years."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 100,
      "summary": "It's clever, farcical and offers wry social commentary. With its heartfelt performances, intelligent writing and subtle humor, this is easily one of the most perceptive and engaging movies of the year."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 91,
      "summary": "Gandolfini deserves an Oscar for Enough Said not because it's the culmination of everything that came before it but rather because it goes in a completely different direction. And his least characteristic achievement is also one of his best."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2013
      },
      "score": 91,
      "summary": "It shows us how rare love is — and how we need to grab it and not let it go."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "I can't say enough about the way Enough Said keeps its scintillating sense of humor as it grows deeper and more affecting."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "You may or may not be surprised by developments here, but it doesn’t really matter. What does is the honesty of the characters and the absolute delight it is to spend time with them."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "One of the pleasures of Enough Said is watching Louis-Dreyfus and Gandolfini, two well-known performers only Holofcener would think of putting together, come alive both as individuals and the two halves of a relationship."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "Louis-Dreyfus and Gandolfini are lovely together, though her character is the sharper-edged of the two. It's Gandolfini's Albert, soft-hearted and soft-bellied, who suffers more. Gandolfini takes the movie's small, offhand jokes and intensifies them."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 88,
      "summary": "Gandolfini is effortlessly, quietly great."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 88,
      "summary": "If only more romantic comedies played out as charmingly and perceptively as this one."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 88,
      "summary": "It sounds like rom-com hell. And it would be if Gandolfini and Louis-Dreyfus weren't such an appealing pair of misfits. It's a pleasure just to watch them spar."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 83,
      "summary": "The result is one of the most honest recent comedies about romances that flourish, marriages that totter and the difficulties of raising children with the right blend of respect, discipline and support."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 83,
      "summary": "There seems to be less acting going on and more being, which not only makes this an enormously affecting penultimate performance (Gandolfini’s final film, “Animal Rescue,” will be released next year), but reinforces the brilliance of the darker work for which he will no doubt remain best known."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 83,
      "summary": "The role of Albert in Nicole Holofcener's Enough Said is closer to who the man was, and who the actor seldom got the chance to play: bearish yet soft-spoken, a self-confessed slob with a soul bigger than his gut. There's warmth pouring from those slitted eyes, loosening up guarded smiles as Albert takes a chance on love again."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 83,
      "summary": "Enough Said is another tremendously well crafted, intelligent dramedy about people, with complicated lives, who make bad decisions trying to do the right thing."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "Nicole Holofcener has a reputation for making Woody Allen-ish chick-flicks. Which sounds like a snidey compliment. Enough Said is her best yet."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "A wonderful movie, observant and hilarious and full of sad and beautiful truths."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "This is one of the last Gandolfini performances, and it’s the ultimate proof that he could change his look and sound and rhythm without losing the source of his power: the connection to that inner baby ever starved for love and nourishment."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "A wry and moving look at a time in life that tends to get short shrift in U.S. cinema."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "On first viewing, I conclude that Enough Said is irresistible, and demands a second (and third) viewing right away."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "While most film romances feel like a fait accompli, Enough Said’s tentative fumblings toward bliss require, and merit, fighting for; its wanderings are never less than pleasant and its final moments pack surprising emotional power."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "This is Holofcener’s sweet spot, the depiction of the emotional confusions, self-deceptions, uncertainties and misguided decisions that can cloud and get the better of otherwise bright, aware people, especially the female characters she tends to specialize in."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "The film also drags a bit toward the end, but neither of these is a major flaw in a movie with more funny lines than in most of Allen’s movies these days — not to mention a saner, clearer moral perspective."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Enough Said confirms filmmaker Nicole Holofcener’s status as one of America’s best stealth satirists."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Despite the movie's limitations, it's very satisfying to watch Louis-Dreyfus and Gandolfini enjoy each other's company on screen, as characters, because it's satisfying to watch them enjoy each other's company as performers."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "The director was smart enough to take a trait that often caused an actor to be be typecast as a menacing figure and turn it into a strength."
    },
    {
      "critic": "Ella Taylor",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "If the sum of Enough Said is less than its parts — and really, the midlife challenges here are pretty small potatoes — the movie does have some lovely grace notes that add up to an astute observation of the symbiosis of single mothers and their daughters."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Sharp as the dialogue is, it’s hard to imagine any of this working as well without the late, great Gandolfini."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Apparently at Holofcener’s urging, Dreyfus just tends to overwhelm the movie with her regular, if charming, bag of tricks, as if that’s enough. And it isn’t."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "Although Enough Said never really surmounts its TV sitcom style and structure, the director provides a nuanced entertainment that is enjoyable. She is aided beyond measure by the charisma of her two stars — especially Mr. Gandolfini, who reveals a side of himself we’ve never seen before."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "Enough Said may be her cleanest, most polished and broadly funny effort to date; its emotional generosity is undeniable, but so is its tendency to smooth over some of the hard, brittle edges that have been the more interesting hallmarks of Holofcener’s work."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 63,
      "summary": "The film's dramatic underpinning and the way it addresses impending empty nest syndrome are solid but the comedy varies from mildly amusing to achingly awful."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Assured, adult filmmaking from a writer/director who knows her way around the ups and downs of relationships."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Enough Said isn't without the occasional minor formulaic element or the odd narrative contrivance here and there (starting, it must be said, with its very setup). It is, after all, a romantic comedy."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Enough Said doesn’t have the intimacy of Holofcener’s “Walking and Talking” or “Lovely & Amazing,” but it still cuts close the bone. Often so close we have to smile in self-defense."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "While there are some okay side stories (stuff with the daughters and daughters’ friends) it kinda feels like attending a dinner party and checking in on the first world problems of a friend you kinda like, but don’t like enough to ask any follow up questions."
    },
    {
      "critic": "Paul MacInnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "All in all a comedy that starts out like a pudding made of first world problems ends up warming your heart and that is in no small part down to the strength of its two leads. As a final act, it's a touching one."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "Neither does it help that, despite the wit and literacy of Enough Sad, its form is straight out of a teen romance: A cool kid starts dating someone less cool, and then engages in some elaborate deception that, if found out, will threaten the progress of young love. The funny thing is, if Enough Said were converted wholesale into a high school romance, the characters' behavior might ring more true."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 50,
      "summary": "Gandolfini delivers a funny, poignant performance befitting a great actor. It’s heartbreaking that the film doesn’t measure up to his exemplary turn."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2013
      },
      "score": 38,
      "summary": "Enough can't be said about how the late James Gandolfini comes so close to saving writer-director Nicole Holofcener's latest articulation of white suburban anxieties."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Julia Louis-Dreyfus is REALLY good in this movie. She dials back the extreme version of herself that she trots out for Veep (which I also enjoy) and shows a vulnerable side which is touching.  Gandolfini is solid and serves his purpose, but it's not his movie. Keener also goes through the motions here and does her standard nice work. I want to call out Ben Falcone, who is hilarious in this film, and the greenlighters need to put him in a starring role.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 1,
      "text": "I must be totally out of sync with what this film is purported to be...although I am almost the exact demographic target for it. I look for movies about people and where nothing explodes.",
      "total_reactions": 3,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "“Enough Said” stars James Gandolfini, Julia Louis-Dreyfus, Catherine Keener and Toni Collette in this beautifully written and directed story of two middle aged divorced people who attempt to pursue a relationship during what is admittedly a difficult time in each of their respective lives. Television stars who transition to the big screen typically have difficulty shedding the image their small screen roles have imposed upon them and the longer the series runs, the more of a problem it becomes. Jason Alexander will always be “George” in spite of his many efforts to leave that image behind. So, it is an awesome experience to watch Mr..Gandolfini, and Ms. Louis-Dreyfus successfully depart from their “Tony Soprano” and “Elaine” personas and portray totally different characters. Much of this success belongs to Ms. Nicole Hofofcener who wrote and directed this delightful film. There is the expected humor but, more than that, the film delves deeply into the mid-life crises each of the characters faces and the sensitivity of the writing is equal to the humor it evokes; a delicate balance indeed. The viewing experience is, of course, bitter sweet as one remembers the sad fact that Mr. Gandolfini is no longer with us and that this versatile and gifted actor left us much too soon with a body of work yet to be completed. I give this film an 8 and recommend it to all who enjoy a quality film.",
      "total_reactions": 0,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "Julia L-D deserves a lot of credit here. She's one of those sitcom stars who seemed to get slicker, sleeker, sexier every year (see also: Courtney Cox, Jennifer Aniston, et al.). But here she lets herself appear older, worried, not made up -- still adorable, for sure, but so much more real. The film is heavy on coincidence and wryness -- EVERYone is coming through the wry, continually -- but in a Nancy Meyers-type way that strikes touching notes about relationships, divorce, kids leaving the nest. Moms will shed tears. And James Gandofini seals the deal with a performance of real warmth.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Nicole Holofcener has built a career in films, exploring the relationships of certain microcosms of individuals, where at the center, there's always a heroine who is seemingly displaced or out of contact with the reality that surrounds her. In this case, Eva is the heroine, who is charming and funny, but who hides her heart and feelings behind that sharp wit and humor. Albert is very much like her: a man who suffered through a divorce, and is trying to live his life quietly, hanging on to his only daughter and who embraces this relationship with joy and a possibility of finding happiness. The film allows the actors to flush out these characters, and is filled with humor and a genuine sense of wonder and tenderness between two people who are emotionally bruised. The cast is uniformly fantastic: Julia Louis-Dreyfus, James Gandolfini, Catherine Keener, Toni Collette and Ben Falcone. It's a surprise seeing Gandolfini playing a part that is so grounded and where he's so vulnerable and ultimately real.",
      "total_reactions": 0,
      "user": "canhenha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Julia Louis-Dreyfus plays a single mom, who ends up in a relationship with James Gandolfini. She's her typical neurotic and he plays nice. Things get complicated when her new friend (Catherine Keener) turns out to be his ex. There's nothing especially original about this story, except that it's told from a middle-aged perspective. The characters are interesting and performances enjoyable, but there's not much comedy…just a bit of mild humor. Overall, it feels like a minor Woody Allen flick (although written/directed by Nicole Holofcener).",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "I have to confess: romantic comedies are not my type. But there was so much hype about it that I decided to give it a try. I was quite satisfied with all the characters. Except one, the main one: Eva. Not exactly sure what I did not like about her, whether it was the script or directing (both by Nicole Holofcener) or maybe the casting did not quite match with her. As a famous Russian theatrical director once said, \"I do not believe it!\". And then that awful  scene where all three main characters got together, Eva, Marianne and Albert. I nearly left the theater, it was *that* awkward. But enough negativity, overall the movie was quite watchable and sometimes enjoyable. Maybe I should just avoid rom-coms...",
      "total_reactions": 0,
      "user": "netflic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "I'm biased towards the greatness of Julia Louis-Dreyfus--but it's hard to deny the unexpected genius brought forth from Nicole Holofcener. Holofcener's has had decent and iffy films for many years now, it's good to know she's found her mark.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "With likable actors playing equally likable characters it makes for a nice movie. It has an easygoing pace that never really takes off, but it doesn't really hinder the film.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Teddy bear Albert (James Gandolfini) and a lady with a sense of humor Eva (Julia Louis-Dreyfus) are in their 50s and both bring a lot of ‘baggage’ to their relationship when they meet. It is their softness and funniness that make “Enough Said” a film full of laughs and tears. The fact that this is one of Gandolfini’s last performances adds an unintended sadness but doesn’t take away from the fun both leads are having with each other.",
      "total_reactions": 0,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Contrived Hollywood story falls flat on its  face about 2  3 of the way through the movie followed by 20 or 30 minutes of nothing and a completely implausible ending pasted on at the very end.  The casting is awful, the ex's are all intolerable and the dialogue is frequently bad.  This movie will be remembered only as Gandolfini's last role in about 15 seconds.",
      "total_reactions": 0,
      "user": "TheDavo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Julia Louis-Dreyfus and James Gandolflini are excellent in this movie.  Ben Falcone is great too. The movie is touching, comical and romantic. I loved it. Both main characters are gentle souls and really seem made for each other; their on-screen chemistry is amazing.",
      "total_reactions": 0,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "A well written and engagingly funny film in which a very good performance from Julia Louis-Dreyfus sees her dating James Gandolfini at the same time as unknowingly befriending his ex-wife. The screenplay brings out the bitter and the sweet and is recognisably true in capturing those small and  awkward moments moments that really do happen in real life. Supporting characters add to the fun and the whole thing is a delight.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "From the director who always portray women's perspective of stories. Sadly, it was one of the final movie of  James Gandolfini. He just came and go in his movie that I did not noticed him till 'Welcome to the Riley'. I praised his performance in that flick and again he was so great in this movie, I totally impressed. This movie is about the divorced parents and their second chance to commit in a relationship. Very nicely and realistically told story which had plenty of humor.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "It’s at this fine-grained observation of human folly that Holofcener excels, without ever abandoning her compassion for her wayward, fumbling characters. A subplot about Eva’s best friend’s inability to fire her housekeeper gestures, a bit too obliquely, at social satire (Holofcener’s last two films, Friends With Money and Please Give, dealt more explicitly with matters of class and social mobility). But I appreciate that this movie doesn’t make us choose between context-based character humor and snappy romantic banter—instead, it provides both in great bounty. Elaine Benes and Tony Soprano may seem an unlikely pairing, but Louis-Dreyfus and Gandolfini make strangely persuasive bedfellows—in fact, they’re one of the most impossible-not-to-root-for on-screen couples in recent memory. Gandolfini, by all accounts, was a gentle, modest, and sensitive man who felt emotionally depleted by the violent, dark roles he was generally called on to play in the wake of The Sopranos. Here, we get a glimpse of the second career he could have had as a light comedic heartthrob. That it won’t ever come to be is only one of countless reasons to wish Gandolfini were still around.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "This is a charming film with great performances by James Gandolfini and Julia Louis-Dreyfus.  The chemistry between the two is what most romantic comedies wish they could have.  A",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Look, I'm not a fan of rom-com's, but this for sure is the best one I've ever seen. Overall, James Gandolfini, you will be missed. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "This movie made my laugh, cry, and remember that life is short. Mr. Gandolfini will be missed.",
      "total_reactions": 0,
      "user": "greygoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "I likeGandolfini and he's fine in this chick flick. Louis-Dreyfus comes across as Elaine from Seinfeld and the dialogue could be right out of a Seinfeld episode. The girls will probably like it ok but guys will probably prefer something with a bit more action. Riddick for example. :~)",
      "total_reactions": 0,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "“Charming” is one word I would use to describe this film… “Realistic” is probably another.  One of the last two films James Gandolfini made, “Enough Said” really proved to be a terrific and unique romantic comedy.  The film isn’t silly but rather humorous and heartwarming thanks to a great story, great performances and characters that felt real and authentic.  Overall, the film is just an endearing and delightful film that is very down-to-earth.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Enough Said focuses mostly on the day-to-day struggles of Eva, a message therapist, and as the film plays out it attempts to highlight the beauty of the unlikely formation of serious romantic relationships and their fragility. Eva and Albert, two divorced, middle-aged cynics with children from past marriages meet at a party, go on a few dates, and eventually end up forming a serious romantic relationship.",
      "total_reactions": 0,
      "user": "theseparator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Its cynicism towards relationships and its realism to how women truly are makes me admire the film. Gandolfini is poignant, and he will truly be missed, though I loved him more in 'The Sopranos'. Louis-Dreyfus is quite an annoying and clueless klutz in the dating realm, and her British friend and Keener are complete c**ts. I felt more sympathetic to Gandolfini than Louis-Dreyfus. Every time she blundered in the film, that's where I laughed.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Enough Said features great performances from Gandolfini and Louis-Dreyfus and boasts a compelling premise a notch above the usual \"divorcees find love\" story, but my biggest problem with the movie is the ending. It is ludicrous to think she would end up in that situation when the story gave her plenty of opportunities to confess to Gandolfini what happened and keep their relationship intact, but the movie doesn't let her do that. Also, the bad marriage between Eva's friends mixed with her over-parenting with her daughter's friend are weak plot points. Other than this, the movie is worth watching.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It’s been three years since Nicole Holofcener last released a film, and it’s been fifteen years since Julia Louis-Dreyfus appeared on screen. The latter’s previous appearance was in a Woody Allen‘s Deconstructing Harry, so it’s quite fitting that her return would be in a film by the former. Though Holofcener’s career is much younger than Allen’s (and not nearly as prolific) her work feels right at home next to the typical Allen film. Instead of intricate plots, both directors prefer more open-ended explorations of the privileged middle and upper classes, and the various hijinks in which they dabble. And even though Enough Said’s style and structure occasionally feel like that of a network sitcom, it is ultimately a highly enjoyable comedy, albeit one that operates at a broader level than Holofcener’s previous work.",
      "total_reactions": 0,
      "user": "FilmmakingRe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 10,
      "text": "LTIH keeps me coming back, for sure.  I enjoy all the characters and story lines  and each episode is better than the last.  This is an interesting set of characters, and well acted, even though they may find themselves in rather contrived situations, such as a car theft and ensuing chase by elderly drivers, or locked in a creepy mansion.   The one-on-one conversations are superb.  I can't wait for the next episode and season.",
      "total_reactions": 0,
      "user": "annshaffer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 3,
      "text": "This was barely even a movie!  Turning a camera on a random couple for 90 minutes would produce more interesting banter.  Marginal screenwriting at best.",
      "total_reactions": 0,
      "user": "avantgardner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "The sole redeeming character is that of Gandolfini.  The women hate men.  JL Dreyfuss engages in emotional betrayal and abuse of a person who only is nice to her.  Movie has meaningless subplots, like how to fire a housekeeper that borders on racist; who cares about the man who lives on a walk up  why is it triumphant to have JLD ask for the man's help finally (a man portrayed as thoughtless, even though he is obviously paying for a service).  The only nice relationship is between JLD and her daughter's friend.",
      "total_reactions": 0,
      "user": "msm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "This story really rang true with me. It felt really authentic, about people who are human and have quirks and don't always make the best decisions, but who ultimately just want to be loved. And I, in turn, loved this movie. It had great heart, was thoughtfully done, and portrays candid emotions that we all go through in love and loss. I loved Julia Louis-Dreyfus and adored James Gandolfini in it. It also was a very funny movie, I laughed out loud several times. It was actually that funny. Rave reviews, highly recommend it.",
      "total_reactions": 0,
      "user": "zettacritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "\" a delight \". So far its just romantic , funny and amusing it just is. thank you director/writer Nicole Holofcener.  Grade A+......................................................",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "this film worth less than 7, but I gave it seven because of the output . I realy realy surprised because I did not expect it will be like this . the weaknesses are I did not like the movies that have one star show in The majority of movie scenes. I feel bored because I watch same face maybe one hour or more . the second thing is this movie shows me there is no distance between The Chinese space station and the International Space Station !",
      "total_reactions": 0,
      "user": "Abrar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "This movie falls under the widely insufferable romantic comedy genre, yet it is so much more than that (otherwise this review simply would not exist). This film is a touching and wonderfully composed love story of a newly found middle-aged couple. Of course, there are various complications, but they are largely unforeseen. The writing is intelligent and the humour is pleasantly subtle and entertaining. Likewise, the social commentary is thoroughly engaging whilst being highly perceptive; this film almost becomes fascinating to watch.",
      "total_reactions": 0,
      "user": "charliebury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "Shocking and very Sad was the death of James Gandolfini about a year ago.",
      "total_reactions": 0,
      "user": "clayscottbrown"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "\"Enough Said\" 10 Scale Rating: 6.5 (Good) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "\"You all knew James Gandolfini the actor. I was lucky enough to know Jim the man for 10 years as his close colleague and his pretend life partner, and for many more years as his friend. And it’s Jim the man, the very dear man, that I will miss most of all.\" - Edie Falco at the Emmy's for James tribute.",
      "total_reactions": 0,
      "user": "MattBrady99"
    }
  ]
}