{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 38,
  "mc_mixed_rating_frequency": 47,
  "mc_movie_name": "Entourage",
  "mc_negative_rating_frequency": 49,
  "mc_positive_rating_frequency": 56,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "The party scenes are entertaining fantasy, but the insider-business end of the picture is occasionally interesting in its own right."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Entourage, the show and the movie, is about five insanely lucky knuckleheads who have each other’s backs in a town that’s more likely to stab you there."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 67,
      "summary": "Ye shall know Entourage by its acronyms: A lot of carelessly amusing R&R;, copious T&A;, a fair amount of BS and a consistently low-to-medium IQ."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 67,
      "summary": "The way an Entourage story works is that they establish what it is that Vinnie and his friends want, they challenge them a little bit, and then they get what they want. And while that's something I find unsatisfying, it is the exact reason that fans watch the show and it's why they'll watch the film."
    },
    {
      "critic": "Liz Shannon Miller",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 67,
      "summary": "The film's primary delights are found in either fleeting moments of comedy or Jeremy Piven continuing to crush the role he was born to play -- pure raging id coupled with enough human decency to make him... perhaps not likable, but watchable, for sure."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "I'm OK with Entourage onscreen because it's really a victory lap for a cast that once earned our DVR-ready affection. To echo Perry Farrell: \"Yeah! Oh, yeah!\" As for the haters? Hug it out, bitches."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 63,
      "summary": "On that vicarious-pleasure level, the movie version delivers. Yet for anyone with a sense of irony or social justice, it’s also frustratingly soft around the edges, with no real sense of the drugs-and-violence underside of show business or the spiritual cost of failure."
    },
    {
      "critic": "James Dyer",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Neither a Medellin-style disaster nor an Aquaman-sized hit, this pays decent fan service but an Ari-centric spinoff might have been the smarter move."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "The film plays out mostly like an occasionally above-average episode of the show."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Entourage plays like a solid, if slightly too long, episode. But even given the bloat, the cast’s easy camaraderie and a “play it as it lays” atmosphere wins you over."
    },
    {
      "critic": "Benjamin Lee",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Entourage is like an enthusiastic puppy, slightly tipsy on beer, humping on a stripper’s leg, but desperate to please nonetheless. It is a film designed to be liked – which makes it hard to hate."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "The big-screen version of Entourage is constructed like the series, another chapter in a sequel-ready story. If you wanted something more, you won't get it. But you will get this, and if it does well, likely more of it."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 60,
      "summary": "Sometimes funny, often dumb, with equal doses of inside-baseball references and broad bro-ish boorishness, Entourage will be loved by fans and despised by detractors, possibly for the same reasons."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 58,
      "summary": "It's like watching a high-school football star trying to squeeze into his old uniform after a decade: funny at times, but kind of embarrassing."
    },
    {
      "critic": "Kate Erbland",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 58,
      "summary": "The whole thing is overstuffed with enough narrative threads that it should require a feature film-sized outing to answer them all, but Entouragemerrily skips over whole chunks of vital narrative in order to give it a glossy Hollywood ending, the kind that would seem forced, well, even in the movies."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "This slick doodle of a movie is nothing so much as an advertisement for itself."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "If nothing else, Entourage (the movie) can be considered a faithful follow-up to Entourage (the TV program). That's good news for anyone who enjoyed the series up to the end and not-so-good news for those who lost interest along the way or never were interested in the first place."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "The Entourage formula feels warmed-over, played-out, spent."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Let sleeping bros lie."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Entourage the movie operates like Vince's pals, making itself feel important solely through who's famous nearby."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Piven's performance basically made the series, and to the degree the new film works, which is a little, he makes that too."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Entourage is the uninvited dinner guest who then insists on sticking around long after the party’s over."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "There’s gratuitous nudity, lots of partying, zippy camera moves, plenty of product placement and did we mention all those celebrity cameos? It all feels more like a rerun than a fully formed, stand-alone movie."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 50,
      "summary": "Amid the not-so-troubling setbacks, unbelievable triumphs and perpetual spring break, the movie takes one or two nice twists."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "For better or worse, the film plays like an extended TV episode, jumping from each character’s story arc to the next, rarely lingering longer than the time it takes to land a few low-bro love jabs before moving on to the next scene."
    },
    {
      "critic": "Lara Zarum",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "It may be not much more than a heavily branded romp through a Hollywood fantasyland, but it’s got a pulse. It’s easy fun. No one ever died from reading People magazine."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "Piven’s Ari is so over-the-top in his narcissism and megalomania that he’s fun to watch, but the other lead characters are the kind of bros who should be having drinks thrown in their faces on a regular basis."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 38,
      "summary": "Without Piven and Dillon to keep it entertaining, it would be absolutely dreadful."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 30,
      "summary": "Did this overstuffed quality of Entourage, its KFC Double Down too-much-is-not-enough-ness, ultimately work on me? Absolutely not."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 30,
      "summary": "That the bonds of friendship between Vince and his pals are predicated so strongly on excluding others feels regressive and drags the movie away from harmless high jinks into something needlessly more spiteful and ugly."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 30,
      "summary": "The movie offers more of the same, only more: more T&A;, more conspicuous consumption, more cameos, more Jeremy Piven yelling, and significantly more Mark Cuban than anyone outside the city of Dallas needs to see."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 25,
      "summary": "The film is stuck in the inconsequential rut of the series. The characters are static, and the comedy is situational rather than dramatic."
    },
    {
      "critic": "John Semley",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 25,
      "summary": "Even the emotional foundations of the Entourage franchise, those oaths of fealty, family and friendship, have rotted, hollowed out by the characters’ tendencies toward flippant sexism, homophobia and straight obnoxiousness."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 25,
      "summary": "If ever there was a movie equivalent of dad bod, Entourage is it."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 25,
      "summary": "Though Entourage is set just months after the events of the HBO finale, its actors are (noticeably) several years older, and there’s something kind of sad, even desperate about seeing these characters behave like the same horny frat boys they basically were at the start of the series."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 20,
      "summary": "You could accuse it of glamorizing the shallow hedonism it depicts, but that charge would only stick if the movie had any genuine flair, romance or imagination."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 20,
      "summary": "Entourage can’t muster enough conflict for a podcast, let alone a feature."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 20,
      "summary": "Trying to wring laughs from the nauseating sex-and-stardom exploits of fictional Tinseltown A-lister Vincent Chase (Adrian Grenier) and his buddies, Entourage consistently comes across as sour, shallow and misogynistic."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2015
      },
      "score": 12,
      "summary": "Piven is so in the pocket as the smarmy, aggressive, inappropriate Ari that, when the movie he’s in does little more than double down on the bro-ing out, the whiffed opportunities become all the more obvious."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "summary": "Charm has curdled into smarm in the big-screen version of Entourage. The jaunty style of a hit TV series has been replaced by huge spasms of false energy and a sense of barely concealed flop sweat."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "It's like two decent episodes of the series squished together with a couple mediocre episodes. If this had aired as a miniseries on HBO it would have been great. As a movie it lacks cohesion.",
      "total_reactions": 2,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "I think the critics panned this movie a little too hard.  It wasn't a great movie, but it offered fans of the show some great moments as well as plenty of cookies.  I will say I wouldn't mind the sequel(if there is one) being directed by someone that can take it in a new direction as this was mostly fanfare.  it's not as bad as critics are making it out to be though.  It's a very functional movie with some funny scenes.",
      "total_reactions": 2,
      "user": "sayyes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Entourage the movie is a bit of a celebration for the 8 amazing seasons that ran on HBO.  It won't stand as strong on its own given that audiences will have roughly 10-15 minutes to get to know these characters that we fans of the TV show had years to invest into.  Translation: it's better to see the series before you see the show.  There are numerous inside jokes and tons of celebs that are in this movie for a reason.  Like high school reunion, it's crazy and awesome to see all of these people throwing down in one viewing.  What is most unfortunate is that Entourage ran on incredible scripting and strong characters  that worked through intense Hollywood-life problems that spanned numerous episodes.  Throwing what usually took 4-8 episodes to discover and resolve is meant to be shoved into a movie that's well under 2 hours.  Jeremy Piven as Ari Gold remains one of my favorite characters EVER, and even he gets gated at times.  Piven's ability to rage all over the screen is one of the cornerstones of the show and only gets partially displayed in this movie.  There are a few side stories that begin in this movie that never really pan out either, making me wonder why its makers didn't spend a little more time hashing out the details.  Either way, I enjoyed the movie and finally watched it after going through the TV series for a second time.  It moderately taps into the events of the series finale and I enjoyed that about it.  But anyone coming in off the street is going to be at a disadvantage from minute one, so hopefully you can dig the humor and the fun being had on-screen enough to not care too much about how this crew wound up where they are.",
      "total_reactions": 1,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "This film works mainly because of Jeremy Piven and all the great celebrity cameos. Bottom line is if you like the series you'll probably like this movie.  B",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "This pains me. It really does. Entourage remains one of my favorite shows of all-time. But this movie (one I've been dying for) just was an immense letdown. It is just stuffed with pointless subplots that have no true resolution, and are blatantly obvious that they were forced into the film to get it to an acceptable movie runtime.",
      "total_reactions": 7,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "For all you critics who attacked this movie, you are as useless as rehab on Charlie Sheen. This is a FUN summer movie and if you loved the show, you'll probably love this movie. You critics ALWAYS praise the most goddamn boring films like The English Patient (that film SUCKED) and other films that the average person would rather commit suicide than sit though. A 38 Metacritic score on Entourage in an injustice - this was a great film!",
      "total_reactions": 3,
      "user": "Peacelovebeers"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Entourage The Movie is really funny, believe me. But, I think we could have made do with a comeback season on HBO. Boy, didn't you miss Ari, Drama, Vince and Turtle? I did! This movie is pure fan service to the fans of the TV show. If you didn't like the TV show, you won't like the movie, it's that simple. But I DID like the TV Show, but ended up enjoying a half baked, but still watchable movie. The fan base is huge, and by their standards Entourage is already a hit, but there are flaws that are clearly visible in this hype-a-thon, that make it watchable. Okay, there are a LOT of cameos, Liam Neeson shows up, Ronda Rousey, Mark Wahlberg and many more stars, but the highlight of this movie is Jeremy Piven's Ari. Man, does Piven's totally KILL it, his comedy is sub par, and is filled with classic references to the TV Show. Turtle, Drama and Vince are the usual show of guys, and didn't age or change much. Not that I have noticed. But even in this mediocre film, there is a lot of fun to be had. I will watch it again for Piven and the comedy, but it will erase from my mind after a while. Watch it, if you loved the TV Show. Otherwise, find something else this week.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "If you loved the show, you will love the movie. Critics miss the point of the movie - its all about loyalty. That's what gives the movie meaning beyond all the cameos and eye candy and makes it great.",
      "total_reactions": 16,
      "user": "NathanBates"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Entourage lives up the the standard of the TV show. The movie feels a bit short as there is a lot going on with side stories but there is nothing lost on the film.",
      "total_reactions": 6,
      "user": "Greg3Gem"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Not nearly as bad as many critics would have you believe.  Like several have said - if you enjoyed the series, you'll like the movie.  If you loathed it, you should obviously look elsewhere.  One observation to make:  Rhonda Rousey can act!  This is her 4th or 5th film, I believe, and she's getting better with each.",
      "total_reactions": 4,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "What hurts ENTOURAGE the most is the marketing. All the big funny parts were shown in the trailers, and that kind of disappointed me because whenever a huge gag came along I'd had already seen it. However, despite this ENTOURAGE is still a very fun time at the movies with solid writing, great cinematography, and actors who are obviously having a blast with their roles. It's an entertaining film that feels like it was made for the Summer.",
      "total_reactions": 2,
      "user": "NFW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "For starters, I have never seen the Entourage show and I'm sure that if you haven't watched the show you can still enjoy the film. The characters have a great chemistry and although there aren't any points where I laughed out loud there were several things that were quite funny in the movie. I'm sure that previous fans will enjoy this movie because its almost like watching four episodes back to back. Jeremy Piven stood out to me as being one of the funniest people in the movie and Haley Joel Osment is pretty good at playing the annoying little brat villain. Really what makes this movie great is all the cameos. It seems like everyone in Hollywood is in this movie and you are bound to find someone you like. After watching the film I'm certainly interested in the show.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "i have never seen the entourage show before watching the film but i have to say it has made me want to go see the show now the film has some very funny moments along with characters that are very likable and entertaining to watch really don't understand why this movie is getting trashed i enjoyed it alot.",
      "total_reactions": 2,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "It feels like the gang is back, which is the most important thing in the end. The question is whether or not it's a good movie, because it's all over the place especially for people who've never seen the show. A few storylines could have been rid off, a few could have been delved in more. But most of the movie is the good old superficial Vinnie Chase entourage, and as always it's a fun ride.",
      "total_reactions": 2,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "This film is unfunny but an entertaining movie that fans will surely enjoy.",
      "total_reactions": 2,
      "user": "sexyanne"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "This is basically celebrities masturbating on the audience.  Everyone is cool and everyone name drops and real cameos are shameless.  This is like eating the most colorful piece of cardboard and then told how cool that piece of cardboard is and you should say thank you to the ensemble cast for allowing you in on it.",
      "total_reactions": 9,
      "user": "Cattledog"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Do not pay attention to the \"critics\", this movie was awesome if you are a fan of the show and the last season didn't satisfy you the move certainly will. A Lot of great laughs,great cameos,great screen time for all characters  and awesome sendoff at the end.",
      "total_reactions": 6,
      "user": "gab19"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "I have never watched the TV show that this is based on, and if this is anything to go by I'm really glad i missed it. A non stop stream of misogynistic, hedonistic and homophobic clap trap spouted by a cast of characters as unlikeable as you are likely to find in any film, this supposedly holds a mirror up to modern hollywood, but instead of seeing its flaws and changing it embraces its awfulness and expects us to like the characters for doing it. Unapollogetically awful!",
      "total_reactions": 3,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 2,
      "text": "Entourage is a shameful film of chopped up worthless scenes thrown together. Millions of cameos that offer nothing, characters that are vile and a film that goes nowhere. The one funny thing about the film is that its about making a good film that ends up winning at award shows. I guess the joke is on itself.",
      "total_reactions": 3,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "I liked the show, but the film was a major letdown. The characters were captured well, for at least the first 20 minutes. None of the main characters were dynamic (except for Turtle's weight) and it was filled with pointless cameos that add nothing special to the film. Ari was funny, but the film's comedy was purely meh, awkwardly switching between (attempted) emotional moments and comedic moments. The acting was just not that good in the first place. The stars don't have enough experience in the industry to be in a major film like this. Whether you are a fan of the Entourage show or not, I suggest saving your money.",
      "total_reactions": 3,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 3,
      "text": "The fact that \"Entourage\" is so unfunny and boring is not even its biggest problem. What it boils down to is: who wants to watch almost 2 hours of rich **** doing nothing but complain?",
      "total_reactions": 3,
      "user": "mmweiss"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "This was a true disappointment, do not waste your money on this movie! The concept has been done and was a lot better than this. Wasn't funny, the chemistry between the actors was awkward and cringe worthy.",
      "total_reactions": 3,
      "user": "Coeaxe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "This is the worst **** movie i have seen in my life, i cant believe you would have the nerve to make something like this. If you have a low budget dont bother making ****",
      "total_reactions": 3,
      "user": "GeorgeDouv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Sure some of the performances were lackluster, and perhaps the story wasn't that engaging. As a fan of the show, for me it's just nice to see these characters come back to life in some way. I enjoyed most of the movie, and found it funny at times. It's too bad the movie performed so bad that Entourage may never be taken seriously again, but I admire the balls shown to make it in the first place.",
      "total_reactions": 3,
      "user": "vgmkyle"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Never watched the show, and I don't have to, I will say there are few moments that entertained me, but this is either fan service or exploitive hollywood crap. This is not a movie, it's a stupid idea about characters you never care about. Jeremy Piven gave this movie it's life, but wasn't likeable either. The idea of delving into superficial characters is interesting, but making it modern and apart of reality as if it depicts the industry in some form is difficult to achieve. It reminded me of wolf of wall street but made by a pedestrian filmmaker. Tarantino said it best \"it's like television in public\" and because it is not cinematic and I could've watched this for free on netlfix and had the same experience, it's an easy 0/10.",
      "total_reactions": 12,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I'm still a huge Entourage fan, even though I haven't checked out the movie just yet. After the series ended 4 years ago, is Entourage the next great TV-themed movie since Sex And The City? Kinda. The casts looks great on fashion and I thought it was a risqué move letting audiences to pay their hard earn moolah to see Entourage. But if the show is pretty awesome, then why In the hell did these movie critics have no shame whatsoever? Bashing the Entourage movie? Are you freakin' kidding me? The cameos were pretty great, Mark Wahlberg was in it as well. Haley Joel Osment, everyone is amazing. If you haven't seen it, go see Entourage.",
      "total_reactions": 4,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "You can't go to this movie with high expectations. It's more of an easy ride, don't think too much, just drink in the eye candy, relax and have fun. I thought it was a great addition to the Entourage name, like one longer episode. Ari is gold!",
      "total_reactions": 4,
      "user": "cadover"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Don't pay any attention to the would be critics, if you were a fan of the show chances are pretty good you'll like the movie! From the opening scene where we see a speed boat meet up with Vince's yacht, both the set up and visuals are classic Entourage but on a much larger scale. That many beautiful woman in one movie too, you'd have to be blind not to appreciate it! There were really only a couple of criticisms I had, mainly being the false ending, along with a few sub plots that don't pay off like you think they would, but hey...but that's  very true to the show & concept itself. Overall though I really enjoyed it, glad they picked  up the story again for a minute, it was a great series!",
      "total_reactions": 4,
      "user": "RBulger1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Having seen every episode of the HBO series, I was ready for a bigger, more decadent version on the big screen. As it turns out, it's pretty much more of the same…only less. Movie star Vincent Chase (Adrian Grenier) decides to direct his first movie, while the titular trio has new developments of their own and still hot-headed Ari Gold (Jeremy Piven) is now a studio head. Identifying the multitude of cameos (from Warren Buffet to Liam Neeson to Richmond's own Russell Wilson) becomes the movie's most fun entertainment. Toss in some lavish locales, scantily-clad babes and the most gorgeous Cadillac ever. There's about a TV episode's worth of jaunty dialogue, which leaves another hour with uninteresting relationships and mediocre subplots. Fans of the show will enjoy the nostalgia, but anyone expecting anything new or fresh will be let down. NOTE: Stay after the initial credits for Lloyd's big gay wedding.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "As a fan of the show I really enjoyed the movie. I thought it was a much better way to go out if this is the last of Entourage than what we were given in a rushed season 8. Sure it could have been better. The story was dumb, really just excuse to get the boys back together. 8 out of 10 as a fan for me. Loved seeing them all having fun and ARI back to his antics. Its never been about the story in a sense, its the world Doug Ellin created and Mark Walberg lived that most fans like to vacation to from their normal real lives. Vinnie Chase and the Chasers!",
      "total_reactions": 1,
      "user": "cbolt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "The sad thing is I really liked the TV show, at least in the earlier seasons. It seemed to just be going through the motions the last couple years, but I still found it easy enough to watch. But this movie takes that indifference to a whole new level. I was perfectly ready to enjoy it with no great expectations, but I was blown away by how little effort they put into the script. Not only was the storyline dull and ridiculous, but it was like they had written it years earlier and couldn't be bothered to make the relevant changes based on things that happened in the series. They just kind of erased everything from the final season and started from scratch, including repeating the same tired old E and Sloane dilemma nearly word for word yet again. All in all, shocking bad, especially considering the actors were fine (with the major exception of Rhonda Rousey), as they obviously all know their characters inside and out.",
      "total_reactions": 1,
      "user": "dinojay2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "I watched the entire series, and in retrospect I'm not sure why. I was drawn to the lifestyle voyeurism to begin with, but it essentially boils down to being a male version of afternoon soaps.",
      "total_reactions": 2,
      "user": "farqussus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "Bill Hicks said it first and it bears repeating",
      "total_reactions": 1,
      "user": "Introduce"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Entourage is a very fun movie based on the TV Series that I never watched but apparently I didn't need to watch the show to enjoy this movie because there's a lot to like here.",
      "total_reactions": 2,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Great movie. The ebb and flow of the narrative wasn't as smooth as the amazing HBO series but it was still fun and hilarious to watch. You have to had watched the series to enjoy it, as so many things from the series was in the movie but fans of the show will love it. The chemistry between everyone was still there, and Kevin Dillon and Jeremy Piven was great in their roles. A must see",
      "total_reactions": 1,
      "user": "mmasilungan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "Entourage is like 3 episodes mashed together, but instead of making it funny and amazing like the TV show, Entourage is a boring and blatant attempt of the hit show.",
      "total_reactions": 1,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "If you loved the show, definitely you should watch a movie. For other people, watch show before movie. It's a one great episode which takes 90 minutes or one great season shortened to 90 minutes.",
      "total_reactions": 3,
      "user": "Termez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "A movie only designed for fans to enjoy. The numerous amount of cameos disturbs me while watching this movie. Maybe just make parts of this movie as episodes for the show. It would turn out to be much better that way.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Entourage promises you with a 'glamorous' take on Hollywood...I watch the TV series from time to time and I found it enjoyable to some extent. But as a movie? It feels self indulgent and unrelatable. The fact of the matter is Entourage's appeal has run its course. ..It's a film that nobody wants to see.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "It was nice to see the gang back together. Used to luv the TV series until the last 2 or so seasons. ANd, well the movie picks up from there. Of course, there is the nudity, sex and oh-so-brief cameos on this movie (as expected). But the rushed, unfocused plot is trash. The story doesn't develop but rather told-which is not nessessary cuz' its pedictable Really not many laughs. I am sure, after this debacle, the gang won't be back together on the screen any time soon. Fans can re-watch the first few seasons and remember what was great about this show.",
      "total_reactions": 0,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Inside the Hollywood, from the young generation perspective.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "I was a hostage to the TV show. A hostage with Stockholm syndrome. Which is why I liked this movie.",
      "total_reactions": 0,
      "user": "McWhirtz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Meh, pretty average. I mean, I did watch Entourage tv show and found it quite ok. Not a big fan, but I still liked it. But here, I don't see why they needed a movie. It just felt like a longer Entourage tv episode. Ok, they did get lots of cameos from celebrities. But the actual story felt like either an episode from Entourage tv show or like many episodes put together. I mean, it didn't feel like it needed to be a movie and I don't know why they needed a movie. Still, I guess it was ok and if you were a fan of tv series you'll enjoy it.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "“Entourage” written and directed by Doug Ellin is a continuation of the popular HBO show of the same name that came to an end in 2011. It is a wholly unnecessary film that in its opening minutes completely undoes much of what the show closed on in its final episodes. Truth be told it is best seen in its original format, television. This is because the movie felt like nothing more than a glorified episode of the show just with more cameos. And I mean a lot of cameos. After a while you start thinking of the people who do not show up instead of the ones that do and some of the cameos are brutally short and pointless except to say, “oh hey look who it is,” before they are whisked off the screen. This is not to say the movie is horrible. Being a fan of the show I found many moments in the film to be just as entertaining and humorous as they were before with Vinnie, E, Drama, Turtle, and Ari going through the motions. For those wondering, the ‘R’ rating does get you plenty of shameless T&A; from the most gorgeous women they could cattle call for the film. You also get a healthy dose of ‘Ari-isms’ from Jeremy Piven. So if you are a die-hard fan of the show go see it. If you never watched the show you won't have a clue who anyone is or why they are important. In the end I think this world would have been best served leaving the boys alone in 2011 to ride off into the sunset. Instead we get a mildly entertaining film that you will likely enjoy in nine months on HBO from your couch.",
      "total_reactions": 0,
      "user": "ValcanKrull"
    }
  ]
}