{
  "mc_avg_user_score": 5.1,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Erased",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mark Zhuravsy",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 67,
      "summary": "Erased starts out strong...but for the rest of the running time, we are watching Ben catch up with us, and that makes for uninteresting cinema no matter how kinetic the action."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 60,
      "summary": "Don’t tell Liam Neeson, but someone had the gall to make a violent Euro-thriller about a rampaging American dad without him. And not a bad one either."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "Depending on your age and memory, you’ll recognize cinematic DNA from everything from \"Three Days of the Condor\" to the \"Taken\" and \"Bourne\" franchises in this tale of a father and daughter on the run from an evil conspiracy."
    },
    {
      "critic": "Chuck Wilson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "A thriller whose storytelling ingredients are so familiar that one could watch it with the sound off and still know what's going on."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The film seldom pushes beyond the bare-minimum dictates of the thriller, only rarely offering up a memorable action sequence."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "The result: Characters we genuinely care about are lost in a movie that almost dissipates before our very eyes."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Most people can only watch the same movie so many times. But Philipp Stölzl is clearly hopeful that when you’re done with “Taken” (and “Taken 2”), you’ll want more of the same. Should that be the case, this undistinguished but decent knockoff is ready to satisfy."
    },
    {
      "critic": "Eric Hynes",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Eckhart’s status as the most likable too-handsome man this side of Chris Isaak will endure long after this film is erased from memory — which starts immediately."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "This semi-efficient, Belgian-set timewaster fuses Taken with Unknown, and almost works."
    },
    {
      "critic": "Paul Bradshaw",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2013
      },
      "score": 40,
      "summary": "Eckhart makes a decent Damon stand-in, but there’s nothing here than hasn’t been done (better) before."
    },
    {
      "critic": "Michael Posner",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 38,
      "summary": "Erased, I predict, is a word that will be used to describe what happens to your memory of this cloned facsimile of a movie immediately after watching it."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2013
      },
      "score": 33,
      "summary": "Erased is a snoozy, sputtering Euro chase flick—a sort of poor man’s Liam Neeson revenge movie."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "Erased is eminently forgettable."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "Viewed solely as a string of action sequences, Erased delivers the kind of dryly efficient, wearyingly familiar entertainment that already clogs too many of our movie screens."
    },
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "Eckhart’s another matter. He’s adequate, but there is something about his raspy voice and WASPy body language that’s more in tune with being the bad guy at the board meeting than the hero racing through the train station."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "All we know is that the only sure way to avoid the loss of any more I.Q. points in the world today is to stay away from movies like Erased."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2013
      },
      "score": 20,
      "summary": "The film’s glib disregard for collateral murder runs to farcical extremes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "Erased was a halfway decent movie but it failed to deliver on many accounts. For one, the plot was incredibly weak, and this was a surprise because the premise had so much potential. The concept of an ex-CIA agent turned blue-collar guy trying to make a living but getting duped by a shell company and having to fight for the survival of he and his daughter seemed very interesting. However, the failed execution due to poor writing where the only way the plot either progresses or reaches conflict is through character stupidity is a let down. The acting was solid by the entire cast, though I think Olga Kurylenko was underutilized. The action sequences were pretty legit as well. All in all, it's worth a free watch but if I would've paid money to see it, I would've been pretty disappointed.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "Most people can only watch the same movie so many times. But Philipp Stölzl is clearly hopeful that when you’re done with “Taken” (and “Taken 2”), you’ll want more of the same. Should that be the case, this undistinguished but decent knockoff is ready to satisfy. Aaron Eckhart takes the Liam Neeson role as Ben Logan, a former CIA agent who lives in Brussels with his teenage daughter, Amy (Liana Liberato). He’s been working on some technology patents, but one day he shows up at the office only to find that it no longer exists. Nor, more to the point, do any of his colleagues. (Though mostly inspired by “Taken,” writer Arash Amel borrows freely from a range of thrillers, including “3 Days of the Condor” and various  Bourne adventures. Soon Ben and Amy are on the run, as assassins hired by a shady corporation try to separate them, kidnap her and kill him.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "It's not a bad thriller. Clearly a low budget movie, but Aaron's performance is good and the story movies at a fair clip. i'd recommend it. Special mention has to be made of tLiana Liberato who is very convincing as the daughter. It's much more real than other spy movies.",
      "total_reactions": 0,
      "user": "thrillerfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "Been in something of an action thriller mood lately, but this film had me to the point where I actually groaned at some of the scenes. I'm not sure why they needed to the gimmick of having the daughter be on the rollercoaster with her CIA father, but it ruins what little they may have gained with Aaron Eckhart in the lead role.",
      "total_reactions": 0,
      "user": "Tharis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "The plot sounded like \"Taken 2\" but it was way different.  A former spy type is hired by a big firm to test security products but after two months, the workplace is empty a la \"The Game.\"  Hard to believe.  Then his paychecks disappear from the bank without a trace.  Really hard to believe.  So, what's going on?  There's a side story about a bank robbery and slowly, the two come together.  Other than the holes in the plot line, the story is a pretty good adventure/spy thriller.",
      "total_reactions": 0,
      "user": "smiyamot"
    }
  ]
}