{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 21,
  "mc_movie_name": "Escape from Planet Earth",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 26,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 60,
      "summary": "Feel-good but not cloying, zippy but not frenetic, and refreshingly free of snark, the default setting for a lot of kids' fare these days, the feature takes a pleasingly retro-futuristic stance on matters of décor and attitude."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "A lightweight, warp-speed, brightly colored trifle."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Colorful as the 3-D aliens-among-us comedy is to look at, though, Corddry is handed a role that’s beige as can be, and so are his castmates."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Escape From Planet Earth makes a tolerable diversion for a winter’s day or evening, just not a memorable one."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "It’s unchallenging fun for a younger crowd, but adults might feel like they’re staring down a colorful 24-piece board puzzle, trying to figure out how such a simple activity could be drawn out over 90 minutes."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "The picture has enough entertainment value to tickle its target audience and even offers a few chuckles for accompanying adults.  A strong cast and bright -- if uninspired — animation help to offset a thin story."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 50,
      "summary": "Unlike say, “Doogal” or “Hoodwinked 2,” at least you won’t want to gouge your eyes out after this one."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 40,
      "summary": "The late Douglas Adams summed up Earth as “mostly harmless,” a description that also applies to this eminently tolerable animated time-filler."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 33,
      "summary": "Not recommended for anyone but the hardiest of animation completists, this one is a definite skip. There’s nothing to note, nothing to grasp, nothing in which to find mirth. You could Escape from Planet Earth, but you’re better off just ignoring it."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "Escape From Planet Earth makes a compelling case for our disposable culture to finally get wiped out by malevolent aliens."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "summary": "This movie is a mess: It keeps doubling back on itself – a twisting pretzel of a plot that doesn’t really make sense."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Wow, I don't know why everyone is so hard on this movie.  Saw it opening day, went with another family, 5 kids, we and they all really liked it.  No it's not a Pixar mega movie by any means, but it's still good.  We laughed, the kids laughed, there were some adult orientated jokes as expected, etc etc.  Saying the movie had no depth?  Ok, I guess, it's not DEEP, but it's a kids flick.  Nerdy alien brother, helps save the day over stronger jock brother, and the aliens escape the planet.  Don't listen to the hard A$$es on here, they are out to lunch.  Go see the flick, it's entertaining, and that's what we go to the movies for right?  To be entertained.",
      "total_reactions": 5,
      "user": "Ramrod77"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "An easy-going family cartoon. The storyline had some family values, good for kids, not so much for adults. It was entertaining as far as a cartoon goes. The characters were one dimensional, and everything else was quite straight forward. Good for a family movie night with the kids.",
      "total_reactions": 2,
      "user": "film_bug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "I am posting this because I think critics are a little bit to sever about this one.  This movie deserve a better metascore. If you want to enjoy a good looking fun to watch animation movie. This is one you might like. I give it 7, but a kid might give it 9/10.",
      "total_reactions": 1,
      "user": "lequebcois385"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Groundbreaking animation, unique original world, fleshed out characters with real humanity and depth. This movie has all the hallmarks of a Mainframe studios production...or it would, if this were over a decade ago, before Mainframe became Rainmaker, and eliminated every part aspect of creativity and life within this studio.",
      "total_reactions": 8,
      "user": "phildog"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 2,
      "text": "So conventional to the point that you can almost always get tired with the movie. Its okay for animation, but the movie takes another turn with the same old plot on alien movies that wants you to get out of the theater and re-watch other movies you've already been to, rather than this predictable movie.",
      "total_reactions": 2,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Strictly family-friendly fare with a predictable plot from beginning to end with stereotyped characters. The animation is top-notch and looks great on my 55-in HDTV via BluRay but that's really the only thing that separated it from being a standard plot live-action film. Not sure why they opted for expensive A/B-list voice talent unless that was supposed to draw adults in. If you're over 18 don't waste your time unless you really like animated features on a killer HDTV.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "No Creativity At All... Another Boring Bland Animated Movie....",
      "total_reactions": 3,
      "user": "LanaDelRey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This is a wonderful family movie for the family. My children were glued to the television screen. As an adult I very much enjoyed the movie as well. It had us laughing through the whole movie.",
      "total_reactions": 3,
      "user": "meganahernandez"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 2,
      "text": "The first words that come to my mind when I'm done watching the movie are: unoriginal, and stereotypical. How many times have I heard of aliens? Too many times. They already have done an animated alien movie, which, not my opinion, but in others opinions not very good. Who in there right mind would expect anything better then that success rate? Maybe I don't have much to say about the stereotypical part of the movie, but there are other things that caught my attention, forgettable characters, usually a movie has at least one unforgettable character. For me there was ZERO. Another issue I had was a glitch in the story line (or two, or more), well maybe just one, but it was sure noticeable. The humans up in the booth. What did the main character say about having to come to Earth? It was a hassle to go 14 or 15 light years to get to Earth. From what I've seen, the humans didn't come with them back to their planet. Why would they go out of their way to go and get the two humans if it was such a hassle? Many unanswered questions, 2.4/10",
      "total_reactions": 2,
      "user": "RyanA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Clever, smart, and funny, Escape from Planet Earth is a thrilling animated good time at the movies.  Its not a fabulous movie, but it still is a whole lot of fun with some smart humor, exciting moments, and some feel-good lessons on family, heroism and sibling bonding.  The animation, while paling in comparison to \"Brave\" and \"How To Train Your Dragon\" is still sleek and cartoony.",
      "total_reactions": 1,
      "user": "blakewilson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Escape From Planet Earth is not a bad movie but is by no means a compliment. Yes it does have some laughs and some clever ideas but the problems with this movie prevent them from shing. The story is cliché, most of the jokes are not that funny, the characters are not that interesting, and the majority of the character models aren’t good to look at. This is the film you put on to keep your 5 year old quiet and entertained for an hour and a half. For everyone else you can afford to skip it. There is nothing here worth your while outside of a couple laughs but they are not worth it.  This is a film for babies nothing more if you are in the mood for an animated film there are tons of better ones you can check out.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Escape from planet earth is very interesting. Very sweet for a children's film. I think It was not bad because its been Bredan Freaser's best CGI character. It packs a lot but its a must watch for every animated films lover in every part of the world.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "The Animation Is A Bit Cheesy, The Characters Are Eh, The Story Is OK, the Recommend Audience For this Film is Ages 2-10 Anyone Under 2 Will Forget Because Memory Has not Kicked in At That age, Anyone Over 10 Like The Parents Who Go To See This Movie Might find it Over The Top.",
      "total_reactions": 0,
      "user": "MrEpic012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2014
      },
      "score": 3,
      "text": "It could have been much worse but what director Cal Brunker does is bad enough; craft an unfunny, unequal and weak bore fest. All jokes felt recycled, a plot thinner than paper, a twist so unbelievably predictable and dialogue so unfunny and lame. That being said, it was fairly entertaining.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "The movie, is good for kids...that have no sense of critique or criticism. The animation is great, the jokes are usually funny, but the plot was just thrown together in a huge mess!.",
      "total_reactions": 0,
      "user": "SpeedArt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I don understand why people give this cartoon such a low review number...",
      "total_reactions": 0,
      "user": "feetjai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Before going into this movie, I knew that the movie is not going to be as good as a Pixar animation or a Dreamworks one. However, Escape from Planet Earth is really entertaining, funny and heartfelt at some parts. The movie is not flawless, at some parts the animation feels like a video game animation, at other parts it feels like an ad for 7eleven, the characters are fairly cliched and briefly develop throughout, some unconvincing aspects of the film, and also some boring sequences, but the movie is fun, and that is what you want from such animated movie, for the most part.",
      "total_reactions": 0,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Escape From Planet Earth is a really good family movie.  It's really good for kids and is rated PG.  My favorite part was when he went on a baby rescue mission.  I highly recommend this film!",
      "total_reactions": 0,
      "user": "heidilily"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Escape From Planet Earth is a guilty pleasure of mine. But it would be more than biased to upgrade this movie because I just love it. With all honesty, it is a 7eleven commercial at times. Despite having its moments, it is cliched and very predictable yet it is a guilty pleasure of mine that I can't get enough with.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "It could have been much worse but what director Cal Brunker does is bad enough; craft an unfunny, unequal and weak bore fest. All jokes felt recycled, a plot thinner than paper, a twist so unbelievably predictable and dialogue so unfunny and lame. That being said, it was fairly entertaining.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"Escape From Planet Earth\" 10 Scale Rating: 3.0 (Bad) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "Why? Why should I escape from my own home planet? Unless you don't count... ooohhh, I felt that.... anything bad happening to the Earth, then that's okay. Escape from Planet Earth feels more like Coming to Planet Earth and that's saying something.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "Quickly, escape the horrors of this movie. Escape from planet earth is hard to watch without getting bored. Characters are as flat as the humor. The story is poorly told with nothing much really going on. I would recommend you avoid this mess of a film.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2016
      },
      "score": 4,
      "text": "Ayyyy dios... Bueno, es que.. Ósea, qué?! No tengo mucho que decir de esto, algunos personajes son planos y algo aburridos, no parecen tener mucha personalidad (excepto gary) los alienigenas del área 51 apenas me agradan, no dan risa, pero no irritan mucho... La animación está bien, a pesar de que la película sea de bajo presupuesto, con 40 millones de dólares puedes hacer animación decente. La banda sonora es poco memorable, no llegas a recordar ninguna pista o música en algún momento. También la comedia es estupida, ninguno de los chistes da risa, están mal ejecutados, el único chiste que me dio risa fue en la guerra de comida, cuando unos tipos del área 51 veian la pelea, pero la cámara estaba en blanco y negro, y no tenía audio, y uno de ellos empezó a tocar el piano como si fuera un cortometraje de los 40's. Pero todos los chistes son mierda... La ejecución de la película es bastante rara. Cuando pasa una escena, pasa rápidamente a otra, siendo esta muy apresurada, al hermano de gary lo secuestran a los 20 minutos de haber empezado la película, dando como se puso muy apresurado la película, aparte que cuando pasa una escena, con los mismos u otros personajes en otro escenario, parece como si fuera otra película, o algo así..",
      "total_reactions": 0,
      "user": "Crane2003"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "This really kicks the crap out of Planet 51. It's a mega animated movie, and it's totally epic. It digs deep into the mines and collects diamond and redstone. It is such a treasure to keep.",
      "total_reactions": 0,
      "user": "Tiber5"
    }
  ]
}