{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 65,
  "mc_mixed_rating_frequency": 28,
  "mc_movie_name": "Everything Must Go",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 33,
  "mc_pro_critic_reviews": [
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 90,
      "summary": "Everything Must Go leaves the resolution open, not telegraphing Nick's future. It is as unsettled as life, and the film is all the better for it."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 88,
      "summary": "Everything Must Go is cinematic pointilism. The big picture is familiar -- busted middle-age man, suburban alcoholic despair -- yet the details are so finely rendered that the overall impression is potently strange."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 88,
      "summary": "Ferrell's dryly understated performance is a shorthand for an alcoholic's denial and repressed rage, and as Nick grows increasingly desperate for a drink, he keeps his anger stashed like a last beer for emergencies."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 88,
      "summary": "This is an indie film with big stars - but also an indie films with big ideas about bringing real people to life."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 88,
      "summary": "It's a bleak yet optimistic film, and Ferrell perfectly underplays his Carver anti-hero and delivers a rich, layered and subtle performance. And a funny one."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 83,
      "summary": "If there is a single image that we take away from Arthur Miller's \"Death of a Salesman,\" it is of Willy Loman weighted down to his very soul by his suitcases. The image that holds in this modern-day salesman's serenade is Nick the salesman reduced to selling off his own life."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "Ferrell as Nick Halsey still feels like a fresh idea, a testament to the actor's reliable but rarely tested mettle as much as his long parade of post-2006 buffoons."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "That lawn with its scraps of a ruined life is a setting both satirical and poignant, and Will Ferrell gives a performance of Chekhovian depth."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 80,
      "summary": "It's refreshingly honest, depicts the kinds of American lives not often seen on-screen and shows us a familiar star in a striking new light."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "There are not a lot of laughs in Dan Rush's directorial debut, nor are there intended to be. Rush keeps the tone as light as possible, but no one would mistake this for anything other than a quirky, character-based drama."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "The movie is quietly affecting, as Rush offers a moving and rewarding yarn about the need to move on in the face of personal tragedy, and about the strength of human connections."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "There are too many somber interludes with nothing going on but an acoustic guitar echoing over the soundtrack, the spareness of the score suggesting the emptiness of the characters' lives."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "As he did in \"Stranger Than Fiction,\" Ferrell displays surprising range when he ratchets down the volume."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "At the end, I was expecting more of an emotional payoff; making a movie calm is one thing, and making it matter-of-fact is another. But make a note about Will Ferrell. There is depth there."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "Ferrell delivers a performance of implosive intensity that rings true in every detail."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a very good performance that isn't for the \"Talladega Nights\" crowd and indie audiences can appreciate that."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "The cast Rush has assembled around Ferrell helps as well. There are tiny gems contributed by Laura Dern as the long-lost high school crush Nick looks up, and Stephen Root as a prickly neighbor with some unusual proclivities."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "Unlike its beer-soaked protagonist, Everything Must Go remains dry, serving up its catharsis in wry, moderate doses and making the most of its modest, careful virtues. It is a sober movie, but also sad and satisfying."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 70,
      "summary": "Ferrell fits uncannily well into Carver country, and in this small but sturdy film, he challenges any assumption that he might be limited to comedy. Certainly this is the first time he's moved me to tears that weren't produced by hard laughter."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 67,
      "summary": "Isn't a comedy, but it's not entirely a tragedy, either, and it straddles this razor's edge with a deeply nuanced aplomb."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 67,
      "summary": "Like Bill Murray and Greg Kinnear before him, this funnyman reveals serious acting chops."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 67,
      "summary": "The material, however, takes a Raymond Carver short story and plays it almost too straight. Ferrell looks uncomfortable, but not amusingly so."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "If it sounds wholly bleak, it isn't. Remember, this is a movie about a yard sale. Over the course of the film, Nick struggles with the idea of, as he puts it, \"selling all my crap\" - he means that both literally and metaphorically - and getting on with his life. That sentiment, and Ferrell's refusal to sentimentalize it, is reason enough to smile."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 63,
      "summary": "The results go only so far. Yet already Ferrell has come a long way as a seriocomic screen presence."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "While the film is neither entertaining nor profound, Ferrell makes it watchable at least."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 58,
      "summary": "Whereas Carver writes about alcoholics, this movie is about alcoholism, which is completely different."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "If these developments sound slight and meandering, so is the movie. Everything Must Go has a spacious, under-inhabited feeling."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "It's Rush who makes these characters push one another toward healing, and that feels forced. There are moments of poignancy, but mostly the film feels inert and unremarkable, an off-the-shelf indie-spiration fable that employs a manipulatively cruel twist to move the story away from its inherent darkness and toward an uplifting climactic montage."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "From time to time the movie grabs you (though the music keeps repelling you). Taking stock and letting go-of superfluous things, of worn-out love-is a strong theme. But the progression of the script is like Nick's self-help program. We're familiar with the steps."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "A comparison to Carver's original story - called \"Why Don't You Dance?,\" easily Googleable, and all of 1,600 words long - is instructive."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Writer-director Dan Rush could've approached this material in dozens of ways, but the way he chooses-turning it into an occasionally wry, ever-earnest dramedy-is precisely the wrong one."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "As the phlegmatic, beer-guzzling protagonist, Will Ferrell manages to keep this rolling, though Rush's corny narrative devices (each of the minor characters receives an ironic gift at the end) couldn't be less consistent with Carver's stubborn minimalism."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Everything Must Go is the one for the Gipper-the movie in which he steps out of character for his own sake and works hard to lose Will Ferrell. The results are mixed, but I admire the guy for making an effort."
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "Everything Must Go, which is ostensibly set in Scottsdale, Arizona, has a generic resemblance to broken-heartland movies like \"Up in the Air\" and \"Cedar Rapids,\" although this suburban meltdown is more depressed than either."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2011
      },
      "score": 50,
      "summary": "The film just doesn't mine enough humor or drama from this situation. Meanwhile most of the developments are wholly predictable."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 40,
      "summary": "By the time Nick decides to have an emotionally purgative yard sale-the primary holdover from the short story-all the adult ambiguities have been traded in for facile Indiewood profundities."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Viewing this film is like watching a field of laminated dicks grow.  This has to be one of the most bipolar motion pictures in the history of mankind.  The crapbomb that is \"Everything Must Go\" seems to suffer from a severe identity crises, as it cannot make up its mind whether it is a serious and depressing tale, or a dark comedy.  I give it two thumbs up your ass.",
      "total_reactions": 1,
      "user": "jacktsquire"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Not really a good movie.  And they could have used a different actor.  Everyone is used to Will Farrell playing in comedies but this story is just sad.  When i watched did not know its a drama so i was kind of waiting for something funny to happen and started thinking that just not getting the jokes but reality was: there are no jokes.  Keep to the comedy Will.",
      "total_reactions": 1,
      "user": "Hudlim"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "At a certain point, I realized this movie was not going to get any better, so I stopped watching it. I can still I it wasn't bad, just boring. It's basically based on a drunk man having a yard sale for over a week.",
      "total_reactions": 1,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 1,
      "text": "Agree with Jaded1, slow, boring film that doesn't go anywhere. And Will Ferrell doesn't act at all, he just pretty much plays himself, there's no acting talent exhibited here. It's like the whole film is on 'ludes. Don't waste your time, watching any syndicated show on right now (think Simpsons, Family Guy) gets you better entertainment value.",
      "total_reactions": 2,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "It's by no means an \"easy\" or fun movie, though there are certainly light moments. Will Farrell is awesome, as is Rebecca Hall. The story is dreary, and it stays realistically so to its credit.  I thought it would be a Leaving-Las-Vegas-Light, and it's not that, but it's rough. I'm glad I saw it, but wouldn't necessarily recommend it.  I definitely want to see W.F. in more serious roles in the future.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Comedy is hard.  The hardest, so I hear.  When you are at the top of your game as a comedian, you should be able to act.  So when comedians like Jim Carrey, Adam Sandler and, in this case, Will Ferrell, attempt drama, assuming the script is right, it should work, but it doesn't always turn out that way.  While the script to \"Everything Must Go\" isn't perfect, Will's performance is darn close.  He doesn't, at any point, try to morph into the Will we have come to know in his comedic roles.  The story is sad, depressing and real.  And Will plays the role perfectly.  I feel his sadness, depression, progression through the stages he's moving through as a result of enduring a lot in such a short time.  For a many who can command so much in his film roles, I truly hope he does more low-budget, well-written roles like this.  He's worth it.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Will Farrell does NOT go for laughs in this mild-mannered drama. He plays a guy who gets fired and kicked out of his house on the same day. Since his wife threw his stuff out on the lawn, he takes up residence in his front yard. While the situation is interesting, the energy level stays at a constant, unexciting hum. There are no dramatic peaks or valleys and no humor to provide contrast. For a man whose life has crumbled, this film takes shallow, slow approach to his condition.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Will Ferrell steps out of his shoes and fits in another size perfectly as he isn't seen as the obnoxious one this time around but acts more of a true underdog. A little too mellow of a movie but will somehow tease your interest to keep watching.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Nick Halsey has just been fired from his job of 16 years as vice-president of sales. It wasnâ",
      "total_reactions": 0,
      "user": "MaxTravis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "There's no possibility that this film will be as effective and impactful in ten years or so, it's Everything Must Go's current relevance and immediate dramatic potential in the present economically uncertain world that makes it work so well. The plot structure has been seen many times before, and you can see the plot twists coming a mile off, but almost everything is done exceptionally. Performances are great across the board, with Will Ferrell proving he has the talent for comedy, tragedy and the in-between. Rebecca Hall is good as always, but everyone is put to shame by the young Christopher C.J. Wallace, who has great chemistry with Ferrell, and who is a real talent to watch in the future. Everything Must Go is expertly crafted, funny and engaging, wearing its old-fashionedness as a badge of honour and using it to its maximum potential as an archaic but symbolically effective modern take on a New Deal-era film. The way it promotes A Christmas Carol-worthy redemptive story arc and throws in some strong themes including depression, alcoholism and the evils of capitalism, it feels like a Frank Capra film for the modern era, and for that reason it's a joy to watch.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "We wait he entire time for a pay off by Will Farrells character but it just never happens. The film is a out of focus random drama fest. Sure it is indie but just way to boring. Trust me when I say this is by no means Farrells fault he plays the character well and you root for him the entire time, it's just a shame that by rooting for this character you are just wasting an hour and a half of your life (Just like the drunken loser that he plays) Enjoyable but pointless",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "Wow ... the scores here are way off base for me.  I'm trying to understand what was good about this movie?  Did the critics like it because Will Ferrel is a serious actor (story still sucks and is depressing) or they like depressing crap that goes absolutely no where.  They should call this A Pathetic Drunk Lives On His Lawn.  I can't feel sorry for Will Ferrel's character in this movie as he brings all the problems on himself.  It's not that he is wronged by anyone really.  He's a drunk who loses it all and wallows in self-pity for 2 hours.  I like movies that are either interesting or fun.  This is neither.   I'd rather have gone to work than sit through this waste of time.  Also when the critics say \"Will Ferrell at his best!\"  that is code for he is NOT funny or trying to be.  Like Adam Sandler in Punch Drunk Love ... blah ... don't get me started on that one.  Stay away from this if you like Will Ferrel as a comedy actor.",
      "total_reactions": 0,
      "user": "jaded1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "\"Everything Must Go\" has two things going for it that really make it a worthwhile movie experience. First, Will Ferrell gives the best performance of his career. Here, he doesn't rely on his trademark shouting or his random one liners to captivate us. Instead, he delivers a very low-key nuanced performance that gets us to care about his character's situation. Second, the script by Dan Rush is wonderfully honest. It carries the film along at a nice steady pace and every moment rings true. There's no manipulation here. Rush also does a nice job of keeping this seemingly simple premise interesting. He's able to pull back the layers of Ferrell's character and give us details about his situation at just the right time. Now we've seen elements of Ferrell's character in other movies. Because of this, \"Everything Must Go\" isn't the most engrossing of character studies. But Ferrell plays it so well that you can't help but get involved in his situation. If you're strictly a fan of Ferrell's comedies, avoid this one. But if you're a fan of Ferrell as an actor, you can't miss this. Ferrell proves that he's more than just a comedic actor. He can handle drama just as well and deliver something special.",
      "total_reactions": 0,
      "user": "JollyG87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "This is the definition of an indie movie. Awkward yet still good. Good acting, not a horrible story. Not exactly funny yet not exactly a complete drama. Definitely have to see it yourself to get a good opinion of it.",
      "total_reactions": 0,
      "user": "Machine2music"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Pretty decent movie. Will Ferrell plays the part well. Rather slow, however if you wait until the end and stick with it it is good. not really funny, but the plot is good. It is a rather upbeat movie. Not the greatest in the world but if you have the time watch it.",
      "total_reactions": 0,
      "user": "Chaseyo2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Arguably one of the most underrated films of the year, as Dan Rush's adaptation of the Raymond Carter short story is nothing short of absolute genius.  Meanwhile, Will Ferrell seems to relish the opportunity to flex his acting muscles here, as he delivers a powerful performance.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "This movie was a free bonus for our new TV, so we gave it a try. The story is pretty generic and the twists are expectable, but still some moments are pretty touching. Overall a decent movie for one watch.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Will's more dramatic acting shows in \"Everything Must Go\" and like most of his acting, you can believe it. Just like you can believe this film. A good drama. I might just say, and essence of perfection.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    }
  ]
}