{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "Extract",
  "mc_negative_rating_frequency": 19,
  "mc_positive_rating_frequency": 43,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "I love Mike Judge.. And I love Jason Bateman (AKA The Bater).. What could have gone wrong? Oh, yeah, not enough jokes or deep emotions. SHI I I I I T/",
      "total_reactions": 0,
      "user": "Dillin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 1,
      "text": "Wow did this movie blow. I give it a 1 for effort but I haven't seen something suck this bad in a while. I don't even know WTF the movie was about? All I know was that it was depressing as hell and was a huge waste of my life.",
      "total_reactions": 0,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "It is a live adaption of King of the Hill. I mean that as a compliment. It doesn't have the wild ideas of Idiocracy, which makes me think that Idiocracy wasn't supposed to be hilarious. It just shows what stupid people look like. Most of the things that happen in Extract seem to be pieced together from episodes of King of the Hill. I think it's funny for the things that happen that don't go as planned.",
      "total_reactions": 0,
      "user": "Fortinbras"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Extract is a pretty average comedy which is solid, if unspectacular. None of the jokes particularly stand out, yet very few fall entirely flat on their face. Everything about the film is relatively average, from the plot to the characters. That is not to say that a viewer will find no enjoyment from watching this film. Indeed, it is inoffensive and never becomes tedious. However, there are far better comedies out there.",
      "total_reactions": 0,
      "user": "Cotts1988"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Really funny movie. It's good to see Mike Judge getting work. There are some dead parts which doesn't put this even close to Office Space status.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "An unusual film subject which ultimately ends up working and being quite humorous. Jason Bateman is in top-form in this not-your-average comedy. Not bad!",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "Extract is a pretty straight forward film. Directed by Mike Judge, Extract is a modern day comedy that has some solid jokes along the way, is not memorable in any fashion, and has a very dumb plot. There is certainly comedy in the plot at times, but Extract is the very definition of escapism. It is the furthest thing from a serious film and, though mildly entertaining in the moment, it is already beginning to escape my mind. With each passing word I type, I forget a piece of Extract's plot. That is probably not a great sign as to its staying power.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I really enjoyed this film, it was rather similar to Office Space in terms of style and a little of the story. I thought that Ben Affleck was very good in his supporting role whilst Bateman did his best with the lead. It is definitely worth a watch.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Extract doesn't have a memorable message, a moralizing mission or a satirical axe to grind. But if your life needs a little humorous flavoring, pour away.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}