{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 62,
  "mc_movie_name": "Extremely Loud and Incredibly Close",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 80,
  "mc_pro_critic_reviews": [
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 90,
      "summary": "It's an emotional powerhouse of a film, an unforgettable and rewarding motion picture experience."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "Director Stephen Daldry has fashioned an emotionally powerful cinematic testimony about that horrific late summer day."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 80,
      "summary": "Best of all, von Sydow is absolutely wonderful, with the great veteran actor clearly relishing this very unusual role as he darts, skulks and, in a stealthy way, mugs across town. Without saying a thing, he dominates the middle part of the movie."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "So all the handsome shots that turn the city into a toyland and all the superb editing and vibrant art direction - all the formal tricks Daldry uses to whip you up and work you over - risk being too much. After 45 minutes, it can feel like junk on a sundae. But the movie has a human coup."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 75,
      "summary": "In supporting roles, Bullock and Hanks deliver performances that are low-key and perfectly scaled. Viola Davis and Jeffrey Wright are, likewise, excellent as a couple Oskar meets on his reconnaissance expedition."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 70,
      "summary": "Luckily, Horn is so good -- as is Max von Sydow, in a wordless role -- that the film resonates in spite of the tear-jerking strings Daldry pulls."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "But the question hangs: Does this artificial, three-hankie scenario justify its 9/11 appropriations? Dry your eyes and decide for yourself."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "Director Stephen Daldry has taken great care in looking at it through the eyes of a precocious New York City boy in a film filled with both sentiment and substance."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 67,
      "summary": "The quality of the craft at the best moments of the film is undeniable.  But it depends, finally, to how well you can embrace a young man named Horn -- a terrific gamble for a film and a subject of such size."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 67,
      "summary": "As a portrait of what happens to a family when its glue disappears, Extremely Loud and Incredibly Close wrung a bucket of tears out of me."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 67,
      "summary": "Daldry and his screenwriter Eric Roth make the mistake of showing bodies falling from the Twin Towers – it's a mistake because its graphic power seems more exploitative than cathartic – but they otherwise thankfully refrain from pulling out all the stops."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 67,
      "summary": "A polarizing load of quirkiness in Extremely Loud gunks up (at least for this hometown mourner; your results may vary) what is at heart a piercing story."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "All along, though, I was struck by an even stronger feeling, that I was sitting in on somebody else's therapy session. That's not a comfortable feeling -- and that makes Extremely Loud & Incredibly Close considerably less rewarding than it should be."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "He (Horn) gets so deeply into the whirling mind of Oskar Schell, dominating every scene he's in – which is almost every scene, period – that he lifts the movie out of the realm of \"Forrest Gump\"-like emotional manipulation."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 63,
      "summary": "No movie has ever been able to provide a catharsis for the Holocaust, and I suspect none will ever be able to provide one for 9/11. Such subjects overwhelm art."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "Solidly crafted, impeccably acted and self-important in the way that Oscar loves, Extremely Loud is also incredibly close to exploitation."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "Yet these are precisely the sort of pictures that divide audiences over a central question: Are those strings being honestly played or just shamefully pulled? Of course, the answer determines whether you feel moved or merely manipulated."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "In Extremely Loud & Incredibly Close, director Stephen Daldry must walk a tricky line between poignancy and pathos. He occasionally slips into maudlin turf."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 63,
      "summary": "Certainly not a bad movie, but a disappointing one. It knocks itself out trying to break your heart, but it's too starched and blow-dried for its own good. Maybe if it had manipulated me less, it would have moved me more."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "Dodging the twin minefields of preciousness and an exploitative 9/11 premise, Horn races away with the movie and makes it believably, genuinely sad."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "We might have all felt like lost children for a while, but ten years later, the innocence is shameless."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 60,
      "summary": "With its re-enactments of that fateful day, Extremely Loud plays a bit too much like one of those perfectly lit, heart-tugging segments TV networks air during the Olympics. It hardly matters that Horn manages to give such a naturalistic, unmannered performance as the young Oskar when everything around him has been so deliberately orchestrated to provoke a specific reaction."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "This precious story line, adapted from a novel by Jonathan Safran Foer, keeps shriveling up against the backdrop of a traumatized city; only gaunt Max von Sydow, as a mute old man who accompanies the young hero on his rounds, supplies the grave authority the premise demands."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "Extremely Loud and Incredibly Close is supposed to promote healing, but as they say in New York: close, but no cigar."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "It's a far better thing to remember Extremely Loud and Incredibly Close than to watch it. Looking back, much of what is irritating, precious and tiresome about the movie recedes and drops away, while all the movie's virtues, which are considerable, rise to consciousness. There are good things here - just be prepared to blast for them."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 50,
      "summary": "The terror of Sept. 11 feels like little more than a dramatic hook, an easy way to make audiences cry. Oskar and the event defining him deserve better."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 50,
      "summary": "Such an abundance of \"epiphanies,\" one after another, amount to a tactical assault on viewer sentiments. The deluge of tears is Daldry's idea of pathos, but to these eyes, it's Oscar-trolling 9/11 kitsch."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 45,
      "summary": "The only bright spot in Extremely Loud and Incredibly Close is Max von Sydow, as a mysterious, and mysteriously mute."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "It's just too tempting to dismiss it as extremely long and incredibly disappointing. It's challenging, divisive and has moments of beauty but leaves you cold."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 40,
      "summary": "Much of what Oskar says in the book is amusingly beside the point. Onscreen, however, the sound of a hyper-articulate boy talking semi-nonsense becomes very hard to take."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 40,
      "summary": "Yes, you may cry, but when tears are milked as they are here, the truer response should be rage."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 40,
      "summary": "The result is that, as with Hanks' performance, what's missing - subtlety, truth, an earned sense of rebirth – is stronger than what's here. Despite all the connections in Extremely Loud and Incredibly Close, it never connects to us the way we need it to."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 38,
      "summary": "If actors this good cannot overcome their material, then we can only say: Tom Hanks, Sandra Bullock … Max von Sydow, Zoe Caldwell, Viola Davis, Jeffrey Wright, John Goodman… thanks for your honest efforts in the service of a fundamentally dishonest weepie."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 33,
      "summary": "If \"Extremely Loud\" came out in the weeks or months following 9/11, more audiences (and critics) might find an excuse to appreciate the way its soul-searching protagonist works through his grief. Ten years later, his struggle actually feels outrageously old-fashioned."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 30,
      "summary": "Renders Jonathan Safran Foer's best-selling 2005 novel into unconvincing Hollywood mush."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "There's a fine line between precocious and insufferable, and it's a line continually crossed by Extremely Loud and Incredibly Close."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2012
      },
      "score": 25,
      "summary": "You need lots of gifted people chasing after the same bad idea to make a movie as colossally misguided as Extremely Loud & Incredibly Close."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 25,
      "summary": "About as artistically profound as those framed 3-D photos of the Twin Towers emblazoned with \"Never Forget'' that are still for sale in Times Square a decade after 9/11."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 25,
      "summary": "This film buries its soul beneath its own pretentious rubble, and the youthful, labyrinthine mind in which it places viewers feels less like an offbeat vehicle for healing than it does a kaleidoscopic prison."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "summary": "The production's penchant for contrivance is insufferable - not a single spontaneous moment from start to finish - and the boy is so precocious you want to strangle him. It's surely not the fault of Thomas Horn, the remarkable young man who plays him."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "summary": "It will always be \"too soon\" for Extremely Loud And Incredibly Close, which processes the immense grief of a city and a family through a conceit so nauseatingly precious that it's somehow both too literary and too sentimental, cloying yet aestheticized within an inch of its life."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "This is not a movie staring Tom Hanks and Sandra Bullock (they are good in their supporting roles) .   It is not really about the World Trade Center or Ground Zero. That said,  I believe many viewers are let down and disappointed because their expectations are not met by the advertising for this movie.  .   The reality is; this is a well written and developed drama.  The child actor Thomas Horn is incredible in the star role of  Oskar Schell.    This movie is worth seeing.  Master Horn should get an award for his performance.",
      "total_reactions": 2,
      "user": "ajs101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Cannot say enough good things about this film.  It is full of emotion both heavy and happy.  The struggle of Oskar and what he is dealing with was a wonderful journey on the screen.  Loved the payoff at the end.",
      "total_reactions": 1,
      "user": "smoman03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Thomas Horn is brilliant beyond description. The movie has Stephen Daldry written all over it. The screeplay is crafted in a fashion that has one sitting on the edge of the chair with emotions. If Thomas Horn doesn't win the Oscar for playing Oskar, something is bad wrong. Horn's crafty facial expressions and his use of voice along with the emotional looks that he displays cannot be described. Just simply an amazing job by someone so young.",
      "total_reactions": 1,
      "user": "Cincinnati57"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "I thank I read the bad reviews before seeing the movie, because with such low expectations, it's quite a good movie, and it goes creatively into an un-shown disaster of 9/11 (and others alike): the one that goes (extremely and incredibly) inside of a person that has to deal with life as it is (with loss). Sure it has some cliches and stuff, but it's human and it has a heart.",
      "total_reactions": 1,
      "user": "nandop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "I loved this film!  It was a tad slow until Max von Sydow entered.  He would have been a great in the silent film era.  I got very emotional watching the story play out.  The ending was enjoyable too.",
      "total_reactions": 1,
      "user": "stuwing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Unfortunately, the movie didn't even come close to the beauty of the book. Really how could it though? Too many famous actors in this one to make it work. Check out the Everything is Illuminated movie and book also by Foer too.",
      "total_reactions": 1,
      "user": "2bearnest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Vigorously overlooked by many viewers, but thankfully not by the Academy, 'Extremely Loud' proves that something good can be born from any disaster. Thomas Horn is indelibly powerful as are Max von Sydow and Sandra Bullock; who proves she's an Academy Award Winner! A very good film.",
      "total_reactions": 1,
      "user": "BradleyFilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Extremely GOOD and Incredibly IGNORED by the critics and people. I really liked it and think the Academy did a good job nominating this film when other awards shows just went with the \"popular good movies\".",
      "total_reactions": 1,
      "user": "Wachacha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "This movie made me tear up. This is such a sad film, but it's such an outstanding film. Anything with Tom Hanks, except for Larry Crowne, is good. A movie that'll make you feel for poor young boy whose father dies in 9/11.",
      "total_reactions": 1,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Some may say the emotion is sappy, but that's just because what you would expect from a movie like this. The story is something we all feel for on a national level, and we sympathize with all who were effected by it. The movie really makes you feel for the characters and the emotion is real. The way the story presents itself and the little quirky things Oskar does will probably make some of us cry by the end. Well done.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "As somebody whose son died on 9/11, I found this film to be both exploitive and inaccurate. It was forced and poorly done. A disappointment. And boy is Sandra Bullock getting old.",
      "total_reactions": 18,
      "user": "Sammetsfan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Extremely Loud and Incredibly Close is the most underrated film of the year. Although the topic is a little bit repeated, the point of view that shows is new: the perspective of a boy in the 9/11. The plot of the film is not very interesting and also predictable.",
      "total_reactions": 6,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Oh my goodness! what was that? What happened to the Academy? i wish they announce that that it was a mistake and take the nomination back i mean this is a shame nominating a movie with bad reviews over much well received movies? No seriously this movie was so fake and ridiculously pretentious. Performances were not so amazing except the wonderful Max Von Sydow, i appreciate Thomas Horn carrying the entire movie on his own small shoulders. The basic core foundation of this movie itself was just wrong. One of the worst nominated movie in the history or probably the worst since 60 or 70 years.",
      "total_reactions": 6,
      "user": "khan2705"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This is the most touching movie i have ever seen. It's hard to find a more moving film than this. I simply do not understand all the negative reviews about this. This is definitely a must see!",
      "total_reactions": 6,
      "user": "KasperZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "If there is a single criticism of this film that has any merit is that the piece might be a bit long.  The problem is however what do you cut when telling the story?  There really isn't much waste in the film when you reach the conclusion of the journey and realize completely the road you've traveled.  The surprise is the understanding that is revealed in the last few minutes of the film that one is continually wondering about through the entire picture.  Max Von Sydow gives a lesson in performance that mirrors the performance of Falconetti in the great silent film about the trial of Joan of Arc.  Sydow's silent performance is etched in every line and crevice of his face and with each diverted glance of his eyes.  He is perfect.  Sandra Bullock acquits herself brilliantly.  She is as troubled as her son and when the time comes is as revealing as Max Von Sydow's face.  Viola Davis once again turns in a superb performance along with Jeffrey Wright.  Daldry uses New York City as his landscape and paints the details resoundingly.  And yes the pivotal piece of the film is 9/11 but only that 9/11 was the catalyst to the story that evolves and not the story itself.  Critics and Bloggers made this piece more about 9/11 than it really was and managed to kill the audience for the piece.",
      "total_reactions": 3,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "Self-indulgent, without redemption, exploitative.  The only adjectives applicable to this disturbing attempt at emotional manipulation using 9/11 as its storyline...so disappointing!",
      "total_reactions": 6,
      "user": "lovesmovies"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "This movie is just the type of crap the Academy loves to award itself for , beyond awful. i have a bag of lint that is a more convincing actor than Thomas Horn and i assume Tom Hanks jumped to get out of this pretentious piece of garbage",
      "total_reactions": 6,
      "user": "tjm52667"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "This review will be a landmark for me: I will be judging acting, overall movie, and storyline with out of 10 ratings, plus extra notes. Overall movie: 5/10 Acting: 6/10 Storyline: 4/10. The storyline can get a little crazy, but the actors save the film from completely tearing itself apart. I really didn't feel the emotion. In my opinion, 9/11 is one of the saddest time in history, and it should not be treated so lightly and fake.",
      "total_reactions": 7,
      "user": "oscarr"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "Drama. Oskar (Thomas Horn) is convinced that his father (Tom Hanks), who died in the 9/11 attacks on the World Trade Center, has left a final message for him hidden somewhere in the city. Feeling disconnected from his grieving mother (Sandra Bullock) and driven by a relentlessly active mind that refuses to believe in things that can't be observed, Oskar begins searching New York City for the lock that fits a mysterious key he found in his father's closet. His journey through the five boroughs takes him beyond his own loss to a greater understanding of the observable world around him.",
      "total_reactions": 7,
      "user": "allmovies"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "Extremely overrated and incredibly disappointing movie... Stephen Daldry's getting worse... This film didn't deserve Best Picture Nomination...",
      "total_reactions": 7,
      "user": "MickeyMickMic02"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "This is all I know. 'The worst day'  has been portrayed in a multitude of ways on film. 'Extremely Loud'  touches a nerve that none of the others on the subject do.",
      "total_reactions": 10,
      "user": "RichieBoy"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "I am seriously disappointed by alot of the critics on this one. This movie was gripping, well acted, well directed and very entertaining. Go Tom Hanks!!",
      "total_reactions": 7,
      "user": "listen2themovie"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Embarrassingly forced, and extremely slow moving.  Random lines like \"I wish it was you..(that the mom died instead of the dad)\", that don't flow with the hack job story line make sensitive watchers cry.  Other than those few forced tears, there is no way any decent critic would give this movie a nod.  Thomas Horn's reviews all talk about his stint on Jeopardy.  Stick with games shows, my friend.  It's a real shame since a gripping 9/11 movie would be appreciated.  No doubt one of the worst movies I have seen in the last 10 years.",
      "total_reactions": 4,
      "user": "AJE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "â",
      "total_reactions": 1,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "The movie should be renamed \"Extremely Melodramatic and Incredibly Boring\". If you want to watch a movie about 9/11, go watch 911: The Road to Tyranny.",
      "total_reactions": 2,
      "user": "JamesSteal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "After his father (Tom Hanks) perishes in the World Trade Center, an obsessive boy searches for the lock that fits a key from his father. This journey takes him throughout New York's boroughs and helps him grow in the process (no surprise there). The story has a few good surprises, but the unhurried pacing and the boy's neurotic behavior make the experience wearisome and frustrating.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "What rubbish! Possibly one of the most irritating protagonists I have ever come across. He needs a whole lot of 'harden up'. The attempts at emotional manipulation is far too obvious and make this even more unbearable. Really bad.",
      "total_reactions": 1,
      "user": "alleyt1989"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "The kid is annoying. The voice over will drive you nuts. Its a fairy tale movie where there is no real tale to speak of. Tom Hanks will give some wind to its sails but its destiny is the bargain bin.",
      "total_reactions": 3,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "The film is based on a timely and touchy subject - 9/11. However, it is approached beautifully with a young, gifted boy grieving over the loss of his father as a metaphor for a city dealing with a significant tragedy. This film is riveting and will emotionally rock you - it's also one of the most heartfelt and intelligent films of the year. The bad reviews of this film are missing the point.",
      "total_reactions": 1,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "The film was cool, but in some cases, it got annoying. The monologues felt like soft versions of what Spike Lee would include in his films, and the narrations kinda felt unneeded. The kid also seemed a little annoying at times too. I loved Max von Sydow and Sandra Bullock, though; was hoping to see more of them and Tom Hanks.",
      "total_reactions": 1,
      "user": "Tazmania32"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "I can really easily blame the Academy of Motion Picture of Arts and Sciences for picking Extremely Loud and Incredibly Close an Oscar nomination for Best Picture. It was a mistake, a ruse, a scam, and a shocking blow to critics who I think they were right on the bad reception of the movie. Ya know, this is not what it seems, but I don't think this is Sandra Bullock's kind of a drama movie. The film wasn't as near as her phenomenal role in 2009's The Blind Slide which she deserved that Oscar no matter what choices the Oscar committee has something to prove.  But when I heard about the new ruling for the Best Picture race, I thought they were supposed to pick 5 instead of the 10 films (the same 5's they always put in every year during the nominations announced). I wasn't really sure if they're doing the right thing, but It feels unsatisfied and distasteful if you want to know who the winner is during award season. So, shame on you, Oscars. I thought The Girl With the Dragon Tattoo should've replaced Incredibly Close to get a Best Picture nod. That film is so entertaining, I should start reading the book again. But for those of people who wants to see more Sandra Bullock, try rebooting the original Speed instead.",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "Far from the worst movie of the year, but not very good. Cheesy and exploitive of 9/11. Some great New York shots and scenes and great acting all around, but a disappointingly dry drama.",
      "total_reactions": 1,
      "user": "seenEMall"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "Disappointing and overrated don't begin to say it.  Contrived sentimentality, what Michael Phillips aptly calls \"a fundamentally dishonest weepie\" - I tried but I couldn't even endure this movie to the end.  Little more than a setup for the Academy, yeesh.",
      "total_reactions": 1,
      "user": "thorshammer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This may be one of the worst movies I have seen in my life, and I am very disappointed that it was recognized by the Academy.  The protagonist got on my nerves within the first 10 minutes, and I soon found myself hoping for scenes that did not contain the obnoxiously unrealistic character.  Not even Sandra Bullock and Tom Hanks are able to save the horrible writing and directing that plague the film.",
      "total_reactions": 2,
      "user": "aics119"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 0,
      "text": "Extremely annoying and God awful is what you get when you sit through this horrible movie.  I usually give movies the 20 minute rule, which is after 20 minutes if I do not like it then I shut it.  However, the problem was that I watched this pile of crap with another person that wanted to see what happened next.  I would have shut the movie off within 10 minutes.  Save yourself the money, time and the wasted 2 hours of your life that you will NEVER get back and do not try and watch this movie.  I wanted to bash the kids brains in as soon as he spoke!!  I wish I was taking the same drugs that other reviewers are obviously taking to give this movie more than 0.  Absolute dog sh*t!",
      "total_reactions": 2,
      "user": "VanHatin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "There is no way that any film or other piece of art or entertainment will ever be able to completely and accurately depict the events and aftershocks of that awful day, so it is not surprising that Extremely Loud and Incredibly Close is taking its fair share of harsh criticism.  That being said, I found the film to be splendidly acted (particularly the performance of Max Von Sydow) and full of grief and heartache.  Granted, some of the emotional reactions are a result of the manipulative efforts of the director and screenwriter and the ending is a little too tidy and optimistic for the subject matter that precedes it, but the film still packs an emotional punch.",
      "total_reactions": 0,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "A likable film. I would have followed along better if it was more apparently a film about Asperger syndrome, which is a terrible and fascinating disorder. I enjoyed the existential themes in the film, and wished it had gone further with some bigger insights of how one can overcome grief -as opposed to the film's conclusion Tragic death doesn't make sense. now get on with your life.",
      "total_reactions": 0,
      "user": "jbuddah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Having seen the 49% critical rating on Rottentomatoes.com concerned me since the trailers for this film had me anxiously awaiting its release. I never read those reviews until after I see the film.  Then, if I disagree, I go back and read what insight other critics had in the film that I didn't see.  9 times out of 10, it is because the critic doesn't like the translation of the written material from book to screenplay.  That appears to be the case with \"Extremely Loud and Incredibly Close.\"  I haven't read the book, so aside from some small \"Hollywoodisms,\" I can't see how anyone could hate this movie.  Thomas Horn's portrayal of Oskar is touching, heartwrenching, precious and incredibly real.  I cringed a couple of times where it was clear that the story was being manipulated and, as a person who is known to cry at these kinds of things, I didn't.  I was moved by how \"father-and-son\" the story was.  However, I wish I had received more than a \"meh\" from my 16 year-old who saw it with me.  9/11 is such a risky theme around which one would base a story, but, aside from the recon adventures and Asperger element of Oskar's character, I can imagine that the emotion and the time it took to let sink in the inexplicable and sudden horror that happened on that day had on families, especially children, of the victims as very close to reality.  The setting of New York City is a character in and of itself in the movie.  As a lover of NYC, i strongly connected with every stop in his tour of the boroughs, seeking the answers he thought his father wanted him to find.   Overall, \"Extremely Loud and Incredibly Close\" is worth the time and engagement, if for Thomas' performance alone.  Tom Hanks and Sandra Bullock are perfect to support Thomas without smothering his wonderful work.  And while it's hard to imagine Max von Sydow as anyone but Ming the Merciless in \"Flash,\" his script-less role is stronger than most in other movies with 2 full hours of dialogue.  The movie is precious from beginning to end.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Extremely and over-the-top sentimental and incredibly trite. Max von Sydow is very good indeed and overshadows the rest of the admittedly impressive cast.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "There is a moment late in the film that was ludicrous involving Sandra Bullock's character that was unbelievable and ruined the movie for me, plus there was supposed to be an emotional payoff between the boy and the key's owner that didn't work at all.  The story just seemed pointless.  I thought the acting was good all around, but the story didn't rise to their level.  Disappointing.",
      "total_reactions": 0,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "At the end of the movie, I was neutral, the script and the sense of histotia was flat, good soundtrack, the rest regular, other movies seemed much better to opt in for an Oscar nomination, some faults acting primarily for the guy, I think that responsibility falls on Daldry! which gives us a movie without Sasson.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "An emotional film that delivers in almost every way. I became so wrapped in the life of this little boy that i found myself weeping throughout its many powerful scenes. The only thing i could see that could be criticised is the lack of connection in the end between the key and the rest of the theme. Also many critics have also said the story does not do the victims of 911 justice.I believe this is completely false the film deals with grief in an uplifting way and it shows this through the life of oskar. I cannot believe that such an emotional powerhouse of a film was not received well by critics. I often agree with ebert but not at all on this film. The most underated film of the year",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "EXTREMELY LOUD & INCREDIBLY CLOSE is extremely underrated and incredibly misunderstood. The one thing truly amazing about the film is how great Thomas Horn makes out in his debut acting role, especially as a lead character. I can vaguely remember him winning quite some money during Kids Week on the television game show Jeopardy! two years ago. He proves how smart he is here, as well. When the script for the film notes that he counted the number of times his father asked â",
      "total_reactions": 0,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "This is a very tragic film, but it is a smart one at that. The main character in the film, Oscar, is very smart. This film is courageous enough to have a plot on 9/11 and actually display emotions truthfully.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "Hard to recommend but still possible, it's just kinda one of those movies that you see on TV and your like wow this should be interesting and entertaining aswell as delivering a positive message. But than you watch the movie and findout it's really annoying and hard to watch without wanting to punch the movie and break it's nose and realize that this movie isn't as good as it looked an you found out it actually sucks.",
      "total_reactions": 0,
      "user": "EPIXMAN15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "Extremely Loud and Incredibly Close is about a year after a boy's father dies and he searches in his father's closet and finds a key. As the movie continues he tries to find a lock the key opens as he tries to overcome the sorrow of his father's death. The film does have moments of pure emotion and you can feel the pain the characters are feeling thanks to its fantastic actors, but sadly the dialogue is just flat and dull and it isn't nearly emotional enough to even pass at all as a good film. Also the lead character is just rude at times and basically ruins some of the most precious and emotional moments in the film and star Thomas Horn can't hold the movie on his own. The film is based on a great book but maybe it is just made to be a book. We will never know thanks to this not so great movie directed by Stephen Daldry who fails add enough emotion to this. I give this film 51% of a good movie.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "This is not a bad movie.  It's just not a good one.  There are parts of the film that are touching, but then there are parts that are so sappy it gives you chills, and not the good kind.  The cast is decent, though I found Thomas Horn's performance as Oscar Schell much more annoying than endearing.  Tom Hanks didn't really act in this one, he just played his normal, lovable self.  Overall, the movie tries to take us on an \"emotional journey\" but we don't really end up getting anywhere.",
      "total_reactions": 0,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "The heaviest movie I've seen in a while. While I don't think this should have been up for Best Picture, I do think that the young man in the lead role deserves a ton of praise. He carries this movie. There are constant moments that evoke deep emotions within its' viewers. The last half an hour or so had my dad in tears. Certainly a well made movie with a well developed premise but due to the material I wouldn't ever watch it again.",
      "total_reactions": 0,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "Many people find this film cheesy, manipulative, too sappy. Well, I thought it was ok. There were times it went to that tear jerker mode but overall, it was a well done film. Of all the actors, Sandra Bullock was the one that impressed me the most. Thomas Horn who plays the main character is a bit weak in my opinion although my partner felt he deserved an Oscar for his performance. My conclusion is whether you buy this film is in the eye of the beholder. Hard to explain.",
      "total_reactions": 0,
      "user": "marioping"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I have finally watched this critic-panning 2011 BEST PICTURE nominee, its Stephen Daldry",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2012
      },
      "score": 4,
      "text": "This film has a lot of great performances through out. That, however, is the only good thing I can say about it. The story is very odd and rather extreme. The only parts that really moved me were the ones dealing with 9/11. This was not because of good writing, but rather the use of a traumatic and sensitive event as a plot point. The character of Oskar was also an issue because they never establish any medical issue with him which makes his character crude and make little sense. I really see no reason why this film got a nomination for Best Picture.",
      "total_reactions": 0,
      "user": "Odin777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Was so glad to see a movie more about the effects of 9/11 than the violence, so tired of movies that fire us to fear or violence and the human connection in this one was great. The angst, of \"the renter\", the lack of restraint in the kids attitude was real, who's going to shut down a child of a 9/11 survivor with Asburgers. Best part was the kids realization, and how it all comes full circle.",
      "total_reactions": 0,
      "user": "transplantwest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Extremely Loud and Incredible Close, amazing movie, emotive and all but, I think that the final result be better, but no. I'm started for the cast, the amazing cast. Sandra Bullock, Tom Hanks, Max Von Sydow, are amazing, but for me the weakness is the kid, is some grey, and boring, but have an interesting performance, really, but with a better effort, can be better. Now the screenplay, we watching much movie about the gemel towers, the amazing Remember Me, and other films, and the screenplay is some strange, and boring, in my opinion, but is emotive in some parts. Now the photography, is really beauty, the best part of Extremely Loud and Incredible Close. And finally the rest of the movie, is amazing, have much interesting things, is amazing, but I think that other movies do a better job. In no much words, if you do't wanna watch a complex movie, Extremely Loud and Incredible Close is for you.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "I had an awfully difficult time finding realism in a film based on one of the most tragic moments in American history. While Max von Sydow unexpectedly shines (years after having originally worked with Woody Allen), the film attempts to use poignant drama without any real purpose.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "es increible esta pelicula y su forma de mostrar la vida y la bÃºsqueda de respuestas de un niÃ±o pro conocer que el sucedio al padre es increible y esperamos ver mas peliculas en ese estilo",
      "total_reactions": 0,
      "user": "CarlosDoitThis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "If youâ",
      "total_reactions": 0,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "I really thought this movie turned out to be pretty good. It took a little bit of time to understand and get used to the depth and meaning of it, but I was very satisfied in the end. As you probably know, the film is about a young boy (Thomas Horn) who lost his father (Tom Hanks) is one of the Towers on 9/11. The boy finds a key that his dad had left behind, so he feels the need to find what the key is for, because he believes that is has some use for him (from his father). The majority of the film takes us on this journey, following the  boy's search for what the key is for all over NYC. The movie is very emotional. It deals with a mother and a son's rocky relationship, healing after a close one's death, and it reminds you of the chaos the families and the city of New York had to deal with. It definitely hit me and made me think very deeply about 9/11 and what the families had gone through. I thought this movie portrayed this well and it turned out beautifully. The movie really dives in the boy's mind, and I believe that Thomas Horn, who had  only had television experience once before the film on Jeopardy, did  a fantastic first-time acting job. The movie impressed me and I would recommend it to anyone who is looking for a deep, emotional, family centered film that makes you think.",
      "total_reactions": 0,
      "user": "critic1915"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "I did like :",
      "total_reactions": 0,
      "user": "Expectoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "If you like Stephen Daldry, I really recommend this film. His touch is all over it, and the film delivers some very dramatic moments. However it's also one of the most frustrating pictures of 2011. The young actor, Thomas Horn, gives a terrific performance, but it will likely annoy many viewers and ruin the film. Overall, a nice film worth checking out.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 4,
      "text": "Extremely long and incredibly crap. The only purpose this movie had was be sentimental and receive a nomination for Best Picture (which it was). The kid is extremely annoying and just irritates me throughout the movie. If you wish to see a Best Picture nominee watch something else (even The Reader, also directed by Stephen Daldry, which is better than this to some extent).",
      "total_reactions": 0,
      "user": "Screenager"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "I actually went to this movie hoping I would cry because I like sad movies.  This movie was long and boring.  I just sat through this movie because I wanted to know the ending.  The whole \"I have to find the lock that fits the key\" story was interesting, though.  Thomas Horn gave a very good performance as his character, though and Max Von Sydow's performance is a tiny bit overrated.",
      "total_reactions": 0,
      "user": "kewlgeek555"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "Me preguntaba por que me llamo la atención esta película, y caí en cuenta de que solo era por la aparición de Tom Hanks en esta película y su nominacion a los premios de la Academia, me di cuenta que es una de las peores película jamas creadas y que el uso de 9/11 era una especie de burla, es una película muy aburrida y me parece que si la ven perderán su tiempo.",
      "total_reactions": 0,
      "user": "JUANPANB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Desde mi punto de vista una película muy emotiva, con un magnifico protagonista, y creo que la crítica no le ha dado lo merecido, pues aunque no es la mejor de las películas, tampoco es tan mala.",
      "total_reactions": 0,
      "user": "elsylorena"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "This is my least favorite movie of all time, no question. Let's get this out of the way: the 9/11 subplot of this movie is a cash grab. The movie's main plot would've been exactly the same if all 9/11 elements were wiped out of it, minus the fact that it probably wouldn't have been a tearjerker (it wasn't one for me, but I can imagine it was for many other viewers). Now that that's said and done, I was looking forward to Extremely Loud & Incredibly Close because it was the second film adaptation of author Jonathan Safran Foer's work, which I usually love. Also, with a cast that included Hanks, Bullock, Sydow, and Goodman, I was practically sold. Not to mention the Best Picture nomination almost ensured that I was going to like this movie. The supporting actors were good, but all of their performances were smothered and subverted by Horn's annoying and almost unwatchable performance. If the character was written as a bratty kid then Horn may just be the greatest actor in the world. Even if that is the case, an unenjoyable lead character usually leads to an unenjoyable movie. That is the case with this one. I'll give it this: the oxymoron part was pretty cool, even if it only took up about a minute of this overly long film. And, oh god, the tambourine.",
      "total_reactions": 0,
      "user": "aaronbartuska"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "A terrific picture, touching and very relatable to those who lost love ones. The breakthrough came from the performance of the young boy.",
      "total_reactions": 0,
      "user": "choomtabi31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "It's easy to dismiss a film based on poor reviews and bad press. Extremely Loud and Incredibly Close might be painful and frustrating to watch, but it is not a bad film. In fact, ELIC is a very good film. Panned for its sentimentality, panned for its apolitical stance on 911, panned for the perception that the film was poorly acted - the majority of professional film critics found one fault or another for this film. Frankly, both critics and audiences palates have been dulled by an onslaught of recent films with bold bright primary colors with little complexity, paced so frenetically that one might think that directors don't want to give their audiences a chance to stop and think how insipid the story is. ELIC, however, builds slowly and curiously, like taking a walk in a strange park for the first time. To complicate matters, we must take that walk with a protagonist that we are not meant to like and cannot grow to love. But, along the way we meet those around this unusual boy who we do care about, and if we watch carefully, begin to see the boy as they see him.",
      "total_reactions": 0,
      "user": "Cinemaphile"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "In my opinion a underrated movie. Good writing and decent acting that kid actor was really great, to bad he did not do anything after this movie. I see why people hate it makes scene. I thought it was pretty good in my opinion.",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    }
  ]
}