{
  "mc_avg_user_score": 4.4,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Fame",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 10,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "\"Fame\", the updated version of the 1980's version, has nothing new. It's the same funky dances with dull music with a terrible cast. Most of all, they didn't fix the terrible wrap up the original one suffered. This is a movie where its terrible to the heart.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "BORING. If these people are talented, it's actually very hard to tell. The original Fame movie was awesome. This movie is pathetic. It's that simple. Yes, they can be compared. If you're going to remake a cult classic, you should have a clue. If you can't improve on it, leave it alone. These days there are many performing art schools and they don't all do hip-hop (shock horror!). In fact you may find that most artists are interested in diversifying rather than recreating the same-old same-old. My advice - Ignore this movie was ever made because it shouldn't have been.",
      "total_reactions": 0,
      "user": "Sabrinna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Actually, this is not a movie for family! It is the best musical movie for me, but still I guess not for family, more for teens,  I really Like this movie, I really enjoyed it I will give it 10/10.",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "An hour and forty seven minutes of musical hell, this \"update\" of FAME feels like it's been on forever long before the credits are ready to roll. It's packed from beginning to end with cringe-worthy moments, frenetic direction and unappealing characters. Worst of all it commits the cardinal sin for any entertainment product in that it's boring, exchanging any of the edginess of the original for plots recycled from so many after school teen specials. \"This is who I am Mom and Dad, SO YOU BETTER BELIEVE IN ME!\" So many people try to give these kids advice but ultimately the only advice they need to follow is \"DON'T BE AFRAID TO SUCCEED!\"",
      "total_reactions": 0,
      "user": "GhengisJohn"
    }
  ]
}