{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Family Weekend",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "Farran Smith Nehme",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "For a long while, director Benjamin Epps goes for breakneck farce; at its best, this is a batty mixture of family-values editorial and teen spoof."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Family Weekend is no worse than many of the dysfunctional family comedies that populate the Sundance Film Festival — \"Little Miss Sunshine\" is name-checked within the movie itself — but isn't any better either."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "Despite the promise Epps and Turner show in their film’s finest moments, we’re still talking about a movie that tries to wring jokes from puppet therapy."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 38,
      "summary": "Family Weekend is the kind of dark-for-dark's sake, wannabe quirkfest that proves indie films can be just as clichéd and vapid as the most soulless Hollywood movies."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "This belabored comedy, directed by Benjamin Epps, has a slick visual veneer and some capable performances, especially by Ms. Rulin and Ms. King. But the script, by Matt K. Turner, is loaded with contradictions, its hollow flirtation with subversion amount to airplane pablum."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "Although Rulin displays a compelling neurotic edge as the driven Emily, Chenoweth and Modine are unable to breathe much life into their schematic roles, while the supporting players are basically saddled with conveying a compendium of quirks."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "summary": "Quirky indie hell, thy name is Family Weekend. Benjamin Epps's film is the very definition of affected cutie-pie whimsy and weirdness."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "This film is not actually as bad as it seems. It is not excellent but it isn't something that will wast badly your time. It has some enjoyable moments and a few goofs but the thing is that the film is a actually original and this script hasn't been made again and again. Of course it would have a happy ending but that's something we knew from the start. The girl's performance was really good too. That's all I have to say for that movie that needs your attention and many people will like it and many people wont like it for some reasons. I enjoyed it at some points. That's all I need to say.",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "What's that mom and dad? What's that mom and dad? You- You want me to stop eating fruit rollups? Yiff off. Yiff off. What's that mom and dad? You want me to stop watching T.V. during a street shark marathon? Yiff off! Yiff off.",
      "total_reactions": 0,
      "user": "DanMcMan"
    }
  ]
}