{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 44,
  "mc_mixed_rating_frequency": 38,
  "mc_movie_name": "Faster",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 60,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "The film never outshines its influences, but as back-to-basics action filmmaking, it's often superb."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Built for speed, and for an action-savvy audience who can appreciate a throwaway vengeance flick for exactly what it is."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 70,
      "summary": "Stripped for action without a moment wasted on unnecessary dialogue, exposition or nuances."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "Faster is meat-and-potatoes action with a side of crazy."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "A pure thriller, all blood, no frills, in which a lot of people get shot, mostly in the head."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "Grim but holds the attention; it does not, however, offer the kind of mindless action excursion that many will be anticipating."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "Plays as if Tillman studied the works of director Michael Mann (\"Heat\"), but got a C on the final exam."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "A stripped-down affair, from title to characters to plot. It never strives to be more, instead concentrating on making the most of its self-imposed limitations."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 58,
      "summary": "Faster starts to lay on a heavy-handed message about the importance of forgiveness. That isn't what anyone showed up to see."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Dwayne Johnson leaves his lovable self behind in the violent but bland Faster."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The archetypal names are pure Walter Hill, the single-minded grudge mission borrowed from Donald Westlake's Hunter books - fine antecedents, though director George Tillman Jr.'s style is anything but terse, indulging rote slo-mo swagger set to secondhand musical cues."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Tillman, who made a splash last year with his hip-hop hit \"Notorious,\" does a nice job of calling into question the assumption, shared by most genre films, that vengeance is the only right course of action."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Anyone interested in a no-seatbelts, out-of-control action flick will find much to enjoy in Faster; although even they may prefer seeing it in Blu-Ray at home, which would allow for trips to the fridge for fuel when the film begins to idle in the last reel."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Faster, a turgid, ultraviolent parable of revenge and forgiveness, is as muscle-bound as its monosyllabic antihero."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "The perfect vehicle for Johnson's charm and talents is still out there. It's certainly not in the muscle car he pilots in Faster."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "This is meat-and-potatoes (and bullets) action filmmaking, although, really, that title's got to go."
    },
    {
      "critic": "Steve Ramos",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Watching Driver peel rubber proves B grade action movies are a welcome diversion in the era of CGI blockbusters. If only Faster didn't fizzle each time Johnson put down his gun."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "Dwayne 'The Rock' Johnson is overhyped as Billy Bob Thornton is slow and steady."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "The Rock deserves better than this ho-hum revenge picture."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "Whatever brownie points Tillman scored with \"Notorious\", Faster is that wake-up call that he's no John Woo."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "In Faster, it's a car, not actors, that drives movie."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "Faster grafts that genre's style onto a deadbeat script and leaves it to Johnson - as deadly focused as a gunsight - to make it all believable."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "Despite much effort, neither Johnson nor director George Tillman Jr. (\"Notorious\") can make this preposterous tale, live up to its title."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "summary": "No matter how guilty our knucklehead-protagonist's victims supposedly are, it's difficult to maintain a rooting interest."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The movie is overall bearable to stand for itself, but the Johnson action and a understandable morale of redemption makes the movie worth to watch.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "I don't know what the critics are looking for in movies, but they are way off with this one.  This action movie was exciting, violent, full of action, fast cars, and even a few laughs. Most importantly, it was FUN.  It's been a while since Dwayne Johnson did a straight up action role, something he is a natural for. Trust me and the other nonprofessional reviewers: this movie is worth it!",
      "total_reactions": 2,
      "user": "duucfho"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Uh, the car was cool? I think that they may have taken 3 unfinished screenplays and shuffled them into a single script to create this movie. I like a dumb action movie and will put up with a lot for some cool action sequences but there were entire subplots here that could have been removed without anyone in the audience knowing the difference. Yoga-conquering/web-entrepreneur/newlywed/retiring assassin character-- I'm looking in your direction...",
      "total_reactions": 1,
      "user": "whit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Dwayne Johnson  is finally back into the action genere.  Now the question is is this a good re-entire.   All my answer to the question is Your damn right it is!  Not only is the rock back,  but he is back with one of the most amazing performances  of his acting career.",
      "total_reactions": 1,
      "user": "MarcelloM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "not one boring moment!  very action packed, mucles,vengence,quick moving edge of your seat kind of movie.  worth the 60 minute drive. The Rock was very good acting out his emotions even made it believable.",
      "total_reactions": 1,
      "user": "ladymoviecritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Once again, most of the critics are wrong!! Finally, Dwayne Johnson gets out of that tutu and blows people's heads off!! A tribute to the old school 70s action movies, Faster's plot is simple, but the ride is intense. And there's not just good ol' action. Everyone gives great, dramatic performances, espicially the Rock, who is cooler than ever. Overall, Faster has everything you want out of an old school action flick-badass killers, badass guns, badass cars, and hot chicks!! WELCOME BACK, ROCK!!!",
      "total_reactions": 5,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Yet again, the critics are wrong. Faster delivers EVERYTHING an action movie could. Guns, muscles, cars, girls... it's all here! The story is fantastic and the twist ending was very unexpected and surprising. The characters are extremely well developed. Each with their own unique story and motives. Every actor in the film delivers a great performance, especially Dwayne Johnson and Billy Bob Thorton. Dwayne doesn't have many lines, but every time he does speak, it steals the scene. Hell, even when he's not speaking, his eyes and facial expression are worth a thousand words. Billy plays the druggie cop who tries to solve his last case before retirement, but there's much more to him than that. Oliver Jackson-Cohen also plays an excellent assassin. Overall, this film is a definite 10/10 in the action movie genre.",
      "total_reactions": 4,
      "user": "EliteF50"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "The Contortionist Formerly Known as The Rock, the former WWF wrestler-turned-actor Dwayne Johnson, hasn't starred in a violent actioneer such as \"Faster\" since \"Walking Tall\", the 2004 remake of the 1973 Phil Karson-directed original, choosing instead to appear in star vehicles calculated to soften his image as a bad-ass. And even then, Johnson stayed away from guns; his character, Chris Vaughn, a former U.S. soldier, carried around a 4 X 4 slab of wood to settle his conflicts. The plan worked; he's not Jean-Claude Van Damme, who(like Johnson) started off in the athletic arena(kickboxing), but soon experienced a wane in popularity, partly because he couldn't act, even though that never stopped an Austrian-born bodybuilder from superstardom and the governorship of California. Both Johnson and Arnold Schwarzenegger were smart enough to ham it up, deconstructing their machismo by emasculating themselves in kid-friendly projects such as \"The Game Plan\" and \"Kindergarten Cop\", while Van Damme and Steven Segall kept making the same mirthless movie over and over again, ad nauseam. While neither man are particularly gifted as comic actors, in which the laughter they generate largely stems from the incongruity between their body type and feminine actions(for Ahh-nold, think \"Twins\"), they have enough charisma to make you THINK they're funny. Actually, that's no small feat. Remember Vin Diesel in  \"The Pacifier\"? Would Van Damme, given the opportunity to star in a game-changing film like \"The Tooth Fairy\", add or detract from the spectacle of being costumed in a pink tutu and tights? Probably detract, so give Johnson his due; he pulls off the tooth fairy get-up with only a minimal amount of creepiness. Now, after capturing the hearts and minds of children, and more importantly, their moms(even going so far as doing a cameo in Tyler Perry's \"Why Did I Get Married Too?\"), Johnson puts down the wand and picks up a gun and kills people for the first time in a long time. It's time to bring the men back into his fold. Playing an ex-con named Driver, The Contortionist Formerly Known as The Rock goes on a bloody rampage, killing the people responsible for murdering his brother after a successful robbery. Rest assured, the people he shoots in the forehead deserves their bloody comeuppance. Johnson isn't going to put his screen image at risk by killing the innocent, although it's open for debate as to who had it coming and who is worthy of a pardon. After all, ten years is a long time. People can change, not all people, mind you, like the second name on Driver's list, a rapist who preys on young women, a person in which nobody mourns when he ends up on the receiving end of some vigilante justice. It's the third and fourth names that prove to be more complicated. Echoing Quentin Tarantino's \"Kill Bill: Volume One\", the stripclub owner, the black man who pulled the trigger on the dead man in the urn, has a child, a college-aged son, just as \"Copperhead\"(Vivica A. Fox) had a child, a young daughter, in which some may argue, is enough reason for the assassin to ply some compassion. But being a parent isn't enough redemption for either Driver or \"The Bride\"(Uma Thurman) to call the whole thing off, and spare their respective targets' lives. The preacher, however, is given a reprieve. In a flashback, we see that the man of God tried to stop the slaying, therefore making Driver's decision to forgive and forget all the more easier. But what if the preacher was the trigger-man? That would be a real test of compassion on Driver's part. Providing the killer with a real dilemma might have put \"Faster\" over the top. If Driver offed the man of God, then moviegoers would really have something to talk about. Just because you're born again, and God has forgiven all your sins, does the man who stands over you with the power of God in his hands have to do so, likewise? For once, wouldn't it be nice to see something truly transgressive in a studio film? \"Faster\" is not \"Death Wish\", but for all the wrong reasons. As a hypothetical, \"The Bride\" would do a preacher, and that's because her creator thinks like an artist, not a marketer.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "A Score of 39 is more appropriate for some brainless drivel starring Jason Statham. Faster is the closest I've seen to a 'smart' action movie. Many things in the movie are left unsaid, you'll see photographs on walls or items placed prominently and only find out that there is significance towards the end of the movie. It's also never dull, the pacing is amazing.",
      "total_reactions": 3,
      "user": "Gene"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Big Dwayne \"The Rock\" Johnson fan here, overall this movie was pretty decent. Enough action to satisfy the action gurus out there, The Rock was pretty good as well though he maybe had like 10 lines of dialogue in the entire movie.  I'd call this a good call given that his most dramatic scenes aren't believable. Making up for his silence are the creatively named Cop and Killer who both explore relationships and contemplate the bookends of careers. The story is simple and straight to the point, a man out looking for revenge on those who double crossed him and murdered his brother. Though it could have been alot better, i guess you could still take it as it is.",
      "total_reactions": 1,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "starts off kinda intresting with some decent action but plotwise and charicter develpment really dont go much of any where and by the last 30 min i started loosing intrest in it . even the big plot twist near the end did nothing for me . just a mediocore film .",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "faster is starring dwayne johnson.. he is really muscular macho man. the story is weak. the screenplay is ok. direction is a failure. editing is sharp. prodcution values are wasted. just a shoot out with 4-5 gun fires and 2-3 stabbings. dull flick with some hunch dialogs. forget the movie. its very weak.",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "It's not terrible, but it's all been done before. The movie starts out promising, but becomes overly convoluted by the end. I also still can't figure out what the point was of the extra story line with the millionaire hit man other than to fill up screen time. A few cool scenes, but not really worth your time.",
      "total_reactions": 0,
      "user": "AJackson729"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Pretty entertaining, I mainly liked the characters besides the women police officer and the millionaire hit man. Those two were completely unnecessary. Billy Bob's character was the best in the movie.",
      "total_reactions": 0,
      "user": "SUPERGRAND"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "that's the best thing about critics, there only discernible talent is criticizing other peoples work ha ha most of these people are journalists and have this ridiculous notion of what a film should be, fast is a good movie giving it a rating of 41 is just a joke and completely wrong. i bet they get up in the morning and say \"time to go write about other peoples work because thats all i can do\"",
      "total_reactions": 0,
      "user": "chotzy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Great Film. Dwayne Johnson is a good actor and I can't fault his performance in this.",
      "total_reactions": 0,
      "user": "RezzaDee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "OMG, this must be one of the best films I have ever seen, Dwayne â",
      "total_reactions": 0,
      "user": "powa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "its a pretty good revenge type of action movie. there's not a lot of action and you don't really know why the rock is trying to get revenge til half way in the movie through numerous flashbacks, but otherwise enjoyable.",
      "total_reactions": 0,
      "user": "sle0609"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "http://movieswithmitch.squarespace.com/  Mitch Hansch",
      "total_reactions": 0,
      "user": "movieswithmitch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "This is easily the worst film I've seen all year. None of the characters are interesting. The performances are all poor, save for the female cop who is decent at best. The plot is basic and uninteresting. The action and driving sequences are nonexistent. This is NOT an action movie, let me clear that up now. It's a boring thriller and a lousy drama. Another thing that bugged me is that this film tests your suspension of disbelief to its limits. I'm all for suspension of disbelief, but this film has scenes where you say \"No way in hell could that possibly happen\", and this lack of adherence to the laws of the universe comes across as just plain lazy.",
      "total_reactions": 0,
      "user": "jackphilosophe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "The critics are wrong again! Its an awesome guy movie. one that will be watched time and time again. The Rock has like 8 lines in the whole movie. If you have a male family member that speaks ZERO English--they can follow this movie. The only bad in this movie are the car scenes.  No one drives like a idiot ALLL THE TIME --especially a person trying to avoid a nation-wide manhunt. Why would anyone burn rubber at every light when they are trying to avoid the cops?Seriously.....The Rock is a BADASS. The audience KNOWS THIS....we don't need to be convinced with pointless scenes of him driving 100mph in a quiet neighborhood with no one chasing him.",
      "total_reactions": 0,
      "user": "hyepwrd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "Pretty cool movie, descent acting, great action, fine story. Billy Bob as persuasive as ever. Rock is playing ex con who wants revenge for death of his brother and he is willing to pay any price. Action packed, excellent movie.",
      "total_reactions": 0,
      "user": "aryanrule"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "There are certain people you do not piss off in action films:  Black Mamba from Kill Bill, Nicolas Cage in everything, Clint Eastwood in most things, and more recently, Machete.  I did not include the Rock on this list because I think it would be intuitive for anyone to not kill the Rock's brother.  Just do not do it.  It is bad for business and it will not end well for anyone.  If you kill the Rock's brother, he will remember that and put your name on a list.  I started this movie with a preconception; it was going to suck.  It doesn't.  This action movie has some soul in it.  Its characters have back stories and they are presented in more than a single dimension.  Unfortunately, it plays a bit dumb at parts and feels like it must help its audience along.  Characters are introduced with a title such as \"Cop\" and \"Killer\".  I don't think these are needed, even for people who would choose to see this movie in the theater.  It's also not good enough to stay away from the cliches.  The cop is naturally 10 days away from retirement, the Rock cannot just turn around in a vehicle, he must squeal out of everywhere in at least a 270 degree turn of smoke, and the idiotic dialogue includes such gems as, \"I have a hunch,\" \"Well, so did Quasimodo and look where it got him.\"  The Rock in this movie reminds me a lot of Machete from last year.  If Machete 'don't text', then the Rock doesn't look both ways before he crosses the street; he just assumes cars will slam on the brakes and let him go.  He is on a mission.  He has one thing to do and he just goes out and does it.  Bravo on the initiative.  He also has tattoos on his forearms that only underworld gangsters and body builders can recognize.  The casting sticks out.  Tom Berenger shows up very briefly; is he mad because he didn't get included in the fourth iteration of the Sniper series?  Mike Epps shows up as well.  The script is good, but do you really need to cast the minor characters as well known as these guys?  It's a distraction (remember Ted Danson in Saving Private Ryan).  Also, a good, but unorthodox, inclusion is the 'Killer'.  This is guy is Johnny Cage with a serious inferiority complex and says quips like, \"I'm done with yoga, I beat it.\"  The ringtone on his contract killer cellphone is the theme song from The Good, the Bad, and the Ugly.  That is not the only Clint Eastwood rip-off.  Remember the end of A Fistfull of Dollars?  *smacks forehead*",
      "total_reactions": 0,
      "user": "CitizenCharlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Getting very sick of clueless 'professional' critics.  They need to go back and take a good long hard look at themselves.  This movie was fun to watch and I enjoyed it.  Didn't try to be anything it wasn't and to say the car was the best thing about it is just plain stupid.  This movie had nothing to do with cars.",
      "total_reactions": 0,
      "user": "dogboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "This actually has pretty good production values for the genre. The Rock's character is never developed well, but he plays the one emotion required of him- pissed off - pretty convincingly. Good soundtrack, good pace, good direction. The action is not very flashy, but has a certain gritty realism to it.",
      "total_reactions": 0,
      "user": "MarkG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "I didn't expect much but I was very pleasantly surprised.  My wife actually liked it to and she is a very harsh critic on anything other than Sex and the City type movies.",
      "total_reactions": 0,
      "user": "Johnny6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "I genuinely enjoyed this film.  It was a simple story with complex and extremely well acted characters with an artistic feel throughout.  The characters felt real to me, with real lives and back stories that you glimpsed, like Billy bob's character lay in his bed with his child.  I'm not particularly gifted at reviewing so i'm not putting this into words very well but this was a rare film for me and i loved it.",
      "total_reactions": 0,
      "user": "ogower"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Faster is an interesting piece indeed, it has the rumblings of a B movie with its non-stop destruction and hell bent on revenge, but on the other hand we have some sublime performances from various avenues of the screen, coming together in this mash-up of films from the past, it has hints of noir, but is ultimately a one-trick path of vengeance that is devoid of anything other than cold-blooded murder and scowling faces. We have Dwayne \"The Rock\" Johnson in a role that most suits him, he has definitely showed diversity, sometimes perhaps too much, but there is just something different with this character, he plays a convict who we simply know as \"Driver\" a broken and quiet man on a mission as soon as he gets released, he paces frantically from the prison where he climbs into an empty car waiting for him, he climbs in without a word and speeds off to an office space, where he shoots a man in the head and leaves, it's as simple but as brutal as that, he is a one man wrecking crew, but with good reason it seems. He is on a path to kill those who killed his brother in the most brutal of circumstances, and on his tail is \"Cop\" played by Billy Bob Thornton, this cop is close to retirement, but has a drug problem and a broken down marriage with a son involved, but is more involved than first glances would suggest. Also along the way is a hired \"Killer\" (Oliver Jackson-Cohen) who is an impressive specimen and a man who has done it all, consistently looking for challenges to save himself from boredom, he has a past that we learn through pictures he gazes at, a past that he may be trying his best to forget. He finds happiness with his girlfriend Lily (Maggie Grace) who questions his job choices but is ultimately committed to him. While Faster offers up some interesting characters, it isn't developed enough for it to properly stretch out, it could have properly developed its backstory which could have benefited an often closed and passing explanation for this mans actions, it therefore becomes a simple shoot and run with a few moments that show quality filmmaking, but not consistent. The performances alone keeping the film moving at a raging pace, with The Rock showing depth to character and proving he isn't all black and white. The film throws up some interesting twists and unexpected developments, they make it a satisfying film to enjoy, but don't offer much in terms of thought or drama, it is an adrenaline and testosterone-fuelled rampage that is is perfect for sitting down to relax, with a few starring performances worth applauding.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "People looking for deep characters and a plot for ﻿the ages will feel let down and eventually angry at this film but to those aforementioned...why did you watch this? From ﻿the previews you can clearly see that this was going to be a no holds barred action movie to restart Dwayne Johnson action movie persona! This movie is pure action with some surprisingly interesting moments. Like when Dwayne walks into a seemingly\"next victim's\" room and points ﻿the gun right in this old ladies face and threatens to shoot her only to later find out  that its his own mother!!! This may not be the twist to end all twist but it was clear that he was willing to kill anyone who stood in his way of revenge!! Which is ﻿the point of this movie people....REVENGE in all its senselessness..so if you want some sort of Shakespearean revenge story then look elsewhere because this movie is gritty and straight to ﻿the point...(like paying for a hooker lol) Take the first scene for example...after getting out of jail Dwayne is told not to get into trouble...picks up a badass ride...walks in a building....pulls out a hand cannon and kills a guys then leaves...all without saying two words!!! There's also a moment of sympathy ﻿the viewers are treated to when he visits his ex only to find out she aborted their child...then he(seemingly) kills ﻿the club guard...calls his son and tells him he killed him ONLY to hear he survived...goes to ﻿the hospital and finishes ﻿the job that would make Rambo himself proud!! Once again people..this is not kill bill...this is faster..its gritty and in your face action without kungfu or swords. Afterwards he finds another victim on his list and finds out he's now a pastor which provides us with a shred of ﻿the unexpected from Dwayne in this movie....mercy! Its easily the best part of ﻿the movie(save for all ﻿the juicy violence which I also enjoyed)as he isn't beyond sparing someone who may or may not deserved it depending on ﻿the one watching. He's also being hunted by an ego manic viewing life as a challenge but sees    the ultimate challenge in dwayne johnson as he admits he is a much better shot than he is and much quick at aiming and shooting and obsesses over seeing mr johnson dead. They also build an interesting character development of the would be assassin by showing his past and why he wants to be challenged.",
      "total_reactions": 0,
      "user": "ilovegames32"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Revenge thrillers are my favorite type of action film. They are intense, fast pace, and have you rooting for the bad guy, who may not be so bad after all. My favorite revenge thriller is Payback with Mel Gibson, but Faster may be a close second. The Rock stars in a role that is absolutely perfect for him. The unnamed man was set-up for a crime his brother committed, a crime, that saw his partners turn on him and kill him. Now after nearly a decade in jail, The Rock is out and seeking revenge. With his size, intimidation, and weird eye brows, The Rock finds out who his brother was working with and goes on the hunt. Realizing this, the man who set everything up, hires a hit-man to stop him, and the chase is on. I do believe that wrestlers can be great action stars, but The Rock never really did anything for me until now. This cold, calculating man, out for revenge is by far better than any character he's ever played. If The Rock was alone in this film, it wouldn't have been as great as it was. He is paired with Billy Bob Thornton, playing a washed up, alcoholic cop, who is days away from retirement. He really doesn't need or want this case, but winds up stuck in the middle with some pretty funny moments. Thornton is one of those guys who is good in anything and always brings his unique and dry brand of humor to every role. The pairing of the two, in an intense, fast paced, story make this film an absolutely must see movie that shouldn't be missed.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "I loved most of this movie. The entire main plot is totally solid, but some of the side-plot with the assassin guy is weird and by the end it seems like a pointless thing to have. As if the movie was written by a TV writer that just always did an A-plot and B-plot just because that's what you do in TV. The action is well done, even though there's not always a lot of it. Tension is built up wonderfully between the actual action moments.",
      "total_reactions": 0,
      "user": "Lokathor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "\"Faster\" is one of those movies that does not have a clear good or bad guy and overall does not bring out the goods. The cinematography was great, though, and has some thrilling scenes. I wouldn't say that this film would be a recommendation, but if you're interested, it's worth a try.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Pretty good movie. Dwayne finally gets into another movie that fits him and it turned out to be a great decision. The only downer is the ending, to me that was just plain stupid and unrealistic. The story line was basic but they made it work better then must people would have.",
      "total_reactions": 0,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Faster does live up to its great Dwayne Johnson movie name and the movie is thrilling but Johnson makes the film stand and worth to watch. The action is breakable to the barrier type enough which makes Faster a great Friday night B rated movie flick for the big guys. and as always The Rock has pumped up muscles for the movie, but in the end this the best action movie of the year.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "While the acting is not bad and some characters are believable, the action sequences and the story are poorly done.Dwayne Johnson has starred in some crappy movies and in some not that bad, and this one is more likely to be in the second category even if the final twist is poorly found and Johnson's character is alive  for the dumbest and easiest reason.Overall an okay film that could've been way better.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "This movie sucks. Totally unlikeable characters, poor story, terrible soundtrack, and most unrealistic scenes. The script too is really terrible. There are much better movies than this.",
      "total_reactions": 0,
      "user": "kartzy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "In Faster I can agree that the revenge can sometimes be good , because Dwayne Johnson did well, but the script is very powerful , with police factor but a bit boring , plus I loved the picture.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Tha ROCK is such a bad ass, kick ass, wont stop till he gets what he want in this film. Good movie.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}