{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 78,
  "mc_movie_name": "Fast & Furious",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 123,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "The Fast and the Furious is a great and effortlessly entertaining movie, i highly recommend it and the cast perform very well, I can't believe how bad the critic reviews are for this movie, because, nice cars, girls, money, street race, actor !",
      "total_reactions": 1,
      "user": "SnakeSLB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "i think that this was an excellent movie. it revived the two main protagonist very well and the story i which they are brought together again provides fine action and suspense. the rest of the cast performs well and provides convincing entertainment and i would definitely recommend this movie and i am looking forward to the sequel",
      "total_reactions": 0,
      "user": "Andy92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "The Fast & Furious brings the franchise back to where it started with the original cast and conflicts that made the first two have some appeal. The only difference is this time I care. The film writes the characters of Paul Walker and Vin Desil in a way that both are likeable especially Vin Desil and the relationship the two have over the course of the film gives it some emotional investment that the other ones lacked. The film while borrowing elements from previous entries picks the good elements such as fun car chases which are for once fun and memorable. The scenarios and sets along with some nice direction make the action in the film engaging minus the occasional moment when its hard to tell what’s going on and one chase sequence early on which has excessive use of shaky cam. The spectacle has also been toned down and hot babes and flashy cars aren’t solely relied on to hold the film up. The characters outside of the leads aren’t fleshed out and there are some cliché and predictable moments such as the bad guy reveal and Paul Walker’s characters conflict with the force. Its not a great film but it is entertaining which is something this franchise has never been making this the best of the four and hopefully the future installments keep up this sense of fun.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Fast & Furious is the darkest entry in the franchise and possibly the least fun. The story is great and there are a lot of good moments between the characters. Bizarrely, the weakest moments come in the action sequences, most notably with the use of unnecessary CG. Where are the crazy stunts the series is famed for? In the computer, that's where. Fast & Furious may be the weakest in the series, but it's still a fun ride.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "This movie was enjoyable but not great and if it wasn't for the ending race scene and the familiar characters, I might not have bothered to see it. None of these movies compare to the first two.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "Movies arnt good because they entertain dumb people for 2 hours and they arnt good because they feature cool cars or paid models to show their legs and cleavage. Given the opportunity of having the originally cast back for another shot, Fast and Furious stumbles to give us anything the audience hasnt seen in previous instalments.There is little here that is very cool or sexy. The action is only mildly thrilling, the characters dull, the villains lame and the story forgettable.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Fast and Furious was a very good movie that had a darker and more serious tone than any of the prior films in the franchise. I loved seeing almost the entire original cast return and the amazing cars and impressive special effects that are a staple of the series return once again... granted, with a reduced emphasis on the cars themselves. The only real problem I had was that the continuity was broken a bit. *SPOILERS* Why, for example, is Paul Walker back in LA after the ending of 2 Fast 2 Furious? What happened to Tyrese's character? What happened to the rest of the crew from the original movie? These are not huge complaints but they did take away from the experience a bit. It's also evident that this film is a prequel to Tokyo Drift which was a little weird. Nonetheless, great film that is probably better than any of the prior ones other than the first of course.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I'm going to give this movie three and a half, although it almost deserves four.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "Despite an improvement over the previous three films, this fourth installment is no more than just crazy car chase sequences and races. It is good to see members of the previous movies' cast back in action though.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Features fast-paced action but manages to be disloyal to the fans who loved the series for its cars (me), the 4th entry in this franchise wreaks of predictability and transparency, and makes for one of the most painfully brainless and mediocre films this year.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "\" A real driver knows exactly what's in his car.\" - Dom",
      "total_reactions": 0,
      "user": "Marica"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Turn off your mind, though, and there's some fun to be had from some of the better whizz-bang sequences of the film's biggest laughs is showing title credits. Clearly, after a prologue in which thieves play chicken with a burning, tumbling oil tanker, the possibility exists this is a Steven Soderbergh experimental gamble. Dumb, fun and awesome.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "It drifts on to a new genre (heist) which works very well for a franchise running out of fuel, but like its predecessors, no scene stands out as great. Even the twist at the end was disappointing.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "It drifts on to a new genre (heist) which works very well for a franchise running out of fuel, but like its predecessors, no scene stands out as great. Even the twist at the end was disappointing.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"Just like old times.\" What can I say it's a movie ok, that I really liked enough: D. Anyway, all the Fast and Furious series is good, really can not deny that.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "A combination of action and a more detailed story,with no talent or effort put into it at all! Fast & Furious is complete garbage,yet important to the franchise.",
      "total_reactions": 0,
      "user": "DenisManu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "No words to say. This movie is very very very very very very amazing, I can watch this over and over again. Just amazin as I say. Rating this 10 / 10 !",
      "total_reactions": 0,
      "user": "XDavidX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "They really tried to make the film more than just a racer, but it couldn't keep my attention span for more than 10 minutes at a time, I kept looking for something else to do. The tunnel racing was nicely done, but that's about the only highlight for me.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Certainly entertaining, from beginning to end. One of the better films I have seen lately, but not as good as Furious 7. Anyways, I would recommend this movie to anybody looking for a suspenseful action movie THAT ISN'T RATED R. That's the beauty of the F & F franchise, teens could watch it without the iffy content (they are all PG-13) 8/10",
      "total_reactions": 0,
      "user": "RickyReviews"
    }
  ]
}