{
  "mc_avg_user_score": 2.8,
  "mc_metascore": 46,
  "mc_mixed_rating_frequency": 123,
  "mc_movie_name": "Fifty Shades of Grey",
  "mc_negative_rating_frequency": 712,
  "mc_positive_rating_frequency": 206,
  "mc_pro_critic_reviews": [
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "Great art it's not – but it's frisky, in charge of itself, and about as keenly felt a vision of this S&M; power game we could realistically have expected to see."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "The film never pretends to be other than what it really is: soft-core porn for the ladies, diluted with an “R” rating."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "With a loose-limbed naturalness, she conveys naiveté, intellectual curiosity and romantic yearning, and shows the unassuming Ana’s newfound thrill at being seen, however complicated the man holding her in his admiring gaze. She’s open and vulnerable but no fool. Best of all, Johnson and her director embrace Ana’s paradox: She snickers at Christian’s predilections, but they also turn her on."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "Fifty Shades of Grey isn't the howling pornucopia it could be, but it's sexy enough, spank you very much."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "I spoil nothing by reporting what readers already know, that when Fifty Shades is not a dirty story, it is, as the trilogy unfolds, a study in cartoonishly weird family dynamics."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 65,
      "summary": "Starring a vivacious Dakota Johnson and a game Jamie Dornan, Taylor-Johnson’s erotic romance is a skillful distillation of James’ first book that captures the heady exhilaration of being someone’s fixation."
    },
    {
      "critic": "Meredith Goldstein",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "The director of the much-anticipated adaptation, Sam Taylor-Johnson, made what could have been a trashy TV movie into well-conceived cinema."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Despite what you might fear, the movie is not torture. And even if it doesn’t inspire lust, you will breathe a warm sigh of relief, thinking: This could have been so much worse."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "The surprise, if there is a surprise here, is that the film has found a slyly humorous tone for much of the running time."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "The film strips Fifty Shades of Grey to its essentials: a confident man, an awkward girl, and a red room rimmed with leather handcuffs. From there, Taylor-Johnson rebuilds. She constructs an erotic dramedy that takes its romance seriously even as it admits that Christian Grey's very existence is absurd."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Johnson’s Ana squeezes believability out of one of the more silly romantic entanglements in recent popular culture. It’s all there in her face, which Taylor-Johnson frames in close-up. She’s fully aware this scenario is ridiculous, but can’t seem to turn away from its lunacy."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Glossy, well cast, and a consistent hoot until it becomes a serious drag, this neo-“9½ Weeks” is above all a slick exercise in carefully brand-managed titillation — edgier than most grown-up studio fare, but otherwise a fairly mild provocation in this porn-saturated day and age."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Fifty Shades of Grey is a sex-positive but hopelessly soft-core erotic drama that fails to be even a fraction as titillating as the E.L. James books that inspired it. And yet, that’s exactly why it works."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Credit goes to director Sam Taylor-Johnson and her screenwriter, Kelly Marcel, who've stripped the first book of its biggest flaws, while still honoring its essence. And lead Dakota Johnson makes for an ideal heroine, though — as doubters feared — her chemistry with costar Jamie Dornan doesn't always sizzle."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 58,
      "summary": "It's a very slick film. But in the end, that slick becomes suffocating, and there's no real pulse here."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "There's real hypocrisy here. If a movie like Fifty Shades of Grey is supposed to offer a voyeuristic experience - and not a ridiculous experience - have some integrity about your nudity. Despite what the filmmakers may want to believe, there isn't a lot else going on here. Fifty Shades of Grey Matter, not so much."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "In the annals of sexually-charged event cinema, Fifty Shades of Grey barely lights a candle let alone combusts with unbridled forbidden passion."
    },
    {
      "critic": "Meghan Daum",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Fifty Shades of Grey is a generic romance cynically engineered to appeal to the lowest common denominator of female fantasy."
    },
    {
      "critic": "Courtney Shea",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Much was made about how, with respectable director Sam Taylor-Johnson at the helm, Fifty Shades was going to be a legitimately good movie. It’s not, and it’s also not over-the-top enough to suggest future cult-classic status. What it is is a movie best saved for at home viewing, both because there is no compelling reason to see it on the big screen, and mostly because the pause, rewind and fast-forward controls are sure to come in handy."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Sometimes intelligent, often cuddlesome and ultimately bland."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "It’s billionaire-glossy, as much an ode to consumerism as a study in sadomasochism; intermittingly titillating, with fugitive flashes of droll; and, bondage apart, a dutifully romantic tale of an old-fashioned girl who takes a particularly roundabout route to true love."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "In the end, there’s nothing here we haven’t seen before. But there’s also nothing as agonizingly awkward as James’s prose."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The movie version of Fifty Shades is better than the book. It's still awful, but when a filmmaker starts with stupid source material, he's handcuffed."
    },
    {
      "critic": "Katie Rife",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Leads Jamie Dornan and Dakota Johnson, both of whom spend the majority of the film supposedly desperately longing for each other, have so little chemistry that it gives the sexy goings-on a rather clinical feel."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The movie isn't a complete disaster -- it's got a strong performance at its core from Dakota Johnson, and it looks sleek and modern, like a Beyonce video or a Calvin Klein commercial -- but it's an unpleasant experience with a sleazy stench that sticks in a way that E.L. James' novel doesn't."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The enormous, make-or-break things are perfectly in place, and just that is enough for a reasonably enjoyable movie. But plot problems, some comically weak dialogue, repetitious scenes and a non-ending ending keep the experience a little more earthbound than it had to be."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Fifty Shades encourages us to buy into this credulity-straining scenario because the actors go well together (casting director Francine Maisler did the heavy lifting), Dornan's steely resolve facing off nicely against Johnson's engaging feistyness as each tries to make this cross-cultural relationship work on his or her own terms."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Choosing to ignore any conventional sense of drama, progression, or resolution is, in its way, a memorable choice. But while Fifty Shades Of Grey is a memorable and society-shifting cultural event, it’s in no way a memorable movie."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Fifty Shades of Grey is nowhere near as laughable as you might have feared (or perversely hoped for): It’s elegantly made, and Dakota Johnson is so good at navigating the heroine’s emotional zigs and zags that you want to buy into the whole cobwebbed premise."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "I wouldn’t say that Taylor-Johnson has made a good movie from Fifty Shades of Grey, precisely. That’s asking too much. But she and Marcel have risen to the challenge of this bizarre cultural moment with an odd and memorable film."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The entire movie is about as sexy as a root canal."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Jamie Dornan somehow manages to render his sculpted beauty moot, which throws a major wrench in the gears for a film dependent on eroticism."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "Essentially a Harlequin Romance with pulleys, E.L. James’s novel is not exactly “Lady Chatterley’s Lover,” but the movie, directed by Sam Taylor-Johnson and written by Kelly Marcel takes itself so seriously that it almost cries out to be lampooned. I’m sure the “Saturday Night Live” crew is already on the case."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 42,
      "summary": "Directed by Sam Taylor-Johnson from Kelly Marcel's screenplay, the considerable talent behind the camera and a modicum of considerable performances yield a few undeniable guilty pleasures, but most viewers will be seeking a safe word to escape this two-hour-plus mess of half-baked excess."
    },
    {
      "critic": "Josh Kupecki",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "It's a bondage movie without much perversion, a love story without much passion, and ultimately, a film burdened with expectations it could never fulfill. It never quite hits as hard as you want it to."
    },
    {
      "critic": "Matt Maytum",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Dakota Johnson is a revelation in an adaptation that’s better than it should have been. But with the sex scenes and the drama lacking the required heat, it’s ultimately unsatisfying."
    },
    {
      "critic": "Anthony Lane",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "And there you have the problem with this film. It is gray with good taste — shade upon shade of muted naughtiness, daubed within the limits of the R rating. Think of it as the “Downton Abbey” of bondage, designed neither to menace nor to offend but purely to cosset the fatigued imagination. You get dirtier talk in most action movies, and more genitalia in a TED talk on Renaissance sculpture."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Yes, there are sex scenes in the film, quite a few. But for a movie where people are naked for a large chunk of time and play at bondage and dominance (without ever really seeming all that committed to it), it sure is boring."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Who would have imagined that a movie about sex could be so boring? That's the bottom line when it comes to Fifty Shades of Grey."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "The long-awaited, highly anticipated, much-discussed film adaptation of the first segment of E L James’ inexplicably popular \"Fifty Shades\" trilogy is a tedious exercise in dramatic wheel-spinning that doesn’t have the courage to explore the darkest elements of the characters and doesn’t have the originality to stand on its own merits."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "Clinical as a classroom lecture, it’s a limp sadomasochism primer, which explains both the runaway success of the E.L. James novel and the startling pre-opening sales stats from America’s Promise Keepers belt."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 30,
      "summary": "Fifty Shades of Grey might not be a good movie — O.K., it’s a terrible movie — but it might nonetheless be a movie that feels good to see, whether you squirm or giggle or roll your eyes or just sit still and take your punishment."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "The true audiences for Fifty Shades of Grey are gluttons for punishment — by boredom."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Sitting through the turgid and tedious S&M; melodrama that is Fifty Shades of Grey may feel like its own form of torture."
    },
    {
      "critic": "Ed Frankl",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "While the first half has a brisk, upfront approach, the final hour is gobsmackingly dull - with emphasis on the smacking."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "summary": "Ultimately, Fifty Shades Of Grey is embarrassing and depressing, especially when considering the picture as a reflection of the quality of mainstream modern romance today."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "\"Boring (Two Hours that Feel Like Two Weeks- the movie is too LOOOONG), Derivative (The Story of O and 9 1/2 Weeks both did it much better, and with a better-looking cast, if this S & M genre is your thing) and Embarrassingly Stupid, 50SOG is Dreck for Those Whose Brains Have Been Scooped Out\"",
      "total_reactions": 16,
      "user": "ShowMeTheTalent"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 40,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "I've watched this with my wife on Valentine's Day:",
      "total_reactions": 45,
      "user": "Sylar12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 20,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Boring. The movie is about sex. BDSM. It seemed like the creators only wanted to dwell upon that, but unfortunately had to create some background story, because you don't get directly to sex, you get porno if you do. So all the plot is extremely weak and its only purpose is to provide the terms for sex. Characters behave unrealisticaly, they do unreasonable and random stuff, they get horny by looking and each other lips etc.",
      "total_reactions": 23,
      "user": "romanvartanov"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 30,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I was embarrassed I forced my date to see this terrible movie.  It turned both of us off  rather than being an exciting and liberating sexual movie. I spent the rest of the day apologizing and distancing myself from the choice.",
      "total_reactions": 35,
      "user": "Darcy786"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 35,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "Don't let the popularity and advertisement of this film fool you, because this film is bad. It's not even bad - it's atrocious. With little 'erotic' behavior and a whole lot of caked over domestic violence, this movie is not only bad in the sense of story and bad acting, but teaches women to stay in abusive relationships. How this isn't seen as a sin I have no clue, but do not give in to seeing this movie.",
      "total_reactions": 41,
      "user": "Frank4Dead"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 16,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "A wanna be softcore/pinku movie that every women who read the book will definitely enjoy.",
      "total_reactions": 19,
      "user": "sirky004"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "50 Shades of Disturbing",
      "total_reactions": 18,
      "user": "FilmFan4ever"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "This movie is just TERRIBLE. For a movie about BDSM, there sure isn't much of it. Better off watching 50 minutes of Sasha Grey instead with your significant other.",
      "total_reactions": 27,
      "user": "MovieFan90"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "If you like porn, go see the movie. But if you like good screen writing, acting, and good storytelling, don't bother. Here, everything just executes to a poor level. It seems to me like they focused on putting effort on the sex scene rather then the movie. And what do you learn at the end of it all? HEY GIRLS, IT'S OK TO BE IN AN ABUSIVE RELATIONSHIP! (So yeah, I'm pretty sure this sums to a pretty bad movie)",
      "total_reactions": 19,
      "user": "TheEpicSheep"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "A lack chemistry, and poor writing and directing, hamper a lot of films.  Ultimately, what ruins Fifty Shades of Grey is how it belies its own edgy reputation by playing it safe.  It doesn’t go dark enough with Christian’s sexual addiction for fear of alienating the suburban soccer moms who made it acceptable to talk about bondage at bunco night, nor does it go sexually far enough for fear of turning its R-rating into an NC-17, a financial kiss of death.",
      "total_reactions": 19,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 33,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Fifty Shades Of Grey had already become a huge thing before it came out. Same can be said for the weird sexual book by E.L James. Okay, Jamie Dornan was good as Christian Grey and Dakota Johnson was HOT. But the movie is very odd, the sex scenes are cut down so much, that it reaches the R rated level. The story confused me, part of Christian likes Anastacia,  but part of him doesnt. The movie was LOONG, it held barely any of my attention for 2 hours and 2 minutes. FSOG is a boring movie, it is an erotica that fails on its premise. This is a dissapointing adaptation,  that fans will surely have some fun with, but not be totally satisfied.",
      "total_reactions": 47,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "It is obviously the worst piece of crap ever. Nothing else to say but this thing demands at least 150 characters so there you go. I managed to make a more interesting comment than that movie.",
      "total_reactions": 28,
      "user": "Acrofilo"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 24,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "A middle aged wifeys mid life crisis galore of their old sexual desires. I remember seeing a few parts from the book and it was terribly written! Only reason people liked it was because it was dirty. That's obviously the only reason people will want to see this. Ana is totally one dimensional and Mr Grey is actually kind of an **** and i feel like it's a cash grab due to the book selling so well to middle aged wifeys. Also, the film doesn't really seem erotic but almost glorifies sexual violence as a pleasure. I can imagine many females almost being offended by this and i as a male believe it is wrong to show as the main theme of the film almost. I know it's in other films but they never glorify in it and usually it's only a scenes worth in other films. This film is based around it. Awful.",
      "total_reactions": 38,
      "user": "oDjento"
    },
    {
      "neg_reactions": 94,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Just finished watching Fifty Shades of Grey and I gotta say... the film was beautiful. Yes, I am using the word beautiful to describe this movie. I went into the theater completely prepared to be embarrassed because of how graphic it was supposed to be, but I was extremely surprised by how I actually felt. I watched all of the scenes that were made available and thought that it all seemed a bit awkward, but it was only because there was no background music or noise. Watching the actual scenes in the movie was a whole other experience.",
      "total_reactions": 112,
      "user": "XOSabrinaShen47"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "I read a 1/4 of the book so I had an idea of what the movie entailed. To me, this was just a different version of Nine and 1/2 Weeks. I thought Anastasia was too unattractive for the part, but played a good innocent type with a dominating side to herself. Christian Grey was cast well. For the most part, the movie was weak and easy to make fun of. It did not turn me on at all. I think this is more for the young and inexperienced in life. I think it's sad when a person has to result in getting tortured to feel fulfilled. Overall, not impressed.",
      "total_reactions": 12,
      "user": "monicao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "All it has is sex no real story its a terrible movie that should not be supported IMO Don't let the popularity and advertisement of this film fool you, because this film is bad. It's not even bad - it's atrocious. With little 'erotic' behavior and a whole lot of caked over domestic violence, this movie is not only bad in the sense of story and bad acting, but teaches women to stay in abusive relationships.",
      "total_reactions": 10,
      "user": "kooltrex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "As a girl I expected this to be a nice movie. It just isn't. It's boring and with no story at all. Avoid at all cost cause only thing I wanted to tie after this movie is a noose around my neck.",
      "total_reactions": 7,
      "user": "RadiantRadmila"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Cheesy, cringe-worthy dialogue. Wooden, robotic performance by Jamie Dornan, who lacked the intensity and charisma needed to pull off the character. Dakota Johnson was ok, and had a charm to her but had no chemistry with the other lead. Awful, unsatisfying ending.",
      "total_reactions": 6,
      "user": "darkcamaro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Fifty Shades of Grey more like Fifty Shades of Abuse.",
      "total_reactions": 6,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "This is destined to be the worst movie of the year.Oh My God what is this movie,the acting is terrible the two main actors have no chemistry at all that makes you wonder who chose them.There are some okay-ish looking scenes here and there but that's it.Terrible one liners and to think that they are getting a freaking sequel to this boring ass movie.What is the point of it ? Why does it have to exist I will never understand.",
      "total_reactions": 6,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Twilight fan-fiction.. need I say more?  Twilight fan-fiction.. need I say more?  Twilight fan-fiction.. need I say more?  Twilight fan-fiction.. need I say more?",
      "total_reactions": 5,
      "user": "joshmorgan64"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "OMG. What's with all the hype with this movie??? This movie sucks ass! This movie is probably for horny teenagers or single people? Definitely not for married people.  I'm beyond disappointed. My husband and I gave up watching it after 50 minutes into the movie. ﻿",
      "total_reactions": 5,
      "user": "Lucilu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "This is a movie about nothing. I left the cinema and I've asked myself, what it is all about? There is no plot, just a guy dating a girl like we see in every movie as a subplot. This movie has only the subplot. The trailer you see is the movie itself. For those who want some hot action, sorry but there is none, just some kissing scenes and romance, and they're so poor(not even closer to those 90's soft porn). I swear, there is no sex scene and the dude does not even use all the spanking stuff he has there. When he beats her with 6 whippings(camera on dude's face, then SLAP!, then girl's face), the movie is over.",
      "total_reactions": 5,
      "user": "yurieu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Worst movie I think I've ever seen.  Boring, slow, and uneventful.  Even the \"sex\" scenes were boring, and that was that bad.  There was no chemistry, and the movie ended before anything interesting could happen.  It might have been alright if they cut an hour from the movie of useless garbage, moved it along at a much faster pace, hired some actors that could make someone believe they have some sort of feeling, and put a proper ending to the movie.",
      "total_reactions": 5,
      "user": "KingMotley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "some body say this is a love story!!!! I don't think so. love not like this!! this is sexual dreams of the author...with this movie we see fall of the Cinema... oh **** cinema is dying help...",
      "total_reactions": 5,
      "user": "ImadN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "By far the worst movie I've ever seen.  Almost walked out (and I've never done that before).  I actually liked the book.  Their relationship had humor, intelligence and she had strength that ended up \"saving\" him.  The movie captured none of that.  The acting was flat and wooden, the casting was awful.  They should have hired Ian Somerhalder.  He has the drop dead gorgeous looks of a Christian Grey and he can act.  It was so awful they'd have to pay ME to see the other 2 when they come out.",
      "total_reactions": 5,
      "user": "atlg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "This is the first movie that I have seen in a VERY long time that I would not even see through to the ending. I'm a guy so I do believe that it is more difficult for myself to get wrapped up into Mr. Grey's appeal in the movie, however, to me he was just boring, and too out of reach and unrealistic. In my opinion, Mr. Grey would have been better suited had he been more down to earth and realistic. I believe that most of the female's attraction for him was wrapped up in wealth and materialistic things rather than sexual pleasure. All in all, I was very disappointed in the film, so much that my girlfriend and I attempted watching this film together and she turned it off before I could.",
      "total_reactions": 5,
      "user": "bbmania12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "Hated this film from start to finish. Usually a film has at least some enjoyable quality in it that makes me give it some sort of pass or understand why critics give it a 46 indicating mixed or average reviews but needless to say, there was nothing enjoyable about 50 Shades of Gray. The story is a boring, sexed up rip-off of Twilight that offers nothing but you leaving it wishing you could have your 125 minutes you wasted on this glorified porn back.",
      "total_reactions": 4,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "This is exactly what you would expect from a film based on a book that was initially just a moronic Twilight fan fiction novel. The relationship makes no sense, the basis of the plot makes no sense and it glorifies physical and emotional abuse.",
      "total_reactions": 4,
      "user": "Jamessince00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "\"iF THE SAME STORY TOOK PLACE IN A MOBILE HOME IT WOULD BE AN EPISODE OF LAW AND ORDER SVU\" -Anonymous    This movie will make you lose all faith in humanity...",
      "total_reactions": 4,
      "user": "cwilliamhud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "\"50 Shades Of Grey\" may be easier to describe as \"The R-Rated Twilight\". Yes, substitute all the main characters of \"Twilight\" with the same generic pornstar-named characters and all the action with pointless BDSM (I heard even the sex scenes don't come close to the ones in the book) and you might as well have the ultimate mother-flick movie that's going to turn your valentines day upside down.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Kinky not really Fifty Shades of Grey falls flat.  The problem is that the film is pretty boring and also has a poor script.  You can definitely see the Twilight fan fiction though this film at least looks good.  D",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "If I’m being honest, I should be damning the Fifty Shades film to hell. It’s an adaption of one of the most poorly written novels in recent memory and makes the Twilight trilogy’s Stephanie Meyers—which it initially originated from, being a fan fiction—look like J.D. Salinger. It’s also one of the poorest representations of the BDSM community I’ve ever witnessed and I’d argue that it’s actually about a mentally unstable man who uses “BDSM” to stabilize his sadist mind—if I took “erotic” fan fiction seriously. But Fifty Shades of Grey just wasn’t as unwatchable as I initially predicted it to be and, to my surprise, it has entertainment value—if not in its target audience, it has laughable dialogue, cheap acting performances, and an overall sense of silliness, the way it boasts the fetish it knows nothing of, which should make it a must-see for the ones who antagonize it most. But otherwise, this isn’t a film I wouldn’t particularly remember, for better or worse, if it weren’t for the controversy, criticism and cultural criticism surrounding it. It’s merely a mediocrity dressed in clothing that might catch everyone’s attention, both good and bad, but some of us who neither treasure nor hate this franchise see how unfitting it truly is.",
      "total_reactions": 3,
      "user": "asjklasjklas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 3,
      "text": "Consider my inner goddess unsatiated with this surprisingly boring and dull adaptation of E.L.James' already terrible book. No chemistry between leads and wooden BDSM action.",
      "total_reactions": 3,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "No es novedad que un libro tan viral, con tantas ventas, al final del día realicen una pelicula sobre esta. Quiero decir que no leí el libro (ni lo leeré) pero en cuestión de adaptación y censura, supongo que tuvieron que cortar demasiadas escenas de sexo (algunas sumamente estúpidas) para que esta pelicula lograra por lo menos una clasificación \"R\" (o C en México) pero en fin, recuerdo que me senté frente a la computadora y me dije: \"veré esta pelicula sin la necesidad de buscarle contras o con la intención de criticarla\" pero esto no duro ni 10 minutos, la pelicula es un error total, en primer lugar, no me cabe en la cabeza la idea de que esta pelicula es romance y amor (el cual no lo es) pues yo solo veo una atmósfera tétrica, oscura, estúpida, repleta de Sadomasoquismo o masoquismo. ¿Desde cuando las mujeres ven a un hombre enfermo mental atractivo? no lo entiendo, ¿sera porque es millonario? ¿tiene autos de lujo? no tengo idea. Fifty Shades of Grey cuenta la historia de Anastasia, una estudiante virgen tímida que va a entrevistar a Christian Grey para un trabajo de su compañera de cuarto, la interacción de Jamie Dornan con Dakota Johnson es plana, no se sienten reales, Anastasia siempre tiene la misma cara: \"orgasmo\" \"tristeza\" \"orgasmo\" \"enojo\" \"orgasmo\".",
      "total_reactions": 3,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "BIG FAMOUS BEST SELLING BOOK... terrible money making movie. This movie was created only to make money since the book became famous because of its erotic clasification and a controversial BDSM related themes. I've read the books and after seen the movie, I was very disapointed, the MOST important thing about this book is every thought Anastasia had about Grey and BDSM, in this movie you cant get to know what is going on in her mind. You can interpret that she doesnt like the way he is or the way he treats her, but she still got into BDSM practices, and the important WHY she did it, its totally missing. To make this movie even worse, one of the things that people critizised about the book, is that BDSM is practiced by people with psychological problems, people that need help, people that are sick... and once again this movie fails into proyecting this same way of seen Grey as a sick person.",
      "total_reactions": 3,
      "user": "LadyJesse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "Here's another movie that acts like a joke on the book that it's based on. Instead of calling it Fifty Shades of Grey, let's call it Fifty Shades of Jokes on the Book.",
      "total_reactions": 3,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Dopey but never dull, 50 SHADES OF GREY is way too somber for its own good. Why are these films always so serious? Shouldn't S&M; be fun? Or mean and nasty. Something. Luckily, saw this in Spanish in Mexico City which made it far more entertaining than it should be. Dakota Johnson is pretty damn good though. Question: Why does each generation need a story like this? From STORY OF O to 9 1/2 WEEKS to 50 SOMBRAS DE GREY. WHY? Inquiring minds want to know.",
      "total_reactions": 2,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Fifty Shades of Grey should have been a guilty pleasure film. It wasn't. Instead Fifty Shades is filled with a tedious plot, completely forgettable side characters, leads that have no chemistry and lame BDSM scenes. I wasn't aroused. Nuff said.",
      "total_reactions": 1,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2015
      },
      "score": 1,
      "text": "I once was wet, but now I am dry.",
      "total_reactions": 1,
      "user": "birthday"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "test review, IGNORE IT...............................................................................................................................................",
      "total_reactions": 1,
      "user": "ISCybercoreSI"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "This was a horrible film. It was so unbelievably tedious, there was no real plot. You're basically just watching a relationship evolve, that's it, nothing else. It's pointless. I'm still wondering how this mess made it passed the pitch. The sex scenes were rubbish, it wasn't hot at all, it made me cringe more than anything. It was very hard to stay focused for such a long time. The film is about 2 hours long but I felt like I had been in the cinema for a about week. This should of just stayed as a dirty book, it doesn't work as a motion picture because most of the sex couldn't be put in, and that's literally the entire story, sex! If you're planning on watching this, don't. Don't waste your money.",
      "total_reactions": 15,
      "user": "sofialexiou"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "EN - I hated the movie has nothing to do with the history of the book . Very badly managed the film. Only sex.",
      "total_reactions": 11,
      "user": "thedogblack"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Pathetic and absurd, disgusting and gross, wrong on so many levels and yet people still go out to watch it.",
      "total_reactions": 10,
      "user": "rBose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Jamie dornan thinks he is in a catwalk . His woodenness beyond words and absolutely no chemistry with Dakota Johnson .The story smells of staleness . We have seen the same film many times for example 9,5 weeks, secretary as far as the nudity goes nine songs and lie with me were much better. Adaptation of this popular book sadly delivers a big nothing. There isn't even a good love scene for Gods sake",
      "total_reactions": 10,
      "user": "Pelen23"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Worse than the twilight film I once was forced to see, and my date and I at the time spent the entire time making fun of it then walked out halfway through",
      "total_reactions": 9,
      "user": "Erlioth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Not enough sex. not kinky enough over all not porno enough. asfdssssssssfhgdsdafhkasdgskajdgsajgfdjasfkjasbcsajkhfsahfjkasbckjasbfkbasfbaskjfbaskhfsakfhasf",
      "total_reactions": 8,
      "user": "TrickyPenguinHD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "orginally i was relieved that it didn't seem to be like the book....but there will just be a sequel that is more fetishy......honestly i thought this movie came out like a year ago......whats funny is that i was ready for a witch  burning and its nothing compared to stoker...as far as getting girls to spluge to violence/evil....",
      "total_reactions": 8,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "bumblehawk gave this movie a \"10\" and puts this in his review.",
      "total_reactions": 7,
      "user": "deathheart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "This is my first review and I have to ask: Am I the only person who thinks \"Fifty Shades of Grey\" movie seems more like a \"Pretty Woman\" remake film with a slightly dark theme? I mean: Putting aside the BDSM scenes, in many stages there was unavoidable to remember similarities (including \"bed scenes\") with the film starred by Julia Roberts and Richard Gere in the 90s. And this is precisely the main point: people went to see some erotic dark movie following the trailers and the expectation but, in return, they received a romantic tragicomedy film that, in my opinion, lacks of the conviction needed to connect the audience to the story. My note: 2 points, one of them by the staging and the other by the excellent performance of Dakota Johnson.",
      "total_reactions": 7,
      "user": "Demonaire"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Extremely tasteless, empty and vulgar, for a primitive viewer, exceptionally bad story or simply no story at all, bad screenplay, bad everything, even bad soft porno, I was driving home and thinking about “Pretty Woman”, or “Thomas Crown Affair…..",
      "total_reactions": 7,
      "user": "goodmovie_lover"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "ho ever made this **** movie is a **** animal well kinda just tell me that you are joking with me right? now one thing this is a movie that people like to watch and its in the movies and its a porn movie dude get a life!",
      "total_reactions": 13,
      "user": "thefarkness"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "I bet that if I were to ask the majority of the main demographic watching Fifty Shades of Grey this weekend what the acronym BDSM stands for, I would get a very unsatisfied and baffled answer. Low and behold, welcome to the world of popular culture and worldwide phenomenas for no damn good reason.",
      "total_reactions": 6,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "ABSOLUTE, 100% GARBAGE... NO ACTING SKILLS WHATSOEVER, EVERYTHING ABOUT THIS MOVIE SUCKS HARD..ANA PLS SUCK A BIG DICK NEXT TIME YOU **** UNTALENTED ****",
      "total_reactions": 6,
      "user": "spilchicken"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "The worst film I've ever known........................................................... ..    ........................................................",
      "total_reactions": 6,
      "user": "toomodern"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "holy. **** **** I dont even know if i can give a  negative 10 stars, but if there was a option for that then id choose it. THE RELATIONSHIP BETWEEN THE TWO IS LIKE **** 1ST AND 5TH GRADE LEVEL **** HOLY **** CRAPOLA< AND TO MAKE IT WORSE, CHRISTIAN IS JUST A **** BOY WHO INSTEAD OF THINKING WITH HIS HEAD HE THINKS THINKS WITH THE TIP OF HIS DICK. Now, there were SOME funny parts in the beginning like when she got drunk and called him and **** but she just, *SIGH* over all, there where 3 faces i made throughout this movie. A FRUSTRATED **** REALLY FACE, A HEADACHE POUNDING SIGH, AND A **** KILL ME DROOPY FACE. This was a reeeeally piece of **** but at least its better than the book. And to be honest, if that **** wanted to have a guy who would make love instead of ****, SHE SHOULD JUST GO BACK TO **** HIGH SCHOOL. sure they wanna **** you in the ass, BUT AT LEAST THEY DON'T ACT LIKE CHRISTIAN SUCK-A-DICK GREY. HE ACTS JUST LIKE A HIGHSCHOOL ****BOY BUT WORSE. GOOD LORD. Through out the whole movie i just wanted to stab him in his dick. AND ANOTHER THING, I dont **** know WHY, but honestly A **** 12 YEAR OLD GIRL CAN WRITE A BETTER FANFICTION THEN THIS **** And christian dick, SUCK MY ASS CAUSE WE ALL KNOW YOU NEVER HAD FEELINGS REALLY FOR HER UNTIL AFTER YOU ****ED HER NASTY ANOREXIC VAGINA YOU DIRTY ASS ****BOY. GOD IN HEAVEN PLEASE BURN THESE TWO PLEASE. I just-i-UGGGGGGGGHHHHHH. I have a big migraine from this movie so im almost done. But honestly to those  nasty ass old housewives who want this, YOUR **** SICK. IF YOU WANT A **** BOY RELATIONSHIP LIKE THIS< THEN IDK WHAT TO EVEN SAY TO. OH WAIT YES I DO!!!! GO **** YOURSELFS. This is **** STALKING AT ITS FINEST< AND YOU OLD LADY HOUSEWIFE ****S WANT THIS CRAP. It DISGUSTS ME. IF YOUR MARRIED AND YOU WANT THIS, WHY ARE YOU EVEN MARRIED??? YOU MIGHT AS WELL BECOME A PASSIONATE PROSTITUTE FOR A HOT ****BOY AND KILL YOURSELVES> AND IF YOUR NOT, THEN NO WONDER NO ONE WANTS YOU. YOU PUT THINGS TO THESE DUMB ASS HIGH EXPECTATIONS AND FAP TO STUPID ASS GREY-SUCK-A-DICK. EVEN ****BOYS WOULD PROB STAY AWAY FROM YOU. PROB? MORE LIKE **** DEFINITELY. Good heavens. This movie was terrible. I just watched it out of boredom thinking it was going to be funny. WELP, CONGRATES MS **** FAPPING QUEEN WHO WROTE THIS, IT WAS DEFINITALY FUNNY HAHAHAHAHAHHAHAAHAHAHsuckanassyouclintHAHAHAHAHHAHHAHAHAHAHHHAHAHAHAHA. **** this movie.",
      "total_reactions": 6,
      "user": "hetaliafff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "“Fifty Shades of Grey Review”",
      "total_reactions": 6,
      "user": "AttentiveCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "This is the worst movie I have ever seen. There is no real plot or character development it is over two hours of a girl trying to change a guy and him being totally wrong for her. This is what happens when you make a movie out of a fan fiction novel. The only reason anyone is even talking about this movie is the shock value but it isn't even interesting on that level. This movie is just banking on people going because is a taboo and don't even attempt to make it a good story. It will be embarrassing in 20 years when kids ask why this movie was such a big deal and even those who liked the movie now will have no explanation.",
      "total_reactions": 16,
      "user": "icehammer97"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "First things first: I have not read the book, assuming that I'm not the targeted audience, and since I have read marquise de Sade and other classics I've assumed it's not going to be even slightly inspiring. But having read that the film was supposed to be better, that a score of script doctors worked on improving the characters and the plot, and stupidly getting into the frenzy of how inappropriate it was supposed to be - I went to see it. Even with the lowest of expectations that you can possibly have I hardly managed to sit through all of it. It bored me to death. The main plot is a totally unrealistic, flat and uninspiring, it's worse than piece of fan fiction written by a seventeen year old. Since I don't know the original book, I must assume it's even worse, which makes me shiver with dread. I have no idea why this film is rated 18+ in the UK, and described as including strong sex scenes - it has rather innocent sex scenes - all three of them. I've seen much more hardcore stuff in lower rated films, this is just ridiculous to call this film erotic - it isn't. And don't get fooled - the only BDSM - related scenes are the toys inside the red room. That remain mostly unused.",
      "total_reactions": 10,
      "user": "lealakoma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "I've read the book. The first one. I wasn't impressed. I didn't appreciate the writing, so I wasn't expecting much from the screen version either. I'm glad, however, that I read the book before. If I hadn't, I wouldn't have a clue about what's going on besides sex and obsession. There were way too many plot holes for me, like what is Grey's Enterprises? Do they sell stocks? Do they secretly push drugs and cover themselves as an impressive building that's an entire city block? What? I still don't know, as a viewer and not a reader. From the standpoint of a film student, having techniques and all ingrained into my mind, I do give this movie a star on cinematography, because I did appreciate it. Some of the set lighting was curiously put, but it worked. I didn't like the acting. It was awkward. Not a spark of chemistry for me between Dorman and Johnson. There wasn't enough background for me either. This was really just a mess, and the sex made its money back. I didn't have much for this movie at all. Oh, but the soundtrack was really good, and excellently used.",
      "total_reactions": 5,
      "user": "GypsyFilmGirl"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Why in the world would people invest their times into a movie that was based off a terrible book, when subconsciously they know it's going to suck? The sequels are going to be terrible, and I don't have to be a damn oracle to see that future. P. S. Filthy Shades of Grey is a preferrable title. Some of the music is good though.",
      "total_reactions": 5,
      "user": "jerrynielsen"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Was ein Abschaum. Ich kann einfach diesen Film nicht empfehlen, das ist todeslangweilig und dumm! So einen Film oder eher ein Bontage Porn zu gucken, wiedert mich extrem an",
      "total_reactions": 18,
      "user": "ANNAAKATZE"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Feminists yell \"equality.\" Yet females flock to this foolish fetish feature desiring to be flogged. Not as light as Myra Breckinridge or dark as Looking for Mr. Goodbar - we end up with an interminable \"twelve years a sex slave.\" Dialogue is kept to one syllable words - and scenes simple; Anastasia gets a perfect parking space, gawks at Mr. Grey's big building, sucks on Mr. Greys pencil and so it goes. Our heroin drowning in romanticism believes she can make a gay man straight. . Biggest  downer Annie Lennox's voice over opening credits. You've come a long way baby. Not!",
      "total_reactions": 18,
      "user": "hotfromcauldron"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Having read average reviews of 'Fifty Shades of Grey' prior to seeing it - and being male - my expectations of this movie-adaptation of a book distinctly targeted at women were low. And, normally, this would give such a movie the chance to surprise me and be a bit better than expected. Unfortunately not, in the case of this particular film.",
      "total_reactions": 18,
      "user": "david23"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "An absolute bore. The only parts that captured my attention were the helicopter and sailplane bits.",
      "total_reactions": 9,
      "user": "Bshop"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "This film is an embarrassment to women, not at all what I thought it was supposed to portray from the media hype.  It's a movie about one mousey girl who falls for a sociopath billionaire in Munchausen's fashion.  Nothing to do with the girl actually enjoying sex; a massive step backwards for women getting what they want sexually from and with a partner.",
      "total_reactions": 9,
      "user": "Crocoduck"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Porn, Bad porn. Abused female porn.",
      "total_reactions": 9,
      "user": "Schmakas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "My question is how can people manage to stay through this piece of **** movie. First of all is not interesting there's nothing special about it's just about a virgin girl that finds this douchebag who has sex with her multiple times. That's pretty much it. Don't even wait for it on DVD. Fifty Shades Of Grey is the worst \"love\" story ever. Pretty much the worst movie i have ever seen. Watch the notebook as many times and when you're tired of it than that's how you would feel about this crap.",
      "total_reactions": 8,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Disgraceful, Disgusting, Despicable a negative gimmick that brainwashes young teenage girls into thinking that  violent sexual abuse is romance it motivates them to risk try killing themselves with their dickhead boyfriends, an inferior product that brainwashes the youth from coolness and innocent.",
      "total_reactions": 4,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Don't waste your time. This movie sucks. It skip the content on the original books. Wooden actors, wooden script. It is a total joke. I left the theater after 1 hour and luckily I am not alone in that decision. Stop wasting your time, no, just don't even think on watching this movie.",
      "total_reactions": 14,
      "user": "Theproeyes"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Worst movie ever! I can't even believe the user score between kingsman and 50 shades of complete rat's ass is just off by 1 point. Come on. This movie is dumbest i've ever seen to date. It not only represents woman being just an object to play and torture, women actually like this fictional character more than their \"non-raping\" husband/boyfriend/imaginary boyfriend at home.",
      "total_reactions": 17,
      "user": "vinoy"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "It humorous what passes for movies these days. Granted the book didn't leave much of anything positive to work with. The book was a fair attempt at best to write an erotic novel. It was written at the right place and right time, and fell into the right hands. The movie is nothing more than a very successful attempt to cash in on a trendy book at its high point.",
      "total_reactions": 20,
      "user": "zozo13"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "The most crazy film in the history of cinema, such as still and movie missed, it's just nonsense !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 10,
      "user": "pisarenko"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I did not read the books so I was not sure exactly what I was in for. I had heard mixed reviews of the books from people saying they were sexually liberating to it being a story of abuse. I am going with the latter if the movie is anything to go by. Christian Grey is a stalker and while I have loved Dornan in other work in this movie I found him flat, unappealing and impossible to connect with. Perhaps that is how Grey is supposed to be? I have not seen Johnson's other work but while she is an attractive young woman I found Ana a complete bore. I had really high hopes for this character hoping that she would be a strong woman who enters BDSM to further strengthen herself. Instead she is weak and I am surprised she resisted signing the contract and I am surprised she left at the end because in every other part of the movie she seems to give in to Grey's whims even when she has said she does not want to. I found it creepy that Grey did not take no for an answer and seduced her whenever she tried to resist him.",
      "total_reactions": 13,
      "user": "Medilia"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "well that was a waste of a cinema ticket. so bad it dosn't deserve a thought of review. The only reason I am even bothering to review this i to warn others away from this drivel",
      "total_reactions": 19,
      "user": "knitty"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "I could sh*t a better story. Enough said. now excuse me while i try to reach my one hundred and fifty character minimum because thats all i had to say",
      "total_reactions": 11,
      "user": "Mei208"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "After seeing The Fall, I expected a lot more from Jamie Dornan, and after Ben & Kate, I expected more from Dakota Johnson. I hadn't read the book, so I was expecting something similar to the B & D segments from Nymphomaniac - hardly. Not much happens in this movie. Go in expecting a little T & A, and that's what you'll get. Nothing more.  The better movie to see, if you're into this dominant/submissive thing, is The Secretary with James Spader and Maggie Gyllenhal.",
      "total_reactions": 16,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Ana's fear was palpable.  There is nothing romantic about watching her be scared and controlled.  This is toned down from the book.  It was awful and very triggering.",
      "total_reactions": 12,
      "user": "ThatCoolLady"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Take a chaste virgin. Done? Okey. Take a millionaire. Done? Okey. Now take a chaste virgin and do something with her. What? Something terrible. **** which has  more experiences than a porn scene. BDSM and others. And that´s all. It is red library for 40 years old mothers, which have childrens and wait for miracle with millionaire.....The only reason I saw it was promised sex.",
      "total_reactions": 21,
      "user": "Veska"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "I have not seen the Film. I am not mature enough yet. But my brother has read the first Chapter of the book. \"Poorly Written\" his verdict. So, if you want to read the book, Don't bother. Trust me.",
      "total_reactions": 11,
      "user": "TheMadGolem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "the film is good if not compared to the book, I really enjoyed it. The actors are good, Dakota represented very well Anastasia and Jamie Dornan was not the Christian that I thought for the part, but he surprised me, I hope the Fifty shades darker is better than the first.",
      "total_reactions": 2,
      "user": "heitor1931"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "I actually really enjoyed this film, doesnt quite live up to the book and what that leads you to imagine, but has its own twist on the writers words without leaning towards a porno, which lets face it a lot of people were expecting.",
      "total_reactions": 2,
      "user": "CADS87"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "the worst movie I've ever seen. it teaches men that if they have money and handsome, they can love, torture and abuse any woman that is beautiful, the movie also teaches women to be in an abusive relationship. why they represent the women as a weak person and the man as a strong person. and I can't imagine the fact that this movie was released in valentine's day, like which two people that love each other will watch this bad movie.",
      "total_reactions": 2,
      "user": "rashadegypt"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "At its best, it's the kind of movie you watch with a giddy grin. Otherwise, it's obviously bad and actually pretty tame for a movie about BDSM. Dakota Johnson is great, but Jamie Dornan gives a flat performance.",
      "total_reactions": 7,
      "user": "j1train"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "I've watched this movie and  had no good expectations about it, because always something so popular becomes in a very bad movie, the dialogues were awful, it was too slow, but i was really impressed with  dakota,  she was one of the few things that highlights of this movie",
      "total_reactions": 3,
      "user": "juank87"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Amazing, just amazing.",
      "total_reactions": 20,
      "user": "Moviemovie189"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I loved the movie. It is so true to the book and the cast is perfect just like movie. It is so well done and i can't wait to watch it again and again.",
      "total_reactions": 17,
      "user": "M"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "okay yes the intimate scenes were good and i was pretty satisfied that they followed the book close by, and i admit Johnson has portrayed Ana well despite the initial doubts i had with her but the most disappointing thing was i would say Dornan. it seemed like he didn't really know how to be like Christian when he wasn't kissing or **** and i was expecting little bit more than \"this\". If it didn't had those R rated scenes i could have mistaken it for just another movie where this girl meets rich guy.",
      "total_reactions": 24,
      "user": "BoojVhlee"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "let me start by saying i loved this film ! i went in with a real open mind i did expect the sex to be vary corny and just stupid like a porno but hands down you did a brilliant job of them when you watch the sex scenes you sorta think why isnt my sex life that good ! i loved the movie !",
      "total_reactions": 7,
      "user": "shaunac"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "I enjoyed the movie and i thought it was great. It's not a sex movie like everyone says it is as there is a love story to it. The sex scenes are not pornographic. If people enjoyed  The Wolf of Wall Street, which shows a great deal of sex scenes; then they should enjoy Fifty Shades. I did not expect the movie to be like the book and glad it wasn't, because then it would ruin the excitement of reading  the book and using your own imagination. Sam Taylor-Johnson and the actors did a great job and I'm looking forward to watching parts 2 and 3.",
      "total_reactions": 7,
      "user": "EVOT"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "People who hate this movie are really overreacting.  It's very pretty as far as visuals go.  The only part i can really criticize is that Ana seemed really manipulative. Dude was a creeper twice, sure, showed up when he shouldn't know where she was. But other than that, he was really blunt and explicit about what he wanted and needed from her. She on the other hand, says, \"Give it to me,\" and acts like a little bi*ch when he does, in fact give it to her.  Didn't read the books and i don't care about your feminist dissertation on how this is \"abuse,\" or why I'm supposed to dislike it.  Jamie Dornan is a good actor in a tough role, fighting his natural accent. Melanie Griffuths daughter...well she was okay i guess.  People are overreacting to this soooooo much.  See the movie and make up your own mind.",
      "total_reactions": 18,
      "user": "tadah2"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "When I went to see the film the weekend it came out, my expectations were limited. This is only because of the last few books made into films have not done well review wise since Hunger Games. That being said, I give this film an okay on the like and dislike meter; the dislike comes from the lack of forethought on the writers behalf. They refused to use proper transitions when cutting scene to scene; so, when someone who has read the books will wonder how the characters reached a certain point. Ex- when christen invites Ana and Kate to take photos of him for Kate's article, the script writers went from hardware store to the room where the photos were being taken. This happens throughout the whole film along with speedy line reading from Jamie Dornan, who refused to slow down and allow the audience to connect with what he was saying. There was also a lack of use with the supporting characters, their scenes were either speed up and disorienting or obsolete. The movie did not need Mia because Kate's brother Ethan was not mentioned in the film, and their was no reason for Ana's mom to be in the film either because the audience never even saw \"Ms. Robinson\" who was briefly mentioned and used way too aggressively. Furthermore, the film is 2 hours long, and the writers/directors could have used them more consciously instead of taking lines form the book and calling it a day.",
      "total_reactions": 11,
      "user": "movieminx"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "loved this film i don't understand how people can say its domestic violence and rape! has no one seen or heard of bdsm? or do u just not understand it?",
      "total_reactions": 11,
      "user": "ak33ta"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Arriving as a target to face a probable onslaught of negative reviews from cynical and jaded critics, I decided to view this media juggernaut before passing judgement myself. Not having read the book, and having absolutely no desire to do so, I was still curious as to what the story was aside from containing the odd kinky sex scene. The good news is that whilst it may be a bit of fluff, it’s slick and oddly intriguing fluff that contains two impressive performances, top notch production values and beautiful music that perfectly underscores the drama.",
      "total_reactions": 24,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I just finished watching Fifty Shades of Grey and I thought the director and actors did a good job with the film. For all the nay sayers out there, you can have your opinion, but this story is not about domestic abuse. It is far from it. 1. They both consent to the activities in the contract. 2. She wants to know the punishment to the fullest. 3. If she wanted to stop she could have used the safe words at anytime and she chose not too. The other to books explain a lot of this. I have read romantic novels and other erotica novels . Fifty shades is actually quite tame compared to others such as the series Tiffany Reiz that include Siren, The mistress, The prince, and etc. In these novels they do get marked and it is more explicit and it explains more of the BDSM world such as what collars represent and how most submissives turn to being dominants, etc.  If they explained the contract more in the movie with FSOG, you would have known that one of the hard conditions was not to mark or harm the skin in any way, no hot waxes, cutting or any of that. It dives deep into Grey and explains why he does what he does and why in general people go into the BDSM world. I don't feel abusive relationships are the same. For I have been in one and I would know. Individuals are controlling in both the difference is with BDSM you have a choice and can choose to stop, but  with the other it happens whether you want it to or not and it doesn't stop.",
      "total_reactions": 20,
      "user": "ysfex3"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I did not like Ana in the book, but I loved Dakota Johnson's interpretation of Ana. Ana was an idiot in the book. I didn't like reading her dumb thoughts. In the movie, the same actions make more sense because I'm seeing what she's feeling with her expressions. After all, What's s girl to do when her first boyfriend is more than kinky?",
      "total_reactions": 12,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Great film! The whole cinema loved it and was shouting out for more at the end. This film is really for the fans of the books and it didn't disappoint. They have to make a sequel!",
      "total_reactions": 12,
      "user": "AML12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Some time ago a friend of my former partner involved herself in writing romance novels for a mass market publishing firm. She never showed any aptitude in writing before, but it was something to do next to running the family, which pinned her to her house for the better part of the day. The writing didn't ask much imagination as the stories were pretty formulaic. Like painting by numbers she just stayed within predefined boundaries and soon enough she cranked out another cheap novelette under the name of a non-existent writer such as D. J. Barding.",
      "total_reactions": 4,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "\"Fifty Shades\"  is not a romantic movie, is the movie  the abuse of female, when sexual violence become pleasure . The action is boring, chemistry between two actors in the leading role demonstrate not implication and embarrassed (the scene in bath).  The story presented in movie is not realistic,  the scenario is very simple.   The movie relatively respect the book. The book is extremely pornographic but exist chemistry between Anastasia and Grey. The movie is not pornographic, is not erotic is boring..... I want  to see Jamie Dornan in this role and disapointed because he's not  represented in this role.",
      "total_reactions": 4,
      "user": "joy25"
    },
    {
      "neg_reactions": 31,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "It's not a masterpiece but the Movie is very good. I enjoy it and I love it. I want more!! I recommend watch the Movie. It's a love history style Danielle Steel. The performances are good but Dakota Johnson is amazing and shine.",
      "total_reactions": 41,
      "user": "Lauraazuly"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "It isn't bad at all. Actually I wasn't expecting too much, but it serves its purpose, it gives the fans a \"good adaptation\". They tried hard with the direction and the screenplay, and the result was a movie I can only watch once. Plus, the chemistry between Dornan and Johnson is non-existent.",
      "total_reactions": 17,
      "user": "sebastianglz"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "At first I was skeptical, with the choice of the male main character. Went to see a movie and Jamie Dornan was as great as Christian Grey as he could. He did amazing job, I give him 10 points. Both Dakota and Jamie had charisma work well between them, and played the scenes great, considering. I like the movie and I 'm looking forward to see the sequel.",
      "total_reactions": 17,
      "user": "Luli65"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "An awkward college grad (Dakota Johnson) is slowly seduced by a sexy young billionaire (Jamie Dornan). This is really just a cat-and-mouse romance with a BDSM twist. It's success depends on the performances of the 2 leads and the director's skill at maintaining tension in what's basically a dialogue. Surprisingly, Dornan is prettier than Johnson, but they both create characters that are complex and compelling. Director Sam Taylor-Johnson has filled the film with sexually-charged stress and attractively erotic sex scenes. It's every woman's dream of a dazzling, devoted lover (granted, with some emotional complications) and it's played out with alluring skill.",
      "total_reactions": 13,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "This movie was superb! I don't understand where everyone's angst is coming from except perhaps this movie wasn't their cup of tea. Then don't watch! I found it profoundly deep, funny and eccentric. It tested the limits and brought the audience to a much riskier place than any other movie. This is a first in it's class. No one knows about BDSM and this is bringing it some light. You don't have to be into it...but don't condemn it either. I love it. Can't wait to own it. and I might go watch it over and over. It was close to the book as it could be and yes it felt a bit rushed in the beginning but that's with any storyline brought from a novel to the big screen. Go watch it and keep your mind open ;)",
      "total_reactions": 13,
      "user": "MyshadesofGreen"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "esta historia lastimosamente  he recibido demasiada mierda encima en estos últimos meses yo me he leído los libros y puedo decir que estuvo bien representada y me dio buenas sensaciones ver como va ese romance a la pantalla grade bien toca mencionar que es algo meramente ficticio pero eso no le quita lo interesante",
      "total_reactions": 18,
      "user": "Vent141"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "I am going to say that if you didn't read the book, a lot is not going to make sense to you, since lots of exposition was cut out (for time constraints), and we don't \"hear\" the endless tellings of Ana's Inner Goddess (which at least let you in a little bit about what the hell is going on, even if it was one of the worst parts of the book).  That said, the movie was about as hokey as the book.  I went to the movie to try to understand the characters better, and their motivations still make no sense.  Even Grey, in the movie, basically tells us that that's just the way he is (with a possible transference from \"Mrs. Robinson\").  Ana I just don't get.  She is naive and curious, yes, but she just jumps full on into Grey's twisted world?!  And at the last second when he actually physically hurts her (at her request), she does a 180?  Obviously, they get back together (since there are 2 more books), so I assume we learn more about the characters,  but a story needs to be complete in a single volume.  The only reason I even gave the movie 5/10 (the book I would say is a 3) is because I wasn't totally bored, and Dakota was pretty damn good (Jamie not so much).",
      "total_reactions": 14,
      "user": "Lauranda"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "I never wanted to read the books but I saw the movie. Fifty Shades of Grey is Twilight, without the religious crap, sorry to say but the relationships in Twilight didn't feel genuine or plausible - supernatural aspects aside - and thank goodness she doesn't wait four books to put out. The film is sensual, not sexual even thought there are boobs, bushes, and **** in it. It's a BDSM love story that reeks of teenage drama and desperation but it's still fun to watch, what does that say about?",
      "total_reactions": 14,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 34,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "OMG, i just can't with all these overreaction about this movie! I'VE WATCHED, and i love it! It's for entertainment, not made for Oscar, Golden Globes or something like this... Fun fun fun!",
      "total_reactions": 43,
      "user": "Elmika90"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "There are many up in arms right now about this film. Frankly, there is room for all kinds of art. The people who hate this book, topic, ect., will never like this movie. Who will? ANYONE who loved the book, characters, plot, topics ect....ALSO, people looking for a good time & a non-gratuitous sexy movie. That's what this is. Yes, it can have some cheesy moments and I love the casting, but the lead's chemistry isn't quite right....but still....there are moments of levity, arousal, and cringing with a really good popcorn flick. MEN I urge you if your lady wants to see this....GO! You will make her happy, aroused, AND Dakota Johnson (very bravely and tastefully) is naked....a lot....I think this movie plays it a little too safe & 2 (later important) characters are left out, but overall the changes were just right. This movie can be as good as you want it to be and worth every dollar.",
      "total_reactions": 10,
      "user": "Sassypants25"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I think people who have not read the book will not be able to understand all the thing ( like when she roll her eyes etc..) the film was good, but I prefer the book. They skip a lot of important scene of the stories but I perfectly understand that it difficult to do all the thing in only 152minutes. So at this end, it was a good film but I could have been better.",
      "total_reactions": 10,
      "user": "Lova"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "50 Shades of Grey despite the very critical I think that before any review should avoid comparing it to the book. Never a movie exceeded the imagination. Technically it is very well done, photography is great, the performances are excellent and very summary captures the essence of the main drafts of the novel .They wanted to see more pornography? No need to be so explicit, strong scenes were very well worked and nudes are more emotional and real .They lead us to fully identify with the characters. It was a very good movie and look forward to continue the saga",
      "total_reactions": 10,
      "user": "Moralba2015"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Absolutely amazing!  Dakota and Jamie are perfect as Ana and Christian.  They stayed pretty true to the book.  Yes, they left quite a bit out, but that's expected with a film adaptation.  I can't wait for Fifty Shades Darker. The only reason I'm not giving it a 10 is because I felt they relied to heavily on the soundtrack to provide their emotions and thoughts where they could have added important scenes from the book.  They missed a golden opportunity to show a more playful, happy Christian by not leaving out him returning to spend the night with Ana and being late for work the next morning.  A first for the billionaire CEO.",
      "total_reactions": 10,
      "user": "50ShadesFever"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Oh. My. God. This movie is a really beautiful love story, hot and steamy and true to the book. And the chemistry between Dakota and Jamie... wow! Can't wait to watch it again!",
      "total_reactions": 16,
      "user": "LenaLT"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Not a *great* film, but not a particularly bad one either. I'd rate it as average Hollywood romantic fluff with nude scenes and totally *consensual* (simulated) sex. Do not believe those who claim that *anything* in 'Grey' is forced or non-consensual; they've either not seen the film or have an agenda.",
      "total_reactions": 11,
      "user": "gkp00co"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "The actors are really good and played their roles very well.",
      "total_reactions": 17,
      "user": "X080710"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I liked the movie.I have read the book so many times that i went into the movie expecting some thing completely different.  I think that Dakota Johnson did a fantastic job as Anastasia Steele but I was not too impressed with Jamie Dornan as Christian Grey.",
      "total_reactions": 6,
      "user": "Ainsworth02"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "**************************************************************spoiler alert*****************************************************************",
      "total_reactions": 7,
      "user": "2speedy4um8"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Excellent movie. Great actors. Sexual, interesting, keeps you on the edge. haven't read the book so didn't have any expectations. Would definitely watch it again!",
      "total_reactions": 16,
      "user": "tlag5242"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "As I sat there and the movie was ending, there were shouts of \"Oh come on, that's it?\" Obviously there were quite a few that had not read the book. Yes that is where the book end in all it's dramatic glory, but it not the end of the story. I encouraged many to read it all. Taking it for what it is, Fifty Shades is a very creative twist on the Twilight story. The movie, although a little rushed in parts, played out much like the book. Dakota Johnson filled her role with pizzazz. Jamie Dornan was pretty good. He fit the role physically, but I felt he could have done better. Jennifer Ehle and Marcia Gay were adorable at playing there respective mother roles. I wish there was a little more Mia and Ray. I did like how they put a little of Christian's background in there. It's definitely sexually charged. It is not a family movie. On that note, to those saying it is a relationship based on rape. Yes, there are moments where he gets a little violent but it was consensual and she had a safe word. When she said 'no', that was it, end of story. The 'nice to know you' and 'another cosmo' scenes were my favorite. I don't know if there are any plans to make the sequels, but I know from the responses in the theatre, it would make a lot of non-readers happy to know that it isn't the end, it gets much better. More drama in store and both Christian and Ana have some growing to do. Overall, the movie was as I expected. No more.",
      "total_reactions": 8,
      "user": "mkbrenfroe"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "The movie was able to capitalize on the book with grace and some class. The book contained odd sex scenes and some humiliating diction, while the book centered on the foggy plot line. There is a story in the 50 shades trilogy and the first book is definitely the weakest.  The movie tries to show the love story that is present and it does so without the \"dirtiness.\" The movie is for fans based off a beloved book.",
      "total_reactions": 8,
      "user": "tfriesen14"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "It was great, loved it, Jamie and Dakota were completely fantastic. It was a great book to film adaptation, and i cannot wait for Fifty Shades Darker.",
      "total_reactions": 9,
      "user": "lovaticmonster9"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I started to read book 2 years ago but i could never finish the book due to lack of time. as well i read the german version.. but what I like from the film is the actor and the actress are all both new faces, and it brings a lot of imagination to audience.",
      "total_reactions": 9,
      "user": "vegifish"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Okay where do I start?! this movie is brilliant! I loved EVERY moment. A lot of people have given the movie a really bad review with a low rating but I rate this movie a 10 out of 10!. I do believe that the users who left rubbish reviews expected more detail but they need to understand there is a difference between a book and a movie. Books contain a lot more detail than movies! I particularly think that people have left rubbish reviews because the dirty scenes were not shown in a lot of detail but WHAT DO YOU PEOPLE WANT???! if you want to see more sex then you are better off sitting at home on PORN-HUB. Christian was absolutely gorgeous! and so was Anastasia! the acting was brilliant, the movie was exactly like the book so I don't see why people are  complaining, YOU WATCHED WHAT YOU READ, so what is the difference!? people expect too much.",
      "total_reactions": 9,
      "user": "naimah"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "There is only so much you can put into a movie. I felt that they hit all of the main points. Some felt that there was a lack of chemistry, but there needs to be an awkwardness between Christian and Ana. They are opposites in many ways and yet they are attracted to each other. She shows the hope and naivety that he lacks. He, in many ways, is like a newborn. He has so many firsts with her...more actually. There is something beautiful about this story (when you go through all 3 books). I'm a fan of Dornan and Johnson. I loved that you could hear Melanie's giggle in Dakota's giggle. So many similarities.",
      "total_reactions": 10,
      "user": "mjlc2001"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "The movie is perfect !!! The first time I saw In Russian translation and the translation is awful. Then I watched the original one!!! It is all emotions and sensations !!! Jamie and Dakota have perfect chemistry !!! I would like to see Christian more warm in sex scenes, but it does not matter because the movie is just amazing !!! I like the way Dakota talks!!! Both Jamie and Dakota are hot and sexy, and their voices either !!! They are just made up for this roles!!! Since the first time I saw the trailer, I said Dakota is perfect Ana !!!! After I have watched the movie my expectations are really satisfied !!! Jamie also approved that he is a great actor and can create complex characters !!! Actually I am speechless !!! I am ao amazed that words are not enough to describe my feelings!!! I do not understand bad critics, it seemed that they are jealous of the movie success !!! I agreee that the book is not written in good English , but the storyline, the characters and all make me forget about the language !!!! Moreover, there is no women abuse or rape !!! Christian never does things that Ana does not approve or says NO. Even at the end of the first book, when Ana leaves Christian, he wants to get into the elevator but Ana says NO and Christian does not move!!! In some points the movie is much more better than the book , because  the movie shows bold and brave Ana, and I like that Ana does not cry too much in the movie !!!! The movie creates the right atmosphere and you go deep into the story !!! I am in love with the Fifty shades of Grey book and movie !!! I am looking forward for Fifty shades Darker !!!",
      "total_reactions": 12,
      "user": "Objectivecriti"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Christian Grey would have been an easier man to understand if he'd been a conventional hero, fighting for his beliefs. The fact that he was flawed - a drinker, a gambler, a womanizer, driven by greed and a lust for high living - makes his life an enigma.",
      "total_reactions": 13,
      "user": "bumblehawk"
    },
    {
      "neg_reactions": 25,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Hot damn... this movie. It is hot and steamy and I could relate to it. Good thing my mom decided not to watch it with me because this is definitely meant to be watched alone or with your partner. The soundtrack was amazing and added to the intensity of it all. I have to read the books now to see what really went down and what's next. I will be looking forward to watching the sequels.",
      "total_reactions": 27,
      "user": "Catdragon"
    },
    {
      "neg_reactions": 16,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Want to make a lot of money? Write a book that lots of people hate and lots of people enjoy. Then make a movie the same way. Tap into an age old female fantasy of being submissive, total trust to a man and giving up control and being taken care of.",
      "total_reactions": 17,
      "user": "Proteus"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "The movie was good but not great. And here is why. If you haven't read",
      "total_reactions": 18,
      "user": "JILLSS"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Sadomasochism is not violence you idiot, go search. A submissive has all the control. She or he sets their limits. A sub tells a dom what they will allow done. A sub says when to stop. And the movie is not about Stalk, surprise is not ilegal, and Ana LOVE all that he does, she never said stop follow me. and it is a single love story, it is not moral lesson, they do right, they do wrong, they are human. It is a UNIQUE Story. Ana is testing her limits. 50 shades isn't a porno. It depicts one man's insecurity and need for control. It shows an inexperienced girl suddenly experiencing all these sensations and emotions. It shows one couple's epic love story, their pain, their lust, and their need for each other. They love each other, and their slowly admitting that to one another. If you can't see that past the physical attraction sex scenes, then you're too young to be reading this series in the first place.",
      "total_reactions": 7,
      "user": "mateusapresenta"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "It really wasn't as bad as some are saying.  For reference I am a guy who dislikes chick flicks, but I like indie artsy types of films, so I guess my 6/10 makes sense.  Also, I did not read the books and you don't need to have read them to watch or understand or even enjoy the film.  I enjoyed some parts of it, some parts were a little boring, but honestly, most of the time Mr. Grey and the girl were on screen together it was pretty interesting and captured my attention.  It was not a bad film.",
      "total_reactions": 5,
      "user": "3ebfan511"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I've seen alot of porn & less drama, but... awh hell... In theaters (after they left with their wife/girlfriend). People got f--king spooked & (awh hell whatever word that it fit to say). They going home and do their dirty stuff (don't bother asking me :( ) Honestly, It's not a perfect valentine movies, but full of people wanna watch Dakota 8008S when Dornan f--ed her, & smack her in the a--hole. But awh hell... :(",
      "total_reactions": 2,
      "user": "SeanGamerDays"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "It is such a huge thing everyone made it out to be. But indeed, it is a porno that just got lucky, with a near blink of a story and somewhat acceptable performances.",
      "total_reactions": 6,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "Not much to say about this movie, all hype no substance. The movie dragged on, had a crappy ending and the scenes inbetween were forgettable, like watching the same scenes over and over again.",
      "total_reactions": 1,
      "user": "SwiftReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Yes, we have here a poorly developed story, with some dialogues that are ridiculous and supporting characters who are totally wasted. Jamie Dornan has the phisicality that Grey demanded but he doesn't have the attitude this role required. On the other hand, Johnson made an adaptation that has a stunning soundtrack, great sex scenes and Dakota gives a perfect performance as Anastasia. For fans this will be awesome and even for people who didn't read read the books this can be an interesting entertainment. It's the classical love story we all know to be honest.",
      "total_reactions": 1,
      "user": "danipp"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "After falling in love with the Fifty Shades of Grey Trilogy, not to mention absolutely obsessed with Christian Grey and Anastasia Steel's relationship, when I heard there was a movie coming out, I had mixed feelings. E.J. James does not get enough credit for her work and like me and most other public readers of Fifty Shades, myself and others are often immediately judged. I will state that E.J. James revolutionized writing as well as giving the women an option to enjoy \"porn\" instead of watching the nasty, totally unrealistic scenes on our computers.  Therefore with all this in mind, I was excited for the movie, I watched interviews and the trailer about a billion times, I couldn't wait. Now, my boyfriend being the boyfriend he is he said, \"absolutely not\"  when I asked him to go see it on opening night with me, so I pushed it off until now. My person opinion is... This book is freaking hard to make into a movie and I give the directors, play writers etc... credit for giving it their best shot, but like myself and others, we all let our imaginations run wild while reading this book therefore this movie maybe appealed to someones imagination... but not mine and my roommates in particular. I thought this movie would appeal more to men than women, by this I mean I'm not trying to see boobs every other scene, but I do understand it is part of Christian Grey's \"fifty shades.\" But this is a female fantasy/ book therefore the movie should appeal to us women! Another point, this movie moved WAY too fast! I get it you need to fit a 500 page book into a two hour movie but holy cow did they miss the connection making between Christian and Ana! I don't want to harp on this movie because like I said, it is near to impossible to appeal to everyone's imaginations. My last point would be, if you read the books and enjoy a good movie, go to the movie anyways because Dakota Johnson and Jamie Dornan do a fantastic job on what will probably be the hardest role they will ever play. All in all, if you haven't read the books, read them. If you haven't seen the movie and have the opportunity, like me, to go to $5 movie night take the opportunity to go see it with your girlfriends and go home to your hubbies and see what fifty shades you can come up with!",
      "total_reactions": 3,
      "user": "brianna19"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I loved the movie, i love the cast, there were several parts of the book missed out but they can't include everything!!. It is so well done and i can't wait to watch the sequels.",
      "total_reactions": 4,
      "user": "schulme"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I have not read the book but really enjoyed the film. It has a bit of everything; glamour, humour and sex. It was short and easy to watch. The cast is understated but HOT which made it all the better for me. I am looking forward to seeing the next part. Highly recommended!",
      "total_reactions": 3,
      "user": "Samirbaijal"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "This movie blows my mind. First of all, reading the book I could not pass the first chapter. English is not my native language but I went to college and I appreciate sophisticated vocabulary . I could not believe the poor language in the book. I thought a 12 years old have written it so I was not able to read it. The only reason why I went to the theater was that I loved both trailers and the soundtrack and of course all the talking attached to the movie. I went with my girlfriends because my bf totally refused to come with me. To du stride the movie had something magical attached to it. Till this day I can't say what it was because I know this production does not qualify fior an Oscar but there is totally something magical to it. I hardly ever watch the movie fit a second time but I can't wait till it's available on dvd. I want to mention that I was very upset that the movie was qualified as soft porn.  Whoever calls it that has no idea what they are talking about. Sex scenes are very tasteful and you don't get see too much of private parts in the movie. It has never been close to a any kind of porn. Also the sex scenes are very brief and not the major plot in the movie. I know for some parts the movie doesn't make sense and makes you wonder what's really going on but it's very aintriguing and pleasant to watch. The music is outstanding and complements the story very well. Overall if you are a romantic female you might love the movie as I do, but if you are a guy expecting sine action you might get really disappointed. Another thing, anyone saying this movie is promoting domestic abuse is out of their mind because everything in the movie is consensual and presented in a really fascinating way. My favorite movie in a while, thumbs up!",
      "total_reactions": 1,
      "user": "Annaca2000"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Desde a estréia do filme baseado no livro Cinquenta Tons de Cinza, que já bateu recorde de bilheteria, tenho acompanhado a reação dos fãs, afinal de contas são estes que interessa agradar, não haters, e muito menos críticos especializados que sempre detonaram a trilogia escrita sem o menor respeito.",
      "total_reactions": 3,
      "user": "levyfidelix"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Fan LOVED the film, what more matter? Critics? Haters? NO! They don't represent all the success that movie already is. Everybody that make a movie needs fans and people that enjoy what you do, and about this, book and movie has.",
      "total_reactions": 3,
      "user": "emilionovinh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "I wouldn't say horrible,cos I'm a big fan of the book and the story,but I expected something better.They missed out the most important thing from the movie. The passion.The book is full with passion,that's why its good.I felt the movie dry and empty.I'm quite disappointed.",
      "total_reactions": 2,
      "user": "Andi-H"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "My thoughts going into the movie after reading the books was that there is no way they would be able to do the sex scenes to the strength of the book, (lets face it books are always better) and they didnt, but it wasnt as weak as I thought it would be. I thought it was a great movie, well done, something we havent seen before, it was thrilling and mysterious! I cant wait for the rest of the series!",
      "total_reactions": 1,
      "user": "xo_MeaganLee_ox"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "I went to the movies last night waiting for a bad movie, and then went home surprised it was better than I expected. This isn't a remarkable movie, but it's fun enough. Dakota is really sexy and she portrayed the artsy nerd really well. Dornan was good, but less convincing than her. I think Jonathan Rhys Myers, for instance, would suit better for job. Anyway, it's a good movie. It's more romance than pure sex.",
      "total_reactions": 1,
      "user": "Zamba"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "The movie you have to know the importance of time and money.",
      "total_reactions": 1,
      "user": "sofarman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "The movie was so bad and confusing. I haven't read the book before but by watching the movie, that is not appealing and not what I've expected before. Heard people say that the books are more interesting so I bought the trilogy.",
      "total_reactions": 1,
      "user": "tiffanylaww"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Sonic Adventure 2 features the world-famous blue hedgehog in a hyper-fast adventure where players can either save the world or conquer it in an action-packed showdown between Hero and Dark characters! You play as Sonic, Tails, or Knuckles and attempt to save the world -- or play as Shadow, Dr. Robotnik, or Rouge and triumph over all who stand in your way. Mistaken for a villain and kidnapped by a military squad, Sonic must escape his captors and discover who is responsible for all his trouble. Jump into the action and check out Sonic's new moves as he grinds rails, swings from poles, and somersaults past the bad guys. Get ready for Sonic action across more than 150 missions spread over 30-plus frenetic, action-packed stages.",
      "total_reactions": 2,
      "user": "BillClinton"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "2 out of 10.................................................",
      "total_reactions": 1,
      "user": "ZawMine"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "I have been waiting for this movie since the book went out. A sexy movie and unexpectedly delightful and I find it better than the book.",
      "total_reactions": 2,
      "user": "alexa417"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Casting of Jamie Dornan & Dakota Johnson is a",
      "total_reactions": 2,
      "user": "Boxergirl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Loved it!!!  Yes, It is a faerie tale and it is about abuse.",
      "total_reactions": 2,
      "user": "Boue24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "Fifty shades of Grey tries to be as good as the book, but the mixed critics of the literal meaning makes this film worse. Including the gloomy audiences, stupid direction and a terrible story-making, and that's what this film made win the Golden Raspberry Award for the worst movie of the year.",
      "total_reactions": 1,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "A movie that thrives mostly on Dakota Johnson's performance as the central character \"Anastassia\".  I enjoyed the chemistry between her and the stone-cold Christian Grey, played by Jamie Dornan, and it was really the only reason I could sit through 2+ hrs. of this adult version of Twilight.  While the movie isn't that good at all, the relationship assessments were intriguing.  The realization that relationships require trust to be built and maintained, and that anyone can have a dark sexual fantasy or skeleton in their closet that is unknown to the world is always fascinating and very real.  Learning to release the shame and risk being vulnerable to another person scares the crap out of so many people in the world, but properly-placed trust offers incredible rewards, and I think that Christian Grey is on his way to learning that.  The problem I have with that is there's two more books to address that, and I'm curious how anyone can muster up enough on-screen time to make any audience feel like they should show up.  The first movie coasted on anticipation and controversy.  A second and third film wouldn't benefit from that luxury.  Perhaps Focus Features and the screen-adaptation can work to remedy any literary faults and find ways to charge the 50 Shades story with more interest, instead of relying solely on the sexual fantasies of women to find success.",
      "total_reactions": 0,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Two words......SEVERELY UNDERWHELMING. The plot and the concept were good (there is a concept, you must analyze and understand), but it totally failed to deliver the excitement and the adrenaline an erotic romantic should possess. Aside from that, it also failed to deliver the technical excellence. The scenes that must be highlighted were cut too short, the dialogue was bad, the acting of the supporting cast was bad, and a lot more.  It all gone wrong, which is such a shame",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Based on a book that reads as though it was written by a sex starved teenager who failed English, the film didn't have a lot to live up to. The fact that it is even passably watchable is in no small part to Taylor-Wood's direction and a half decent performance from Johnson, but the rest of this debacle is almost unwatchable, unless you want to watch it ironically and view it as a comedy. Possibly the least sexy film about sex ever made.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "\"Fifty Shades of Grey\" is nothing more than a joke of a film but if you put aside ridiculous characters and  unrealistic scenarios, it isn't that bad of a film. The film lacks passion, love and sex, not a good combo if the name of the movie is \"Fifty Shades of Grey\".",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Haven't wanted to walk out on a film since \"Mighty Morphin Power Rangers\". I couldn't do that at this film since I was on a date, thus compounding my suffering. No story, no character development, no resolution, and grade school dialog make this the loser film of the year. Before I even said a thing after the ending, my date apologized for dragging me out to this atrocity.",
      "total_reactions": 0,
      "user": "tr1cky1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "To little surprise, Fifty Shades managed to better than the book, but that's only a very flimsy consolation, given the extreme poorness of the source material. Everything else is rubbish from the acting to the screenplay. Casting as well, since pretty much nobody (girls included) thought Jamie Dornan to be a good choice.  It only sometimes gets saved by some beautiful shots of Seattle, which suit better an ad than a movie.",
      "total_reactions": 0,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "This perverted sadist guy is nothing but revolting, and this is coming from someone who likes kinky stuff... I mean, what's hot about torturing a woman that wants you to make love to her? The girl does everything in her power to have a normal relationship with him, but he proves himself to be nothing short of a full blown psychopath. The realistic ending of her just leaving him surprised me, so I'm giving it a 1... Oh, spoilers, lol... Not like it matters. I feel dirty after watching it, and not in a good way.",
      "total_reactions": 0,
      "user": "LXQUICKJUSTICE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "A useless attempt to raise up another imbecile badly-made, two-part finale series book adaptation. The performances by Johnson and Dorian look forced therefore crappy. The sequence of events was intrepidly stupid. The Script? By far, one of the worsely written scripts I have seen in my life. The dialogue was cheesy and full of animalistic clichés.",
      "total_reactions": 0,
      "user": "joeyrios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2015
      },
      "score": 4,
      "text": "Não é tão ruim como dizem, mas  também nem chega a ser um bom filme... Dakota Johnson é encantadora Jamie Dornan é razoavelmente bom, o filme possui uma ótima trilha sonora, é um mediano-bom filme de romance tem umas partes bacanas,e também tem um dos piores e mais patéticos finais da história do cinema...",
      "total_reactions": 0,
      "user": "LoRevisor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I was pleasantly surprised with this movie. I read a bunch of reviews on it from other users and pro critics that gave the movie a bad rap, but again, I was pleasantly surprised. Now hold it before you start flaming me and **** because that's what the internet does just hear me out.",
      "total_reactions": 0,
      "user": "Voice0fReason"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Not worth the hype it was like watching a lifetime flick. Brokeback was way more powerful in all areas of grit controversy and hardcore sex and drama. This is a commercial for rich prick travel guide. I actually thought I might have been teleported to Saudi Arabia for this much censorship in a marketed R-rated film I thought. Wow cringe worthy the amount of censorship in this day.  Also bad thy dead eyes of Christian Grey and what's her face.",
      "total_reactions": 0,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "As guilty as I feel to admit this, I did read the book prior to seeing this (curiosity and the hype got the better of me.) By then, I felt obligated to see this simply because I'd read the book. All I can really say on this one is that it was a HUGE waste of time! The film's R-rating pretty much meant that it would have to be tamed way down compared to the book. Sure enough, it was, and the final result isn't that great. The acting was far worse than I originally anticipated. Jamie Dornan needs to pick a better speech coach next time, because I could easily tell the guy's from Ireland since the accent kept slipping through the entire time he talked. Dakota Johnson didn't do much better, as I found myself laughing to myself and the way she delivered her lines and dialogue in some parts. Overall, in the end, all this film really was is a failed attempt to adapt an erotic novel into a film that can only get so erotic due to its R-rating. In addition to that, it's just another reminder of BDSM relationships (and this film completely glorifies it!)",
      "total_reactions": 0,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "Of course this movie is ridiculous, everyone gets that. Most romance novels/movies at least try to have a pretense of reality, e.g. down on his luck but sexy cowboy, workoholic tv producer, etc, but not this one. The plot/fantasy is basically right out of a high school girl's diary: a helicopter flying, piano playing, extremely attractive, 27-year-old billionaire picks you out of a crowd for no reason and obsesses over you. It's more over the top than most romance flicks, but that's to be expected.",
      "total_reactions": 0,
      "user": "TheWaffle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "To be honest, I haven't read the book. So as you can see, the following will be just a vision created by what can be extracted from the movie itself: I gave it a mixed score because I considered it that way, such as if you have 0.5 and want to approximate it and the result gets to be 1. The actors are good, just that; they show failures and tend to overact, but, due to the film characteristics, that's just the minimal necessity for it. Now, what's important: the movie itself. The proposal its interesting and the exposure given to the viewers its creative; you don't usually see BDSM practice in movies, and even more, to be \"socially\" accepted. But that's not the principal thematic about the movie, the problem is that it gets to show hypocrisy. We have this \"relationship\" between Anastasia and Christian where he wants her to fit his profile and she tries to adapt to it, but it never gets fulfilled; there is always some sort of resistance between both, and mostly coming from Steele (which I find actually pretty funny), where she always plays with him, due to the intention from his to be \"dominant over the submissive\" but her intention is not to give in easily; that's the biggest problem and inconvenient coming from the film. They sell the movie as the \"romantic story\" which is in the dreams of every teenager fan of the book: Christian Grey plays with Anastasia Steele in order to obtain pleasure and satisfaction, but as the end of the movie exposes, if you retire the satisfaction from the act, then this one becomes hollow*, such as the movie.",
      "total_reactions": 0,
      "user": "jppl1999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "The film actually started out well (the actress playing Anastasia grew on me), and the photography is good, but eventually it became rather boring.  Why wasn't Anastasia attracted to the nice artist, Jose?  Mr. Grey needs to have a degree of sexual magnetism for the film to work - it is lacking.  Since there isn't much chemistry between the main characters, I only concluded that Anastasia liked Mr. Grey for his money, and Mr. Grey liked Anastasia for her innocence.  But neither of them is really compelling.  Fortunately, I didn't have to pay to see this film.",
      "total_reactions": 0,
      "user": "Beecee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Loved it but Could have been 20 minutes shorter as it was a little slow in part.  I assume that was to make us feel like the female longing for more.  I think the bad reviews are from people who dont understand the people drawn to that life style.  Lisa Wilkinson proves her ignorance on understanding the character Dakota plays.  And the lead male is not a jerk... he is a product of abuse grooming and Lisa doesn't even see that... How rude and ignorant can people be.   Human behaviour is fascinating study.  Well done!",
      "total_reactions": 0,
      "user": "Brahva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "All I'm saying is that I'm disappointed film. I was expecting something else entirely I, don't know why but I had a much better impression for this movie.",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "It's ok. The acting is ok, the plot is ok, everything is ok. Nothing special. I would watch it a second time but not a third. All the advertisement and hype for an ok movie. Why was I expecting that...",
      "total_reactions": 0,
      "user": "TheRoyalMelon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "the writing was so bad and the acting seemed so forced and exaggerated that this could have easily passed as a comedy. Seriously, me and my friends were laughing the entire time. Ending was garbage though. If your looking for a good romance movie, this isn't it. On the other hand, if you are looking for a dirty comedy, this might be right up your ally",
      "total_reactions": 0,
      "user": "horrorreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2015
      },
      "score": 4,
      "text": "I found the first 45 minutes of this film to be intriguing. It's very flashy and the actors are pretty...but then it becomes more intimate and gets cheesy and silly and just sort of boring. I suppose that straight housewives enjoy the mild kinkiness, but really it just sort of comes across as an R rated made for TV movie. Of course I say this as a gay man who really doesn't appreciate the heterosexuality of it all. I did like the soundtrack though.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "So, I don't know what kind of dimwitted mind thought this was a steamy film, or even a romantic film for grown-ups. \"Fifty Shades of Grey\" is and feels like the byproduct of a corporative contract. If the book it's based on is just laughably pedestrian and dull, the film equivalent nearly rivals it in monotony. There's no emotion, no passion, no life; like Christian Grey, it's all cold, calculated and mechanic. Want to watch a real steamy film about sex for grown-ups? Please go and watch Stanley Kubrick's 'Eyes Wide Shut' and avoid this infantile, seems-to-be-made-for-promiscuous-teenage-girls drivel at all costs. And, the 'strong sexual content' that the MPAA rating suggests is a joke.",
      "total_reactions": 0,
      "user": "ednunez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Terrible, just terrible. I tried to give it a chance, but honestly, I thought the book was horrible, so how could I expect much more from the movie version? Dakota Johnson wasn't half bad as Ana, but Jamie Dornan was terrible and had no expression on his face throughout the movie. The music was cheesy and the dialogue laughable. The sex was really clinical and the leads had zero chemistry. There was no passion, no spark, nothing. Suffice it to say after this bad experience I'm not going to see the sequel.",
      "total_reactions": 0,
      "user": "DasCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "What a **** is this?! **** at all topics! Who likes that? Only silly people. Guess, have i watched this? No!",
      "total_reactions": 0,
      "user": "Guerrino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Stupid, with amazingly dull script and boring story. If you're into bondage, you will enjoy some internet sites much more than this wannabe erotic drama. Really not worth anyone's time. 1/10",
      "total_reactions": 0,
      "user": "BackstabberDC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "A fake gay man who is living his sick sexual fantasies.",
      "total_reactions": 0,
      "user": "markvantpark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "1000000000000000000000000000 with love me like you do in your soundtrack. i'm addicted in this music, is perfect, and the film is cool, only ...............",
      "total_reactions": 0,
      "user": "LuizFelipe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "I watched 50 Shades of Grey last night. I gave it 2 stars out of 5! Yes, I read the book, so I think that played into my underwhelming experience, but it was REALLY bad.",
      "total_reactions": 0,
      "user": "tashelizy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "As I am not the target audience for fifty shades of grey nor did I read any of the books, I am married to someone who did care to read the books and has now seen the film.   As I stated before I did not read the books so I have the added benefit of judging this as just a film rather than judging it as an adaptation.",
      "total_reactions": 0,
      "user": "Thefilmhead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "maybe if I do not read the book, I might like this movie but in my opinion this is a romantic story with maybe two 'hard' moments and don't contain lots of episodes from the book. I like watching romantic movies but this is not what I expected.  I give three because Ana's jokes were funny and Jamie is really hot guy but after reading a book it DID NOT rapture me.",
      "total_reactions": 0,
      "user": "browniebelle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "To address a lot of the reviews stating this is glossed over domestic abuse, I have been in a relationship that was abusive to the point of having my bones broken and being emotionally and mentally terrorized.  This movie is NOTHING like an abusive relationship and doesn't in any way \"teach\" women to stay in abusive relationships.  It does however teach you to play with your partner safely, sanely and consensually.",
      "total_reactions": 0,
      "user": "StormmFire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "After all the bad reviews I expected thw worst, I think the movie is actually really good. the actors, the music and the plot was clear. wowwwww I just read that grey's wife is angry heeeheeee",
      "total_reactions": 0,
      "user": "mrLaa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I just love this movie, ans the actors! Me encanto la pelicula, ya quiero ver la segunda parte. Buenas actuaciones, mostraron lo mas importante del libro.",
      "total_reactions": 0,
      "user": "vanemanjarres"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I love this movie! For the past two days i watched it 3 times.. cant wait to see next part. Well done Sam Taylor-Johnson and of course Dakota Johnson and Jamie Dornan, - it was such a pleasure to watch how they ask!",
      "total_reactions": 0,
      "user": "nameka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I almost did not want to watch the movie because I know it is almost impossible to capture the essence of this or any other book on film.  I did, however, enjoy the movie.  I think the actors portrayed the characters well and told the love story that the book is about....not the sex.  When reading the book, the imagination is free to run wild and yes it is much more erotic than the film.  I hated the ending as I hated the ending to the first book because it just makes you long for more.... So I immediately started to reread the 2nd book. Can't wait for the sequel.",
      "total_reactions": 0,
      "user": "stellamarie82"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Sinceramente , filme completamente sem nexo , muitas pessoas dizendo sobre as cenas de nudez e explicita , mas nada supre a filma de roteirismo desse filme , o que foi esse final ? pelo amor de Deus , vamos melhorar isso , dou 5 porque algumas partes ficaram normalizadas e dentro do contexto. Adeus e comprem 1989 no itunes",
      "total_reactions": 0,
      "user": "Gabriel2205"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "I really enjoyed this movie. It made sense to me and I saw a beautiful love story as well as a very trouble man and the woman that loved him.  I saw how people think differently about the topic of the movie. Some see this movie as brutal I saw it more as a trouble person and a love story.",
      "total_reactions": 0,
      "user": "senseimary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "No problem that I have with the abuse or whatever you call it cuz I don't.. But what's up with the end of the movie?! Seriously, after all these discoveries and figuring what Grey's life is like, Ana has JUST felt upset ?!? Or she has only lost appetite ?",
      "total_reactions": 0,
      "user": "Aur"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Not as bas as I thought and yet not as good as promoted. Though the subjet of the movie and books deals with a complex theme of Master-servant relationship which is not usually comprehended by most therefore people are misleaded to a wrong and superficial analysis of the movie, misinterpreting the whole thing.",
      "total_reactions": 0,
      "user": "Teijo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "I am surprised I actually loved this movie.  I thought the characters were great and the actors portrayed and connected with their characters as portrayed in the book.  I feel the hype in the media and all the negativity is ridiculous.  People are being way to critical.  It is fiction. It is entertainment.  I hope there are the sequels as in the trilogy.  It is a bit unnerving that some key scenes were left out and maybe the negative critics should read the book and connect the dots.",
      "total_reactions": 0,
      "user": "tinamc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Watched it sometime ago it appeared to me as a nice movie at first but soon came the reality and all my focus moved on the acting and it was disappointing on the side of  character \"Christian Grey\" played by \"Jamie Dornan\" while \"Dakota Johnson\" who played the character of \"Anastasia Steele\"  quite okay overall because of the explicit scenes the movie was scored on the other hand there were a few moments worth remembering in the movie, at the end it appeared to me as waste of time,  music given by various artists in the movie is all i remember.",
      "total_reactions": 0,
      "user": "AmmanMalik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "Dumb! Firstly, The actors were not right for the role. Secondly, the dialogue could have been better. And thirdly, the entire movie had a choppy feeling with no real chemistry or emotion between the characters. I could go on, but on a short note: 2 thumbs down!! Very disappointed.",
      "total_reactions": 0,
      "user": "holliebrewton"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "I'm giving this a 10 in hopes to counteract the negative response it has gotten. I respect opinions but in response to comments like, 'is this what women get off to,' I have to object. I didn't 'get off' to this movie; I enjoyed the romance that was unusually portrayed because of Christian's idea of relationships. I didn't read the first book but after watching to movie and seeing the ending, I bought all three books and just finished the second. While the books are not intellectual, it's a good story, not great but not horrible. I loved the movie and I think Dakota Johnson and Jamie Dornan did very well at bringing these characters to life, could not imagine anyone else playing the part better. I cannot wait until the Fifty Shades Darker.",
      "total_reactions": 0,
      "user": "castlechick87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "this movie doesn't justify the beautiful detailed book .it really pissed me off watching the movie after reading the book .was really disappointing to know that so many important parts of the book should've been included . the only nice  thing in the movie would be the amazing sound tracks",
      "total_reactions": 0,
      "user": "Assoya"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Not the blockbluster / shocking movie everyone was assuming it would be, but still a reasonable one.",
      "total_reactions": 0,
      "user": "bsousapt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "This movie is beautiful. I feel fifty shades is a film that expresses the love between two characters through BDSM. BDSM is an art and fifty shades captures this very well. This film made my girlfriend extremely wet which meant it was much easier to do the sex. 10/10 would bang again-IGN",
      "total_reactions": 0,
      "user": "twilightlover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "Should have been made as an R rated film. This is a very good adaption of the novel, with beautiful cinematography and great performances from Johnson and Dornan, given that they manage to actually deliver the repugnant dialogue without breaking character or dissolving into peals of laughter. But don't misunderstand me, a good adaptaion of absolute tripe does not a good film make. The sex scenes really needed the addition of an R rating, and the score is artfully utilised to undermine the decidedly disturbed subtext here. However, on that, abusers don't tend to begin a relationship with the requirement of explicit consent, nor do they cease their behaviour when told no, nor do they prioritise female pleasure as part of their lexicon. I'd suggest that the ire caused here is the congitive dissonance of viewers finding the (inaccurate) BDSM depicted erotic, in spite of despising the clear dysfunction of the relationship and the lack of apparent power afforded the protagonist. I'd point out that in this aspect, this film is no different to the vast majority of 'romantic' tales, Tess of the D'Urberville's and Twilight included. Not as horrific as I was expecting, but then, non-existent expectations allow for small surprises. 4.26/10",
      "total_reactions": 0,
      "user": "Jess_Hill"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "It's inevitable to mention that \"Fifty Shades of Grey\" is one of the best films of 2015. It was not as painful as everyone thought.",
      "total_reactions": 0,
      "user": "PipeC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 1,
      "text": "Never read the book, wasn't expecting the film to be any use and I was glad not to be proven wrong this time. I was not the only person to spend most of the film laughing at the endlessly boring scenes of terrible dialogue given by one dimensional characters with not a shred of chemistry between them. No character development whatsoever with lame attempts at adding backstory that at that point I just didn't care about. As for the rest of the film, to say it was cringeworthy is an understatement, awkward and pathetic.",
      "total_reactions": 0,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Unexpectedly delightful. I really had fun watching this movie.",
      "total_reactions": 0,
      "user": "gigiharris17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2015
      },
      "score": 1,
      "text": "Love the Book not the movie. He is borderline Christian's character shoe is spot on. Too much is cut out, book to movie. Sequence is screwed up as well! Book excited you, movie board you! Important parts cut out, changed or eliminated. Not pleased.",
      "total_reactions": 0,
      "user": "Tusie217"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Una de las películas que he esperado con más ansias y la que más me ha defraudado.  Excesivamente predecible, carente de emosión y ABURRIDISIMA.  En una sola palabra UN FIASCO.",
      "total_reactions": 0,
      "user": "marcelini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "Here comes a better version of twilight, but once again a book to movie adaptation falls in almost every way. Its just a reason to see two actors have sex with each other, thats the only reason anyone went to see the movie.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "I don't get all of the hate for this movie? I thought it was alright. Definitely not great but it wasn't bad. I didn't care for the abrupt ending and the story wasn't that well put together but it was still decent.",
      "total_reactions": 0,
      "user": "Yeezus300"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "I knew i was going to hate the movie within the first five minutes. It's just silly the two main characters are hard to like and habe zero chemistry. The dialogue is painfully slow. There is supposed to be a build up to the intimate scenes but even those are really really boring and nonsensical. I won't even  go into how deeply offended and violated the movie made me feel as a woman. Disgusting. Worst movie I've watched so far.",
      "total_reactions": 0,
      "user": "nosma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "That movie is dangerous, nasty and scary for everybody, it's got extreme sex, torture porn, domestic violence and extreme rape. I heard that a guy asks a girl stranger to come and gets forced to have sex all the time, that's dangerous. WORST MOVIE EVER!",
      "total_reactions": 0,
      "user": "SanDiego"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2016
      },
      "score": 0,
      "text": "I didn't like it I didn't like it I didn't like it I didn't like it I didn't like it I didn't like it I didn't like it I didn't like it I didn't like it",
      "total_reactions": 0,
      "user": "ten0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "There is zero chemistry with the main characters and the plot is terrible. I don't know how anyone could possibly get an enjoyable experience out of this movie, other than making fun of it.",
      "total_reactions": 0,
      "user": "macgmatt"
    }
  ]
}