{
  "mc_avg_user_score": 8.7,
  "mc_metascore": 61,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Fighting",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 143,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I didn't expect to enjoy this film, but I did. Not the predictable storyline, but the characters. I actually enjoyed  the way every one of the actors played their parts - and that's not something you can say of many movies. I'm sure the director can take a lot of the credit for the way the nuanced performances made a quite enjoyable film from what was probably a terrible script, but I still liked all the characters, right down to the love interests' elderly relation. This is a bad movie made into an enjoyable one by the people who made it.",
      "total_reactions": 3,
      "user": "terrypattison"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Fighting is a film that tries desperately to be relevant in any way, but it is only a weak action film punctuated by some good ideas in the script. The film tells the story of Shawn MacArthur, a young man lost in life after a fight in a square is contacted by an agent that helps him making money in illegal fights.",
      "total_reactions": 1,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Unwatchable.  Bad story, bad acting, bad fight corry.  I knew it was time to stop watching when I caught myself reading something else with the movie going in the background.",
      "total_reactions": 2,
      "user": "Vorlargen"
    }
  ]
}