{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 77,
  "mc_movie_name": "Flight",
  "mc_negative_rating_frequency": 22,
  "mc_positive_rating_frequency": 264,
  "mc_pro_critic_reviews": [
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 100,
      "summary": "Flight is exciting - terrific, really - because in addition to the sophisticated storytelling techniques by which it keeps us hooked, it doesn't drag audience sympathies around by the nose, telling us what to think or how to judge the reckless, charismatic protagonist played by Denzel Washington."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "It is nearly flawless."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "Flight opens with one of the most harrowing in-flight-disaster depictions of all time."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 91,
      "summary": "Directing his first live-action film since 2000's \"Cast Away,\" Robert Zemeckis paces it brilliantly, slowly ramping up the energy from hungover lethargy to coke-fueled confidence, while creating undercurrents of dread as Washington hits his stride."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 91,
      "summary": "Exhilarating drama, and a triumphant return to glory for both Zemeckis and Washington."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 90,
      "summary": "Flight is freakishly real; it's one of those big-screen nightmares that will inspire fear-of-flying moviegoers to run home and Google car rental deals and Greyhound schedules."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "No actor is as brilliant, or as cunning, as Denzel Washington at portraying superhuman coolness and the scary prospect of its loss."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "A canny director and a top star decided to dig deep to find the core of a compromised hero. And when they reach that center of gravity, Flight soars."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "This absorbing drama provides Denzel Washington with one of his meatiest, most complex roles, and he flies with it."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "Flight is neither a simple story of heroism, nor one of a fallen hero. Things are more complex than that - and it is its complexities that make the film all the more rewarding an experience."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "We can quibble about the punitive punchline of John Gatins' script, but keeping complexity aloft for so long makes Flight a miraculous feat."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 88,
      "summary": "You might bitch that Flight levels off after its shocking, soaring start. But you'd be missing the point of an exceptional entertainment that Zemeckis shades into something quietly devastating – not an addiction drama, but the deeper spectacle of a man facing the truth about himself."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "A unique, audacious studio movie, kicking off as a star-driven spectacle before whittling itself down to a raw and riveting character study."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "Slickly paced and carried by mature performances, Flight embodies one of the finer strains of Hollywood filmmaking in recent years."
    },
    {
      "critic": "Chris Hewitt (1)",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2013
      },
      "score": 80,
      "summary": "A welcome return to live-action filmmaking for Zemeckis, who hasn't lost his knack for a brilliant shot or for extracting great performances. It may not exactly be a first-class experience throughout, but there's nothing wrong with premium economy."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "One of the big reasons Flight is so satisfying is that it moves with the no-frills, meat-and-potatoes conventions of a first-rate procedural while being awash in ambiguity."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 80,
      "summary": "It is not surprising that Zemeckis's handling of spectacle would be undiminished, but he hasn't lost his touch with actors, either, coaching Washington into one of his rare performances that suggests much more than it shows."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Denzel Washington is aces as a commercial airline pilot who pulls off a miraculous mid-air stunt while flying with a 0.24 blood alcohol concentration, only to face his demons on the ground."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "It may not be frivolously engaging but it is compelling."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The people who made Flight have done a courageous thing. With all the potential revenue to be had from in-flight movie sales, they have made a movie that is guaranteed to never be shown on an airplane."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "That 20-minute white-knuckle sequence - which includes Washington's character, Whip Whitaker, flipping the plane upside down to pull out of a tailspin - is by far the most effective part of director Robert Zemeckis' first live-action film since the underrated \"Cast Away\" 12 years ago."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Just in time for the holiday travel season, Flight brings audiences perhaps the most harrowing scenes of a troubled airplane ever committed to film."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The plane crash in Flight must go down as one of the strongest single scenes of 2012: It's extended, detailed, technically and emotionally realistic, and beyond that, it reveals character."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "Flight is a so-so movie with Denzel Washington as a commercial-airline pilot who crash-lands a plane while drunk, high, hung over, and horny. It doesn't do much that you couldn't anticipate just by seeing the trailer - the trailer is more exciting than the movie itself."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 75,
      "summary": "The film is not without flaws. It glosses over the story of the dissolution\r\nof Whitaker's marriage and does not delve deeply enough into the source of his problems with his son. A romance with recovering junkie Nicole (Kelly Reilly) rarely rings true."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "My biggest problem with Flight is not the unanswered questions it raises, but the eleventh-hour epiphany just in time for a happy ending. Maybe I'm naturally cynical, but I simply don't believe that people are basically good at heart - and I don't buy into sudden salvation. Otherwise, Flight is one hell of an entertainment."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "An engaging and initially very promising drama about alcoholism, redemption and forgiveness that grows uneven and long-winded as it progresses."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 67,
      "summary": "Flight's pat closing sequences are at odds with the complexities presented earlier on. They travel the conventional route and threaten to vastly simplify this story into one of an addict's redemption. Perhaps it was inevitable that the drama on the ground could never equal the excitement of the action that occupies the movie's beginning sequences."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 65,
      "summary": "Turns out to be a disappointingly standard addiction story in its second half also serves as a reminder that Hollywood tends to be more invested in these types of self-serious movies than most actual audiences."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "This movie is captivating until it gets uplifting – Flight soars when it crashes and crashes when it soars."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 63,
      "summary": "Once you get past the intriguing fact that although Whip's job puts hundreds of lives into his hands on a daily basis yet he's cavalier about protecting them, the movie doesn't feel much different than any other exploration of addiction."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "A solid, often engrossing film that doesn't engage us overall the way Denzel Washington's work does."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Even if you remove the questionable quasi-religious touches, Flight doesn't quite soar past its narrative limitations. There's plenty of virtuosity to go around here - just precious little transcendence."
    },
    {
      "critic": "Tom Shone",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Next to Gump, the film has the moral force of a George Steiner essay, but what lends it that force are not the carefully calibrated moral ambiguities of the script, but the bruised, defiant soul that appears to us in the form of Denzel Washington."
    },
    {
      "critic": "Stan Hall",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 58,
      "summary": "What's even more amazing about the actor's absorbing, sometimes depraved performance is that while the film around him is generally cheesy and obvious, Washington is to-the-bone real."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "One unwelcome surprise is how shopworn the story's components prove to be. Still, they're enhanced if not redeemed by Mr. Washington's stirring portrait of a skillful, prideful pilot hitting bottom."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 50,
      "summary": "Slowly but surely, Flight degenerates from a tale of moral paradox and wounded romance into a mid-1990s after-school special about addiction and recovery."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Zemeckis intends to give us a slightly more depraved version of Washington's usual charismatic hero, then pull the rug out from him. But Flight's true downward spiral is its own loss of momentum."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Flight is a very interesting movie because of the plot that presents; a pilot landed a plane that was falling in flames and save most of the people on it, but a blood test indicated that he was with a considerable percentage of alcohol in his blood. In this point the protagonist start living in a big contradiction, because he is a national hero, but also an alcoholic. That is why the story moves between two worlds, in one he is a questioned pilot trying to defend his image; and in the other one he is immerse in drugs and liquor failing to acknowledge his problem. This theme of a protagonist facing to worlds is recurrent in the filmography of Robert Zemeckis, for example past versus future in Back to the Future; expectations about the world versus real world in Forrest Gump; and life in the island versus life in the civilization in Cast Away. In the same way of these mentioned pictures, the protagonist of Flight will enter in a rediscovery of himself, to finally become a new person, with no possibilities of returning to what he was before. Despite that the film is slow, Denzel Washington is great and Zemeckis did it again.",
      "total_reactions": 5,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "This movie is okay. Since Robert Zemekis directed this, I thought that this would become an instant classic. It's only okay at best. Washington and Goodman definitely redeem the movie a bit since their acting is so great. Unfortunately, it wasn't even to put this up there with Forest Gump or The Green Mile.",
      "total_reactions": 1,
      "user": "rancor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Flight is an interesting and well acted movie about a man battling with alcoholism. The movie suffers a little by being overlong but overall it's a decent cautionary tale.",
      "total_reactions": 1,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "My advice would be to watch the first half of this film, which is generally original and captivating. When it gets about an hour in, you will begin to notice some overt cliche thrown in casually. By the end of the film, you will walk out feeling appalled that you have once again been tricked into watching a predictable and non-sensical hollywood plotline tailored for the un-thinking audience. Damn you Hollywood producers for relying on formula and ill conceived moral banality to ruin yet another film that had great potential.",
      "total_reactions": 1,
      "user": "Evolutionary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Washington and his supporting cast are enjoyable and the first 40 mins are good (up until after the crash) and then it just sorts of level off. It gets a little interesting at parts through out but never really gets to the potential that it was capable of reaching. Sort of a disappointment really because Flight easily could have been the best drama of the year.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "The movie's synopsis is basic, and so is the film. After the first half an hour, everything slows right down and it turns into more of an insight into the mind of an alcoholic. It's a very long movie for a story that's been told many times, with just a few alterations. Towards the end, we see what a great actor Denzel is and we come to a satifying conclusion. This is certainly a fascinating film to watch that will have you pondering over whether we should criminalise someone for drinking on the job or whether they deserve a second chance depending on the situation. But it's hardly a movie that would make my all time favourites list.",
      "total_reactions": 1,
      "user": "StrawberryBlond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "I watched this movie because of Denzel Washington, and if only in his case, the reviews are true.",
      "total_reactions": 1,
      "user": "Josh-k25"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "A very good drama about facing who we are,  taking responsibility, and change to the right direction. Mr. Denzel Washington's acting was great. A little bit slow, but worth watching im my opinion.",
      "total_reactions": 8,
      "user": "oliver1h"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "A high quality drama with a great story that is a good break from the action flicks that dominate the market nowadays. Scenes that will be funny for some may be all too real for others. Denzel Washington does a fantastic job as usual. Definitely recommend.",
      "total_reactions": 6,
      "user": "theoffice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Denzel's rock-solid here (yeah, yeah, what else is new).  His performance, the story line, and the subtle message will be appreciated even more for those who have battled any addiction problems of their own.  Would have reached a 9 in my book had Zemekis not chosen to portray evangelical Christians in a short scene I found insulting and laughably stereotypical.",
      "total_reactions": 5,
      "user": "C-Money"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Denzel Washington will probably be nominated for his performance in",
      "total_reactions": 8,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "This movie should be called The Bottle Jockey or something that more accurately denotes its central theme i.e, an alcoholic airline captain having is coming to Jesus moment. The movie is 140 minutes long:  10 minutes of setup; 15 minutes or so of pretty good flying scenes-followed by 110 minutes of watching Denzel Washington",
      "total_reactions": 4,
      "user": "jimboesq"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Don't expect this movie to be about pilots, flying or the airline industry.  It is a movie about an alcoholic, alcoholism and substance abuse.  It's about the ensuing denial, effects on career, the enablers and the effect on friends and loved ones.  That being said.....it is a good movie, and should be seen by all who have someone close to the affected by substance abuse.",
      "total_reactions": 2,
      "user": "erom1943"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "This film is so plagued with technical errors somebody should be accountable. They discharge the fire extinguishers yet the engines keep running. Every jet pilot in the world knows if you pull the fire handle it cuts the fuel and the engine stops!",
      "total_reactions": 2,
      "user": "WilliamJones"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "From the previews this looks like the nail-biting experience of a plane crash. That's pretty true",
      "total_reactions": 15,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "As the movie begins you think you know where it is headed, but you (the audience member ) only really have a general sense of direction and you quickly learn that this screen play and director Robert Zemeckis have a much more involved journey planned.  This film exfoliates like an onion to reveal much more of a surprise than  you could have anticipated.  For once the trailer isn't the best part and it doesn't reveal \"all of the good parts.\" There are a number of great performances by both known veteran actors like Denzel Washington and a bunch of lesser known actors as well.  This movie is packed  with twist for certain, but they aren't the kind of supernatural twist that are typically overloaded with a generous helping of hyperbole, not this movie is packed with realistic moments that people will be able to identify with.   There will most certainly be some Oscar nominations from this film, including perhaps best screen play, best supporting actor and may be best director.  Go see this film!",
      "total_reactions": 11,
      "user": "mwm7430"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "Flight had a potential to be a compelling psychological and moral drama but squandered all that it built up in the last 30 minutes by pandering to the worst Hollywood stereotypes of preachy sentimental commercialism.  I wanted to throw up when Denzel sanctimoniously decides to go all repentant at the hearing, and then makes his schmaltzy  confession to fellow inmates. When his son (with whom he established no relationship in the film) showed with a school assignment, I was ready to strangle Zemeckis, Denzel,  and especially the scriptwriter for the most saccharine sappy weepy sell out. I really don't know how any intelligent viewer could have related to that concluding half hour of the film and I can't recall any recent film that undermined itself so irredeemably. What a waste of money and talent, especially Denzel's. The recovering drug junkie's role was woefully underwritten, and only Goodman in his walk-on role can safely dissociate himself from the rest of the film. The bright spots were the secondary characters, especially  the black stewardess who should have had more screen time and  the dying cancer guy in the hospital.  When I say the film had potential, just imagine a complex, ambiguous film where  Denzel lies at the hearing (without the psychologically and dramatically ridiculous drunken binge the night before), the corporations are punished (as they should for unsafe aircrafts), Denzel retires with a nice severance package that gives him time to first realize that without cocaine he would have not saved the plane and then brings him out of the cycle of self-abuse. He  moves to Jamaica with his white girlfriend. She does photography, he just chills, and in the last scene, we see them listening to raggae and smoking weed, a great pitch for legalizing marijuana.",
      "total_reactions": 17,
      "user": "jelon"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "See another movie. Don't waste your time here. It is a drama about a drunk.",
      "total_reactions": 10,
      "user": "thcsreb"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "An excellent movie with excitement, drama, and good story line.  Denzel Washington is sure to receive an Academy nomination.  The picture trailer only hints at the true story.",
      "total_reactions": 5,
      "user": "gfny"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Luckily there is a great nude scene. Otherwise a very bland film about not much. Tries to be dark and troubling, but comes off as shallow and uninteresting. Nudity is worth a Netflix rental, but not full price at the theater. If I were Denzel I'd fire my agent.",
      "total_reactions": 5,
      "user": "Oroiael"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "An art film about drinking pretending to be a Hollywood film about an airplane crash. If you want an art film about being self destructive and using drinking as the vehicle and being able to guess the ending just after the crash than this is your film. It is filmmaking 101.",
      "total_reactions": 6,
      "user": "nameless"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "I went to a lot of trouble to register so I could write a review for this movie. Although the term 'Movie' implies 'Moving Picture' This one moves along quite well for 12 ish minutes, And then staying awake becomes problematic.  Without spoiling it, I can tell you it turns to **** BORING **** YOU WOULDNT BELIEVE HOW NOTHING HAPPENS. I was waiting for ghosts, secret agents,men in black, hell, even ALIENS! SOMETHING!? It Reels you in and you think; 50 minutes in ;Any minute now this film is gonna peel out tyres smoking, and;. .  NOTHING!!  Just a boring innacurate like my spelling take on alcoholism, and some directionless  mumbo jumbo .",
      "total_reactions": 6,
      "user": "christhefish"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "The professional critics were far too generous to this film. Sure, Denzel does a nice job portraying the drunk pilot, but his story is simply tedious. I wasn't in the mood to watch a saga of an alcoholic pilot in denial.  It's not an ambitious story in the least. Even John Goodman's character is wasted.  He's terrific in his first scene, but then he becomes a caricature of himself in the coke sequence. The actors who save the film are Kelly Reilly (as Nicole) and Nadine Velazquez (from the League).",
      "total_reactions": 3,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This movie is allot better than the trailer. I love the story, big ass's, blow, and booze. GO watch it and you will not be disappointed. Denzel kicks ass.",
      "total_reactions": 3,
      "user": "VladimirLenin"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Flight... Ok, the movie is very interesting, have a trama that sounds interesting, the screenplay is really awesome, and the performance of Washington is really amazing. The problem with Flight, is that have some boring moments. But the movie is really fantastic.",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "This is a brilliant movie.   I have read many good reviews by my fellow moviegoers so I won't share the thousands of reasons why this film is great but the kicker for me was Whip's scene while offering testimony at the decisive NTSB hearing. Most of us have a sense of how corporate and political machines work and we expect cover-ups as an almost routine way of doing business.  Here's the spoiler: instead of taking the route laid out for him by his very bright lawyer, Whip graduates from villein to hero by telling them the unvarnished truth, for which he pays a very steep price but also finds a very a credible redemption. Denzel Washington, a screen idol of heroic proportions, strips away this facade to reveal a character with huge, even fatal flaws in a fearless performance.  The work of John Gatins and Robert Zemeckis in this film is in the realm of pure genius.  If you want to learn something about yourself and a good deal more about the human condition, don't miss this film.",
      "total_reactions": 3,
      "user": "kingacres0"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "Middle class pap, trite, and hackneyed.  Basically about one reprehensible guy who struggles with his addictions.  If you would like to see Denzel drinking, smoking, and snorting without any larger message then this is the movie for you.  Basically a movie devoid of meaning except for a nice, safe upbeat end which, in my mind, is the hallmark of something below even a B-movie.",
      "total_reactions": 9,
      "user": "ErikTheRed"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Flight is truly something to marvel. Denzel Washington is a hero here, not because his character in the movie landed a plane and was called a hero, but because his performance was a true act of heroism. Bravo.",
      "total_reactions": 5,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Flight is, at its core, the story of a man struggling with alcoholism and the devastating course of events that have to play out in order for him to finally face the truth about himself.  At the same time, it forces us to wrestle with our own notions of heroism as we must choose whether to root for or condemn the deeply flawed protagonist.  The film wisely lets us draw our own conclusions resulting in a sobering take on addiction and redemption fueled by Washington's spot on performance.",
      "total_reactions": 1,
      "user": "BKM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "I wanted to take a shower after this movie.  The snorting, shooting up, drinking, more drinking, and general drug abuse is hard to watch.  The acting and writing throughout is excellent, with especially noteworthy cameos from John Goodman as the drug pusher and James Badge Dale as a cancer patient.  Denzel is solid throughout as he always is.  The special effects (the plane crash) looked real and was intense.  Overall I thought the movie was a little predictable, and was such a downer that it loses the repeatability factor - I have no desire to ever see it again.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Didn't expect this movie to be to me outstanding. Some good funny humor. But kept it serious. Great story telling. Great direction. Great acting. Almost a three hour movie. But very much worth the watch.",
      "total_reactions": 3,
      "user": "ijcn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Perhaps Flight is a little too long and may have one too many layers, but this does not stop it from being a very enjoyable experience. The film commences with the best crash sequence that I have seen and ends with one of the best performances of the year with Denzel Washington acting up a storm.",
      "total_reactions": 1,
      "user": "cabrita"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "This is probably the best performance of Washington's career. The story of his redemption is trite, but he plays it very well. The flight scenes are exciting. His portrayal of an alcoholic is realistic, and the ending is expected. He will surely be up for a best actor award.",
      "total_reactions": 2,
      "user": "drchoc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Flight's first 30 minutes is riveting with the flight sequence but then levels off into some addiction drama.The movie soars in the beginning but begins to flat line as the movie progresses and eventually falls into a Hollywood style ending.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "This is a brilliantly written, directed, and acted film.  I do feel sorry for people who wanted a plane crash movie and didn't get it.  This is a film of depth and moral complexity for which there are no easy answers.  Zemeckis direection is flawless--there's a stunning photographic moment late that is not a special effect.  Denzel Washington tops all his previous work, and John Goodman and Melissa Leo are huge in small roles.",
      "total_reactions": 5,
      "user": "amboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "As long as you go into it accepting that airplanes and piloting are a plot devise, and you want a tale of alcoholism and the struggle of addiction as the actual theme then it may be enjoyable. The trailer is more entertaining than the movie.",
      "total_reactions": 1,
      "user": "JimLahey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "A well acted, well directed movie with quite a few story problems. As usual Denzel chews up the screen and is worth the price of admission alone. The crash at the beginning of the film is fantastically shot, super intense, and jarring. Most of the story problems come from the relationships or lack there of throughout the movie. We are given little back story  in some cases, while new relationships are severely under developed and quite unbelievable. So while I do feel like we become invested in our main character and are invested in seeing him change his life, the emotional payoff is a little underwhelming because we care little if any about anyone else in this film. Another liked it didn't love it Denzel film to add to a pretty long list.",
      "total_reactions": 2,
      "user": "seancriswell"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I think this is Denzel's best performance in the movie Flight. I think he way out performed the character in the movie Training day, which he won the Academy award for a outstanding performance. I think this movie teaches us all a lesson in the consequences of being an alcoholic and substance abuse is a major problem in this country. I think everyone should get the message the movie was trying to express. What really got to me is he had saved so many lives on the defective plane, but there was alcohol and cocaine in his system, but he landed safely on ground with the exception of a few lives The fact he saved so many lives on board the plane, and at the end of the movie he still got sent to prison, for his drug and alcohol abuse. This movie is very serious, but still have humorous parts to laugh at. I also think this is Don C's best performance for supporting, the leading character, Denzel, a still definitely handsome and tall man, who dose not definitely look nowhere in his fifties. Denzel will never give up doing the movies, I love the most. Bravo performance, bravo.",
      "total_reactions": 5,
      "user": "Lynette"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Flight may not be liked by many but let me tell you why I like this film. Denzel Washington gives one of his best performances, he is the sole reason why I decided to watch this film in the first place and I don't regret it at all. The direction is satisfying enough to keep the viewers interested in the film i.e. the first 30 minutes of the film show the plane crash which is exceptional, I have never seen something like this before, it was too terrifying and kept me on the edge of my seat throughout the sequence. After those 30 minutes, the 2 hour (almost) drama begins which passes by so quickly, you don't even realize (only if you are a fan of slow-paced drama films). And then, finally the ending, which is downright excellent, I pretty much hoped for an ending like this because without it, the film's message would not have been that clear. Washington's character Whip Whitaker finally accepts that he is a free man, he has no more lies to tell, he doesn't feel any burden or he doesn't have to carry all this throughout his remaining life.",
      "total_reactions": 1,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "The film is completely carried by Washington. However in a way it is also ruined by him. His amazing performance exposes the rest if the film as lackluster, and the 2 hour 18 minute run time felt very unnecessary. I can think of two plot points that had no effect on the story. Still engaging and worth a DVD viewing due to Denzel.",
      "total_reactions": 4,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "This movie held my interest throughout.  The opening action scene is realistic.  Bits of comic relief are welcome. Denzel Washington's performance is solid and believable as expected, as are all the performances.  Overall this movie was entertaining and made for a nice evening's escape.",
      "total_reactions": 3,
      "user": "poetreviewer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Flight was very good.  Denzel was outstanding at portraying this morally confused pilot.  John Goodman's character was so in control and entertaining.  Everyone on the screen were spot on to make this film terrific.  It makes you think about the choices you make everyday!",
      "total_reactions": 3,
      "user": "Micquez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Worth seeing for Denzel's performance and the opening 30 minutes but the rest of the film, aside from a few tense moments, falls flat. Good direction, great acting but the pace of the film left alot to be desired. Made the same point with the main character over and over again.",
      "total_reactions": 1,
      "user": "CBN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "All I can say is that this is a great movie that EVERYONE should see. It challenges drug dependency, alcoholism, the definition of heroism, and personal accountability/honor all in a short 2 hour span. This was a great investment of my time, attention, and money! GO SEE IT",
      "total_reactions": 1,
      "user": "APOLLO_SOL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "I went into this movie knowing full well what I was getting myself into, a character study on alcoholism with a flashy planecrash to draw in the public audience. The movie had potential, but it felt like a movie Columbia Pictures made just to fill the seats. Even as someone with a drinking problem, I couldn't identify or empathize with the protagonist. A drama without the script and emotions to back it up. But that crash was pretty sweet...",
      "total_reactions": 1,
      "user": "kingofthekicks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "In the previews we've all seen that Washington makes a miraculous flight recovery to save his doomed airplane. The problem for me with this film is that it continues to tell me over and over again and display situations redundantly that demonstrate that our hero has a problem. OK; I get it. Once you do get it, there's not a lot more to this film. Washington, for all of his abilites, cannot overcome his personal problems and in this movie, he has \"so many chances\". However, Washington's performance is worthy.",
      "total_reactions": 1,
      "user": "ultralight47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "Though a huge fan of Denzel Washington, I simply never cared about this character or the story in which he found himself. Though there are many technically brilliant things about the film (the plane crash in the beginning is stunning) and the actors and the director fully deliver, but the story they are telling ultimately, does not have a point large enough to justify the darkness of tone. Hope to see them all again in something more worthy of their efforts.",
      "total_reactions": 1,
      "user": "montfort"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I enjoyed everything about this movie. A very powerful and dramatic film that keeps the audience aware the whole time. Opens with a great crash scene and finishes with a perfect ending. Washington at his best.",
      "total_reactions": 1,
      "user": "haydenlaabs3215"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "\"Flight\" was directed by Robert Zemeckis and stars Denzel Washington, Bruce Greenwood, Don Cheadle and John Goodman. This is a film worth seeing if for no other reason than the first 20 minutes where action and drama take us into the stratosphere of emotion and fear. Written by John Gatins this is the story of an ill fated flight and the alcoholic pilot who despite his addiction, attempts to perform a miracle of aeronautical maneuvering. Not to be understated, Denzel Washington once again proves his wide range as an actor and gives us a performance worthy of his reputation and past accomplishments. Though thin in story line and weak in some other areas (i.e. depth of the  characters etc.) I give the film an 8 stars because, above all else, it was entertaining and certainly gets the viewer involved.",
      "total_reactions": 0,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Quite a good movie about a complicated character. He's obviously good at his craft of flying and because of that he saves the life of many people, but he does so while being high and drunk. If you've ever been close to someone who's an alcoholic or drug addict (or if you've been there yourself), it's quite hard to watch Denzel's character seemingly breakthrough and become sober, only to fall hard in the end. Well done, and well acted all the way through.",
      "total_reactions": 0,
      "user": "dijavantewow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "A genuinely nerve racking drama which combines top notch performance from Denzel of the multilayered flawed hero and near perfect direction to match.  And it is not only the admittedly very impressive flight sequence in the start of the film, but the dram that unfold that keeps audience on their toes.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "I thought this was a good movie but not a great movie. It surely does not meet the hype  given by some. Yes, Denzel does act for the first time in quite a while but he really does not stretch that much. Also, the scences of going from drunk to sober are greatly exaggerated for the convenience of the audience. The film never really confronts the reality of going from addiction to sobriety. Still, the movie is entertaining and one never gets bored. I was disappointed with the ending but I expected that from a big Hollywood film with a megastar with Denzel. This is not an Oscar film but is an enjoyable night out.",
      "total_reactions": 0,
      "user": "JamesL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Although I liked this film I did find it a little too long; in fact I have to admit that I watched it in two halves. From a totally stunning sequence at the start I felt it lost momentum for a while, that was until I became embroiled in the drama of Whip Whitaker’s story. It’s quite a tale and an excellent performance from Denzel Washington holds it all together quite brilliantly. I also thought Kelly Reilly did a pretty good job as well. But back to the opening sequence for a moment, for me it ranks as one of the best special effects driven sequences I’ve seen in a very long time and hats off to all involved. Taken as a whole, the film does take the audience on quite a journey and I know for some it couldn’t quite live up to that crash sequence. For me I thought it held together pretty well, mainly thanks to the acting skills of Mr Washington. Over all, definitely worth a watch but don’t get blown away by the crash sequence, there’s a lot more depth to it than that.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Flight. A movie about a plane crash? Yes but also no. After the brutally realistic crash right at the start follows a movie about the pilot. Denzel Washington is great as an alcoholic who is struggling to hold his life together, and even though the character is in some ways unlikeable he is captivating. It keeps you watching, as the case about the crash closes in is as tense as any thriller. An interesting and well made movie with a star lead performance. Just don't watch before you go on your holidays!",
      "total_reactions": 0,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Denzel is hitting on all cylinders in this drama. The believability of Denzel's character is an A. The moral pitfalls that collide here will make many viewers question their own lives.",
      "total_reactions": 0,
      "user": "eliteco3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Denzel Washington, Kelly Reilly, Bruce Greenwood, John Goodman, Don Cheadle",
      "total_reactions": 0,
      "user": "sundaygrundle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Flight boasts a powerhouse central performance from Washington as a pilot who averts disaster despite being an alcoholic, but the rambling plot line involving his personal life dilutes the power of the story at its heart. Apart from Washington, Goodman, Cheadle and Greenwood it's really hard to care about the rest of the characters who add nothing to the story and seem to be there mainly for padding. A brilliant opening and a redemptive finale is padded out with a very weak mid section.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "With excellent performances from veteran actor Denzel Washington as the problematic Whip Whitaker, \"Flight\" tells the well-crafted story of his personal journey to rediscover the true man he is, above the addiction of alcohol.",
      "total_reactions": 0,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Robert Zemeckis is back to his live action finest with Flight, a film that deconstructs the life of a hero until there is nothing left. Sounds depressing? It kinda is, but like most Zemeckis movies its full of heart. The film tells the story of Whip Whitaker (Denzel Washington), a pilot who saves countless lives when his plane loses control. However when he hits the ground his life is upended by the airlines investigation into the crash and his life, which threatens to reveal his alcoholism. While the film does feel opinionated and at times a little naive (the ending is exceptionally so) it is also one of the most engrossing studies of alcoholism ever devoted to film. Denzel Washington is captivating as Whip, a man like most alcoholics in denial. His commitment to the role is astonishing and there is not a moment in the film you don't  truly believe this character is real, that he would exist in a real world. There isn't a moment in this film where you don't think Denzel deserves all the adulation he has received for this role, its by far his best performance to date. In fact I may be offending Daniel Day Lewis fans when I say that Denzel was by far the more deserving nominee at this years Oscars. Even from the beginning of the film you are captivated by not just the opening sequences but by this character because not only is he broken but hes also charismatic and dare I say it, charming. However the film also soars in its technical aspects as well as the film starts with a pure adrenaline shot as it shows you in full the crash, every little detail. The editing is fantastic but the direction by Zemeckis is what makes it exhilarating. His attention to detail makes the crash tense and genuinely terrifying. The films only action sequence is crafted lovingly and with great skill gripping you to your seat so you just have to watch the rest even if the film settles into a much more serious area of discussion for the remainder. Despite the fact he is supported by some great actors like Don Cheadle and John Goodman, this is Washington's film and Zemeckis shows him at his best. The only downside is the film finds the need to inject some Forrest Gump schmaltz into the film as it draws to a close when it really isn't necessary at all but its to be expected from Zemeckis and it only annoys in the moment as the rest of the film is so good you can't help but remember the many good things over the solitary mistake",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Welcome back Bob Zemeckis! After 3 lacklustre 'performance capture' efforts, Zemeckis was in need of a comeback. Here is one of Spielberg's brightest protegee, squandering his talents on motion pictures that despite all efforts to the contrary, looked fake and 'unnecessary', be it Polar Express or A Christmas Carol. Flight marks his return to Live Action film making, and a welcome sight it is! Started out with one of the most harrowing plane crash in recent memory, Flight then transform into a study of alcholism and redemption.  By the end of the film, Whip with all his imperfections, transformed himself into a true hero.  Denzel delivers another tour de force performance, his best since American Gangster.  Flight also is a change of pace for Zemeckis, who cuts his teeth on making event, tentpole pictures.  More personal and suprisingly provacative, it's not perfect but one of the year's more memorable films.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Flight masters the most sincere and meaningful way to portray a man who we want to feel sympathetic towards, but find it difficult to so, as his reckless and arrogant behaviour plagues a tragic accident that he was directly involved with. The man in question is Whip Whitaker, an airline pilot, played by Denzel Washington, who gives an engrossing and driven performance as the damaged pilot, who saves many lives after a mechanical failure results in the plane he is piloting to nose dive towards the ground, but with death comes responsibility, and Whip must answer many questions as to the events of the crash, especially when he was drunk and high while flying the plane.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "In an epic tale of man versus booze, Denzel Washington takes flight in one of his best roles as a deeply disturbed alcoholic pilot. He takes the audience into a private struggle, one that can easily draw us to root for this man brimming with flaws, but inadvertently hailed as a hero. The lies he makes, and the way he tells them in almost self-convincing way is sometimes lightly humorous, although the persisting issue is a heavy one.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "If you're judging this movie purely on the various elements of cinematic categories (such as acting, production value, plot development, etc.) it's an incredible movie. Denzel Washington delivers one of his best performances and that's saying something because he's one of the best there is or has ever been. The supporting cast of Don Cheadle, Kelly Reilly, Bruce Greenwood, and John Goodman is fantastic as well. The special effects were also done incredibly well. The plane crash was impressive and looked amazingly realistic. The movie, while really long, didn't drag either because the plot developed well and the characters felt authentic. So why the just pretty good rating? Because what's the purpose of a movie? To me it is to be entertained and I have always had trouble enjoying a film when the protagonist is such a detestable character, which Washington's was. There was also quite a bit of completely unnecessary nudity. Sure, Nadine Velazquez is absolutely breathtaking but was that opening scene really necessary? It seemed forced and more for shock effect than anything else. Nonetheless, this was still a very good movie and I think most people would enjoy it.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Ever since the movie Flight came out, people have been raving about it, but I didn't understand why until I actually sat down to watch it. Denzel Washington is one of my favorite actors, so I was going to see it either way, but I wasn't expecting it to be what it was. The previews and commercial all focused on the crash and the hero who made an impossible move to land the plane safely, but in reality that's just a small part of the movie. The true focus of the movie is on the troubled life of pilot, Whip Whitaker (Washington), whose demons seem to find him wherever he goes. When he's in the air, Whip is at peace and away from a life of hardship and disappointments, but after the crash, he's unable to fly and has to face that life head on. The film itself was actually a bit slow after the thrilling introduction and the excitement on board the plane. At parts during this film, I was bored, but it's necessary to bring the story together into an unexpected conclusion. Sometimes, a film is slow and it's just not worth it to sit there, but Flight is different. The film may lack something in the middle, but it is well worth you're time. The story is out of this world and Denzel Washington shows that he hasn't lost a thing. This man brings such a strong presents to everything that he does, that often times I find myself overlooking the entire rest of the cast. There are a lot of big names in this film, that all become forgettable after the performance Washington gives. Even though this film came out at the wrong time, if he doesn't receive the Academies attention for this role, then there is a gaping flaw in their system. The story is fantastic, Denzel Washington is nothing short of amazing, and this story will stick with you long after the film is over, I can not recommend it enough!",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "A flawed genius with a moral dilemma set against the backdrop of incredible heroics, intertwined with people who may or may not support him, and handsomely portrayed by Denzel. OK, the movie has it's flaws, too, but at least it was less predictable and had a few more surprises than most of the junk out there. The most unrealistic aspect was that the media didn't find Whip as he floundered around at funerals, bars and the crash site. BTW a movie's title doesn't have to be a tell-all. Besides, \"Flight\" could certainly be metaphorical, too, in this story. I'd have liked a less tidy ending. He could've walked away to face his demons another way, leaving a more ambiguous moral resolution. But it was a good grown up movie without explosions and guns going off every two seconds. You could ask yourself what should he do, what will he do - what would I do? It was really enjoyable not to have a soundtrack that just thumped out what my emotional state was supposed to be all the time, there were several dramatic scenes with no background music at all. I'm not a fan of drugalcohol themes, but this was just a device here - at its core the story was about whether or not our good deeds can stand alone or are they diminished by our bad ones?",
      "total_reactions": 0,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Welcome back Robert Zemeckis after his actor-animation capture ventures, FLIGHT heralds his first time return to a real live feature after a dozen years. Great relief he is still excelling in instructing a debatable moral tale with a back-to-his-top-form two-times Oscar-winner Denzel Washington. The narration has its gradual and clock-wise temp in scrutinizing a heroic pilot’s personal quagmire after landing a doomed-to-be-crashed plane with minimum casualty by virtue of his alcoholic addiction (what’s worse is the fact that he was  even when he was at the helm during that dreadful accident). From a legitimate angle, although his valorous action deserves raves from the mass, and the pivotal cause of the accident largely lies in an outdated plane part, he still unavoidably should assume his liability. There is no ambiguity in whether or not he should get away with it, and eventually the case evolves into a self-awakening resolution to reshuffle one’s life from his damned addiction (there is a more-than-enough trek leading into the thematic revelation, thanks to Washington’s instinctive charisma, if falls into other thespian’s palm, which would induce an over-dramatic and self-conscious bravura just to appease the good-over-evil expectation from well-prepared audience. The final twist is histrionic but Danzel’s telling confession is superbly visceral even though has been fermented overlong. The Kelly Reilly tributary also negotiates through an engrossing damsel in mistress plight, until it emerges (a shade bluntly) with the main narrative, prompts the salvation-evoking meeting between a compulsive and recurrent drunkard and an inveterate junkie, it is not a fatalist love story of LEAVING LAS VEGAS (1995, 8/10) although neither of them is another’s messiah. Ms. Reilly, a rather under-used British actress, after many years of endeavor in Hollywood, finally grabs a much meatier role in a mainstream flick and she is never daunted by Washington’s suffocating presence, infuses a secular savor tallies with the formatively square film.  Robert Zemeckis shoots the most matter-of-fact airplane crashing process except the final collision, when CGI unavoidably reveals its tail, but the film stands unyieldingly on its ground as a preachifying morale parable, its motley spectators will never feel being offensive when it tries too much and many cliche settings keep hopping up, anyhow it is a laudable feat from Zemeckis, whom I feel spontaneously send my tip of advice (definitely I’m not a loner here), stopping meddling with the pricey animation gizmos and going back to the fertile soil where germinates FORREST GUMP (1994, 9/10)",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Robert Zemeckis is one of the best under-the-radar directors out of the last thirty years. He can tell a mindful story with such ease--granted he receives immense help from his on-screen counterparts. Fairly unknown actress, Kelly Reilly, is actually the finest part of the film.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "The actions sequences in the beginning of the film are top notch. Denzel is excellent in his roll as he usually is. However  I was disappointed in the plot flaws at the end. The coked up state he is put into to handle the questioning is far from believable and contrived for a \"hip\" plot twist.The questions about his opinion on a stewardesses sobriety in flight  as the pilot are absurd. But even more so is his inability to answer a simple \"I don't know\" to the questioning. His unrealistic breakdown is an insult to intelligent viewers. Should have had an alternative finish.",
      "total_reactions": 0,
      "user": "bayalistudio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "The movie opens with an intense scene, but then dwindles down into something far less intriguing, addiction. Not that that is a problem, but since the script could have been much sharper, smarter, and shorter, it leaves you somewhat disappointed. For what it was though, it was decent.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "The Flight is descent. It's first minutes have tension, sadness. The story continues, and gets a bit confusing. However, don't let that avoid the movie. While confusing at times, it's an emotional and an enjoyable movie, that will keep you satisfied. Also, the ending is terrific.",
      "total_reactions": 0,
      "user": "Cubixreviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Flight was a solid film made with solid precision by director Robert Zemickis; who finally makes his return to live action after a series of experiments with motion capture animation. The movie follows Capt. Whip Whitaker, an alcoholic pilot who save 96 of the 102 souls boarded on a plane that takes a nose dive due to technical failures, He saves them by executing a slick aerobatic maneuver that only a drunk could pull off in the given situation. Make no mistake, this movie was a character study, and a rich character study at that. It bares the devastating consequences of alcoholism and the challenging first step one takes in admitting they are an alcoholic. This study couldn't have been done any better without Denzel Washington, who owns the screen as Capt. Whitaker. The editing (particularly in that eventful crash sequence) was top notch work, without being too showy; and John Gatins' screenplay showed a sharp understanding of the subject matter at hand. This may not be anything too special, but it was way too good; Flight is sure to entertain on all levels.",
      "total_reactions": 0,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Wow....just Wow. This is the most meaningful, compelling movie I've seen in years. When I first saw the trailer of this movie, I thought what a silly premise for a movie. Little did I know, it would be a brilliant character study. I don't have many favorite movies, but this is definitely one of my new favorites I can add to that list. All the actors and actresses do a fantastic job. The director did a superb job...one of the great facets of a movie is to feel like you are watching real life and not just a \"movie\". Most movies can't achieve that. But once in awhile, a movie comes along that achieves this accomplishment. This is one of those movies. One of those movies that hits you hard emotionally because of the realism it is able to provoke. Since nowadays movies are just a way to pass time and escape from life, I'm proud to see a movie that challenges our thoughts and feelings on important subjects once again. A movie that makes us look at ourselves and reflect on our own decisions and actions. I hope to continue to see movie studios put out more of these kinds of movies. Movies that will help us understand the complexities of life and ourselves and help us confront them.",
      "total_reactions": 0,
      "user": "wesker2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Honestly, this was not what I expected going in, but all the same, it was a very good movie. Denzel Washington, as expected, was fantastic and the movie was captivating to the end.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Not oscar worthy in my opinion but a good movie. Makes you never want to take a drink ever again effectively. They just overdo it way too much. If someone drank that much they would of been dead of blood alcohol poisoning long before the storyline for this movie began.",
      "total_reactions": 0,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "A little long and really slows down when into enters Hollywood common ground with the unnecessary romance subplot. It also went the conventional uplifting route, abandoning the complexities at the beginning of the film. Not to say it's at all bad, just disappointing considering the thrilling and daring first act and the always captivating Denzel Washington.",
      "total_reactions": 0,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "This is one of the years best films. Not my favorite, but it keeps one interested the whole way through. Denzel Washington is at the top of his game. It is like he is not even acting, but actually is the role he portrays.  I would be surprised if he wasn't nominated for best actor at the Academy Awards. Robert Zemekis has given us a film that is dramatic, sad, heart breaking, and terrifying. I would have liked to seen more scenes with certain supporting characters, however Washington's performance helps one ignore that slight problem due to his power on the screen. Flight definitely soars.",
      "total_reactions": 0,
      "user": "FilmEqualsJoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "I wasn't exactly sure how excited to be over Flight. When I watched the trailer I knew that the most exciting part would happen fairly early on and would be pretty brief. I anticipated a lengthy investigation into Denzel's state of mind before and during the crash. What I didn't expect was a drawn out movie about alcoholism and addiction. Goodman provides some comic relief thankfully and Don Cheadle always plays a really good tight wad. But some characters really bugged the hell out of me. The red haired woman was entirely unnecessary and the family dynamic wasn't fleshed out well. Still, it's worth the watch to see the nose dive Denzel takes both in the plane and metaphorically.",
      "total_reactions": 0,
      "user": "Rob_Apples"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Flight is not what I thought it would be but was still a good movie. I have never seen Denzel or Don Cheadle in a complete bad movie so of course this was good. They list Nadine Velazquez like shes a big part of this movie but shes really not besides some exposing scenes.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Although there are some fairly disagreeable subject matter and pacing elements throughout it, \"Flight\" marks Robert Zemeckis's triumphant return to cinema, and yet another masterful performance from Denzel Washington.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Despite an Oscar worthy performance by Denzel Washington, the films too heavy-handed, redundant, and never quite takes full flight. The title of the film is deceiving in that it is more so about the descend (in more ways than one), and the resilience of the human spirit. For the first half-hour or so, \"Flight\" keeps us rapt with thrilling action and a troubling moral quandary. You strap yourself in for the next two hours and prepare to give yourself over to the in-flight entertainment. But after \"Flight\" descends from its high-wire act, the film reshapes itself into a fairly standard story about substance abuse, and the life-long endeavor of maintaining sobriety. Not incredibly entertaining or consistently compelling, but Denzel's Oscar worthy performance alone makes this worth the watch. Denzel does a perfect job giving us just enough to empathize for him but never enough of a reason to condone him either. To Robert Zemeckis credit, he directs a well-crafted film, loosely based on actual events. An interesting character study of a flawed hero we sympathize with throughout despite reoccurring disappointments. This flight reaches it's destination, but I don't think I want to get the round trip. For additional reviews visit: http://www.rottentomatoes.com/member/Nesbitt10",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "Any film that contains a role for John Goodman immediately gains a +2 in my book. And it does not hurt that the director is Robert Zemeckis, who directed two of my favorite films  Back to the Future and Castaway (oh yeah, and that not too shabby Forrest Gump). That does not mean everything he directs will be golden, but the concept of the film and Denzel on the cast certainly intrigued me more than your average film. And Mr. Washington once again proves that he could carry a weak script with his acting ability  and this was by no means a weak script. It felt long only once or twice but that was worth the more than satisfying character interaction. And the plane crash that is the centerpiece of the film was full of intensity and high suspense. That proves just how great of director Zemeckis is  even though you know the outcome of the scene, you still felt as if it were in total jeopardy. Brilliant film.",
      "total_reactions": 0,
      "user": "DisasterpieceMK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "whatever else may be wrong with this film it certainly has nothing to do with Denzel Washington's committed and convincing portrayal of an alcoholic pilot under suspicion for negligence after the aircraft he was piloting crash lands killing six people on board. The crash sequence is extremely well handled wringing out maximum tension.  Once grounded, though, the screenplay introduces us to sundry supporting characters that tend to make the story seem very disjointed. Each scene seems to feel like a tiny vignette filling in the background detail of his life which holds little real interest.. The Introduction of drug user Kelly Reilly also doesn't really add the necessary spark. In fact her main purpose is to show that her road to recovery is a lot quicker than the path Denzel's character chooses. The final outcome is somewhat predictable, but before the cloying reunion scenes with the estranged son, there is a really good key scene where bye Denzel is interrogated by a wonderfully understated Melissa Leo. Here the film really packs a punch, but for most of it's excesive running time Flight just doesn't take off.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "There was a sense of reality that made me love this movie, for someone who travels a LOT the airplane scene with the rain was grippnig. DW is simply a great actor, the director and cast fits nicely and I enjoyed the time I spent",
      "total_reactions": 0,
      "user": "jorel75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "This movie actually surprised me. I thought it was going to be like Flightplan with Denzel but it actually was a sustainable thought out drama instead of a three star action movie. It was a great feat of showing alcoholism in a negative light with an interesting story line. Not incredible but a very good movie that will get some critical acclaim.",
      "total_reactions": 0,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "After dabbling in the world of creepy pseudo-realistic motion capture with Beowulf, The Polar Express and A Christmas Carol, Robert Zemeckis returns to the land of the living with the tonally muddled, Oscar-ripe drab-drama Flight.",
      "total_reactions": 0,
      "user": "luke_richardson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Flight is a well made but somewhat uninvolving drama.  It starts off with a pointless nude scene that never seems to end.  Shortly after however is possibly one of the tensest scenes in movie history.  The plane plunging to the ground as seen through the cockpit, and passengers hanging upside down in peril create some pretty terrifying moments.  After the plane is down though the movie just becomes... well, boring.  Sure, the acting is solid, and you really root for Whip to pull himself together, but it comes off as merely meh.  It could have been tense and suspenseful, but it's mostly just unimpressive melodrama.  You're never really drawn in.  It's convincing, but not really much else.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Flight is a film that should be commended for its bravery and how many risks it takes, and for showing that Denzel Washington is one of the most deep and honest actors in cinema.  It has been about 12 years since we have had a live-action film directed by Robert Zemeckis, director of films such as Forrest Gump and Back to the Future, and he has returned with a triumphant film about substance abuse and lying to ourselves and others around us.  We are given a protagonist named Whit Whittaker, and he is a deeply flawed human being.  I mean he drinks, he uses drugs, and he has lost his family because of it all.  This man really has nothing going for him, and as the film goes on we see Washington dig deep into the role and make this one of the most mesmerizing and sad performances I have seen in a long time.  This movie is that kind of movie that makes you never want to drink alcohol again, similar to films such as Ray or Walk the Line, and it shows a man just go through hell because he has an addiction that he just can't stop.  But I actually felt some pity for this man as well, because we can tell at some level he is a good man and wasn't always like this, in fact he was a great father and great husband from what the movie shows us.  Zemeckis truly snows how to reach the core of his viewers and give them a truly remarkable film.  I will admit that I wish I had seen more of John Goodman's character, and that they could've dug deeper into the stories of some of the passengers on the plane, but these are just small complaints about a fantastic film This movie makes you appreciate your own life and how some things in life might just be an act of God that we can't control.",
      "total_reactions": 0,
      "user": "BreakingBrad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "I hate airplanes. This isn't scary because it happens. It happens rarely. When it does happen chaos happens. Ride at your own risk. Lesson learned.",
      "total_reactions": 0,
      "user": "EddieHokie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "While many have complained about the heavy handedness and self-righteousness of the movies general theme (or great moral lesson) there is no escaping that it is still well acted by it's grade-a class of actors including Denzel Washington, Don Cheadle, Kelly Reilly and the incorrigible John Goodman who even at a brief 10 minutes of total screen time is by far the most memorable side character of the film. Yes, in parts, the movie plays like a triple A recruiting tool for Alcoholics Anonymous. That isn't to say that the movie is bad. As a viewer, I realized I had been feeling impassioned by characters who spent no more than 10 minutes in front of the camera (one of them making her appearance as a topless flight attendant in a skinny red thong). However trite or mundane these characters are introduced, it only takes a few key scenes to be locked into their own web of misfortune, while feeling the deep seeded morose of Washington's Whip Whitiker. In the end, giving it time and consideration, the movie is far from trite and as moving as Washington's past performances. Not an outstanding movie (and maybe even one that could very well crawl under your skin sometimes), it's not all bad. Given a chance, there'll be moments when it surprises you. **3 out of 5 stars**",
      "total_reactions": 0,
      "user": "joey-clemenza"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "The end scene is embarrassment to the clever build-up and solid role played by Denzel Washington. What a disappointing way waste a good story that had potential for so much more.",
      "total_reactions": 0,
      "user": "Mr_Muumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Ótima mescla de Drama e Ação, as cenas do avião são sensacionais, muito boa as montagens e sequencias, muito tenso. Denzel está num dos melhores, senão o melhor dos seus filmes, a batalha dele com as drogas e principalmente o álcool  se refletir. Excelente Filme!!",
      "total_reactions": 0,
      "user": "ksatch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This is not an amazing movie, nor is it a bad movie. It is enjoyable with all actors involved portaying believable characters.",
      "total_reactions": 0,
      "user": "bm2759"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Denzel Washington is the king of drama movies  that's it  no one could play that role better than him",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This is a good film not a great one.  Denzel Washington gives a good performance that makes this film better then it is.  So overall a good performance from Denzel that lifts this film to a 7 for me.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "Overall, Denzel Washington gives a good performance for a character that is not in the one bit likable. As character stories go, Whip never learns from his mistakes, but that's kind of the point of the character development. Because his addiction is so deep, his life revolves around alcohol and it's been his only escape from all his failures as a husband and father, and his failures as a noble and good person. The movie is ok, but spends too much time playing around with the idea of the plane crash and everything that happens as \"an act of God,\" when in reality everything happens for a reason. But the whole time, Whip never learns. I guess that's the point of the movie. In that case, the message is flawed and difficult to really enjoy.",
      "total_reactions": 0,
      "user": "bitterblue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This is no Robert Zemekis movie. This is something much more. Truly, this is a different direction that Zemekis has taken, but he without a doubt pulled it off. Flight is an engaging movie that soars in both acting and storytelling. But for sure, Denzel Washington's portrayal of Whip Whitaker is what helps make the movie so magnificent. Also, the movie had some amazing screenplay. John Gatins is a pure genius. I hope he keeps writing these awesome screenplays. One supporting character that struck me was John Goodman. The movie's that he's been lately are for sure putting him back on the radar. This is the comeback of John Goodman. I can't wait for him to bring back Sulley in \"Monster's University.\" The only thing about this movie is that I wish it was nominated for best picture. It really deserved it! Overall, it's a breathtaking story that soars.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "IN MY OPINION **MAY CONTAIN SPOIILERS** by CtheTav This film is not what it seems. I expected to see some kind of action epic based on a plane with a drunken pilot trying to save the day. Apparently the trailers lied. What I saw was a story of a man battling addiction and the overarching story of the culture to blame and compensate that society has become used to. Denzel Washington plays the part of an alcoholic pilot struggling to sober up for an enquiry in to the crash seen in the films trailer. The story is suitably dark and shows the lengths people will go to cover their own asses and place the blame somewhere else without going too far i.e. full blown murder conspiracy. Robert Zermeckis seems to get a lot out of Washington who gives possibly his best performance to date and the film manages to tell the story over a longer time frame without resorting to narration which is always a plus in my opinion. The romance in the film seemed to drag on and I felt it didn't really add to the film and took away from the story. I liked the overall disturbing feeling that the film gives off after watching which is a sure fire sign of some kind of emotional investment. Rating 6 out of 10 A fairly thought provoking experience with rather unnecessary portions",
      "total_reactions": 0,
      "user": "CtheTav"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "Flight stars Denzel Washington as Whip Whitaker, a pilot who can fly a passenger jet through the eye of a needle even though he's downed enough alcohol to put Haystacks Calhoun on his keester.",
      "total_reactions": 0,
      "user": "G_Thomas_Boston"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "A good, solid story about the fall from glory of an arrogant pilot. It can be seen as a metaphor of addiction. Substance abuse makes you fly high, but you lose track of your limits and people around you start to dislike your self-centered attitude.  Some of those people are lost forever; others may still be around to forgive you.",
      "total_reactions": 0,
      "user": "dierregi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "I liked watching the movie (good performance, interesting story,...) but i was disappointed with the morale. Too much of \"i am a sinner and i deserve to be punished\" for me...",
      "total_reactions": 0,
      "user": "Migst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Great story, a bit discouraging and kinda diced it in the end, perhaps they even tried to convince you in seeing some positivity in being locked up in prison. No, the end was ruined for me.",
      "total_reactions": 0,
      "user": "Angel1711"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "In this 2012 film, Director Robert Zemeckis shows-off his filmmaking chops in the film’s first forty-five phenomenal minutes. The plane crash in Flight is spectacular and original. A fresh new take and a welcome addition to the genre, it’s unlike any other plane crash I’ve seen before.",
      "total_reactions": 0,
      "user": "theseparator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "While some may think Flight is just about a drunk, cocaine addict who has a drinking problem and confesses at the end, the film goes deeper than that. That is a very raw, unobserved way to put the storyline. While a narcissist might categorize the movie as a drug addiction film with drugs, beer, hooker and porn movies, I say, watch it again. Flight takes the tor of man who has addiction problem, and add drama, suspense, and a kick-ass plane crash sequence to top it, probably one of the best scenes involving a plane ever. Denzel puts on his usual rock star performance, and the movie just goes into \"flight\" from there!",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Flight is a cinematic masterpiece - it is emotionally captivating, a superb plot, and two oscar-worthy performances from its two oddly likeable leads.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "My issue with this movie is how terribly anticlimactic it was. Several times you feel build up but it just get's squandered away.",
      "total_reactions": 0,
      "user": "beccaisapunk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "Wow! Oscar winning actor Denzel Washington plays a pilot! and then gets causes a plan accident cause he's intoxicated. Director Robert Zemeckis has an unique way telling stories, in this film he capture's Denzel's befuddle performance as the pilot. Grade B",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "A pretty well acted movie but I didn't enjoy the storyline to much. The characters in this movie were great and they were usually really funny. And I did really enjoy the plane crash and a couple other scenes but the movie wasn't amazing by any means. A couple and in particular one scene could have been removed and it could have lost its 18A rating and they were kind of un needed. A ok movie with good acting",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Flight just might be one of the best dramas of 2012. Denzel Washington plays a pilot who was able to save many people in a plane failure by pulling an amazing stunt. The plane was consisted doomed along with everyone aboard due to a mechanical malfunction. Denzel’s character was able to gain enough control resulting in the safety of many of the passengers on board. The crash scenario the film portrays acts as only the driving point and set up for the following events. We soon find out the pilot may not be as heroic as the public views him, as information surfaces proving that the pilot was intoxicated. This leads to a very realistic series of events that builds tension and raises questions. Denzel Washington’s performance in Flight was spectacular and the way he unveiled his emotions was perfect. The cast was packed with excellent talent from John Goodman, Don Cheadle, and Bruce Greenwood all of whom played entertaining roles. The soundtrack was different than most dramas, but worked really well with the way it was edited together. My only major gripe with the film is the time taken to introduce characters that in the end didn’t really matter. Flight did an exceptional job of dealing with some heavy content, intense moments and heartfelt scenes. In the end, Flight soared.",
      "total_reactions": 0,
      "user": "B-RAX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "This film is very good at character analysis and that it shows that things are not always what they seem to be with excellent performances from Denzel Washington. Flight is exciting - terrific, really - because in addition to the sophisticated storytelling techniques by which it keeps us hooked, it doesn't drag audience sympathies around by the nose, telling us what to think or how to judge the reckless, charismatic protagonist played by Denzel Washington.",
      "total_reactions": 0,
      "user": "toronto905"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "A very entertaining movie to watch and what an awesome performance from Denzel.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "A joyless white knuckle investigation of addiction. Flight is less an action picture than it is a character study which begs the question, can an irredeemable person be redeemed by one heroic action. Save this one for a rainy Sunday afternoon watching basic cable.",
      "total_reactions": 0,
      "user": "Cinemaphile"
    }
  ]
}