{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Flipped",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 27,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "It sounds like most of the critics have forgotten what Love is like, I watched \"Flipped\" with my daughter and found it enchanting and memories of being in love at that age came racing back....Excellent acting by all, especially the kids and whether the adaptation is true to the book or not it came across great and would highly recommend it to any family with kids in their tween years.",
      "total_reactions": 1,
      "user": "in2themusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Of course the critics would not like this film.  This piece is so careful not to clutter realism with the idle meanderings of a writers mind that one is amazed by how simple and realistic the film becomes.  It is perhaps one of the best coming of age or self realization pieces I've seen.  There is an excellent ensemble cast.  The piece is limited technically.  This isn't a comic book adaption and it's certainly not a reworking of an overworked Tolstoi piece.  It's just a simple slice of life portrayed without a lot of tricks or visual effects or mass murders.",
      "total_reactions": 1,
      "user": "NJWolfgang"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of the greatest movies i've seen. the screenplay is fantastic. humorous and enjoyable. I would recommend this movie to anyone of any age.",
      "total_reactions": 1,
      "user": "Merdocx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "In my complete own personal opinion this is the best movie I have ever seen. There's just something about the way it ends or the way that its brought out that makes me just want to keep watching and gain an incredible interest in Juli and Bryce's life. This movie will stick with me and be watched for a long time.",
      "total_reactions": 1,
      "user": "HePimp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Flipped achieved one great thing, and that is to produce a feeling on me. At the end of the day that is one of the most important things that movies should ultimately accomplish and aim for. This movie presents one of the most ironical but true love stories that can touch many if not everybody in some way or another. Granted, it could be a bit heavy at times given its structure. Flipped interludes between the two main character's perspective on each of the several situations that they cross upon, and that opens the gate for a lot of repetition which can be a little frustrating. But overall, Flipped couldn't have been any other way; it successfully reaches so much depth because of this enduring but intriguing concept. At the end, this movie takes you back to the days of the first true love, and also to the days that resembled the meaning of what it was to be young.",
      "total_reactions": 2,
      "user": "Gilberto"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Man I can't believe this movie has gone under the radar for so many people! I feel sorry for the people who haven't seen or heard of this movie! This was one of my best movies of 2010 by far! Rob Reiner done a fantastic job! The movie has the 'Stand By Me' feel!!! It was a really cute love story! I would recommend this for a date movie for sure! If you don't have a date please still it a go cos you won't be disappointed!!!",
      "total_reactions": 1,
      "user": "HEI5ENBERG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "This is the cheesiest teen romance there's been since the Twilight Saga. I have no idea why people like, it's the most cliche, unfunny, and cheesy movie that I've ever seen. Oh, and another thing, WWWAAAAAAAAAYYYYYY too much narration. However if there is one good thing about this, it's the music. It has a nice 60s soundtrack to accompany it's setting, but other than that it's terrible. Open your minds, people. This is junk!",
      "total_reactions": 0,
      "user": "ZNLK111"
    }
  ]
}