{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 102,
  "mc_movie_name": "Focus",
  "mc_negative_rating_frequency": 30,
  "mc_positive_rating_frequency": 111,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 88,
      "summary": "This is just sheer, escapist entertainment from start to finish."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 80,
      "summary": "Like a perfect cocktail mixes the sour with the sweet and the bright with the boozy, Focus combines seamless, superbly-crafted filmmaking with the fizz and fun created by its leads."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Focus begins so elegantly, wittily and quickly that it sets up expectations it can’t quite fulfill. Yet if not every coincidence can be explained, if not every improbability gets addressed, it’s a satisfying diversion in a winter which, as usual, has too few of them."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Focus is uncommonly good for a February release (damning with faint praise?) but may not clear the bar of being worthy of a trip through snow and ice to reach the multiplex. Star power, actor chemistry, and caper movie twists make for a nice diversion… but not much more."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Co-stars Will Smith and Margot Robbie remain consistently charismatic, even once the script for this heist caper collapses in a punishing pile of its own twists and double-crosses."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "What keeps the film humming along as smoothly as it does is the chemistry and charisma of its leads."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s beautifully photographed and entertaining, with charming performances by Will Smith and newcomer Margot Robbie that tease and tantalize. You won’t be bored."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "Ficarra and Requa are good at creating a sense of momentum in their films that carries you along from scene to scene, and a film like this depends largely on chemistry. Smith and Robbie have bundles of it, so there is an easy pleasure to watching them circle each other."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 75,
      "summary": "In spite of its incessant piling on of double-crosses and triple dog dares, Focus is a pleasant change from Academy Award seriousness. It's reassuring to see Smith resurrect the charisma that After Earth stripped away, and nice to see Robbie do anything, anytime."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "The preposterousness of the story doesn’t seem like a rip-off, since the twists in the plot, for the most part, pay off nicely."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "The film is breezy from start to finish."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "Smith and Robbie have great chemistry together, and neither of them try too hard to complicate their fun, sexy partnership."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "While not quite the “art” it’s billed to be, if the perfect con is about diverting one’s focus, then this one keeps you distracted till the end."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 70,
      "summary": "There's no honor among thieves, but there is dignity in Focus's ambition. And if the final film is more vodka ad than all-time classic, there's still no shame in pouring another cocktail and rewinding the tape."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "It never loses the dazzling surface polish, but without trying to dig deeper, the movie strings us along in the hopes of something more, not unlike one of the cons at its center."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "A genre movie like this one depends on pacing, and Focus hits at least three dead spots in the final act. Writer-directors John Requa and Glenn Ficarra get so much right -- the sleek look, the plot set-ups, those montages in New Orleans, the supporting cast -- that it's painful when they can't maintain Focus and land it, before and after the big reveal."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 67,
      "summary": "Focus only works if the balance of ingredients is right, and from the cast, Ficarra and Requa get everything they need."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Focus, which was co-written and directed by \"Crazy Stupid Love\" creators, Glen Ficarra and John Requa, is drunk on its perfume-ad cinematography and doesn’t know when to quit with its double-double cross plotting."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "There’s a terrific popcorn movie in Focus — a con-game romantic comedy that bubbles along on a playful high and that keeps the audience guessing in a state of delighted suspension of disbelief. Unfortunately, that movie is over after 40 minutes, and Focus still has another hour or so to go."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "I'm a sucker for caper movies in which impossibly clever con artists do impossibly dangerous things while looking impossibly gorgeous. I could feel Focus trying to be that caper. I'm not asking for nirvana, such as Hitchcock's \"Notorious\" or David O. Russell's \"American Hustle,\" just a taste of sexy escapism. A taste is all you get in Focus, but it'll do till the whole enchilada comes along."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Will Smith and Margot Robbie bring low-key erotic chemistry to an easy simmer in Focus, a smooth, sophisticated, often amusing little caper flick."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Focus never quite comes into clear view. It's a muddled and twisting romantic caper that at times feels like Steven Soderbergh lite."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "After some overly talky revelations, the cornered writer/directors are forced to shatter their absurd shell game with a final act of violence that spoils the breezy, capering mood that prevailed for much of the movie."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 63,
      "summary": "Focus is a shiny, stylish shell game of a film that, much like its protagonists, relies on breezy chatter, a good sense of humor and a lot of misdirection to succeed."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "The pieces click together nicely in what ends up being an overall enjoyable package."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "Although it brings nothing new to the con-artist fold, or even anything thrilling, Focus is a seductive enough rehash that benefits from the built-in pleasures of the trade."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "This is maximum-gloss entertainment with its fair share of tricksy rug-pulls. But, like one of the neon-coloured cocktails Smith drinks in it, it’s more of an immediate rush than something you’ll remember in a year."
    },
    {
      "critic": "Andrew Lowry",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "With the story fit to burst with an Ocean's trilogy worth of hustles, tricks and grifts (some of them smart, others groan-inducing), at least Robbie is the genuine article – sharing playful chemistry with Smith, but ultimately stealing the movie from right under his nose."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 60,
      "summary": "The chassis may be slick and speedy, but under the hood Focus lives up to its Ford-produced namesake: sturdy but not exactly stimulating."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 58,
      "summary": "This is the kind of movie where we’re not supposed to know at any time who is playing whom, but since the characterizations are glossy and paper-thin, it’s difficult to get worked up about who gets fleeced."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 58,
      "summary": "On the most basic level, the con-artist romance Focus is a Cary Grant movie in the \"North By Northwest\" or \"Charade\" mold."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "This con artist caper from the writer/director duo behind \"Bad Santa\" and \"I Love You Philip Morris\" bears some superficial resemblance to the 2005 romantic comedy \"Hitch.\""
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "The movie pulls off the worst kind of con: the one that disappoints."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "Screen chemistry between two individuals isn't really a pass/fail proposition. There are degrees involved. But let's pretend otherwise and say yes, Smith and Robbie pass, barely, with less than flying colors and in a pretty dull movie."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2015
      },
      "score": 50,
      "summary": "This ultra-slick, fantasy-inducing visit to an international wonder world of wealth and deception plays more like an inventory of thieving and gambling techniques than a captivating diversion, even if it's hard not to be voyeuristically pulled in by some of its ruses."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Smith makes Nicky too obviously insincere, with a grating, gloomy edge – which means he never suckers you in, and the fun dries up before it ever starts."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Ms. Robbie, on the other hand, aces her role from the start; she’s got an unerring gift for romantic comedy. Still, the film itself comes to feel like a con, thanks to a script that’s too clever by two-thirds, and butterfingered in the ways of portraying love."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "The film turns out to instead be a strained trumpeting of the return of the proverbial king of the box office."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2015
      },
      "score": 38,
      "summary": "A weak villain, a couple of eye-rollingly unlikely cons and dead stretches that make 105 minutes play like 145 and you've got Focus, the last dog of February, where comatose con job movies are released to the sounds of silence."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "Preposterous, slipshod, unfunny and emotionally null."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 25,
      "summary": "The emotional core of the movie, the relationship between Nicky and Jess, lacks impact, mostly because you can’t believe a word that they say, but also because Smith is not a strong leading man."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2015
      },
      "score": 20,
      "summary": "Will Smith may have run through every trick in his bag. In Focus, the one-time fresh prince and former box-office champ looks tired, bored and, even worse, uninspired."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "For some reason that I could never figure out, Will Smith has a pained look on his face for most of the movie. It's annoying, and it belies his typical confident self that we all know and love. And why would a movie of this profile ever stage a super bowl with fake teams? Get the licenses, producer! Highly bootleg. Margot Robbie is great, but she doesn't really extend herself much at all. Not like Annette Bening in The Grifters, or Eileen Brennan in the Sting. And unlike those other movies, Focus lacks \"bite\". It's getting a Vanilla Ensure when you were hoping for a rich Haagen Daz chocolate shake.",
      "total_reactions": 9,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Focus is one slick blur.  In this romantic comedy, half the movie is spent  explaining what just happened and the other half nothing does. Smith's flim flam man falls head over heels for his fledgling  grifter.  But unlike Tracey and Hepburn - Pitt and Jolie or even Newman and Redford - Smith and Robbies' banter lack rhythm and levity and there are no fireworks. Some leading men best go it alone. Even with a co-star twenty years his junior who is hot hot hot - Smith's sexual chemistry flickers.  And the third wheel- Adrian  Martinez- steals the film.  Surprisingly, with all it's preposterous twists - this caper  telegraphs it's ending.  Holy toledo !",
      "total_reactions": 5,
      "user": "hotfromcauldron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Watered down version of Oceans 11 rip off. Misleading title! But it goes with how the film is supposed to make you FOCUS on the con games the characters act out, all the while, the movie audience are the ones being scammed. Good start, lousy finish! Terrible and sloppy direction, weak script doesn't flow, neither does the characters. Its all over the place. Its just for shock and awe! Will Smith was overused.",
      "total_reactions": 3,
      "user": "chughead"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Focus starts out great, following in the footsteps of some of the terrific con films (it pays homage to) by being confident and strong enough to let the audience be a part of the con.  Once the film abandons that approach, though, and relies instead on weak deception and convenient twists, the audience is no longer the film’s partner.  Instead, the audience becomes the film’s mark, and no one wants to be taken like that.",
      "total_reactions": 3,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Will Smith plays a master con man/thief, who takes an \"intern\" (Margot Robbie) under his wing. They get deeper and deeper into the deceptive world of fast fingers and fast-talking, while their romance complicates matters. The twists provide a few surprises and the characters are interesting (esp. Robbie, who's not only beautiful, but charismatic). The pace gets thick before it ends, but it's still slick and entertaining escapism.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "The Will Smith redemption movie, Focus, was a bit of a step up from After Earth. He could honestly only go up following After Earth.",
      "total_reactions": 2,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Will Smith and Margot Robbie obviously had a blast jetting around the world making this, but for the viewer the first half will be remembered a lot longer than the second. An Ocean's 11 style caper about good looking, loveable conmen it certainly has its moments (the racetrack scene being a highlight) but at the halfway point it shifts its focus and the final leg is a real drag with a wholly unsatisfying conclusion.",
      "total_reactions": 1,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "Will Smith is back in Hitch: How to Get the Girl, Also Some Cash. There's overwhelming opulence, exotic setting and beautiful ladies at display here for the grand dramatization of thievery. It showcases a glamorous lifestyle, riches and ladies, portrayed by the charismatic leads. However, the movie recycles this material too often and having too much investment in lovey-dovey banters does wear the tension thin.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Pretty decent movie with just a few fun scenes.. al though i liked it but i think the story could be a lot better! Still i don't regret i watched the movie in IMAX",
      "total_reactions": 1,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "You know a movie is bad when it doesn't even follow it's tagline. Focus is a terrible con movie which cons the audience with it's good trailer and impressive cast, which can't save this convoluted mess from it's filler filled plot.",
      "total_reactions": 1,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "\"Focus\" hits the ground running with an electrifying first half, then it stumbles and falls hard. The opening in New Orleans is energetic and slick, the pacing is brisk, and the comedy and action is deftly and effectively mixed. The second half, however, jarringly ventures into thriller territory the film is neither confident nor comfortable in navigating. There are glimmers of brilliance - B.D. Wong's cameo, a scene in a car with a methodical assassin - but the end result of the film is muddled, with far too many twists, loose ends, and anticlimaxes. Will Smith more than has the requisite charisma for a part such as this, but the film is beneath him and he seems aware of this throughout, which detracts from his performance. Meanwhile, Margot Robbie (who was excellent in \"The Wolf of Wall Street\") is awkward in an underwritten role, which is more the scriptwriters' faults than hers. Furthermore, the two seem mismatched and have little-to-no discernible chemistry. This is a misshapen, confused, weak, and generic disappointment of a film which doesn't do justice to its stars or accomplished beginning.",
      "total_reactions": 1,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Focus is a terrible con movie which cons the audience with it's good trailer and impressive cast, which can't save this convoluted mess from it's filler filled plot.",
      "total_reactions": 1,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Second part is extremely confuse, the ending is bizarre and Robbie's character is poorly developed but we have here a quite good entertainment. Focus is funny, amusing and it definitely gets your attention. Chemistry between Smith and Robbie is perfect! If you wanna have fun, watch it. If you want more than just have fun, go check something else.",
      "total_reactions": 1,
      "user": "danipp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Focus was a decent movie, but it didn't quite have enough substance to make it truly good.  In typical con movie fashion, there were a lot of good switch moments, where the audience is left looking from one person to another and trying to assess who's lying, who's telling the truth, and who's in on the con--plus there are good twists and surprises throughout to keep you guessing, and I had fun afterward going back and rethinking earlier scenes in light of information that came out later on in the movie's plot.  The central component of the whole story is the love plot between Will Smith and Margot Robbie, but their relationship wasn't given enough foundation to make it a compelling romance.  Still, the movie has really fun moments of petty larceny, gambling, sexual tension, and just a touch of violence.  Not a great movie, but not a bad one either.",
      "total_reactions": 1,
      "user": "heatherm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I found this movie just ok at best.  What saved it for me was the twist near the end.  I must admit I did find myself doing the obligatory \"eye roll\" more than once... I didn't think the chemistry between Smith and Robbie lived up to all the hype.  It served its purpose on a rainy Sunday... Maybe put it in the \"renter\" column...",
      "total_reactions": 1,
      "user": "keltl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Great comeback from After Earth, Mr Smith.",
      "total_reactions": 1,
      "user": "Lukesikwebu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "\"Focus\" is definitely a step-up for Will Smith after his roles in the atrocities that were \"Winter's Tale\" and \"After Earth\", but just how big is that step? Sadly, it is only a very small increment. This movie falls into the kind of entertainment that you have to turn your brain off to enjoy, and where the absurdity of the plot is far funnier than the cheesy jokes written in the script.",
      "total_reactions": 1,
      "user": "lomeli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2015
      },
      "score": 4,
      "text": "Nicky Spurgeon (Will Smith) is a career con-artist who is  targeted in a hotel bar by Jess Barrett (Margot Robbie) for a sting of her own after she spots his expensive suit and other accoutrements. Seeing through the scam instantly Nicky offers some advice on how to become better at conning others, and telling Jess to 'die with the lie', to never break character.",
      "total_reactions": 1,
      "user": "YorkMan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "It's a pretty weak movie. The opening is decent, but the film's main caper is dumb. It's not so much full of dramatic ambiguity as it is muddled and unclear. There isn't really any dramatic turn for the characters, and the tumults of their relationship make no sense. The ending is lame and anticlimactic. And frankly, it just seems like the once great Will Smith has been phoning it in for a while now.",
      "total_reactions": 6,
      "user": "ahnehnois"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "focus is probably the most average movie have seen in a long while. it's not that good and it's not that bad it's just there and it can be really boring at times. will smith may be more suited to this role than he has been in his more recent roles but it still feels like he's slumming it till he gets to play Deadshot in suicide squad and doesn't have brilliant chemistry with co-star Margot Robbie who gives a decent performance. the film also doesn't quiet have the intelligence to pull off the sting movie plot and as a result a lot of the reveals don't hit the mark and come off as rushed and ill fought out. still it's not awefull and i would say i really enjoyed the scene in the football stadium",
      "total_reactions": 5,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Focus is an enjoyable caper, that entertains and gives us a whole new look at Will Smith and his acting. The writing and dialogue is slick and catchy, that doesnt over do things. Smith is fantastic is the lead and Robbie does a presentable job as well. The story is generic, but the elements and the characters of Nicky and Jess have powerful chemistry. Focus works, part black comedy, part thriller. But it suffers from lack of supporting cast that could have made it better. Rodrigo Santoro's Farraga is your mediocre playboy villian that doesnt add spice to the story. However, Focus is enough thrilling and edge of your seat madness to keep you along for the ride.",
      "total_reactions": 6,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Horrible acting by Will Smith. One of the worst movies I've seen. This movie makes After Earth look okay. I used to be a huge fan of Will Smith, but he needs to stop",
      "total_reactions": 10,
      "user": "xenojoey"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "I loved Focus!!!' This movie was very sophisticated, I laughed, I almost cried a few times, I said to my self no please don't do that so many times as well. Will Smith and Margot Robbie are the best couple on screen! If you like movies that make you think and put you on the edge of your seat Focus is the one for you! Oh and Margot Robbie is so hot and the best Young actress in Hollywood right now!",
      "total_reactions": 11,
      "user": "Mell0srt4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "En todo momento me pareción estar viendo una versión oscura de Hitch, pero debemos agradecer que tenemos la interpretación de una sexy Margot Robbie.",
      "total_reactions": 1,
      "user": "chepod8"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Focus is full of twists and turns but despite this the film manages to stay fairly clear. A movie about con artists is bound to fool you a little bit and its not riddled with clichés. Will Smith is back and as good as ever. I really think this guy like doesn't age. This movie a little bit more vulgar than you expect from him because he generally does films that can be enjoyed by teens and adults. This movie is more of an adult film and you hear a lot of cursing form Smith which is a rarity. Margot Robbie is also a great accomplice for Smith and the two have great chemistry. They create some humorous moments together. Focus blends many genres of film into one great movie. I'd skip fifty shades and watch Focus if I were you.",
      "total_reactions": 2,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Overall, Focus is an exciting, fun movie with nice twists making you guess what is going to happen next. Will Smith is great in this movie as a con man with some great supporting actors too.",
      "total_reactions": 1,
      "user": "prawntoast1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Will Smith gave a fine performance, likeble, yet ambiguous. The complications begin to pile on as the Big Con develops. What is the scam? Who will end up the winner? Found it a fun ride.",
      "total_reactions": 1,
      "user": "wolfen608"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "MOVIE IS AWESOME ONE TO .. LITTLE LAGGY IN SECOND PART ...",
      "total_reactions": 1,
      "user": "PRAJEE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Okay, this isn't the best movie out there, but Focus was watchable and somewhat entertaining. Will Smith is okay in this film, but he was annoying at times. However, Margot Robbie is amazing in this film and she is hot.",
      "total_reactions": 1,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "You shall be entertained for the first 15 minutes but after that you will just linger in limbo.",
      "total_reactions": 0,
      "user": "trooper1993"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Focus is a light summer movie that doesn't take itself too serious. But the same can be said about the actors that are in it. It feel like a movie that was strongly inspired by Ocean's Trilogy, but storywise rushed. A few moments are worth the attention and you probably won't regret watching it, but I seriously doubt that you'd recommend it or watch again.",
      "total_reactions": 0,
      "user": "B3ckett"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Good, entertaining con-artist film. Those are always fun because you never know if the lead characters are \"on the level\" or scamming., and most of the time it's the latter. It becomes dicier when feelings/romance are involved but still unpredictable. There's lots of entertaining twists and turns with a great callback scene at the end. Not a fan of Will Smith's propensity to go interracial, though. I just wonder his motivation there.",
      "total_reactions": 0,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Focus was boring at times but had moments were i was fully engaged. It simply escapism and hardly has an ounce of reality in it but with some plot twist was relatively interesting.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Overall, it is a good movie that is nicely made. The story was average, but the characters were likable. Will Smith is the lead, but  Margot Robbie is the memorable one. Just like in the Wolf of Wall Street, she gives another great performance.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Focus had potential to be one of the best con-artist movies ever but it just lost it's way and came up not being believeable in the end, but it was ok. Firstly Will smith and Robbie Executed their roles beautifully, the first half of the movie was amazing it started out simple then stepped it up, it was dramatic, exciting and completely believable UNTiL will smith does something to Robbie which made no sense you just felt like going why would he do that and there was never a reason, and that's were the film lost it from there.the second half of the movie was unbalanced and not well planned. Gerald McRaney's  role was  completely out of place and confusing and Rodrigo Santoro's character started strong but fell overtime.You just fell not completely satisfied by the ending but just managed to be a good enough film in the end.",
      "total_reactions": 0,
      "user": "T-rodney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "“They don’t make them like they use” so it is said but “Focus” proves them wrong. It is a movie about the con artists trade and giving basic lessons in how to work the trade. The thing with con artists is that you don’t know if and/or when they are conning each other.",
      "total_reactions": 0,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "It's one of those films that if it were fun, you could forgive the painfully obvious script, the absurd plot twists and the incredibly uninspired acting. The problem is that it's not fun.",
      "total_reactions": 0,
      "user": "mmweiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Focus is slightly above average. What it lacks in plot cohesiveness, it more than makes up with its stylish direction, charismatic actors, and compelling twists and turns. Though the twists and turns can be kind of annoying after a point, however, so that is not a major plus, but they do work for the most part. Truly, this one is incredibly sleek and sexy as a thriller, but also manages to have enough humor and quality one-liners to make it passable as a comedy. When watching Focus, however, it is hard to take your eyes off of Margot Robbie, who really knocks this role out of the park, as does Will Smith. Without their coolness and charisma in the lead roles, Focus would be a far lesser film and they really exude the right type of personality to convince you of damn near anything, as conmen should. Overall, Focus is not a great film, but is quite well made and is just stylish enough to overcome its many shortcomings.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Kicked off well, kept the momentum, but the end was...",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "The first hour of Focus is actually quite fun and has a great soundtrack. Of course, Will Smith is going to play Will Smith and Margot Robbie, well, she's going to play the insanely good-looking Barbie. It reminds of the good moments of Ocean's Twelve. Unfortunately, the core plot is very, very dishonestly idiotic (albeit not so predictable) and it ruins the entire movie. Which, to be clear, never meant to be a great caper, instant classic film, but could have been way more fun if they had let it spin in that direction a bit longer.",
      "total_reactions": 0,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "FOCUS has large ambitions that it doesn't quite live up to, but that in no way means it's a bad movie. The film may not be perfect, but still it provides enough wit and creativity to make it an intelligent diversion.",
      "total_reactions": 0,
      "user": "NFW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "Sophistication, well developed and exciting are just some of the things that you won't get from this film.  The premise is far from interesting, believable  nor is it new or done well.  It was so easy to see what was going on from the start with this film.  The several attempts to make the audience wonder who was playing who are so evident, that the surprises are more like a delayed plot that the audience has already figured out.  Another poor film from Will Smith, another pointless film from the most uncreative time in cinemas history.  Its films like this that really turn me away from the US film industry.",
      "total_reactions": 0,
      "user": "itmo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I'm not sure why this movie had any bad reviews about it at all. Not trying to say it's a masterpiece, but Focus deserves the benefit of the doubt from any avid movie-goers. It was a refreshing take on the crime/romance genre. A bit of a raunchy, and maybe a tad dry sense of humour certainly helps to appreciate it's funnier moments. The movie doesn't allow you to place your trust in either of the characters, making it a little difficult to relate to them through the bulk of the movie. But if you hang on, the movie successfully establishes empathy and any hopeless romantics in the audience might even need a tissue. Great date flick, and also great flick to watch with friends. Rare item.",
      "total_reactions": 0,
      "user": "wilsonadams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "\"Focus\" is unpredictable with a few twist and turns you barely see coming, the writing-directing team behind \"Crazy, Stupid, Love\" \"I Love You Phillip Morris\" and \"Bad Santa\" manages to make a exciting, funny thriller with two stars that have sensual chemistry in this \"old school film.\" After starring in Martin Scorsese's The Wolf Of Wall Street, newcomer Margot Robbie continues her streak of brilliance and indeed does she make a great performance so does her co-star Will Smith who have dynamite chemistry with one another. Will Smith plays Nicky a con-artist (just like in Hitch) takes Jess (the stunning Margot Robbie) under his wing, shows her the tricks of the trade, they both have a love interest with one another, when Jess gets uncomfortably close, Nicky ends their relationship. Three years later, Nicky is in Buenos Aires, working on a dangerous scheme when Jess unexpectedly shows up she is now a skilled professional femme fatal, making Nick's plans messed up. She throws Nicky for a loop of time at a time when he cannot afford to be off his game. Yes this film has it's problems lacking a sharp-script, but Glenn Ficarra and John Requa's script is filled with intriguing set-pieces, every single character is so appealing. One of the best funniest things in the film is Adrian Martinez who play Nicky's friend also associate who has some funny one liners. Not to mention Gerald McRaney is fantastic also is equally good. It's one of the best films that is both a rom-com/thriller. 4.5 out of 5 stars",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Enjoyed the first half tremendously, then bam! second half started cascading downhills, movie got boring, story became stupid, and boy the end was just crap. I can't say it's a bad movie, but it could've been a blockbuster if the director had taken a different direction",
      "total_reactions": 0,
      "user": "zouz123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "This film is packed with huge plot holes, a bad story, a lot of pointless scenes that serve little or nothing to the plot, and useless plot twists that don't make any sense nor have any emotional value what so ever. This was a pretty mediocre film.",
      "total_reactions": 0,
      "user": "c11beatz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "It's a really good film. Worth seeing as Will Smith playing very well and I really like what I see    .",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Entertaining And Fun To Watch! Will Smith And Margot Robbie Both Look Amazing Which Makes It Easy To Stay Glued To The Screen. Plot Is Simple And Pretty Predictable Quite Frankly. But Altogether Worth The Watch For Sure!",
      "total_reactions": 0,
      "user": "SSKellyHulse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "So, you take an actor who was once one of the biggest stars in the world, wrap him up with a beautiful blond actress and put them into some very fancy settings and what do you get? A huge con of a movie that has far too many twists and turns for its own good. It's well cast and acted but has too many convenient loop holes that just makes it a wannabe Hitchcock style thriller.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "Will Smith comes back from a recent career slump with Focus, showcasing why he is one of the biggest movie stars of all time. While he shares good chemistry with Margo Robbie, Focus is a mess. The characters aren't interesting, the story lacks and the second half of the film detaches what the first half established. Despite one great scene, Focus is just forgettable.",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "I was really excited for this film. Will Smith and cheats? Great combination. And when I started watching it, it actually was pretty cool. Will Smith being all super-pro, teaching how to make tricks, how to be focused, showing something really nice. Then all of them, because there is a team, start to do the same thing, but in a bigger scale. It is really incredible. That's the first half of the film, what you would consider the introduction, but, sadly, it doesn't goes far from there. What you would expect in the second half is a fraud, to steal a lot of money, but in a bigger scale, with all of them working really hard to get it. But it is not like that, nothing happens, there are some tricks, some stupid thing about love and that's it. Of course, at the ending a lot of things are solve which actually make te movie cooler, but before that it is boring and slow. That actually disappointed me very much.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "For me, with Focus, it's a bit of mixed feelings because I simply expected more from the movie. I expected either more comedy in the drama or some mind blowing action scenes. There were some funny moments but not enough. I know a lot of people like it, maybe I will as well if I could get myself to go for a second watch cos I slept through half of the first watch.",
      "total_reactions": 0,
      "user": "Royal_Knight"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "The biggest thing that con-men can't stand is being coned be other con-men, now try to let that sink in.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "This is really good.I am so happy for the movie watching.If you watch the movie.You should be happy.No Hesitation.If you want to download this movie you go  Focus  (II)  (2015)",
      "total_reactions": 0,
      "user": "movied"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "Nice Trailer boring movie. Nothing new boring story looks like uncomplited. I was waiting for the highlight but nothing happend. Will Smith can not make the movie better. just waist of time and money!",
      "total_reactions": 0,
      "user": "Chaya"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Focus reminded me of \"Hitch\", in this case, instead of teaching people how to get a date, he teaches how to steal things. It complies with the purpose of entertaining. I would have watched it home, instead of teather.",
      "total_reactions": 0,
      "user": "LadyJesse"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "In every sense, the film has a set pace for the first hour or so, being less than ample, and cheesy, but kind of acceptable. Then chucks it to run away with your money, just like it's characters in the second half. And every single second feels ever so cheap, it's undeniable.",
      "total_reactions": 0,
      "user": "thewindowseat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Pretty good movie. Funny and suspenseful. Good chemistry between Will and Margot. There are lot of tense scenes, though the movie is best characterized as a romantic comedy.",
      "total_reactions": 0,
      "user": "Master99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "dont have the yardsticks for critiquing movies, but focus disappoints me. storyline has gaps - my opinion. plus, Will Smith refuses to yield to 'demeaning' scenes. he seems in control every time, and is never vulnerable. always high in the heavens, an actor shud know how to roll in the mud sometimes.",
      "total_reactions": 0,
      "user": "juddyblaise"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "The first half of the movie is kinda good? I gues. But the second half is just one big mess . This movie will not help help the careers from Will Smith and Margot Robbie. The problem with the movie is that it doesn't have a interesting plot or characters. I didn't really know what the film wants me to understand. Just watch it once but after that stay far away",
      "total_reactions": 0,
      "user": "reviewer2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "It's nice to see Will Smith having fun in a role again, and Margot Robbie makes for a good partner in crime.",
      "total_reactions": 0,
      "user": "tonimiller417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Good thief pix.  Update of \"The Sting\" but the \"kid\" is a girl so we get the romantic angle.  As with any thief pix, we don't know for sure what is going on; what we see might or might not be what's really happening.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Focus is fun, slick, engaging and sexy. Also Margot Robbie.",
      "total_reactions": 0,
      "user": "katharris417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "It was slow to start and when it finally picked up, I found it a bit too predictable.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "What I have to focus about is why this movie needs to be exactly better in basically everything. Yeah, just focus on that and you'll find out why Focus isn't focusing to be better. Will Smith though on the other hand worked hard and deserved a higher score from me, but not that high.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}