{
  "mc_avg_user_score": 8.3,
  "mc_metascore": 80,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Food, Inc.",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 62,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "\"Food, Inc.\" certainly manages in its most important goal - to get people thinking. I for one, have definitely been deeply impacted by the film's message and it is quite nice to have a straight-out message presented in a documentary. We're in an age where everyone presents things in this medium, but either tries to manipulate its audience or dumb things down for them. \"Food, Inc.\" has struck a perfect balance between having a point and argument to itself, but also presenting the facts, ideas, and concepts behind it in a way that people can understand but that are not stripped down to their basics so they lose on weight (no pun intended here). Definitely highly recommended viewing - will most surely change the way you look at your food, just as the trailer promised.",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "If I could have anyone watch one movie, this would be it. There is nothing in the world actually more important than food, and this documentary shows all the evils of big corporations, Monsanto, high fructose corn syrup, and the modern Western diet. In the wake of these evils, we have seen obesity, diabetes, and cancer skyrocket.",
      "total_reactions": 1,
      "user": "rodericrinehart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Kenner's depiction of the dark, corrupted food industry emanates long before Spurlock's \"Mc-bulge,\" detailing our food's source before it ever reaches our cabinets. What viewers discover, transcends the urge to eat, to such a degree that veganism doesn't seem half bad. The film speaks to the various emotive cognitions the American feels towards their diet, and the visceral tendencies they have when feeling hungry. The result makes for a ponderous dose of speculation, and immanently-driven, self-willed investigations on unveiling the curtain that continues to obstruct and skew the origin of our food. A slice of steak never sounded so bad!",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Food, Inc. provides an atmosphere of horror because of simply a no-holds-barred reporting style that refuses to give out to corporate demands or audience fright, but it does manage to provide a happy ending.",
      "total_reactions": 1,
      "user": "Doehl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "This should be required viewing for every American. Not only does it show the horrible way food is mass produced but also another example of just how broken our governmental system is.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "Robert Kenner's movie is a perfect illustration of F. William Engdahl's book 'Seeds of Destruction', which explains how international agribusinesses are trying to monopolize vertically and horizontally (and profit from) food production on a world scale.",
      "total_reactions": 0,
      "user": "morfil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Food, Inc. is really an eye-opening documentary about the food industry. It \"lifts the veil\", as the film phrases it, into the world of corruption, hiding, and clever trickery in packaging and advertising that these companies are involved in. We get a closer look at what were eating, where it's coming from, and how it's made, and the results are all too shocking. This is exploitation filmmaking, except for all the right reasons. Maybe the food industry needed this; maybe it was about time someone stepped up to the plate. At times, this film can be more scary and nail-biting than the average horror flick, the difference being that this one uses the truth as its most powerful weapon.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "This movie doesn't put much on the table that we don't know already. When it's not droning on about how bad food is, it's demonising corn, rambling about global warming and it's a horrid movie for what it's supposed to be.",
      "total_reactions": 0,
      "user": "AGK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "Food, Inc. starts off strong with a curious intro that raises some questions some of us may not have asked themselves before, questions relevant even if we are not customers in America. The rest of the movie also focuses on the particular American food-production ecosystem but is applicable just about anywhere else I believe.",
      "total_reactions": 0,
      "user": "Jwv"
    }
  ]
}