{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 8,
  "mc_movie_name": "For a Good Time, Call...",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 14,
  "mc_pro_critic_reviews": [
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 83,
      "summary": "The notion of a love story that's really about two women becoming friends is gimmicky, I'll grant, but Graynor and Miller are so charming together, and the movie is so focused and funny."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "This movie is basically where some small-screen comedy in the last year has been: \"2 Broke Girls,\" \"New Girl,\" and, their far superior sister, \"Girls.\""
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "For a Good Time, Call... tells the tender tale of two roommates who team up to launch a phone-sex line. Whatever their virtues or flaws, each of these movies makes the dirtiest episode of \"Sex and the City\" look like Doris Day fluff."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "It's a somewhat formulaic romp, but it's an utterly winning one."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "It's the movie's affectionate portrait of female friendship, along with Miller and Graynor's loose, playful performances, that make this whole imperfect soufflé rise as high as it does."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "The confusion in For a Good Time, Call… is delightful, the phone-sex talk sweetening the vibe. Justin Long is peerlessly funny as the girls' gay pal, but the movie belongs to Graynor, who's like Sandra Bullock with a touch of Ginger Rogers–y brass."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Doesn't aspire to be more than a broad, sloppy, old-fashioned sitcom with a sexy gimmick. But it is quite funny."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Lauren and Katie aren't defined by their attitudes toward men; they're defined by being fu--ing funny and awesome."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "A feel-good raunch-com whose dirty-talk plot comes from a convincingly female perspective instead of feeling like cut-and-paste Apatow."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Doesn't rise much above sitcom level in material or execution, but provides enough laughs and goodwill to be disarmingly entertaining."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 67,
      "summary": "While its heart is always in the right place, the humor – especially in the sludgy first act – is hit or miss."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2012
      },
      "score": 63,
      "summary": "The film is worth seeing for the humor and for its high level of energy, but it falls short of being the \"complete package.\" It's probably a better pick for home viewing than a trip to a theater."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "Travis, making his feature debut, gets very likable performances out of his female stars. And it's nice to see sex given its due as a wide, wild buffet rather than the standard missionary, bra-on fare we're usually served in a rom-com. Mmm-hmmm!"
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "In a rare instance of truth in advertising, the movie actually is a good time."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "Even if the film should be retitled \"For a Fairly Good Time, Call ...\" at least we're not back on the couch with another variation on the same old group of arrested-development young adult males, hanging on to their adolescence with as much determination as their marijuana intake allows."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 60,
      "summary": "The dialogue, penned by Miller with Katie Anne Naylon, is subversively salty: surpassing even those Judd Apatow comedies to which it's indebted, this is almost certainly the filthiest movie ever to bear the Universal logo."
    },
    {
      "critic": "Josh Winning",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "All right, it's not up there with \"Bridesmaids\" but, thanks to a game Graynor (here channelling a young Bette Midler), a revolving door of cameos and some gloriously smutty pillow talk, For A Good Time delivers, yes, exactly that."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "The most adorably filthy movie you may ever see."
    },
    {
      "critic": "Kimber Myers",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 58,
      "summary": "By sex line standards, For a Good Time, Call... clearly succeeds –- it starts off slow, includes plenty of dirty talk, then gives us the happy ending we came for –- but our needs are a little bit greater when it comes to good films."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "The main distinction of this particular raunchfest, about the economic opportunities available to women in the phone-sex industry, is that it does not reconcile its slim narrative conflict with a big, fat wedding."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Easily the daffiest movie you've ever seen that also references incestuous role-playing games."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "In its way, the film is more concerned with the love between friends than the sex between strangers."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Does its share of teasing, but amounts to nothing serious."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "The performances by Miller and Graynor are high-spirited enough that you yearn to see them in worthier material. The potential is there. If there's anything more seductive to Manhattanites than sex, it's a cheap apartment overlooking Gramercy Park."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "Even if a good phone-sex movie does exist, For a Good Time, Call . . .  is woefully, definitively not it."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "While the heart of the movie is the at-times strained relationship between the two leads, it all unfolds rather by the numbers, dictated more by the expected arc of such things than the demands of the characters."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "There are several cameos in For a Good Time, Call… by famous actors portraying the girls' phone-sex clients, including Kevin Smith and Seth Rogen, but they've been clearly been left to improvise, and they don't put much effort into their routines."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 20,
      "summary": "In other words, For a Good Time is not a good time. For that, you'll have to dust off your Nintendo and reacquaint yourself with \"The Legend of Zelda\" -- and hope that one of these days somebody can give \"Bridesmaids\" some real competition."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 20,
      "summary": "What really hurts is seeing Jamie Travis's name attached; for those of\r\nus who love his extraordinary \"Patterns\" trilogy, watching the talented Toronto filmmaker add his characterically kitschy touch to such a witless, faux-edgy movie can only be described as a Travis-ty."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "summary": "Save the money you might spend for a ticket to see For a Good Time, Call... and just read a dive bar's restroom wall for free. That's the sub-level of comedy here, with a litany of crude sexual euphemisms and phallic images passed off as jokes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "Campy to a fault, For a Good Time, Call... takes an unorthodox subject, phone sex, and lays it on top of a plot which checks off every single cliché in film about friendship. The two protagonists were flatter than cardboard cutouts, introduced more as caricatures than characters. The only exception was Justin Long's character who's quirkiness stole our attention every time he was on screen. A story with no struggle, and no point, dictated by the horrible soundtrack.",
      "total_reactions": 2,
      "user": "nickgreene11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Surprisingly, the writing is fresh, and Ari Graynor is at her comic best here.  Don't overthink it - you know it's going to be fluffy fun, and it is. Check it out.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "I think the movie was hilarious making a phone-sex type of movie instead of a XXX commercial on Playboy TV. Very raunchy, more like Zach and Miri Make A Porno or Striptease. But it's sex first, candy later. I didn't see the movie, but it's worth a buy. I was wondering if Director Kevin Smith is watching in retrospect.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "In recent years, the direction of female comedies has taken a turn for the better. It was always believed that a comedy, featuring a mostly female cast, would only work as a buddy comedy. No one ever thought that women would ever be able to successful pull off a raunchy comedy, until Bridesmaids came along and changed all that. For A Good Time, Call... is from the same writers and producers as Bridesmaids and may even be funnier. The story begins with Lauren (Lauren Anne Miller) being dumped by her long time fiancee. On her own, Lauren can't afford the upscale apartment she's been living in, and is forced to move in with Katie, a promiscuous, pill popping OCD, who she'd only met once before, at a party, where Katie threw up on her. At first, the hostility is off the charts, but when Lauren loses her dream job, she is forced to help Katie run her business, a phone sex line. This film is not for the faint of heart, as it is very raunchy, to the point of shocking even me, someone who thinks they've seen it all. While this may seem like a great thing, the truth is, as with most single themed comedies, the longer it goes, the less funny it gets. At first, seeing the things these girls were saying and the people they were talking to was hilarious, but after an hour of  this film, it just really wasn't all the funny anymore. Both the female leads are terrific and they are the reason this film works. For A Good Time, Call... is very raunchy and very funny, but it has one centralized theme and doesn't deviate from it much at all. If not for the amazing young ladies who star in it, this film would have got tiresome a lot more quickly then it did. For a good time watch this movie, it's way out there, but some parts are truly hysterical.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "For a Good Time Call, wow, good movie, have much funny situations, and much funny lines, an interesting trama, with a great development, and good performances. I consider that For a Good Time Call is a good movie.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Quite an interesting premise, which unfortunately, fell a tad flat in the final act. Ari Graynor is certainly a comedienne to keep our eyes on--but certainly not amidst all this raunchiness.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "I wasn't expecting much from this film, I wasn't even going to watch it but For A Good Time, Call... actually turned out to be a pretty decent comedy that put a smile on my face time and time again. Much of that is down to the subject matter, smutty raunchy sex humour will always be funny to my juvenile side. Credit needs to also be given to the leading pair, Lauren Miller and Ari Graynor. Miller (Seth Rogen's wife) co-wrote the film and Graynor is brilliantly cast as the Katie, the imposing, raunchy alpha-female masking vulnerability. I don't think the film would be as funny without her. Considering the female writing team and cast the film certainly rivals, but not quite beats, stand-out female comedy Bridesmaids.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "This is a funny movie with a decent amount of heart.  This film could have been horrible like other raunchy comedies have been over the last couple years, but it's not because of the two lead actresses along with a couple of well placed cameos.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "FOR A GOOD TIME CALL is one of those buoyant lovely films about friendship that just totally thrill me. It's also really dirty and funny. Try to ignore the 3rd act required conflict moment and you'll love it! And Ari Graynor is sublime.",
      "total_reactions": 0,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"For a Good Time, Call ...\" 10 Scale Rating: 6.5 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    }
  ]
}