{
  "mc_avg_user_score": 6.6,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "For Colored Girls",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 30,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 100,
      "summary": "The effect is like watching an opera without music. Or a musical drama in which no one sings. These departures from a realistic convention never feel like static set pieces - that's the great success of the film and of the poems themselves."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 90,
      "summary": "As it turns out, Mr. Perry, while busily establishing his economic independence, has been finding his voice as a filmmaker. And here, working with fine performers like Ms. Elise, Anika Noni Rose, Phylicia Rashad and Kerry Washington, he sings the song the way he likes it - with force, feeling and tremendous sincerity."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 88,
      "summary": "The writer-director waited until he had the clout, budget and prestige to attract a top-flight cast, then turned Colored Girls into a movie with a little less darkness but plenty of heart and guts."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 80,
      "summary": "Whatever stumbles there may be, they are offset by moments when For Colored Girls soars."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 75,
      "summary": "A long wallow in misery and, after a while, the pain morphs into polemic."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 75,
      "summary": "Perry's great gift to this unfilmable play is getting it on the screen, his sharp eye for casting and his evident affection and sympathy for black womanhood, even in movies in which he doesn't don a dress."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 70,
      "summary": "Perry benefits from the fire, heft, velocity, and lyricism of the language, but he also updates the material and makes it work onscreen, eliciting powerhouse performances from an ensemble of actresses."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 67,
      "summary": "For Colored Girls is blessed with a Murderer's Row of black female actors, each tearing ferociously into Shange's words and gamely hanging on through Perry's."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 65,
      "summary": "Perry weaves together not just the individual stories but their arcs, sustaining the emotional tenor across the progress of nine lives."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 63,
      "summary": "It's too much too-much. The audience I saw it with didn't seem to know whether to clap when it was over or start taking Lipitor."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 63,
      "summary": "At its best, Shange's work is a lyric journey through the storm to the rainbow. At its worst, Perry's movie is a relentless dance between the victimizer and his victim. Shange's poetic flow gets choked by Perry's stilted prose."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 63,
      "summary": "Perry tries to be faithful to the play and also to his own boldly and simply told stories, and the two styles don't fit together."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 60,
      "summary": "Perry never solves the stage-to-screen translation problem. But the path he has chosen is as intriguing as it is irksome, and it works better than you might expect."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 60,
      "summary": "\"This is a woman's trip,\" it is announced in Tyler Perry's For Colored Girls, and how you respond to those words will likely determine how you respond to the film itself."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 60,
      "summary": "These ladies - even at their weakest - carry themselves with the confidence of winners, and we cling to their strength like a life raft."
    },
    {
      "critic": "Lisa Rosman",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 60,
      "summary": "But something compelling happens here that shouldn't be dismissed out of hand. Raging in Shange's still startlingly fluid verse like witches casting spells, this powerful cast (especially Jackson, Goldberg and Phylicia Rashad) reaches bravely, if sometimes clumsily, for emotional accountability."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2010
      },
      "score": 50,
      "summary": "Though he has stepped up his game, Perry's plainspoken, unsubtle aesthetic is an uncomfortable match for the fragility of Shonge's speeches, and scenes abruptly switch between the language of Perry's scripted continuity sequences and sudden poetic soliloquies."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 50,
      "summary": "In the end, the movie is still a poetic injustice."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 50,
      "summary": "The hard, cold truth is that the hard, cold For Colored Girls is just plain difficult to fall in love with, regardless of the amount of passion Perry poured into it or how much meaning he's freighted it with."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 50,
      "summary": "There's no question that Black women are underrepresented in movies. There's also no question that when they get a chance to perform, they deserve a better movie than For Colored Girls."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 42,
      "summary": "There's no right way to do an adaptation, particularly a difficult-to-adapt work like this, but there are plenty of wrong ways, and Perry's film offers a casebook of things-not-to-do."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 42,
      "summary": "Perry has taken Shange's feminist word-and-movement portraits of disenfranchised African-American women and turned those howls into...a maddeningly choppy mess of a Tyler Perry movie."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 40,
      "summary": "The result falls squarely in familiar territory, better acted and better lit, perhaps, but more inauthentically melodramatic than ever."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 38,
      "summary": "\"Precious\" worked partly because it did not wrap its sordid tale in Christian uplift and dime-store psychology -- elements that have made Tyler Perry a rich filmmaker but have turned For Colored Girls shrill and manipulative."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 38,
      "summary": "Kimberly Elise gives the best performance as a beleaguered woman with an abusive boyfriend (Michael Ealy)."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 38,
      "summary": "Aiming for a piece with the raw impact of \"Precious,\" on which he served as executive producer, he (Perry) ends up with 134 minutes of misjudged intensity."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 30,
      "summary": "For Colored Girls feels like the cinematic equivalent to putting a garish reproduction of the Sistine Chapel on the ceiling of your McMansion and calling it art."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 30,
      "summary": "The greatest frustration-not just in For Colored Girls, but in Perry's entire oeuvre-is witnessing talented (and often criminally underemployed) actresses struggle with the material they've been given."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 30,
      "summary": "(Perry) style is too crude and stagy for Shange's transformative evocation of black female life, and his moralizing strikes exactly the wrong notes to express the pain and longing that cries out from her heated poetry."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2010
      },
      "score": 25,
      "summary": "The film is a mawkish mess, only occasionally alleviated by the performances or Shange's poetry."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 25,
      "summary": "It's hard to imagine that any self-respecting man would want to sit through two hours - let alone two minutes - of such caustic man-bashing."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2010
      },
      "score": 25,
      "summary": "With such a large cast, none of the actors is able to turn her character into a fully realized person."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2010
      },
      "score": 20,
      "summary": "He (Perry) has taken Shange's landmark poem cycle for seven African-American actresses, cut it up, and sewn its bloody entrails into a tawdry, masochistic soap opera that exponentially ups the \"Precious\" ante."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "The Critics have done it again. They underrated yet another movie for the millionth. This movie is superb. These ratings are ridiculous... Its almost perfect. This is def 1 of Tyler Perrys best.",
      "total_reactions": 1,
      "user": "Cazatuz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This is an Awesome, Powerful movie. The actresses delivered each woman's story in a moving way so that it was possible to relate to each and every character. I loved the age diversity of the cast so that,  as a colored girl, if you couldn't identify with one or more of the cast yourself, 9 times out of 10, you know of a family member or friend who has been through, or is going through at least one of the situations.  I think that alone is what makes this movie so powerful for colored girls. I love how all of their stories were some  how intertwined (similar to real life). I couldn't get enough of these girls. I didn't want the movie to end. I just loved it! I've never seen the play to compare it to the movie, but the movie alone gets 10 out of 10 from me and I would love to see the play now. All in all, \"For Colored Girls\" is a Colorful, Smart, Moving, and Captivating movie that every colored girl can relate to.",
      "total_reactions": 1,
      "user": "talltam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "If you were fortunate enough to have seen the play, you would appreciate this movie 100 times over! The way that Perry interwove the lives and scenes (the play was mostly soliloquies!) was pure genius. Though it (like most media) does nothing to boost the image of the black man in America, his contribution to the play and playwrite is admirable. Every woman (including Janet Jackson who seems to be reading her lines throughout the movie) deserves recognition for their acting...Kimberly Elise, Whoppi Goldberg and Loretta Devine deserve major credit and awards! Kudos, Tyler! A BIG 10!",
      "total_reactions": 1,
      "user": "rocka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "Not only is â",
      "total_reactions": 1,
      "user": "Retha210"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "This film takes its viewer on a journey through every one of their emotions. I left the theatre with a rare feeling of satisfaction. I wasn't left with a longing for answers or the nagging curiosity of whats next. The film and its characters in a sense provided its viewers with a full coarse meal with the indepth discussions that carried on after standing as a sweet desert.",
      "total_reactions": 1,
      "user": "Laurel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "All the actresses gave superb performances... My wife and I enjoyed the film, and will probably see it again. Mr. Perry knocked a home-run as far as I'm concern. My advise to him is to not be concern about the naysayers... They are just jealous at his success.",
      "total_reactions": 1,
      "user": "Carrmel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Ok this is not Tyler Perry's movie this is an adaptation of a choreopoem a broadway hit that hit the stage is the 70's Please stop with the whining about man bashing comments the movie nor the play was about men it was about the abuses of women! I think that he did a goog job considering the source to take a choreopoem and translate it to the screen is not easy..Please read the original. In the play I don't think the characters had names they were identified by colors. The abuses that the women in this play faced happens everyday...I see it on the news everyone of them with the exception of the back alley abortion. Tyler Perry heart is dark...well he was abused so maybe that's why he is so open to bringing abuse to the forefront. As far as someone not liking the title well the play is called For Colored Girls Who Have Considered Suicide When The Rainbow Is Enuff research Ntazke Shange and see why her heart is so dark and why she titled her choreopoem that. Tyler Perry good job",
      "total_reactions": 1,
      "user": "atlbabes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I feel this was an excellent piece of work. The only problem I see with this film is that it is a Tyler Perry production, not that this is a bad thing. Just that it seemed that all the baggage of Mr. Perry's previous work was brought along by the pro-critics. For some odd reason it was impossible for many of the critics to see this movie as it stands by itself.",
      "total_reactions": 1,
      "user": "kurt-o"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "This is a wonderful poetic movie that is worth a second look to fully appreciate. The acting is first rate with a stellar cast. Having read the book it was easy to tell when they were quoting directly from it and when the script strayed. The dialogue is poetic and musical when it follows the book - the movie would have befitted from fewer additional scenes or storylines. Loretta Devine eats up the screen in every scene she appears in especially the ones that follow the book. Kimberly Elise is another standout - her final scene is gut wrenching. When she utters the word \"fiercely\" it is reminiscent of Cicely Tyson in Sounder crying \"Nathan\" - that same trascending quality when you forget you're watching a movie and really believe what you are watching. The final scene makes up for any flaws in this wonderful heartfelt movie.",
      "total_reactions": 1,
      "user": "nton"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This movie is for people who like hardcore drama movies. If you don't like drama then don't watch it. Its that simple! This movie is very well written with a serious, and realistic plot that delivers. This movie demonstrates why Tyler Perry is so wealthy...BECAUSE HIS MOVIES ARE ART! This movie is heart-wrenching, realistic, entertaining, and captivating! The ONLY movies that can make me cry are Lion King and Tyler Perry films, and this is one of them. I also love Janet in this film, never knew she could act so well!",
      "total_reactions": 1,
      "user": "TheateraNerd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "The only problem with Tyler Perry Movies/Plays/Productions are the men (black or otherwise) that are hating on a brother for exposing issues that they try so hard to cover up!  And all the people (men and women) that will not look their problems straight on and get help to get over and move on from them.  I think he is paving a way for issues to be brought to the surface and dealt with.  A far cry from history of covering up and letting it eat the life out of you.  Move on people and stop hating on the brother, he don't know you personally, he just ran across somebody just like you.  This could have been easily done by anyone else and your reaction would have been the same.  It's not the person this time around, it's the issues that society won't deal with.  I personally saw this and thought it was a magnificent interpretation of someone else's work.",
      "total_reactions": 2,
      "user": "ForREAL"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "im 22 first let me say i would have respected tyler perry alot more if the had been about colored woman in slavery or along some line like that. Then wouldve of been about \"colored girls\" especially since he wanted to use Whoopis hate for her children and why yes woman were raped by white by men and had their children in slavery. Im not making this black and white.it just was all over the place no real plot. It was a bunch of stererotypical crap. Each story those woman had to tell could happen to absolutely ANYONE. Not just black woman are abused, infertile, raped, sexually dependent on love, pregnant and afraid or have allowed man she loved to rule her heart and judgement. I think Tyler Perry hit high volumes in the movie and it was very deep but what he used it in away that portrayed it to only be a BLACK WOMANS struggle. TYLER STICK WITH MADEA YOU KNOW HER WELL. Im very disappointed",
      "total_reactions": 9,
      "user": "somethin2say"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "Jo hates the ghetto, just hates it, but Crystal(Kimberly Elise), the editor-in-chief's personal assistant at Robe Rouge magazine, left behind some important company documents in her tenement apartment, so the fashion magazine maven drives the \"colored\" woman home, and waits inside a chauffeur-driven car, seething with contempt for \"places like this\", while business is attended to. Within the next few minutes, Jo will discover that the ghetto hates her back, equally, angry at this haughty woman's stance against her own kind, when the ghetto condition takes hold of a war veteran's mind, compelling Crystal's boyfriend to dangle their two young children, over the pavement, from an open window. The ghetto will remind this woman that she's colored, too, with an act so heinous, no ordinary words can describe it, so poetry is called in to do the job. He lets go of their ankles; she lets go of her masquerade, and becomes black again, while red pools on the sidewalk. Later, back home, speaking about Crystal in regard to the abuse she suffered at the hands of her mentally unstable boyfriend, Jo admits to the husband that she knew nothing, even though the woman was in her employment for the past eight years. Jo, played by Janet Jackson, who looks uncannily like her late brother whenever she's under duress, could very well be speaking about the \"King of Pop\" himself, since the incident can't help but evoke the Berlin episode where Michael suspended his baby Blanket aloft from a hotel balcony, with nothing separating the eleven-month-old infant from the ground. Incidentally, or perhaps not, Janet was eight years old when both Ntozake Shange's choreopoem \"For Colored Girls Who Have Considered Suicide When the Rainbow Is Enuf\" and the Norman Lear-created sitcom \"Good Times\" impressed themselves upon the American consciousness, back in 1974. Not for nothing did the filmmaker cast Jackson as Jo, which just happens to be one-half of Janet's middle name(Damita Jo), because in a filmic sense, it's good times all over again; it's as if Penny Gordon, the young girl that Willona(Janet DuBois), the Evans family's neighbor, rescued from an abusive parent and eventually adopted, has returned home to the inner-city, and remembered what it was like being a colored. In real life, while Janet was playing the victim of a violent mother on the teevee, Damita Jo's father, by all accounts, would administer corporal punishment upon her older siblings, especially Michael, and maybe her, too(according to older sis LaToya). When Jo talks about Crystal, it's not hard to make the leap and say that she's actually talking in her own voice about Michael, who proclaimed in his last great song, 1991's \"Black or White\", that he wasn't  \"going to spend the rest of his life being a color,\" but probably did, down deep inside, contrary to his white appearance. This, of course, is pure speculation, but when Janet first saw news footage of her brother behaving badly in Germany, it might have dawned on her, the exactitude of the toll that child abuse took on Michael. Although not to the extent of her late brother, Janet, by her participation in \"For Colored Girls\", practically outs Joe Jackson as a child abuser, since all of the women, in some shape or form, were done wrong by a man, like Tangie(Thandie Newton), a promiscuous woman who could be a character from one of Damita Jo's hyper-sexual songs. When the women congregate for a group hug at the film's end, it's quite possible that Janet needs one for real. In many, if not all of her scenes, you want to close your eyes, because the youngest Jackson practically channels her dead brother, the loneliest man on the planet.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "This is a classic case of a film that is filled with some really great acting, but the director's lack of knowing how to deal with the source material interfering with the quality of the film. The cast is immensely talented, with Janet Jackson, Phylicia Rashad, and Loretta Devine being the major standouts. Though there are two major missteps (Whoopi Goldberg and Thandie Newton), almost everyone in the cast is just lovely. However, the film itself is just a jumbled mess of awkward insertions of poetry and monologues that just doesn't work. Tyler Perry's style just doesn't mix well with the feminist musing that the film is supposed to be, and he gets in the way of some great performances.",
      "total_reactions": 1,
      "user": "SmellyCat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "This movie is a waste of time energy and money. Black men being bashed and Black women looking like the weaker being.. Me as a black man left the movie theater feeling like we have taken a step back with his last two movies. He needs to find what is making his heart so dark and learn to live with it, but make it a positive aspect in life.I can't do this anymore with his movies. I left the theater with mostly caucasian looking at me like \" I am so sorry.\" This is not the life I live by no means so I can't relate to the movie, but in the future make a ending that shows life gets better don't just have a party and leave it at that. There is a problem and a solution to things. this was by far garbage.",
      "total_reactions": 1,
      "user": "savaro89"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "I thought I would like this movie, because I have like a lot of Tyler Perry's movies. However, it is very unrealistic. The poetry in the middle serious traumatic moments was very tactless. I feel like most of the actresses overacted. I am also very tired of seeing the same African American Female actors in these \"powerful black movies\".  There were too many stars in this movies... most of which over acted ..in my opinion.  And the randomly placed poetry had me lost for moments throughout the movie. I thought, wait... what is she talking about...  I have been through a lot of these same experiences.  There was too much going on.. To many famous female actors, and too much poetry at ALL of the wrong moments.  No one would recite poetry immediately after being raped, having any abortion, or being abuse etc.  This movie could have been great but I think that Tyler tried too hard in his movie.  He over did it. I  am not being insensitive to the abuse that Tyler suffered or these characters but as a survivor myself who has survived a tremendous amount of abuse, this movie was horrible.  I am also  tired of Tyler making movies about the same type of stuff.   The same battered women, the same sexually assaulted person etc.  Everything is so predictable.  I realize that he is trying to be inspirational but it is overkill.  I know these issues are still prevalent but we need a break.  If this is all that Tyler can write about then I believe ha he has done is best work in other movies and it is time for him to retire and explore alternative career paths.  I am just tired of the same cliche  type of movies.  I hope I have not offended any one with my views but for every person that did not like it  there is bound to be some who do.",
      "total_reactions": 1,
      "user": "Colored3333"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "I have always somewhat enjoyed Tyler Perry movies. However, this... This was just awful. So over written. So overly dramatic. I know it is a stage to screen translation, but wow did it not work. It basically hit every cliche I could think of in one fell swoop. As much as I hate to say it, this was one of the worst films I have ever seen.",
      "total_reactions": 1,
      "user": "LordSnow"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Tyler Perry I can honestly say this was the WORST movie i have ever seen. I never do reviews on movies and i never read them but this i had to see what the rating was. I didn't make it through the whole movie. I had to watch a women get raped and a father through his kids out the window to there death. what kind of CRAP is this. This isn't just black women who have to go through this. Is everyone. I have never in my life been so pissed at a movie. I would love for someone to please tell me the point of this movie. There is no point it was all CRAP. I will never in my life watch another tyler Perry movie. They are ruined for me. I thought you were better than this. You want to know what i saw in this movie. I saw something that could have happened to anyone and you are trying to make it sound like black people are so abused in this world. when i saw the movie im pretty sure it was a black guy that raped her. It was a black guy that was gay. It was a black guy who killed his kids. If you ask me this movie was a bit raciest. I have never been so upset with a movie to write a review about it. Horrible job Mr Perry.",
      "total_reactions": 1,
      "user": "dollar123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I sat down on today (6/16/2012), two years after this movie has seen the silver screen, only to be pushed into the realm of Netflix. I immediately became infuriated at myself, angry at the idea that I did not myself make my way into the movie theater, to pay my hard earned dollar to review what I feel is one of the best productions Tyler has delivered to the world. I have had the opportunity to sit and to read a few of the bad reviews. I find that some of the critics are a bit short-sighted. There are those who would make this out to be a \"Tyler Perry\" blunder. There was even an implication that it brought all of \"Tyler Perry's baggage\" to it. This movie was inspiring, fresh, creative and moving. I happen to feel that it was a departure from the norm with Tyler and they way the script weaved each of the women's lives together flowed effortlessly. It was not choppy and each of the scenes seemed to appropriately compliment each other. This was a black man's \"Macbeth\".  At its core it was \"Shakespearean\" and I feel that it was a riveting, display of showmanship. Forget the 22 year old immature rantings and the implications that Tyler has once again created a movie where actors and actresses \"over-act\". This was a fantastic learning experience for me as a man and it brought class to the Silver screen in a subtle way. I give Mr. Tyler Perry and the entire cast of \"For Colored Girls\" a thumbs up! Definitely a MUST SEE!",
      "total_reactions": 1,
      "user": "rentcollector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "i must say as a young black mother/older sister/daughter/cousin friend i loved this movie. I will agree that parts of the movie (mainly the back alley abortion) were a little outdated but i felt as if T. Perry was trying to stay true to the original chorepoem. i dont think that T.Perry excluded any woman from the tribulations that the women in the movies faced. I do think that he understood the power that the original play had and the depth of its meaning to the black community. he took an AMAZING play \"for colored girls who have considered suicide when the rainbow is not enuf\" and he transformed it into a powerful, moving, gripping dramatic movie that was supposed to incite rage and concern and momentum within WOMEN of all races and colors. the purpose so plainly laid out was to spark that fire within women to say it doesnt matter if i meet a million abusive, lying, murderous, cheating, down low, rapist; i am a powerful being and i am worth more than the scrap thrown at me and the treasures within could never be stolen. To everyone who only took away from this movie that it was overdramatic and manbashing u need to go talk to your grandmother or your mother or the woman down the block and around the corner who all have their own dramatic tale that is probably infused some man bashing. This movie was about Women not men. the men were a side note.",
      "total_reactions": 0,
      "user": "dkmommie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "I've read all the reviews I could find on this film. I am in awe of what people look for in film. All reviews are opinions and I respect that. There are those who focus on the technical, the writing style, the \"look\" or the set, the actors' performances and then there are those who focus on the story. In the case of \"For Colored Girls..\", yes, critique it all, but look at the stories of these women and men. It touches a lot of people because they are true to life. All of us knows one of these characters up close and personal. Some of us are these characters. For Mr. Perry to bring this wonderful piece of art to film is admirable by itself. To point out what could have been done better is fair, but don't neglect what was done well. The hearts and souls of these women were exposed to remind us of ourselves, of the struggles of friends and family. To remember not to forget that we are so much more alike than we are different. The film causes me not to forget who I came from: strong women who endured and was still left standing; who I am: a off-spring of triumph over tragedy; who you are: human - just like me. Sure it was difficult to take Ms. Shange's work and adapt it into a story that interconnected and made sense. He did that; not perfect, but well done. Could it have been better? Everything can always be better. The real question is, \"does it speak to the people? Move them? Make them think, remember, leave the theater believing in themselves, in others?  I believe it does. Thank you Mr. Perry, for doing what very few filmmakers do -- speak to the people.",
      "total_reactions": 0,
      "user": "reddragon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "I really enjoyed this movie, i remember back in 1980, we at Malcolm X College, in chicago put on our own production of this poem, at that time I was much younger and had not had the experiences that I've gone through now, This film was very touching and very real for me. I really loved it one of the best Tyler Perry movies for me!!!",
      "total_reactions": 0,
      "user": "malinda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Went to see the movie today. It was awesome. Every woman in this story was someone that I know or once knew. Can't wait to see it again!! Mr. Perry did a wonderful job.",
      "total_reactions": 0,
      "user": "simone04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Walking into the movie theater I hadnâ",
      "total_reactions": 0,
      "user": "chevichavonn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "I was completely blown away, by this story, by Tylers directing, and by all of the actors delivery. EVERY actress owned their part, there was no bad actress in here. They all had fair screen time and poured their hearts and souls into their lines and poems. The top 5 actresses in this movie are 5.Thandie Newton, 4. Macy Gray, 3. Loretta Devine, 2. Janet Jackson, 1. Kimberly Elise. If 3 of these women dont get Golden Globe or Oscar consideration somethings seriously wrong. More than likely if you or any reviewer dont like the movie, you probably couldnt get it or get into it. Because this movie can take you on a wild emotional ride if you let it. But alas theres people against this movie and Tyler so their going to watch it and judge anything they can to keep it down. Im not even that much of a fan of his work but I hope he wins an Oscar for this only so it can piss off the reviewers trying to keep this masterpiece down.",
      "total_reactions": 0,
      "user": "JFord"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "I didn't like this movie at all. The story is all over the place. It was too hard to figure out what the plot to this movie was about. Every scene had me wondering, What is the point. DId a horrible job with this movie. I Hope the play that he wrote this from was better. This is one of tyler worst movie. Tyler Perry is a good writer at times but I think this movie would have been netter if another director made it. Tyler Perry didn't know how to direct this movie with all these outstanding actors and actress. This movie was not believable. They did a good job acting in this movie but it wasn't believable because scene after scene there was always something wrong with the character , I think he could have did a way better job with directing. Not a good movie. Could have been better. Not horrible to some people , I could understand why, but to me this is his worst movie.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "First let me say I'm a black 25 y/o male and I think Tyler Perry is hit or miss. The best work I've seen from him is The Family That Preys and his Madea movies being stereotypical crap. So with that said I like this movie. The best are the performances with a special nod to Phylicia Rashad and Thandie Newton. Another great thing was the story or stories were well paced and nothing was to preachy though a few small elements were a little trite. Namely the problems with the lady in red. Though not bad just didn't feel as strong or important. The downside is Tyler Perry does not balance well with his movies and they always seem so one-sided. The men in this movie aren't bashed so much as they are givin no character. They are merely statues used as a jump-off point for the female characters. Now the play is older than me and I understand there were no male characters. But I feel that as a film, if they are going to be there, they should be givin more to work with. This is still a good overall movie that works with was is being presented.",
      "total_reactions": 0,
      "user": "Libra85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "This is one of the better Tyler Perry dramas I've ever seen. There was a lot of poetry, a lot of love/hate moments, and a scene that was too gruesome to show where a black man dropped the kids to the window. It was disturbing and hard to watch. But it was one of my favorite films from Tyler Perry. I like the entire cast, the script was intact, the suspense just kills me every time something violent is going to happen. I didn't get it on Blu-Ray, but I'll get it this week.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    }
  ]
}