{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 74,
  "mc_mixed_rating_frequency": 39,
  "mc_movie_name": "Frankenweenie",
  "mc_negative_rating_frequency": 12,
  "mc_positive_rating_frequency": 155,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "It is pure, retro-cinematic joy."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 100,
      "summary": "The movie, a simple yet immensely pleasurable tale of a little boy and his undead dog, is good enough on its own. If you know the back story, it's even better."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 91,
      "summary": "Frankenweenie is a cool little flipbook of historical Burtonian style. It even brings back old friends, including \"Beetlejuice's\" Winona Ryder and Catherine O'Hara."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 91,
      "summary": "It says something, then, that Burton's best, most enjoyable, and most emotionally resonate film in years is actually an adaptation of one of his very first projects: Frankenweenie."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "Frankenweenie has that youthful verve and the ghoulishness of strange kids who will some day be eccentric creators. This movie is an attic experiment for its makers to be proud of and for audiences to cherish."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 90,
      "summary": "This magnificent stop-motion cartoon is alive - \"it's alive! - with laughs and heart."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 89,
      "summary": "Frankenweenie is that rare film that's both kid- and adult-friendly."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "Frankenweenie is a love story between a boy and his dog. It is also a beautifully crafted homage to classic horror films, a study of grief and a commentary on the mysteries of science and those who narrow-mindedly fear its advances."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "This delightfully twisted story about a boy and his (dead) dog showcases precisely what Burton excels at: blending the macabre and the heartfelt in a perfect, if oddball, union."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "Tim Burton's best film in years."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 88,
      "summary": "Getting creeped out has never seemed this totally cool."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 85,
      "summary": "It's probably too early to peg Frankenweenie as Burton's comeback vehicle, but it's certainly the director's best movie in twenty years."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 83,
      "summary": "Frankenweenie is stitched together with love and a bit raggedy, like Sparky the dog in question."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 83,
      "summary": "Burton's id explodes onto the screen with a plethora of demonic mutated critters."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Very sweet, very funny, really quite touching and exquisitely handmade, by a film lover with humour and a heart, for a like-minded audience."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Filmmaking is a product of the heart and the head, at least when it's at its best."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Burton's extraordinary powers of imagination are in dazzling bloom, from the gorgeous stop-motion animation to the goofy, homemade horror movies the children direct."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 80,
      "summary": "Frankenweenie, scripted by John August, and based on a screenplay by Lenny Ripps from Burton's original story, is tight and brief, hitting all the marks you'd expect from an animated kid's film, and enlivened by Burton's visual style. The man should make more small movies like this one."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 80,
      "summary": "Burton's finest, freshest film in ages is a welcome homecoming. You'd call it patchwork pastiche, if it weren't so zapped with energy, feeling and imagination. It's alive!"
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "While the big-headed, spindly puppets don't evoke enough emotion to make the movie a must-see, Burton's 3-D design team pours its heart into the monochrome surroundings, from the suburban décor to Victor's laboratory to the carnival midway."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "You have to feel pleased just for the existence of a film like Tim Burton's Frankenweenie. A 3-D, black-and-white, stop-motion animated film, it's a one-man blow for cinematic biodiversity."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "It's great fun."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "Frankenweenie seems like a genuine effort to pass along this love to the next generation, and if one kid who sees it goes home and demands to watch another movie featuring a giant turtle, it will have done its job."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "This is a more personal movie for Burton than one might initially suspect. The very fact that he elected to re-tell this story after 28 years is an indication of how much it means to him. And I wouldn't be surprised to learn that, as a kid, he had a dog named Sparky."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 75,
      "summary": "This isn't one of Burton's best, but it has zealous energy. It might have been too macabre for kids in past, but kids these days, they've seen it all, and the charm of a boy and his dog retains its appeal."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "The picture is frustrating not because it's bad, but because of how almost-good it is."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "He (Burton) has used that tonality deftly here, it keeps Frankenweenie visually stunning and the sensibility light. It's too bad the tale, like Sparky's wagging appendage, keeps falling off."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "While Frankenweenie is fun, it is not nearly strange or original enough to join the undead, monstrous ranks of the classics it adores."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "This beautifully designed canine-resurrection saga feels, somewhat fittingly, stitched together from stray narrative parts, but nonetheless evinces a level of discipline and artistic coherence missing from the director's recent live-action efforts."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Nothing in the longer Frankenweenie is new."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "The entire project is carefully wrought in visual terms and more than a little familiar. Sometimes even a well-applied pair of jumper cables can't do the trick."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "It's a likable film, though not a sensational development in Tim Burton's career."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "There's no question it looks fantastic...As for the story, well, much like the original Frankenstein's monster, it is a haphazard assemblage of well-aged source materials jolted back to life with new technology, but it isn't quite as sophisticated as one might hope."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Though the tale demands a darker outcome, the director disappointingly goes the Mouse House happy-ending route with a reprise of the original short film's finale - one that somehow plays with even more cringeworthy sentimentality."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "It's not so much a miscalculation of his audience by Burton as it is a disregard. What lingers after Frankenweenie, far more than its stunning technique, is a sad suggestion of solipsism."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "While Frankenweenie is pleasant enough as a curated tour through horror's past, it doesn't add much to its present."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "It is nonetheless imaginative in a highly familiar and ultimately tedious way."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 38,
      "summary": "Tim Burton's sense of playfulness feels forced throughout, and as the film progresses, any humor or inventiveness takes a backseat to tumultuous set pieces that reference Frankenstein."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Yeah,the old Tim Burton is back with his best movie since Sweeney Todd.Frankenweenie is visually beautiful and very emotional,I have to say that what he  done in Dark Shadows is forgiven here",
      "total_reactions": 5,
      "user": "rodrique"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "Frankenweenie is the best animated movie from Tim Burton of all time, because apart from the typical gothic-expressionist environment and characters, we see that science is in between. First we have the signature character of this director, who in this case is a misunderstood boy without friends, although here is expanded to other people of the story, unlike most of Burton pictures. In addition to Victor, there is Elsa (animated Winona Ryder), Mr. Rzykruski (animated Vincent Price), Edgar, Weird Girl, Toshiaki, Bob and Nassor; all these characters are very well physically constructed and have a defined personality. Second, the vision of the science that brings Tim Burton to the plot is awesome, and it is defined by two things that are said by Mr. Rzykruski: people like what science gives them but not the questions that science asks; and, science is not good or bad, but it can be used in both ways. Third, the idea of gothic mixed with science gives the film a fresh air and it is reflected in the moment when the other boys have their experiments. The thing here is that with these series of creatures, we notice the different approaches to science: love of Victor, ignorance of Edgar, over-confidence of Toshiaki, superiority of Nassor, fear of Bob and accident of Weird Girl. Other great things on this movie are the use of Frankenstein elements and the outstanding application of camera, in the picture are noticeable transitions from one images to another, flip over (360 turn) and the famous vertigo effect, formed by simultaneously dolly in and zoom out. Tim Burton could have a perfect film, but the end should be different.",
      "total_reactions": 3,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Burton poured his heart and soul into this movie, and it shows. \"Frankenweenie\" is an entertaining, and emotionally resonant film that is a true return to form for Tim Burton.  Although the plot is not seamless, this movie is appropriately atmospheric, meticulously detailed, and is filled with strange, quirky characters. A perfect movie for this time of year, \"Frankenweenie\" can be enjoyed by kids and adults alike.",
      "total_reactions": 2,
      "user": "vern"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Long live Whiskers the cat!  Loved that character!  Sometimes Burton's comedies aren't funny enough.  No problem with Frankenweenie.  I laughed a lot.  The stop motion animation is first rate.  The story is clever, especially when the animals get morphed together.  I like the decision to make it in black and white.  Good enough for repeated viewings, so I will be purchasing the blu ray when it's released.  This is my favorite Burton film since the underrated \"Charlie and the Chocolate Factory\".",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "This was a great family film, appropriate for all ages. It was artistically laid out,  but at the same time the animation and characters had that aesthetically predictable Burton style; yet I was anticipating this (as I'm sure most others seeing this would be), so prepare to be pleased if you enjoy Burton's style.  The moral of the story was great, and there were a lot of funny and heart-felt moments. Overall a great, quirky film!",
      "total_reactions": 2,
      "user": "gonadsia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Great film! It has the tenderness of Manostijeras, is than macabe like Bitelchús and than original like Nightmare. Great autorreferencial work, is full of tributes to the movies that comprise of the imaginarium of this genial author.",
      "total_reactions": 1,
      "user": "delanuers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Tim Burton is always good when he enters in mainstream area, I find Alice in Wonderland was good. Frankenweenie was exceptional, black and white stop-motion animation with entertaining premise and spectacular 3D. Oh, Burton you so much win!",
      "total_reactions": 1,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "This movie was great, had a great story & had all of the great Tim Burton style everyone is used to. While the whole film is in black & white, the story & concept of the film & characters make you completely forget about that. This movie has some great plot twists & one of the more interesting but good concepts for a movie. The only really disappointing part was a pretty weak and/or expected ending that almost anyone can see coming, but up until the last couple minutes of the film, this is a great movie.",
      "total_reactions": 1,
      "user": "SaturnPhoenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Frankenweenie is a joyful, weird, funny, and sweet film. It isn't really a story with depth, but it certainly is Burton's best film he has made in the last few years even if it is a bit disappointing. I give this film 68%.",
      "total_reactions": 1,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Tim Burton always surprises me with his vision and unique ideas. Frankenweenie is a very different, emotional and a meaningful film, it has the strong message which is meant to be delivered to viewers of all ages as it discusses the emotional attachment, the utilization of science and the jealousy. The film is about a boy named Victor whose dog 'Sparky' dies in an accident and then he brings Sparky back to life through science. The whole concept and plot of the film pays a direct homage to Frankenstein and it has been incorporated properly, just the right amount was needed and Burton did a great job. Animation is really, really amazing, I have never watched a black and white animation before and this was a new experience for me which proved to be really great. Voice acting is wonderful as always, the accents have been used in a real manner especially Toshiaki's accent, which made me laugh throughout the film. The major reasons why I'm giving it 8 marks are its freshness, originality and Burton's hard work. This is definitely a strong contender for awards season as it has already won so many critics awards and I wouldn't be surprised if it also wins the Academy Award for Best Animated Feature because it totally deserves it.",
      "total_reactions": 1,
      "user": "theahsanhaseeb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "text": "Honestly the stupidest sh!t i've seen since goodfathers, what the fug there aint even any sh!t in this flick. All i wanted was some nice, clean yet durty fun. but naw. friggen naw son. fug a job. frankenweenie can suck my deenie if you catch the drift.",
      "total_reactions": 1,
      "user": "notFRIGENcasual"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Frankenweenie. One of my favorite animated movies of this year, I think that is fresh, original -yes I know that the movie is based on the Tim Burton's short-, the movie is really interesting, the development of the story is funny, and yes I think that is one of the best movies of this year.",
      "total_reactions": 4,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Tim Burton, you are the MAN!!! Franknenweenie is the greatest film of this year and of the decade, he has crafted this treat by throwing away Helena and Johhhhny deppp and and and and CHrsiwsatopher. HE has gone dark for the first time, its scary. He likes black.",
      "total_reactions": 5,
      "user": "WhySoSerious008"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2013
      },
      "score": 0,
      "text": "What an UNORGINAL idea!! Take an old idea from a horror movie, shoot it in black and white, make it boring and you have \"Frankenweenie\"  Stay way from this movie!",
      "total_reactions": 6,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 0,
      "text": "a black and white animation? WTF? b/c they wanted it to be noir? i'm sure children appreciate that. stupid movie, waste of time from a one trick pony of a director.",
      "total_reactions": 7,
      "user": "shaunmed"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "I loved this movie!  From the stop-motion animation, to the classic Tim Burton atmosphere, to the great references to Universal Horror Classics and other cornerstones of the horror genre.  This was my favorite animated film of 2012, and one of my favorite films of that year overall.  If you like classic horror and Burton's quirkiness, this is among the best he has to offer!",
      "total_reactions": 1,
      "user": "RicochetPhoenix"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Definitely a film for your pre-teen, nothing in it for adults, in fact, the signature line in it \"Sometimes adults don't know what they're talking about\" is what kids suspected all along. I feel sorry for all the parents whose young kid now wants to bring their dead pet(s) back to life with lots of electricity.",
      "total_reactions": 3,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "While the film does not offer much in terms of characters and story it’s a nice film to show your kids. While I wish the film had offered something a bit more unique we still got a decent flick. Where the film lacks in characters and story it makes up for it with a creepy tone and awesome character designs. If you want something cute and creepy to show your kids then I’d say check this movie out. If you want something more original I’d say skip and go check out Paranorman which has a more original story. While this film has a fantastic presentation its characters and story are not very original.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "I love Burton’s stop motion animation style; it really suits this type of tale. The fact it was in black and white was also a bonus for me; it made it look like the early horror films, many of which are referenced here. I also like that he made Mr. Rzykruski look an awful lot like Vincent Price; he was an early horror movie hero of mine. I haven’t seen the earlier 1984 film and so cannot make a comparison with that but I did like what I saw. Definitely well worth a watch for any horror fan; or even if you just want to be entertained; it’ll do that too!",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Frankenweenie could have explored more plot points and made better use of its supporting characters. However, these are small critcisms. The overall film is beautiful, emotionally intense, and has a lot of charm.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "A fast paced creepy delight. Tim Burton and Danny Elfman do wonders together. The movie is neither complicated nor boring and is something that everyone can enjoy.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Stop-motion animation never looked this good! Going with Black & White realy ads to the charming look of this hartwarming film. The voice actors realy bring their A-game and the character animation is so good you sometimes almost forget it's top motion. The movie is a lighthearted fresh take on the Frankenstein story but with many cool references to other pop culture films. Unfortunatly it didn't do loads of business at the boxoffice but it's a film that's not realy targeted at the largest possible audience but more at people who love cult films.",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Frankenweenie is reminiscent of the creepy charm of The Nightmare Before Christmas but it doesn't quite live up to the glory of that film  Although good and creative and at many times funny Frankenweenie is lacking on a couple fronts largely being that it has some qualities that are stereotypical of a Frankenstein parody. However the film is beautifully tied together by Elfman's score and is certain to satisfy any fan of Burton's work which is great considering some of Burton's other recent films have been a bit lacking.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I say that is a great animated movie.I think it'll be nominated to the Academy Awards for Best Animated Feature.The kids want to plagiarize the Victor's ''science project''?I don't know.",
      "total_reactions": 0,
      "user": "Hadrianus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Frankenweenie is just in time for the Halloween season! I absolutely adored the animation, the storyline, and the outcome. T. Burton is has definitely made a rebound from Dark Shadows!! Frankenweenie is probably going to be the first animated movie I'll purchase on Bluray once it's available for purchase.",
      "total_reactions": 0,
      "user": "coreyg007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "Burton's best film since 1994's Ed Wood or even 1990's Edward Scissorhands. http://www.facebook.com/pages/Carrie-2013-has-hemorrhoids-/154149308058300",
      "total_reactions": 0,
      "user": "barnet42"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "Tim Burton deve essere stato un ragazzino molto solo e i suoi film pullulano di giovani maschi impegnati a fare i conti con un mondo su cui non sono sintonizzati. Questo vale anche per il Victor Frankenstein di",
      "total_reactions": 0,
      "user": "catcarlo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "With its anti-intellectualism critique, classic horror film homages and beautiful production design, Frankenweenie is a great film for adventurous young audiences.",
      "total_reactions": 0,
      "user": "Dollis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "After watching the trailer i was afraid that a wonderful story had been ruined because of the other kids but in the end, it turned out i loved all of their characters.They all had likable personalities and i was excited to see what monster each of them would create. Tim Burton has done it again and created a masterpiece that is great for all ages!",
      "total_reactions": 0,
      "user": "GreenDragonGirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "I'll be honest saying that I went into this movie, expecting not to like it. I've never been a fan of the monochrome approach (still not.) But Frankenweenie took every classic cliche in the book, and reused them in the most creative ways imaginable. This is just another boy and his dog movie, and more or less follows the traditional formula of this plot to the letter. But it seems to relish in it's own unoriginality, and, ironically, that is what makes it original.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Frankenweenie was a interesting and different type of animated movie. I was surprised that the choice of black and white instead of color worked as well as it did. The animations and art style were well done, unique, and had the Tim Burton feel. The story was a little sad, but the theme (Frankenstein) helped soften the blows.",
      "total_reactions": 0,
      "user": "krnology"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "Tim Burton is so hit or miss and with Frankenweenie the best you can say is that at least he's not adapting another remake.  This was a decent film, but it's not the Nightmare Before Christmas.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "If there is any Tim Burton films out there, there is few Tim Burton films out there that can beat Frankenweenie, only Corpse Bride can defeat this fun and emotional movie. I saw this on DVD and I tell you, this will be better than you will expect. I can honestly say, if Frankenweenie and Paranorman fought to see who is better, I bet my money on Frankenweenie. This is one of those few films where men can cry at a film in the cinema.",
      "total_reactions": 0,
      "user": "SolidWeaselMGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "As a fan of Tim Burton, I was looking forward to Frankenweenie, but when I saw it, I hate to admit that I was unfortunately disappointing. The movie was good enough to keep me awake, but it just wasn't good, at all. It did have an interesting premise, but I didn't care about the characters, the movies script is a little on the generic side and it just BORED me to death. I seriously did not like the movie, at all. And I know that people are going to give me heat for giving such an overrated movie a 4 out of 10, but it's my review. I just personally hated the movie, but I won't give it a negative rating because the acting was actually legitimately good, but other than that, the movie was not enjoyable, AT ALL. By far, Tim Burton's worst film. I don't know why its so overrated.",
      "total_reactions": 0,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "\"Frankenweenie\" does fall short when it comes to storytelling, but it's emotion between the main characters  Victor and Sparky that truly makes this film shine.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "I love Tim Burton, but this film isn't worthy of the ratings that it has been given. The film is somewhat likable but I have to say, Tim Burton wil eventually end up like Adam Sandler, he made some great movies before (Edward Scissorhands, Nightmare Before Christmas, Batman [1989]) then he made some good or okay movies (Dark Shadows, 9) and now we have \"Frankenweenie.\" For Tim Burton, this film seems like bottom of the barrel, he can do so much better than this. I didn't like \"Frankenweenie,\" not just because I know that Tim Burton can do so much better, but the film just wasn't all that good.",
      "total_reactions": 0,
      "user": "RecycledAir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "\"Frankenweenie,\" Tim Burton's first animated effort since 2005's \"Corpse Bride,\" was an animated film that I didn't have really high on my \"most-wanted\" list, but I was still interested in the film nonetheless. Good thing I chose to watch it, because the film is pretty great! Beautifully animated, great characters, charming, heartfelt, and well-written, this is Tim Burton being Tim Burton. Many say that Tim was on the decline with films like \"Alice in Wonderland\" and \"Dark Shadows,\" but don't worry, Tim can still direct, and \"Frankenweenie\" proves that. It's a wonderful animated film for kids and adults alike!",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "one of the most weird , creative director tim burton presents \" Franken weenie \" . the movie presents it self in a creative weird way like most of his creepy animated movies like ( Corpses bride and nightmare before christmas.) but in the best way it has a very amazing imagination and good screenplay. Grade A+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"Frankenweenie\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Either way, it still works as a strong holder for Tim Burton without Johnny Depp in his way. What to think about this is just another long review I won't talk about here and there.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}