{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 80,
  "mc_movie_name": "Friday the 13th",
  "mc_negative_rating_frequency": 48,
  "mc_positive_rating_frequency": 127,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "It's almost as if they didn't even watch the original Friday the 13th before making this. Please ignore this piece of crap, this is hollywood trying to get every buck they can. Thank the lord for redbox. But still, buying gum with my one dollar would've been a better investment.",
      "total_reactions": 3,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "Everything that I have seen before I found here. The same poor acting that I saw on other horror films I found here too. The same \"scary\" moments. The same archetype murderer. Nothing new. Nothing original.",
      "total_reactions": 1,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 0,
      "text": "Why does this movie have a higher score than other Horror movies that are actually better than it? I hated it. It just seemed like another stupid sequel",
      "total_reactions": 1,
      "user": "driesy8888"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.it's suck.v",
      "total_reactions": 1,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "Really a very disappointing remake. The film begins with the death of the mother of Jason and Jason as a child who grabs the machete used to kill her. After that scene, the movie is full of clichés and ridiculous characters and already seen the boy with glasses who is a loser, then black and foreign that have to be ridiculous, the girls have to be naked, the boys always in heat and two normal characters. If I can describe the movie in two words are sex and drugs. The good thing about the film are Jason and the deaths of the characters. At least the dead have not been studied repetitive, but all in the spoken to him. However a disappointing film.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Mind-numbing garbage that doesn't even try to follow the source material its supposedly remaking.",
      "total_reactions": 1,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "I'm a huge horror film fan and i liked most of the original Friday the 13th films. But in this modern age, filmmakers seems to have forgotten what horror is all about. Nowadays it's just lots and lots of dreadfully boring gore flicks. Horror films is supposed to be about suspense and scare but those things are almost completely abscent in todays films. And this new tradition continues on in this remake. This movie is a total bore and is not worth more than a rent at best.",
      "total_reactions": 7,
      "user": "DragonCriticX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "The lousy remake \"Friday the 13th\" is only there for the ones who greatly enjoy slash-and-hack movies that includes boobs and blood. If your not one of them, don't even consider watching this.",
      "total_reactions": 7,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "wow this is 80s horror in its truest form... lame . ok i dont know why the hell any one goes to the theater and supports theese kind of **** slasher films. every thing about this movie was predictable . i mean i predicted when every person was gona die atleast 2-5 min before it happend . the only scaryy thing about this film to me is that there are people that like this crap. the only reason i give this 2 points is for the 2 nice sets of breasts i saw in this craptacular **** . its not that i dont like slasher films its just that for the love of god make them more innovative then abunch of dumb (and i emphisize dumb) teenagers go out in the woods have sex and get killed or get drunk and get killed and then just keep doing that despite of all the dead bodies and missing people that do or dont show up.",
      "total_reactions": 3,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "um, do we really need a 2009 remake of the 1980 horror movie that had became one of the worst movies ever made? no, we didn't want to, but instead they did. god, those people are just being too stupid and naive seeing this crappy remake.",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "I like to write reviews based primarily on how much enjoyment I got from watching the film in question. Therefore, my score of 0 speaks for itself.",
      "total_reactions": 2,
      "user": "Cotts1988"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Terrible. Just terrible. This movie embodies everything that is wrong with modern horror movies. The characters weren't likable (complete with cheesy dialogue and bad acting), the story was riddled with plot holes, and, to top it all off, the killer had no motive. Watch it if you're a fan horrid movies, which seems silly to me. Otherwise, stay away. Oh, and it's not scary. At all.",
      "total_reactions": 2,
      "user": "chancewellnitz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Okay, for the record, I have a soft spot for Friday the 13th movies.  Jason is my favorite slasher from the 80's.  So hearing that they were going to remake the Friday movies got me hyped, a lot.  Perhaps a little too much though, as when I left the movie theater, I was a bit disappointed.  Now I own the movie on Blu-ray so that disappointment didn't last long.  If you liked the other Friday sequels like part 4, then you will probably like this movie.  It's cheesy, slasher fun, full of obnoxious **** that need a good axe to the face.  Enough said.",
      "total_reactions": 2,
      "user": "EvillivE"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "Disappointing remake...can it be classified as a remake?....or a stand alone movie?  The film has it's good points. Jason is again given human traits; the finding of the hockey mask is an interesting and clever scene; including the bag headed version of Jason was a good touch.  Most of the acting was good, but some was just lousy.",
      "total_reactions": 2,
      "user": "AvidMovieMan"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "Wow this sucked sorta this movie was boring and made fun of the horror name i mean please i could go to camp crystal lake and do much better than this",
      "total_reactions": 3,
      "user": "jordyboy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "It's more effective than the previous horror films: The Final Destination, Prom Night or any cheap horror movie. It's very actable and horrifying..........................",
      "total_reactions": 5,
      "user": "iamkhenzpolenio"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Friday the 13th is a decent remake of a decent original. This slasher movie is nowhere near as bad as other modern horrors and slashers that destroyed the genre but that doesn't make it a very good movie. The script could have been a lot better, contained a lot more substance than it did and porbably went something like - Man in mask kills teen one, kills teen two and continues killing teens until he eventually fails, dies and somehow comes back to life but it's the varying amount of ways he kills his victims that redeem this movie, slightly.",
      "total_reactions": 2,
      "user": "GarethCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Why do people say in many horror remakes \"This isn't as bad as Friday the 13th remake.\" What is it about this one that is so terrible? I watched all 11 Jason movies and this REBOOT, not remake. If this was a remake, then Jason wouldn't be in this one. Anyways, what I hear most is \"The guy doesn't even look like Jason Voorhees.\" Let's describe him shall we, this was before he was a zombie so we're looking at Part 2-4. He has a disfigured head, wears a sack on his head till he gets a hockey mask, and he carries a machete. In the remake, he looks just like that. \"The other characters are stupid and are meant to die.\" Guys, did you even watch the other movies...in fact, have you seen any slasher movies? Every character in the Friday the 13th movies are all disposable for Jason to kill, except the main character. This takes place in Crystal Lake, just like the original movies. Jason takes his time killing people, just like the original movies. Most importantly, Jason didn't die. Do I have to mention about the original movies again? What is it about this movie that pissed people off and say its the worst remake. It didn't copy and paste anything and it wasn't anything different from the original movies. What I saw was a Friday the 13th movie.",
      "total_reactions": 2,
      "user": "billruller"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "So it's not everyone's cup of tea, it' not the best story line, but it is rememberable... Jason Voohees has got to be one of the best horror characters ever invented! It's genius, it's legendary, it's Friday The 13th!",
      "total_reactions": 2,
      "user": "seifer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "For all you complaining about it being a remake and waaa waaaa shut the hell up, if you dont like remakes then don't watch the damn movie, plain and simple!!! And im sorry but this is better than most of the absurb sequels that followed the original, after friday the 13th pt 2, the franchise pretty much stunk. I loved the first 2 movies, but they were not suspenseful, they were just hack and slash. This was a good remake, it is what you would expect from a Jason movie, except he runs(which was nice) instead of walking behind you and then miraciously appearing right in front of you(teleportation much?) If you dont like remakes then dont watch it, no one is forcing you too!",
      "total_reactions": 1,
      "user": "maximumxxxx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Not a great movie, but it's a good movie to see if any one night with friends. Some scenes are very tense and screenplay is reasonably good, is not an exceptional film, but worth watching.",
      "total_reactions": 1,
      "user": "vini1904"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Shockingly A Good Remake!",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Compared to other films in the franchise, This remake was rather good. It started off strong but it sadly went all down hill from there. The acting was fine and the kills were good as well. However the whole \"reinventing\" Jason idea had pretty much nothing at all to do with this film. It was solid through out and watch the worth.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "I don't typically watch horror movies as I am sadly very easily scared, and I thought going into this movie that I was going to be terrified, but from the moment Jason appears on the screen and makes his first kill I knew that this wasn't going to be scary in the least. And even though it wasn't scary like I expected (and was kind of hoping) I still got some enjoyment out of it thanks to some pretty gruesome kills and some hot topless chicks. But I still can't help but feel disappointed with the movie. The acting is good and most of the main characters likable, but surprisingly the worst part of the movie and what brings it down the most is actually Jason himself. All they have him do is just walk up behind the victims get their attention and kill them in some bloody way. It's far from tense or scary and that's what's so disappointing with this movie. But if you like to see a bunch of 20-somethings get hacked up by a (kinda bland) psychopath then this may be for you, just don't expect some super scary horror movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "people dont give this movie enough credit then it should be getting, i know the same teenageer thing where they go to the woods have sex, get drunk, do drugs and get killed can get boring but you have to look past that, the movie has unique kill scenes and they even made jason smarter to the point where he sets traps, the movie i will admit will get boring and repetitive sometimes they make up for that but adding in boobs and killing scenes, if your a fan of the friday the 13th i say atleast look into this movie and give it a try",
      "total_reactions": 0,
      "user": "SFN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Friday the 13th, considering all things, is actually not a bad remake, and may be one of the best Friday the 13th movies out there. Yet despite this, that doesn't mean the movie is anywhere close to perfect with the still same laughable dialogue and jump scares that have become yawnable. Still though, this movie isn't bad and worth a rental.",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "A Pretty Good Reboot you dont see good reboot around much but this is one of the better ones and its not a Masterpiece but it definatly looks like a good start in New Line of Friday The 13th Movies it definatly better Then Jason X or Jason Goes to Hell The Kills are good and it  Wasnt a Movie that Dragged on Much it was Enjoyable and I Suggest That More People Check it Out",
      "total_reactions": 0,
      "user": "SlasherVoorhees"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "I had a great time watching this movie in the theaters. Is it really all that original an addition to the series. Not exactly. However it does take the typical friday the 13th formula and makes a very good typical friday the 13th movie, but with a few new bells and whistles. Jason can run in this one, which I thought was cool, makes him more aggressive looking. He sets traps and moves around with underground tunnels, these new things were cool. However if you were expecting a really groundbreaking remake, youll be disapointed. The scares aren't really scary, but atleast its violent enough and dirty enough to satisfy a horror fan. The story they came up here wasn't bad at all, and I even cared about a few characters. The movie is entertaining to watch as long as you don't set the bar very high on expectation. It is a good friday the 13th movie, just not REALLY new.",
      "total_reactions": 0,
      "user": "djcmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "I liked what they did with Jason, Making him a more Rambo styled killer than just an immortal psychopath. They did a solid enough job mixing the plots of the first 3 original films together into this one and the kills are certainly entertaining. Could have been acted better and would have been nice to see something different with the plot too. Not a terrible movie though.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "You're stereotypical slasher movie. Characters get killed off one by one and it's somewhat suspenseful. It's nothing new at all. It's very entertaining and it was fun to watch but it wasn't really good in any way. That said other than the fact that it was completely cliche it wasn't bad either. If you like these type of movies you'll enjoy it but if you find yourself saying it's good then you're lying to yourself.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Lack-lustre 'remake' that has some great moments, but ultimately falls short.  Could have been a lot better, but pales in comparison to the classic original.  Populated with obnoxious characters that I didn't care lived or died.  Lousy plot as well.",
      "total_reactions": 0,
      "user": "Kyle39"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Not a great remake. It's entertaining but it shows that have made only to make money.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "First off, I love horror movies! I grew up watching old classics movies from the 70s-90s like Halloween, Child's Play, Friday the 13th, It, A Nightmare on Elm Street, etc. So when \"Friday the 13th\" remake came out, I think most people like me were excited, yet very skeptical. Basically, I pitied it with a score of 4, because it was nice to see Jason in action again, though, movie did turn out to be horrid. The kills were all so predictable, and not very creative. There was no character to really cheer on to survive or that you'd absolutely love. The acting was just somewhat off. There really wasn't much of a campy feel to it either. Plus, since it is a remake, this movie didn't really emphasize on Jason Voorhees and his mother's story. Like how it all began, or the new kids being skeptical staying in the cabin because of the stories being told about Crystal Lake and such. That used to be done in every Friday the 13th movie (and that scenes of when the characters would feel like they're being watched), and there's no reason why it shouldn't have been done it this one (especially for a new audience). They could have at least brought back an original actress/actor to appear in this remake. A big disappointment was the fact that Jason held that girl captive. He CHAINED HER UP instead of killing her. Okay yeah, she supposedly looked like his mother, but even the Jason in the original saw past that REAL quick. Also, this movie was not dark, scary, campy, nor suspenseful. And, the acting was a bit lacking. Honestly, it didn't even make me jump like the originals still do (no matter how many times I watch it lol). I agree with users JeffL about the absence of the memorable \"ch-ch-ch\" sound effects and MikeP about the movie being \"uninspired and pointless\". It is a damn shame that Directors and Writers are just making so many remakes and just ruining what we grew up with and that we have so many expectations of. And, the remake of Halloween was just the absolute worst! I could rant all day about that one lol.",
      "total_reactions": 0,
      "user": "AkaLia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "There's a nude scene towards the beginning that may go down as being one of the better ones in film history, but other than a great nude scene, the remake is flat and pointless, and it's supposed to be a horror film.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Friday the 13th prequel is just not up to scratch. No scare just lots of *** and rude scenes. The only reason i did not give it 0 is that the story was average. The rest was just bland scenes and sets.",
      "total_reactions": 0,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 1,
      "text": "The film opens with the death of Mrs. Voorhees and proceeds to the present day. It seems that the filmmakers re-wrote the film completely different. Whitney Miller (Amanda Righetti) is camping in the woods with her friends. After telling the legend of Jason Voorhees (Derek Mears) Jason actually kills Whitney's friends and takes her hostage underground. When we see Jason for most parts until the middle of the film he wears a sack over his head. It likes like the sack he wore in Friday The 13TH part: II. It's not until after killing someone in a barn does he get his Hockey Mask. This leaves me to believe that this is a film that combines the elements of the second and third films, totally re-written for a remake. While Whitney's brother Clay Miller (Jared Padalecki) searchers for her, Trent, (Travis Van Winkle) along with his friends and his girlfriend party it up at his mansion sized cottage. To me, this took away the Camp Crystal Lake setting. We're not even focused on it except for two scenes. One in the beginning and one in the middle. One includes Clay and Jenna hiding from Jason as he approaches with a body bag in Camp Crystal Lake. The first scene is when two of Whitney's friends  are go to visit Camp Crystal Lake in the beginning of the film. The battle between Clay and Trent really didn't help the storyline at all. The interesting part is that Jason won't kill Whitney because she has the locket his mom had in the opening sequence of the film. She reminds him of his mother. This film has a high gore content. An example is that in one water skiing scene involving Willa Ford and one of her cast members. After Willa falls into the wall her cast member is shot in the head by Jason with an axe. He falls down and is dead of course.  Another example is that Willa Ford is stabbed in the head by Jason with his Machete while hiding under a dock.",
      "total_reactions": 0,
      "user": "Kylenine1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I can see why people who weren't fans of the Friday the 13th series wouldn't like this film. But honestly, who cares? This film wasn't made for them anyway. As for critics, none of the Friday the 13th films have done well with critics. That being said, as someone who's been a fan of horror films for years. Friday the 13th is a decent slasher movie, that does a great job of starting the story over with aspects of the first three (and the fourth to a lesser extent) films",
      "total_reactions": 0,
      "user": "DKS01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2013
      },
      "score": 6,
      "text": "It's been a while since I watched a Friday the 13th movie, or this movie. So my memory of this movie is thin. I thought is was okay, it's certainly not a good movie, but it is enjoyable at certain points. I can't say where in the film though. I liked the way this flick looked, at times, and I like how this Jason looked. There this thing with how well an actor played the characters: Jason, and while this guy is okay as the part of Jason, he's not as good as the last guy from Freddy vs Jason. That all aside, I don't really recommend this flick to anyone unless they are a big fan of the series.",
      "total_reactions": 0,
      "user": "Skullgirlsfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Friday the 13th remake is dull full of cliches, uninteresting and stupid, it is not entertaining at all, the acting is mediocre and the jump scares are predictable, this is an example of a really bad horror movie.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Everyone should know what this movie is going to be like before even seeing it.  It is a movie where teens go to the woods and get killed.  Simple as that.  Why some people expect more out of a Friday the 13th movie still confuses me.  I found this movie to be an enjoyable slasher movie, but nothing more.  If you want anything more out of it than that, then steer clear.  If however, you want to watch a fun slasher movie, then go ahead and give this a try.",
      "total_reactions": 0,
      "user": "Zman6495"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2016
      },
      "score": 5,
      "text": "The remake of Friday the 13th is not a bad attempt at revamping the series, however it fails in the most epic part of a remake, it gives us nothing new. Jason is just not scary anymore, I think I would rather see an insane lunatic on the rampage then a zombie killer.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "It's okay, not as bad as people make it out to be. Nonetheless, it still horribly acted by most of the cast but Jared Padalecki and Danielle Panabaker and some of the story elements are almost laughably bad. It still plays out like an 80's horror movie, tons of sex and drugs, teens getting murdered one by one, which should please fans of the original (which was also laughably bad)",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "i thought that Friday the 13th needed a remake why? cause the characters need to improve, the fact their the horror's disposable cliche characters.It came true and it's dumb and more dumber. I expected that the remake was awful and i was right. When the movie started  We have druggie  teenagers and the sluts as well, go camping at \" Camp Crystal lake.\" girls take off their shirts and then sex happens! did you think when watching this remake did you think there was going to be no sex? your wrong and there is sex a lot. (That's not the point), Then they wonder off  into oblivion then they  find Jason! the characters into the original were dumb in this \"remake\" they get Dumber. The story continues, a bunch of teens (what ever they are) are spending a week at a mansion.By the way these characters are much much worst as we saw earlier in the film, The guys get dumbest and so are the blonde whores as well. Thank god their was two good characters in this movie Jared Padalecki and his sister are kick ass one good thing about this movie. Positives:  Jason's  kills in this movie are totally epic.the action improves one-hundred percent;Jared Padalecki's performance as clay was epic and one of the best characters. This movie wants you to care about the characters, i didn't i just wanted them to be dead! thank god! the only character i cared was clay and his sister. Negatives: Nipsel directs other people's classic and turns into remakes, basically Nipsel just makes the directors of the original look bad. Cunningham gets a healthy way to kill the characters, Nipsel goes for the slick by pouring tomato crap as \"blood\". Nipsel  has no showing skill as a director. the script and the directing kills the franchise also Bay's presence. Producer Micheal Bay  ruins another successful franchise  also he has bad taste of directors instead of hiring a man who knows the genre/franchise, like James Wan or Hitchcock but no they choose the director who killed the chainsaw franchise  now kills the guy the mask franchise. You could hear mislead producers Andrew form and Brad Fuller screaming \"Come on Nipsel work that camera!\" and then cheap porn producer (Bay) saying \"hey speed it up let's shoot the sex scene i got my camera!\"  Bay just has to be involved in casting cute blondes to suck at acting in a movie then put them in a horror movie. It has \"Platinum Dunes\" written all over this movie. The writer Damian Shannon wrote ( Freddy vs Jason) he killed two franchises. Then we have  producer Sean S. Cunningham (the director of the original) the poor man! i can't believe that this guy is producing this garbage. Grade F+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Unfortunately the movie is kinda slow,the acting is not that good and the death are not really outrageous but,the movie is entertaining and he's a respectable reboot.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Friday the 13 (2009): 8 out of 10: Jason is a bit off in this one. He moves to fast, he kidnaps people like he watched Rest Stop one too many times and he seems to lack a certain hulking presence of the original. Outside of the main character however, this is a pretty good Friday the 13th film.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "This movie would have fared much better in my book if it took more from the original Friday the 13th film where Jason Voorhees was more of a downplayed character, and was portrayed as a psychological bogeyman, rather than an invincible deadite.",
      "total_reactions": 0,
      "user": "Strangerina"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Friday the 13th is sort of the same old same old but it just sticking to what works. Jason has always just been awesome, badass and unstoppable, no tampering really needs to be done with that character. I have always been a fan of this franchise and this may be one of the stronger films that were released. It certainly beats that crappy Nightmare on Elm Street remake.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "Garbage. I've watched the entire Friday the 13th series in the past few months, so they are all fresh in my mind, and this 2009 remake is absolute garbage with no redeeming qualities and just stupid and brutal. There is also a huge plot failure where a woman escapes from Jason's underground hive, runs through the woods to escape, and then 30 minutes later is back in chains--with no explanation or scene explaining how she was re-captured. Edited out? What an epic fail.",
      "total_reactions": 0,
      "user": "jsharbour"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "a god awful remake to a okay film. they could call this movie pron  with Jason because that what it is. there is a stupid park of the film the only reason he does not kill this girl is because he thinks she his mom really.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "Jason Voorhees is back for some more slashing and dicing in Crystal Lake. Michael Bay decides to join Producing Lane 101 when it comes to making this. He made the entire franchise lose its mojo. Too boring, so tired, this Friday the 13th calls My Bloody Valentine to join with the rest of the horrible horror films.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This was enjoyable, had a few jump scares and the kills were great.",
      "total_reactions": 0,
      "user": "jelenabiebs31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "I'd say this was just as good as the original. For a horror movie it actually didn't have bad acting. Highly enjoyable.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}