{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 89,
  "mc_movie_name": "Friends with Benefits",
  "mc_negative_rating_frequency": 25,
  "mc_positive_rating_frequency": 173,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 88,
      "summary": "The result isn't just the best new romantic comedy released so far this year, but one of the best comedies, period."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 88,
      "summary": "Chemistry is king. It's one reason the rom-com has long seemed like the toughest code for Hollywood to crack. But never underestimate the power of snappy, rapid-fire banter, the paving stones of the Hollywood road to romance."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 83,
      "summary": "It works because Timberlake and Kunis are totally in control of their damaged characters without winking at the audience, as if to say: \"Aren't we cute, behaving so naughty?\" Their sex is amusingly awkward, and their repressed longings more so. It's the kind of chemistry that comes along once in a generation."
    },
    {
      "critic": "Read full review",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "Friends with Benefits is fast, allusive, urban, glamorous - clearly the Zeitgeist winner of the summer."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "It's after the sex friends go back to being just friends that the film really hits its stride, and that's also when the excellent Patricia Clarkson and Richard Jenkins enter the picture as loving but imperfect parents who help explain what's made both leads so gun-shy."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 80,
      "summary": "Goes a long way in bringing sexy back to a soggy genre, benefiting greatly from the presence of its likable leads."
    },
    {
      "critic": "Anita Li",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a tired formula moviegoers know well, but in the case of Friends With Benefits, it works."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "Chemistry is the usually misfiring engine that drives romantic comedies, so it's a pleasure to report that Justin Timberlake and Mila Kunis are practically combustible together in Friends With Benefits."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "The takeaway on Friends With Benefits is that mores change, styles change, the rules change, and even humor changes. (There are two jokes involving apps, of all things, that are pretty funny.) But people's emotional needs remain the same from era to era."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "That it works like a charm - that it mostly keeps its manic energy in check, and that it plays to chick-flick formulas without ever groveling - is due almost entirely to the leads."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "Unchallenging but easy to like. There's not enough here to capture the interest of those indifferent to romantic comedies, but fans - even of the casual variety - will find this to be a pleasant mid-summer diversion."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "Romantic comedies - and this is one, in spite of its phony irreverence - turn largely on star power, and theirs is transcendent, whether they're casually trading one-liners on the streets or doing running commentary on their sexual escapades. They'd have been better off staying in bed."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "I enjoy both Timberlake and Kunis; just this side of manic, they seem right together."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 75,
      "summary": "The news about this movie is that it makes it clear that both Timberlake and Kunis are the real thing when it comes to light comedy."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "A dumb, by-the-numbers romantic comedy. Yet I kept finding small things to enjoy in it, mainly because of the two hard-to-hate leads."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "On the whole, Friends With Benefits is a rewarding summer diversion, albeit one that's fatally torn between what it wants to be -- riotous, anarchic and anti-moralistic -- and the disappointing wet-blanket formula it reverts to in the end."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "The screenplay, with credits shared by Gluck, Keith Merryman and David A. Newman, is predictable, plotwise. But it is elevated by energetic dialogue, the sexual chemistry between the leads and the fact that the miscommunication that keeps bliss at bay - there's always one in a rom-com, and usually it is annoyingly unbelievable - is plausible."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "The jokes don't all work and the topical references can be irritably hipper-than-thou, but at least director and cowriter Will Gluck (Easy A) aims high: this is patterned on the Tracy and Hepburn comedies, albeit with a lot more skin."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 70,
      "summary": "The results are about as naughty as that sounds (not very), but it also makes for a fairly giggling good time."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 67,
      "summary": "I'm not exactly sure this is a situation that a lot of people are going to identify with. More to the point, it gives the movie a faulty design. Dylan and Jamie sleep together and get along famously. Where's the dramatic motor?"
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 67,
      "summary": "The middle of a movie is often where filmmakers lose their way, but Friends With Benefits nails this stretch, in which nothing very remarkable happens as two people talk, in bed and out of bed. There's a fine line between fun-dirty and ick-dirty – sometimes you can't identify the line until it's been crossed – and this film keeps its toes on the right side of raunch."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 63,
      "summary": "When it's good, Friends With Benefits is quite good - especially as it skewers rom-com clichés."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 63,
      "summary": "If Kunis gets the showier role in Friends With Benefits, Timberlake proves a quietly charming stalking horse, finally claiming and fully owning the spotlight with a hilarious homage to the 1990s rap duo Kriss Kross."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 63,
      "summary": "A bait-and-switch comedy. It poses as a naughty \"no-mance\" about friends who use each other for casual sex, but at the moment of truth it goes limp."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 63,
      "summary": "Instead of gleaning something from real life, the great minds behind Friends With Benefits slapped their ideas together based on screwball classics, \"Sleepless in Seattle\" bits, and a keen analysis of Hollywood hackery."
    },
    {
      "critic": "Anna Smith",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "This coasts along just fine thanks to charm and comical interludes, but it fails to deliver the sassy story it promises. Fine for a romantic comedy, but an inferior follow up to director Gluck's edgier \"Easy A.\""
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "It's cute and funny and sweet, which - as any woman can attest - puts it way ahead of most Friday night options."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "Even with all their huffing and puffing, this very salty, often funny affair is never quite as satisfying as it should be."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "By poking fun at the cliches, director Gluck thinks he can turn an inevitability into an in-joke. Eh, it'll do."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 60,
      "summary": "The raunchy premise here is just a smokescreen for the sort of squarely moralistic, altar-bound comedy of which even Jane Austen would approve."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 55,
      "summary": "Watching these two actors move from being sweetly flirtatious to doing real emotional battle may not entirely compensate for the movie's other failings, but it goes a long way toward making amends."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Their banter is fun at the start until it becomes relentless."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie is pleasant overall and occasionally comes up with a big laugh. When the movie's over, though, it evaporates from memory, just like a one-night stand that didn't go nearly as well as you'd hoped."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 50,
      "summary": "Patricia Clarkson is kind of funny as Jamie's mom, an unreformed hippie. And Timberlake and Kunis get in a few good laughs before it's over. But with such a well-worn story, you can't shake the idea you've seen this kind of thing before."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 45,
      "summary": "Every actor in Friends with Benefits, including the nearly indestructible Patricia Clarkson and Richard Jenkins, stalls out in the process of pedaling desperately to make this substandard material work."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 38,
      "summary": "For a film that had once made some pretense toward exposing such dangerously submissive attitudes toward Hollywood romance, Friends with Benefits's conclusion can't help but seem more than a wee bit disingenuous."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2011
      },
      "score": 30,
      "summary": "What's most crushing is witnessing what should have been the dream pairing of Kunis and Timberlake - both foxy, loose, confident performers - here generating zero chemistry."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Ad nauseum, in rom-com after rom-com, the man inevitably arrives at that moment when everything becomes crystal clear, in regard to the woman he loves yet carelessly let slip away. As a corrective measure to his mistake, the man saves the relationship by proving his love with the right words to the woman, who only moments ago, stood in resignation with her dashed hopes. Usually the woman is standing in an airport terminal. Usually the man gets there by some mode of frantic transport. Usually they seal the deal with a kiss. Reared on formulaic filmmaking, it's no wonder that Tom Hansen in \"500 Days of Summer\", continues to misread the ending of \"The Graduate\", his favorite film about true love which he shares with Summer Finn, as happy. Except for the people who understand that Benjamin Braddock and Elaine Robinson are not in love, nobody has ever said, \"Shut up, Katherine Ross, you stupid liar!\" Especially Summer, who can plainly see the ambivalence forthwith, grow among the young folks in the back of the bus, when only a moment ago, the part that Tom, after all these years, is still reeling from, shows Benjamin crashing Elaine's wedding, plaintively crying out her name while he rattles the big church window with his fists. In a flash, however, the emotional high of stealing the bride from the groom, peaks when young Ben traps the angry congregants by barricading the doors with a cross, the Christian icon he uses as a weapon against institutionalized love, waving it around like a bat. On the bus, the moviegoer waits for him to kiss the runaway bride, but he doesn't even touch Mrs. Robinson's daughter, let alone, hold her gaze for more than a heartbeat. Using selective memory, Tom tries to pigeonhole \"The Graduate\" with any other romantic comedy, most of which depict love as a byproduct emanating from the grand romantic gesture, usually in a public place with adoring onlookers. Summer, however, in that repertory house, doesn't miss a thing; she sees the film's authorial commentary, an in-film post-script, about the artifice of movie love, and breaks it off with Tom later over pancakes. At the diner, Summer compares themselves to Sid and Nancy, an apra pro allusion to the punk rock aesthetic of the Nichols film, in the sense that Benjamin and Elaine are nihilists for rebelling against convention. Don't blink, and you'll see how \"Friends with Benefits\", like the tagline for \"500 Days of Summer\" states, ultimately, \"is not a love story,\" as well, with its \"Graduate\"-esque coda, ergo a deconstruction of the romantic comedy in the last frame. Too conventional for the label \"meta-film\", the film has just enough subversiveness to trump its climactic scene at Grand Central Station, where Dylan tells Jamie, without a trace of irony, that he's in love with her, turning their lives into the very thing(a romantic comedy), they both had agreed was fictive; merely a Hollywood construct which damages people with its unrealistic idealism pertaining to relationships. In an earlier scene, Jamie convinces Dylan to scale the Hollywood sign, representational of the fact that the executive recruiter believes in celluloidal love, although at times the woman forsakes the faerie tale, like when she publicly rails against Katherine Heigl, the scapegoat of her romantic woes. Meanwhile, the art designer gets stuck up there and requires the services of a helicopter, analogous to the rescue being executed by the film's satirical form, whose self-awareness is supposed to set the movie apart from contemporaneous examples of the genre, such as \"The Ugly Truth\". But just because the film foregrounds the artificiality of the \"meet-cute\", it doesn't make the \"meet-cute\"(where Jamie chases an I.D. sign on the baggage carousel) go away. A trope is still a trope, even when it's filmically italicized. As a result, the film can hardly be called a satire, not with a touch so light that the skewering comes off less as a criticism of genre convention than a reason for optimism where life could imitate art. Luckily, although the two leads are far from being the next Spencer Tracy and Katherine Hepburn(the referencing of Amazon.com alludes to \"Desk Set\", a 1957 film about computers which was dead wrong in predicting the relevancy of people), they're also equidistantly ahead of Heigl and \"Killers\" co-star Ashton Kutcher, as well. To it's credit, the film gets real in the final scene, where Dylan and Jaime, now, supposedly more than friends with benefits, suddenly look awkward and bored, as they share a booth in the cafe. They're the couple from \"The Graduate\", but with a crucial difference. Instead of extending the silence, they reach across the table and tear into each other, in essence, updating \"When Harry Met Sally\" by faking love instead of an orgasm. They're not meant for each other, as advertised, but unlike Benjamin and Elaine, it won't stop them from having sex.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "There will be no comparisons to \"No Strings Attached,\" this movie is rather easy to review.  Although the movie technically has two parts.  The first 45 minutes of the movie is a laugh riot, and it manages to capture some of the the raunchy vulgar comedy that the movie sets out to accomplish.  However, this is only the first half of the movie, the rest of the movie barely manages to keep its head above the water of cliches.  The second half of the film gives only a few quick chuckles, but in between them, the movie might actually put you asleep.  Where the first half would get a 9, the second half would barely hit a 5, so I give this movie a 7.",
      "total_reactions": 1,
      "user": "dz9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I will appreciate the work done by Mila kunis. She's my favorite and made me laugh alot. I must say a good comedy and drama movie that i have seen after a long time. For full reviews read here: http://www.moviesfunzone.com/download-friends-with-benefits-movie",
      "total_reactions": 1,
      "user": "williamalarice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Mila Kunis and Justin Timberlake were a very good team to watch, the film was actually very pleasant. The arguments were often funny and good, off course that the whole concept of this film is kind of cheap and stupid, but Will Gluck was able to make movie enjoyable.",
      "total_reactions": 1,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Is a very good movie, because it has a beautiful story that infects all who watch the film. Even the end is not any surprise, but that did not stop him from being a great movie",
      "total_reactions": 1,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is amazing! It one you can go see with the girls or with you guy, both would enjoy it. One of the best romantic comedies of the year. Mila Kunis and JT work so well together. When previews first came out, i was a little nervous because of the recent release of No Strings Attached, but this movie by far was one of the best!",
      "total_reactions": 1,
      "user": "sgleason91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "This movie is a long mix of awkward sex scenes and \"comedy\". It's long and boring and concludes with a moral that you can see coming for entire movie. This movie is a no on my list.",
      "total_reactions": 1,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "This will inevitably draw comparisons to No Strings Attached (the Ashton Kutcher-Natalie Portman pals-doing-the-nasty comedy from earlier this year), so let's just get one thing out of the way: FWB is actually kinda GOOD, unlike NSA. Here's what's good about it: Witty, sharp dialogue that's well delivered, great chemistry between the actors, good acting, engaging side characters and side plots. The actors and their characters are likable. The ride is enjoyable and has just enough seriousness to give the plot weight and make the characters not seem like vapid singletons living in a New York bubble. Also, the jokes are funny and often smart, without being snooty. The pacing is also good, although I'll be honest and say it loses some momentum towards the end. It's predictable enough, as all romantic comedies ultimately are (and isn't that why we see them?) so think of this movie as more about than the journey than the destination.",
      "total_reactions": 5,
      "user": "CorneliaL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Justin Timberlake and Mia Kunis are so good together. I laughed soo hard throughout the movie, but it wasn't just a comedy, if you are a sucker for a good love story this ones for you. I thought it was great. I will probably buy it when it comes out on DVD!",
      "total_reactions": 5,
      "user": "kalvinmj34"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "A very impressive romantic comedy, then again I wouldn't really call it a 'romantic' comedy, more of a dramatic comedy. I was quite surprised at the amount of drama in this film because the trailers made it look like a flat out comedy. But I'm glad it did have the drama aspect because it gave the film so much more depth and character. I very much enjoyed this film and Justin Timberlake and Mila Kunis make a great comedic duo, I laughed my butt off.",
      "total_reactions": 4,
      "user": "ZacharyMatson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Once you get past the fact that the storyline isn't that original, this is a terrific movie...definitely one of my favorite romantic comedies in the past few years. The dialogue is hilarious and witty and kept me laughing during most of the movie. The casting is terrific. Mila Kunis really shines in her role and Justin Timberlake is a natural. Looking forward to getting this on DVD.",
      "total_reactions": 4,
      "user": "Dobby"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "If I could score this it would get a -100 ... I mean it !!! One of the worst movies Ive seen this year, Terrible acting (mostly on Timberlake's side !!!) He is really bad in first roles !!! He always is showing his butt and it is really really boring it is something you will watch and know what will happen in the end ... DO NOT WASTE YOUR TIME",
      "total_reactions": 4,
      "user": "wildflower"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "The movie was acceptable but hardly outstanding. It was hard to get by some of the flaws.  A man living in LA is not from hooterville. He would be able to understand New York without walking around like a rube.  I agree with other posters that Emma Stone would have been a better pick for the female lead.  The ending was no surprise and nobody who even read the title would not see that they would fall in love.  You never forget that you are must watching Justin and Mila, not characters in a real situation. But they are pretty and there are some amusing moments in it which makes it a painless diversion.  The sex scenes were just this side of soft porn though and I felt unnecessary to further the plot.  They could have been softened without hurting the humor the two of them were creating in their bedroom romps.",
      "total_reactions": 2,
      "user": "JBM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Predictable and boring actually i was bored  after 20 minutes and nothing changed until the movie was finished i don't know if i was actually sleeping with a bad dream or i was just almost sleeping in order to have time going faster to see the next movie... sooo boring",
      "total_reactions": 2,
      "user": "janrokkjaer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "A truly heart-warming story of friendship and passion, wrapped up in a nice bouquet and delivered by hand by Timberlake and Kunis. The most underated actor and actress of our time team up to produce an inspiring movie about the trials and tribulations of todays society. An enjoyable film that will bring a smile to your face every time. I bought this on blu-ray and DVD just so the creators of this masterpiece got the money they deserved for this genius piece of writing and acting. A lovely family movie that will keep everybody entertained through-out.",
      "total_reactions": 2,
      "user": "ImNotPaid4This"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "This movie sucks. Do not see it. From the commercials you think its gonna be a comedy/porn. NOPE ITS A DARN LOVE STORY! It never ends. I wanted to kill myself. Best part of the movie is Mila Kunis ass. Its deff worth to see just for that.",
      "total_reactions": 14,
      "user": "DARKERIC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "The movie disappointed me, I was told it was hilarious but I do not very funny, at first it was uncomfortable to see the couple Justin / Kunis looked very fake, and for the conlusion was much better.",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 1,
      "text": "Giant steaming pile of dog crap.  Bad acting, bad writing, bad concept...total garbage.  Mila Kunis is not good in this...she is not good in anything...how did this person ever achieve any success? Timberlake is usually decent but this stinker was impossible to save.  It was painful to get through an hour of this crapheap.  Do yourself a favor and avoid.",
      "total_reactions": 2,
      "user": "Robgon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "This movie sucked! And I love cheesy romantic comedies. I am giving this movie one star because Mila Kunis worked her ass off to try to make this movie funny. It was sorta sad to see how hard she had to work, but I like her, I like her acting, and I think she did a good job. Meanwhile, Justin Timberlake proved that he has NO charisma whatsoever. Nor can he act. If they had cast a talented actor in this movie, it would have been significantly more enjoyable - John Krasinski could have saved this movie- but they didn't cast Krasinski, they cast the stiff-as-wood Timberlake.",
      "total_reactions": 1,
      "user": "Alambna"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Deja-vue -> go check 'No strings attached'. These movies are very similar, too bad.",
      "total_reactions": 1,
      "user": "Dongangstar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Wow, these Metacritic scores are nuts. Some movies are rated so low and I love them, while movies like this one have positive ratings and they are horrible. This is a terrible movie. It actually picks up a bit at the end, but wow, the majority is plain bad. The dialogue in this movie is the worst. Who wrote these terrible lines. They were just not funny. It's as if they were trying to sound cool by making the characters spew racey banter, but the lines simply were not funny. I'm a fan of Timberlake because I admire how he went from Disney to a ridiculous boy band, to then becoming a respectable solo artist and then a talented actor. Mila is just plain HOT. So I went in here thinking that I would enjoy this movie. WRONG! I am always amazed at how movies like this get favorable reviews. I guess there's no accounting for taste. Be warned.",
      "total_reactions": 1,
      "user": "Sgaldo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "â",
      "total_reactions": 1,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "It's probably the better movies that could come out of this concept. Kunis is terrific, Timberlake is under-directed (though fun), and Patricia Clarkson (who I love, generally) is bordering on parody.  Jenna Elfman is great is a small role, and Woody Harrelson easily steals the show.  Like many of the critics, I think the banter between the leads is solid.  The ending just falls flat.  And using flashmobs?? (especially via the Uroboros....)  A little tired. But it's much better than the Ashton Kutcher film along the same lines from earlier this year.  I just wish that what started out as an unconventional relationship didn't wind up so conventionally.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "If you're going to poke fun at pop culture cliches you should make damn sure you're not committing them yourself.  Like staging a flash mob in Times Square.  Mila Kunis and Justin Timberlake are fairly decent actors so I have to interpret their misreading of the main characters to bad direction (Am I the only one who thinks Emma Stone would have been a better choice for the lead than Kunis?).  Woody Harrelson does is best with the role of the gay sportswriter (a twist but still a cliche) and probably has the funniest moments of the film.  Patricia Clarkson plays the cool but unavailable hippie mom who undoubtedly is the source of Kunis' insecurity.  Don't get me wrong there were some decent moments (John F'ing Mayer, Harrelson's relentless recruiting of hetero men) but the dialog seems forced and the \"we're cooler than you are\" premise falls short.  The one saving grace of this film is the undeniable attractiveness of the lead characters.  Timberlakes' legion of female (and male) fans will leave the theater feeling they got their money shot, I mean money's worth.",
      "total_reactions": 0,
      "user": "martinex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Chemistry and funny in its own ways. Parts of it were super hilarious but Its more of a romance than comedy to me at-least. I enjoyed the film and its great! WATCH IT!",
      "total_reactions": 0,
      "user": "FireworkPeacock"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "Essential to a good romantic comedy are: a believable chemistry between the protagonists; a story that is real enough to make you think it could happen; humor that is generally appealing enough to maintain levity through the majority of the movie and emotional enough to care about the characters situation when not smiling; the setting or locale is almost a third party in the relationship.  When Harry Met Sally, Pretty Woman, etc. Down with Love is one of my all-time favorites too, but not exactly realistic, but still adorable.  Friends with Benefits fits the criteria better than I've seen in years.  In the Rom-Com genre, the film is near perfect.  The chemistry between JT and Kunis is flawless and believable.  The use of New York and Los Angeles were reflections of both their personalities and, thus, enhanced an understanding of the characters.  The writing is smart, the editing makes the movie flow seamlessly and it even finds a way to make fun of itself and its genre.  I enjoyed the film from the opening scene to the final credits.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "It is interesting that the two main actresses of the Oscar winning Black Swan both follow it up with a rom com with a bit of a spice in it (Portman did the No Strings attached).  This is the better of the two mainly thanks to Mila Kunis who is truly adorable.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Justin Timberlake & Mila Kunis agree to a sex-only friendship, but the inevitable happens. A film like this depends on clever writing and good chemistry and this one has both. There are plenty of funny lines and some enjoyable supporting characters (loose mom Patrician Clarkson and big gay jock Woody Harrelson), but it's the electricity between Timberlake and Kunis that gives it that extra spark. Interesting: JT is sans clothes in many scenes, while Mila remains modest (nary a nipple).  While there's nothing exceptional about this movie, it's an entertaining and enjoyable summer hit. NOTE: Stay thru the credits for outtakes from the movie-within-a-movie.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Good film, not great but good. The chemistry between Kunis and Timberlake is superb. As predictable as the story is it's worth the watch with some inspiring, funny and meaningful parts. Kunis looking as good as ever. Go see it.",
      "total_reactions": 0,
      "user": "jimbot21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Great fun. I sense that critics won't give it the review it deserves as it is no Oscar contender, and doesn't make us think particularly hard about life after seeing it. But for us normal folk ... it is a great rom-com with outstanding symmetry and synergy between the leads.",
      "total_reactions": 0,
      "user": "beelzie14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "This movie actually pulled it off after '' No Strings Attached '' since it's the same type of romantic comedy, or if you prefer, '' sex buddies ''. Well, I liked more '' Friends with Benefits ''. It was enjoyable, you can see a reel connection between the characters. Mila Kunis (as Jamie) was fantastic ! She delivered a great comic performance and she looked gorgeous. Also, I liked the ending. It was ironic because everything that they were believing at the beginning, turn out to be the opposite. Well sure it was kinda predictable, but it worked for this movie. You will know what i'm talking about after seeing it. An other thing that was awesome in '' Friends with Benefits '' is the situations (when there talking, etc) between Dylan and Jamie, which I found less cliche than most of romantic comedies. That's why this one stands out.",
      "total_reactions": 0,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "I had very low expectations when I went to watch this movie but I have to say it was better than I thought. Timberlake and Kunis deliver good acting and it feels very natural and not forced like in many other movies these days.",
      "total_reactions": 0,
      "user": "CBZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "One of the best rom-coms in several years.  Witty dialogue and fun performances by both Timberlake and Kunis.  And they have great chemistry together, which really makes it work.",
      "total_reactions": 0,
      "user": "pb2008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "What you expect from movie about sex buddies without end up being laid and love each other? Chemistry between Justin Timberlake and Mila Kunis is almost enough to carry the movie, don't forget about the smart dialogue and cool soundtrack.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "A welcome surprise.  Thoughtful, well written and definitely moments of good laughter to be had.  There is clearly an authentic connection between Kunis and Timberlake as their feelings evolve layer upon layer.  You find yourself rooting for them even though its clear from the start how things will net out them.  A must rent!",
      "total_reactions": 0,
      "user": "jmacnugent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "An enjoyable film with good chemistry between Justin Timberlake and Mila Kunis.  The production was excellent and the direction spot on.  It moved along at a good pace with many fun lines.",
      "total_reactions": 0,
      "user": "gfny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This is a good movie. I was not expecting too much but its a very real and funny movie. The story about the Dad is very touching. Its a guy meets girl movie coupled with the blue humor of Californication , the fast paced fun of entourage , and a bit of Wilfred thrown in. I like this movie.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "I found myself quite surprised at how this movie turned out. The trailers made Friends With Benefits seem like an all out laughfest but underneath the laughs lies quite a bit of drama which gives this film a much more depth and allows the characters to flourish. The plot is simple and straightforward. Dylan (Justin Timberlake) and Jamie (Mila Kunis) are singletons in the Big Apple and come to the decision to be friends who sleep together. (I.e Friends With Benefits) And ofcourse the film explores the effects this has on them both. The chemistry between Timberlake and Kunis is superb and ultimately one of the keys to how good the film is. The film also has great dialogue thats performed terrificly by the cast, and thats another area where the film excels the some of the side characters, Woody Harrelson in particular, are awesome and obviously the humour is very well done as the jokes will make you LOL! FWB is a decent length but its enjoyable throughout and provides some genuinly funny moments. Importantly though the serious side of the film shines through when needed and gives it enough all the way through and allow the characters to be likeable and not seem to be the stereotypical cliched couple in so many movies. The film does become predictable as it nears its conclusion, afterall it as a romantic-comedy and it does slightly lose some of the momentum but that doesn't prevent this from being another fine comedy from Mr Gluck in what is a fine follow up to Easy A and easily one of the best rom-com's of recent times. I haven't even mentioned the clincher; Mila Kunis, enough said!",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Yes it is very similar to no strings attached, but all in all it is a good modern romantic comedy that can be enjoyed with the wife/husband and girlfriend/boyfriend, I personally saw this at the drive in cinemas and it was a very fun night, mila and justin play the roles very well but they only negative I found was that the jokes didn't make me laugh that often and the characters families didn't really suit all that much, but that's just me, overall a generally good romantic comedy with the occasional laugh.",
      "total_reactions": 0,
      "user": "fryzee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "I'm not usually into romantic comedy movies (thats girls stuff! JK lol) but this was a well written well acted movie. It literally brightened my day a little bit. I don't even like Timberlake but after this movie he may want to drop that \"music\" career and be an actor. Good movie.",
      "total_reactions": 0,
      "user": "lususgreene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "I enjoyed this movie, it was good, but just good. Justin Timberlake was ok and Mila Kunis was hot as always, but it was funny in the opening 10 min or so and whenever Woody Harrelson would appear, but after that it was just too romantic for me. I expected a romantic comedy and it was mostly romantic for the final hour and a half, but i enjoyed it though, good movie, shouldve been alot more comedy involved and it was definitely a complete copy of No Strings Attached but it was good, but only good, 6/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "As much as it tries not to, Friends With Benefits relentlessly relies on rom-com cliches. However, the hilarious chemistry between Timberlake and Kunis makes it worth the while.",
      "total_reactions": 0,
      "user": "asjklas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Not having seen No Strings Attached, I can't compare Friends with Benefits to it.  Perhaps this is a good thing, as it seems that a comparison between the two films is happening a lot in reviews and word of mouth alike.  I can say, however, that Friend with Benefits is an entertaining movie, that has a few good laughs, and some heart in there as well.  Would I see it again? No.  But it was fun while it lasted.  Justin Timberlake and Mila Kunis both did well in their lead roles of this sexy romantic comedy. I predicted that the plot was going to be predictable (as most films of this genre are) and my predictions were correct.  They did throw a curve-ball.  A Hail Mary attempt at tugging at our heart strings just a tad more than most summer romance comedy's do.  This was done with Justin Timberlake's father in the film.  It seemed that they were really trying to get us on that one, and to some, maybe it will be successful.  The film has a good message, and a lot of charm that grows as the movie progresses.  It's not the best comedy that's been released by a long shot, and it didn't break any ground.  But it's a fun little film with  funny moments that some people may really enjoy.",
      "total_reactions": 0,
      "user": "Codyk4545"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "While surroundings itself with the overused cliche that is \"friends with benefits,\" the movie does not disappoint. Making up for the failure that was Ashton Kutcher's \"No String Attached\" this movie actually portrays the cliche in a humorous, if not entirely PG rated way. The excessive montage of almost sex scenes probably don't do Kunis fans justice, but the characters, especially Woody Harrelson and Patricia Clarkson that give the film at least an 8/10",
      "total_reactions": 0,
      "user": "EddyMac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Hilarious! This movie jumped off the screen on a level I did not expect, it will have you in tears of laughter and sadness. Justin Timberlake and Mila Kunis really have excellent chemistry in this dramatic/romantic comedy. The comedy side of the movie was soo funny I just couldn't stop laughing, even the next day when I replayed the scenes in my head and would embarrassingly laugh out loud... in public...  The drama in the movie was unexpected and in my opinion very moving.  You see a lot of good emotion and a touching love story that makes this comedy a movie you could watch over and over.  This is a DVD buyer for certain!",
      "total_reactions": 0,
      "user": "Tommyboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "This movie is absolutely fantastic. Refreshing, smart and most importantly, funny as hell, Friends with benefits is a wonder. It's interesting to see two similar movies released within a common time frame. No Strings Attached dropped the ball and Friends with Benefits surpasses it every way. Kunis and Timberlake shine and play off of each other like old pros. What is even more amazing is the true heart of it. Both characters have to deal with family issues that are real and honest. My one problem is believing that these characters are damaged, which they will repeatedly tell the audience. This however can be easily overlooked in favor of casting, plot, and chemistry.",
      "total_reactions": 0,
      "user": "Anotherday1787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Well Friends With Benefits. I'm not really a big fan of it. I mean it was kind of interesting, but the story line just didn't get me. I mean there were some parts that i found brilliant, but others just didn't make sense to me. I mean i love romantic stories and this was one of them. I just didn't really follow on the whole thing. I mean i wouldn't really call it a romantic comedy. I would call it more of a dramatic comedy.",
      "total_reactions": 0,
      "user": "CharityLeGal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Friends with Benefits survived only because of the amazing cast . The story is so much smiler to No String Attached(2011) . Both had amazing cast but Friends with Benefits got on top coz its funnier then that one . As for Rom-Com Crazy,Stupid,Love was way better then this but still its worth seeing . Good acting and Justin was good also Mila But Woody Harrelson was the funniest . as for the story .....Sucks . So Friends with Benefits is a funny Rom-Com with an amazing Cast and a sucky Story .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "I thought it would be hilarious, but that wasn't the case. It's cute but not a good comedy if that's what you're looking for. A few parts are too predictable and boring. Some fun scenes though. But let me just say I had a hard time staying awake unlike the movie I saw after it.",
      "total_reactions": 0,
      "user": "tiah143"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "Il semblerait que Natalie Portman et Mila Kunis soient en compÃ©tition depuis Black Swan. DÃ©jÃ  lÃ , les deux actrices \"s'affrontaient\" dans l'univers de la danse. Maintenant, c'est dans la comÃ©die sentimentale (Sex Friends pour Portman, Sexe entre Amis pour Kunis). Pour la rivale de la grande Mathilda (rÃ©fÃ©rence Ã  LÃ©on), Mila Kunis fait Ã©quipe avec un excellent Justin Timberlake dans une comÃ©die romantique qui ne sort pas des sentiers battus. Chaque sÃ©quence sent le dÃ©jÃ -vu et se montre prÃ©visible. Mais lÃ  oÃ¹ s'en sort Sexe entre Amis comparÃ© Ã  Sex Friends, c'est qu'il est moins guimauve, que le duo Kunis/Timberlake fonctionne parfaitement, et que le film possÃ¨de un humour qui fait trÃ¨s souvent mouche, sans tabou et sans vulgaritÃ© non plus. En somme, Sexe entre Amis se montre Ãªtre une comÃ©die bien sympathique. Et en ce moment, c'est vraiment ce qu'il faut pour se dÃ©tendre !",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "this is an awesome movie i guarantee u won,t be bored from the start to the end ,and the beginning is awesome and smart ,who ever wrote the conversations in it between the leading stars is original, hat off for every one helped direct this one",
      "total_reactions": 0,
      "user": "deenez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "I loved this movie. I thought it was well done. After the movie No Strings Attached I thought this one would be bad too and it really surprised me. It had a much better story like then No Strings. And of course Justin Timberlake is hilarious which makes it great, and Mila Kunis is such a great actress they both really worked well together.",
      "total_reactions": 0,
      "user": "melissanford"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Its not a timeless classic but it works as a comedy, even before it works as a romantic comedy. The first thing to realise about Friends With Benefits is that although its story is incredibly similar to No Strings Attached, it couldn't be more different. The endless comparisons between the two were bound to happen and to an extent thats a good thing because it shows how much better Benefits is. Justin Timberlake and Mila Kunis prove to be worthy leads as Timberlake has charm as well as natural talent while Kunis is a force to be reckoned with (If you forget Max Payne that is) who has some exceptional comic timing. The supporting characters help flesh out the characters through a well written script which allows for a nice pace while also giving some much needed back story which Strings failed to do. Richard Jenkins will always be the supporting actor with so much more to say (see Burn After Reading and Let Me In) but he film manages to make that work through his characters problems. The only real problem with Benefits is that its predictable but then again all romantic comedies are. The ending is rushed but manageable and the 3rd act takes longer than it really should but overall its a decent comedy with some extremely raunchy comedy that works in the films favour. Oh and Flashmobs are just stupid. You're better than that Friends With Benefits.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "This movie is clearly another version of No Strings Attached. It seems that Hollywood producers are psychic, and when one gets an idea, they all get the same idea, and they all produce the same movie at about the same, which may explain why Woody Allen is hysterically secretive about every movie plot he films. The critics seem to be arguing about this movie: Is it original or cliched? Is Kunis refreshing or shrill? Is the banter charming or relentlessly over-the-top? I would say all of the above, because the movie has strong scenes and weak scenes. Kunis's character is sometimes the smart, glamorous career woman every woman presumably wants to be, and sometimes she's just neurotic and too focused on men, even while she vehemently denies that men are the most significant part of her life, and that if she doesn't find a serious mate soon, she's going to have a nervous breakdown. Of course, the rom-com formula is that she is charmingly perfect--her clothes, her hair, her job, and her brilliantly timed wit. (There is a continuity problem with Kunis's hair--most of the time her sleek ponytail falls halfway down her back, but in some scenes she has a small ponytail that barely reaches her neck.) Of course, the theme is platonic-friendship-with-sex, a contradiction in terms that confuses the two participants more than anyone else. Everyone else knows they're in love and they're deluding themselves; they think they are participating in a grand philosophical experiment that no one ever thought of before, which brings us to the inevitable conclusion that was unintended: in the end, both characters appear to be undereducated. No one reads books, but movies reign supreme and are to be counted as the major influence that shapes lives, careers, and minds. As intelligent as both characters are, it's mostly street smarts--material success is based on being young, beautiful, hip, energetic, verbal, gutsy, and with a physical athleticism that makes for some smooth moves. This also happens to be all the attributes necessary to be a Hollywood film star. So, although the characters played by Kunis and Timberlake are suave and attractive, they are also shallow. A weak attempt to portray Timberlake's suffering over his father's senility is a case of too little, too late. Ultimately, if the characters have to be rich, spoiled, and self-absorbed, the producers should at least make sure that the movie has a plot.",
      "total_reactions": 0,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2012
      },
      "score": 7,
      "text": "I have to admit, nobody expect (including myself) Justin Timberlake to be a good actor....but he actually is.  Mila Kunis has always been a great comic actress (and probably, one of the most beautiful actress of her generation).  Both cast members have so much chemistry that it carries the movie along, making it one of the better Rom Com in recent memory.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Brilliantly funny with witty comedy, Sadness and madness. A brilliant film with brilliant acting from all the people involved. If you were expecting a large appearance from Emma Stone, you will be disappointed.",
      "total_reactions": 0,
      "user": "CharlieGCarr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Mr Harrelson, Ms Clarkson & Mr Jenkins are the best part of the movie, because it doesn't feel like they are acting. Ms Kunis (Jamie) & Mr Timberlake (Dylan) fire off one liners & repartee like, well, they memorized their lines. Ms Kunis fares much better during the 2nd half of the film, the actual love story. The writing of Dylan's character is way overboard and not necessary. It's hard to believe he is so naive. Didn't he see \"When Harry Met Sally?\" Men don't have women friends, unless they're fibbing or gay. Ms Kunis kept me from the dreaded FFWD. To the reviewers who compare this to similar films or the director's previous work, hey, just write what you thought of this movie. Story, characters, etc. Mr Timberlake was excellent in The Social Network as was Ms Kunis in Black Swan and Easy A was terrific-so what? That has nothing to do with this film. I didn't cry, laughed once and a while, and was waiting for better. It would be refreshing to see a movie end where the couple goes their own way instead of tying it all up with a nice bow. Even though lacking chemistry and with some less than thrilling dialogue, it's still worth a look. Do 30'somethings really talk like this? Perhaps when we write a review we can give some demographic info. I don't care what the critics say, what about you same agers? You like it?",
      "total_reactions": 0,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "For what it is, a chick flick, it's not bad. Obviously as a male these movies aren't my favorites but if you absolutely have to watch a movie with your girlfriend, this isn't a bad choice. I would never under any circumstances watch it again though but for one time it's fine.",
      "total_reactions": 0,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Dylan (Justin Timberlake) and Jamie (Mila Kunis) think it's going to be easy to add the simple act of sex to their friendship, despite what Hollywood romantic comedies would have them believe. They soon discover however that getting physical really does always lead to complications.",
      "total_reactions": 0,
      "user": "allmovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "[MILD SPOILER] A-MA-ZING.  Although cheesy and predictable, the cast for this movie brought it all the way home for me and left me smiling and satisfied with the \"happily ever after\" ending. There was no doubt that they were going to fall in love with each other and get together by the end of the movie - however just every little detail and every cute thing made it that much cuter and entertaining to watch.  Justin Timberlake and Mila Kunis look really good together. HOWEVER; the trailer is slightly misleading - the trailer depicts a much more sexual side of the movie while the whole movie is sappy and cute. Overall, the cast had great chemistry and the acting was well done. I'm glad I watched it; it's totally worth the time!",
      "total_reactions": 0,
      "user": "SShao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Knowing anything regarding the plot, it will probably be pretty obvious to all how the story ends and unsurprisingly Friends With Benefits stays true to expectations. That said, what happens prior is largely enjoyable thanks to a strong script, energetic performances from the leads and fantastic chemistry between Timberlake and Kunis. Woody Harrelson turns up as a gay sports editor to some amusement. I did get a little frustrated at how flippant and **** the pair are in assuming that their friendship will be unaffected, especially when as a viewer you know what's around the corner, perhaps that's the whole rub of the film though I guess. The writers try unashamedly hard to pitch their characters as the coolest inner city hipsters, Jamie from N.Y. and Dylan from L.A, listening to Semisonic, with flash mob contacts and friends with street artists. As the pair make fun of romantic film stereotypes, the writers just about avoid falling into the traps they mock.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "Romantic-comedies have become such a static routine in Hollywood that even the two lead characters in “Friends with Benefits” have memorized its blueprint. Earlier scenes present us with mild optimism when we learn that our impending couple is considerably aware of the genre’s most common clichés. But their advantage leads to no benefit when they go right ahead and implement the things they were formerly trying to rebuke.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "A very good rom-com, poking fun at the cliches of the genre, and creating a different take on the story. It also doesn't straight the way throw us in with a love story, which provides laughs, and proof that they are falling in love subtly and very well. If the film had just stayed this way, it would have been one of the best rom-coms in a long while, but the film eventually falls into the cliches it was making fun of. But it still provides laughs, and a fun film, and even though there are faults, it is the best rom com of this year and the best out of a couple of years.",
      "total_reactions": 0,
      "user": "charlieW24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Clearly the premise rips No Strings Attached off but the style of the two films could not be more difficult. No Strings Attached seems more connected to its emotions and less funny. Friends with Benefits is clearly more dirty minded. For me, Woody Harrelson steals the show in every scene that he's in. Unfortunately he isn't in it enough! The film itself is funny and warm-hearted with some great eye candy too. Definitely worth a watch but possibly not worth all the hype that it received.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Mila Kunis and Justin Timberlake have great chemistry in Friends with Benefits- a montage of feel good fun, and easily the romantic comedy of the year.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "I really liked this film. It's completely predictable, adding nothing new or exciting to add to the romantic comedy genre, but it's well done. Solid script, interesting characters, and great lead performances drive this film to a higher level that it wouldn't have been in otherwise. Justin Timberlake and the beautiful Mila Kunis give solid performances and have excellent chemistry together. I definitely recommend seeing this film!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 4,
      "text": "I preferred it the first time watching it. Watching it the second time gives me the realization of how stupid the plot is. It's just another romantic comedy.",
      "total_reactions": 0,
      "user": "r0tan0rtan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "While funny and catchy for (few) moments, this movie is so concerned about not falling into boring clichés that, in not doing so, they still fall apart on it, trying to sell us stupid misconceptions of men, women, relations and love in general. Entertaining, but (less than others [but still]) cheesy.",
      "total_reactions": 0,
      "user": "jotaeseche"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "The film makes fun of rom-com cliche's yet the film is an entire cliche yeah I am self aware of that their gonna be together and I know how silly the formula is tiresome, but Timberlake and Kunis's chemistry works so does the R-rated humor. Jamie (played by Mila Kunis) is a executive recruiter, who entices Dylan (Justin Timberlake) an art director from Los Angeles, to take a job at the New York office at GQ magazine. They both are tired of dating and don't want to date, they are both intimacy issues, so when they find out what they have in common so they become fast friends. Dylan and Jamie decide to quit for true love and focus on having fun, so they become friends with benefits (title). Co-writer director Will Gluck   (Easy A) makes Timberlake and Kunis sexy also makes the formulaic hot body romantic comedy fun to watch. At times watching this film made me moan, it was so painfully predictable. But hey I enjoyed it. 3 out of 5 stars",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "The movie is predictable,the characters are cliché and the acting is pretty normal.The movie is not very funny and gets pretty boring.The only good and funny character was Woody Harrelson's one.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "It's really a very good movie. I liked very much, especially the \"couple\" that. Worth seeing    .",
      "total_reactions": 0,
      "user": "Marick"
    }
  ]
}