{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 64,
  "mc_mixed_rating_frequency": 60,
  "mc_movie_name": "Fright Night",
  "mc_negative_rating_frequency": 19,
  "mc_positive_rating_frequency": 189,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mary Elizabeth Williams",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "Farrell looks like he's having the time of his 400-year-old life."
    },
    {
      "critic": "Keith Staskiewicz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "It ends up getting a surprising number of things right."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "It stands apart from the rehash pack by accomplishing something rival remakes rarely do: It improves on the premise it has been handed, producing a modernized version of a decades-old story that's superior to its predecessor in virtually every aspect."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Fright Night isn't quite a classic vampire movie, but it's refreshingly straightforward and self-deprecating."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Fright is way too quick on its feet to be slowed by clichés. David Tennant seizes McDowall's role as Peter Vincent, now a Criss Angel-style clown vampire slayer. Christopher Mintz-Plasse was born to play a high school nerd."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "It honors the original throughout, including a memorable nightclub scene and a surprise cameo that's a huge crowd-pleaser, while at the same time giving updates to make it fresher and better than ever."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Fright Night joins \"Rise of the Planet of the Apes\" as proof that you actually can do this sort of thing correctly."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "The remake isn't openly nostalgic. In a sense, this is another sexy vampire movie. But Farrell does something special with the sexuality: It's simultaneously omnivorous, dangerous, and a hoot."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Plenty gory, but graced by a jovial sense of humor and an enjoyably guts-centric use of 3-D."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "The film's greatest pleasures come from Noxon's script - which puts the sexual chaos created by Farrell's attractive bloodsucker front and center - and from the performances."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "As in the earlier film, this one dances always at the edge of comedy. It especially has fun with the Rules of Vampire Behavior."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 75,
      "summary": "Fright Night can also boast of having the best vampire-villain in ages. The bushy-browed Colin Farrell was BORN to wear fangs."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "A steady supply of spiky humor and a game cast keep this cooking most of the way, though the pacing could have been tighter and the film seems as if it's about to end two or three times before it actually does."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "The old \"Fright Night\" was both self-aware and effectively scary, and if this one seems to prefer gruesome digital effects to old-fashioned bump-in-the-night spookiness, it still succeeds in keeping the audience both tickled and anxious."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "This remake is good fun, aided in no small degree by Colin Farrell's strutting, dead-eyed performance as the bloodsucker."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 70,
      "summary": "It's a somewhat goofy movie that also manages some real scares. Best of all, it makes excellent use of an element of vampire stories effective since Count Dracula confronted Van Helsing in Bram Stoker's novel: I know that you know, and I also know there is nothing you can do about it."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 65,
      "summary": "Fright Night glides into its first climax with some funny touches but without building much structure or suspense."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "The new version is mildly entertaining with some fun performances."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "With the exception of a few stakes and crosses jumping from the screen, some bloody sprays here and there, and one creepy, claustrophobic car ride, the 3-D glasses are a hindrance, not an enhancement."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "Menace and mirth can cancel each other out. But the combo clicked in 1985's Fright Night (banish the 1988 sequel), and it clicks again in this frisky 3D remake."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 63,
      "summary": "One of the minor triumphs of this Fright Night remake is Farrell's coolly assured performance, a cocksure spectacle of masculine virility far more intimidating to his character's victims, male and female alike, than the razor-sharp fangs Jerry uses to munch on human neck meat."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Funny and scary - and sometimes both at once - it lives up to the original, even if it fails to surpass it."
    },
    {
      "critic": "Nick Schager",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "With a similar brand of self-aware playfulness, retains its predecessor's sturdy narrative foundation."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "You'll need a taste for nostalgia to really appreciate Fright Night, which knowingly blends Eighties cheese with Nineties snark - a combination that works better than it sounds."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 60,
      "summary": "Thankfully, the 3-D is surprisingly well-used, not just for arterial spray but to accentuate the constraints of the mega-bland, housing-bubble architecture of the characters' neighborhood. That anonymity is the real horror show."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "While this nouveau Fright Night does a reasonable job of maintaining the fun spirit of the original film, between the blood splatters and vamp stakings, it never builds on what the original had to offer -- and thus never quite makes a convincing case for its own existence."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Fans of the irritatingly limp and relatively toothless Twilight series may actually find their tormented inner selves fondled to exquisite, precoital perfection with this slick and gleeful adaptation of the classic Eighties vampire-next-door flick."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "There's an irrelevance to the movie that the filmmakers, hard as they try, can't quite shake - something awfully square about the picture: It would have played a lot better a decade ago."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 50,
      "summary": "Aside from some cosmetic changes, little of what this Fright Night offers elevates it above the classification of \"unnecessary.\""
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 38,
      "summary": "Feeble comic one-liners and slow pacing combine for a routine fangfest in this remake of the 1985 film."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Nothing new in this teen vampire flick, except for the lack of nudity. I usually stay away from these movies but the Green Metacritic rating and the name actors peeked my curiosity. It is different from the usual fare (nubile lasses needing no reason to remove their tops), but not here. Someone must owe someone as Mr Farrell and MS Collette appear. Mr Farrell may have had good fun being the \"bad guy\"  but Ms Collette is clearly here for her name as she has a very small meaningless part. There are a couple of attractive women (a fetching girlfriend and crying stripper) but also with little dialogue, although our hero does need a sweetheart to encourage him. Mr Yelchin plays it for real, although there are a few laughs, it tries to be a serious film. He is believable and does have some unusual facial expressions, but overall he is average. The film is well made, good pacing, silly and preposterous at times, but aren't most teen vampire films? I wanted to like it as the \"names\" do a credible job, but it's just not worth seeing. Not horrible, but not recommended (C+).",
      "total_reactions": 1,
      "user": "RobinsNest"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Having been a fan of the original and not a big fan of hollywood remakes, i was worried about this redo.  The basic premise is the same but the makers definitely augmented the whole storyline.  Colin Farrell is passable, not great.  It's probably the weakest part of the film...Jerry\"s role.  The other actors and their parts are really good.  Peter Vincent's reincarnation is pretty ingenious.  Overall, this is a really good summer movie.  Really really funny too...and most of that can't be showed in trailers because it would amiss of context.  Not sure why this didn't do well at the box office...I think the trailers failed to show the humor.  The Russian kid who plays Charlie and the girl from 28 Weeks Later are excellent in their roles...as is McLovin and Toni Colette.  Most fun i had at the movie this summer...for sure.",
      "total_reactions": 4,
      "user": "kld"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "Its awful. There is a feeble attempt to interject some 'are you from London' english humor but it falls flat. This is a awful awful movie......i dont get it. What was Colin Farrell thinking !",
      "total_reactions": 6,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Easily one of the best movies of the year. I was really surprised at how great Fright Night was. Everything from the acting, the atmosphere, the music, the story... it was all pin-point perfect. Colin Farrell was absolutely amazing in this movie. I mean, everyone is great in it but Colin really stands out. Everyone should see this movie in theaters, it's fantastic. 10/10",
      "total_reactions": 4,
      "user": "EliteF50"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "A very enjoyable mix of campy suspense, action, and humor. Great performances all around, with the highlight being Colin Farrell as Jerry the vampire. My friends and I loved it. Give it a watch, it might surprise you.",
      "total_reactions": 2,
      "user": "bl_nk"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "I've been hesitant to write this review because I think Colin Ferrell brings the right attitude to the role, but the film as a whole really left me flat and, most damningly, bored.  This horror fan wasn't \"scared\" in the least - there's nothing frightening about it.  And it's just not very funny - aside from McLovin', who is genuinely solid in a small role. The lead actor (Yelchin) was a poor choice - they could have done much better.  Even the Las Vegas act - who is also funny - isn't charming enough to make it a great film.  I kept thinking that Bruce Campbell would have been a great choice to sneak into the film somehow. Also, 3D did nothing for the movie - in fact, it almost detracted from my experience.  Just another film that I have to disagree with the critics on. It happens.",
      "total_reactions": 7,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "The comeback for vampires as a bankable horror sub-genre of film was still in its incubation stage when \"Fright Night\" snuck into theaters during the slasher pic's heyday back in the mid-eighties. With tactless anti-heroes such as Jason, Michael Myers, and Freddy Krueger upping the gore factor with each subsequent sequel for their respective franchises, how could the relatively subtle bloodletting induced by the fang bite of a debonair gentleman compete with arterial spray? \"The kids today, Peter Vincent, the host of a local TV \"creature feature\" show complained, \"don't have the patience for vampires. They want to see some mad slasher running around and chopping off heads.\" Charley, however, had a taste for the vintage stuff, albeit not a goth, he knew that Bela Lugosi was dead, which automatically made him an outsider like British Invasion rock aficionado Max Fleischer, whose eclectic interests helped fill the void of being without female companionship in \"Rushmore\". Likewise, the losers in \"Weird Science\", old school horror buffs both, not coincidentally, are invisible at their high school, but at least they use their geeky fandom to good use by building themselves the perfect woman, based on their viewing of \"Frankenstein\". With Lisa's help, they come of age, where the \"monster\" corrupts Gary and Wyatt, who gawk nervously at the buck naked sex goddess, unsure of how one goes about losing their virginity. Conversely, or so it seems, Charley appears all raring to bust his cherry, hers too. Amy, his girlfriend, whom he has on the floor in the opening scene, the two going at it hot and heavy, in which Charley reappropriates the televised monster flick as background noise, the coverage they need to absorb the impassioned cries of their potential lovemaking. As usually is the case, judging by Charley's incensed reaction, the girl puts a halt to their amorous doings from going any further, leaving him, once again, with, presumably, blue balls. But how blue are those balls, in actuality? This time, Amy agrees with Charlie's protestations, and makes herself available on his bed, just what he was, only moments ago, clamoring for. The moment passes. Now his attention is drawn to the neighbors next-door, carrying a coffin, like life imitating art(or an outward projection of his cinephilia), yet what could be more important to a young man than life imitating a porno. Some moments don't pass. \"Premature Burial\", like all films made during the Production Code era, was virtually free of sex and nudity. Why would a red-blooded male teen want to watch that? It should come as no surprise, then, that Charlie would rather stare out the window than ogle a half-naked nubile, since unlike other guys his age, the titillation factor in catching a glimpse of breast before the homicidal maniac stabs his sexually active sister to death(from \"Halloween\"), holds no interest for him. On a subtextual level, the coffin is not what enraptures Charlie; it's the prospect that the two men are lovers. Drawn to them, on another night when Amy isn't around, he goes outside to investigate, spying on his neighbors from behind the bushes. When Mrs. Brewster call out for her son, she blows his cover(as both a voyeur and heterosexual), whereupon detection, Jerry rolls a half-eaten red apple towards Charlie, as if enticing him to take a bite(read: to sin). Exactly what does the slightly effeminate \"Evil\" mean, when he asks his friend, \"Did she find out how you really are?\" But nevertheless, Charlie has outgrown Ed, a latent fact which the new \"Fright Night\" brings to its inevitable fruition, accurately predicting that their friendship would have eventually dissolved had his the evil one not \"died\". Reaffirming his own masculinity, Charley equates vampire fixation with liking Stephanie Meyer novels, provoking Ed to respond: \"I'm seriously angry that you think I read 'Twilight',\" while they investigate the disappearance of a mutual confidant. But Charlie, in a shrewd move on the film's part, isn't a fan like his eighties counterpart, even though it's now socially acceptable to be into vampires...if you're a girl. \"Fright Night\" aims to remind people that these nocturnal creatures have more in common with the shark from \"Jaws\" than Edward Cullen. Vampires don't glitter prettily in the sun, they burst into flames. This time around, Jerry eats green apples, and doesn't share his forbidden fruit with Charlie. This time around, Charlie discovers vampires, then he ignores Amy. The gratuitous action that dominates the third act, smacks of overcompensation for a perceived feminine genre, mirroring Charlie's own exaggerated machismo by dating a sexpot. Could there be an even more incriminating photo on Ed's phone? More than a series of vampire murders, \"Fright Night\" is about a murdered friendship, two people who are in very different places in their lives, suggesting a prequel to \"Chuck & Buck\".",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "I was planning to see the original 1985 of Fright Night, and I didn't catch up to see. So anyways, the new Fright Night was very entertaining and it's a lot o fun for putting old style of every vampire movies or horror films to bring back some memories, until we have to watch more romantic vampires of dullness, you know the Twilight series. Colin Farrell and David Tennant did perfect job as the characters that they look extremely cool. Farrell plays the villain who he wants to terrorize the neighborhood into vampires and he's very charm to others. Tennant plays Peter Vincent who learns everything about vampires does exist to teach the rules to kill vampires. The cast did pretty okay and do like the character who seeks that his next door is a vampire. The scenes are cool to watch and sometimes it could be handy to watch in 3D (but please see this in 2D better). The story was good and almost compare to the original that they have both compliment to the original to make it new. I enjoy so much and please check out the Twilight joke where Charley talks to the McLovin character if you know what I mean.",
      "total_reactions": 1,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "Should've been called **** Night.'  What a dreadful film.  I have no idea how the main cast signed on for this.  Feels like it was written by a 1st year film student.  Zero drama, zero suspense, zero interest.  I agree with a few others on here -- this film was boring.  Would've worked better as a spoof comedy.  Give it a miss.",
      "total_reactions": 1,
      "user": "podriscoll27"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Usually I'm not a '' vampire '' movie fan, but I really liked '' Fright Night ''. When I first saw the trailer, I wasn't sure how it will turn out to be. For some reason, I founded Colin Farrell (at first) weird as a vampire. I was wrong. He delivered a great performance. The movie was surprisingly good. It had the perfect suspense, the perfect dark ambiance and even the soundtrack was awesome. The only part they left was the '' scary ''. It won't make you scared to death (for those who like to be scared, you will be disappointed), it just has a few '' jump up '' moments and some stressful scenes. Some vampire fans may appreciate the fact that it has the rules, like the vampire can come in to your house unless they are invited and the rest you already know. So it's a good, enjoyable '' end of summer '' movie.",
      "total_reactions": 1,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I am completely amazed at how horrible this movie is. The original is one of my favorite movies of all time. This movie really pales in comparison. The only thing it had in common with the original are the names. Thats it. Everything good about the first movie was removed and replaced with cliche. I can't understand how anyone could've enjoyed this movie. I do not recommend at any cost.",
      "total_reactions": 1,
      "user": "scorpius952"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Entertaining in many aspects, balancing jaded roots and a modern flow to create one pretty awesome flick. Action, horror, suspense, comedy - it does all of this with a **** that provides pure adrenaline at times, and fun and laughter at others.",
      "total_reactions": 1,
      "user": "FatalExcursion"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Better than i expected. The cast was really good, especially anton yelchin who did a great charley, david tennant and chris mintz plasse were funny and hilarious. Everybody have to see it. Will not be disappointed.",
      "total_reactions": 1,
      "user": "nye"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "The movie \"Fright Night\" is just what you've been waiting for, if you've been looking to see a fun, intense, vampire, bloody, good time! The movie was basically made for nothing less then a fun time. So boys, grab your dates, head to the theater, and get ready for movie that truly defines a night of fright, and bloody good fun!",
      "total_reactions": 1,
      "user": "xXRenTyrellXx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "For me, this is one of the best suspense movies that I have seen in a long time. You get everything you ever wanted in a movie without needing to change theaters. You get sucked into the story right from the start and you have a lot of fun during it trying to figure out how he is going to get out of the situation. I never thought that Colin Farrow had it in him to be able to pull this off, but he does. I never watched the original and after this I don't think that I want to. The graphics are amazing and seeing the old one will just make me want to see the new one and trash the old one. Great movie must see!",
      "total_reactions": 1,
      "user": "DriveThruReview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Have you ever had that \"uh oh\" feeling?  That is exactly how i felt as the movie moved along.  The character payed by \"McLovin\" could have totally been editted from the film.  To be honest, I believe the movie would moved along better without him. The movie had some nice 3d effects, but they weren't enough to save this stinker of a movie.  There were no \"spooky\" parts in the film. Now that i think of it, there weren't many action scenes either. I honestly have no clue why someone would reccommend this film.",
      "total_reactions": 1,
      "user": "ymaill"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "I registered with Metacritic so I could write this review. There just has to be more in your life for you to do than watch this movie. Seriously. Go do something productive, you'll thank yourself for it in the long run.",
      "total_reactions": 1,
      "user": "ants124"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Fright Night is a remake and reinterpretation of the classic 1985 film, Fright Night, about a teenager, addicted to TV horror series (particularly a show called \"Fright Night\", which has a vampire hunter named Peter Vincent), who discovers that his new neighbor is a vampire, and after the neighbor noted that he knows these secret, he tries to prove this to everyone, together with his friend and girlfriend. The big difference between this version and the previous one, is that this is move fells more for a horror one, and can not recreate the atmosphere of the first film. The roles are reinvented and adapted to modern times, and to a different city (Las Vegas): Jerry Dandrige works well, but I think as Jerry Dandrige (the vampire) is not at the same level as Chris Sarandon in the classic movie, that was a better villain. The actors now, are usually better (the vampire slayer Peter Vincent, played by David Tennant is very good and funny in the role), but the film has another air, pulled into the action and horror genre (but ends up being a bit tedious) and have a end that gives the impression that the movie ended too soon. Still, it's a good entrainment as a movie, although lower than the original - My Score: 6.6 / 10.0",
      "total_reactions": 1,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "A really funny film, I think that is not much scare than the original, but is great, the cast is awesome, Anton Yelchin, Collin Farrell, David Tennant, wow are awesome, I love this remake.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "Exploitive, vulgar, and trashy, Fright Night is one of the worst movies in 2011. Everything that comes out of it is glossed over with an obnoxious coat of profanity and sexually explicit dialogue that doesn't fit in. I don't disown those kinds of movies when the content is justified (Goodfellas had good reason to have 300 f words), but this movie is abysmal, disgustingly shocking, and grotesque, and is not justified at all. It's barely justified to be on the silver screen in the first place.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Simply brilliant. I think it takes a certain type of movie fan to appreciate this kind of film. Treads a fine line between comedy and horror which could be seen as cheap and cheesy but if you can get past that, wow masterpiece. Literally the best film I've seen in years but it's kind of my genre.",
      "total_reactions": 0,
      "user": "Tresidentevil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "i liked the original fright night and is a great vampire movie classic . the remake actaully doesn't do to bad a job. i dont think it was as good as the original but still pretty solid. colin ferral does a pretty solid job as the vampire . the british guy who is replacing mcdowles role is ok but mcdowle did a much better job . the new lead kid is ok carries him self well enough . there have been some changes in the story , not a bad thing since overal it basically follows the same plot as the original.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "This was a well done movie.  Fun.  Funny.  Gory.  And scary too.  I had liked the original in its day and there are things they lost from that one which I wish they had preserved, including the mechanism for Charlie's discovery of the nature of his neighbor.  There were moments in the movie where the 3-D was really impactful, but frankly, those moments were too few and far between.  Lesson learned, do not take someone who has been recently bitten into the sunlight.........Yikes.",
      "total_reactions": 0,
      "user": "Audiowombat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Anton Yelchin discovers that a enigmatic neighbor (Colin Farrell) is a vampire. The story unfolds predictably, the action is average and the scares are non-existent. While it's made with energy and a compelling cast, nothing about this remake is worth the effort. Look for a cameo by Chris Sarandon (the vampire in the original version).",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "The worst attempt at a reboot that I have ever seen. The casting was decent, but the script is terrible, the settings are terrible, and the cg FX were god-awful. I realize what they were trying to do, updating it for a new generation, but they managed to lose everything that gave the original its charm. Charlie was supposed to be the one that believed, not Evil Ed... major difference. Tom Holland should be ashamed that he sold out, letting one of his best franchises be turned into this trash. Should have stuck with the original stars and made a Part III where Charlie is a father protecting his kids. It would have drawn attention to the originals while bringing it to the next gen. Instead we got this terrible terrible movie that we have to try to forget.",
      "total_reactions": 0,
      "user": "Sandrick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "horror movie? is this a joke? by god that looked like a cheap comedy, where you looked you think the most absurd thing you've ever seen, damn lucky I did not spend my damn money to see it in 3D because it showed normal screen were a mess.",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "I don't really like horror movies in general but this remake of Fright Night left me with an ear-to-ear grin. I loved the original 80's movie and this new version is almost as good. Funny, campy and even a little bit scary, this is about as much fun as I've had watching a horror film in years!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Personally, i'm not what you would call a vampire movie fan, the thought of Twilight makes me sick however I was pleasantly surprised with \"Fright Night.\" It gets back to basics, well what I remember of the old vampires, and is very entertaining. Colin Farrell was absolutely fang-tastic as Jerry (the vampire) and seemed to be having the time of his life, all 400 years of them! Farrell was impressive to say the least after his phenominal performance in Horrible Bosses he steps up again and takes it up another notch. The plot is simple, Charley Brewster (Anton Yelchin) a  teenager with everything going for him, hes popular, cool and ofcourse has the girl of his dream however when Charley's former best friend (Christopher Mintz-Plasse or McLovin to most) tries to convince him that his neighbour Jerry (Farrell) is a vampire his suspisions fall on deaf ears but very quickly Charley realises his former best friend has been right all along and as it turns out Jerry is thirsty! The film is actually pretty dark compared to the usual steroptypical films think Disturbia except with vampires and your on the right tracks. The suspense is brilliantly built throughout and combined with a more darker outset it really works well with this reboot although I have to say its far from scary. Sure there are a few moments that will make you jump but you won't be frightened enough to avoid going to your next neighbours door! All in all Fright Night is good, solid, well made movie. It makes vampires look evil again after all the Twilight outings.  Christopher Mintz-Plasse aka McLovin himself is great in albeit a small role and brings good charisma on his part but Farrell steals the show as he is dynamite throughout. Definetly worth a look and one of the shockingly good movies of the summer.",
      "total_reactions": 0,
      "user": "Rosco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2012
      },
      "score": 1,
      "text": "I don't know what drugs reviewers have been taking, but this was one of the most unoriginal, boring and dissapointing movies I've seen in years. Colin Farrell will be the next Nic Cage if he keeps making trash like this, and this may just ruin Mintz-Plasse's career. There's a reason this bombed at the box office - the truth is in the ticket sales. Stay away from this bore of a film.",
      "total_reactions": 0,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "Whether or not you have seen the original, award winning \"Fright Night\", written and directed by Tom Holland and screened in 1985, this slick, modernized re-make will leave you wanting a bit more. Well, maybe a LOT more. Let's start with the positive: The cast. Anton Yelchin, Colin Farrell and Toni Collette are all dynamic actors who should be able to really whip their scenes into shape. They almost succeed. Unfortunately, the actors' efforts are wasted by poor set pieces, bad pacing, lackluster attempts at humor, and bad directing. Even in a vampire spoof, the laughing should stop when the killing begins. Here, the vampire appearances are far from frightening - they are actually rather boring, and not gruesome at all. Las Vegas should be a great framework for a vampire story - here, we are just shown a small development outside of the strip which is not very spooky at all - it is rather cookie-cutter in its simplicity, which does nothing for the mood of the movie. David Tennant does what he can with the character of Peter Vincent, the great vampire killer - unfortunately, it simply is not enough. The angst he channels does not make its way off the screen, and adds very little to the plot of the movie. The CGI scenes are over-utilized and not at all frightening. Please see Fright Night for yourself - the original and the remake - and draw your own conclusions. Despite the addition of a slick, new atmosphere and popular actors, this movie falls flat - it is literally a pale ghost of the original.",
      "total_reactions": 0,
      "user": "ChipperX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "Hard not to be tarnished having watched the original 2 movies, but this feels more a new direction for the series and it largely works at what it does well, but there are things that pull the lining out the story in places. Farrell's performance as the vampire are decent, although there was a sort of vacant feel to it... my biggest issue was really the casting for peter vincent... hard not to see him as Dr. Who.",
      "total_reactions": 0,
      "user": "HighwayUK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Fright Night is an incredibly fun and entertaining remake that is arguably on par with the original. With enthusiastic performances and a smart script, Fright Night will probably please both horror fans and fans of the original.",
      "total_reactions": 0,
      "user": "BrandonB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "In the wake of nothing but highly feminine, not scary, VERY homosexual vampire movies, this one came along.  And despite me not seeing the original, nor caring too much for vampires since I like zombie movies better, and the best vampire movie I've seen and recall is \"Let Me In\", this movie changed my view on vampire movies; there's still hope for good vampire movies, and Twilight hasn't ruined them, despite greatly making people thing their nothing to fear and something you want as a pet.",
      "total_reactions": 0,
      "user": "KAS--Will"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "It may not do much in terms of revolutionising the genre (though I did like the comparison between vampires and sharks), but Fright Night is an undeniably enjoyable vampire film. The two main highlights of the film are Colin Farrell and David Tennent. Farrel makes a great vampire - you can almost see him plotting how best to bring down his prey like a calculating predator, and Tennant's magician and vamp expert, while just a swearier, alcoholic, leather-clad version of The Doctor, is great for pure entertainment value. There may not be too much going on below the surface of Fright Night, but that hardly matters when the action, gore and self-referential humour is handled so well. It's just plain fun, and sometimes that's all you want from a film.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I saw this movie expecting a fun ok vampire flick and i came out of the theater very pleased. This movie was really good. At first when i saw the trailer, i was like serioisly? Colin Farrel as a vampire? Yeah that mofies gonna suck, and i was totally wrong. Mr. Farrel did an amazing job. He was frightening. He did a great job in this film as the creepy mysterious neighbor who turns out to be a powerful ancient vampire. This movie never got boring, i didnt see an unnecessary scene. Everything was good from start to finish. This movie was suspenseful and frightening, living up to its name Fright Night. Very good vampire flick. I thoroughly enjoyed this movie 8.5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "Being a fan of the original Fright Night and director Craig Gillespie, I found the movie disappointing (particularly the ending). You got to hand it to Colin Farrell though, he played a really good villain, too bad it goes to waste on the mediocre movie.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "i liked this movie a lot! haven't seen the original yet but i must say if the original is great which i hear it is then this remake did an awesome job. i liked the cast except for the \"bully\" Charley's friend who is a total ASS! and looks a lot like James Franco! wait that's because they're brothers. lol anyways the movie was great can't say it was \"Scary\" but it did have its suspense! Colin Farrel did AWESOME! he really convinced me, and definitely looked the part ,nice job. Charley's character was a dick to Ed AKA \"Mclovin\" but he played a passable part honestly i think that part could have gone to anyone. Amy who is Charley's girlfriend also had a passable performance and could have been replaced easily! OVERALL the movie was good it served its Purpose. Not quite scary but definitely had its suspenseful moments. Some good humor in it also and some nice action scenes. Didn't care for the 3D! SO I'm giving this movie 9/10 some parts dragged a bit like the whole going to \"Vegas\" thing but its a great movie. I also compared this movie to \"Disturbia\" imagine Disturbia meets Vampires! REALLY UNDERRATED FILM. its actually sad that people would go watch a **** movie over THIS! if you're going to see a movie i highly suggest you watch this one! its definitely worth 12 or 15 bucks!.......",
      "total_reactions": 0,
      "user": "destroya1art"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "I was really surprised at how great Fright Night was. Everything from the acting, the atmosphere, the music, the story... it was all pin-point perfect. Colin Farrell was absolutely amazing in this movie.",
      "total_reactions": 0,
      "user": "fsw37"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Fright Night is wildly entertaining. The storyline adheres just enough to the original plot for me to ignore the modern trappings inserted by director Craig Gillespie. Fright Night is a remake of the 1985 film starring William Ragsdale (Herman from \"Herman's Head\" for those of you old enough to recollect the failed sitcom). What is new about Fright Night v 3 or FN 2011 as it were, is Colin Farrell. Farrell brings a much needed edginess and let's face it, a believable bad boy vibe to the franchise. Even better is the added bonus of Christopher Mintz-Plasse returning to his McLovin' roots by acting like a bamboozling buffoon. There is nothing more pleasurable than watching the clumsy geek-Ed Nelson (Mintz-Plasse) turn into the frightful vampire 'Evil' Ed Nelson. Newsflash people, turning into an undead creature of the night does not guarantee a change of personality, a mailing address perhaps, but that's it!",
      "total_reactions": 0,
      "user": "TonyRio"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "Fright Night is a great horror not because it is the scariest (it isn't), or the most richly layered (it isn't), or speaks the most about the genre as a whole (it doesn't). Fright Night is a great horror film because it remembers that just because it can be scary doesn't mean it can't be a lot of fun. It's an antidote to the sickening \"torture porn\" craze as much as an antidote to the \"soft vampires\" that Stephanie Meyer and Anne Rice have sickened us with for the last 18 years.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Fright Night is a simple horror-comedy which didn't suck like most of the films like in this same genre . I Dont remember the original one but I am pretty sure i did so not gonna judge between them . Colin acting as the Vampire was really good . Anton did good and David Tennant did really good job . I really liked the small town and the weather . Waited so long to see this kinda weather in a horror film . effect was amazing and Craig  did good . Its the script that seems a little dull to me(again not compering) . The could make more awesome . End was not good . but overall enjoyable film just not what i expected.",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "What a waste of  a good movie idea and our  Farrell and Tennant who are both capable of turning in performances 100% better than this with their eyes closed if given a chance. Shockingly bad performance by Anton Yelchin-wooden enough to play a vampire hunters stake. I was looking forward to this but it turned out to be just another example of a director  throwing away a chance of a good remake by pandering to the USA  teen market.",
      "total_reactions": 0,
      "user": "Themardler"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 6,
      "text": "Not a big fan of this movie, it was decent, but not that much. I mean the human to vampire transformations were just ridiculous, it was a bit boring and annoying at same times, didn't make the cut for me for best movies of the year (I already knew it wouldn't, vampire movies are good until they reach the point of exhaustion, which means by the 20 first minutes).",
      "total_reactions": 0,
      "user": "FIlmsareawesome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "While I wouldn't say this is the greatest movie of all time or even close.  I would say this is a fun movie to go see. The scares are more subtle and the humor is easy to follow.  This is a remake of the older 80's film it does however take a darker twist to it.  Ferrell's Jerry role is much more intimidating and scarier than the old version.  Some people wont understand the film or are looking to deep for something that isnt there.  This film is predictable but it isnt about the epic story twisting or some nonsense like that and there are no Emo-Vamps in this.  If your looking for a more classic style movie of bang here it is then this is the movie for you, I relate it to a simplistic roller coaster.   I can just sit and enjoy the ride so to speak.",
      "total_reactions": 0,
      "user": "Biobilly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "So I went and saw this movie opening night with my girlfriend who is a die hard fan. Walking into the theater there was only about three other movie goers in attendance. I have to say this movie was great and while watching the movie we didn't even notice that we were basically alone. Colin Ferrel's take on Jerry's character is a very refreshing rebirth of Chris Serandon's sexy seductive vampire. Things like the green apple obsession remind lovers of the original that the movie producers hadn't forgotten this movies roots. I wish it had done better because this truly was the best movie I saw over the summer.",
      "total_reactions": 0,
      "user": "wojo1215"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "See-it - Colin Farrell stars in this stylishly scary remake of the 1985 cult classic about a high school senior and his \"bloody\" strange new neighbor.",
      "total_reactions": 0,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I saw it, not enough good as expected but it's OK. David Tennant comes in as the magician just at the right time to juice up the proceedings, it's all for vampires lover. supply chain management system",
      "total_reactions": 0,
      "user": "louistoth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Collin Farrel is simple the best vampire i ever seen, obviously Gary Oldman is the best classic vampire but this movies is just great! this movie show a vampire the way it is mean to be, this movies is just another kick in the ass of twilight, suck this Edward Cullen!",
      "total_reactions": 0,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "I don't know why this movie didn't have more success, it was totally awesome.  Colin Farrell was the perfect casting choice for Jerry, and Anton Yelchin establishes himself as leading man material.  I don't get the people who weren't blown away by this film.",
      "total_reactions": 0,
      "user": "Dave2008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "I should have seen this at the cinema but I got caught up in other things. It sounded extremely fascinating when I first heard about this, mostly considering there were some great actors in it, like David Tennant and Colin Farrell. When I did see this a couple of days ago, I suddenly agreed with my previous statement. To make it more effective, my parents turned out all the lights in the house, so all I could see was this disturbing glow of a bloodthirsty vampire tearing out someone's throat. Colin Farrell makes for a very effective vampire; (he was my favourite character) he didn't really scare me, he was more creepy than that. He certainly had the look and quality of a vampire. Remakes aren't normally as good as the original, but despite the normality, the acting, the dialogue, the atmosphere - it all creeped the hell out of me. This is also fantastically gory and the actors just passed swiftly under it, refusing to give in despite the fact that there was a vampire on the loose. Nothing like Twilight - as Ed described Jerry (cool name for a supernatural creature by the way) - he's the freaking shark from Jaws. In fact, this is very, very good quality. Would have liked it to have a higher score, but at least the reviews were mostly favourable. It just seemed a damn shame that I didn't see it when it came out, especially in 3D. It was extremely thrilling and heart-pounding though anyway. Highly recommended.",
      "total_reactions": 0,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Fright Night is an incredibly fun and entertaining remake that is arguably on par with the original. With enthusiastic performances and a smart script, Fright Night will probably please both horror fans and fans of the original.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "this' one of the best remake movies in this year.'cause this movie didn't follow the original movie at all,the director had added some new elements in this movie.this' a good movie.",
      "total_reactions": 0,
      "user": "nashville13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "I liked it and I enjoyed how they immediately put the action on as soon as the film started. The acting was solid and it was interesting through out. There were a few parts that made you lose interest though and the run time did push it a little as well. I also disliked the ending, Thought it was disapointing considering how good it was up until that point. Still it was a solid film none the less.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Sure, entertaining enough, but nothing special. I'm not a fan of the original and this isn't any better. David Tennant's performance is the highlight. One to watch and then delete.",
      "total_reactions": 0,
      "user": "delboy71"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "This remake of the original Fright Night was good for 3 reasons. 1. Casting, the casting for this movie was incredible, Colin Ferrel did an outstanding job as Jerry Dandrich, he had that level of creepiness, that everyone loves. 2. Storyline. Tom Holland, the director of the original film, wrote the remake automatically making it as good as the original, that is what every remake should do. and 3. Setting. what better place for a vampire to be than Las Vegas, everyone is awake at night. All in all Fright Night was a great movie.",
      "total_reactions": 0,
      "user": "Super8mm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "Fright Night is a 2011 film directed by Craig Gillespie's remake of the 1985 film. The story is about Charley Brewster (Anton Yelchin) a boy to try to achieve popularity and get noticed by the girl he loves he began to neglect his best friend Ed (Christopher Mintz-Plaase). For a short time close to home Brewster moved Jerry (Colin Farrell) and Ed thinks he's a vampire who chooses his victims in the neighborhood but Charlie does not believe him. But in the end he will change his mind when he begins to investigate after the death of Ed and will face a terrible adventure to protect his mother and the girl he loves. The film has an excellent direction with excellent photography and the horror genre and the comedy genre are able to join well being able to make people laugh (just think of the vampire named Jerry) and also to scare you. Excellent interpretation of Colin Farrell in the role of vampire and hilarious characters of Christopher Mintz-Plaase and David Tennant who plays here an alleged vampire hunter. A lot of love for sure except for Twilight fans because in this film, there are many quotes that make fun of the saga of the same name.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "I am not a fan of remakes, because rarely, if ever, do they do justice to the original film. That being said, I wasn't expecting anything out of the Fright Night remake, except for a cameo by Chris Sarandon. I was however pleasantly surprised, as the young cast was better than expected. For those who don't know the story, it is a classic vampire tale. Charley Brewster (Anton Yelchin) is a normal teenager, whose life revolves around High School and his beautiful girlfriend. Everything is perfect until an old friend tells him that his new neighbor is a vampire. At first Charley doesn't believe him, but the more he watches, the more he realizes that something isn't right. Anton Yelchin opposes Colin Farrell, and while he might not have the name recognition, he easily outshines the veteran actor. Yelchin has a cult following among fans of teen movies, after strong performance in films like Charlie Bartlett and Middle of Nowhere. As with most teen idols, his popularity is not just about his looks, it comes from his smooth relaxed style of acting, that people can relate to. Yelchin's characters are always real and honest, the kind of guy audiences can easily relate to, and that's what makes him as good as he is. Yelchin has help in this film from an all-star cast that includes, Farrell, Toni Collete, Christopher Mintz-Plasse-Mclovin, Dave Franco, and of course the original vampire, Chris Sarandon. The combination of chemistry between new and veteran make for a truly powerful cast, that bring new life to this classic story.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "If this review was dependent upon me being scared during this movie then Fright Night would've received a 1/10 from me. But It's quite alright because I found the movie rather entertaining. Colin Ferrell is surprisingly great as the vampire and seeing McLovin in vampire form was definitely a highlight of the film for me.",
      "total_reactions": 0,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Senior Charlie Brewster (Anton Yelchin) finally has it all-he's running with the popular crowd and dating the hottest girl in high school. In fact, he's so cool he's even dissing his best friend Ed (Christopher Mintz-Plasse). But trouble arrives when an intriguing stranger Jerry (Colin Farrell) moves in next door. He seems like a great guy at first, but there's something not quite right-and everyone, including Charlie's mom (Toni Collette), doesn't notice. After witnessing some very unusual activity, Charlie comes to an unmistakable conclusion: Jerry is a vampire preying on his neighborhood. Unable to convince anyone that he's telling the truth, Charlie has to find a way to get rid of the monster himself in this revamp of the comedy-horror classic.",
      "total_reactions": 0,
      "user": "allmovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Another underrated film imo. Yes it maybe a remake but its still a remake that is well worth watching. Its interesting, the cast is solid as well, and its entertaining to watch. One flaw of the film that ruins it a little for me is Christopher Mintz-Plasse, IMO he was a terrible casting for the film and brings it down a bit. Also it ended in a very unsatisfying way. Besides that, Id tell others to give it a chance but thats about it.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Fright Night is not very good. The acting is average with actors whom, other than Farrell, I've never heard of. I had no idea this was a comedy until I read about it, I only laughed once throughout the whole movie. It also barley has any \"fright\".",
      "total_reactions": 0,
      "user": "AlvaradoKTA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Very enjoyable rehash of the original (which I haven't seen) sees Anton Yelchin submit a decent performance as the high school kid who is alerted to the nefarious antics of his vampiric neighbour (Colin Farrell). This has clever elements, attributing the Nevada locale as being the ideal, non-descript setting for a vampire to reside due to its propensity to attract people who 'work at night and sleep during the day'. David Tennant is exceedingly...funny as a supposed (but ultimately specious) 'vampire expert'  in a role that looks to have been written for Russell Brand. Christopher Mintz-Plasse also appears as a resentful, supernatural-obsessed, ill-fated ex-best friend of Yelchin. Fright Night is a very enjoyable, if not entirely groundbreaking, contemporary foray into the horror genre. 7.3/10.",
      "total_reactions": 0,
      "user": "JacobDunstan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I had extremely low expectations when watching this film but I was pleasantly surprised by the intelligent, funny and scary (but not really) picture stood in front of me. I thought that Tennant was trying too hard to be like Russel Brand but apart from that, the film is very good. I would watch it again without much contemplation at all.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "This has to stand as the best horror remake in a long time. it genuinely made me laugh quite a few times. It's not only clever, but it really is scary in parts. Colin Farrell is a standout, playing his vampire in a way that's different from any portrayal you've probably seen. Also good is David Tennant as the Criss Angel-style vampire hunter, definetely the role that provides the most laughs in the movie.",
      "total_reactions": 0,
      "user": "adouble"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "Stylish, witty and occasionally spooky, Craig Gillespie's remake of the 1985 cult classic actually proves to be quite worthy of note.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "The surprise gem of the year. One of the best films of 2011! As good as the classic vampire film Let The Right One In. A must-see! I liked the cast...",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "I liked as it has great atmosphere and plot. The actors were ok. The ending was obvious but it is still entertaining as a movie. It is perfect for an afternoon with friends",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "With great acting performances, entertaining fight scenes and subtle humour, Fright Night has everything to succeed as a good remake.Even though most of the special effects are pretty bad and there is a cruel lack of blood and practical effects, it's still a good movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "It's really cheesy, but if you can overlook that, you'll find a solid film with a great performance by Colin Farrell. As for the CGI, i must say is decent for a 30+ million budget, just lower your expectations, don't expect to see 200+ million dolars CGI.",
      "total_reactions": 0,
      "user": "Fabricionet232"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Admittedly I was one of the many fans super-excited about the remake of \"Fright Night\". It is one of my all time favorite films to sit back on a chilly day when I am feeling blah and just enjoy based on pure nostalgia. I also remember setting in the theatre at 13 and being scared sh*tless of Jerry Dandrige. I think I held my breath through most of the picture terrified of what would happen next. So yeah I am still just a little disappointed when I watch the remake with Colin Farrell in the role of the seductive older man new in the neighborhood who just wants to be left alone to feed.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 6,
      "text": "First of all, I would like to say that I have not seen the original version of Fright Night, so I have nothing to compare it to and I did not know what to expect. The best part of this film is Colin Farrell's performance,I think. David Tennant was also very entertaining, but he had a small role. The special effects were annoyingly weird and bad. But all in all,  this film is alright.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I usually don't like remakes, but this was freaking awesome! Colin Farrell was epic as Jerry and loved David Tennant as Peter Vincent.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}