{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 7,
  "mc_movie_name": "Fun Size",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "The movie is, by and large, smarter than the gross-out tactics that pass for hilarity in many mainstream adult comedies."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "Movie merits include a good cast, a tidy script and jokes just provocative enough."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 70,
      "summary": "The fundamental Schwartz touch applies: In the guise of a narrowly targeted tween flick, he has delivered a smart and emotionally satisfying slice of wish fulfillment, tracing how a threatened family finds harmony."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 65,
      "summary": "Bear in mind that Fun Size is the only comedy in recent memory to feature a Ruth Bader Ginsburg joke. You won't find any of those in the \"Hangover\" movies' bag of tricks."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "It pairs modern attitude with John Hughesian tropes, and it's odd enough, in spurts, to boast originality."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Compared to most teen comedies these days, Fun Size is almost touchingly tame."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Still, it's hard not to think that there's a darker, funnier movie in there waiting to get out. In the meantime, we'll always have the humping chicken."
    },
    {
      "critic": "Miriam Bale",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "By the end of this romp, Fun Size actually accomplished something charming: sentimentality without normality."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Well written but weakly executed, it's hard to imagine anyone is going to cherish the film, if they even remember it in three months' time."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Transiently entertaining, with intermittent sparks, it'll do until something better comes along."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Imagine \"Little Miss Sunshine's\" dark materials (and superior craftsmanship) diluted with a Hannah Montana-like sunny silliness – which is to say: sometimes funny, often broad-stroked, ever sweet, and landing shy of its potential."
    },
    {
      "critic": "George Bass",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "The cast try hard and are rewarded with some zesty dialogue, but remain shackled to the girl-with-dead-dad-grows-up formula."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Fun Size isn't good enough to ascend to those John Hughesian ranks, and its small holiday window means it won't scarf much box office. But at least first time feature director Josh Schwartz can expect a minor slumber party hit on DVD."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "This Nickelodeon production may be designed for short attention spans, but must the characters have them as well?"
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Of course, questionable propriety would be a moot point if the film were consistently funny, but its hit-to-miss ratio is dire."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Fun is hiding behind a bad movie costume in this humorless and idiotic Halloween teen comedy."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "All over the map in the details it throws at us, and the level of immaturity it aims for."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "Aiming for a trifecta of small kids, their older sisters and parents in the audience, Fun Size fails them all in a movie that is neither a trick nor a treat."
    },
    {
      "critic": "Alison Wilmore",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "A laborious comedy about a Halloween night in Cleveland that feels too grown up in half of its storylines to suit younger audiences, and too juvenile or nonsensical in the rest of its gags to please anyone else."
    },
    {
      "critic": "Jeff  Labrecque",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "This movie has no courage and little brains, and is salvaged, if at all, only by its heart. There remains a huge market for a great Halloween teen comedy, but Fun Size is the disappointing apple that your crazy-haired neighbor gives you instead of candy."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 25,
      "summary": "A 90-minute theatrical release from Nickelodeon Productions that, if anything, should have aired as a half-hour Nickelodeon special."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 20,
      "summary": "Someday, all US cinema may come to look like this: indifferently shot random events happening to semi-recognisable TV faces."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 12,
      "summary": "Molly Ringwald-like, Wren must choose between two guys: the nerdy Roosevelt (Thomas Mann) and the Porsche-driving Aaron (Thomas McDonell), but both are so dull it's hard to care. So feeble is the movie that even the wacky, redheaded best friend (Jane Levy) isn't funny."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "summary": "It's a soul-crusher, and when I say it may be the most dehumanizing experience since \"Hostel: Part II\" the comparison is not an idle one."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2012
      },
      "score": 1,
      "text": "What's so fun about Fun Size, anyway? Whatever happened to the good ol' days at Nickelodeon? Where's Miranda Cosgrove when you need her? I know it's sad that Victoria Justice's hit show cancelled just like \"ICarly.\" But her singing career was almost near as perfect as other artist like Selena Gomez and Demi Lovato. Victoria's feature film debut in \"Fun Size\" is just not what the parents wanted the kids to see. I'm tired of the new Nickelodeon. Now that I don't watch the network anymore and since this is a PG-13 rated movie (the first was The Last Airbender), I'm gonna be sick if Nickelodeon had skipped out of the family-friendly business with classic Nicktoons and stuff. \"Fun Size\" is one of the worst movies and bombs since \"Hey Arnold\" and \"The Last Airbender.\"",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "Fun Size, the new movie of the Victorious star, Victoria Justice, what happen? The movie is a good idea, but the development have much mistakes, you don't know if the movie is for kids or for teenagers, and the thama is very boring in much parts. The performances are good, the best is Victoria Justice. And the screenplay can have some mistakes, but is funny in some parts.",
      "total_reactions": 1,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "All in all, this movie is a waste of time, energy, and money. There is nothing cute or funny about it at all. I enjoy bad movies unfortunately. This is just, well, the acting is wooden. Script is dim-witted. Just because it is a kids movie doesn't mean it has to be bad. Nothing makes me more angrier than a stupid movie What a waste.",
      "total_reactions": 1,
      "user": "JawsLaxerDrama"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Fun Size is one of those films where we put Scary Movie, Project X, Superbad and several familiar characters, put in a blender and the result is more a pearl that shows the other side of Nickelodeon, hidden since the extinction of Invader Zim and Ren & Stimpy. Victoria Justice is perfect, as are the other actors (including Johnny Knoxville). I give note 10 to the perfection of the film, despite some failures.",
      "total_reactions": 1,
      "user": "JacobFreez4Ever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2013
      },
      "score": 8,
      "text": "It's a nice little halloween themed movie, but don't let the fact that it has Victoria Justice and Nickelodeon's name slapped on it, this isn't a movie you want your little ones seeing. The movie is aimed at the older teenage audience, or at least those mature enough to know and deal with the profanity and sex related humor. Admittedly I enjoyed the movie (I'm around the age of the target audience) but sometimes the humor sinks into areas only the most immature of us can enjoy (fart jokes, ugh!). At times it can come across as a toned down version of Project X, but other times it can be much more juvenile. It stands in that awkward area between kids movies and adult movies, that's right the teen movie area. An area that has always been a little awkward for movies to find a footing in. In the end Fun Size does manage to a solid piece of ground to stand on in the teen movie zone, but it can get a little wobbly at times.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "'Fun Size' is a movie that has a good argument, but have not taken advantage of.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "It was pretty funny. But it was'nt great, it was just ok. Victoria Justice was'nt funny at all but her little brother was. Some of it was kind of corny but the funny parts saved the corneyness.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Fun Size is completely implausible, and Victoria Justice is a horrible actress. But the movie is slightly diverting for pre-teens and teens, and has some laughs.",
      "total_reactions": 0,
      "user": "MovieGuys"
    }
  ]
}