{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 60,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "Funny People",
  "mc_negative_rating_frequency": 44,
  "mc_positive_rating_frequency": 129,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Funny People is a intelligent, funny adult film. Now a days the genre of comedy is now sex. We get a number of new movies every year trying to milk the success of Judd Apatow films. Some of them are good and I can name a few. However they need to rely on crude and vulgar actions to get laughs. We get so many of those antics to the point of feeling disgust for the characters, but when the third act comes up we have to cheer for them it's dumb. Apatow's movies are different there fresh in orignatly and the crude and vulgar comedy is kept to a restrictive level. Thus giving us time to know the characters in between the big laughs. The movie starts with George Simmons played by Adam Sandler, he's a successful comedian and actor. He has stared in many films and is a prodigy to all standups. He lives alone and does mostly everything alone. One day he's sitting in a doctors office getting the news that he's been diagnosied with a rare form of cancer. His doctor firmily says it, he needs to try out expermental medicine. We then meet Ira played by Seth Rogen who's a up and coming comic trying to get out of the deli that he works at. One day George performs at a standclub that he has'nt been in three years. He notices Ira's performance and takes him under his wing as a assistant. They form a friendship and where George goes Ira goes. He trys to make ammends with his famliy and with the girl that got away, played by Leslie Mann who is married to someone else. So when George is thinking the worst his doctor tells him your getting better and tells him get a hold of your life again. You must think in a clinched kind of way he changes his personality and treat people better and go for the girl right? wrong, he exploits his condtion and tries to go for the girl. These are characters in a realistic plot. With problems and smart dialouge. Yes theirs crude and vulgar actions but it's done in a way that everyday people talk, with your friends, with your spouse. Judd Apatow did a very mature film proving you can mix vulgar and adaptable characters. This movie is based on everyday people with the only difference is that there Funny People.",
      "total_reactions": 2,
      "user": "thelordoffilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Comedian gets terminal illness, hires joke writer, gives him chance at stand-up, ex girlfriend shows up, her Australian husband shows up, mayhem.",
      "total_reactions": 0,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "This movie felt real to me. It captured a glimpse of humanity's lonely, awkward and sometimes superficial complexity. Some of the poor reviews I think are the result of expectations of this being a comedy. I think it would be more accurately described as a drama with humorous lines.",
      "total_reactions": 0,
      "user": "Cheryl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "It was pretty terrible. The movie hasnt all the funny and while the acting was good, It never was interesting. Also the insanely long run time drags the film on long then what it should have ended it. I didnt like it all.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 1,
      "text": "Wow this movie was terrible, don't let the name fool you it's not funny, it's not even entertaining, a huge let down for fans of Adam Sandler, an absolutely terrible movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Funny People is an interesting and entertaining comedy / drama hybrid with excellent performances by Adam Sandler, Seth Rogan and Eric Banna. The standup in the film is amusing but the movie's real quality lies in it's heart... And it has Jason schwartzman in it. Nuff said!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "I only watched the movie for the first hour and from what I've seen, I guess it's worth a watch.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Funny people has the warmth, the usual raunchy laughs, a semi decent plot, and a winning cast. But all of this gets rather stale after the first hour, and this drama comedy, i hate to say this- pretty much rotts.",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Although I absolutely love Judd Apatow's films, this one ranks third in his directorial efforts (right behind Knocked Up and 40 Year Old Virgin). What is great about the film though is the balance of humor and drama. Adam Sandler does a great job. One of the better things he's ever done.",
      "total_reactions": 0,
      "user": "TheDaveHimself"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "A more dramatic turn from Judd Apatow sees Adam Sandler playing what is essentially an exaggerated version of himself. The performances are great, and it's one of the few films which I can happily sit through despite its huge run time.",
      "total_reactions": 0,
      "user": "alexandergreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "This was the worst \"comedy\" I have ever seen. First of all, Apatow should stay the heck out of drama from now on. Second, Sandler sucks as a dramatic comedy actor (history has shown us this plenty of times before). I expected it to be good but the entire film was simply trash that I had to suffer through 2 hours of because my family sadly paid money to rent it.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "Funny People feels like three movies in one. The movie is painfully long with mediocre acting by the entire cast. I couldn't take any of the drama seriously when you have Adam Sandler acting the same way when he's trying to being funny. The movie simply didn't work.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "A seemingly endless story that never reaches a satisfying ending. Between the dark comedy and serious undertone there was a decent movie that was making a statement, but the length and unnecessary supporting characters just makes you forget that.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I thought this film would be a comedy but in actually fact I think this film should be classed as a drama. Sure it is funny in places but it is a lot more serious than most other Judd Apatow productions. Despite this, I actually enjoyed the film. Eric Bana is a fantastic actor and Seth Rogan along with Adam Sandler for once bring a sense of realism to their roles. I think Rogan would suit more roles like this in the future as well his more obvious drug-addled roles.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "This movie may be called 'Funny People' but it is anything but funny. I have always been a big fan of Adam Sandler and with the cast that this film has I was expecting a lot more from it. I'd go so far as to say I would never watch it again. Life is precious, don't waste it watching this.",
      "total_reactions": 0,
      "user": "gill000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Apatow's Funny People had so much potential, and it really did have moments of greatness. It's just the lag in between those moments that brings it down.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "I was searching for a comedy movie that I thought would make me laugh. Funny People contains a great story, but the standup comedy scenes and the supposedly funny moments aren't really that funny.",
      "total_reactions": 0,
      "user": "Kylenine1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Not correctly advertised. It's a really depressing movie, honestly. Very different from typical apatow fare. But I still enjoyed it, despite feeling like I in fact had cancer at the end of it.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "In a time where a lot of comedies involve lowbrow, unintelligent humor, Funny People is a surprisingly smart and heartfelt comedy that features funny performances by Seth Rogen and Adam Sandler.",
      "total_reactions": 0,
      "user": "bladeagent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Many people will complaint about the length, but this is Apatow's best film. Apatow has a nice way to mix comedy and drama. Seth Rogen puts on a very nice performance, Adam Sandler puts on a way better performance that he puts on in his other comedic flops, Sandler is very different and wise in this role  we've seen that side of him in movies such as Punch Drunk-Love and the very underrated Reign Over Me.",
      "total_reactions": 0,
      "user": "heeldavid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Funny People: 8 out of 10: What is amazing about Funny people is considering its set-up and storyline it manages to deftly dodge a veritable minefield of bathos laid out before it. The story is about comedian, who is super rich after a string of really bad comedies (Adam Sandler playing himself), finds he has version of leukemia and well is going to die soon. Therefore, he reflects back on his life makes amends and chases the girl that got away with the help of new assistant, a thin Seth Rogen.",
      "total_reactions": 0,
      "user": "juliankennedy23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This in my opinion Adam Sandler best movie before Punch Drunk Love. This movie is underrated because I'll say,\" Does anyone know what the movie Funny People is\". Then everyone who look at me weird but no spoilers in this review but this movie is a 2 and a half hours of a good movie maybe my 7th Favorite movie of all time but the everyone is giving all of their best her even Adam Sandler is giving all his best here. Seth Rogen is funny in this such as Jonah Hill, Leslie Mann, Eric Bana and many more. But this is Judd Apatow best film he I think giving all his best too. If I had to give a rating to this film its a easy A- .",
      "total_reactions": 0,
      "user": "JamisInsomia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "This isn't about Adam Sandler at this time around, it's about Judd Apatow and I can agree (even though I don't like the general idea of the film) the 40-Year-Old Virgin is better. These 'Funny People' you see here isn't funny enough to generate a whole laugh track for 146 minutes of movie time.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "The truth, which is a good movie with a great argument to begin. It is one of only Adam Sandler's movie that is worth a sorrow seeing. The only thing that I did not like was the scene of it her fights.",
      "total_reactions": 0,
      "user": "2016"
    }
  ]
}