{
  "mc_avg_user_score": 2.8,
  "mc_metascore": 23,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Furry Vengeance",
  "mc_negative_rating_frequency": 32,
  "mc_positive_rating_frequency": 7,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "If you see a trailer for this and then decide to see it, what did you expect, exactly?  It's low brow, but Fraser does well with physical comedy and some of the bits are laugh out loud funny, the participants are having so much fun it's contagious and, come on, the real message here is that loving families should be respected and valued - what's wrong with that?",
      "total_reactions": 2,
      "user": "s1rude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2013
      },
      "score": 1,
      "text": "Sight gags and cheesy dialogue don't save this movie. In fact, this is one of the stupidest movies I've ever seen. Brendan Frasier cannot be taken seriously as an actor anymore because of his career choices to be in movies like these, which do nothing but make the little kids laugh and the older ones and adults cringe.",
      "total_reactions": 1,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "DO NOT listen to critics on this one. When i was going to watch this movie i thought that it would be horrible. But after watching it i could not stop laughing. In fact i watched the movie again the next night.",
      "total_reactions": 3,
      "user": "monkeyshiner444"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "One thing I really hate on Metacritic, is when somebody says \"I haven't seen the Movie but it looks really bad\" so they give it a 3. Because in my opinion that undermines the point of user reviews, to get an alternative look at films, as opposed to professional critics. This film has the dubious honor of the exception I take to the rule, because (and I've seen the Movie) when you look at the Trailer, you've pretty much seen the full thing. Brendan Frasier acting with all the charisma of the animals he's fighting, fart jokes and a quite frankly depressing enviromental message which seems slapped on in order to try and appeal to those wanting to educate their kids, unfortunatly it falls completely flat because there's nothing intelligent in this film, at all. It's insulting that they think your child would be idiotic enough to find this entertaining. It has the stench of corporate heartlessness about it. I think Brendan Frasier's a good actor but i wish he'd star in good Movies. At the end of the day if your child (or you) does not recall in horror at the extremely uncomedic way Brendan Frasier screams (he's stuck in a portaloo, hilarious!) they will cry at the abysmal effects which were literally puppets Brendan Frasier controlled! I dislike CGI but they could at least try.",
      "total_reactions": 1,
      "user": "NF123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "I didn't even see this movie but by looking at the cover..watching one trailer..and finding about the worst actor of all time is in it(Brendon Fraiser) i can tell that i never wanted to see it.",
      "total_reactions": 1,
      "user": "Beats"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Nama Brendan Fraser sepertinya akan terus diingat sebagai nama seorang aktor yang terjebak untuk selalu membintangi film-film yang ditujukan untuk pangsa pasar keluarga. Bukan sebuah masalah besar jika film-film yang ia bintangi merupakan film-film keluarga dengan kualitas yang memorable dan dapat dibanggakan. Namun dengan judul-judul seperti Looney Tunes: Back In Actions, Inkheart dan Extraordinary Measures, yang tidak hanya gagal meraih perhatian para kritikus film dunia namun juga gagal meraih simpati para penonton, Fraser sepertinya harus semakin sering mempertimbangkan film yang akan ia bintangi. Dan Furry Vengeance bukanlah sebuah film yang akan merubah kenyataan itu.",
      "total_reactions": 1,
      "user": "hyperion_lynx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2010
      },
      "score": 0,
      "text": "Just terrible. And I would really like to submit this review having said just that, and only that.  Just terrible. However, metacritic has a 150 character minimum so I will expand by saying it's almost worth seeing because it is so bad. Wow, how does something like this even get made? Seriously.",
      "total_reactions": 1,
      "user": "Cheryl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "Absolutely pathetic. Save the environment rubbish with pathetic acting and not a single good joke. Brendan Frasier could be in better movies if he wanted to. (look at \"The Mummy\", or \"Crash\") but he just keeps taking these crap jobs and gets laughed at by the world in all the wrong ways. shame on you anybody who had anything to do with this.",
      "total_reactions": 2,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "Worst family comedy movie ever made!!! Brendan Frasier should know better than doing a crappy family comedy that isn't going to do well in. Everyone sucked in it and only little kids are going to laugh at this horrible comedy.",
      "total_reactions": 1,
      "user": "jAbMaN"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "I think we all knew what we were getting with this one.  It's a completely physical comedy that never strays from offering another cliche.  Vengeance also wastes Fraser and Jeong, as well as the rest of its cast, with a nonexistent plot powered by a crazed raccoon and ends on a decidedly bad Disney-esque note.",
      "total_reactions": 1,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "It'a a little confusing if Brendan Fraser is the leading role of a horrible but average family movie. Animal Planet on steroids.  But Furry Vengeance has a lot of great moments, but the acting, the music, and the environment stuff may look like a Captain Planet PSA, but it's not. Not a good movie, but I'll rent it.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Algo mas que despreciar furry vengeance tiene además de un solo escenario y mal tema, unos asquerosos efectos y mucha mediocridad en todo, parece que lo hubiera hecho una persona",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Although I appreciate and care for animals, this movie sucks. As the animas occurs attacking were human , animals have intentions but **** like this can not be assessed.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Furry Vengeance may show a fool premise and a thin plot, but it has funny story-telling and enjoyable stunts, full of good intentions and totally funny results.",
      "total_reactions": 0,
      "user": "Futuredirector"
    }
  ]
}