{
  "mc_avg_user_score": 4.2,
  "mc_metascore": 41,
  "mc_mixed_rating_frequency": 20,
  "mc_movie_name": "G-Force",
  "mc_negative_rating_frequency": 36,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "Bad movie. Not funny at all. Ok, for children it might be more or less funny, but when i watched the movie I leaved the room asking myself : \"what the hell did i just watch?\". Bad, really BAD.",
      "total_reactions": 1,
      "user": "Nero97"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 1,
      "text": "Guinea Pigs as spies? are you high, Disney?",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "I hope you like fart jokes because G-Force has a lot of them. G-Force fails in almost every respect, and will only entertain children. Small children. G-Force is about three guinea pigs who are genetically engineered to talk and be spies. But these rodents are out of the job when they're thrown into a pet shop when the government disapproves of the G-Force team. They meet another guinea pig named Hurley, and together, they escape the pet shop and attempt to save the world from killer kitchen appliances. G-Force offers, quite literally, nothing that's original or anything that I haven't seen before on film. G-Force is always trying to be funny. The gags never stop, but I never laughed a single time. I think I smiled twice, and the second time was a smile of relief when the movie was over! The action scenes were predictably dull. As the movie went on, it became more and more obvious that this film is strictly for toddlers. There are no \"wink wink for adults\" gags. The musical score rips of countless movies, many lines are laughably cheesy. Lots of contradictions in character personalities. When G-Force doesn't feel rushed, it feels slow and dull. We hear \"I've got a feelin'\" three times throughout the tedious duration of the film. Pacing is an issue. The acting is mostly wooden. Need I go on? On the plus side, there are some good visuals (the CGI work is actually pretty good), and the voice work is decent, if unspectacular. Many of the good visuals are present during the \"fly\" scenes where one of the recruits, a fly named mooch, is shown wizzing through desserts, Venus fly traps, etc. If you have kids, G-Force will probably entertain them. But there are lots of other better films out there that will do the same thing. I can't stress this enough: Don't watch G-Force.",
      "total_reactions": 0,
      "user": "LandF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "Bland with little entertaining value. My guinea pigs are way cooler than these ones.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "G-Force isn't a G.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "\"G - Force\" was acceptable very regularly, although the idea of ​​agents excel hamsters, and not sobresaleel CGI script that sadly did not like the public.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "\"The world needs bigger heroes\" --- Movie's tagline.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}