{
  "mc_avg_user_score": 4.7,
  "mc_metascore": 27,
  "mc_mixed_rating_frequency": 44,
  "mc_movie_name": "Gamer",
  "mc_negative_rating_frequency": 104,
  "mc_positive_rating_frequency": 89,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "Probably one of the worst movies I have ever seen in my entire life.  I wish everyday that I could get those two hours of my life back to do something more productive then watching this awful, awful movie.  It made no sense, the premise was dull, the acting terrible, and the action scenes were awful.  This is by far the worst Gerard Butler film I have seen and definitely in the top 10 (getting into the top 5) of the worst movies I have ever seen.",
      "total_reactions": 2,
      "user": "theonerandom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2010
      },
      "score": 2,
      "text": "I am sure this would a great film if you were Stevie Wonder. Actually that isn't true because you would still need to listen to the actors and the really bad script. It is like the writers watched The Running Man and decided it would be cool to mix it with Facebook and a FPS. I hope the writers now work in McDonalds or milk goats for a living. Go watch American Ninja instead",
      "total_reactions": 1,
      "user": "beastlove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 0,
      "text": "One of the worst movies of all time, don't watch this at all, the plot and characters are awful, the action scenes suck, and it just an awful movie all around, there is nothing good about it at all, avoid at all costs.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Great concept but bad realization. It's damn boring. I can't mention a good part of it. Nobody is recommended to watch this. Avoid it, it's a waste of time.",
      "total_reactions": 1,
      "user": "island"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 2,
      "text": "\"The Gamer\" is a game you will NEVER want to play, especially with Gerald Butler starring in it.",
      "total_reactions": 9,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 2,
      "user": "DJohnson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 2,
      "user": "mickeyboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Have you every wondered what it would be like if 1987's The Running Man director Paul Michael Glaser took acid laced with LSD and then directed the movie? Well friends you don't have to wait any longer because Gamer is here! Gamer is another fast paced, gory (and sometimes pointless) action film written and directed by Mark Neveldine and Brain Taylor. You may recognize these guys from creating the insane Crank movies staring Jason Statham. Well it appears they only have one way of directing at the moment because Gamer is no different. With heightened colors, sounds, imagery, and a hand held camera, Gamer provides plenty of \"what the hell?\" moments for the audience.",
      "total_reactions": 1,
      "user": "PYRiAH"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 0,
      "text": "Absolutely terrible.",
      "total_reactions": 2,
      "user": "brasd"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "I got two words for Gerald Butler: GAME OVER. As good as \"300\" goes, the next time he'll be facing is a computer virus and he wished if he's the one getting trapped in a video game for a very long time. It's not a video game adapted movie, but a terrible movie that it is a video game.",
      "total_reactions": 1,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "It's not even close...WORST MOVIE EVER MADE. Not even sure you can call it a movie. I can't, for the life of me figure out what the hell Gerard Butler was thinking doing this. Maybe he was blackmailed? Lost a bet? Maybe he had no idea that drugged out rave freaks would turn it into what it became. Absolute 100% crap.",
      "total_reactions": 2,
      "user": "corc79"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 1,
      "user": "violentmilk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "epic",
      "total_reactions": 1,
      "user": "scottissoright"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2012
      },
      "score": 1,
      "text": "Gamer is the biggest insult to gamers since the Super Mario Bros movie. It assumes we're all ultra-violence loving COD fanatics who get our jollies watching other people get eviscerated... And even if a few of us are like that, we still demand much, much better quality entertainment than this stinking pile of B-movie toss. If you're interested in this because of the title, avoid completely and watch Scott Pilgrim vs. the World instead.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I liked this movie. A lot. I was positively surprised at how good it was when I was expecting to see mindless shooting and destruction; there was actually a very good plot in this one.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Yet another interesting and promising concept got wasted on a lazy mess of a movie that really doesn't have anything good going for it. The violence is pretty strong, but I could care less about action and brutality when I don't care about the story or characters at all.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Estoy muy seguro de que ni siquiera a tratar de descifrar este comentario porque está en español, pero sin embargo, en realidad era una película muy buena, y estoy tratando de promediar las críticas de aquí, porque si nos fijamos en la base de datos de la película del Internet , tiene una calificación de un sólido cinco punto ocho, por supuesto, no puedo usar los números porque uno de ustedes en realidad podría sospechar que esto no es una crítica legítima, pero bueno, no lo es, me gusta mucho el cine, y me gusta manipular las cosas, así que sí, ponerlos juntos y tienes esta mierda aquí, una revisión españolas, bueno, no exactamente una crítica, pero sí, me gusta el cine, me gustan los ponis y lanzadores de cohetes y el pastel de manzana, consulte lo que es un maravilloso ser humano que soy ... bueno, sí, adiós, y si usted es hispano, y entiendes lo que estoy diciendo, entonces ir a ver la película, usted no será decepcionado.",
      "total_reactions": 0,
      "user": "billylenz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "this movie have a huge lack of imagination and the result was a horrible movie with an awful picture and acting wasn't in the place and Gerard Butler to go from 300 to this movie is just plain wrong. after all it seems like a gamer wanted to make a successful movie but his imagination betrayed him.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Epic! Very nice movie i like this!........................................................................................................................................................",
      "total_reactions": 0,
      "user": "Kvotheee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "\"Gamer\" was a very exciting movie , but too short to see, although there are fewer pornography, the action scenes were very brutal , but very low in the picture definition.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "Gamers, look out for Gamer. You gamers don't need a movie about anything and at this point of the line, when the game over signal comes out, you're finally good to go!",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Deutsche Review - Kritik",
      "total_reactions": 0,
      "user": "KayVen17"
    }
  ]
}