{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "Gentlemen Broncos",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 26,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "First time I watched this movie two minuets in and I was underwhelmed  but it quickly grew on me and it improves each time I watch it . Crammed with dysfunctional characters  and some outrageously gross moments ( the defecating python wins for sure ) but it's ripe with hilarious one liners and our house often rings with quotes from the movie. I love it and don't understand why it was so poorly received",
      "total_reactions": 1,
      "user": "Laikafan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "The only scene worth watching is the hidden finale, after the credits have rolled, with Sam Rockwell as Bronco. Watch it on YouTube or something. But for God's sake don't bother with the rest of the movie. It really is as horrible as it's rating shows.",
      "total_reactions": 4,
      "user": "t-bombz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Imitation is the sincerest form a flattery.  It is apparent that the Hess siblings desiderated to fancy their own works with their newest film Gentlemen Broncos. To qualify, Gentlemen Broncos utilizes the same exact formula of a societal misfit used in both Nacho Libre and Napoleon Dynamite. While those two comedic movies were both equally unique and humorous, Broncos feels stale, farcical, and ultimately, a waste of my time.",
      "total_reactions": 4,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "If this film was an animal it would be a majestic eagle. It tickled me in all the right places and bought me tampons from stores I simply would not expect. 10/10",
      "total_reactions": 2,
      "user": "BorneoFunction"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I can't believe how harshly this movie was panned by critics when it came out. This movie is clever, original, and funny. It gets better on subsequent viewings when you start to really notice little things like a candy dish full of bullets or the attire of sci fi fans waiting in line for a book signing. This is the perfect movie to watch when you want to watch a movie and don't know what you are in the mood for.",
      "total_reactions": 3,
      "user": "smullins85"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Sucks that the studio crapped its pants at the limited release reviews.  This movie is funny, weird, wonderful.  If it had gotten a wide release, it probably would have made its money back.  Instead it soured Jared Hess' name (unfairly).  RyanGee's comments:  Jared and Jerusha Hess are married.  Not siblings.",
      "total_reactions": 1,
      "user": "JamesGatz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "I enjoyed both Napoleon Dynamite and Nacho Libre, but Gentlemen Broncos feels more like an inept attempt to capture Hess' style than an effort from Hess himself. if you remove what worked from Napoleon Dynamite (the endearing performances and odd resemblance to reality amidst the bizarre) and pepper in more than a dash of inane bathroom humor just to guarantee a sunk ship, then you get Gentlemen Broncos - a movie trying so hard to be weird and off-beat that nothing feels genuine, and everything comes off contrived. The movie practically shouts its absurdities at its audience, pleading for them to become catchphrases and fads. But what won hearts with Napoleon Dynamite was its spontaneity. In contrast, Gentleman Broncos is cold calculated absurdity. And in this reviewer's opinion, it is flat-out awful. I haven't found myself less entertained in years, and have rarely found myself more insulted as a viewer by a movie smugly assuming own charm. Avoid this.",
      "total_reactions": 2,
      "user": "TheSagePenguin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "One of the only movies I'm able to watch multiple times and still laugh at the ridiculousness of everything. Of course, the humor is low brow and sometimes disgusting, but the movie does follow an adolescent writer after all. It's hard to recommend this film to many people, but if you used to make movies using your parent's camcorder, then I would suggest you watch this.",
      "total_reactions": 0,
      "user": "IIISPQRIII"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "Grentlemen Broncos tiene un buen contenido poco aprovechado con personajes ridículos y poco entendibles no logra la idea principal después de un tiempo y el autor de la película actúa como un idiota perdido,sin saber que lo estan estafando.",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 0,
      "text": "How bad can a movie be? How on earth anyone can pay for a script like this and use 10 million dollars in production? This movie is worse than \"The Room\".  Do avoid \"Gentlemen Broncos\" at all cost, it sucks life out of anybody.",
      "total_reactions": 0,
      "user": "djmoo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2016
      },
      "score": 10,
      "text": "This film gets better with each watching. In the same way as Napoleon Dynamite, I wasn't sure what I was watching the first time I saw it, and upon repeat viewings I laughed harder and harder at all of the gloriously stupid jokes and excellent characters.",
      "total_reactions": 0,
      "user": "spiderprovider"
    }
  ]
}