{
  "avg_user_score": 4.5,
  "metascore": 25,
  "mixed_rating_frequency": 69,
  "movie_name": "Gods of Egypt",
  "negative_rating_frequency": 133,
  "positive_rating_frequency": 100,
  "pro_critic_reviews": [
    {
      "critic": "Rebecca Hawkes",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2016
      },
      "score": 60,
      "summary": "It’s utterly ridiculous – and impossible to resist."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 50,
      "summary": "Gods of Egypt is often sloppy and fails in many ways but the cheesy momentum is hard to resist."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 50,
      "summary": "It’s all quest, flash and high action."
    },
    {
      "critic": "Nick Schager",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 50,
      "summary": "It’s a spectacular mess that’s shameless in its desire to entertain through sheer, misbegotten excess."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 50,
      "summary": "A treasure trove of gilded fantasy bric-a-brac and clashing accents, Proyas’ sword-and-sandals space opera is a head above the likes of Wrath Of The Titans, but it rapidly devolves into a tedious and repetitive succession of monster chases, booby traps, and temples that start to crumble at the last minute."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 50,
      "summary": "The alternately cornball and self-aware dialogue and the clearly not state-of-the-art CGI would seeming charmingly retro (like something from a TV miniseries two decades ago) if the movie didn't trot out one epic action film cliche after another."
    },
    {
      "critic": "Michael Snydel",
      "publication": "The Film Stage",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 42,
      "summary": "While the film becomes a constant test to outdo itself, the raw ambition isn’t nearly enough to make up for the content of the actual film: an ungainly, ugly, nearly interminable monstrosity."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 40,
      "summary": "It’s both thin and overstuffed, filled with intricate, at times dazzling set-pieces peopled by characters we don’t care about, and an irreverent sense of fun that nevertheless leaves us cold. It tries so hard… and ultimately achieves so little."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 40,
      "summary": "If Gods of Egypt were any worse, it might be a masterpiece."
    },
    {
      "critic": "Sarah Ward",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 40,
      "summary": "As audience-friendly as they may be, the cast is left wading through the middle ground between the unengaging narrative and over-emphasised aesthetics."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 38,
      "summary": "There’s a long year ahead of us, but Gods of Egypt is going to stand out as one of the sillier, more puzzling big budget, special-effects driven period pieces to come out."
    },
    {
      "critic": "Clint Worthington",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 33,
      "summary": "Gods of Egypt is a dull, meandering, plastic mess of pre-2002 CGI and performances as flat as the green screens behind them."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 30,
      "summary": "This is by any measure a dreadful movie, a chintzy, CG-encrusted eyesore that oozes stupidity and self-indulgence from every pore. Yet damned if Proyas doesn’t put it all out there with a lunatic conviction you can’t help but admire."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 25,
      "summary": "Like the lobby of a Donald Trump building, it looks ever so expensive and amazingly cheap at the same time."
    },
    {
      "critic": "Soren Andersen",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 25,
      "summary": "Imagine the worst costume epic imaginable. Imagine no more. It exists."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 25,
      "summary": "Its virtues as throwback don't elide the foolhardly decision to imprint an ancient mythology on a contemporary superhero framework."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 25,
      "summary": "Gods of Egypt might have merited a so-bad-it’s-good schadenfreude fanbase had it maintained the unintentional laughs of its first 10 minutes. Instead, it skids into dullness, thus negating the camp classic that it so often verges on becoming."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 25,
      "summary": "A shoddy special-effects howler that makes a hash out of both Egyptian mythology and human logic."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 25,
      "summary": "Call it \"Clash of the Whitans,\" and call it a folly that doesn't have the energy or delirium to qualify as entertaining crap. It's just crap."
    },
    {
      "critic": "Anna King",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 20,
      "summary": "As the film totters to its predictable finale, the closing moments set up a sequel, a prospect far more terrifying than anything we've just seen."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 20,
      "summary": "This overstuffed, witless and bloated stillborn $140 million epic is unlikely to spawn the studio's intended franchise — unless, as is so often the case, international audiences come to the box-office rescue."
    },
    {
      "critic": "Stephen Whitty ",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 20,
      "summary": "Director Alex Proyas’ movie feels like a bad video game."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "summary": "Avoid it like the plagues."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "summary": "Some movies are so effing awful they're hilarious. Gods of Egypt falls short of that lofty goal. Not because it isn’t effing awful — it so is — but because it pretends to be in on the joke."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "summary": "Gods of Egypt is an epic — an epic disaster."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 13,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Right now let's agree on some basic beliefs. Egypt is in Africa. That does not mean that everyone one in Africa has dark skin. Is that really how far people have fallen. Right away, we stereotype all African's as black. How absurdly incorrect. The movie was well balanced, it's the circumstances that are elsewhere that are effecting this movie.",
      "total_reactions": 30,
      "user": "Dwalla97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "I am astounded at the bad reviews. The movie was very entertaining and well done, the images stunning, better than many sci-fi movies. Perhaps the reviewers are Christian or Muslim bigots trying to suppress this movie (all religions are fantasy bigotry meant to control the masses). I was glued to the screen for the entire time. I even cried over parts that touched my heart. I will see it again and again since it is now on my list of favorites.",
      "total_reactions": 8,
      "user": "jimmywalter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "I seriously don't understand what's all the hate for this movie. Its a well-crafted, quality, entertaining piece of art. Other than the typical Egyptian myth, magic and romance, it has interesting new ideas that were well-flashed out. I won't go into details for fear of giving away the plot lines, but safe to say that its got a touching romance story, likable & lovely/macho characters, impressive CGI effects and good pacing with enough action to satisfy. I love it! Better than many other Egyptian movies.",
      "total_reactions": 6,
      "user": "R6ex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "I watched this after seeing the trailer and reviews first so I expected a really dull experience. Instead of that I got a decent amount of fun, the movie is far from terrible how many describe it. Yes, some bad acting here and there but not that bad. Good story, action, cast, effects also not as bad as they say etc. I gave it a 10 because of the unjustly low average score, otherwise I'd give it a 7.",
      "total_reactions": 2,
      "user": "GatsuBerserker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Look, I can't say this was a thought-through, well directed gem (because a couple of their facts are wonky),but it was genuinely enjoyable. I gotta give it credit for its stunning graphics, because the movie looks amazing. All in all, I thought it was really entertaining, and it's beautiful the whole way through. Isn't that what movies are about?",
      "total_reactions": 2,
      "user": "djalpha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "Pretty good adventurous mythical movie about ancient Egypt, with some cool effects, good and bad heroes and characters and the whole Egyptian mythology displayed on screen (maybe slightly altered, but ok). It was fun to watch and I think my 2 hours were well spent. Why the negativity, people ? What did you expect, a social drama ? Read the title before going to the cinema...",
      "total_reactions": 1,
      "user": "AthanasiosT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "A fight among the gods, for the Egyptian empire.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "helps you commit suicide..............................................................................................................................",
      "total_reactions": 1,
      "user": "Longshots"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "Wow, so much hate for this movie? Did I missing something? Did the director shoot a panda in real life of something? Honestly, the movie was fun to watch. Over the top? Crazy? Elaborate? Sure. But did any of you go into the movie expecting otherwise? I loved the sets and the animations were fun. The back and forth was enjoyable too. For those of you expecting a documentary about Egypt, or a Shawshank redemption heart puller, can I ask what made you expect either?",
      "total_reactions": 1,
      "user": "Costs1129"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "This is a good movie.  The acting was good,",
      "total_reactions": 1,
      "user": "Brainbuster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Just watched it on Blu-ray - had to wait until now since it was repeatedly delayed. Was supposed to be shown in the cinemas here, but at the last moment they changed their minds, pulling it. Too bad, I would have loved to watch it in 3D.",
      "total_reactions": 1,
      "user": "MovieFan2000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "I don't usually write reviews but this one definitely deserve it, I don't care who was playing it, how much budget it was thrown into, as long as the movie is great, I'm satisfied. For fantasy movie lovers, ever since LOTR and Avatar nothing ever came close. The special effects might make u roll your eyes a bit but it definitely doesn't deserve the hate. Go watch for yourself and decide.",
      "total_reactions": 9,
      "user": "hunkybaby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "I  honestly don't know what people are complaining about. I absolutely enjoyed this movie. I just finished watching it and I  could watch it again right now. I thought it was very well done. I love egyptian mythology movies and there is such a small amount of them  done in this genre that I found this very welcoming. Boo to all the haters! Go and watch your boring reality crap if you can't take this at the entertainment value presented to you. You're probably the same kind of haters that bag out Stargate!",
      "total_reactions": 4,
      "user": "LexxyT"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "I had to see this film because it was directed by Alex Proyas, one of my favorite directors.  Although the movie is certainly not a classic, it isn't as bad as the reviews indicate.  I was never bored and I thought the special effects fit the tone of the film.  All the actors seemed to be into the movie, especially Gerard Butler and Brenton Thwaites.  I also enjoyed Geoffrey Rush as \"Ra\" the sun God.  I felt that the movie was trying to capture the spirit of some of the old classics like \"Clash of the Titans\", and for me it succeeded on that level.",
      "total_reactions": 11,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "I found the movie very entertaining and don't really understand why it gets so many bad reviews. It's a fun mix of mythology, action and fantasy. Some great visuals and epic scenes, one of my favourites beeing Ra's fight upon the sun barque against the god of darkness and chaos Apophis! I could imagine that the CGI could maybe look a bit unrealistic or cheesy on a normal screen, but seeing it in 3D on the big screen it actually looked rather convincing and cool. And it's not easy to display gods and their epic fights in a way that does them justice without getting too over the top. Gerard Butler is allways fun to watch, and the others are doing ok. Some lines are cheesy, but overall the characters are likeable. Script and story are ok too. I liked the way they portraied the gods. Wielding terrible power, but not almighty, and rather human like in character. More entertaining and closer to the mythological source material than other movies like Clash of the Titans, or Thor. And yes they cast white actors (among others) to play egyptian gods which is not ideal, but understandable. If europeans can deal with a black Heimdal in Thor (you know, the god that is literally called \"the whitest of the Aesir\" and \"the white As\" in the source mythology), egyptians should be able to handle a white Horus. Hey at least Toth was black and Anubis was a Jackal. What more do you want? ;)",
      "total_reactions": 6,
      "user": "Tuivel"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "When I first watched this, i kept on thinking about all the negative critiques it got. After i had seen it, none of them seemed to matter. This movie will never be Oscar worthy, or a great literary masterpiece but it is fun and entertaining. Watching movies isn't always about deep thinking, or, epiphanies, sometimes it is just about having fun, and the actors above all, give us that.",
      "total_reactions": 6,
      "user": "blueadept7"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "I watched it with no expectations due to the fact that I always make an average between critics reviews and user reviews. This movie was super fun, good action , interesting story, yeah there are some cheesy parts what I asume you expect it as the movie is a fiction, action -adventure title. I say give it a chance , I liked it .",
      "total_reactions": 3,
      "user": "martinlaso"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "I made the mistake of not going to see this in the theater due to the horrible reviews.  Huge mistake on my part.  My son & I absolutely loved this movie when we watched it tonight.  Extremely entertaining and well crafted.  We loved the overall storyline and smirked at the humorous areas.  The special effects were well done though a little heavy at times.  Loved the actors. Overall nicely done.  Going to watch it again tomorrow.",
      "total_reactions": 3,
      "user": "Inarie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "This is a solid entertaining movie that is getting way too much hate for asinine reasons. The effects are very good most of the time, while unfortunately falling short during some scenes. The story is fine for an epic popcorn style movie, yet again, a few scenes show through where the acting falls short. If you look past these shortcomings and come in with a positive attitude and don't expect anything intellectually groundbreaking - this movie is totally fine. It's probably the best Egyptian themed movie you're going to see for a new few years. Ignore the critics and just watch it for yourself.",
      "total_reactions": 3,
      "user": "Ichi_Vanilla"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I don't see why there's so much hate for this movie. It was clearly meant to be little more than a green-screen action spectacle, but this one leans heavily on its mythological elements, which some will enjoy more than others. The action ranges from so-so (obviously green-screen pyramid fight scene) to cool (magical babes riding giant flame-throwing cobras) to incredible (anything with Ra and the hell monster).",
      "total_reactions": 11,
      "user": "samichsupernova"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "It is not the best move ever made but it is good and entertaining with a decent story and a mostly happy ending. The main complaint is the amount of CGI used, but it was good and necessary to tell a story that is larger than life.",
      "total_reactions": 11,
      "user": "QACritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I never write reviews on metacritic. However I felt I had to balance out  all the hate this movie is receiving. The movie is pretty good, it is something different and visually stunning imo.",
      "total_reactions": 11,
      "user": "MadMoose"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Don't go into this movie expecting an accurate, scientific study of Egypt and Egyptian lore.  This is just meant to be a fun, action-packed visual thrill ride against the backdrop of a mythical Egypt.  The visual effects were imaginative and spectacular.  The action scenes are paced well.",
      "total_reactions": 8,
      "user": "pgreens"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "This movie is terrible, it really is!  This movie, however, makes a really good guilty pleasure movie, it's mindless entertaining and laughable in a really horrible way!!!",
      "total_reactions": 8,
      "user": "Dyliebar"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "I don't know why all these reviews are so bad when me and my mother saw it in 3d and we both thought it was good.  I would say it's about as good as 300 part 2.  I would give it a 10 but I'm an honest reviewer and there is always something that can be improved upon so the only movie I would give a 10 to would be a movie that absolutely blows me away and does everything perfectly.  People who give this a score lower than a 6 can absolutely be disregarded as bias and comparing it to a movie that they think it should be.  Graphics are amazing in 3d, the story is pretty good and I couldn't find anything wrong with the movie as a whole.  I watched a video review of this movie before I went to see it and it was giving it a bad rating, then I came to this website to see what the review was and also got a bad rating so I had to go see it myself and now I am baffled by these ratings because it is actually not near as bad as everyone is saying.",
      "total_reactions": 25,
      "user": "YoMammy"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "This movie suuuuuucks. How can they spend this much money for this much suck?",
      "total_reactions": 22,
      "user": "JLJ"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "I think this movie does not deserve such backlash from critics. Yes!!! there is whitewashing but that does not necessarily mean the movie is boring and offensive. Its absolute FUN!!. Alex Proyas really did a lot of work on this.",
      "total_reactions": 8,
      "user": "AryamanS"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "This movie was pretty fun to watch. No the CGI wasn't perfect, and no the mythology wasn't followed strictly, but who said it was supposed to? This is another fun action movie with some touching bits thrown in every now and then. If you like action movies, I would say go see it. It isn't as action heavy as London has Fallen, but it is still fun nonetheless. I do feel like it got a bit too long in the tooth by the end of the running time, it felt like it could have ended maybe 15 or 25 minutes earlier.",
      "total_reactions": 6,
      "user": "Macrov"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "Big, pompous, and flashy. It's an overblown, fantasy CGI-fest. Admittedly though it's better than the rest of it's ilk. It's still got it's cheesiness, but what saves the movie from being terrible is that it manages to keep a mostly straight-face about itself. It never dives into any camp or self-aware humor. That ultimately saves it's stupidity from being, well, just too stupid.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "CGI CGI CGI... That about sums up what I actually like about this movie. From watching the trailers, this movie became on my must-see list just because of the impressive and glittery CGI. The only damper to the amazing CGI was the size difference b/w the gods and mortals. That looked weird and amateur. As for the movie itself, I couldn't and still can't understand gods dying. Why are mortals called 'mortals' if even gods themselves can easily die en masse? All-in-ll, this movie is only getting a 6 and not a 2 or 3 because of the CGI. If you enjoy CGI, you must watch this. Hail CGI!",
      "total_reactions": 2,
      "user": "chidime"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "Egypt, the pyramids, the Sphinx, who hasn't studied them in school?  I always knew they worshipped many Gods, but how did that all come about?  This movie provided the back story on how the Gods related to each other, fought each other, etc.  I was never that interested to research this, but the movie made for an interesting story.  I didn't know the Gods were bigger than humans; had to do \"Lord of the Rings\" film tricks to make that happen.  Okay, the rest of the film was a lot of computerizing: buildings, armies, etc, interesting to see at first, but loses its charm over 2 hours.",
      "total_reactions": 2,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Borderline cornball classic. Lots and lots of delicious eye candy. Don't dismiss this movie due to poor critic response. There is an outer space scene. A dozen crazy monster like characters. Multiple super silly love stories. Action galore. Glee inducing dumb dialogue. If they could have just committed to being a screwball movie this would have been a classic. You might want to see this movie. You will almost surely be entertained.",
      "total_reactions": 21,
      "user": "Proteus"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "I only got through the first 50 minutes of agony of this movie. Before I wrote this I tried hard to think of any redeemable quality about this movie and couldn't think of a single thing. The writing sucks, the acting sucks, and the cgi sucks. This is another example of cgi just destroying a movie. YOu have to have a balance of real sets with cgi. I'm not kidding when I say I don't think there was a single real set made for this movie. Just stay away or reccommend this movie to someone you hate.",
      "total_reactions": 9,
      "user": "papadrew7"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "This movie is getting slaughtered only to the overly pedantic.",
      "total_reactions": 21,
      "user": "Sirstiv"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "Awful, just awful. Makes Clash of the Titans look good.",
      "total_reactions": 15,
      "user": "Bshop"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "“Gods of Egypt” is truly a spectacle of badness, but it’s far from unwatchable. It’s like the wreck that you just can’t turn away from; it’s nearly impossible to avert your eyes to this bizarre adventure tale. This big budget movie is full of bad acting (oh Gerard Butler, you have fallen so far that you may never recover), really bad computer generated animation (did that god just transform into an aluminum eagle?), screechingly bad music, hilariously bad dialogue (with some lines that seem destined for cult status), and is just plain strange. You can call it the mythological version of “Showgirls.” Oddly enough, I didn’t hate it and I found that the more corny it got, the more enjoyable it was (I’m sick, I know)!",
      "total_reactions": 10,
      "user": "screenzealots"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2016
      },
      "score": 0,
      "text": "What. A. Terrible. Movie. Worst movie i have seen. DO NOT RECOMMEND TO WATCH. Cheesy, goofy acting, writing is god awful, I can't explain how awful the CGI is, welcome back to 2003. This is supposed to be good????????? And the director calling critics idiots? How worse can this get, just don't watch it. Please. For your money.",
      "total_reactions": 13,
      "user": "UncleBen7889"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "\"Gods of Egypt\" is a movie that the first part was interesting , but the second was very boring , very boring , I loved the special effects and music , but that does not may redeem , and the results is more worst than \" Knowing\" .",
      "total_reactions": 8,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "This is Wild Wild West all over again. You go see it expecting a story about the old Egypt, and suddenly, Saint Seiya armors all over the place. Powers are so unbalanced. I mean, we know this is fiction, but sometimes the human has abilities bigger than the gods, and also he is a clear copy of Aladdin. The love story is boring. I guess the movie will be OK for some audiences, like Wild Wild West was. If you are a geek, nerd or something close to that, DON'T SEE IT, you will get mad on every scene.",
      "total_reactions": 8,
      "user": "VideoJuegosCom"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "This whole genre has been a cinematic failure and with this film the trend continues stronger than ever. From over the top special effects trying too hard to please audience, to poor character development and dialogue, there really wasn't much to write home about. In fact, I was really just wanting it to end,",
      "total_reactions": 14,
      "user": "DramaKing"
    },
    {
      "neg_reactions": 26,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "I'm not sure why this has so many low scores. Especially for \"all of the gods being white\". There was actually a black god, I guess they watched a different movie than I did. The only thing I did not like about this movie is some of the romance scenes and some of the CGI wasn't very believable and for lack of a better phrase, \"Gay looking\".  This movie is action packed, and the story is pretty solid. I'm going to have to give it a 6 or 7 out of 10, because it was clearly above 5, which is what I consider to be average. I'm going to give it a 10 on metacritic to balance all of these people who aren't able to see the black god of wisdom.",
      "total_reactions": 40,
      "user": "Skeptec"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "130 million has burned this film.",
      "total_reactions": 9,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Gods of Egypt has a story that's derivative of Aladdin and The Lion King, It has pacing problems, contradicting plot points, hokey acting, and scenarios that are flat out stupid, so why am I giving it an 8/10?",
      "total_reactions": 6,
      "user": "Daveisonline"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 3,
      "text": "While Gods of Egypt has a somewhat dopey charm, the fun starts to end in the second half and the bore starts to set in.  The action scenes are laced with poor CGI and many effects made popular in the late 90's.  Can't say it's all bad, but I can't sit through it again.  D+",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "Rented this movie from Redbox not expecting much but was actually surprised as to how good it was.  Some great performances with some surprising appearances from actors who I had no idea were in the movie.  It's nice to see the spotlight on the god of the Egyptian mythology for a change.  Though normally appearing as humans, the Gods can revert to their animal form when fighting which makes for some cool battle sequences and visuals.  The fearless mortal thief character was a nice addition to the adventure, grounding the story a little while providing some humor and fun.  A movie worth checking out.",
      "total_reactions": 3,
      "user": "Robobob"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "In the span of two hours of dreadful script and forceful plot, any glint of opulence can't save \"Gods of Egypt\" from being mindlessly numb.",
      "total_reactions": 13,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "LOL white people playing black Gods in Africa. Only in Hollywood. Save your money this movie is lame I walked out of the movie spot. Why not get the people the actually were black to play themselves moreover the Gods in Africa are black and dark-skin. I love everyone  but it's weird to see black Gods white washed. Good luck Hollywood.",
      "total_reactions": 27,
      "user": "damman"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "You know it's gonna be suck when the Egyptian gods are all portrayed by white people.",
      "total_reactions": 21,
      "user": "TkHow88"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "Gods of Egypt is so decadent, so imbecilic, so not of its time, so -strange- as to become a type of glorious folly.  On the day of Horus' (Nikolaj Coster-Waldau) coronation, his malevolent uncle Set (Gerard Butler) murders reigning king Osiris (Bryan Brown), steals the crown, and rips Horus' eyes from his head before exiling him.  Set's tyrannical rule is later challenged by a jaded, reluctant Horus and a mortal thief (Brenton Thwaites) who retrieves one of the fallen god's baby blues.  The thief's aim is to save his recently murdered girlfriend (astonishing beauty and Fury Road wife Courtney Eaton) from the afterlife.  It is a shame director Alex Proyas' career is not in a healthier place two decades after the extremely promising one-two of The Crow and Dark City, but he remains a bold stylist.  Every frame of this two-hour-plus film is a punishing and sumptuous blast to the face.  The gold-hued, overwrought imagery—75 percent sword-and-sandal fantasy, 20 percent science fiction, 5 percent acid trip—includes a bejeweled Ra (Geoffrey Rush) battling a writhing rectal demon in space, she-assassins atop serpentine steeds, and decidedly Danish and Scottish Egyptian deities transforming into glowing ten-foot iron men.  Even tiny details are hideous and wonderful:  consider Osiris' inexplicable soul patch.  The cumulative experience is numbing and beyond over-the-top, but there are several moments of true beauty and aesthetic fascination, for better or worse.  And the dialogue is execrable, particularly the modern quips, and a certain secondhand shame is felt for the mostly talented and very attractive cast.  A disaster?  Maybe.  But a jolly, absurdly embellished one.",
      "total_reactions": 7,
      "user": "DotTheEyes"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 3,
      "text": "Guess what!! We got an early topnotch contender for next year's Razzie Award! CGI was overused and the movie was filled with un-engaging plot. The only good thing about this movie are the costumes and the humor of that Black Egyptian God(yes it's not an all white Gods) and the snakes, they were incredible.",
      "total_reactions": 18,
      "user": "Zayib"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 0,
      "text": "Bad writing with in credible goofy acting and direction. Each dialog is very non substantial and every response most of the times are some kind of \"supposed to be funny dialog\"",
      "total_reactions": 15,
      "user": "DanniBoi"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "Gods of Egypt (as predicted) was a total disaster. While it isn't the movie ever made, because lets be honest here, we all have seen much worse. The effect's looked unfinished, Gerard Butler was way too over the top and Alex Proyas is slowing becoming a hack.",
      "total_reactions": 12,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "My first impression of walking out of the theater after seeing Gods of Egypt was that I couldn't remember anything about the movie except for Gerard Butler's amazing death scream at the end. I like fun action movies as much as the next guy, but this movie was just too boring and too full of schlock CGI to be worth my time.",
      "total_reactions": 5,
      "user": "The3AcademySins"
    },
    {
      "neg_reactions": 23,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "How could you hate Gods of Egypt? Gods of Egypt is the best movie I've ever seen that takes place on Egypt and you can't do anything about it because I love Gods of Egypt a lot! *insert sarcasm here* Nah, I was just kidding. Gods of Egypt is nowhere to be found at all.",
      "total_reactions": 28,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 2,
      "text": "An embarrassment to films from the special effects, to the acting and everything in between...........................................................",
      "total_reactions": 6,
      "user": "csw12"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "This movie is garbage, but you know what you are signing up for when you buy your ticket. I enjoyed some of it -- it's certainly not as badly written as the critics say. But then again, film critics have been predictable and trite as of late.",
      "total_reactions": 6,
      "user": "vgmkyle"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "This is set in a time when giant gods walked among the \"little people\" and ruled the country. When there's a clash between 2 of them (Gerard Butler and Nikolaj Coster-Waldau), a mortal (Brenton Thwaites) joins the battle to save the world...and his girlfriend. It plays out more preposterous than it sounds. There are numerous chases and fights (none are exciting or innovative), weird creatures (which inspire no awe) and fantastical locations (badly rendered CGI). To add to the absurdity: almost every character, except various slaves and other lowly types, are blandly pale with British accents (speaking ridiculous dialogue). At least it's paced well enough, but that doesn't overcome the fact that it's cheesy, cliché-ridden and epically awful.",
      "total_reactions": 7,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2016
      },
      "score": 4,
      "text": "I'm not going to fret with you, Gods of Egypt is a bad movie. Very Bad. To say there is redeemable qualities to this movie would be a dramatic overstatement. The movie has alot of CGI, which almost completely ruins the movie from the start and it doesn't help that the film is overstuffed with bad acting, boring and cliched characters. This movie literally made the Clash of the Titans movies look like Citizen Kane.",
      "total_reactions": 6,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "I don't really keep track of movie studios but Lionsgate movies almost always suck. Except for Expendables 2, great movie. The only parts I liked were the god of knowledge and Anubis for corny value.",
      "total_reactions": 6,
      "user": "TheMetacritiqer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "Gods of Egypt, wow, just wow, this was awful on every conceivable level, it gets nothing right.  The film cost 140 million dollars and it clearly isn’t showing the effects, which are crap and I am certain for that reason alone it was made with bad money.  It was an awful inconsistent plot with a horrible script.  The actors give horrid performances and are terribly mis cast and there are a ton of white actors playing Egyptians, aside from that everyone puts on a terrible British accent.  The effects are inconsistent from scene to scene, the action is terrible.  I hated this film.  This is a damming indictment of where Blockbusters are going and the fact that the director of this film, who also directed I Robot, had the nerve to have a go at critics, calling them vultures, for daring to negatively review this film is rich because frankly this film deserves every negative backlash it can get. It is an awful piece of work and Mark Kermode said it best, you have to remember, vultures don’t eat living breathing things, they eat dead rotten things, so yes, for that reason alone, I would be glad to join the vultures on that one.  It’s just awful, this is a bomb in every sense of the word",
      "total_reactions": 2,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "What's your favorite mythology movie of all time? Now imagine that, but add an incoherent story and water it down with an orgy of over the top, unrealistic CGI. Now you have Gods of Egypt.",
      "total_reactions": 6,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "God-Awful.",
      "total_reactions": 6,
      "user": "Datamari"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "So all you people out there who love a good bad movie. Wouldn't it be great to have a terribly brilliant movie full of over the top CGI, laughable dialogue starring Jaime Lannister and Gerard Butler? Well don't hold your breath cause this sure ain't it. Instead you'll have to endure over two hours of some of the worst acting imaginable, a story that makes zero sense, CGI that wouldn't be seen dead in a video game and sibling rivalry, how's that for lazy writing. Honestly no one in the making of this movie even bothered to try, just showed up for the pay cheque. I didn't expect greatness by any means but there are no words for this utter mess. Not recommended.",
      "total_reactions": 2,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "I actually was expecting more out of this movie, I've heard Nicolaj was a good actor in his show GoT, but most of the performances are pretty lazy and sloppy. Almost all the shot, it was so obvious there was a green screen there. Sometimes I laughed but for the wrong reason, the one a director doesn't want a viewer to laugh.",
      "total_reactions": 10,
      "user": "Danonino"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2016
      },
      "score": 1,
      "text": "Absolute shame this film I was expecting something a lot more spectacular, A god with a Scottish accent, please... Some good FX if that;s all you want to see.",
      "total_reactions": 5,
      "user": "MrAlexWild"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "-Certainly not so bad but rather moderate for me, it highlights the Ancient Egypt also from a slightly different point the gods of Egypt and not so much the mystical, special effects are also not so what (very) realistic.-",
      "total_reactions": 3,
      "user": "horrorliefheb"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "It succeeds in such a way that there isn't anything else you could ever think was possible to be more terrible at.",
      "total_reactions": 6,
      "user": "farzyy12"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "Gods of Egypt: Flat, Cgi, great actors, and a story (somewhere deep hidden in the movie). When i saw the title i thought: \"Hey, another Clash of the Titans movie or a kind of sequel\". When i took a look at the cast, which was pretty flushed in comparison to the Clash of the Titans cast, i noticed it was, once again, another Egypt \"God Movie\". The movie started pretty fast with the introduction of the story and main characters but after about 10 minutes i still was like the plot has to be introduced. The characters were too briefly introduced which led to a lot of  \"Oh that one in the beginning\". and the plot was in my opinion severely lacking in depth. I did not expect the characters to contain the emotional depth as a Spielberg movie, although when certain events happened in the movie, i found them very poorly integrated into the development of the character and certainly a lack of emotional state of mind. I had a feeling the whole movie was one of another \"I want my revenge\" movie with a lot of to narrowly made up characters and a story which was rather thin and boring.",
      "total_reactions": 5,
      "user": "Gyrusho"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "So, you have a budget of 142 million dollars, fail miserably resulting in a film embarrassing that that even chimpanzees  would give a \"facepalm\" on how much embarrassing it is, barely make a profit of $ 2 million, and yet, you as a producer, you have the nerve to tell critics they are idiots!",
      "total_reactions": 6,
      "user": "alx93"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 3,
      "text": "The reason I am rating this movie so high is due to the lingering excitement and expectations of this year's beginning, and am thoroughly shocked. When i saw the stunning imagery and Butler , I wanted to give this movie a go. Turns out that I could not even finish it. The white gods did not bother me so despite my affinity with Egyptian Mythology, but just about everything else did. The bad CGI, uneventful and dull fight scenes, and the actors' failure to bring their characters to life. I could see limitless potential with this movie. I guess the director couldn't.  This 140 million dollar movie turned out to be a middle school performing arts extra credit assignment. If you choose to watch it, have money you are prepared to lose.",
      "total_reactions": 3,
      "user": "Nenad"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "WTF is this **** Who is this movie made for? its so awful and bad it actually funny in a very sad sad way. Did nobody in the production crew watch this crap and thought **** our movie suck balls should we cancel it. btw i didn't know the gods in egypt were all white people ... fail don't waste you're time on this garbage unless you want to watch with a bunch of friends and laugh how crappy the cgi.",
      "total_reactions": 4,
      "user": "CLOUDix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "Gods of Egypt is not a regular Hollywood production that lacks in honesty, decency or fun; it surpassed many bad examples of this kind in every aspect of failure. If this film is going to have a sequel, which is possible, and really frightening; it better be a two-hour-long apology to movie goers.",
      "total_reactions": 1,
      "user": "JonZsu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "I went into this movie with pretty low expectations. I rented it from the library so there was absolutely no cost for me other than time spent watching the movie. I have to say it wasn't terrible. The CGI effects are outdated, but other than that it was ok. Gerard Butler and Nikolaj Coster-Waldau both do excellent jobs. Brenton Thwaites is utterly forgettable as Bek. Everyone else does a fine job as secondary background characters.",
      "total_reactions": 0,
      "user": "dc127"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "Wow this film is amazing!  This is a solid 10 for pure fun and entertainment!  Thank you to the film makers and crew I love this film, it is beautiful in every way, the visuals, music, set/costume designs, scipt, acting and brilliant cast!  Truly an outstanding film for its pure entertainment value. I own the 3D bluray edition of Gods of Egypt and it is a must own disc set.",
      "total_reactions": 0,
      "user": "DreadLordAvatar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2016
      },
      "score": 1,
      "text": "Alex Proyas' Gods of Egypt is a truly incredible creation that can only be properly described as: what? Telling the story of the gods of Egypt and a struggle for the role of King of all Egypt, this film is truly a sight to behold. Really, the amount that goes on in these two hours is hard to put to words. That said, I am going to try. In the film, Set (Gerard Butler) is the god of Darkness, while his brother, Osiris (Bryan Brown), is King. As Osiris is set to pass the role of King to his son, Horus (Nikolaj Coster-Waldau), Set is unhappy. Thus, he kills Osiris, blinds Horus, and takes the crown. Set then proceeds to kill all gods against him and enslave the population of Egypt, while also attacking his father, Ra (Geoffrey Rush). By attacking Ra, he allows a demon that Ra fights nightly to attack the world with the intention of having this demon consume the afterlife. This would then give Set immortality and the power that would come with this. Meanwhile, Horus is distraught and blind, hiding in seclusion. That is until he meets Bek (Brenton Thwaites). A thief, Bek was enslaved by Set, along with his love Zaya (Courtney Eaton). When he tries to help Zaya escape, she is killed by Set's builder. In an attempt to rescue her from the afterlife, Bek strikes a deal with Horus to help him steal back his eyes (Bek had already stolen one back) in return for granting life back to Zaya. However, unbeknownst to Bek, Horus does not have the power to give life. Only Ra has that ability. Even worse, Set has made it so that to enter the afterlife, one must have riches. Zaya has none, meaning that she will be destroyed. Fortunately, Horus' love and the goddess of love, Hathor (Elodie Yung), is in a position to help. After recognizing the love Bek has for Zaya, she sacrifices herself by taking off a bracelet. This bracelet, given to her by Horus, had protected her from the demons that wished to consume her soul. By giving it to Bek to give to Zaya, Hathor feels as though she fulfilled her purpose as a god. Funnily enough, Zaya never needed it because that demon Set unleashed on the afterlife began consuming the afterlife right when it was her turn to relinquish her riches. Now, however, Bek and Horus must fight back against the world. Here, Horus learns that his journey was to fight for humanity and serve the world, rather than himself and other gods. In defeating Set, he teams up with Bek to save Egypt and restore order to the world. They also steal back Ra's sword - which Set had taken - to give Ra back his power. Once his sword is back in his hand, Ra is able to kill the demon. Moved by Horus' actions, Ra offers his services to his grandson. To repay Bek - who was killed by Set at this point - Horus asks Ra to give Bek and Zaya back their life so that they may be together once more. Ra grants this and Horus is made the King of Egypt while Bek and Zaya get to live happily ever after. Phew.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "This is family/fairy tale/adventure movie. I have enjoyed it a lot. Besides I was positively suprised that this movie digs deep into Egyptian mythology and is mostly very accurate to this. I give 10/10 not to rise up average score but becuase I really like that movie so much. For me it was fresh and fun.",
      "total_reactions": 0,
      "user": "Denzil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2017
      },
      "score": 2,
      "text": "not Terible but not good either simple your Average Greek mythology film with lots of action and a bit of humour   just another film that wants to get the action right so bad it forgets to have a good enough story or acting",
      "total_reactions": 0,
      "user": "travellyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2016
      },
      "score": 0,
      "text": "A comic book for 6 year olds ... Whoops! Sorry. Even my 6 year olds are smart enough to pass on this one. Too bad Gerald Butler did not. Hopefully everyone involved in this film cashed their checks quickly and removed the film credit from their resumes.",
      "total_reactions": 0,
      "user": "Eliasc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "Let me first start by stating that I wanted to hate this movie, but I just couldn't. The story was addictive as well as exciting. It is true however that it is not an accurate representation of Egyptian mythology. Yet I think this might be one of the rare cases where the movie benefits from not being to close to the source material. There is the problem that most of the gods are white but honestly it's something you learn to ignore. in conclusion this movie is'n as bad as people say it is.",
      "total_reactions": 0,
      "user": "darkbloodshed13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 1,
      "text": "One word, intolerable. The CG which kinda looked overdone and stupid. At one point Gerard butler is in the sky like Santa clause on a sledge being whisked around by a giant beatle, looked so stupid. Poor directing and writing. Just useless movie",
      "total_reactions": 0,
      "user": "Bitash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "Not sure where to start with this movie.. though a great cast but in an entirely wrong movie. The special effects were good but that's to be expected from a \"blockbuster\" but the character relationships and mediocre acting suspended believe to disbelief. Though this movie will undoubtedly appeal to a lot of folks I just found this to be a one time watch and painful one at that.",
      "total_reactions": 0,
      "user": "Manjit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2017
      },
      "score": 7,
      "text": "I enjoyed this film. Luxuriously rich in beautiful graphics, but also, unafraid to give a God portrayal of Ancient Egypt. This is the purpose of movies, to enjoy, entertain, and leave the mind pondering, and wanting more. Perhaps a sequel could be set in the modern era, unleashing the Gods",
      "total_reactions": 0,
      "user": "sexyjedi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "This is a fantasy movie on \"Planet Egypt\". It is a super hero movie, set to the background of Egyptian mythology that never was. It is fantastic in it's spectacle, imagery and breadth. The performances are decent and in many cases excellent (Elodie Yung, Gerard Butler) and the story is fascinating.",
      "total_reactions": 0,
      "user": "Djaii"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2017
      },
      "score": 5,
      "text": "La doy un 5, porque me da pena y porque el nivel de ridiculez en las transformaciones y en la super-estatura de los dioses, absurda hasta limites... Hacen que la pelicula sea inaguantable.",
      "total_reactions": 0,
      "user": "daviddelnorte23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2016
      },
      "score": 2,
      "text": "What a mess of a movie. It's just a bunch of glowing CGI nonsense slopped all over the screen while actors, both with and without talent, wander around. This is not a movie I would pay to see but even catching it for free on television doesn't mitigate how much of a waste of space it is.",
      "total_reactions": 0,
      "user": "ScarlettMi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "I haven't seen other reviews of this movie and I'm obviously late to the party on writing a review, but having just watched it on HBO I have to say I enjoyed the movie.",
      "total_reactions": 0,
      "user": "MidAirMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2017
      },
      "score": 5,
      "text": "Gods of Egypt is a big, original, spectacle film that feels have if all the money was spent on the spectacle with a lack of any originality. The film mirrors a number of films, most amusingly Disney films such as Aladdin and The Lion King, and attempts to pursue a big budget film for the eyes, though anyone with reasonable sense would laugh at the misguided ideals brought up within the picture. The film did provide a spectacle, however, with a number of interesting characters and interesting moments throughout. The plot makes little sense and the whitewashing element so heavily discussed is greatly prominent within the film, and many parts of the film come off a cheesy or unattempted humor. The film was interesting overall, and for those looking for a fun movie for the family or friends to watch would probably enjoy it, though looking past the great effects and colorful characters, one would come to find out this is only just an OK Movie.",
      "total_reactions": 0,
      "user": "GreatGatsby"
    }
  ]
}