{
  "avg_user_score": 1.9,
  "metascore": 22,
  "mixed_rating_frequency": 3,
  "movie_name": "God's Not Dead 2",
  "negative_rating_frequency": 109,
  "positive_rating_frequency": 23,
  "pro_critic_reviews": [
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2016
      },
      "score": 63,
      "summary": "While the actors do a yeoman’s job in presenting their characters with aplomb (especially Jesse Metcalfe, as Wesley’s lawyer), the entire film simply comes off as a two-hour, jazzed-up movie version of a sermon."
    },
    {
      "critic": "Dave White",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 40,
      "summary": "Its pulls back from the original film’s cruelty and comeuppances for non-believers, yet its non-Christian characters are still parodies of human evil: greedy, bitter, violent, and out to prove that “God is dead.”"
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 38,
      "summary": "In a righteous world, the better-acted, upbeat and faith-affirming “Miracles from Heaven” would eat this angry tirade for lunch."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 38,
      "summary": "There are serious movies about the Christian faith, about the persecution of the faithful, and about the intolerance that goes both ways. God's Not Dead 2 is not one of them."
    },
    {
      "critic": "Dominick Suzanne-Mayer",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 25,
      "summary": "There is a tone of anger that sneaks out of the film in even its moments of levity."
    },
    {
      "critic": "Vadim Rizov",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 25,
      "summary": "The first film pandered to a heavy persecution complex; this installment’s relatively subtler, but there are dog whistles aplenty."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 20,
      "summary": "God’s Not Dead 2 is a much better movie than God’s Not Dead, but that’s a bit like saying a glass of milk left on the table hasn’t curdled and is merely sour."
    },
    {
      "critic": "Nick Schager",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "summary": "Dramatically speaking, God’s Not Dead 2 operates at the level of your average middle-school play – except with far greater levels of upside-down logic and bald-faced intolerance for anyone not enraptured by the New Testament."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 22,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "Conservative propaganda at its finest. I hate this movie and its predecessor, for the matter. From the getgo, all this movie does is villainize  atheism and the other side in order to push its agenda, the problem with court based movies  is that more often that not, people watch court based movies to see 2 sides clashing equally when in this movie, its clearly more one sided in its arguments. One guy even goes as far to say, \"were at war,\" which spreads the \"us vs them mentality and I just hate that. If jesus were real, he wouldn't want atheists or non-believers out to be bad by using these fear mongering tactics, its absolutly ridiculous to make the assumption that Jesus Christ, a man who dined with thieves and prostitutes would see them that way if they didn't see things the way he saw them.  I'm sorry, regardless of your beliefs this movie is an absolutely ridiculous right-wing propaganda piece that in no way shows the teachings of Jesus Christ.",
      "total_reactions": 25,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 31,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "I hate this movie. As a Christian, the fact this movie exists is a failure.",
      "total_reactions": 41,
      "user": "EMS"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "Was there any need for a second one, seriously. This is almost the exact same movie, just with a two on it. Plus didn't I already say that gods dead. They probably didn't listen.",
      "total_reactions": 20,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 53,
      "pos_reactions": 26,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "In a world where liberal atheists will stop at nothing to destroy the rights of innocent Christians, only one Nickelodeon sitcom star can show an African-American judge what happens when kids start reading Nietzsche. The continuation of Kevin Sorbo's epic saga. God's Not Dead II: Not Deadder.",
      "total_reactions": 79,
      "user": "b_reno"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "This isn't a movie, it's propaganda that makes up ridiculous scenarios that would never happen in America. It's an insult to countries where people are actually oppressed for believing the wrong religion, or not believing.",
      "total_reactions": 14,
      "user": "jimmyrustles1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2016
      },
      "score": 1,
      "text": "This movie is one of the worst religious movies I have seen in some time. The villainising of the atheists from the beginning is extremely offensive and easy for the plot, what little there is. Skip this one.",
      "total_reactions": 5,
      "user": "rmsc12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "can i buy my wasted time watching this crap?",
      "total_reactions": 4,
      "user": "TheBoy6"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "Yes, I've just seen God's Not Dead 2, but why some may ask? I dunno. This is yet another insulting movie that picks on religion and makes atheists look like the most evil people on the planet. This whole movie is nothing but a big joke, but that could easily be the case, since this movie came out on April Fools Day.",
      "total_reactions": 18,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "Let's talk about this film's aesthetic appeal, rather than its message (see elsewhere). You want CLOSEUPS? Every actor's face is so tightly framed, it's exhausting to watch. Sheesh! At least 3/4 of the movie is facial closeups.",
      "total_reactions": 6,
      "user": "VisualBoy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 1,
      "text": "It actually is better than the first one. Unfortunately it's still horribly boring and false. Like the first one, it is purely a fictitious plot without precedent - don't let messages in the film itself deceive you otherwise - and serves as a straw man to demonize enemies of the Family Research Council.",
      "total_reactions": 3,
      "user": "leaveit"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "Exactly as what other crap faith-based movies have ruined Hollywood. I really don't believe in Jesus and certainly as hell I don't believe in God. That's what God's Not Dead 2 really is: a sequel that does absolutely makes no sense on making another movie starring 90's nostalgic icons turned into some sort of another Atlas Shrugged movie starring Kirk Cameron and Jason Patric. And why is Melissa Joan Hart (aka Sabrina The Teenage Witch) decided to join a part in this movie. War Room is pretty good so skip this movie.",
      "total_reactions": 11,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "An insult to intelligent people, incredibly shameful propaganda",
      "total_reactions": 10,
      "user": "DJ-Clazzi"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "This movie is an insult to all humanity and should burn for its crimes. Terrible Terrible Terrible!!!! These faith propaganda movies need to stop, they are corrupting the youth of america",
      "total_reactions": 10,
      "user": "guitarmad23"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 0,
      "text": "I'd rather smell elephant poop to see this movie again. It's boring, tiresome, annoying, bad story, all bad! I was angry with my friend for her offer going to the movies to see this crap.",
      "total_reactions": 5,
      "user": "pedroagaf"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "As a believer myself, I found this movie desperate and not so on point. The story is okay I guess, but the way it makes us look is a no no for me. First of all, the characters are just unlikable and the message it tries to carry was horrendous. My family and I watched the first one and it also was a boring and same old type of christian movie. I'm a Christian and I disapprove that the movie tries to change you. It doesn't, It feels like Jahovas witness trying to convince you in a desperate way. I'm sorry but the way the movie carries on is worse. God's Not Dead yes he's not but the movie is dead.",
      "total_reactions": 12,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "God is not Dead 2 is an beautiful movie. However, if you are a unbeliever, you will either hate it or become a christian, there is no other way around it. The gospel message inside this very will made and performed flick is so powerful that it is impossible to see it with a impartial mind. If you are born again, you will cry tears of joy multiple times, if you hate God, you´re going to hate everything about this movie. It is a landmark in spiritual cinema and should be watched by everyone that knows the Lord.",
      "total_reactions": 2,
      "user": "WagnerPaivaBr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "Esta película nos demuestra que Yisus envió a sus directores traidos del cielo para derrocar a La La Land (Que en hebreo antiguo LaLaLa significa Demonio Triple) y Del cine demoniaco, los usuarios le dan 0 porque no aceptan a su salvador, vean la película y purgen a los iluminatis y los veneradores del demonio.",
      "total_reactions": 2,
      "user": "ISCybercoreSI"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "An embarrassment to all Christians. It just makes me ashamed of my religion. None of the arguments make sense and it tries to convince us that Christians are somehow being prosecuted in America, possibly the most moronic thing I've ever heard. The acting is horrible and the plot laughable.",
      "total_reactions": 2,
      "user": "asshat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "You have got to be kidding me. This is not a movie, it's just another paranoid propaganda piece made by so-called \"christians\" who haven't the first clue how to be real christians, which is to not alienate the very people to whom they wish to bring the teachings of Jesus. This steaming pile of hate-mongering offensive spew, just like the first GND and should be reviled by christians, not embraced.",
      "total_reactions": 2,
      "user": "LKR505"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "I had a rough week starting at the 29th for some following reasons I won't tell you. If you want to know, I've been virused and now I got to pull up the ultimate prank starting today and got to hope that they might make it otherwise I'm stuck being a shadow holder for the rest of my mid-2016 adventure. Now I'm on Metacritic giving a review on God's Not Dead 2 with the first movie coming up at some time after making this review. If I have the knowledge and power, then movies like these won't be worth spending money on. I've already known people who are about to see this and that's okay because it wouldn't matter anyways. Like always to most movie sequels we never expected, did we really need this? The answer to that question is a pull-out yes for money and no for the audience. Fans, on the other side, might enjoy it and that's fine with me.. but there's really no point in this unless money's being involved.",
      "total_reactions": 13,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Though I think there is a bias against Christianity in schools, and that Christians should not be fearful to say the name of Jesus, I just thought the movie was poorly developed. I enjoyed the first one.  Did not enjoy this one because it was too unrealistic. Plus, I hate courtroom dramas.",
      "total_reactions": 6,
      "user": "swainkas"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "The first \"God's Not Dead\" tried to uplift Christians and convict nonbelievers. The latter of which it largely failed to do thanks to it's awkward nature and a rather harsh depiction of the very people it tried to minister to. For the sequel that issue has been avoided. This time around the focus is solely on entertaining a Christian audience while delivering a message to said Christians with little to no preaching at nonbelievers. As a result it's a better film in several ways.",
      "total_reactions": 16,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Eye Opener for the Logical Seeking Truth",
      "total_reactions": 23,
      "user": "BIGVON777"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "Powerful and beautifully crafted....seeing it for a second time this week. This movie is so timely as it reflects the reality of today's Christians as we have become the persecuted, the quieted, and the object of a new world order. Pay attention to details, and the irony of such. I applaud the Writers, the Director, the Actors, and the Crew for their courage to take on such a profound issue in a time when it is not \"politically correct\" nor socially accepted in certain company. Applause happened numerous times in our theater this evening. I hope the Artists behind this moving film will continue with more like this. I give two thumbs up and would offer ten if I had them !!",
      "total_reactions": 21,
      "user": "Fioranelli1"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "is is an encouraging movie. It expresses the faithfulness of God, and the real hope found in the name of our savior. Atheists may not like it, but this is a very good representation of their aggression and anger towards Christians every day. It even goes as far as to prove the existence of the man named Jesus (whether or not someone is willing to believe that he is the son of God is another story). Yet, their responses to our faith are understandable, being as the existence of a God, and the right to believe in one stands in the way of their awful agendas.",
      "total_reactions": 12,
      "user": "MrGreenTurtle"
    },
    {
      "neg_reactions": 34,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "I loved the movie because it shows how important it is to be congruent in all our life. It gives us an example how we have to defend that is right. we don't have to ask permit to do what is correct. And the value that the loyalty and the friendship have in our decisions.",
      "total_reactions": 39,
      "user": "CARMELORIGOBERT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2016
      },
      "score": 2,
      "text": "Entirely too faith-based to impress anyone, God's Not Dead 2 is incredibly weak, and is a completely unnecessary sequel to an already mediocre film (God's Not Dead).",
      "total_reactions": 1,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "is it **** yes, it is **** **** indeed, it is the ****tiest type of **** that makes all **** glad that they are not as bad as this conservative, boring, racist, homophobic ****fest. May God descend from the heavens to destroy any evidence that this **** fest of a movie exists",
      "total_reactions": 1,
      "user": "willm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2016
      },
      "score": 0,
      "text": "this movie is the worst thing i have ever seen in my entire life i thought they couldn't make it any worse than the first one. the terrible acting the hugely cringing moments had me wanting to era my ears off. this movie makes every atheist or non believer the biggest **** in the world and all the believers are the good guys. this movie just makes me feel like the christian church is so full of crap I'm not against the religion but this movie kind of contradicts itself when the lady is being sued for preaching christianity in her class and everyone is against it and the movie is preaching christianity  which makes the atheist look like even more ****s i actually hate this movie so much i wanted to kill myself so i can hopefully foreg==get i ever watched this",
      "total_reactions": 1,
      "user": "hassnibar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2017
      },
      "score": 2,
      "text": "God's Not Dead 2 gets a 2. ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha... It's just terrible; the movie looks terrible and the characters and plot don't really make any sense. You can make an awesome Christian movie; you just first have to know how to make an actual MOVIE rather than a mushed track of dead, dated scenes.",
      "total_reactions": 1,
      "user": "SomePersona"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2017
      },
      "score": 0,
      "text": "I feel sorry for the lead actors and the rest of the cast who bought into the victim mentality of the film and being misled by the false premise that Christianity was under attack. One actor (Jesse Metcalfe) even has his own Television show (Dallas) on network TV for crying out loud. The court cases listed in the credits have nothing to do with Christians being persecuted, but have everything to do with Christians doing the persecution. As for the choices made in the story, why on god's green Earth would a teacher need a public defender to defend her in a civil court? And why on great Zeus' Olympus would a teacher be in trouble for uttering the name Jesus? The court cases that have been mentioned in the end credits were examples of Christians doing the persecuting. The real message of the 'God's not Dead' franchise, I believe is this: \"If you don't allow me to persecute you, then you are persecuting me.\"",
      "total_reactions": 1,
      "user": "winchester7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "Christianity reminds me of a position in sales where you have to constantly be pushing the product, seeking moments in conversation to say laudatory things about the product, and studying new techniques of how to be persuasive with your pitch. As far as techniques go, this is one isn't very clever or nice. When they're not feeling the nirvana of having all the answers, it must be so tedious to be at odds with anyone who has a dissenting opinion.",
      "total_reactions": 0,
      "user": "Scraper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "How this trash after the first waste not as they had the courage to make a sequel. The first film does not bring arguments, only discriminates against atheists.",
      "total_reactions": 0,
      "user": "OrionHamake"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2017
      },
      "score": 10,
      "text": "Excellent movie. Ive known for a long time that Metacritic's user base is mostly composed of god hating Nazi/Marxist hybrids (as seen rioting and setting flames to cities in America) but the response here proves that beyond a doubt. If you're an actual intellectual (rather than a self proclaimed pseudo-intellectual like many here are) then you'll really enjoy this film.",
      "total_reactions": 0,
      "user": "TheChosenOne7"
    }
  ]
}