{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 36,
  "mc_mixed_rating_frequency": 19,
  "mc_movie_name": "Gone",
  "mc_negative_rating_frequency": 20,
  "mc_positive_rating_frequency": 29,
  "mc_pro_critic_reviews": [
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 67,
      "summary": "The film's pieces don't always fit together, but even in isolation, some of those pieces are well worth watching."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 65,
      "summary": "Seyfried has spent too much time lately in vehicles that aren't worthy of her, \"Red Riding Hood\" being the most egregious example. Gone at least takes her seriously – except when, to delicious effect, it doesn't."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 58,
      "summary": "Which stinks worse? The absurdly large pile of red herrings Gone amasses? Or the film's sub-Scooby Doo conclusion?"
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Hand it to Amanda Seyfried - she seems to have a knack for underplaying unstable characters in a way that lets their nuttiness creep right up on you."
    },
    {
      "critic": "David Ehrlich",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Gone starts off as a character study about a woman struggling to regain control of her world in the wake of a horribly intrusive event, but that sort of thing doesn't make for a fun night at the movies, so it quickly concedes to a Hitchcockian \"wrong woman\" riff, in which sexually motivated abduction serves as the worst MacGuffin in movie history."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "A low-pulse thriller that evaporates from memory with the last credit."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 38,
      "summary": "Nearly a year has passed since the release of Catherine Hardwicke's Red Riding Hood, and Amanda Seyfried is still crying wolf."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 38,
      "summary": "There's no thrill in Gone because you can see every surprise coming. It lies there flapping like a dying fish. Skip it."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "Seyfried acquits herself admirably in the panicky, hysterical mode, if that's what you're looking for, but by the time the final, goofy revelations roll around, you're slapping yourself for not having just taken a nap instead."
    },
    {
      "critic": "Glenn Whipp",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "Gone is also your hard-earned money if you buy a ticket to this slack piece of work, a movie that makes \"Murder on the Orient Express\" feel like \"The Silence of the Lambs\" by comparison."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "Believe it or not, the delicate-featured, whisper-thin actress manages to (mostly) pull it off, but the abysmal movie around her lets her down."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "Seriously depleting the skanky-villain bin at central casting, the moronic thriller Gone stars Amanda Seyfried as Jill."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 30,
      "summary": "A thriller so fixated on red herrings that viewers may stop caring if anyone's really in danger, Gone is diverting but unlikely to linger long in theaters."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "Gifted and sincere as she always is, there's not much Ms. Seyfried can do with this tripe."
    },
    {
      "critic": "Matt Singer",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 20,
      "summary": "The one cop (Bentley) who buys Jill's story looks like the most likely suspect (or at least the most likely red herring) - and then he vanishes for the entire third act to, supposedly, make his mother some soup. Wait, what?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 3,
      "text": "This late February release has the outer shell of The Silence of the Lambs; serial killer abducts a woman, throws her into the ground, and it's up to Clarice Starling (called Jill here) to rescue her before it's too late.  But gone are the memorable characters and unforgettable performances, gone are the psychological insights and sexual undercurrent, and gone are the atmosphere of evil and looming menace.  At least they got the title right.  Jill's methodology holds the film's interest.  She knows that people rarely believe her when she tells the truth about the abduction of herself or her sister, so she tells them lies they'll believe instead, whatever sob story it takes to get information out of her mark.  She's not a legendary hacker or deductive sleuth; she's a pathological liar in search of the truth.  While how it gets there holds interest, the story of Gone arrives at familiar beats; a betrayal as the film goes into the final stretch (from a character we haven't met yet), a high-speed car chase heralds the climax.  The film runs on borrowed parts from better films (Silence of the Lambs) and lesser films (Kiss the Girls), and suffers from a lack of invention.  Without proper setup, the film does not payoff to what little it builds up to, leaving a feeling of wanting more from 90 minute's investment.",
      "total_reactions": 4,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "There are far more useful ways to spend one's time; fire up the cable tv, sit back, and one is sure to find something atleast somewhat stimulating. Better yet, avoid it all together, I forgot, this is a tv movie. What foreign film director, Hector Dhalia, and writer Allison Burnett (  \"My Date with Drew,\" \"Feast of Love,\" \"Underworld Awakening,\") have here is an idea, so unoriginally effete, hence the title, and so flimsly executed, that the on-screen action is not the least bit engaging; audiences are drawn more keenly, instead, to a Portland setting that is as much a let-down in wasted horror potential as the film's beginning, middle, and end--all negligibly trite. Specifically, the film hands Seyfried a script that unrelentlessly smothers her; she is neither talented, convincing, or intersted enough to pull it off. As the viewer watches her become an instantaneous crime virtuoso, suddenly equipped with seemingly extensive investigative experience in a knee-jerk's time, they are left sitting, waiting, wondering, how, what is unfolding is even constructed into a film idea; it's mindless. And, the sight of her large, nefarious sea-greem eyes amidst her cutting brow line and biting lips is what the attention of the view is supplanted with; an expression that almost seems to cry \"wolf,\" only this time...sincerely. As for the other characters, they are carelessly under-developed and delineated so dimly, that their dialogue sounds more read-like than memorized: drop the note-cards guys, this isn't high school speech class anymore. Ultimately, \"Gone\" is a poorly-written, even more poorly-acted, straight-to-tv movie that hands its protagonist, innately incapable of rendering the least adroitness, a script that is so disconnected with her abilities that she essentially rolls over and sits down; the effort is colorlessly drawn. Filled with one-liners all too familiar to the genre such as \"Just go home and get some sleep,\" replied with \"I'll sleep when he's dead,\" makes the film's subject matter more a liability than a component of entertainment. Instead, \"Gone's\" characters mewl, \"Mom, do we have to?\" No need to check the temperature of this failure; it's dead.",
      "total_reactions": 2,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "It wasn't a fantastic film, but entertaining enough for the $1.27 Redbox rental. My absolute favorite part was the ending, which surprised me (in a good way). It isn't often enough that justice is TRULY done in this genre.",
      "total_reactions": 2,
      "user": "Denise"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 1,
      "text": "The perfect film... for the people that love Twilight and Abduction, not is for anything, but this films are really terrible, and Gone, is one of the better examples, is a terrible film, with much mistakes, the cast is good, but the performance of all is terrible. Gone is simple and boring.",
      "total_reactions": 3,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "I wanna keep this short because I don't want to sink anymore of my time into this despicable movie. It starts off flat and goes nowhere fast. Give us something, give us SOMETHING to chew on! It's almost like they were trying to make this movie terrible. I mean would a little music to take things up a notch kill you?? I feel the plot gasping for air not even 30 minutes in, thats when you know we're in for a really bumpy ride through a dark boring forrest. The end climax had such potential, but director Heitor Dhalia must have said, \"Remember guys we're trying to make a bad movie here.\"",
      "total_reactions": 3,
      "user": "Fujiforker"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This looked good in the ads but we missed it opening weekend.  Almost skipped it after reading reviews but decided to go anyway and were pleasantly surprised.  Sure there where some things that were a stretch of reality, but not enough to kill the creepy, something bad is about to happen to her vibe.  Definitely more entertaining than many of the movies getting better reviews, but then what else is new?  Much more engaging than the well reviewed bad cop movie we saw last week and that seems to be a favorite with the critics.",
      "total_reactions": 3,
      "user": "cinebabe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "I went into this movie thinking it was going be really bad after reading some of these reviews but to be honest its not that bad at all  there is enough  suspense and doubt cast on the main character to keep you interested in the movie and the ending was pretty cool so over all well wort a watch.",
      "total_reactions": 1,
      "user": "scoley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "No, it's not a terrible film. Amanda S. has enough magnetism that she can carry it most of the way.  Is \"the journey\" believable?  Hell no. It almost feels like one of those USA procedurals in which you know the main character will get him/herself out of these preposterous situations because there are 15 more episodes left in the season and we like her too much. So her rogue investigation of her sister's disappearance while she eludes scores of police officers strains credulity.  But you know what?  I had fun with it.  I give it a four because the technical merit scores are just too low.  If you're in the mood for some popcorn and some action on the big screen, you could do worse this first week in March.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "It was worth watching. Decent thriller / suspense movie. Nothing groundbreaking. But definitely worth renting at from Redbox. I think the critics were a bit harsh. If you're just looking to be entertained it will suffice.",
      "total_reactions": 0,
      "user": "Cheryl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "It’s a film that I believe is trying to be too clever for its own good; there are too many coincidences and blind alleys. On the performance front, I thought Amanda Seyfried did a good job but nobody else really stood out. Sadly I found it really hard to sympathise with her character because the threat appears to be in her head for much of the film. There’s sadly not much else I can say about it; I’ve maybe been a little generous with the score, but Portland did look good on the screen and the cinematography was pretty good over all. Not one I’ll be watching again but I’m glad I saw it for Seyfried’s performance if nothing else.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 4,
      "text": "Its mildly thrilling but there are zero scary parts. Its flawed but mildly enjoyable to watch. Its predictable and there are an awful lot of plot holes, but at least the action scenes are memorable.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Amanda Seyfried is a fantastic young actress and easily one of the most beautiful women in Hollywood but neither her talent nor her remarkable good looks could save this film. The story had potential but too many of the supporting cast were weak in terms of acting and character depth and the writing was very lazy. A lot of the tense moments were a result of mediocre decision making by the protagonist rather than by circumstance so it felt annoying rather than nerve-wracking. The conclusion of the movie also felt very rushed and anticlimactic. Overall, Seyfried does a good job but can't save the movie.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Amanda Seyfried is one of my favorite actresses and i think she tried her hardest to turn such a crappy script and plot into a decent watch.. but try and try as she might she failed.. the plot of the story was so boring and dragging i wanted to fall asleep! 97% of the movie you think she is psychotic chasing some man who doesn't exist, makes you lose faith in the movie when you can't even trust the main character. Very Disappointing.. I certainly won't be recommend it to anyone.",
      "total_reactions": 0,
      "user": "reetu416"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I really enjoyed this film. This film really had a good storyline. Most storylines in movies tend to go astray after half an hour. The actors did very well except the actor that played the older sister didn't really work as hard as the other sister (the main character). There were a few things I didn't like example: the scripting and the way they ended the film was a bit stupid...some how they could of done better then that. Overall the rating I'm giving it is a 7.5 it was a film i enjoyed watching wouldn't  say much more then that. Thanks for reading :)",
      "total_reactions": 0,
      "user": "RedMoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "A bland, uninspired psychological thriller that has Amanda Seyfried trapped in a role that I consistently couldn't take seriously. Throughout most of 'Gone' I was either distracted by the passing speck of dust, or laughing uproariously at the absurdities of the plot and dialogue. I was really making my mom mad, who was watching it with me. I don't feel any bit of remorse for that. The only enjoyment I got out of the film was it's ridiculousness. The entire time we have the feeling that Wes Bentley could be the kidnapper, then all of a sudden he disappears from the movie and this new character comes out of thin air to fill the role. The build-up to the end shows improvement, but once the climax finally comes, it seems too convenient and lame to justify the events that led up to it. Overall, though, I had a good enough time laughing at this movie to say that I didn't completely hate it, though, I certainly didn't like it for the reason intended.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Gone 7/10. When I read reviews about this movie people went on about all the twists and turns this movie takes, but to be honest, I can't think of one single plot twist in this movie, it's pretty straight forward. And while I'm a big fan of plot twists and surprises, I still enjoyed Gone a lot. One thing it does right is suspense, there were times when I really feared the main character was in some serious danger, especially that lamb to the slaughter type ending it had, on one hand you think she'll be alright, on the other you think she's pretty much dead. I liked the ending a lot, it highlights how ****ty cops are at their jobs.",
      "total_reactions": 0,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "The movie didn't always make sense. In the end it was a good movie but it didn't fit together. The psychotic serial killer and the messed up good girl put a weird twist on things. Unfortunately, where excitement should have been it was nothing but a boring movie that we had to force ourselves to finish.",
      "total_reactions": 0,
      "user": "breezy13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2016
      },
      "score": 8,
      "text": "8/10 for this film. I enjoyed this film but there are some plot holes and some of the twists don't make sense. The one guy who actually does believe her seems to be the suspect but then suddenly this new guy comes out of nowhere. Those twists and holes are the reason I am giving this an 8 instead of a 10. But if you can get over that stuff it is a really enjoyable film.",
      "total_reactions": 0,
      "user": "Castiel_Angel"
    }
  ]
}