{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Green Zone",
  "mc_negative_rating_frequency": 30,
  "mc_positive_rating_frequency": 128,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "An expensive flop and the latest Iraq movie to be shunned by the mass audience, Green Zone was still the year's most visceral, thrilling entertainment."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The movie is realistically constructed compared to those war movies that spent millions of dollars with famed stars labeled in it. But problem with \"Green Zone\" is, they take things too seriously.",
      "total_reactions": 5,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Paul Greengrass up until around 2001 no one knew whom this Irish up and coming director was that is until he directed the second of the three Bourne films \"The Bourne Supremacy\"(2004) that became the highest grossing film for the series at that point. one of Greengrass' most critically acclaimed films following on the heels of  his universally acclaimed \"Bloody Sunday\"(2002). Three years later  Greengrass directed one of the last decades   most acclaimed  and most controversial films \"United 93\"(2006) based on the true story of the heroism of the passengers and there tragic death when they forced the plane into a nose dive  causing it  to crash near Shanksville, Pennsylvania. The film was a massive critical success but meet with extreme criticism form audiences alike over its touchy source material. The year after Greengrass and actor Matt Damon  re-teamed to star and direct the third(and possibly final installment)  of the hugely successful Bourne series  with  the \"Bourne Ultimatum\"(2007)  which proved to be the highest grossing and biggest critically acclaimed hit of the series bringing a crashing final close to the saga of Jason Bourne. For nearly three years Greengrass was  working on a new project that while may lack the enthusiasm of his early works  is no less thought provoking or  thrilling as his  earlier works. This film is one of his best and a film that not only gives you the views of why we go to war but if the reasons we do go to war are really for the right reasons.  When I first heard of Paul Greengrass'  \"Green Zone\" back in  late 2009   I can say that I was  extremely excited  to see  Greengrass and Damon  back together again making a big action picture again  I could almost picture how this film would  have played out in my head(no thanks to my limitless imagination). I saw Damon playing a solider fighting against another Government conspiracy involving some sort of political assassination or cover up  that he exposed. I was eager with anticipation however, when I found out the release date of this film my anticipation dwindled. It dwindled not because I found out the film might not be as good as it appears but it dwindled because I would have to wait three months into 2010 to see one of my most anticipated films of 2010. After nearly two months of waiting I finally was able to see Paul Greengrass' \"Green Zoneâ",
      "total_reactions": 1,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "What happened to the smart intelligent adaptation of Imperial Life in the Emerald City, which we were promised? Not here I can tell you that. Instead of a critical examination of the role of civilian leadership in the reconstruction of Baghdad, we get a rah-rah-rah, there is no WMD in Iraq and we've all been duped! No look at Matt Damon act passionate and champion a cause after it is already mainstream. This isn't analysis of the political leanings of the film or cast, rather this is an outline of the plot structure. Formulaic and so overtly black and white that it is cringe worthy. Their is no moral grey, the bad guys are simply bad guys and the good guys have no moral flaw, beyond \"they're too just!\". The characters are so cookie cutter that you can't root for the good guys and the bad guys are so generic that you don't care if they get away with it or are killed. The resolution of the film is empty, because it so blatantly puts an oversimplified message ahead of a good story and characterization. That is the biggest problem in the film, by taking a political non-fiction book and turning it into a fictional military 'thriller' that is heavy handed in its message it loses all meaning and turns you away from caring. Where a subtle hand was needed, we got a megaphone wielding wacko screaming from the roofs.",
      "total_reactions": 1,
      "user": "rocketpackpanda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Green Zone is essentially what you find in the Bourne films with an underwhelming and heavy-handed script. The action and direction is solid, but political agenda is misplaced.",
      "total_reactions": 1,
      "user": "Seriosity"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "That was one good movie. It kept me on the edge of my seat the entire time. Matt Damon is one heck of an actor. By the way, does anybody know what happened to all the WMD ? Even if nobody seems to care anymore, I would like to know where they are...",
      "total_reactions": 5,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "I've long believed that the more incompetent the Director, the more likely he/she will cut a film into untold billions of cuts.  Loved the first Bourne movie.  Nos. 2 & 3?  No.  And no-er.  Do you really need 6 or 7 different 1 second shots showing a suitcase being put into a locker, or of someone entering a cab?  Green Zone?  Worthless.  Irrespective of Ideology, a film should be viewable, watchable.  Paul Greengrass, by this metric, is a complete hack.  And this is the last movie of his I will ever see.  Methinks Porn is his calling.",
      "total_reactions": 1,
      "user": "Mendax"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Not a war movie, no. But an elegant, perfectly paced thriller? Yes. Paul Greengrass has accomplished something here that he couldn't with the Bourne films, because the audience can believe everything he's telling them.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Too preachy for my taste (\"OMG, they LIED to us!\"), but still good old pseudo-documentary Bourne-style military conspiracy - tense, disillusioned and shaky of cam.",
      "total_reactions": 0,
      "user": "KundK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Paul Greengrass is a man youâ",
      "total_reactions": 0,
      "user": "NatDurman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "Green Zone is an obvious anti-Republican movie aimed at slandering the Bush party's decisions to invade Iraq. It portrays senior Republican leaders as oil-focused fact-creating greedy war-mongers that will do anything to keep the American public believing that WMDs exist in Iraq. From the start, the movie's agenda is painfully obvious as Matt Damon's character, Roy Miller, is in charge of a special task force whose sole purpose is to seek out Iraq's WMDs. As they go from site to site, donning chemical masks and special equipment designed to retrieve them, they constantly come up short. As Miller looks through his intelligence reports, once phrase continues to pop out at him (mostly because it's written in bold red text): \"A source has confirmed that chemical and biological weapons are stored...\" etc.",
      "total_reactions": 0,
      "user": "sapient254"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "In short: Trash. I went into this movie cold; not knowing the plot or movieâ",
      "total_reactions": 0,
      "user": "psychdoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "Matt Damon's performance was very good but the movie, overall, was pretty bad. The plot was slow-paced, boring and the action was unrealistic. I expected much more of this movie.",
      "total_reactions": 0,
      "user": "Razv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "This movie was disappointing.  The anti war message was overused and heavy handed.  The combat scenes were boring and inaccurate.  This film had a lot of potential and could have been much better.",
      "total_reactions": 0,
      "user": "S-Will"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "Remarkable cinematography from Barry Ackroyd (\"The Hurt Locker\") and very clearly a Paul Greengrass film, but ultimately not as successful as it could be because of a story that lacks the emotional punch it needs and is awfully predictable. And couldn't they give Amy Ryan more to do? A waste of her talent.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "A great war movie over all. The fighting scenes where intense but the plot and pace of the Green Zone where to me was horribly slow. ice burgs moved faster. It was so slow i was having a had remembering what happen at the beginning. On the other hand its keeps you guessing who will win right up till the end and is that not what we want out of a thriller. In the end go see this movie its worth the money.",
      "total_reactions": 0,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I thought it was a very good action packed movie that still shows that these are the movies for Matt Damon!! Almost a flash back to the \"Bourne\" trilogy. This movie i think made us think about the current event \"The Iraq War.\" Did we really go in because of a mistake/set-up?? How will we know?? Simply we never will.",
      "total_reactions": 0,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Matt Damon hits and misses in the \"Green Zone\" with obvious political preachings it makes the viewer think twice about what we here on the news everyday and thats exactly what the directer  Paul Greengrass wants you to think and its not a bad hook. Now while some of you may think hay I thought this was an action flick, yes well you be right it does indeed have a hand full of awesome action scenes but its the intriguing plot that will keep you enticed in-till the end. I give \"Green Zone\" a 7 out of 10",
      "total_reactions": 0,
      "user": "Kuruk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "Always going to be compared with the Bourne movies and unfortunately it does not hold up. On its own merits its not a bad movie, plenty of drama, plenty of action but it never quite makes the jump up to the great movie state. Damon is believable but not outstanding and there's good support from the rest of the cast.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "I was ill-disposed towards this film almost from the start due to a physical aversion to the jerky camera work which now seems to plague every film of a certain type: spending millions of dollars to make it look as though the action scenes are filmed by a passer-by who's less than familiar with how to use their video camera (jumping up and down, unable to hold the thing still even in a static setting, zooming in and out of focus, on the wrong settings at night, and so on). All totally unnecessary, and guaranteed to induce queasiness almost immediately. Had the film been better, perhaps it wouldn't have mattered; but unfortunately this was an over-simplified, unconvincing and frequently irritating movie which raised many more questions than it answered.",
      "total_reactions": 0,
      "user": "CharlotteP"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Green Zone makes for an intermittently entertaining conspiracy-based war film. Like all of Paul Greengrass's work, it looks great,  the audience is dragged right into the heart of the action, and the hellish images of war-torn Iraq are quite effective. The cast's performances are relatively decent, but by no means exceptional. The only one who really stands out is Khalid Abdalla, who plays \"Freddie\", an Iraqi ex-soldier and amputee who helps Chief Miller (Damon) to unravel the mystery as to why intelligence on WMD is so unreliable, and why the US went to war in the first place. Abdalla's performance is head-and-shoulders above the rest of the cast - it's complex, emotional and moving. Where Green Zone fails is in its writing, and in the fact that for a political thriller, it  has a surprising lack of thrills. While Brian Helgeland's screenplay is perfectly reasonable on face value, it simply isn't brave or clever enough. Instead of having the courage to point the finger of blame for the Iraq War at the real culprits, Helgeland instead chooses to substitute real-world villains with Hollywood creations (Greg Kinnear's morally dubious Pentagon man and Jason Isaacs' brutal handlebar-moustached spec ops commander). While I understand the need for dramatic licence to make a film work as a piece of entertainment (it is not, after all, an informative documentary) I don't understand how Kinnear and Issacs' characters turned out so dull. The real masterminds behind the Iraq war, the politicians that duped us all into thinking there was some sort of justification behind invading Iraq are far more interesting characters than these screen creations, and ultimately far more evil. If only Greengrass and Helgeland had the courage to say something really divisive about the Iraq War, rather than just re-affirming what we already know, that the WMD intelligence was made up, a convenient excuse for toppling an oppressive dictatorship. Even with this unremarkable underlying message, the film could have still stood out if had a decent plot, something to rival the truly great Hollywood conspiracy thrillers. Unfortunately, the story is simple and linear, and you can see the only major twist a mile off. Technically, Green Zone is flawless, and you really feel like you're going into Baghdad with the American soldiers, and living and fighting alongside them - Greengrass is a master of establishing, then maintaining a particular tone in his films. The high-quality cast all do their job, but the only one to really stand out is the excellent Khalid Abdalla, and the filmmakers' characterisation can come across as a little lazy. Greenzone's main problem is that it has not approached its highly controversial subject matter with enough commitment or bravery - nothing new is said, and it doesn't leave you thinking at the end, just non-plussed. Paul Greengrass's latest film is competent but uninspired, diverting but not memorable - in short, nothing special. His Bourne films had far more to say about evil politicians, shady military operations and human rights infringement than Green Zone ever does.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The message and central theme to this movie is one that needs to be told but unfortunately Green Zone's execution of its important messages is lacking. Green Zone looks great and is decently acted but is a little dull and predictable. Perhaps the story lacks the depth and impact to the war in Iraq and how tragic the war really is but in the end the film is ok and worth watching but wont be too memorable.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "I was pretty impressed by this movie. It doesn't work with the common cliches fortunately. It's recommended to see. If you are considering to watch you should do that.",
      "total_reactions": 0,
      "user": "island"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "A superb film on many accounts: realism, ethics, exposure, acting, environment, photography. I gave it a 9 instead of a 10, because at times  it resembles more a journalistic expose rather than a directed script/scenario. But overall \"right, riveting, good\".",
      "total_reactions": 0,
      "user": "Nikaki2004"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "This movie shows that it had the same people that worked on Bourne work on this because on a lot of respects it is very similar...so if you liked Bourne you're surely to like Green. Something that shows what a great movie this is, is that even though it is about Iraq it is very relevant to what was happening now within Libya. Here is where the action meets the substance. It is a very intelligent action movie, Damon showing an impeccable performance of a soldier trying to come to term with the incompetence that surrounds him. Its frantic to say the least and a great action movie to date. The journalist is the only wasted character here and could have easily been a more compelling protagonist, besides that the supporting cast is equally great. Another minor flaw is on the emphasis that every character is either good or bad when I think the tone should have been much more in the middle. Besides from that Green Zone is a great, honest and intriguing movie and  a fantastic blockbuster.",
      "total_reactions": 0,
      "user": "Jefflyn90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Shot in documentary style by Bourne director Paul Greengrass, Green Zone is an excellent thriller. It pulls you in at the outset and doesn't let up at all. The movie's premise is that the intel for the Iraqui War was fraudulent and that we went to war on false pretenses. Not only this, but that certain political factions in Washington knew the intel was false and used it as an excuse to invade the country.",
      "total_reactions": 0,
      "user": "vidkid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "Green Zone is a terrific film that may take some creative liberties at times, but is always incredibly well paced,  edge of your seat thrilling, and a fantastic look at the Iraq War from the inside. Matt Damon is great in this role as a soldier who quickly realizes their intel is bad and Iraq has no WMDs. Tense and thrilling, there are rarely films nowadays that leave me on the edge of my seat, but Green Zone made me think I was going to have a heart attack - it was that thrilling and energizing. The film, politically, has been criticized as \"anti-American\". I am not seeing it. If anything, it is pro-understanding. Those who try to learn more instead of sticking their head in the sand are rewarded. Those who put down dissenters are villains. That said, the film's simple point of, only Iraqis should run Iraq is very well built up to and a fair point. With so many factions in Iraq, nobody is better equipped to handle running the country than them. We certainly know that now. As for Green Zone, it is a terrifically entertaining and thrilling action war film that is wonderfully directed by Paul Greengrass and his action muse Matt Damon.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "An intelligent film which tries to realistically portray the issues around the current war in the Middle East. It's a well thought-out film with a great actor and director who have obvious chemistry, especially when producing these similar military-based films. Perhaps just a little bit more action was required to make this a truly great film.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "In my opinion Green Zone is a good movie. It features more a political aspect compared to other movies in its genre, so if you watch Green Zone expecting an action packed-thriller then you will be slightly disappointed. Instead it focuses on important issues that cause you think about the world we live in today and our involvement in the war abroad. In Green Zone, the movie shines a light on the US government and its involvement in Iraq. More closely its search for \"weapons of mass destruction\". With Matt Damon as the protagonist, he begins to question his chain of command, and the mission at hand. With an underlying political aspect, the plot unravels and at the end, your wanting more.",
      "total_reactions": 0,
      "user": "ehiem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "As a Middle Eastern, the only thing I liked and appreciated about the movie is how true and detailed almost everything was said about IRAQ in that period of time. It was an okay and kinda boring action movie.",
      "total_reactions": 0,
      "user": "b0mbardini"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Green Zone works well as a war thriller, caught up with major real life conflicts. But, the pace is slow, the writing is dull, and that makes for a longer experience than usual. Director Paul Greengrass throws everything at it, to make viewers grasp its attention, but by that time, it's too late. Greengrass, who brought us the brilliant Captain Philips and the Bourne movies, comes up with a dull, lukewarm thriller about the chemical ramblings in Pakistan. Matt Damon, does well with what he is given. But not much is given. If you expect action, there are a few scenes, that do well to get your attention. But by then, you're already asleep.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "A pretty average action movie. Obviously made in Matt Damons stardom of the Bourne Trilogy, but trying to be more blockbuster. It's story is typical and predictable, and sure Matt Damon does a good job as his character but the performances as a whole are pretty \"meh\". The film is simply this: is a typical middle eastern war film that doesn't bring anythinf special other than Matt Damon. A pretty easily missable film.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "For an action movie starring Matt Damon i was expecting better.But the movie gives some good action scenes.Matt Damon like always is a good actor.The movie is realistic compared to those movie with bad CGI effects. So i was not that disappointed but i expected better.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "This is a frenetic and powerful action flick that brings the fight to you.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}