{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 39,
  "mc_mixed_rating_frequency": 252,
  "mc_movie_name": "Green Lantern",
  "mc_negative_rating_frequency": 178,
  "mc_positive_rating_frequency": 321,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 75,
      "summary": "So what we have is a movie that will make at least two important groups happy. New Orleans boosters can cheer Green Lantern for its local roots and for the possibility that the inevitable future installments could return to town. And the purists can cheer, knowing that Campbell and crew have done Green Lantern justice."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 70,
      "summary": "For all the CGI action sequences and butt-rocking Dolby sound effects, in fact, Green Lantern is most satisfying when it sticks close to stodgy comic-book archetype."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 70,
      "summary": "Serves up all the requisite elements with enough self-deprecating humor to suggest it doesn't take itself too seriously."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 67,
      "summary": "It's not only light, it's thin. It's self-deprecating to a fault. Reynolds is required to practically wink at the audience, as if to say,\"I know this looks silly.\""
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 63,
      "summary": "Green Lantern does not intend to be plausible. It intends to be a sound-and-light show, assaulting the audience with sensational special effects. If that's what you want, that's what you get."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "Apart from having no particular reason to exist onscreen, especially at these prices, it's not half bad."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "More science-fiction space opera than superhero epic, it works in fits and starts as its disparate parts go in and out of effectiveness, but the professionalism of the production make it watchable in a comic book kind of way."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "Takes forever to get going and then goes nowhere."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "An attempt to infuse an earnest piece of comicbook lore with an irreverent, tongue-in-cheek sensibility yields decidedly mixed results in Green Lantern."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 58,
      "summary": "Reynolds makes Hal a perfectly functional comic-book hero, but there's a big difference between functional and super."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "The result makes the movie seem assembled from bits and pieces of other superhero yarns rather than existing on a plane of its own."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "What gets sacrificed on the altar of this new franchise launch is any real sense of fun."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "There are pros and cons to this Green Lantern, a half-campy, half-compelling adaptation of the superheroic DC comic books."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "It's neither amusing nor exciting enough to ensure a long-running franchise."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Apart from some spiffy visual effects, which create coherent, scary textures and architecture for outer space, Green Lantern is the most generic of summer time wasters."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Green just isn't the superhero color this year."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Martin Campbell, though a capable director of action (Hal's training session with the Michael Clarke Duncan-voiced Kilowog is proof of that), doesn't have a poet's instincts."
    },
    {
      "critic": "Glen Weldon",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The film splinters into three near-discrete storylines that don't play all that well together."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "Martin Campbell made Zorro and Bond work as contemporary heroes, but doesn't quite have the feel for poor old Hal Jordan. Green Lantern is dazzling in pieces, but we've seen too many sharper versions of the superhero origin story in the last few years. It's not Jonah Hex, but the battery runs low too quickly."
    },
    {
      "critic": "Michael Wilmington",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The result is a deadly disappointment, despite Ryan Reynolds's cocky, muscle-flexing charisma as the daredevil test pilot turned intergalactic peacekeeper and Peter Sargaard's movie-stealing turn as a nerdy scientist turned psycho monster."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The effects are so omnipresent it's like Reynolds' perfect hair is floating in CGI limbo. Yet when they need punch, as in a \"Superman\"-ish display-of-powers scene involving a helicopter, there's no flair."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The film, released in both 2D and 3D, delivers lots of freshly minted CGI'd action (eventually) but none of it grabs you. There's just something too synthetic about the whole enterprise - it's fantasy tipped over into fakery."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The film never rewards the viewer for even trying to keep track of what is going on. So you give up, and instead try to grab on to the small pleasures, which momentarily distract from the fact that the narrative is nonsensical, the characters so boilerplate that their every action seem preordained from the earliest frames, even as the action on-screen is often incoherent."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "Whenever this Lantern returns to terra firma (too often), its imaginative flights are ground down under the Warners overlords' demographic-pandering heels."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "Blake Lively doesn't have a whole lot to do as Hal's employer and occasional lover, who sometimes requires rescuing. No great loss; she and Reynolds have minus-zero chemistry."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "For a movie that touts the importance of humanity, Green Lantern is a strangely lifeless spectacle."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "What has Campbell wrought? An intermittently amusing, interminable affair that for sheer ugliness and a scenery-chewing performance by Peter Sarsgaard has a certain Camp appeal."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "The spectacular collapse of Green Lantern is bound to be blamed on Reynolds, but the villainy has its origins in an injustice league of TV-trained screenwriters and tin-hearted studio suits."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "Well, Green Lantern isn't \"Jonah Hex\" bad. But it's silly enough to be part of the same \"silliest Warner Brothers comic book summer movies of all time\" conversation."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 33,
      "summary": "A film so utterly lacking in conviction, it needs a 25-year-old Tom Cruise vehicle just to keep its spine straight."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 30,
      "summary": "Green Lantern is bad. This despite Mr. Reynolds's dazzling dentistry, hard-body physique and earnest efforts."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 30,
      "summary": "Green Lantern was meant to be a sci-fi adventure, but it proves to be a genuine mystery. How could its megamoola budget have yielded a production that looks almost as tacky as \"Flash Gordon\" (which had the good grace to deprecate itself at every turn)?"
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "Can we please get over the notion that every superhero in a skintight suit deserves a movie? Green Lantern is the latest wallet drainer emptying the comic book bench, more thudding than \"Thor\" and sorely incoherent."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "The film is remarkably stunted."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "Hal claims that a Lantern's only enemy is fear itself. The thought of a sequel to this shamelessly soulless Hollywood product scares me plenty."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "The tone is all over the place, which makes the movie difficult to take neither seriously nor as popcorn fluff."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "Even as a prime example of rotten summer silliness, this is a paralyzing experience."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 20,
      "summary": "It's a helluva comic book, to be sure, but it's a godawful mess of a movie."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 20,
      "summary": "Even by the standards of the current run of mediocre comic-book movies, this one stands out for its egregious shoddiness."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 10,
      "pos_reactions": 19,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "I came into the movie expecting it to be bad but reasonable summer movie entertainment. Being an avid metacritic reader, I was fully aware of score of 40 and the bashing the critics gave this movie. What drove me to what the movie was the trailer (which seemed reasonable) and the fact that the user score was 6.7, suggesting that this movie is full of mindless but fun action.",
      "total_reactions": 29,
      "user": "ReviewerMeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Ryan Reynolds dons a green energy suit and defends Earth from outer space giant alien heads and a crazy scientist? Okay. Not perfect. But its fun all the same, and what superhero movie isn't?",
      "total_reactions": 1,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "We can work with this. Don't do it again. There is no reason to reboot it. There is a decent world created, as long as the script and effects aren't as shoddy, then everything will be fine. No more floating poo monsters next time please.",
      "total_reactions": 1,
      "user": "wrightm1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "Equipped with poor CGI, decent performance from Ryan Reynolds, and a story that cannot hold itself in one whole piece, \"Green Lantern\" acknowledges me of DC's prominent failure to move its loved superhero into the big screen.",
      "total_reactions": 10,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "This was a really good movie. I didn't read any reviews before I saw it so my expectations were unaffected. I was hoping for a good eye popping visual feast with a cast that didn't disappoint. Well it was a good as I hoped. The acting avoided the cheesiness that sometimes plagues films like this. I was pleasantly surprised that during the relatively lighthearted moments (read: not dark like Batman) it still maintained seriousness and the characters never crossed the line on believability with overacting. By comparison this movie was better than THOR in my opinion. The only thing I can critique is that it was a little short. They could have added about 20 minutes to flesh out the character development a bit more, but overall it still worked pretty well. I thought Ryan Reynolds did a good job. His character seemed like an unassuming approachable guy that got chucked into this role of responsibility, but had the raw potential to be a hero under the right circumstances. It was believable in a similar way as Peter Parker in Spiderman, but more so because Hal wasn't a dork to start ou with. Heck in costume Reynolds even looks like Lantern in the comics. I think he was a good choice ultimately. I can't wait for the sequel. If you were lucky enough and stayed for the closing credits you had a chance to see Sinestro put that yellow ring of fear on and bask in it's evil. Smells like sequel materiL to me. Can't wait..",
      "total_reactions": 4,
      "user": "LAViking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Not the greatest hero flick I've ever seen, but it's enjoyable.  I thought Ryan Reynolds did a good job as Hal, and Peter Sarsgard's perfomance as Hector Hammond was great. I also couldn't get over the scenes on the beautiful planet Oa. Hopefully the sequel (yes, there will be a sequel; if you sit through the credits for a little while, you'll learn this) will be a little better.",
      "total_reactions": 7,
      "user": "xandervee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I thought the movie was very good.  The pacing as great as it seemed like there was never a dull moment.  There was excellent balance between action scenes and story development, humor and seriousness, as well as internal and external conflicts.  I think it's a shame the movie seems to be getting the low scores it's getting.  I thought this was not only a good super hero movie, but a pretty good science fiction movie as well.  It is definitely worth seeing for yourself.",
      "total_reactions": 7,
      "user": "hagelt18"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "The movie started off well enough and seemed to introduce some interesting concepts but the movie felt rushed. It really felt like whole scenes were missing. It was almost like they edited two movies into one and chopped it down, the end result is like someone trying to smash puzzle pieces that don't fit together. Some parts didn't make sense but it was...enjoyable, I guess? I didn't leave fully disappointed, just slightly disappointed but I wasn't expecting very much to begin with. Stiff acting at times and hammy performances at others, they special effects were actually way better than I expected. I liked the ring on ring action sequences the best but the ending monster battle just sucked.",
      "total_reactions": 20,
      "user": "thecount222"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Although the cheese factor takes away from the story at times (not surprising given the lead actor) it was refreshing to see a superhero movie that is proud to be just that. Green Lantern isn't afraid of its spandex, or colorful alien backdrops. When Hollywood attempts to make larger than life icons more realistic for the average audience (such as turning the X-Men into a biker gang, Galactus into a large ominous cloud or beefing up the Batman by sporting him in armor) they only seem to succeed in producing a less believable action flick instead of what we wanted to see: a silver screen adaptation of the well-rounded comic book crime fighters we love",
      "total_reactions": 6,
      "user": "Omegamaxus"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "First thing I need to say is this is not a thinking movie. It's a superhero flick. So if your intention is to watch a movie that'll make you feel warm and fuzzy, or make you cry, or make you ponder the nature of life, don't see this. What this movie is, is an exceptional representation of an iconic superhero, which is a rarity today. I had initial concerns about Ryan Reynolds playing Hal Jordan as he's a very quirky actor, but he pulled it off well. Carol Ferris wasn't as well played, but she was still passable. What really struck me about this movie was how it really stayed true to the origin of the green lantern and yet at the same time dumbed it down for casual audiences. As a for instance, those of you who have read the comics know that Parallax's backstory is long and complicated and one can't really understand it without understanding the war of light, but the movie makes a few minor changes and makes him an acceptable villain to someone who hasn't followed the comics. This is getting a little long-winded, but what it boils down to is Green Lantern is DC's Iron Man: A healthy amount of action, true to the origin, accessible by both long-term fans and casual viewers, and not too much cheesy crap.",
      "total_reactions": 6,
      "user": "Nexahs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Putting aside all of the wonderful superhero movies that came out this year. Green Lantern isn't actually that bad. I was expecting it to be worst, but I guess only Daredevil will only dare to go down that level.",
      "total_reactions": 6,
      "user": "avj37"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "While I can see why many critics disliked it, Green Lantern is NOT deserving of the bashing it's been getting.",
      "total_reactions": 3,
      "user": "Kangstah"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "To telll the truth, after reading some truly savage reviews by some of the critics I have learned to trust, I intended to skip this film.  But as a kid I loved Green Lantern more than Superman, Batman and Supergirl combined.  After Wonder Woman GL was my fave.",
      "total_reactions": 3,
      "user": "DannyJane"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "I'm an admitted comic book fan, but not a rabid Green Lantern fan, and I fully understand that some liberties have to be taken in order to translate a comic character into a live-action movie.  Still, I found myself utterly disappointed with the mess that was Green Lantern.  While the movie did stick reasonably close to the comic book lore, it didn't do it in a way that drew me in and kept me on the edge of my seat.  At times, Ryan Reynolds just seemed bored and like he was reciting his lines.  Parallax was more dull than scary, Hector Hammond was not nearly as creepy of a villain as he could have been, and the buildup to Sinestro's turn to the dark side seemed more like an afterthought than a logical progression for the character.  Sadly, this just movie just ended up being another in a line of disappointing movies starting DC Comics characters.",
      "total_reactions": 3,
      "user": "Skruff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "I've never really been a Green Lantern fan, so I wasn't expecting much...and there wasn't. The film just seemed boring and nothing likable except a couple of scenes.",
      "total_reactions": 3,
      "user": "BingoTrousers14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "I don't think the story is interesting , so the movie is about blah blah blah you suddenly gain power and oh **** your only a human and you cant fight god damn aliens than suddenly big scary final boss which looked like very powerful and strong and than the big scary strong boss is killed under 10 **** MINUTES. This god damn movie spent too much time on talking about love and boring things....Boring!",
      "total_reactions": 3,
      "user": "nnn1814"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "There are plenty of bad movies been released this year, but i will draw my attention to the biggest disapointment of the year. Green lantern looked AMAZING in the trailer and it really does portray an epic tale of good vs evil , Will vs Fear. Me being an avid green lantern fan and a follower of DC comics i was looking forward to DC's 3rd major movie release other than batman and superman. With the huge depth of super heroes from DC unvierse to make movies on i thought that this movie would be one of the best movies out there this year. Oh how wrong was I. Even for me a true fan of the GL, this movie is utter rubbish. Its really boring, takes forever to get going and when it does it ends. It feels more like a setup for a second movie (at the end you will see why) but given how much it has flopped unless they know the 2nd movie will be a million times better than this, no one would go near it with a barge pole. The acting is okay in my opinon, Ryan Reynolds does a good job as the GL but his supporting cast look like they couldnt care less. The Special effects are good when you get to see some action but its not enough. If you are not gonna have action scenes then at least replace them with an engaging story, Unfortnately it dosent, stay away from this title its very, very poor.",
      "total_reactions": 3,
      "user": "Afreemanuk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Thoroughly enjoyable movie and shouldn't that be what movies are!  Great action scenes, not enough main bad guy for my liking.... and not enough Sinistro either! Roll on Green Lantern 2...",
      "total_reactions": 10,
      "user": "Mrmoobs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "This movie is trying to make it a better DC comic book film that brings the awesome The Dark Knight and Superman, but I'll admit that this movie is more less than the other superhero films that doesn't get hype that too much. Green Lantern is okay and decent, but this movie is a lot of fun to see in summer and we can see it in 2D instead of wearing in 3D. The background is pretty awesome to look at, the action is so cool, the effects are pretty damn good (I love it when the Green Lantern is using his powers to fight with cool techniques that transform into anything), the cast is okay, and the story was a bit strange, but it works for a comic book movie.",
      "total_reactions": 5,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "As someone who has been reading comic books since I was 12, I have to say that GL was great. After watching Superman Returns and the last three X-men movies I had almost given up hope that any superhero screenplay would be anywhere close to the source material (Superman having a son? Jean Grey killing Cyclops? blasphemy!) GL, and the Dark Knight before it, renewed hope that Hollywood can make a comic movie without completely rewriting 50 years of character development. Other than the presence of Paralax, 90% of the Hal Jordan origin story reflects what you find in GL: Secret Origin (by Geoff Johns), which keeps this from becoming just another cringe worthy attempt to cash in on the wave of superhero films since the late 90's. That being said it isn't Shakespeare, so if you're looking for a heady drama you're not going to find it here. Overall it was a great summer adventure that keeps you entertained for an hour and a half, which is just what it is supposed to do. The Pros - True to the source material",
      "total_reactions": 5,
      "user": "Jldyck"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I saw Green Lantern with a number of friends, one new to the character.  We all agreed it was a fun movie and good story.  Basically the reviewers got it wrong, not even sure the reviewers watched the same movie as we did. Overall a good time.",
      "total_reactions": 5,
      "user": "Sruschill"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I enjoyed Green Lantern. So the pacing was all over the place, they overloaded on exposition and they stuffed too much into one movie. I still really liked it. It was a shame it wasn't closer to the original mythology, because I think that the story suffered where they strayed from the comics, and there was really no reason to. Hopefully the relatively negative response from critics won't discouraging DC from putting some more second and third tier characters on the big screen. In the end, I found the movie pretty enjoyable.",
      "total_reactions": 5,
      "user": "AramZS"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "It does a disservice to contentious comic fans, moviegoers and the Green Lantern brand itself.  It attempted to do far too much with far too little time.  Three different tangential story-lines that never really flesh themselves out, action sequences that are all-too few and far too short, and a horribly cliched by-the-numbers comic book movie script ('Eh, slap it together, we'll get some CGI to cover-up all the inadequacies').  All due to far, FAR too many Blake-Lively-dramatic-pause-faces.  Put it on a t-shirt, you know you love that phrase.   The most disheartening thing for me is that it probably won't inspire people to pick up any of the canon of Green Lantern comics, an infinitely more enjoyable and rewarding experience.",
      "total_reactions": 5,
      "user": "TheTroof"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "im not a massive dc fan. being a big fan of marvel. so i probably enjoyed this more than a dc fan. sure it wont win an oscar. but its an enjoyable film to watch an everyone i went with enjoyed it, so ignore all the critics an just go watch it. an decide for your self",
      "total_reactions": 5,
      "user": "koil1990"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "The movie was fun. Acting was well executed. Especially mark strong as sinestro, it's not his fault the writers dropped the ball with his character. But the problems with his character could be fixed with a sequel. The rest was fine compared to the comics.",
      "total_reactions": 5,
      "user": "pilotboy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I thought it was much better than what the critics thought,  I would recommend it.   I thought the special effects were good and tha Ryan Reynolds was excellent in his role.  Remember they had to spend time with the background of the story,",
      "total_reactions": 5,
      "user": "jlbpsy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "My husband & I really enjoyed Green Lantern alot!!!  We thought Ryan Reynolds was great and the special effects were very good. We think the critics were way wrong - Green Lantern was so very much better than Thor the bore,  Hope they do a sequel wirh more romance between Reynolds & Lively",
      "total_reactions": 5,
      "user": "KCB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "I may not be a huge Green Lantern comic  book fan, but Ryan Reynolds delivered in his role as Hal Jordan. I'm not quite sure why the critics have been bashing this movie, because it's a pretty solid popcorn movie. If you're expecting Citizen Kane from Green Lantern, then you've only got yourself to blame.  A solid superhero movie and pure escapism!",
      "total_reactions": 5,
      "user": "MillionPoundHam"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "The movie was really entertaining.  Critics got this wrong.  Yes, the movie was a little short and a bit rushed.  It should have been 15 minutes longer.  However, aside from that, the special effects were pretty good and the origin story was pretty close to the comic.  I hope they still make a sequel with Sinestro as the villian.",
      "total_reactions": 5,
      "user": "superman1609"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "What can I say, I'm a sucker for comic book movies. If you're going into this expecting \"one of the most brilliant films of our time\", you might want to just go get your money back, but if you're looking for an eye-popping, action-packed, good time, then you picked the right movie. You may not enjoy this film as much as I did, unless you're like me and grew up on the Green Lantern comics and cartoons, but I do think you will enjoy Martin Campbell's marvelous take on the world of the Lanterns, and the Lanterns themselves.",
      "total_reactions": 17,
      "user": "ZacharyMatson"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "Half way thru the movie I was completely bored and didn't really care much whats gonna happen next, besides that main characters were presenting zero chemistry, only reason that made me stay all the way till the end was group of friends.",
      "total_reactions": 12,
      "user": "nufrequency"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I liked it. Adventure with a side of humour. Ryan Reynolds was great.  Clancy Brown is a great voice for Parallax. Peter Sarsgaard is a great villain (Hector Hammond) . I'll probably see it again!",
      "total_reactions": 7,
      "user": "redking"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I really don't get all the negativity. This was a fun movie that introduced me to the Green Lantern universe. Did I have complaints? Yes. First of all, the actress playing Carol was horrible. Second, while not completely terrible, the pacing definitely needed some work. But these complaints are only minor compared to the fun I had watching this movie.",
      "total_reactions": 7,
      "user": "gm101"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I liked this movie for what it was, a superhero movie. It won't win academy awards but it was fun to watch. Just make sure it's what your looking for before you see it.",
      "total_reactions": 7,
      "user": "Dhorlo"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Yeah!  DC rules!  Or so I said at  the end of the movie, which I thoroughly enjoyed.  What a welcome respite from the loathsomely puerile likes of \"Thor\" and \"X-Men: First Class\".  Was it high art?  Hell no.  Was it great fun.  Hell yes.  I might even see it again, and I don't often do that.",
      "total_reactions": 11,
      "user": "ccstone"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Everyone sounds so stupid on this page.  \"OMG Why would anyone like this movie?  They should've seen *insert less successful movie here* instead!\"  Its summer, its a comic book superhero movie, it had  a bazillion dollar budget just for advertising... you're right that pretty much adds up to \"lame movie\" however, they aren't even attempting to make genre changing, Oscar winning gold, they are trying to sell some tickets to a movie that costs a **** to produce.  Its fun, its entertaining, and the changes made from the comic book were necessary for time constraints.  If you have read the Green Lantern run that has been written by Geoff Johns the past few years this movie would satisfy your craving to see these epic space battles in live-action rather than on the page or in a usually bland reinterpretation on animated DVD.  This movie is easily one of the most entertaining superhero movies made and it sticks to the spirit of the book more than most superheroes even try to pretend they do.  Loved it.",
      "total_reactions": 15,
      "user": "DonDirkA"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Don't believe the haters.  If you like superhero movies, you will like Green Lantern.  If you don't like superhero movies, then you won't like Green Latern.  It's a good movie....maybe not GREAT....but a good movie.",
      "total_reactions": 17,
      "user": "DaleHeisch"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "A very good movie for a first run at this particular hero! R.R was the right choice. A good balance of action both in the suit and out. I look forward to number two!",
      "total_reactions": 19,
      "user": "MOVIETONE"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Don't believe the critics. This film is a lot of fun! Its got great action fun locations and a list of great characters as long as my arm. Going to a comic book film should be a fun experience at all times, it should be light and fun. This is that movie! Its only rival would be X-Men: First Class which is another great comic movie. Green Lantern starts off with some great adventure and will keep you entertained until the end. The special effects are a lot of fun to look at, and the 3D conversion looks fantastic. Its a must see for comic fans and fans of fun summer movies, because when it comes to summer movies this is head and shoulders above the rest!",
      "total_reactions": 16,
      "user": "batlantern_87"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Its good to see dc going in the same direction as marvel, this movie is what its supposed to be fun..a good popcorn flick worth seeing and worth buying when it comes out..",
      "total_reactions": 14,
      "user": "singingbatman"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Seeing the boyish image of Ryan as Hal Jordan was the major influence not to see the light of the lantern. However, even though Ryan brings to life Kyle Rayner, in my opinion, Green means a must go in my book! I'm more into the way a movie conveys a message. Especially in a comic book movie, we want to know how to be the hero of the day. Have some courage and check this movie out!",
      "total_reactions": 10,
      "user": "spilj"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Bursting onto the screen with a winning combination of action and dazzling effects DC Comicsâ",
      "total_reactions": 8,
      "user": "garethvk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "Disappointing. While the cast does a generally good job with what they are given, and the visual effects are pretty good, the dialogue is poorly written, the pacing sometimes suffers, and the movie tries to do too much in too short of time.",
      "total_reactions": 8,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Excellent movie... and 3D made it all the better. It was the best 3D effects I've ever seen. I really hope there will be a sequel. The end of the movie (after the credits) left room for one.",
      "total_reactions": 8,
      "user": "rocknrolz"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I actually really enjoyed Green Lantern and I might have to put that down to that I love comic book movies or the surprise of liking it even after reading bad reviews. I had no knowledge of Green Lantern history going in so maybe it helped coming in fresh. I was really impressed by the 3D and SFX. The fact that the lanterns can create anything just by thinking about it is so kick arse cool. Hal Jordan (a surprisingly good Ryan Reynolds) is likeable and I stuck with him.",
      "total_reactions": 6,
      "user": "allystew"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I honestly have no idea what the reviews are talking about, Green Lantern was amazing!",
      "total_reactions": 6,
      "user": "EliteF50"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "This is nothing special, hell, mediocre at times. However, I left entertained enough to like it, if even a little. If only for the charm of it all, especially lead actor Ryan Reynolds, who manages, while of overall less quality, to dominate the film like Kenneth (last name here) did in Thor.",
      "total_reactions": 6,
      "user": "akelz7"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "This movie won't make you think however it has a solid story and solid acting. If you are a fan of the comic book this is a must see, for the general public overall its not a bad movie.",
      "total_reactions": 6,
      "user": "cabrita"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "This movie could have been so much better. There was to much talking, not enough action. I got bored. Go watch '' X-Men : First class '' instead, it's a way better superhero movie. At first, I didn't really think that Ryan Reynolds was a good choice for the role. After seeing the film, I finally thought he's okay as Hal Jordan. I expected more from '' Green Lantern \". It wasn't good has I thought it will be, but not as bad either. It's a mediocre movie that almost touch the '' failure '' zone, in other words, the red zone. I wouldn't consider seeing it again, like never. I wanted to see Hal using the ring more often. Speaking of rings, I would have also enjoyed seeing the other Green lanterns using their ring as well. All they do is point it in the sky and shooting green laser or whatever. I don't have much to say about the movie, expect the fact that it's a disappointing, boring and forgettable movie.",
      "total_reactions": 6,
      "user": "scrieciu"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Fact: Green Lantern has a history spanning over four decades and DC tried to cram a lot of it into a 2 hour flick. Is it any wonder then that the content seems a bit rushed or compressed? I think not, yet consider it a foundation movie. Okay, many DC Hal Jordan fans will probably not appreciate some of Hal's ring constructs. Hal never used complicated machinery like mini-guns or Anti Aircraft guns, but at least they kept to the more contemporary treatment of overcoming fear rather than the original fearless concept, definitely more believable! The more missing bits for me were more the camaraderie of the Corps, they have always been something like the Musketeers, all for one and one for all. Still they did come save Hal from burning up in the sun, too little too late for me personally. If you are not a rigid fan of the comics you can appreciate the struggles of the Hal Jordan that suddenly and very unexpectedly is handed over such power. You can even root for him as an underdog against the somewhat condescending alien species who look down on the young emotional humans. But they got one thing right, though often doubting, Hal never gives up and fights for his friends, the world, and yes also the universe. Sinestro, Kilowog, Tomar Re, and Abin Sur were well portrayed and most comic book fans would appreciate that but have wanted to see more. The final scene was classic Sinestro and well positions the sequel in what could become a great franchise if they don't try to cover so much in the next movie. 53 million the opening weekend may make the sequel a reality and if so they need to have a stronger plot, more Corps camaraderie and more character interaction between Corp members that somehow manage to unite in purpose despite such diversity.",
      "total_reactions": 6,
      "user": "Willstarr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "This movie does not deserve the critic reviews that it has received so far.  It almost seems that the reviews are paid by Marvel studios!  Special effects were excellent!  The 3D was arguably the best executed since Avatar. Even Thor looked fuzzy and out of focus compared to this movie.  The story could have been better and the pacing was off and that means this movie will not win an oscar but i never tried to.  This movie is meant to be family fun while managing to give GL fans many of the things we wanted to see. This movie does not bastardize the concept or the story that was developed over so many years in print. I give this movie a 10 to make a point. It does not deserve a 10 not does it deserve the current critic score of  39. IMDB has it right.  These ratings just go to reduce my trust in  metacritic and rottentomatoes reviews.  Go and Enjoy the film.",
      "total_reactions": 6,
      "user": "ChuckingRocks"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Books often don't translate well to film. A good writer can make it work. The acting in the film is fair, but no actor can transform a bad script into a good film. Those who chose the script should be hit with the bill for failed sales at the box office. Their opinion of the public verges on contempt and therefore the public shows its contempt by ignoring this trite effort at cinema.",
      "total_reactions": 4,
      "user": "RingtailCat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "I was surprised how good this film was. First, you have the \"professional critics\" saying that it's a bust and then, the users? I walked into the theater expecting Fantastic Four! It was legitimately well done and brilliantly written! The weak points were the score (I couldn't hum a single line from the film if you asked me to right now. It's very forgettable.), one line delivered by Hal's friend (\"But doesn't the hero always get the girl?\" The audience just sat there, confused. It was completely out of context and made NO sense.), and the apathy the audience is supposed to feel for the Dr. He may have wanted the girl, but I'm not sure I believed that. Also, his dead was a little underwhelming. The movie gets very \"real\" in a couple of parts...and they are both believable. Reynolds has always been a phenomenal actor, but he really shines here. These people tearing the film apart were in a bad mood. They had to be. Of course...these are the same people who told me Thor was a good film. Ha. You will enjoy it. I can almost guarantee it.",
      "total_reactions": 4,
      "user": "JacobIsHollywoo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Yeah critics shame on you. I really liked this movie. Critic's are fools and trolls and shouldn't be trusted. Make up your own mind and support a good movie. I mean i thought Thor was awesome, but i still think Green Lantern deserves way more credit. I saw no problems with the plot at all other than changes that they made from the comics which is always expected from Hollywood. Ryan Reynolds acting was good had a good story and he wasn't annoying like as Deadpool in Xmen.",
      "total_reactions": 4,
      "user": "Codeman03xx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I was looking forward to this moving for a long time, then I started seeing the critic reviews rolling in and my balloon began to burst and I was not sure if I was even going to spend my money to see it. Obviously I did, and mainly because critics, the majority of them, suck. They are too full of themselves to enjoy a good movie. This movie was fun. It was a great superhero flick, and I am glad I went to see it. There was no bad acting, nothing to speak of takes you out of the fiction of the movie. Go see it in 3D if you can.",
      "total_reactions": 4,
      "user": "erikkennedy777"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "There is a fine line between a good movie and a great one â",
      "total_reactions": 4,
      "user": "Pontificator"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Green lantern was a wonderful comic book movie come to life after all these years. it was brilliant & bold to use the cgi effects to give an Epic action sequence, including the costumes. Hectors mutated head was very realistic, and Parallax even more deadlier  than the comics.  This is an all entertaining movie for everyone.",
      "total_reactions": 4,
      "user": "poori"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "I may be one of a select few people, but I don't listen to reviewers to decide what I watch. In fact I HAD to create an account just so I could further prove why I'm glad I don't. Everywhere the critics have it voted worse then I have ever seen a movie rated. Yes it had some minor flaws, but I still don't believe it deserved HALF of the brash words it received.",
      "total_reactions": 4,
      "user": "AtlantisSRT4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "I saw this movie (in 3D) with two friends of mine... et we loved it ! I say there are a few flaws in the script, but it's not that important. And... It's what \"I\" wanted to see in the fist place. Great action, great fun !!! I can't wait to see what they will with Sinestro in the second movie... LOVED the whole thing ! G-R-E-A-T !",
      "total_reactions": 4,
      "user": "BaronLeMarquis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "How there can be such huge fans of Harry Putter and say this movie wasn't great is beyond me.  Funny, action pact, awesome special effects, great message that wasn't environmental.  Great movie for the whole family.  Thank goodness for finally a great comic book movie since Iron Man 1!!",
      "total_reactions": 4,
      "user": "JasonVB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "O.k. Hal's transition into Green  Lantern is a bit,unrealistic,Yes, I know it's a \"Movie\" about a \"comic book superhero\",but I believe the purpose of the theater  is to turn fantasy into reality...so at least allow the characters to be a bit grounded towards reality. However on a whole, the movie was awesome and yes I would recommend it......",
      "total_reactions": 2,
      "user": "DerHasherman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "i think some of the criticism was very harsh indeed. Ok it is no masterpiece but it's very entertaining and has decent humour. I think the problem was with the plot and the lack of real enemy. Also the whole idea that ou can create any weapon you like it's too easy and maybe not too interesting on the big screen. Regardless I would like to see a sequel.",
      "total_reactions": 2,
      "user": "Morituri"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "I don't know what to say, this movie is so bad, all i'm going to do is give it a zero ratting and urge you not to waste your time.",
      "total_reactions": 2,
      "user": "9TwistedRoses"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is a lot better than what many critics are trying to make it out to be. I am a fan of the Green Lantern super-hero idea (and not just because my favorite color IS Green) but because of the fact that the powers of a Green Lantern is that while a chosen one wears the green ring, he and/or she and/or it can create virtually anything they can think up of in their mind. The character designs, C.G.I. and special effects were all amazing, and the actors/actresses' who made up this movie all played their parts to perfection! Comic book fanatics will be especially pleased, as this movie explores in great detail, the origin of one of the greatest Green Lanterns (some would even argue the BEST Green Lantern ever) known as Hal Jordan. If you want to see action, romance, and humor in a comic book superhero movie, than this is a great movie to see! :D And a sequel is definitely not out of the question, I recommend checking it out to see what I mean. I thoroughly enjoyed it and I highly recommend it! :idea: Enough said! ;)",
      "total_reactions": 2,
      "user": "4EverGreen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "bad script and bad acting makes it a failure...........................................................................................................................................................................................................................................................................................................................",
      "total_reactions": 2,
      "user": "rockerZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "If you loved the comic book series, then you will totally get this film.  All others, just go find something else to watch.  The 3D version of this film was actually a worthwhile endeavor as opposed to being a distraction like so many other movies with the word 3D tacked onto them.  Not destined to take in as much as most Marvel efforts, this DC Comics movie still does the Green Lantern mythos proud.  I'd rate this as a strong contender for your matinee dollars and a reserved recommendation for your evening greenbacks.  Enjoy and let darkness fear your might.",
      "total_reactions": 2,
      "user": "Finnatic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "Being a lapsed GL fan, and a forgiver of much (I even found merit in the Electra movie) I went into this with my mind open. Sadly it would take a professional safe cracker to open it enough to allow for the fact that this utter, complete, total, rancid and appalling thing cost between 200 and 300 million to make. I suspect that money was spent mainly on pushing this on the masses and what was left was split between Ryan Reynold's fee, fizzy drinks and sweeties for the 5 writers. My brain actually boggles that this was passed by WB as something they could put out.",
      "total_reactions": 2,
      "user": "lead_sharp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "Comparing this movie to other superhero movies its BAD. Bad Dialogue, just bad. Good scenery though i'll give them credit for that. This movie is so bad I can't even write a bad review. Read another bad review and that is how I feel lol.",
      "total_reactions": 2,
      "user": "Princess_Peach"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "The Green Lantern is my favorite DC comic book hero, so you can imagine my excitement as I sat down in the theater. Superhero movies always have a lot of potential, The Green Lantern included, needless to say, I was disappointed. Ryan Reynolds delivered an expressionless, boring character and was not fit for the role at all. Not just Ryan Reynolds though, all the actors do a depressing job at portraying any sort of emotion at all and most perform terribly at their roles. A cliche superhero plot is to be expected, but, unlike some films, this movie had no twists or surprises, and overall failed to impress. The special effects could have been much better, but were satisfactory. The action scenes never reach extreme excitement or explosive fun, but are still good enough to keep you interested. Everything felt rushed; some actually good scenes were cut off too quickly, the final battle came far too fast, and the whole movie I was hoping that one character would stand out and become defined, but alas, they never did. A disappointing superhero movie to say the least. For a superhero movie, this one is rushed, boring and sub-par.",
      "total_reactions": 2,
      "user": "Jman4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 3,
      "text": "This was not a well conceived film.  So much has already been said about how this that I'm not going to pile more on.  Instead I'm writing this as a request to future superhero filmmakers.  Please try a little harder to take into consideration the age of the mythology.  Green Lantern has been around since 1940.  That's a full 70 years before anyone thought to put the story on film.  That means that if his first fans are still alive, they're in their 80's.  Have a little more respect for people's memories.  Spend some time on the writing, put aside the egos and let the writers who have talent and are fans of the subject weave the reasons for that love into the story.  There are thousands of superhero stories out there and most of them are rightfully forgotten, so the few that stand the test of time have something that has been speaking to people for generations.  Find that truth and make it the foundation of every thing the story communicates.  And THEN make it look really cool.  Also, yes there is subtext, but these are also comics not Shakespeare, so you don't have to bury that too deep.  Story first, then merchandising opportunities or whatever else the suits are making you squeeze into it.  This film was clearly made for junior high kids, and that's about money, we get it.  But throw us 30, 40, 50, and 60 year olds a bone.  We want to be transported too.",
      "total_reactions": 2,
      "user": "skantea"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Green Lantern is so much better than so many other films that have been released recently I expected schlock from all of the negative reviews but I found it to be fun, visually engaging, and the characters interesting,and likeable.  This is NOT A BAD MOVIE.  It is not perfect but it doesn't insult your intelligence and isn't ultra violent like most.  I seriously don't understand the bad reviews it didn't deserve it.  This was way better than Transformers- all of them. Also better than the Jar Jar Binks Star Wars atrocities.",
      "total_reactions": 2,
      "user": "cleverwabbit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "This is a great example of a non-Nolan DC film, it stinks and its quite horrid. Superman Returns also joins this list. So therefore, the High Council of Film should pass legislation that Christopher Nolan should do all the films for DC Comics, even as a producer, because he'd still have power over the film. These are just my comments, but below is the review.",
      "total_reactions": 2,
      "user": "Eric_Levengood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "This movie is very watchable and entertaining for a superhero movie. The special effects look expensive and the acting (esp Ryan Reynolds and Blake Lively) is decent. It makes for an excellent eye-candy piece, especially if you buy it on blu-ray. However, as a faithful interpretation of the Green Lantern lore, I found the movie to be merely okay. The director obviously knew where the characters are generally going to end up. The teaser at the end is very accurate of the character's (Sinestro) fate. However, the movie focuses too much on the character of Hal Jordan and not enough on any of the other green lantern corps members. We never truly get into Sinestro's head or realize what a brute badass Kilowog really is. Overall, I thought Green Lantern First Flight was a far more enjoyable origin story for Green Lantern, even though it is animated. I think 10-20 years down the line when they make a new Green Lantern, (assuming this one does not receive a sequel) this version will be the equivalent to tim burton's Batman being compared to chis nolan's Batman Begins.",
      "total_reactions": 2,
      "user": "charles_barkin"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "This movie is a horrid, wretched, and miserable experience. The movie is full of superhero movie cliches, it contains a bland writing, Ryan Renolds (an overall decent actor) looked totally oblivious to what was going on in this movie, the supporting cast, with the exception of Sinestro, is basically nonessential to everything going on, the special effects range from average to outdated, and the production as a whole is sloppy. The movie acts as if it doesn't care so why should we?",
      "total_reactions": 11,
      "user": "Metalhead"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I am pleasantly surprised, after reading numerous critical reviews that trashed this film, to walk out of it feeling as if it was a pretty good way to spend about 2 hours of my life. This film isn't going to win any groundbreaking Oscars, such as Best Movie, but it sure did entertain me and left me with a pretty good feeling. Sure, there were some moments that felt off but all-in-all, a solid collection of performances and some intriguing special effects kept this film from falling into the \"Worst Super Hero Movie\" category. It had a whimsical charm to it and there was a decent amount of tension as well. Ryan Reynolds did a fantastic job with the role he was given and Blake Lively did not disappoint as his love interest, mainly because she was not the damsel-in-distress type... well, sort of. The other world was cool but most of the fun stuff happens on Earth. Actually, this film kind of reminded me of Thor in how the different worlds are presented (theirs more colorful compared to our earthy pallet). Its villain (Peter Sarsgaard) was a little underused which is a shame because his performance was quite creepy. Angela Basset was good but criminally underused while tim Robins was snarky and suave. The script could have used some tweaking as that was perhaps the weakest link in the film but it wasn't horrid enough for me to think \"this is total crap\". It kept me entertained. In this regard, Green Lantern did its job.",
      "total_reactions": 9,
      "user": "gemini0577"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "No one was anticipating this movie like I was - I've been a GL fan for forever. It was a complete and epic letdown.  Though it looked very much like everything I had ever envisioned a GL movie to be, it never elicited any emotion from me other than embarrassment for the squandered actors delivering some of the worst dialogue imaginable. But that dialogue is extremely forgivable however, considering the genre.  Flash Gordon has some of the worst dialogue in movie history, and it is head and shoulders above, in terms of forgiveness. It's the complete lack of any solid action that damns this adaptation to a place where some of the worst of comics-to-movies go to die.  I thought at the very least, Martin Campbell would take me to the edge of my seat with action sequences like he did with Bond. I was lulled to genuine boredom by them.  The only thing this movie managed to do was dull some of the pain away from my previously-huge disappointing memories of The Phantom Menace and G.I. Joe.",
      "total_reactions": 10,
      "user": "tompaine"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "As I've said many times before, it's all about expectations. I didn't expect a ton from the movie, especially after many of the critics panned it, so I was pleasantly surprised by it. No, it's not high art - it's a comic book movie. But I felt more emotionally engaged in than I did with Thor and many other films of this genre. Reynolds is solid, and the relationship between him and his scientist \"nemesis\" is much more tangible and human than many comic book conflicts. There are sympathetic feelings going both ways before things get perverted. What's more, while it's a little cheesy, the will vs. fear conflict is very Romantic. The physical manifestation of the human feelings is something that Nathaniel Hawthorne likely would have found interesting. I enjoyed it. Blake Lively wasn't as bad as many in my theater would argue, but there wasn't enough chemistry between her and Reynolds. Yes, they are exes and mere colleagues now; However, there is more heat between cop partners on TV procedurals than there is here. So for me, it's better than Thor, Spider-man, the new Superman, and the Hulks, but not as good as either new Batman film - though that's a high bar.",
      "total_reactions": 10,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "If u r a complete bore with no friends or sense of humor DON'T go see this movie as no one wants to read your post crying like a baby about how \"Your\" version of the movie wasn't met! This flick was an awesome roller coaster ride that was never a dull moment and had some of the most gorgeous visuals of late. I love all the comic book movies that have come out and this one has made me a fan of the Green Lantern. Go support the studios!",
      "total_reactions": 5,
      "user": "Roberticus2009"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "The Guardians! The Parallax! Ryan Reynolds lost Scarlett Johannson for this mess! I certainly hope Ryan cashed a hefty paycheck and was, in fact, fooling around with Blake Lively. Blake, by the way, is the best part of this movie. Ryan also has another problem. He has a baby face and a feminine voice, definitely not super hero material. The special effects are fine but if you have a choice (I didn't at my theater) skip the 3D, it's not worth the extra 3 bucks. The plot is disjointed and really bad even by super hero standards where we tolerate a lot. Some decent actors (e.g. Peter Sarsgarrd and Tim Robbins) also give lackluster performances and I am still trying to figure out why the Dr. Hector/Senator Hammond subplot was even inserted into this movie. The age old adage \"If you buy the premise, you buy the bit\" just doesn't work here and half way through this movie I was looking at my watch trying to figure out when the 105 minute running time would let me out of this cinematic mistake. Save your money and cross your fingers that Captain America does a better job with the super hero genre.",
      "total_reactions": 5,
      "user": "MajorBob"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "After all the critic reviews I thought the movie would really suck but I found myself thoroughly entertained.  The plot is not the strongest ever, but the visuals are amazing and the movie was fun. Go in with a light attitude and you will probably enjoy it.",
      "total_reactions": 5,
      "user": "dragungurl"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Definitely worth watching if you're a fan of Green Lantern, but they tried way to hard to cram as much Green Lantern fan service as possible. The whole sequence with Kilowog and Sinestro training Hal prove this. Kilowog shows up, calls him a Poozer, punches him in the face, then leaves. Sinestro calls him weak, humiliates him, then leaves. They should've either went all the way with the training, or had it in the next movie. The actual plot was pretty straight forward. Nothing fancy, but it worked.",
      "total_reactions": 5,
      "user": "aMonkeee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "I was expecting an absolutely terrible, painfully cheesy comic book movie, and I ended up genuinely enjoying it.  What makes this movie is the visuals - if you have any interest in incredible 3D and special effects work, then you will definitely get your money's worth.  However, be warned that every single romantic scene, as well as a handful of others, are PAINFULLY CHEESY.  Let the cheese do its thing, let the visuals blow your mind, and I bet you'll enjoy it too.",
      "total_reactions": 5,
      "user": "WeAreOne"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Going into this movie with an extensive knowledge of Green Lantern comics history and characters, and having followed previews and reviews of the film, I had been quite concerned. Initial trailers and previews had looked uniformly uninspiring at best.  Also, the choices of Ryan Reynolds and Blake Lively for the film were areas of some concern to many fans of the original comic source material, who doubted whether either performer would be capable of projecting the level of depth and gravity that appeals to modern comic fans familiar with the revised and modernized source material largely created by the film's Co-Producer, Geoff Johns. Finally seeing the film in 3D at my local theater, I was pleased to see that many of my concerns were either unfounded or overwrought. Reynolds and Lively both delivered adequate performances, though at times both suffered from a bad case of \"I'm reading my script now, and it says to say this line with emotion!\"-itis. The film's computer generated graphics were largely competent, with a few stop-motion style artifacts in some scenes that were likely exaggerated by the 3D process.   As fans had actually suspected from early in the process, Mark Strong's performance as Corps member Sinestro was a particularly bright spot in a film that needed them.  On the other end of the spectrum, Peter Saarsgard does his best to channel John Malkovich, turning in a performance just so over-the-top as to fit in right at home in a movie based on comic books. Unfortunately, it's difficult to tell whether the problem with Saarsgard's Hector Hammond is with his portrayal, or the writing his character endures. Angela Bassett turns in an excellent performance as Amanda Waller, who seems to be given a far smaller role than the history and depth of her character's comic incarnation but almost seems to be there in order to offer a way to tie in further characters and background with other possible sequels or connected films.",
      "total_reactions": 13,
      "user": "TellarHK"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Definitely not as horrible as critics believe. The story was poorly presented at times and you can't help but feel that Jordan's fellow Lanterns were not present enough. Sinestro was definitely not used enough although I think Mark Strong did a great job with the script he was given. There could have been more action  and fight scenes felt stunted when they were on screen. However, solid acting with the given script and good effects, I would definitely recommend this to a fan of comics.",
      "total_reactions": 8,
      "user": "McAdooZ"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "Green Lantern is simply disappointing.",
      "total_reactions": 11,
      "user": "Leeway"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 2,
      "text": "Don't expect this to be a movie that actually moves you or makes you think, like fellow DC comic book blockbuster The Dark Knight. Instead, bring a bag to barf in when the words fear and/or willpower are mentioned three hundred times in a blurred montage of vague green colors, poorly written dialogue, and Ryan Reynolds' ass. Go with friends for a cheap laugh.",
      "total_reactions": 18,
      "user": "WhiteCannon"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "This movie was trash. The fact that the actors in the movie are big names they still messed it up. The movie was worse then Batman and robin or Spiderman 3.  IMO. A trash movie. DONT WASTE YOUR MONEY.",
      "total_reactions": 9,
      "user": "Coolguy45"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "What were the critics thinking? I loved this movie. I liked the story, acting, special effects, I really loved this movie. I went to see Super 8 last week and didn't think it was near as good as this movie. It was just like the comics that I grew up reading. All I can say is if you read the Green Lantern back in the 70ies like I did, then you are going to love this movie. The guy playing Senestro looked just like him! Don't listen to those stupid critics, go see this movie.",
      "total_reactions": 6,
      "user": "manwe7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "After the bar has been raised for superhero movies in the past few years, Green Lantern just doesn't measure up.  The fimmakers made no attempt to rise above rank mediocrity.  At every level, this movie feels like it was phoned in.",
      "total_reactions": 3,
      "user": "AtomicSwirl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Many people have given it bad reviews but what i feel is that it is a good film which lacks action but got every other element a superhero movie should have. it has a good humorous moments which is new  for a super hero film and is interesting. if you like the visual effects in avatar then this film provides u that. the only n important factor this film lacks is good action which they showed it but was found short to be considered a action film. so overall it is good film not great but everyone should watch it at least ONCE. i think the ending was amazing if u liked the ending of usual suspects then u will love it. so HOPEFULLY the sequel to it will be better.",
      "total_reactions": 3,
      "user": "haa123"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Wat a pile of crud.  And now the studio wants to give us a sequel!  the trailer was good, but that was the only thing that was.  Honestly wanted y money back.",
      "total_reactions": 7,
      "user": "Bart"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Even though the film tries it's hardest to be serious, it's not. The amount of CGI a low fueling plot lines make this film a dumbed down pointless mesh of superhero nerdiness. The acting is great but the story or lack of make this film unbearable for some.",
      "total_reactions": 8,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "Green Lantern proves an entertaining, but poorly thought-out film. The movie contains visually captivating scenes and some humorous segments, but the film is afflicted by a slow-moving plot and conspicuous plot holes. Green Lantern kept me well entertained, and I do not regret paying the ticket price to see it; however, the quality of the movie is undoubtedly poor and it could have been a much better movie had the writers decided to present a story that did not constantly skip around and make little sense. Moviegoers expecting a top-notch Green Lantern film adaptation will be disappointed; those seeking an entertaining movie containing superheroes and fighting sequences will most likely enjoy it.",
      "total_reactions": 4,
      "user": "Go_Army"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Being a Ryan Reynolds fan, I was determined to see the film no matter the poor reviews.  Maybe it's because my expectations were low, but I was entertained.  It isn't perfect.  Some of the dialogue is clunky, and it follows the standard superhero formula, but it has some humor and great special effects.  Strange to me that the critics loved the Spiderman movies but don't like this one.  Spiderman was also formulaic, but I think Ryan Reynolds makes a better super hero than Tobey Maguire.  All super hero movies follow the same formula, just like all romantic comedies follow the same formula, so I think critics are starting to get bored at super hero movies.  I get that.  I'm also hoping they come up with something original for the inevitable sequel, but this film was passable.",
      "total_reactions": 4,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "I normally dont agree with the critics at all but i have to say they are spot on with this movie. I give it a 4 because these types of comics are very hard to make into a film. It seemed cheesy to me. Ryan reynolds isnt the best actor in the world which i think we all know but he was funny and he fit the role of hal jordan/green lantern well. He has that **** attitude like hal and he has the body frame for the green lantern. The movie just felt short and rushed. I felt as though you saw the entire movie in the trailer. I actuallyy fell asleep a couple of times during this movie, although i was tired and i saw the midnight showing, but the movie was pretty boring at times. If they do make a sequel i suggest they make it more epic like every comic book film should be. Create a stronger story, more action and certainly make the climax extended and epic, because the ending to this film as well with the whole movie, was awfully rushed. Overall the acting was sub par, not nearlyenough action, whole film was rushed but i give it a 4 because the comedy was definite,y there and Blake Lively is super hot in this movie. 4/10",
      "total_reactions": 5,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "I was kinda disappointed by this film. I thought that it would be as awesome as films like Iron Man and The Incredible Hulk but this movie never turns into anything more than a visually exciting movie. The villain is portrayed very good by Peter Sarsgard. Martin Campbell has made many better films like Casino Royale and The Mask of Zorro",
      "total_reactions": 5,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "I might be overly complimentary giving it this rating. I love Ryan Reynolds. I'm excited about him being Deadpool. But the combination of he and Blake Lively who are clearly here for eye candy, along with dialogue that makes the Fantastic Four series seem like Citizen Kane, cannot sustain the brilliant effects and perfect representation of the Green Lantern Corps and backstory. As a comic fan, they did a GREAT job with the Green Lantern aspect. But Ryan and Blake + awful writing = MEH.",
      "total_reactions": 6,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2011
      },
      "score": 0,
      "text": "I'm a big fan of the superhero movie genre. I grew up on comic books. I don't expect movies to directly channel the comic books; there has to be some allowances for the different medium. I thought Daredevil and X3 were decent movie fare.",
      "total_reactions": 7,
      "user": "cajun67"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "When it's good, It's amazing. But when it's bad, Green Lantern is painful to watch. The movie is incredibly unfocused in the beginning and introduces numerous characters who're never expanded upon or mentioned again. To make matters worse, this film has barely a drop of acting talent for almost the entire live action cast. Ryan Reynolds does a decent job, along with Mark Strong who does a fantastic Sinestro. And the CGI aliens are brilliantly portrayed. But just about every scene on Earth is painfully boring or stupid.",
      "total_reactions": 2,
      "user": "Kalas74"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "This is only an OK superhero movie. It is incredibly noisy, it is over produced, and the acting is nothing to brag about. The special effects are amazing, as to be expected. I was incredibly disappointed by the final battle between the Green Lantern and whatever the villain was.  The battle ended rather quickly and in a cheap way.  There was a lot of stuff introduced in the film, such as his father's death, that did not get explained. The best part of the movie was Geoffrey Rush as that fish like being. He was also the narrator, and he has an awesome voice, so that was nice. Overall, it is not a good movie that is also a comic book, such as The Dark Knight, and it is not a good comic book movie, either. If you are a fan of the Green Lantern, see it, if not, and you want to see a superhero movie, see a better one. I recommend X-men: First Class, or Thor, both of which are far better.",
      "total_reactions": 3,
      "user": "AtTheMovies"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "It's not awful.  It's not great.  It's just very middle of the road.  If they were to make a sequel I'm sure it would be much cleaner and more entertaining.  These franchises always have to build an understanding of a character in order to move forward with a story.  And G.L. is more than a high school kid being bitten by a spider, or a rich guy buying gadgets.  So it's a little dry to start.  But it's ok.  Ryan Reynolds needed to be more Ryan Reynolds and have fun with it.  But he's not awful.  Some of his dialog is cliche for sure.  It's summer popcorn movie.  I have seen far worse this year.",
      "total_reactions": 3,
      "user": "LeahAndNic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "I can't agree more with DaleHeisch. Those who hate it, don't understand the genre. The makers of GL made this one for the fans. As a comic book fan myself, I enjoyed the subtle visual homages to the comic art style employed throughout the movie by the photography direction. I don't want to spoil anything, for those who have the keener eye but there is one shot in particular that I found fantastic. The Green Lantern story is all about Hal and so it is in the movie. I found the movie to be a lot of fun and terrific to watch in 3D.",
      "total_reactions": 3,
      "user": "MrDLandreth"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "I like cheesy movies. That being said, i was a bit disappointed in this film. Sure movies from certain source material aren't always 100% true to the story, but when watching this movie i asked myself a few times \"What's happening again?\" I've read the Geoff Johns comics multiple times, so part of the disappointment was my fan factor. But i really enjoyed X-Men: First Class, and i don't know much about that universe. I think my biggest disappointment was Ryan Reynolds, I was really pulling for him and i don't think he pulled through for me. If you don't know much about Green Lantern give this movie a chance, it isn't terrible. But if you're a DC fanboy, you may want to wait for rental.",
      "total_reactions": 2,
      "user": "GmKyban"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "Ryan Reynolds brings his deadpan comic charms to the superhero genre. He's given super powers to create cartoon weapons from his imagination. He's also plagued by self-doubt and a dead father. If it sounds like standard stuff for a superhero, you're right. The effects are convincing and it moves along well, but nothing about the film is particularly original or exciting. NOTE: Stay thru the first round of credits for another predictable postscript.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "R.R does it again, he was perfect for the role. I love comic movies and GL is an old favorite of mine. The movie started off really good but slowed up fast. The movie goes by the rule your power is the limit of your imagination, but the writers really didn't follow that well, The 3 small fight scenes where cool but way to short. Overall the movie wasn't bad the acting was awesome the special effects where too. But it seemed to lack action and the imagination like GL has. I hope the second one is better.",
      "total_reactions": 3,
      "user": "DrMovie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "Not bad., but not great I probably liked this one a wee bit better than Thor, which isn't necessarily high praise since I thought Thor was average. The critics savaged this film and I can certainly see where the harsh reviews were coming from, but it wasn't all bad. This is summer popcorn fluff. Yes, the dialogue is cheesy. Yes, the love story is tired. But it wasn't the worst movie ever. I do question the need for Hector Hammond. The actor was fine, but I've always thought he was a lame villain. Odd choice for a starter.",
      "total_reactions": 2,
      "user": "bjmorga"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "I went into \"Green Lantern\" without any expectations, despite the terrible reviews & the fact that I've been reading the comic for over fifteen years - I was just happy to finally see one of my favorite superheroes brought to life. Somewhere around the twenty-minute mark, I actually thought, \"I wonder what all the negativity is about; this is actually pretty entertaining.\" What followed soon after that thought extinguished my feeling of hope.. The worst scenes are the ones that involve the romance between Hal & Carol Farris as the majority fall flat & are even cringe-inducing at times. One scene is especially bad & I couldn't help but think, \"What is this, 'Top Gun'?\" Although Carol is an important part of the Green Lantern mythology, it feels like much of her relationship with Hal is shoehorned into the film in order to draw a more varied audience.. However, my biggest problem with the movie is not the romance, but how little time is spent away from Earth. In my opinion, the off-world scenes are the most enjoyable parts of the movie, but they feel squandered amongst the rest of the film. Without spoiling anything, a lot of the plot-lines feel incomplete, while the amalgamation of important chapters of the comic book mythology feels like a wasted opportunity to paint a bigger picture of the Green Lantern universe that could have easily been expanded in sequels stemming directly from concepts introduced in this movie. Example: I can't help but wonder what purpose, if any, Angela Bassett's character will serve as her role in the comic book world is an important one; maybe she'll be the Nick Fury of DC movies..? Casting: Besides a few good moments, Ryan Reynolds just did not fit as Hal Jordan. If he were playing Booster Gold, I'd be singing a different tune.. As for the rest of the cast, Mark Strong is excellent as Sinestro & Peter Sarsgaard is very effective as Hector Hammond. Overall, I didn't think any of the acting was bad; the writing is what keeps \"Green Lantern\" from becoming anything memorable.",
      "total_reactions": 2,
      "user": "Moniker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "People liked the Star Trek film because it wasn't a Star Trek film, it was an action film based on Star Trek. People hated the Green Lantern film because it was a Green Lantern film, not an action film based on Green Lantern. If you like plot, mythos, and cool concepts, you'll like this movie. If you came just too see things hit with a big green hammer, you'll be sorely disappointed.",
      "total_reactions": 1,
      "user": "MapNinja"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "I paid $32.67 for a XBOX 360 and my mom got a 17 inch Toshiba laptop for $94.83 being delivered to our house tomorrow by FedEX. I will never again pay expensive retail prices at stores. I even sold a 46 inch HDTV to my boss for $650 and it only cost me $52.78 to get. Here is the website we using to get all this stuff, BetaSell.com",
      "total_reactions": 1,
      "user": "kerri112"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "A completely mediocre movie. The movie relied on its constant barrage of special effects and minimized on the plot. The villain in the movie is a diarrhea cloud and isn't even slightly scary. As far as super hero movies go, there is nothing special here.",
      "total_reactions": 1,
      "user": "fistobuizel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "The Green Lanterns powers are based around his willpower and imagination, so why then did this movie lack imagination? While I did enjoy it at the time, afterwards once I got home and started thinking about it, it wasn't that great, actually. I'd watch it, but I probably wouldn't pay to do so.",
      "total_reactions": 1,
      "user": "Spawnah"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Don't listen to the critics. They were probably expecting another \"Batman Begins\", were disappointed because they instead got something more kid-friendly, and overreacted about. Well, except for Armond White, who thinks Green Lantern, X-Men: First Class, and Thor are racist. Green Lantern and Thor are NOT racist, and I haven't seen First Class, but I'm 100% sure it's not racist either. Okay, back on topic. This film is entertaining, fun, and refreshing. It did feel rushed at times, although not as much as Spider-Man 3, and out of the two, Green Lantern is the better one. I was disappointed in Parallax, who looked fake. Green Lantern's CGI mask still looked very fake. As itsjustsomerandomguy's Magneto said...... are they gonna be done with that thing before the blu-ray comes out. Well, everyone should be glad it wasn't as fake as the shark in \"Jaws: The Revenge\".",
      "total_reactions": 1,
      "user": "Alecino"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "I left this movie feeling pretty good.....and then I thought about one of things I liked best about it - the 3D effect.  As far as superhero movies go, this one delivered.  As for something new and \"uninvented\"...not at all.  This was pretty much the superhero meets girl, girl falls in love with superhero, girl finds out uninteresting guy she knows is superhero.  Don't dare see this without the 3D effect....you may be \"green\" with envy of those who did.",
      "total_reactions": 2,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "It's another Marvel film but it wasn't a good one like Captain America I like seeing Ryan Reynolds and he was trying to give a good job in this movie so it is not his fault for the bad review. It not a movie that you should go out of your way to watch. Just wait till it comes on T.V. or go if someone offers to buy your ticket.",
      "total_reactions": 1,
      "user": "BenIsThisGuy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I'm a huge fan of green lantern and this movie certainly didn't disappoint me at all. It had great 3-D, ryan reynolds was perfect for the part. The guardian's of the universe looked great and there was some amazing action. It was kinda weird that yellow wasn't a weakness but whatever.",
      "total_reactions": 1,
      "user": "lukesnook"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "I actually liked the movie more then the reviews led me to believe I would. I mean... you start out with the big fighter dogfight in the skies and I was like, yeah hey, this is uh, this is alright. It kinda reminded me of the F22 dogfight in Iron Man, and that was a pretty good high-flying action scene. Well here, they're also flying around in fighter planes and it's all cool looking and kinetic. I enjoyed that.",
      "total_reactions": 1,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Fun superhero movie, very true to the original comic book and great (corny but cool) comic book stories of its heyday.  I read this series as a kid and found this movie to be a worthy rendition --and a blast to watch.  There's nothing deep in this movie, just like the books that originated it, and thank goodness.  Performances are good!  Dialog could have used a little spruce but it served.",
      "total_reactions": 1,
      "user": "spacecaptain"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "There have been some awesome super hero movies that have come out, and Green Lantern has earned the right to call itself one of them, Ryan Reynolds does a fantastic job, as does the rest of the cast, I would have liked to see more interaction between Hal and the rest of the Lanterns, but that's a small complaint, and it does have some other minor flaws but in the end that doesn't detract from what is one of the best super hero movies of this year.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "The main problem with Green Lantern isn't that it's a bad movie. On the contrary, the vast majority of its elements work on film. The effects are superb, and different enough from the mainstream to stand out. The actors are also good in the vast majority - Ryan Reynolds is effortlessly likeable as our titular hero, and Mark Strong is as good as he always is as the fantastically morally complex Sinestro. The action is also extremely well-handled, with director Martin Campbell proving himself to be just as competent at handling special effects-driven filmic spectacle as with the practicall (as he demonstrated in Goldeneye and Casino Royale). The film fails in main because of its exceedingly daft source material. The Green Lantern comics were stupid even by super hero standards, and it would be nigh-on impossible for even the most accomplished director to bring this universe to the big screen with a completely straight face. Luckily, Campbell doesn't take things too seriously, and this results in one of the film's most pleasing moments, when love interest Carol Ferris (Blake Lively) comments on the ridiculousness of people not guessing Green Lantern's identity simply because they \"can't see his cheekbones\". Even this self-awareness can't save the film as a whole - the ideas behind this stupid universe aren't consistent or fully developed, and visual creativity doesn't stop Green Lantern from being ridiculous. The acting talent of such masters as Tim Robbins is almost completely wasted, and his relationship with estranged son Hector Hammond (Peter Sarsgaard) is woefully under-developed. Despite these obvious failings, Green Lantern remains an entertaining diversion, and a decent, if fairly hollow super hero film. Perhaps if a sequel is made, this intriguing intergalactic cop can truly step into the light...",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2012
      },
      "score": 0,
      "text": "Ryan Reynolds has officially ruined his career with this movie.  Until this point, he'd been a great comedy actor with some crossovers into drama & action.  The only movies of the comic-book inspired superhero genre worth seeing, in my opinion, are the revived Batman series of movies.  Even those are getting a bit campy with Bale's overly-dramatic angry whisper-delivered dialogue.  Hollywood needs new creative minds badly.",
      "total_reactions": 1,
      "user": "Pahn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Basically this is a movie about a guy who finds a ring and saves the world. That story dates back to like 1930 when comics first came out. This movie is filled with cheesy special effects and dated story. I was very surprised to find this movie was a total bomb. This movie is just terrible and I didn't like it at all.",
      "total_reactions": 1,
      "user": "MovieFan123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Story and plot wise the movie is pretty darn bland and very random. Events sort of just happen without any reasonable explanation or emotional connection. For instance in the beginning a Green Lantern dies, who is supposedly a great comrade to another Lantern, we no nothing about him and the other Lantern with a straight face is grieving for the lose. The event is also very confusing because we really donâ",
      "total_reactions": 1,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "I wonder why i still want to watch this movie. maybe it's just too infamous. for me reynolds still can fit to physical qualification of Jordan. And yes, i like the likeness of Sinestro. But everything else....it just...can be thrown out of the movie. The story...doesn't not engaging at all. All the corps doing nothing just making lamp through the space...just Hal...even Hal action sequences also feels boring and inconsistent. some of the battle he's weak, but he beat Parallax himself. Poor Hal, poor Sinestro, they deserve better.",
      "total_reactions": 1,
      "user": "garongoreng"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "Not so bad. I liked it and I would like to see it for a second time. Do not listen to the critics and watch it!!! You will enjoy it. One of the most underrated films ever.",
      "total_reactions": 1,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "movie was on TV the other night. I can't say I enjoyed this movie and the reason is the green lantern corp has too many chicken headed aliens and the scientist on earth deformed into some elephant man.  But I would like to see a more intelligent version.",
      "total_reactions": 1,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "There are movies willed to life by the passion of their creators, and there are movies like Green Lantern, which are willed to life strictly by market forces. Superhero movies are popular right now, no one had tackled Green Lantern yet, and voilà, here’s an adaptation that only the mouse-clicking digital artisans behind the effects shots seemed to give a **** about. Beyond the undigested lump of information about the origins and purpose of the Green Lantern Corps and a new rogue force threatening the universe, the early scenes are a marvel of CGI landscaping, presenting deep space as a shimmering Technicolor arena that pops like the pages of a particularly arresting comic book. Then the film comes down to Earth, repurposes Top Gun as a superhero story, and goes through the motions with a kid-friendly arbitrariness not seen since the last Fantastic Four movie.",
      "total_reactions": 1,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "While all the happenings in space is visually jaw-dropping and exciting, Hal Jordan's life on Earth is slow, unfunny and uninteresting. Main characters lack development and vital plot points are practically breezed over. This is a fault of the movie's short length, bearing under two hours long. Not bad, but you could spend your time on better stuff out right now.",
      "total_reactions": 0,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "I think this movie deserved more than what it got.  I highly enjoyed the story and I would recommend it to my friends to see it.  The main reason it didn't get a 10 was that the special effects were not the greatest I have ever seen.",
      "total_reactions": 0,
      "user": "slsoccer7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2011
      },
      "score": 4,
      "text": "I am a fan of Green Lantern comics and TV shows, having said that, this movie just SUCKED!! Granted there are some good moments in the movie but there are just too many bad moments that hurt this film. Actor Ryan Reynolds tried his best from what was given to him, however, actress Blake Lively was just terrible, looking dumb the whole time, just made me annoyed. Sad to say, but Green Lantern is not what the fan's were waiting for and this film is not worth paying full price! I give this movie a matinee because you are going to have enjoy watching it.",
      "total_reactions": 0,
      "user": "frugalDonnie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Tale as old as time. Ordinary man becomes superhero, explores powers, likes a girl, a villain arrives, saves the girl, accepts his destiny and beats the villain. Nothing wrong with that except that it was done very dully here. Everything  felt rushed, and nothing really stood out. Nothing really special but not the worst of its kind either. Ryan Reynolds does a good job but he can only do so much when everything else is just kind of lifeless. The action is also not very engaging, the villain is forgettable and towards the end I just wanted it to be over.",
      "total_reactions": 0,
      "user": "AVCITY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "I'll tell you!  I really dislike critics.  Almost every time they dislike a movie, I love it.  I'm not sure why we even have them.  The movie was an enjoyable superhero romp, which is exactly what most people will go and see it for.  OK! it might have tried to bite off a bit more than it could chew re past plots and stories, but hey it had action, romance, humour, great special effects, and it was a lot fun.  They can concentrate on making the next one better.  But for me, I go to the movies to immerse my self in two hours of suspended reality, and this movie does this brilliantly.  I give it 10 and can't wait for the next one.",
      "total_reactions": 0,
      "user": "WolvenX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "An enjoyable but easily forgettable movie that will keep fans of comic book movies happy but will bore anyone expecting to get the same quality as movies like the Dark Knight. Ryan Reynolds was the perfect choice for Hal Jordan but it seems Martin Campbell director of Casino Royale was out of his depth doing a comic book movie.",
      "total_reactions": 0,
      "user": "sumsar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Green Lantern is an alright film. Some of the fight scenes are cool and the story can be interesting to learn. The problems with the film is it could have gone into more detail about some of the characters but they didnt and this isnt the best superhero film ive ever seen. I would give this film a high rental",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "This movie was.....ok. Even though Ryan Reynolds is unbeliveably sexy(which is why is saw this movie.) I think he could have played the role better than he did. I honestly think he is better off doing roles other than superheroes and involve less cheesy lines.",
      "total_reactions": 0,
      "user": "PinkFloyd4ever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "The future of mankind depends on the joystick doings of a college-bound kid who lives in a trailer park. It's 1984, and Alex Rogan is going for the Starfighter record, blasting spaceships on a coin-operated video game in pursuit of a million points before a live audience. When he crosses the threshold, you know the record is legitimate because Alex breaks the mark on a sanctioned machine, which makes all the difference in the world, according to Billy Mitchell, who discredits the world record-breaking Donkey Kong score posted by Washington resident Steve Wiebe in \"The King of Kong\", the 2007 documentary about the subculture of competitive gaming. 874,300 and 1,006,600 are meaningless numbers, relevant only to an insular group of eighties refugees, but in \"The Last Starfighter\", the score matters; it's actually a world record, tied with other players, extra-terrestrials from distant galaxies who presumably are all smarter than Alex, which proves Twin Galaxies referee Walter Day right with his claim that first generation arcade games require \"comprehensive thinking\". Whereas Wiebe, a middle-school science teacher, drives cross-country to New Hampshire for a winner-take-all showdown with Mitchell, a chicken wing hot sauce tycoon, Alex's journey takes him to the stars, as he's transported across the universe by Centauri, an interplanetary recruiter for Rylos, the planet where Alex, a jack-of-all-trades(including plumber, just like Mario), is expected to defend the Kodan Armada from Xur. It's the video game's premise come to life; it's a ten-year-old kid's wet dream, but Alex's brother is too busy ogling centerfolds from his Playboy stash. Early on, \"The Last Starfighter\" recognized the potential for arrested development in video game-playing males. Exhibit A: the \"boys\" at Fun Spot whose lives are centered around a Donkey Kong champion, twenty-three years after the film last played in theaters. This should be Louis' adventure. Released one year after Dragon's Lair(the first role-playing coin-op), the \"Star Wars\" knockoff demonstrates how anything could be an avatar, be it an interstellar fighter pilot or an Italian-American plumber-turned-\"Average Joe\" superhero, and more importantly, shows how the movies would someday resemble video games, in which \"The Green Lantern\" is just one more spectacle-laden example. In essence, Hal Jordan flies his plane like a gamer, breaking the rules of engagement like Maverick in \"Top Gun\", but Cruise managed to be human, unlike the superhero, who is clearly a cipher. The ring chooses Hal by default, since earth just happens to be the planet that Abin Sur crashes on. Earth has no affiliation with the Green Lantern Corps., whose leader deems the human species worthy only of his contempt. Alex, likewise, is considered to be a fluke. Centauri explains how the machine was originally headed for Vegas, but inexplicably, it turned up at a \"fleaspeck trailer park\", completely incongruous to its natural surroundings, an arcade, just like how the monolith in \"2001: A Space Odyssey\" winds up in the African desert, causing a disturbance among the apes(Donkey Kong, a gorilla, is a kind of ape). Earth isn't even a part of the league. Humans are comparably stupid. However, similar to how the monolith instilled that first ape with the intelligence to use the bone as a weapon, the machine makes Alex smarter, bringing him up to speed in order to make him competitive with the higher-evolved recruits. Like \"The Last Starfighter\", this latest DC Comics adaptation features a loss of narrative momentum, in which both protagonists return home when earth doesn't seem to be in any imminent danger. \"Save the whales, but not the universe,\" observes Alex's replicant when the humanoid first sees the conscientious objector. Like the would-be starfighter, Hal is also an isolationist; he doesn't see how the Parallax's rampage against the planets of his Green Lantern brethren affects earth. Cowards at heart, nevertheless, self-preservation keeps both Hal and Alex alive and enables them to save their home when it comes under attack. At Alex's orientation for the Rylan Star League, the \"death or victory\" chant that comes at the end of the speaker's closing statements recall the Japanese mentality during WWII, turning the starfighter recruits into something akin to kamikaze pilots. Alex, being American, is impervious to the brainwashing. Similarly, the Parallax possesses the same quintessential war period Japanese characteristic of fearlessness, as embodied by the fear essence's \"yellow\" energy. It's Hal's humanity; his admission of being afraid to die which makes him successful against the Parallax and Hector, whose bulbous head, a result of exposure to radiation, could be interpreted as a reference to the atomic bombs that leveled Japan. Donkey Kong is suicide too. Most games \"don't last a minute\". It's suicide, manufactured by Nintendo.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "whoops i ment to give it a 1 on my first review! I hope this isn't too late for me!",
      "total_reactions": 0,
      "user": "youthcritic12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "The Green Lantern is the best movie of all time. great summer flick. All DC superhero fans should know about Hal Jordan and The Green Lantern corps. overall this movie is awesome and will inpress everybody",
      "total_reactions": 0,
      "user": "NinjaSniperJim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "cool movie, great sound, and awesome on th big screen. any super hero fan wil sure like this movie.,",
      "total_reactions": 0,
      "user": "LoganGreene"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "I think it is a good movie but not a great movie, is like one of those movies you see when you don't have something better to do, the plot seems to be good but I could note than there are missing pieces, you can think, among other things that one new untrained green lantern can defeat an ancient an dangerous enemy so easily when a group of the best fearless well trained lanterns fail on the task, it just don't make any sense...",
      "total_reactions": 0,
      "user": "Itsukki"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Expected to see something more, found it very.... boring, however, its a pretty good adaptation, the acting is terrible and disappointing, and also, the effects are good, but the acting is as bad as Transformers's",
      "total_reactions": 0,
      "user": "Darkstarshades"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "This wasn't the superhero movie I was trying to see, but thank goodness the movie was a total 3-D waste. OK, I'm not a fan of Green Lantern (he is probably overrated), but how come they still going to make a sequel if it was #1? Are the filmmakers making a second chance opportunity at greatness against Batman and Superman movies? The answer is NO. Nobody even critics wants a Green Lantern sequel because of Ryan Reynolds slow but awkward performance. Green Lantern was another mediocrity in 3-D movies so far and a mild one. I hate Green Lantern and it is one of the worst movies of 2011.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "I love the Green lantern, but the actors, to put it flatly, are awful. None of them do a respectable job, and it is very predictably, but the action scenes are really good.",
      "total_reactions": 0,
      "user": "ScooterTMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "Certains m'avaient critiquÃ© du fait que je donnais mon avis (pÃ©joratif) sur le film Ã  partir de la premiÃ¨re bande-annonce, qu'il fallait que j'attende le rendu final. Et je dois bien avouer qu'ils avaient raison : Green Lantern est bien pire de ce Ã  quoi je m'attendais. Avec un humour qui tombe toujours Ã  plat, un rendu visuel trop poussÃ© Ã  en Ãªtre moche Ã  regarder et des acteurs pitoyables, s'ajoutent un manque de punch incroyable (la puissance d'un pouvoir sans limite n'est vraiment pas prÃ©sente) et tout un tas de clichÃ©s incroyables des films du genre. En somme, Green Lantern ne rÃ©volutionne pas les films de super-hÃ©ros, mais il a le culot de se montrer Ã  la hauteur alors qu'il ne l'est pas. Batman peut dormir sur ses deux pointes.",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "In brightest day, in blackest night, no crappy movies shall escape my sight. Let brain-dead hacks who cannot write, beware this critic... (referring to Green Lantern) IT'S NO DARK KNIGHT! No indeed. Green Lantern is far, far away from The Dark Knight.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "In this film you can say that the plot is awful and has serious shortcomings ... some parts are nice, but not appreciable. We say that the work would have been better. The Italian dubbing, because I come from 'Italy is very poor compared to the Italian tradition of dubbing would say that is bad in comparison. As soon as I saw him I was not happy ...",
      "total_reactions": 0,
      "user": "TTT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "It's a good movie. It's got action, sci-fi, a beautiful woman, a charming male actor, a super hero... The movie's problems lie on its dialogues; and on its obviousness. But it's definitely not a Elektra. It's more like a Hulk 2.",
      "total_reactions": 0,
      "user": "Forge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I should say i am an Marvel fan rather than DC Comics but nonetheless this movie was good and definitely worth to be watched. I was not so familiar with Green Lantern before this one and didn't read any comic books of him.Ryan Reynolds did fine and was fit for the role, Just like the time he played Deadpool in X-Men movies. Blake Lively was hot & stunning as we all expected.  The boss fight with Parallax in city was actually looking like Kraken scene in Clash of the Titans but all the space fighting and brawl near the sun was exciting. Wish i could be watching this in 3-D.",
      "total_reactions": 0,
      "user": "julian_zizzle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 5,
      "text": "this film has really bad effects,the story sucks",
      "total_reactions": 0,
      "user": "gamer_dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2011
      },
      "score": 2,
      "text": "Is incredible how in a movie that lasting 2 hours, nothing happens, this movie is boring and lifeless, 2 villains and both didnÂ´t scare you or make you feel danger, one super hero that is more busy flirting with a girl than actually saving the world, and even worst a nonsense story",
      "total_reactions": 0,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Based on the DC comic character of the same name, Martin Campbellâ",
      "total_reactions": 0,
      "user": "Booleanflix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "I can sum it up in a word \"Disappointing\".  The entire start to the movie, from the badly v.o back story, to the whole fighter pilot scenes, set the movie up really badly. There was no substance, nothing clever, and overall just anti-climactic.  Each year, comic book heroes are coming to life nd getting better and better, but unfortunately this one missed the mark entirely.",
      "total_reactions": 0,
      "user": "JonathanC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "If Blake Lively is the person that has to be saved all the time then there isn't much saving involved in the film. But with all the superhero films I have watched in my life it is definitely up there.",
      "total_reactions": 0,
      "user": "spielbrick90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "It's a movie when you see you say: there is no shine in the movie and also has another problem the Senator Hammond has a horrible especial effect. So i have to say the movie is more or less",
      "total_reactions": 0,
      "user": "rafael14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "This movie was OK! It wasn't great, but it was just ok.",
      "total_reactions": 0,
      "user": "JasonCooper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2011
      },
      "score": 5,
      "text": "I have never imagine that a Super Hero film can be this Boring. Seeing Green Lantern makes me wanna say to DC \"Please stop making movie except for Batman \" . Ryan was good but not perfect ! Blake's character didn't have much to do as well as most of the characters . Spatial Effect was good and only the positive thing in this film . Movie's starting  was okay but ending sucked ! DC should take a  look at the Marvel Movies and learn how to make a Super Hero movie with Action , Adventure , Funny and well \"Not Boring\" . I was really looking forward for this movie and now i wish it was never been made ! Hard they are talking about a Sequel . I say \"Good Luck losing money\" .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Setting expectations as side, Green Lantern was weak, clumsy and embarrassing for DC comics. Ryan Reynolds is a decent actor and the only thing that held this movie from being a total disaster. The screenplay and story were a mess full of filler and threads that go nowhere, the action scenes were mostly lame. Parts of the special effects were OK, but most were overdone and made the movie look like an unbelievable green cartoon mashed with real life. The film makers also seem confused to what has made marvel comic movies so successful recently. This movie did not need to be made and does not need to be watched. Pass",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Green Lantern is not the best superhero movie of 2011, but it does have some cool action and an occasional sense of humor. The story is kind of a mess.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "Not as bad as everyone is saying. Some of the CGI is very very questionable but besides that the story of the Hal Jordan is told fairly well. I like d the action sequences and how the power of the ring was explained and used.",
      "total_reactions": 0,
      "user": "ajdolan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "A great performance by Ryan Reynolds and it was really fun he played a test pilot who becomes a superhero with will as his main power i think this was a great movie, the greatest superhero movie i have ever seen.",
      "total_reactions": 0,
      "user": "smumites45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Despite the fact that \"Green Lantern\" is getting pummeled by critics, the movie itself isn't that bad. In fact, it does something that no other comic book movie has done yet this year. It takes its time introducing the characters. This was the first movie where I didn't feel like I was being rushed along from one plot point to the next. Before getting into the main story, we learn that Hal Jordan (Ryan Reynolds) is a brash fighter pilot who has the potential to be something greater, and that his friendship with the beautiful Carol Ferris (Blake Lively) is a complicated one. In short, the screenwriters do a nice job of laying the foundation to potentially expand the depth of the characters as the movie progresses. But the problem that arises is that the writers don't do anything more past that point. They fail to take any of the characters in interesting directions. Sure, the characters change as they are supposed to, but every choice that's made is something we've seen in other films. The action is filmed well, but the action scenes themselves don't do anything to lift you out of your seat. This leaves us with only the storyline to rely upon. And what a lame storyline it is. Apparently in the universe, there's green energy which is a manifestation of willpower and yellow energy which encompasses fear. Also, floating around in the universe is a giant octopus with a computer animated face named Parallax. The mythology of \"Green Lantern\" is hokey, and when there's nothing else to suck us in (no compelling characters or action set pieces), the mythology sticks out like a really ugly blemish. I feel bad for Ryan Reynolds. He really does all he can with the role, and he shows that he can be a competent leading man. But the problem is that the movie surrounding his performance is so mediocre that he can do nothing to save it. Skip this and wait for a summer movie that brings the excitement.",
      "total_reactions": 0,
      "user": "JollyG87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "Some parts were just too long and drawn out.  The movie fails to capture what a true green lantern movie should have been about.  Just when the movie starts to get good, its already reached the end.",
      "total_reactions": 0,
      "user": "TexasGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Hollywood have done it again!",
      "total_reactions": 0,
      "user": "BuzterOne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "At this point, it's kind of just another comic book story made into a movie. It's not that bad, but I can't say it's that good either. I mean, what did the people behind the movie expect people were going to think? It's another modern day guy who finds super powers and has to save the universe, probably the five hundredth time this has happened at this point in the DC Comics Universe. I did enjoy watching it, but it still should have been better. Rent it, but don't buy it.",
      "total_reactions": 0,
      "user": "SinisterVortex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2016
      },
      "score": 4,
      "text": "Ryan Reynolds did a fine job and that's it. The CG suit was a terrible die, The main villain was total garbage and they introduced so much but didn't use it at all. So deeply flawed and it could have been so much better/cheaper if they had kept it mostly on earth and developed the plot from there.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "One of the biggest deceptions, I like this film, but in a part I understand the critics, this film have much mistakes, the performance of the good looking Ryan Reynolds is terrible, the only great performance is of Blake Lively, other mistakes are the abuse of the CGi, the bad use of all the Green Lanterns, I wait some like First Flight, or a new The Dark Knight, but is a biggest deception. The Movie is funny for the people that don't meet much about the character, and the only thing that wanna watch are big effects, explosions and only.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This movie is corn-al-icious, and was painful to watch. It was easily one of the worst movies I have ever seen. Do not watch this, it is terrible, and you could probably AVP more.",
      "total_reactions": 0,
      "user": "PrimalHunter70"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "It's not NEARLY as bad as most critics claim it to be. The action was quite good, but from a comic fan's perspective, there really wasn't that much of a focus on the world of the Green Lantern Corp. It's a very Hal Jordan focused origin story. I also did not like the female lead actor's acting. Not the perfect movie, but it was worth an afternoon and 10 bucks.",
      "total_reactions": 0,
      "user": "Vorch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "Pretty good movie but it seemed short. I loved the dialog and action, but it just seemed to go by really quick and was surprised how fast the final battle happened.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2012
      },
      "score": 5,
      "text": "I don't like sci-fi movies, Green Lantern is better like comics. I want see different actors/actress in this movie. I like Ryan Reynolds, but this role isn't for him.",
      "total_reactions": 0,
      "user": "DBreez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "Being a HUGE Green Lantern fan, I have to knock this film around some.  This movie is an origin story that struggles to give a story that really matters to the audience.  It wasn't a failure in execution, but content.  I felt that the acting was enjoyable; nobody seemed tired or tasked to add life the characters.  The scenery and CG were dazzling, and the musical score was spot on (still looking for the \"Green Lantern\" theme though).  Much of the film seemed to skim over things, like characters and plot points, but I'm guessing that the filmmakers were expecting to make a sequel to follow-up on those.  On the whole, the question really becomes \"How do you make a movie about an intergalactic superhero/cop without turning the audience off with disbelief?\"  I could think of a few, but then that wouldn't be critiquing, just making excuses for this film.",
      "total_reactions": 0,
      "user": "Darsidius"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Green Lantern is laughable because the hero is neither charismatic nor heroic he is just this human being with a lot of special effects on him. The special effects are awful and the acting is terrible. This a severe disappointment. I give this movie 16%. I say this is the worse superhero movie, ever!",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "In no way is \"Green Lantern\" a hit or superb in its nature, but it isn't awful. Watching, you can find many errors script wise and casting wise, but visually this film is pretty creative. That and some of the comedic elemnts done by Renolds and the ensemble either with thim or at thim make this film not exactly a complete waste of time and somewhat enjoyable. Try not to laugh to hard at the extras and supporting character's choices during the serious scenes, because you might hurt a die-hard Renolds movie fan while they are watching the film. You will. I promise. Just keep it contained. Leaving the theatre with your overpriced ticket and theatre food, I'm sure that you'll look back at the last 105 minutes of your not as a complete waste of time. You'll find at least one thing to happily talk about with your friends. That being against or for the film",
      "total_reactions": 0,
      "user": "Jeramyd69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Potential is the first thing that comes to mind after watching the green lantern.  The movie itself could become a bit boring at times had some decent action sequences though and its just an origin story that never really got too exciting.  I feel that they should in fact make a Green Lantern 2 though because ryan reynolds does seem to have what it takes to place the green lantern and would play well into the justice league mold.",
      "total_reactions": 0,
      "user": "BingFootball10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 1,
      "text": "I had never heard of the Green Lantern before The Big Bang Theory but now I know why. This film is awful and the whole idea of the character and the universe from which it derives is awful. I know the filmmakers clearly didn't come up with the character's powers but how did this comic ever become successful? The film itself was below par, Ryan Reynolds did his best but no one else can really say they did anything positive in this film (or at least anything of note). Do not watch this film.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Ok, there are better superhero movies, but \"Green Lantern\" is still enjoyable (I would give it a 6, but it's been bad reviewed enough). Ryan Reynolds is a good actor, he really looks like the comic-character Hal Jordan and also the rest of the cast has made a good job. Not a masterpiece, but still worth watching it!",
      "total_reactions": 0,
      "user": "federicobenny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 3,
      "text": "A guilty pleasure. This was the most disappointing comic book movie I ever saw at the movies, that and Spiderman 3. How could they do this to Green Lantern? They have a superhero who travels into space all the time and is practically Star Wars material. WHAT DO THEY DO?!?!?!?! MAKE A MEDIOCRE MOVIE OUT OF AN AWESOME CHARACTER!!!! .... What did you expect? For it to be good?",
      "total_reactions": 0,
      "user": "Pixarlover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "It's not treacherous, but it's laughable, and it doesn't intend to be.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "Green Lantern is a decent movie that could have been better but is still a decent movie. Plot: Hal Jordan (Ryan Reynolds) has a great relationship with his father Martin Jordan who is a pilot. When he watches his father fail a takeoff he also witnessess his father die from the jet's explosion. When he grows up he is judged by many for being extremely **** and rebellious which is a form of courage. Meanwhile a Green Lantern, Abin Sur part of the Green Lantern Corps; an army of different specied aliens who have sworn to protect the world with courage converted into energy by rings which possess the green essence of willpower, has failed to re imprison the guardian of the yellow esscence of hate, Parallax. As a last hope he escapes to Earth where Jordan stumbles upon him and inherits his ring. After a series of events Jordan is a trainee in the Green Lantern Corps and swears to use the green essence of willpower as a means of preserving peace. My opinion: If your interested in Green Lantern I would watch this movie, if not this movie is still good at delivering the origin story but compared to other super hero movies does not compete.",
      "total_reactions": 0,
      "user": "PulseEnder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "This film is awful. I was really looking forward to watching It and I was really disappointed. The film is slow paced and the fight scenes were abysmal. A film I do not recommend at all.",
      "total_reactions": 0,
      "user": "Wright98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "Critics were way to harsh on this one, but the only reason it was ripped apart by critics is because they compared it to X-Men First Class and Thor. This film is actually really hard for me to rate. There are definitely things that needed to be better in the plot and story, but I can't pinpoint what exactly needed to change. I think the main problem with the film is that it just didn't mesh together, especially the beginning. The story just didn't settle all the way is a good way to explain it. Also, the film didn't tap into emotion, which it really needed to, especially since it's a crucial idea to the character and story.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 2,
      "text": "Bad movie in general. The story line was dumb and bad acting. I dont mean to offend any comic book movie lovers but this was the worst comic book movie Ive seen in a long time. And what kind of a mask only covers you eyes???",
      "total_reactions": 0,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "Overall, Green Lantern is an ok film. There",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "I don't think I've ever seen so much effort put in to a movie for such mediocre return. What I mean to say is that almost every scene of this movie is absolutely beautiful. Seriously breathtaking visuals. And yet, it's so overwhelmingly boring. What an odd dichotomy. Worth watching if for nothing else than a study in how important it is to have a strong script before you pour so much money and talent in to a project like this.",
      "total_reactions": 0,
      "user": "microjackson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "above average movie tells the story of the green lantern life and all ryan reynolds acting was decent not epic nor very bad and the other actors are decent also the movie all put together is above average i mean its watchable not that bad and  i give it 6/10",
      "total_reactions": 0,
      "user": "azooz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 2,
      "text": "why would anyone think that this is a good movie idea is beyond me  even so the Execution is ridiculous  how can someone is Exposed to something that can travel him anywhere in the universe never act surprised  like it was happening to him his entire life  this movie don't make any sense in the slightest.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "Of all the second-rate comic book movies that has occupied most of 2011's summer, \"Green Lantern\" is the only one of its crowd without a saving grace. \"Captain America: The First Avenger\" saw a true hero in Steve Rogers, giving as much attention to his human character as with his superhuman attributes. It was the goofy playfulness of \"Thor\" that made its overall silliness acceptable. \"X-Men: First Class\" was a prequel that founded itself on prior knowledge, instead of avoiding it. \"Green Lantern\" doesn't have a singular thing that could make it more than what we already expect. It fulfills the requisites of the superhero genre, then immediately stops trying.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "When launched the Green Lantern thought would be a cool movie, but it was not, for me it became a rich experience weak and exploited. Not worth it to have spent money for nothing in a disposable product.",
      "total_reactions": 0,
      "user": "nippu33"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "In an era of the comic book movie this is one of the worst.  A lot of pointless story telling mixed with an unimportant villain and some mediocre acting makes you hope they just cancel any sequel plans.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "This movie is being trashed by critics, they just hate it, but this is my opinion. I did have fun with the movie, I thought it was very well acted, and it had a very engrossing buildup, so I liked that part of the movie, but after the rising action reaches the climax, well, there is no climax. The movie seemed a bit anti-climactic when it ends. It just seemed as if they lost all their funding and they just wanted to end it a little to quickly, it seemed as if they ended it just too fast, and that brought down the quality of the movie, but I guess its okay.",
      "total_reactions": 0,
      "user": "UtopianStuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "The movie wasn't all that great. It started all great at the top of the mountain but it went down on the bumpy side of the mountain (if you know what i mean). The CGI was okay, it was obvious some times, but at some point of the film you feel like the film isn't really good. An at sometimes you feel like you wasted 10 bucks! The movie was alright, I mean i don\"t think its a must see movie. Overall 5.8 out of 10",
      "total_reactions": 0,
      "user": "CriticGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Reviews were mixed for Green Lantern although all the trailers I viewed indicated that it would be a movie that I would thoroughly enjoy. And I was right. From beginning to end Green Lantern is a special effects extravaganza and an entertaining origin story. I generally do not care for origin stories because being familiar with a superhero character means I already know the story and would rather see something new. With Green Lantern we really have the best of both worlds. The movie does not delay in placing the ring of power on the finger of Hal Jordan. From there we watch as Hal struggles to meet the burden placed upon him while the Earth is threatened by Parallax one of the Guardians of Oa that has turned evil.",
      "total_reactions": 0,
      "user": "Gojira63"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "There have been better superhero movies, MUCH better. But this is still a good superhero film that'll make the comic faithful excited and happy. I liked this movie, there's just something missing, but I really do think this movie was good.",
      "total_reactions": 0,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Going into this movie, I didn't expect much. But what I watched was a disaster! Probably the worst super hero movie made!? The story was typical, the cgi was awful! I felt like I was watching cut scenes from PS2 game, the movie felt rushed. Avoid!",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "Although  people have been heavily criticizing this film for its lack of quality and it seeming rushed, both of which I agree with, they had something in there which could have developed into a much better movie. It was entertaining, on the whole, and I found it managed to keep me interested for a long time. I'd like to think myself as a DC geek, and I found myself impressed at how well they'd managed to keep to the original stories.",
      "total_reactions": 0,
      "user": "egg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "this movie of green lantern was a very deception for me .",
      "total_reactions": 0,
      "user": "killian13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "Boring. Very boring.",
      "total_reactions": 0,
      "user": "AmongstYou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Though it lacks the sophisticated storytelling of past superhero movies such as Spider-Man 2, The Dark Knight, or even Iron Man, Green Lantern still manages to dazzle on a visual level, has a plot that manages to stay together all the way through, and has Ryan Reynolds deliver a fun performance as Hal Jordan. All resulting in a decent, if somewhat, faulted superhero film.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Green Lantern isn't a dissapointment, as I saw its trailers and promotions, I thought it looked like absolute tripe, the many bad reviews made me think that for sure; anyway, it isn't a dissapointment, it's a surprise  it's better than I thought it looked. I would have never even considered watching it if I wasn't given it as a joke bithday present from my sister. It's the a silly film in its scenarios and action, but it's super serious with its kinda sucky story line and dialogue. Hal Jordan  the main hero  barely even goes to the Green Lantern society and when he does, his comrades complain about how 'young' his race is and how stupid he is. The effects and CGI for the most part are overdone and look cheap, but on occaisions, they look pretty good  but not impressive by any stretch. Character building/developement is lacking and the relationship between the villian and hero doesn't really develop. The action of the film is silly and cheap, and the film ends quickly and puts a sudden end to the growing climax. The acting, on the otherhand, is okay, not impressive  but good enough.",
      "total_reactions": 0,
      "user": "skyminster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "[2.1] I don't think I'm lying when I say this is the worst movie I've ever seen. It's uninteresting, incredibly unoriginal, and extremely painful. I don't understand how a group of adults, still, in the 2000's can make something so poorly written, and such a mess. For f**k's sake, good movies can make money too!",
      "total_reactions": 0,
      "user": "ncstatemike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "This is one of the worst super hero movies I’ve seen. The plot is common (the hero masters his powers very quickly showing how great humans are), the characters follow the usual stereotypes (the man is irresponsible while the woman is perfectly balanced), the cgi are mediocre or worse (the planet of the Green Lanterns looks like a video game stage) and the action is not convincing (using a giant spring to throw a truck to the villain doesn’t look good). The villains are a huge evil cloud who drinks souls for breakfast and a potato-head who is depressed because daddy doesn't appreciate him. Lastly, there are many Green Lanterns in the universe but they are all useless except for the hero. At least the pacing is fast and the two protagonists, Reynolds and Lively, are pleasant to watch.",
      "total_reactions": 0,
      "user": "Dimitris01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "This movie is so bad I don't even know where to begin. It has bad acting from everyone in this film. Its almost like the director said \"act like you were on a school play, but worse\". Second, the graphics were awful. They even put in a CG mask. Who does that? Third, the script was garbage. It folowed no real plot, which just went from bad to worse. Easily the worst superhero movie of all time.",
      "total_reactions": 0,
      "user": "cag11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "The trailer made this film actually look like a summer blockbuster to watch out for, the problem was the casting, acting, writing, editing... pretty much the entire film despite the spectacular effects. Mark Strong was the shining light through this storm of terrible.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "Last year, I rented Green Lantern from iTunes to watch on the Christmas holidays. I heard that it was a terrible movie, but I went ahead and watched it anyways. The movie was OK at the start, but then it just went downhill from there. The acting was kinda crap on certain areas, there was a slight overuse on CGI which made it look like the director was lazy and the story wasn't that interesting because I was left confused with certain parts of the movie.",
      "total_reactions": 0,
      "user": "mariokarthero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2014
      },
      "score": 4,
      "text": "This movie was such a disappointment I thought I was going to love this movie and I definitely didn't. There was noting memorable about this movie. If I was asked to re tell what happened in this movie I probably wouldn't be able to and I can usually retell every movie I watch. And the ending of this movie happened so suddenly I still thought there was like 30 minutes left and it went straight from an action scene and then pretty much just ended. A disappointing movie to say the least.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "Green Lantern is a giant letdown. This movie shows that Marvel is better at making movies then DC. The suit looks awful. I don't know which of the two bad guys is the main villan. In my opinion There are two movies that came out in 2011 that is way better then this movie is, and they are Transformers Dark Of The Moon and X men First Class.",
      "total_reactions": 0,
      "user": "Danielhero1998"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "This movie had been in development since 1997 and they still managed to **** it up. The plot was really small and it tried to show its special effects. This movie is just plain bad. Barely anyrhing is good about it.",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "It wasn't bad but it wasn't the best had potential but it was the writing that let it down. Acting was fine but the villain wasn't good. If they started with Sinestro becoming with fear in the first 30 min and made him the main villain it would have been allot better.",
      "total_reactions": 0,
      "user": "JAK00101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "The Green Lantern may be visually appealing, but it overuses its effects to the great expense of its subpar story line, and less than adequate script.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Sadly this movie had a really bland plot and dialogue with a boring villain. Another big problem with this movie is there was way too much CGI. Well I can understand everything that is made by the Green Lanterns but did Hal's costume and Sinestro have to be CGI? Overall this movie was a mess.",
      "total_reactions": 0,
      "user": "ghost-nappa56"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I am not familiar with Green Lantern from before. Sure, I've seen pictures and seen his face here and there, but other than that, this movie was my first real encounter with the series.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "If the dark knight is how a superhero movie should be done, this is how it should not be done. Everything the Dark knight did, is reversed here. Really if you've seen a poster for this movie, you have experienced about as much character development as there is during the film. The special effects, actually, are woeful which is a real problem for a film solely reliant on special effects. Overall really, this is the worst superhero movie to be released so far, and really it would take a pretty monstrous effort to undo that.",
      "total_reactions": 0,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "This movie's special effects are super good and this movie also features quite a lot of action. I did not really like Hal Jordan's suit in this movie as it looked like it exposed too much of his flesh. Nonetheless, the character is great in this movie. Overall, this is a good movie.",
      "total_reactions": 0,
      "user": "supermann234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Watched it recently on BD. Not a particularly good movie. Ok acting. Good effects Story is pretty stupid. I'm not that big on the whole Green Lantern universe, I find it lame.",
      "total_reactions": 0,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Green Lantern is a really bad movie. The movie is very long has to start. Actor do not play very well. It's a pity a movie of super-hero which would have been able to have of the potential.",
      "total_reactions": 0,
      "user": "Greg2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "The biggest crime with Green Lantern is the utter disrespect of the source materiel. Apparently DC executives have begun filming themselves taking a crap and expect it to make money.",
      "total_reactions": 0,
      "user": "cryhardhumor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "Wow, this movies is bad! I hoped the action and visuals could maybe save it, but no. It might entertain you, don't get me wrong, it's not that horrible as some say, but it's still the worst superhero movie of the last 10 years. Also I like the colour green, but this much green gloving is a bit much, it looks really stupid.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "This movie was not done very well. This plot is very basic and typical of every other super hero movie. The story is not accurate with the comic books either.",
      "total_reactions": 0,
      "user": "DanielwWhite"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "To sum up Green Lantern in a review, it's a superhero movie that doesn't make complete sense at all. I praise its special effects, but the entire story doesn't make sense at all.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "It's a bizarre thing - by all rights this movie should be complete rubbish, but somehow it manages to be quite a lot more.",
      "total_reactions": 0,
      "user": "Lamoi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "I was very disappointed as my favourite super hero got a bad movie. While the acting is not terrible, the rest of it did not fit in with the lore and just doesn't feel like green lantern. It mainly focuses on the main character hal jorden, who isn't bad, but should have been fixed.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "okay this movie is bad but not terrible its enjoyable but not good a special effects and cgi reliant film thats only good element is the action sequences",
      "total_reactions": 0,
      "user": "UNARMED_JORD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2016
      },
      "score": 3,
      "text": "The DC Comics have always been populated by many characters of different abilities... but the two most popular characters are, and always have been, Batman and Superman. Not to mention that we have had many variations of movies with Batman and Superman... maybe it's because they're easier to translate well onto the big screen, more so than most other heroes.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2016
      },
      "score": 4,
      "text": "This film is regular, with good ideas, but unfortunately can not perform them properly. And the result is a film with a messy script with a weak story and characters without any charism.",
      "total_reactions": 0,
      "user": "CobrinhaManda"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2016
      },
      "score": 4,
      "text": "Most people have already given this film the what-for and beaten it to the ground, so I'm not gonna go on too long about it, but we already know about the colossal disappointment that was \"Green Lantern.\" You had a pretty charismatic star, the director of \"Casino Royale\" and some impressive CGI imagery to work with, how could you possibly fail? Well, you use all of that on a film with poor writing and forgettable characters! You can spend all the money you want on big actors and visual splendor (and spend they did, because the film costed some $200 million), but money can't write a brilliant script or create fantastic characters. All in all, \"Green Lantern\" is all style, no substance. Sometimes that works, other times it doesn't. In this case, it doesn't. If you're looking for one of the worst superhero films ever...well, honestly, you might still want to look elsewhere because this film isn't PAINFULLY bad, but if you're looking for a brilliant superhero film, you'll want to avoid \"Green Lantern.\"",
      "total_reactions": 0,
      "user": "FreedomFighters"
    }
  ]
}