{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 76,
  "mc_mixed_rating_frequency": 34,
  "mc_movie_name": "Greenberg",
  "mc_negative_rating_frequency": 48,
  "mc_positive_rating_frequency": 61,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Greenberg is a brutally honest and raw look at what is is like to wake up and be 40 and realize your life is not what you expected and you aren't who you thought you would be. Ben Stiller is excellent and shows he can be more than a one trick pony.  This is first time I have actually forgotten Ben was Ben in a role. He is troubled frustrated, arrogant and abrasive, acting out and inappropriate. You have to wonder why Florence would find him attractive and keep coming back for more. Brilliantly written and shot, it showcases life in LA as only one who actually lives here knows it. Jennifer Jason Leigh produced the film and as in past collaborations with Noah Baumbach show they are auteurs of creating emotional train wrecks that make us uncomfortable but can't stop watching",
      "total_reactions": 1,
      "user": "cleverwabbit"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 3,
      "text": "This was a potentially good movie ruined by the classic combination of a Big Star wanting to be in a small indie film.  It.  Having to watch Ben Stiller in every scene was so painful, especially when Greta Gerwig and Rhys Ivans were so good.  There was no nuance or depth or humanity to his character.  It reminded me of Punch Drunk Love, in which Adam Sandler just looks stone faced the whole movie, which seemed to be his way of 'Acting'.  A similar self-involved character, the dad in Squid and the Whale was so much better with Jeff Daniels, a much much better actor.",
      "total_reactions": 3,
      "user": "koblesky"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "It doesn't surprise me that, after-the-fact, I found out that this movie was directed by Noah Baumbach.  The direction is unique, painfully slow at times (intentionally) and physically makes me squirm in my chair while watching because the uncomfortable things happening to the characters in this movie are entirely too real.  Mid-life crisis is an understatement here.  A man so arrogant that he believes he's better and deserving of so much more than he's received in life, which has turned to pure bitterness.  At the same time, that bitterness is tempered with sporatic episodes of maturity and responsibility.  That dichotomy results in very schizophrenic behavior toward the friends and family he loves.  At times he's defensive of the mistakes he's made that brought him to the misery he is currently experiencing, while he also calms down and realizes that he shouldn't blame and that he, in fact, is causing his own misery.  It's painful to watch and so uncomfortable to the viewer, especially me who experiences bouts of the same thing every now and then (though to a lesser extent).  One almost has to be older to appreciate what this movie is saying, but even those open to its content have to also get past the brutal way Noah brings it to the screen.  The Squid and the Whale was depressing enough.  It makes me wonder how depressed Noah is to consistently present this much raw pain.  However, what makes the movie is its optimistic, and sweet, ending.",
      "total_reactions": 2,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2010
      },
      "score": 0,
      "text": "Minimalism is no excuse for a poor screenplay, and artsiness is no justification for poor direction. Paolo Sorrentino is a minimalist director, and his films are brilliant. David Lynch is an artsy director, and his films are brilliant too. The problem with Noah Baumbach's films -well, ONE of the problems with his RECENT films- is that he seems to have picked up that terrible habit that Wes Anderson had for a little while until a couple of years ago. See, Anderson too thought for a few years that he could get away with compiling a series of quirky vignettes and calling it a screenplay. Thus, The Life Aquatic with Steve Zissou (2004) and The Darjeeling Limited (2007) are nowhere near as accomplished and coherent as Rushmore (1998) and The Royal Tenenbaums (2001). Bottle Rocket (1996) is a different case, as it was his first film. Its imperfections have to do with lack of experience, and they are easily forgiven. Anderson's latest film, Fantastic Mr. Fox (2009, co-written by Baumbach, by the way), saw him come back to form. Now, Baumbach's best film to date is clearly the outstanding The Squid and the Whale (2005), after which, he decided to hit us in the head with the bluntly morose Margot at the Wedding (2007). Greenberg, unfortunately, is in the same vein of the latter, not the former. It is so absolutely bourgeois (anyone outside of the upper middle-classes simply does not exist), that Sofia Coppola might feel challenged when it comes to the position of \"Most White-Bread Director in the World.\" Ever since The Squid and the Whale Baumbach has been directing films that are uninspired and uninspiring collections of eccentric details and overly wacky situations. No story, no depth, no character development. Just irritating, adolescent forty-somethings complaining about their Beaujolais. Ignore the hype. This is not a good film.",
      "total_reactions": 2,
      "user": "spud"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "Wow! I was really expecting to like this movie and it was just ridiculous. This film tries way to hard. There are periods of slight entertainment and good humor, but holistically this movie doesn't even warrant the time if its watched free of cost. Da, that was stupid movie.",
      "total_reactions": 2,
      "user": "Sean1680"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Ben Stiller really proves to be a great actor. He makes you love and hate Greenberg at the same time. He has a very awkward personality, but in the other way you sympathise with him. The film's dark humor is very well thought of. Great script. I had a few laughs. If you like black comedies, this is a film you have to see. 2.0",
      "total_reactions": 2,
      "user": "PieterQ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "In an evident time of depression, several modern Independent filmmakers have focused on the lowliness and deadbeats of society. Noah Baumbach's exceptional Greenberg focuses on a 40 year old one time musician (Ben Stiller) who has just been released from a mental hospital.  When attempting to adjust to society, he faces a living that honestly emulates the emotion of present day urban life in its dismal state.  And taking on a similar position of most Indie films, the film conveys that love can still be present in any circumstance.",
      "total_reactions": 3,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "Great performances from Ben Stiller and Greta Gerwig. Smart, funny script from Baumbach. Not as good as \"The Squid and the Whale,\" but will definitely hold up as quality film in the Baumbach/Anderson canon.",
      "total_reactions": 3,
      "user": "Tony"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "I loved this film but I agree with many of these reviews which criticize the casting of Affleck.  Baumbach is famous for his unlikable characters, but Stiller's performance is so distracting and forced that he nearly ruins this film.  An excellent script and breathtaking performances by Greta Gerwig and Rhys Ivans saved the film for me.",
      "total_reactions": 3,
      "user": "conschobhar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "I wanted to like Greenberg. I really did. I am a fan of subtle slice-of-life indie dramedies. I am a fan of Ben Stiller.  I was not a fan of Greenberg, though.  I was entertained through most of the movie, and it kept me intellectually stimulated at parts, but in the end it left me feeling nothing but disappointment.  There was no emotional connection to the characters in the film, and each character never showed any more than 2 dimensions.  They were all generic indie characters who never seemed to have an internal motivation.  Everyone seemed to behave based on what they prescribed character type was meant to be.  Do not get me wrong, this is not a bad film by any means, but it is also nothing I am going to remember a few years down the line.  I would much rather watch this movie again than sit through Stomp the Yard 4.",
      "total_reactions": 1,
      "user": "Dajbman22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The first time I watched this, It was very difficult to understand, and I think that can be said for pretty much all of the people who saw this movie. I had to review it again to understand it and I realized that Ben Stiller gave quite a good performance and the writing is actually quite good and funny. Some of the events still confuse me, but I still defend this movie, saying it has good writing, great performances and an unconventional storyline which is hard to find these days.",
      "total_reactions": 1,
      "user": "D-Slice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "This should be nominated for Best Drama. Baumbach has a great skill in creating character nuance that is not always pleasant, but certainly realistic. Those unaware of their own personality blind spots will feel uncomfortable during this movie. However, Greenberg is fully formed and expertly played by Stiller. There is a part of Greenberg in all of us.",
      "total_reactions": 1,
      "user": "Evolutionary"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "I'll admit, I came to this film knowing I might not like it; I'm generally not a fan of Ben Stiller (at one point I had to fight an image of Simple Jack out of my head), and knew it was a Baumbach film (I wasn't a big fan of Margot at the Wedding). The reason I was interested was Greta Gerwig. Thank God for Gerwig and Rhys Ifans, who save the film from being a complete wreck. Ben Stiller's Roger is so unlikeable it's maddening; it gets tiresome very quickly. The film gets more interesting toward the end, when Brie Larson and Juno Temple bring some much needed levity, but it's too little too late. Ultimately, it's just not the type of film I respond to wholeheartedly.",
      "total_reactions": 1,
      "user": "wiggipop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "I want an hour and a half of my life back. There's really nothing more to say about this movie. I am posting a review hoping to save a few people from wasting their time.",
      "total_reactions": 1,
      "user": "praystation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Honest and tought provoking; normal life isnt always fun and inspiring as many other movies try to portrait. This is more close to the avarage-joe. This movie gives the opportunity to take a good look at the mirror and ask ourselves of our life goas and relationships.",
      "total_reactions": 0,
      "user": "VonSeux"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Sometimes, I'll never get Metacritic's users... even they have a huge amount of logic to talk about same with the critics on this site. This movie's one of the examples for user logic. Don't listen to the users. Greenberg's worth going to and you'll love every single second of it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}