{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 81,
  "mc_movie_name": "Hall Pass",
  "mc_negative_rating_frequency": 31,
  "mc_positive_rating_frequency": 57,
  "mc_pro_critic_reviews": [
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 80,
      "summary": "Compared to, say, your average Adam Sandler movie it's a master class in film comedy. Oh, you will laugh. You may not forgive yourself for it easily, but you will laugh. You may well laugh to the point of pee stains in your underthings, and if you think that's gratuitous you have no idea."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Hall Pass isn't by any means flawless, but its ability to integrate extreme scatological humor with moments of genuine feeling is rare."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Hall Pass is the brothers' 10th movie, and their most gangbusters since \"Me, Myself & Irene.\""
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 75,
      "summary": "Fans of their grossest stuff needn't fear: The Farrellys are still the guys who put the last three letters in \"crass,\" and their potty humor was too extreme for me once or twice."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 70,
      "summary": "It's a terrific performance-and terrifying. Owen Wilson is aging: Where goeth my own youth?"
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 67,
      "summary": "Wilson has a gawky affability here that helps redeem much that might otherwise seem tasteless (as opposed to tasteless-but-funny)."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 67,
      "summary": "Though the film never balances the grown-up stuff with the gross-out gags, it suggests the Farrellys might be able to do mature after all."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 67,
      "summary": "Hall Pass would like to be as dunked in reality as Judd Apatow's best comedies, but the movie is thin. The Farrellys can't quite nudge the characters from two dimensions to three."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 65,
      "summary": "Still, the Farrellys have a distinct touch that carries their dubious premise across. They bring back the toilet humor of yore and make it shocking and funny again."
    },
    {
      "critic": "Elvis Mitchell",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 65,
      "summary": "The Comedy of Emasculation that Judd Apatow and his disciples have made into a separate economy was invented by the Farrelly brothers."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "The plot of the movie is meh."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 63,
      "summary": "If you go, be sure to stick around through the closing credits. By far the funniest part of the movie is a blackly humorous fantasy sequence starring Merchant."
    },
    {
      "critic": "James White",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 60,
      "summary": "Not up there with the Farrelly brothers' classics, but still a worthwhile, farcical comedy."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "Wilson is nicely restrained as a loving husband caught in a middle-aged crisis, while Sudeikis makes a great foil as a guy in over his head."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 60,
      "summary": "A largely sexless sex romp, has such a winning sense of middle-aged exhaustion to it that you might want to add a star or two, especially if you're familiar with the banalities of matrimonial bliss."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Hall Pass attempts to take the Farrellys' harsh humor and bring it into harmony with what has become the modern comic style, which is to be coarse but not absurd, to be brutally honest but real."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Whatever the case, it's dispiriting that the draggiest, soppiest scenes in Hall Pass, as well as the most disgusting gag, involve women."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "Most gaspworthy is that this raunchy, transgressive comedy about would-be adulterers turns out to be a hot, wet reaffirmation of marriage."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "As in \"Breaking Upwards,\" the best joke here is that the wives (Jenna Fischer, Christina Applegate) wind up getting more action during the marital recess than their hapless hubbies."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "It's secondhand, vaguely resigned material. And while Sudeikis has some talent, he's not yet ready to co-anchor a feature comedy. He's no Ed Helms, in other words."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "The slapstick and action comedy interludes are haphazardly executed at best, and matters aren't helped by the film's incredibly ugly look."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 50,
      "summary": "While the stabs at grown-up insight miss their targets, picture still packs more pure comedic punch than the Farrellys' last few offerings."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Ever catch yourself thinking, \"Man, I wish beer commercials lasted just 104 minutes longer\"? The Farrelly brothers are ready to make your dreams come true."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "Hall Pass is about two guys trying to recapture their youthful mojo, but it also appears to be made BY men who fit that description."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "After scoring big in 1998 with \"Mary\" - the zipper issue, the \"hair gel\" mix-up, the roving troubadours - their (Farrelly brothers) raw inventive edge has never been quite as sharp. Hall Pass, starring Owen Wilson and Jason Sudeikis, continues that creative slide into everyday crude."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "The crazy-barista melodrama-slapstick collision seems not like a nimble twist, but tone-deaf blundering-what once came naturally now seems like trying too hard, as the Farrellys face their own mid-life crisis."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "Like the middle-aged dads in this flaccid fiasco, Hall Pass is a decade behind the curve of what's happening."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "It's almost impressive when a movie can manage to be both repellently vulgar and sickeningly sweet in the span of a mere two hours. Almost."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 38,
      "summary": "A rude and seriously crude riff on taking a vacation from marriage."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2011
      },
      "score": 30,
      "summary": "Mean-spirited."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "It's a lame trailer, but the movie itself is much, much worse."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Wisdom lies in taking a pass on Hall Pass, but bravery demands something else, something far more instructive: Watch it, every vacuous frame, if only to measure the precise aesthetic distance from blessing to curse."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 25,
      "summary": "Haphazardly conceived, phlegmatically paced, lazily filmed and punctuated with gratuitous moments of sexual and scatological slapstick."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "summary": "Hall Pass has half the right idea: Scratch out \"Hall,\" and just … pass."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "summary": "Not only disgusting and unendurable, but filthy and boring, too."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2011
      },
      "score": 5,
      "text": "Host to the ever-continuing trend of cinematic themes, the Farrelly brothers don't stray far from lasciviousness as they once again (\"Shallow Hal\") turn the tables, and put men in the spot light of the unsatisfied; here, we learn that hedonism is satisfactory...just as long as you have a pass. In this farcically lewd comedy, two men have the once in a lifetime opportunity to relive their pre-marital days, only to the expense and baggage of 20 years, a couple kids, and a rusty dating game that has been played in ages. With their newly-given priviledges, and desperate attempts via Applebee's, they finally reach what they sought after, albeit unlikely, sex with beautiful women. Only now, approached with such recognition, do they realize how lucky they really are to be married--- notwithstanding attractive women already at home. Aside from being offensively indecent and raunchy around the edges, \"Hall Pass\" is the projection of every man's fantasy, acted on or not, where being average is perceivably desirable, and insecurities are tossed aside. At the surface, you have a movie that will make you laugh to the limits of your waistline, mesmerize to every last 'mental image,' jump from every Jacuzzi, and have you another quote to share with your friends.",
      "total_reactions": 2,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "The 2 or 3 \"money shots\" in this film (Owen Wilson with the 2 dicks in the spa;  Drunk girl who craps in the shower) pretty much make the rest of this very ordinary film worth seeing - if you have a juvenile humor streak like I do - and if you simply feel like laughing.  It's nowhere near the recent best in the genre (Hanover, Wedding Crashers, Old School), but again, if you want something light to laugh with - it'll do.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "This could be Jason Sudeikis's chance to make it into the public's eye that doesn't watch SNL.  With him it is an average movie, but without him it would have been a disaster.  Most of the good one-liners were revealed in the trailers.  The plot was quite predictable, but I can't hate a movie entirely that rips on Kathy Griffin.",
      "total_reactions": 1,
      "user": "Onear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "Nope! Note The Hangover, not Due Date, not Get Me to The Greek, not Judd Apatow level stuff here.  There is some funny bits in the first third, but the middle drags into a chick flick in that men need women more than visa versa.  The moral of the story is that men cannot live without their women, but the women can get guys whenever and wherever they want. Not a good guy movie like I had hoped. The real old guy friend in the final third has some funny bits in a club, but the promise in the beginning doesn't pan out.  So, just leave after an hour and you should get your money's worth.  P.S. Worst haircut on a male movie star since Eraserhead.",
      "total_reactions": 1,
      "user": "2PIN-1STIN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 0,
      "text": "It is now time to stop making movies depicting men as complete idiots. It is time to stop depicting women as being superior to men in every conceivable way. It is lame. It gets old. It sends the wrong message. And it's not the least bit funny.",
      "total_reactions": 2,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "\"Hall Pass\", similar to the grossly underrated \"Shallow Hal\"(arguably the best title in this filmmaking brothers' oeuvre, \"There's Something About Mary\" notwithstanding) serves up mean-spirited jokes at the expense of women who aren't, to put it kindly, classically beautiful, and should probably have been best left alone, rather than have a camera overstate their lack of sex appeal. Maybe because Jack Black isn't classically beautiful himself, the 2001 film, in which a svelte Gwyneth Paltrow juxtaposes herself against a moribundly obese version of herself, somehow is able to get away with its aggressively misogynistic tone. This time, the filmmakers aren't so lucky. In the film's arena of sexual politics, not only are the women punished for their desires and transgression, but the men as well, which is better than your typical Adam Sandler offering, and yet, the level playing field this filmmaking duo purportedly advocates seems to be enacted, not as a corrective measure against double standards, but rather, as a license to get away with murder. \"Shallow Hal\", which featured the immortal line, \"Don't be satisfied with routine p**ntang,\" the dying words imparted by a grandfather to a young Hal, may have been, in retrospect, equally hateful towards women, in light of this somewhat thematically similar offering, which does a poorer job of covering its tracks. A film like Paul Weitz's \"American Pie\" was revolutionary in the sense that it depicted women with lax morals without them having to pay for their impertinent conduct through some corresponding humiliation. The women, clearly, were ahead of the men. Clearly, that's not the case here. All in all, \"Hall Pass\" has the same nineteenth century sensibility so typical of many genre films, reflecting the reactionary attitudes of the distant past in regard to women and sex, in which a respected intellectual(British Particular Baptist preacher Charles Haddon Spurgeon) could proclaim, \"When the goose drinks as deep as the gander, the pots are soon empty, and the cupboards are bare.\" In the film's pivotal moment, goose number one, Maggie(Jenna Fischer), the woman who instigated this whole mess, tells the baseball coach, a man she could f*ck right then and there, that \"this hall pass was never for him,\" the \"him\" being her husband with the wandering eye(played by Owen Wilson), as a set-up for the scene where the movie seemingly punishes Rick for wanting extra-marital physical relations, when the real estate agent comes home to what apparently sounds like Maggie taking liberties with the new rules. For the time being, the filmmaker encourages the moviegoer to loathe her. That slut, you think, and in spite of his unrealistic expectations(he misses Maggie's younger self), you side with him and visualize along with him, his wife's illicit lovemaking with the near-stranger behind that door. She's a mother of three, you think, that whore. That's the double standard. Female desire is no laughing matter, not like when Rick finds himself alone in a room with the hot girl who pours his coffee every morning at the cafe. The filmmaker throws the bare-breasted Aussie at Rick, implicitly as a reward for not getting intimate with his kids' nubile babysitter. Now that would be creepy, getting it on with a twenty-year-old, so by comparison, sex with Leigh(Nicky Whelan) would be relatively moral. But alas, Rick declines her offer, and then, sanctimoniously gives one of those patented speeches favored by the filmmaker in which the protagonist's inherent decency is supposed to cancel out all the rampant misogyny that preceded this sudden apologetic maneuver meant to placate the potentially offended female demographic. This salve against mean-spiritedness can't reconcile the grotesquerie that is the woman with the diarrhea. Unlike Rick and Maggie, Fred and Grace(played by Jason Sudeikis and Christina Applegate) do take full-advantage of their marital exemption, and the difference in tone as it pertains to their respective sanction infidelities, is calibrated, as such, in accordance with the bylaws of the double standard. When Fred has a one-night stand with a cougar, the chastening he gets from the filmmaker is tempered with comedy, as the older woman kicks him in the face, proceeded by gunfire, courtesy of the older woman's son. His transgression is treated as hijinks. It's a completely different story for Grace. Not surprisingly, she's not allowed to enjoy her once-in-a-lifetime fling, since her sex partner, just a pup, is inexperienced, but to make matters worse, the minor league pitcher eviscerates her by bring up their comparative ages, after Grace, believing she has the upper-hand, lets him down gently and is made to be the fool. The next time we see the woman, she's bawling in her car. As it turns out, she crashes. Both husband and wife have nearly matching scars, but why should the woman have to pay for her man's middle age crisis?",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "While not laugh out loud funny, this movie had its funny moments and is a movie that many people could relate to ...... to a degree. As the movie progress's, it is pretty easy to predict the ending well in advance but that is ok because it is funny to see these married men who have been out of the loop for a long time stumble and bumble their way trying to pick up women.  This was a pleasent movie to watch with a couple of raunchy parts, not a classic but not a dud either.",
      "total_reactions": 0,
      "user": "moviefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "\"As Meteorically funny Hall Pass is , parts get taken to an extreme and can be a turnoff for newcomers. Owen Wilson is hilarious Jason Sudeikis is funny equally but not qualified overall Farrley Brothers bring us a funny , decent , not \"so\" special comedy!\" .. B",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "This movie is really lame.  It is not even funny.  It is a oxymoron that \"There's something about Mary\" (which feels to have been made ages ago) was made by the same team.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Look , I don't know. I really liked this movie. I didn't expect to, and for some reason I feel embarrassed telling people that I did. In the end I think this rounds out my top 3 favourite Farrelly Brothers' movies: Something About Mary, Stuck On You, and now Hall Pass.",
      "total_reactions": 0,
      "user": "bhaverty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "The Farrelly Brothers may have lost that outrageous spark that made them famous, but they can still make a movie that's funny and fun. Owen Wilson and Jason Sudeikis are two blandly married men who get permission to take a one-week break from their marriage obligations. The wild time they expect to have only offers frustration for them and laughs for us. While this film isn't wildly hilarious or especially original, there are still plenty of amusing moments and a healthy dollup of grossout. NOTE: Stay thru the credits for a punchline gag AND a funny outtake.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "Very funny and enjoyable, definitely the best Farrelly brothers movies in a while. Actually a good movie for guys to watch with their wife/girlfriend, since the underlying message here is that 'men can't live without their women'. Maybe critics should simply stop reviewing comedies, this is another one they got wrong in 2011 in addition to Bad Teacher and Hangover 2.",
      "total_reactions": 0,
      "user": "nohobobo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Hall Pass offers no surprises or deviations from a typical Farrelly movie -  juvenile sense of humor, outrageous plot lines and an overblown finales. It's a commodity. If you are into the farrelly formula, you ll have a few laughs, simple as that. Hall Pass could have been a great vehicle for Sudeikis. He is given the best set-ups and lines yet seems to make little out of it, whereas Christina Applegate shines in her limited screen time.",
      "total_reactions": 0,
      "user": "istanbul"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "A clever story, but not able to do much with a dried out cast. There were a few laughs here and there but there was just too much CHEESE with no topping to balance our excitement.",
      "total_reactions": 0,
      "user": "PurpleUrp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 2,
      "text": "There is no point in this film. No character, no depth, very few laughs in what is meant to be a comedy. Owen Wilson with his ever-familiar drawl is the highlight but although the sound of his voice is amusing, what's coming out of it is not. The script is meaningless and over-the-top; half of the scenes just feel like filler. Considering that this appears to be an attempt at a touching comedy with some moral undertones about marriage, it seems contradictory that the characters are unlikeable, self-obsessed and completely out-of-touch with everything going on around them. And nearing the final scenes, just when I thought it couldn't get any worse, we see irrational attempted murder and a stupid car chase (but at this point I guess the viewer probably doesn't care anymore).  This film provides more cringes than it does laughs. It's another pointless entry in the waning sex-comedy genre.",
      "total_reactions": 0,
      "user": "JasonG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "If you liked couples retreat, I think you will like this movie. Funny, honest and relatable. Half the time I was laughing at myself as much as the movie. I don't think that either lead roles were cast right, but the movie pulled it off.",
      "total_reactions": 0,
      "user": "llanca1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Basically with the Farrelly Brothers you know the sort of formula you're going to get, good buddy comedy, outrageous humour, with a few shocks.  I may not be a Dumb & Dumber or Kingpin, but it's a lot better than many of the reviews suggest.  Good for a giggle.",
      "total_reactions": 0,
      "user": "TheJaijo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Outrageous but with some laugh out loud moments, basically all you would expect from A Farrelly brother movie. Gets a bit soppy at the end but tends to keep the laugh coming throughout.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "There seems to be an idea going around that if you have some actors, a production crew, and an idea, you should make a movie and you might make some money when people come to see your ILLUSION of a movie, but the deal is.... you actually have to do some WRITING to make a movie, because movies are stories, not an ad of a movie. The writing here is stupid and thin, every decent situation is held up or foiled before it is developed to any payoff. In-between are some guilty chuckles created with filth or obvious slapstick.",
      "total_reactions": 0,
      "user": "lancekoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "There were a lot of \"Yikes\" for me in this phone in. Bad writing or improving? I like the cast but they did not work well together. I see em like I write em. Renter...maybe cable it.",
      "total_reactions": 0,
      "user": "jimmydean"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Fun and funny. This film is another comedy that is worth a rental price, and maybe even a $4 DVD......I got it for that price! Sudeikis and Wilson prove to be a pretty strong team here, and it all works. While this film is ridiculous in nature, it makes for a quite hilarious time.",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Its a Farrelly Brothers movie! What do people expect besides gross out jokes. That's what makes it funny. The theater i was in was cracking up throughout the whole movie. Critics suck at rating movies",
      "total_reactions": 0,
      "user": "boxenford92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "I already hated the film before i even saw it because of ads everywhere yelling \"I GOT A HALLPASSSSSSS!!!\", but my expectations were not disproved. Bad writing and bad acting.",
      "total_reactions": 0,
      "user": "Axelskull"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 6,
      "text": "Id say this movie deserves the reviews its getting, the story was stupid, and the writing was bad at most points, but it was funny, no need to rip the movie apart, it was made to make people laugh, and at most points in the movie I laughed my ass of, it was hilarious at moments, this movie was meant to make guys laugh and thats it, overall I give it a 6/10 but comedy and jokes wise, 10/10 this movie did what it was supposed to, make you laugh and nothing else.",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "Hall Pass has some great laughs. However, it falls short in it's misguided artful meaning. Nudity is minimal and because of this it can't even be placed with other sexual comedies. It's just boring!!!",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Let me start off this review by saying that I was not excited to see this movie. I only reluctantly ordered it but I was pleasantly surprised. It's no classic by any means but, for all it's flaws, it's extremely entertaining. I laughed more during this movie than I have at any other movie this year. I liked that the characters seemed slightly more rooted in reality than those in different movies. Another plus was that the soundtrack seemed to shuffle through my iTunes library. I'm hesitant to recommend it because, judging by the other reviews, people didn't seem to feel the same way that I did. But if you're like me and you're ready to embrace a slight return to form from some slightly grown up Farrellys, then this is the movie for you.",
      "total_reactions": 0,
      "user": "chancewellnitz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "Hall Pass or watch 2 low self-esteem idiots wasting 7 days of their non-marriage freedom. Seriously, this movie is a disgrace to all man. With this movie, the Farelly Brothers have showed, once again, that they're not in the game anymore.",
      "total_reactions": 0,
      "user": "Kallins3122"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Much better than I anticipated.  I am tough to please when it comes to comedy and I even laughed out loud a couple of times with this one.  Well written and very entertaining, especially if you are over 35 with kids.  I just saw \"Just Go With It\" last night which was awful...don't waste your time with that one.",
      "total_reactions": 0,
      "user": "sknorton0722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Hall Pass is a very good film. There are alot of funny scenes in this film and the story is interesting to learn. My only problem with this film is that there are scenes where they are just not funny at all. I would give this a high matinee!",
      "total_reactions": 0,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "Background:a two 60 somethings and one 22 daughter. This movie is CRASS and filthy throughout and also funny. What a shame that we did not check this out before renting; however we did watch until the end.",
      "total_reactions": 0,
      "user": "Mac_Va"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Hall Pass made me laugh out loud a handful of times, the problem is that you have to sit through one turd of a movie just for a few genuinely funny scenes.",
      "total_reactions": 0,
      "user": "blackmagicmarkr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "This movie could have been so much better--but it did a pretty good job and the ending was executed just about perfectly. Got a little sappy when it shouldn't have. Should have stuck to the script. Overall a good movie.",
      "total_reactions": 0,
      "user": "joelschnick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "With Step Brothers, The Hang Over and even Super Bad in the back of the minds of people wanting to watch this flick, this movie will not rank high.  But for the viewers going into this movie with an open mind, it is an entertaining movie that has a story line going along with it.  Quite predictable at times but has many funny parts.  Watch  if you are looking for a fun, silly, cinematic adventure.",
      "total_reactions": 0,
      "user": "AmbroShow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "The review on the back of the DVD said that this movie was one of the best since There's Something About Mary.",
      "total_reactions": 0,
      "user": "danielb1982"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2012
      },
      "score": 6,
      "text": "Its a decent comedy. It is funny but most of the jokes are rather generic but executed perfectly by the cast and the situation they are in. I enjoyed it and thought it was well worth the watch.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "The movie succeeds in one area: the humor, despite being profane, juvenile, misogynistic, and somewhat disturbing at points, nonetheless hits the mark and leaves room for many thick and hearty laughs. On the other side, these moments of humor, though consistent, are surrounded by more dramatic moments, which become more tiresome than anything else. Ultimately the contrast between the drama and the comedy does not work. The actors are incapable of truly dramatic acts and the point that the Farrelly Brothers attempts make  falls to pieces and is almost unidentifiable amongest the sexual humor that pervades throughout. If the script was better written and Wilson and Sudeikis were more than simple comedians, then maybe the film would have been able to take whatever point the Farrelly Brothers were trying to make and actually convey it to the audience. But the truth of the matter is that this film shows us one thing and makes us believe with all out hearts. Owen Wilson needs to stick to comedy and purely comedy, nothing else. But in the end, when I think back to this film, the jokes still stick in my head and I ultimately have to call this a funny and decent movie.",
      "total_reactions": 0,
      "user": "Alexander_Fred"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "I don't know how this film got so many bad reviews, must be because of the lack of humour of some people. The first time you watch this film you should have various moments of laughter, however this is a film that you can only find funny the first time around.",
      "total_reactions": 0,
      "user": "Daryl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2016
      },
      "score": 3,
      "text": "Thanks to this film, the term, \"Hall Pass\", became part of the modern urban vernacular, and while the term was a big success, the movie was not. For some reason, Hollywood film makers continue to think that Owen Wilson is funny, and maybe he is, but personally, I don't see it. I usually just wind up feeling sorry for whatever loser character he's portraying. In this film, Wilson and Jason Sudeikis play two guys who have been married awhile, and are starting to get bored. After seeing mutual friends of theirs divorce, the couples worry that they're headed down the same path. Thanks to some friendly advice from Joy Behar, the wives decide that the men should get a week off from marriage to do what they want, and the rest of the film, follows their antics in trying to pick up women after being out of the game for such a long time. The premise of the film isn't terrible and usually, Jason Sudeikis is pretty funny, but Hall Pass falls flat on it's face. This is supposed to be a comedy, so why does it take nearly an hour for the story to get to the point? By the time the guys are shopping for dates, I was bored and pretty much done with this film. In the second hour, the film does get a little better, but not nearly enough. Owen Wilson and Jason Sudeikis are just two very different types of comedic actors and their styles didn't mesh well at all. If anything their antics together were more stupid than funny, and if there's one thing I can't stand when it comes to comedy, it's stupidity that leads nowhere. It was a good idea, but the writing wasn't very good, the actors didn't mesh, and the situations just weren't that extreme or funny. Hall Pass is just another forgettable film that fails to live up to expectations.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 4,
      "text": "A few minor laughs and decent acting by the cast dont even come close to making up for this film. It fails to rise above the level of a generic comedy.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "With a few laughs and some meaningful moments here and there, Hall Pass fails to rise above the level of a generic comedy with characters as dull as dishwater.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "When it is funny, it really brings the laughs. Although there are moments when they step the boundary into complete wackiness, there is enough actual depth and sentiment to pull the movie back together.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "A good movie but don't expect to find yourself laughing through the whole movie. The cast was good, and while the movie is entertaining, its not really what I would consider a laugh out loud movie. But it has its moments.",
      "total_reactions": 0,
      "user": "Night_Hawk_2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Not a bad film but not a great film either. Maybe if I was older and married I would find this film more funny. Owen Wilson should be able to do better, even if it is as a minture person in a Ben Stiller film!",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "Have the writers forgotten how to make us laugh? The nightmarish Hall Pass would make it seem so. It's just another exploit-all-you-can try hard comedy.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Overly dirty, and not very funny, Hall Pass could have been a lot better.  There are a few funny scenes, but it doesn't keep any sustained comic momentum, or build to much of anything.  In fact by the end it becomes somewhat of a chick-flick.  There are definitely worse comedies, but it won't hurt to skip this one either.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "The Farrellys are an acquired taste and not for everyone, but their fans should find some hearty laughs sprinkled throughout Hall Pass' swift 98 running time.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2016
      },
      "score": 4,
      "text": "This movie was just boring! It wasn't like \"mind-numbingly awful,\" it was just painfully dull! \"Hall Pass\" has some likable stars and a few nice messages, but it's flat-out boring, really unfunny and, as I said before, extremely dull. It's not the worst thing you'll ever watch, but \"Hall Pass\" is an extremely dull and unfunny affair that you should probably skip out on.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "The premise was stupid, the movie was not very believable and it wasn't particularly funny. At least the acting was pretty good and the movie was kind of entertaining. Overall, it's a very average movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "Owen Wilson has been a pretty solid guy in comedy movies for more than a decade but now it finally looks like he is starting to go downhill. Jason Sudeikis is also a guy who pretty much funny in everything, but these guys were both average here. Hall Pass is a movie that is for middle aged males, it may not be considered funny if you are a young unwed male like myself. I did have a few laughs scattered all over the movie but this movie is not comparable to movies the stars have already been in. This movie is really hit or miss.",
      "total_reactions": 0,
      "user": "ydnar4"
    }
  ]
}