{
  "mc_avg_user_score": 5.0,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 19,
  "mc_movie_name": "Hannah Montana: The Movie",
  "mc_negative_rating_frequency": 59,
  "mc_positive_rating_frequency": 61,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "definitely worth a try.",
      "total_reactions": 1,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 2,
      "text": "Hannah Montana the Movie just ends up being a crappy episode of the show stretched into almost 2 hrs of a movie. And it features just awful performances especially from Miley Cyrus. I give this movie 23%.",
      "total_reactions": 1,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "At first when I heard about this movie, i thought it was going to be horrible and I never did see it in theaters, but like maybe about 3 months after it came out on dvd, i decided to give it a try.  I thought it was okay, it wasn't horrible, but wasn't that good.  I thought the songs were great, the humor was okay.  But something about the movie really irked me.",
      "total_reactions": 0,
      "user": "guardboy21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Although HANNAH MONTANA: THE MOVIE is mostly awful, especially compared to the fairly decent \"Disney Channel Original Series\" of its basis, but it's sad to say that this is one of Miley Cyrus's best films yet.",
      "total_reactions": 0,
      "user": "Spielberg00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "It brought so much tear for me.Love the movie,love their acting and how they grow up,this is a really good movie,great music.You can learn the importance of family .Love it",
      "total_reactions": 0,
      "user": "maluita659"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Let me be real Ima 16 year old guy and I took my little cousin William, friend Scott and my girlfriend came with her little sister Sarah and older sister Natasha we are in the range of 16, 16, 7, 9, 17 and 16 and to be honest we enjoyed it, while nothing special entertaining it was. The idea of superstar going back home to get back in touch with her roots (Something Lindsy Lohan should do) was refreshing and good. Hannah Montana oh good even I liked the finale two seasons of the show. and about 8 songs entirly. This is good Miley Cyrus can act, sing she has a weak voice and pitchy one. But come on I found nothing really bad to say with the movie a good family movie. This is coming from a guy, everyone even guys just watch it, you might actually like the movie (You might not enjoy ever song or even one but). Let's Get Crazy, Let's Do This, You'll Always, Game Over, What's Not to Like, Spotlight, Dream, Don't Walk Away were pretty decent songs to hear, not gonna be on my iPod but might keep a couple on my compute. The Climb.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "This movie is just fulled with cliche's the daddy/daughter bond, te teenage attitude. Apparently Cyrus is just unlike able, in the most annoying way as possible an order to make a \"girl movie\".  She cannot so .......why like this movie?",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "That's has a good story, but i think it's very exclusive.. It's more directed at women kids, and the channel is watched for all the geners! And i think this actress Miley Cyrus bad, she's like... no reaction.. soft.. She's really  better singing then acting!",
      "total_reactions": 0,
      "user": "DeividAlves_"
    }
  ]
}