{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 78,
  "mc_mixed_rating_frequency": 200,
  "mc_movie_name": "Harry Potter and the Half-Blood Prince",
  "mc_negative_rating_frequency": 128,
  "mc_positive_rating_frequency": 699,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "My favorite film in the series and imo this is the film where the franchise is at its peek. Radcliffe is at his best in this film imo and it shows in this film. It also does a great job bring the book to life and does well to make an emotional connect with you as well.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Half-Blood Prince had potential to be the best, most magical Potter film yet. Instead, the movie veers unspeakably off course, not at all staying true to the novel, and ends like a light being softly lowered, when the novel ended in chaos and bloodshed.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Very entertaining and very intriguing at some points too. This movie looks amazing, has an incredible score and great acting. Maybe not a flawless movie, but the flaws it had weren't bothering me.",
      "total_reactions": 1,
      "user": "Rutger-Kikkert"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "Not great, but pretty good. It's one of the weakest films in terms of interest in the story and fun, but the film definitely has emotional power, and Radcliffe is at his best by far here. Everything seems determined to gear up for the final entry in the series, which will likely make or break this reasonably successful film franchise. The momentum built up by this film is pretty substantial near the end.",
      "total_reactions": 5,
      "user": "nboley08"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "David Yate's Harry Potter is not magical anymore. The movie spins confusing romance between the 3 main protagonists and also focuses more on the violence of the scary Voldemort. This is not a franchise I was hoping to watch....",
      "total_reactions": 12,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Dazzling visuals, some incredible performances stand out Emma Watson, and some emotional depth make this easily one of the best film's in the franchise. I give this film 95% of a good movie.",
      "total_reactions": 10,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "Although the movie did follow the book very well (the best since #2), the movie was incredibly slow and boring, and the since that they added made no sense at all, like the weasley's house fire scene (what was that?).  Also they barely mentioned the Half-blood Prince and really didn't go in depth or include enough on the memories of Tom Riddle which was very significant in the books.  The magic and effects also seemed very cartoonish instead of real and authentic.  (Bring in Peter Jackson Please!)",
      "total_reactions": 4,
      "user": "GoldenEye16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Half-Blood Prince is one of the best Potter films. It is dark, emotional, and sleek. The acting is great (especially Alan Rickman) and as always the score is stunning. Those who haven't read the books will find it better then those who have, but fans of the book will still love this. I didn't much like how they sort of brushed over the very important Half-Blood Prince thing, and just have Snape randomly say it at the end. But that aside, this is still a fantastic movie.",
      "total_reactions": 2,
      "user": "AtTheMovies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is different than most other Harry Potter movies with the whole teen relationships thing and the introduction of horcruxes. Slughorn is a great character and the meetings with Harry and Dumbledore are very entertaining, making a perfect set up for the ending",
      "total_reactions": 2,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Director David Yates takes the wizard world into a darker and sentimental area that not only succeeds, but paves the way for the final installments to pick up to.",
      "total_reactions": 2,
      "user": "geo333"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "As Harry learns that Hogwarts is no longer safe, he and his friends do a lot of important things that lie just ahead of them while he finds out that his arch-nemesis, Draco Malfoy made an unbreakable vow that if he doens't kill Professor Dumbledore, Professor Snape will kill him himself. With him dead, Harry is given a note that he faked the deathcrux, the only key to Voldemort's immortality in which he and his friends will succeed in finding them. Saw it with my sister in theaters at the same year and now I will make my opinion just to make this review short. The acting.....amazing The fantasy action.....great The storyline.....well-paced The sad where Professor Dumbledore dies.....so sad it will make you cry your eyes out. The characters.....a little bit developed, but were amazing Harry Potter and the Half-Blood Prince is a dark, emotional, and funny entry in the series. 8/10",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2010
      },
      "score": 0,
      "text": "The movie is totally unbearable. The acting is poor and unnatural (how old are the characters supposed to be???), the plot is awfully idiotic. Frankly speaking, I watched the second half in double-speed, because I didn't want to waste too much time on this crap (I could turn it off, of course, but I had Hope that the ending would be great; it wasn't). The book is great, though. I'm trying to forget this movie poison.",
      "total_reactions": 1,
      "user": "ganek2010"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "It is better than the Order of the Pheonix it's still not as good as the previous movies, it's better because they brought back the humor but it still kept the darker tone and brings tension for the next film.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "It was way too long. But I was entertained but then again, I was bored at some parts in this movie.",
      "total_reactions": 2,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2011
      },
      "score": 3,
      "text": "This is without a doubt the worst movie of the Harry Potter series.  It took a book that was extremely thin to begin with and chopped half of it cleanly away, ending up with a montage of broken scenes where months pass in a second and a single day takes an hour.  Sometimes it tries to be an action film, sometimes it tries to be a comedy, sometimes it tries to be a suspense thriller.  In the end, it's just a mismatched rehash of what David Yates saw as the most important scenes from the source material.",
      "total_reactions": 1,
      "user": "CRL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Harry Potter seems to be gathering for the big battle but much too slowly. Someone like me  the wait is becoming long and this movie is prolonging it even more. Still well made but you can begin to see it is getting rough around the edges. Get to it already.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "I found this film boring for almost all of it. I really just did not like this one for some reason. It was just never for me. But you guys might like it but I don't. Harry Potter and the Half-Blood Prince 3.9/10",
      "total_reactions": 3,
      "user": "watithink123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Half-Blood Prince had potential to be the best, most magical Potter film yet. Instead, the movie veers unspeakably off course, not at all staying true to the novel, and ends like a light being softly lowered, when the novel ended in chaos and bloodshed.",
      "total_reactions": 1,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "This movie has no idea what to focus on, the love, the humor, the threat on the wizarding and muggle world? Easily the worst Potter film. A film so uneven in scenes and tone, I think this movie was an unintentional comedy, and not exactly a good one.",
      "total_reactions": 1,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "This movie has no idea what to focus on, the love, the humor, the threat on the wizarding and muggle world? Easily the worst Potter film. A film so uneven in scenes and tone, I think this movie was an unintentional comedy, and not exactly a good one.",
      "total_reactions": 1,
      "user": "Aaron_Wasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "It's bizarre, but this didn't really FEEL like Harry Potter. It's quite lucky that the film manages to blend mystery, comedy, and romantic general life issues together without being a total failure - much like the book.",
      "total_reactions": 0,
      "user": "GavGav96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "story is as of that book. some changes made and it was not gripping. screenplay is the fault here. the story with a cause must be really motivating. but screenplay fades in the first half after 30 minutes and goes dull with all unnecessary scenes for about 20 minutes. however rare interjections of some memories were present. but still i felt that the movie dragged deeply. second half came and again movie had slow impact for about 20 minutes or so. some romance and fun scenes are not at all necessary and it disturbed the narrative deeply. any way the last  20 minutes was very good and movie concluded to a perfection. direction is top notch and thats why i feel that the movie is good. neat performance by daniel emma and rupert. micheal gambon\"s performance is good. alan rickman was good in his limited role. rest all did perform good. the lead casts were perfect and thats the driving factor for the movie. technically speaking rich visuals and some eye popping special effects in the climax cave sequence along with teleportation was very good. editing needed a better work. if i had been editor i would have trimmed it altleast for 20 minutes or so. the main scenes did not get focus. the climax is cliched and ended suddenly. even though movie is 150 minutes nearly. it was entertaining for about 100 minutes. the remaining 50 minutes was nothing but real boredom. finally half blood prince is good in parts and great in certain parts and worst in some sections. i recommend the movie.",
      "total_reactions": 0,
      "user": "sreekiran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "While certainly not perfect, and perhaps a tad disapointing, it till delivers one of the better films of 2009, outshining the occasionally bland Avatar and delivering a rather faithful bit of fan surface too. Not the best film ever, perhaps not even the best Harry Potter film, but it's essential for Harry Potter fans, and a well directed film, with some major back up from it's source material.",
      "total_reactions": 0,
      "user": "Susano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "If you can resist the fanboy urge to pick apart every plot detail and scour all the scenes for inaccuracies, you'll find yourself watching probably one of the most enjoyable and well-crafted movie in the film series so far (but I think by now it's just become a sad tradition for the movies to have cop-out endings...)",
      "total_reactions": 0,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "I never thought I'd see the day that a Harry Potter movies disappoints me. Unfortunately, that happened with Half-Blood Prince, the only Harry Potter movie I dislike. I understand that there will be changes from the book, but my God, it's like they completely changed the story!",
      "total_reactions": 0,
      "user": "gm101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The series only continues to get better! This film is definitely the funniest Harry Potter film so far, as well as the most emotional, and its definitely up there for entertainment as well. The middle section of the plot is slow and not much happens, however this is made up for by the brilliant opening and climax. The acting is the best so far and the visuals are stunning, this is truly an excellent film and I found it highly enjoyable, despite a few flaws and areas that I would change here and there. If you're looking for pure action though, this is not the film for you, and perhaps that is one of the few let downs of this film. 'Deathly Hallows' will hopefully improve on that.",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Absolutely satisfying! Atmospheric and darker than any previous film, it succeeds in staying loyal to the book as it brings on screen all the things we loved from J.K. Rowling. Superb visual effects and score! It is really epic! Daniel, Emma and Rupert prove their talent! I was really amazed about how all these inversions in the plot fit only in a two and a half hour film! Loved it!",
      "total_reactions": 0,
      "user": "geo_thebest"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "As the 6th one begins, not only Hogwarts is in danger, but the muggle world too. No longer Harry is a small child that was almost killed by the darkest and one of the most powerful wizards in history, but fans know that the end is near. Soon Voldemort will come out of hiding and meet Harry. Fans will find the secret to Voldemort's immortality and the wizarding world could never have been more dangerous. He still has Ron and Hermoine to look up to, but it is no more fun and games. The movie however, was. Impressive special effects and groundbreaking sequences events, turn this into one of the most intense films of the entire franchise. David Yates amazes me again, and audiences will be anticipating the end for the final 7th installment of one of the world's most successful franchises.",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "This has to be the best Potter movie.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "By the time the Half Blood Prince arrives in the Harry Potter franchise, it's pretty much bulletproof. Great movie after great movie after... You get the point. The characters have become so well defined and lovable that something would have to go really wrong to put a dent in the series. Nothing of that kind even remotely happens in the Half Blood Prince. Indeed, the concentrated character development in this action-lite entry makes for a fantastic diversion before the thunderous two-part finale.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "While Half-Blood Prince isn't perfect, it sure expands upon the Harry Potter feel like no other. The plot here is sticking to the main plot, but missing out on the cool side stories. Th performances are the deepest than before and the visuals make the film a great watch! There wasn't as much action has before, but this addition is still entertaining to watch!",
      "total_reactions": 0,
      "user": "AlnORTIZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "The most hated movie by most fans of HP, because it was unfaithful through the book. However this is by far the greatest success of Half-Blood Prince. Although it has cut some important memories and said little about the Horcruxes, the greater freedom in adapting that Kloves had ended up making this the best film in the saga (until he came Deathly Hallows, of course). Yates has also improved a LOT, and achieves good moments of humor and manages to emote in some scenes. The performances are very good this young. Radcliffe shows good comic timing, and Grint. And Emma Watson makes a beautiful performance here. The adult cast, as always, is wonderful. Alan Rickman, Michael Gambon, Helena Bonham Carter and Jim Broadbent are simply fantastic. Great visual effects (the second best of the series), a beautiful photograph and a wonderful soundtrack make this one of the best technically as well.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Setting things up for the finale in style this is the best movie of the series so far. it is here that the characters truly move from childhood into early adulthood and face the hardships of retationships as well as their positions within Hogwarts. It also delvelops the sub plots nicely and brings them into the fore.",
      "total_reactions": 0,
      "user": "rotku"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Watched it today, and i liked it. i loved to watch my fantasy which was the book come to life so i can not only watch but read my way along side harry and his friends battle throughout the wizarding world. except for cut out scenes, and edits to scenes changing what i viewed in the book, i loved it",
      "total_reactions": 0,
      "user": "Blu_Bird"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "The best film in the Harry Potter Franchise so far. Half-Blood Prince is exciting, refreshing and stands on it's own. Some of the Potter films lack whither it is story line or direction. The Half-Blood Prince finally completes the triple threat well acted, perfectly directed with a killer script.",
      "total_reactions": 0,
      "user": "filmtrashreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "This Harry Potter film has a feel to it which no other Harry Potter film has. It's has a perpetual and omnipresent tone of darkness and subdued magic, brought on from its spectacular score and superb acting. It certainly is an interesting creation, compelling the audience into the story throughout. It's certainly not the best Harry Potter film, but, by no measure, is it the worst. 8/10",
      "total_reactions": 0,
      "user": "Hasriona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Like \"Deathly Hallows, Part 1\" the film doesn't focus on action or story development but it focus on the characters and how they have been affected by Voldemort and his followers. Delbonnel's cinematography illustrates that well, depicting the world as we know as not innocent anymore, but as dark and frightening. However, Half-Blood Prince feels a way too long and doesn't add almost nothing to the future story.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "An excellently crafted sixth installment in the most successful film franchise in history. It's dark, intense, emotional and occasionally quite funny as teenage hormones run rampant throughout the halls of Hogwarts, despite many additions and cut-outs from the story. Not like it matters, but it's just a little disappointing for the die hard fans. Also I found that the pace was a little too slow, thus weakening the momentum of the film. 3 1/2 out 4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "The series still entertains after this many movies.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "As the franchise nears its end and the run time ticks on in the Half-Blood Prince, we are me with the realisation that the sixth instalment really serves as an adjoining film, and while the acting is superb and the older members of the cast are given their moments, Harry Potters new adventure lacks the heart and magical escapism that most of its predecessors possessed.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "I havent liked the HP series that much so I didnt have a lot of hope for this film but I was suprised that I actually really liked it. I thought it did a good job staying true to the book and it was nice to see Michael Gambon (Dumbledore) get more screen time and show off his skills - Unlike the other films hes in. It was well worth watching.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "(September 25, 2009)",
      "total_reactions": 0,
      "user": "T-rAv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "The most foolish Harry Potter movie, but it is better than The Order of the Phoenix. Because it is darker, more funny, creepy, sadly and enjoyable. But is is very far from the book and there were somethings that were missing and were necessary  to understand the story.",
      "total_reactions": 0,
      "user": "javis10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Harry Potter and the Half-Blood Prince is a 2009 fantasy film directed by David Yates with Daniel Radcliffe, Emma Watson, Rupert Grint and Michael Gambon.",
      "total_reactions": 0,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "This is the first time in this series where I can honestly say that the movie was every bit as good as the book... though, for different reasons. You see, there is not all that much adventure and action sequences in the book so, while it doesn't drag because the characters are and plot development is outstanding, it still felt a bit on the long side. This caters perfectly for the movie. The challenges in fitting in all sorts of scenes are completely different than those in fitting in various emotions, which is what they faced when making this movie. In capturing those emotions, thoughts, moments of internal conflict, etc. they did a fantastic job. The only thing I thought they could've done a better job of was making Dumbledore's exit a bit more emotional like it was in the book. Still though, they did a great job there in general so that's not the reason I didn't give it a perfect ten. That reason lies with the fact that they hinted towards things in this movie that were not so profound in the book. I have not finished the final book yet so I can only speculate on some of the things I was already wondering but it seems as though, regarding Severus Snape, that they took advantage of knowing the ending of the entire story rather than the particular book itself. By knowing this, it seems as though they hint a little more at certain elements of the story than the book did causing you to think entirely differently about the act that took place. Nonetheless, this movie was still outstanding and I look forward to watching the final one(s).",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Unfortunately, this one takes departures from the book that didn't really sit well with me. It was, namely, the decision to take out the two most emotionally rousing scenes in the book - the battle at Hogwarts, and the white tomb, and replace the empty screentime with a shot of the Burrow burning down that never happened in the book. But despite this, the film is arguably the funniest out of them all. It's probably the worst of the lot, but it's still great.",
      "total_reactions": 0,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I haven't read the book, so I can't compare the two. Also, I watched \"The Order of the Phoenix\" the night before seeing this one, which may have been a mistake...",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "The most dark chapter of the saga. I think that is really interesting, but have a big problem, much of the magic things in the other films, don't stay in the six part. Is good, dark, but some strange.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "My curiosity is still present. But it's damped once more by David Yates mediocre direction of this fantastic installment of the Harry Potter series. It's disappointing to see such stunning visuals and a, by now, legendary cast go to waste.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "A decent well made movie, but still below average for a Harry Potter film. Too many of the comedic scenes seemed forced and unnecessary when there is so much of this important story to share. I get the weird feeling that so many things were left out of the movie. The movie picked up toward the end, but it doesn't have the feeling of what Harry Potter should be.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I’ll be honest. While I still stand my opinions, I felt like I have been biased reviewing the Harry Potter movies as a fan of the books. In Order of the Phoenix (my favorite book in the series), I have been trying to watch the movie as if I have never read the book, and it seemed to have worked for me a bit despite I am a bit upset with some of the changes. What matters most is I enjoyed it and I did enjoy it.",
      "total_reactions": 0,
      "user": "JrAgujaIsAGleek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "The war is on between good and evil. Just a shame I cant remember much about it. HP:HBP wasn't boring like OotP but it was just forgettable with samey SFX used in all the previous films and poor choice of what bits to include from the books and what not to pick. It was a good, entertaining film but nothing more than filler for the final instalment.",
      "total_reactions": 0,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Director David Yates returns to direct the sixth film in the franchise, \"Harry Potter and the Half-Blood Prince\". Realizing some of the weaknesses in the fifth film, improvements has been made but some remain. There's a bit of Quidditch this time round, and there's more delightful scenes. However, Yates puts too much time on the romantic and not enough on the actual plot itself.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Another winner for Mr. Yates! He does a terrific job changing the tone from sad, to scary, and even to funny. And the humor is this film is great! It had me laughing out loud at several scenes. Oh, the magic!",
      "total_reactions": 0,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Best of the series.It's the darkest, most thrilling, and emotionally deep fantasy film ever.Great CGI sets and visual effects, breathtaking cinematography and marvellous performances from every single member of the tremendous cast.It is a dramatic triumph.",
      "total_reactions": 0,
      "user": "talhalafci"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "I love this Potter! Paranoia is pumping in the veins of Hogwarts. Yates does a brilliant job with number 6. It is dark and gloomy, but also quite funny. Although humor and darkness make themselves presence, one can't ignore the feeling of sadness. Well done!",
      "total_reactions": 0,
      "user": "FilmEqualsJoy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "Everybody loved this one because it centered on teens love life but in general even though it was better than the first two it followed the book least then any of the other movies. However it was very emotional,humorous,and some what exciting. So it wasn't a huge failure.",
      "total_reactions": 0,
      "user": "jfrotylpe532"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "A vast improvement on the last movie, and yet it also manages to be utterly underwhelming.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "Harry Potter is a lot more darker than ever it is defiantly a PG-13, it is turning to sexual subjects, a darker past but a well pleasing art!",
      "total_reactions": 0,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "The Half-Blood Prince is my favorite book of the entire series of HP, but I can not say the same for the movie is very good, but something is not completely convinced. Harry Potter and the Half-Blood Prince, the book, is undoubtedly one of the strongest chapters in the saga of the boy wizard, not only marked by the evolution of the characters, but by the presence of factors that keep the fabric of the child for get into a world more real, closer to us, more full of risk, of chiaroscuro, of stories that sometimes conclude without happy endings.",
      "total_reactions": 0,
      "user": "forestville"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "A tad slow at times, but the half-blood prince is the best movie in this entire franchise for keeping dialogue moving at a slow pace, WHILST keeping it interesting as well! Finally! Also, more dark fantasy action to be had (not as much as goblet of fire) and a more dark and sincere tone to it, building up for the grande finale.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "How disappointed could one be. Harry Potter and the Half-Blood Prince is such a huge letdown when it comes to entertainment. Could it be anymore boring than it was? It felt like nothing important happened until the last 25 minutes of it. Easily the worst in the series. Sure, the special effects and the performances were good.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "The begging of the end! AMAZING story and movie! If you're a Harry Potter fan and you watched the previous parts, this one will definitely Thrill you! I'm not going to add any spoilers, my final score for this amazing Harry Potter movie is 8/10!",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "It's better then all but something happened. It's like the action came up and (I was on the edge of my seat) then it fell fast. The effects were less the perfect. But hey entertained me more then the others. Watch if your a fan, nothing more her spectacular as the so-called critics say. More bore then roar.",
      "total_reactions": 0,
      "user": "MarkMusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "This one was an exceptional movie. The cinematography was beautiful, the story was interesting and engaging and it starts to introduce us to the bitter end of the beloved climax. Overall, a beautiful Harry Potter film. Be sure to check out my YouTube channel, \"TheMovieManLife\" for all things movies.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "In my opinion, the worst movie of the Harry Potter saga...",
      "total_reactions": 0,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "Perhaps the best in the movie series, and the movie of the year. Despite disappointing some cinema-goers with a total remove of the fun and playful magic seen in the earliest movies the film stays as close as it can to it's page-turning roots. The life and death of the later books are well reflected in this movies. With only some disappointments to the book-readers such as the anti climax \"fight\" at the end. Managing to retain most of the actors youthful appearances added to the atmosphere. This proves any doubters harry potter can still make a fantastic translation to the screen.",
      "total_reactions": 0,
      "user": "Pranay6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Among more hits and less error Harry Potter and the Half Blood Prince is better than its predecessor!",
      "total_reactions": 0,
      "user": "BrunoAD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Note: The following movie is darker than a usual PG movie, so for the best, it is certainly a PG-13 movie with more romance, another important note, it may causes a shock from how outstanding the visuals are, and the story is just magical, and another note, this sequel proves that Harry Potter saga is everlasting movies and books, that will be written in our hearts for life.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "This film is fantastic!  Full of fantasy, comedy, heart, emotion, a very well written script (while it may not be 100% faithful to the book, it still keeps in the most important parts and adds some great stuff in there), awesome cinematography, spectacular acting (everyone in here is fantastic!), eye popping visuals and beautiful music (Nicholas Hooper really does a perfect job here): this film boasts it all.  This is another one of the BEST Harry Potter films.",
      "total_reactions": 0,
      "user": "DibbHansen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Harry Potter and the Half-Blood Prince is a great movie, but it contains slowness and boredom.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "An improvement from 'Order of Phoenix', 'Half-Blood Prince' draws a little more macabre intentionally to it's style, most likely imitating Alfonso Cuaron's 'Prisoner of Azkaban'. But now I think this was it for me for Harry Potter as I've already read Deathly Hallows, and even if I didn't, The ending is obvious and cliched. Harry Potter became annoying after this. I just waited four years to say it.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "the half-blood prince was a good film but unfortunately it hadn't had the aclaim of the incredible book.David Yates had make a good movie after all and had won my respect.",
      "total_reactions": 0,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "'The Half Blood-Prince' gives fans and viewers looking for both character-driven stories as well as more tense, dark magical premises the best of both worlds.",
      "total_reactions": 0,
      "user": "nickrovert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "With the sixth installment of the eight part series, Harry Potter continues its success with ease. Good acting, good dialogue, and well paced sorcerer battles.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "I was very disappointed with this movie. I watched all the movies except this, and I loved them until the Half-Blood Prince. The plot is very gloomy and full of holes. There is no exciting deathmatches with wands, only a bunch of sloppy Avada Kedavras. I did like plenty of parts, but the disappointment watching this was a bit overwhelming. The movie seemed impressively rushed, and you might as well not watch this unless you are a die-hard Harry Potter fan.",
      "total_reactions": 0,
      "user": "SomeGuyYouDunno"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "Not worth the extra year waiting for this film...from an original november 2008 release to a july 2009 release. Potter 6 has alot to love but suffers from the attention to teenage hormones and comdey rather than the story or elements of the book which are far more important.",
      "total_reactions": 0,
      "user": "AaronWasserman2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort's defenses and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information. Meanwhile, one student remains aloof. He is determined to make his mark, albeit a dark one. Love is in the air, but tragedy lies ahead and Hogwarts may never be the same again.",
      "total_reactions": 0,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "A pesar de que no tiene en gran parte, absolutamente nada que ver con el libro, The half blood prince es mejor que The Order of the Phoenix en todos los sentidos, la narrativa es superior y mucho mejor, a pesar de que no respeta el 100% de la historia original y de ser una historia oscura y dramática pase a ser una comedia romántica con toques de drama y suspenso, la historia funciona. Es entretenida, pero se queda corta en comparación con las primeras cuatro películas de la saga.",
      "total_reactions": 0,
      "user": "JohnMasterL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Perhaps the funniest Potter installment that features a relatively dark atmosphere which is welcome for fans of Prisoner of Azkaban. The best visuals in the series can be found here along with the talented Jim Broadbent as Horace Slughorn!",
      "total_reactions": 0,
      "user": "DBPirate1129"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "This one gets everything right, giving us the best of what the world of Harry Potter has to offer; the music, the Quidditch, the comedy, the characters, and it doesn't skimp on anything.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2016
      },
      "score": 8,
      "text": "The somewhat penultimate installment of the \"Harry Potter\" stories by J.K. Rowling leads us closer to the end than we ever anticipated, with 'Harry Potter and the Half-Blood Prince', we see our main heroes nearing adulthood and adapting to bigger changes. Plus, we get an insight to how the Dark Lord can be defeated.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "The sixth Harry Potter movie is essentially a film in limbo. It begins with a wordless shot of Harry (Daniel Radcliffe) still reeling in emotional agony from the events of the last movie, and ends on a miserable moment with no sense of hope, or of a plan for the future. Those two anguished sequences set the tone for a fantasy-franchise installment that’s more about atmosphere than story; between them, many things happen, but only the last 20 minutes or so have real repercussions. The rest is buildup, backstory, and plot sidebars signifying nothing, but it’s mighty artful nothing, in which beautifully designed and composed shots and a relentlessly ominous mood give a surprising weight to adolescent love affairs and an exceedingly minor mystery.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Harry Potter And The Half Blood Prince is the funniest of the Harry Potter's. I believe that a long running franchise should at least have one movie in the series to be the funniest and that's were Half Blood Prince stands. The movie still keeps that Harry Potter feeling and I did shed tears at the end, but Half Blood Prince is the best summer movie of 2009 and one of my favorite Harry Potter movies!",
      "total_reactions": 0,
      "user": "damien_k98"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Once again another great pull-up by Warner Bros. as the franchise begins to have the end soon in their next film which comes out the year after this came out.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "EU NUNCA ASSISTI ESSE FILME COMPLETO, 'APENAS LIVRO, O QUE É MUITO BOM ENFIM... EU ACHO UMA BLASFEMIA NÃO TEREM POSTO A HERMIONE COM O OLHO ROXO APÓS TER LEVADO UM SOCO KKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKKK",
      "total_reactions": 0,
      "user": "calouro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "This is my fourth favourite in the series (behind the Goblet of Fire, the Philospher's Stone and the Deathly Hallows- Part 2). It is very captivating and has amazing special effects. The acting is perfect in this, and does an excellent job in setting up the Deathly Hallows movies.",
      "total_reactions": 0,
      "user": "superbat"
    }
  ]
}