{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 25,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "Hatchet III",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 9,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rob Staeger",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 60,
      "summary": "There's no shortage of visceral, gross-out thrills."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 50,
      "summary": "There’s something curiously underwhelming about the blood-soaked mayhem on display in Hatchet III."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 40,
      "summary": "The execution, however, leaves something to be desired, as this effort seems more visually muddled and choppier than previous installments."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 30,
      "summary": "Too busy with limb-severings and gunfire to bother being intelligent."
    },
    {
      "critic": "V.A. Musetto",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 25,
      "summary": "Will there be a “Hatchet IV’’? I shudder to think about it."
    },
    {
      "critic": "Nick Schager",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2013
      },
      "score": 25,
      "summary": "A film that plays like a long, tedious inside joke for fanboys."
    },
    {
      "critic": "Drew Hunt",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 25,
      "summary": "BJ McDonnell, too hesitant to stray from the beaten path set by Green's previous films, lacks the looser, more whimsical hand that would have allowed Hatchet III to transcend its thoughtlessly imitative state."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "summary": "The crowd that likes these things will certainly be psyched. Everyone else, not so much."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "I missed out on the previous Hatchet films, but I really had a good time watching this. The gags were great. hilarious set ups, but always satisfyingly gory, and there's no cgi to ruin it. I liked the witty dialogue, even though its purposely cheesy. There's a few horror cameos that surprised me for a low budget movie. After seeing this I had to watch the previous film the next day on demand.",
      "total_reactions": 1,
      "user": "MakoSucks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "Hatchet III is extremely scary and disturbing, with tons of blood and shocking scenes with a really interesting plot, it starts kind of slow, but then it gets really intense  It is extremely good and incredibly scary and terrifying, nothing is so new, but the Hatchet series is kind of original and great, still it is the weakest of the series but it doesn't make Hatchet III not good!",
      "total_reactions": 1,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is very striking with more horror than the previous plot giving a special touch on a sequel so well done. Deaths are more violent and more serious than the previous film. It's like Friday the 13th, but much better with more techniques and more deaths. I think this movie deserves to win awards for excellent performances and especially Danielle Harris is more acclaimed playing the role of Marybeth.",
      "total_reactions": 1,
      "user": "Enrique20"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "Hatchet III is everything you hate about horror movies, it is a low budget stupid and boring horror movie, uneven with predictable jump scares and action sequences, it is full of cliches and outdated ideas, Hatchet (original) is the best, don't even try watching this threequel, is is dumb and repetitive.",
      "total_reactions": 3,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2014
      },
      "score": 6,
      "text": "Hatchet movies never were my type of horror-thriller. But I do enjoy the gore yet find hard to peep with wide open eyes because killing were very brutal even though I know it is fake. Like previous two, this the third installment was not bad at all. I can say third time lucky. The story followed with new characters and one unchanged, any guess? Victor Crowley. Without him this movie is nothing.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "2 points for the two laughs it gave me, other than that it was a waste of my time. Danielle's accent was all over the place, just like the second. Sometimes it was great, sometimes if was non-existent, and sometimes it was downright terrible. The kills were the same old same old. It was pretty much a film by numbers \"Hatchet\" edition.",
      "total_reactions": 1,
      "user": "bigtakilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "Hatchet 3 manages to be submersive and scary with a bloody hell blood ride but depresses towards the end and just gets SAW head slasher gory flick for the audience to snooze around.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "This movie is a DISASTER!The story is stupid,the acting is bad,the blood looks like kool aid and isn't even scary.It is just like most really bad horror movie sequels.",
      "total_reactions": 0,
      "user": "LTR"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "This movie was better than the last 2. Which was not hard as they lacked proper pacing. Both movies had all major deaths occurring in the last 20 minutes of the film. This film is just gore throughout which is a major improvement. However, the acting is terrible with the main character Mary-Beth stuck between being a snarky badass heroin and a whining idiot. Everything you expect to happen, happens. There's no surprises. If you expect a brilliant film, you're going to be disappointed. If you expect an average horror movie, you'll have a decent time as it hilariously doesn't take itself seriously.",
      "total_reactions": 0,
      "user": "ii_like_bl00d"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Not as good as the second but it was still an entertaining gory movie.The story might not be as interesting as the previous ones but, it was the grand finale and if you saw the first two, you can't miss this one.",
      "total_reactions": 0,
      "user": "Meth-dude"
    }
  ]
}