{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 101,
  "mc_movie_name": "Hercules",
  "mc_negative_rating_frequency": 40,
  "mc_positive_rating_frequency": 153,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sherilyn Connelly",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "Johnson is genuinely talented. He's often the best thing in bad movies, and Ratner's Hercules is, at the very least, pretty good."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "The mythically powerful demigod is back on the big screen in the simply titled Hercules and the results are canny, fast-paced, and, for what the film attempts to accomplish, enjoyable."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "It may sound like a backhanded compliment to praise this sometimes cheesy movie for never taking itself too seriously, but in a summer of bloated spectacles, this modesty should not be underestimated."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "It’s a grandly staged, solidly entertaining, old-fashioned adventure movie that does something no other Hercules movie has quite done before: it cuts the mythical son of Zeus down to human size (or as human as you can get while still being played by Dwayne Johnson)."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 67,
      "summary": "If anything gets lost in the mayhem, it’s Johnson’s reliably charming personality."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 67,
      "summary": "Unsurprisingly, Johnson makes for a perfect movie-star Hercules, and the film gets a lot of mileage by playing his charismatic-but-modest take on the character off of the strong, predominantly British cast."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "There's a welcome lack of pretension to the proceedings. Stalwarts like Hurt and Ian McShane are on hand to class up the joint — everyone's got a British accent except for Johnson — while the predictable story bludgeons its way towards an inevitable conclusion."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Brett Ratner remains a director of no great distinction, but here, he proves himself an adept orchestrator of battle scenes, clearly presenting the forces on both sides, and using clear, coherent editing and dynamic compositions."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Hercules has no right to be as entertaining as it is."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Fast-paced, funny, and packed with – to indulge in a bit of ad-speak — eye-popping action."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Sure, the film is crude, calorific and full of groanworthy half-jokes, but it holds together. It stacks up as an oafish pleasure for an undemanding summer – a rewriting of myths in scrawled crayon, with a nonchalant quality that makes its judiciously brief running time fly by."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "With Hercules, Brett Ratner and Dwayne Johnson are out to entertain you — no more, no less. And that is just what they do."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "There are some rousing battle scenes, preceded by stirring addresses on the subject of going to Elysium – all cheekily borrowed from Ridley Scott's \"Gladiator.\""
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "By the beard of Zeus! Brett Ratner delivers fast, fun thrills to score a sound victory over Renny Harlin’s laborious The Legend Of Hercules."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Director Brett Ratner has always been associated with spectacle but, even for him, this represents a misstep because the \"wow!\" factor is muted."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "As the plot clogs up with foreseeable reversals, wisecrack duties go to Mr. McShane, whose oracular character keeps wrongly predicting his own death. Like Hercules, the movie is plagued by a split identity: It’s half-slog, half-Mel Brooks."
    },
    {
      "critic": "Jeff Labrecque",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 42,
      "summary": "When Johnson is wearing the head of the slayed Nemean lion in battle, walloping enemies with his tree-trunk sized club, and heaving charging horses to the ground with remarkable ease, he's in his Rock comfort zone. But as a tortured hero hampered by self-doubt, Johnson labors."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "Strap on your swordbelt, buckle your sandals and oil up your rippling six-pack, because here comes yet another interminable, CGI-drenched mythic mish-mash with far more money than brain cells."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "Director Brett Ratner could boast solid source material in the five-issue Radical Comics series Hercules: The Thracian Wars by the late Steve Moore. They had a shot at something here, and they blew it."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 38,
      "summary": "For all the fun these folks could have had with Hercules maintaining the supernatural assistance facade, or denying it as his handlers gild his lily testifying that it’s true, the movie is content to just go through the motions."
    },
    {
      "critic": "John DeFore",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 37,
      "summary": "This outing does not suffer the epic badness one associates with films that aren’t screened early for critics, and in fact it offers moments of actual entertainment. It simply fails to exploit its assets: an amusing, revisionist take on the mythological strongman, and the charisma of Dwayne “The Rock” Johnson."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 33,
      "summary": "It's mythmaking for dummies, a Hercules with no poetry, only incompetent brute strength."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 25,
      "summary": "Watching Hercules, you can feel your intelligence being insulted in almost every frame."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 20,
      "summary": "It's a supernatural epic that never feels quite colossal or consequential enough, as well as an utter waste of Dwayne Johnson‘s unique dopey-flirty charm."
    },
    {
      "critic": "Rob Humanick",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 12,
      "summary": "The film fluctuates haphazardly between semi-serious reverence and tongue-in-cheek camp, with no shortage of opportunities for the inevitable Rifftrax accompaniment."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Ancient Greece with the Rock...I thought he was tremendous in the Scorpion King and expected more of the same here. I wasn't expecting it match 300....which in my view is a classic..but it could have been a bit better than it was..then again it was clearly aimed at early teen audience who I'm sure loved it..but they are demanding with regards to CGI and that didn't always hit the mark..Two of the characters for me didn't work..The yappy nephew and the mute sidekick.....The damsel in distress princess wasn't that memorable either..Overall though it was good fun......",
      "total_reactions": 2,
      "user": "JamesIrish68"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "Better than what I expected it to be but not by much. The CGI sucked hard and they could/should have been more loyal to the actual Hercules story aside from simply using the basis of it. Still, The acting was solid and The Rock was a great pick for the lead role. The action was alright but they often cut away from the actual blows, Which was incredibly annoying. Not bad to rent but that's about as much as I can say about it.",
      "total_reactions": 1,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "The trailer is deceiving and looked way better than the actual film. The interesting parts from the trailer (Hercules fighting various mythical beasts) take up the first minute of the film. The rest is taken up by a horribly boring, predictable plot which doesn't even have any mythical elements to it.",
      "total_reactions": 1,
      "user": "Nathonas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "Dwayne Johnson obviously prepared for this movie. He is fit for the role, even though still doing mediocre level of acting. But the trailer really looked awesome and successfully made me want to watch the whole film. But I think The Rock just involved in another bad movie. Most the stuff we all see in the trailer are actually the first bit of the whole movie (yep, those all fight scenes with giant lion or that creature in a lake). One to blame is Brett Ratner. The movie if full of bad dialogue and plot. Ratner also wasted several good actors there. Definitely not an epic mythological movie.",
      "total_reactions": 1,
      "user": "tomtjok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "I'm not sure what it is about Dwayne Johnson, but he always gets roles in movies that for the most part are great movies.  The storyline may be a bit of a cookie cutter storyline but, it never fails to deliver and the psychological profiles of the cast offer several different types of the audience the opportunity to relate with at least one character in the movie and how they must overcome either their dark history or their impending future.",
      "total_reactions": 1,
      "user": "Dragon_Fly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "This certainly isn't a faithful retelling of the myth, nor is it a clever new take on the character. It is cheesy, predictable, and the effects aren't terribly special. That being said, I actually enjoyed this 95 or so minutes of popcorn fluff, because that's all it ever pretends to be.",
      "total_reactions": 1,
      "user": "adpirtle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Hercules starring The Rock delivers exactly what you expect; plenty of action, lame dialogue, expensive production sets and weak characters. But as a popcorn flick, it is immensely enjoyable.",
      "total_reactions": 1,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Wonderful action movie!  Great seeing many of the charecters and monsters from Greek and roman mythology come \"alive!\"  Lots of likable charecters, great storytelling of the tasks performed by Hercules, and an all around fun movie.  Much better than  the movie Lucy.",
      "total_reactions": 1,
      "user": "Kikig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "I don't know why my parents were so interested in this film. Myself having heard what a bad director Brett Ratner is, wanted to go see Luc Beeson's Lucy movie with ScarJo, I don't know why it  didn't came as a second thought so I went to see it and was totally disgusted there was not even an entire plot and the final part was just plain ridiculous.",
      "total_reactions": 1,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "I walked in expecting an ancient classic but I was severely disappointed. The story line is weak and short sighted and the cast of characters was very poorly cast. Many people in the movie shouldn't have been there and the story line is very dull and extremely fast paced. You don't have time to enjoy any scene for the proper amount of time. There are no innovative action scenes that make you really enjoy the imagery. The attitudes of people in the movie in regards to legends is such a turnoff for a movie like this. You walk in to see mythical stories and mythical imagery and instead you get lingo that sounds like it's from 2014 and people who disregard the legend of Hercules. \"Literalists\" have ruined a great mythical story and one of my favorites; Hercules. This movie seemed to be entirely made to disregard the legend of Hercules instead of telling a beautiful modern adaptation of the story which many people enjoy. I gave it a 3/10 because The Rock was a childhood favorite wrestler of mine. But other than that, this movie failed in every sense.",
      "total_reactions": 9,
      "user": "JohnnyScumbag"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "This movie is filled with moments where you think \"I have seen this done better in ____.\"",
      "total_reactions": 3,
      "user": "CouchLicker"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "This movie is not about myth. No epic action as mentioned in other reviews, bad CGI, nothing really interesting. This movie literally does nothing to entertain you.",
      "total_reactions": 9,
      "user": "Vitaly"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "I'm simply not understanding how this movie is getting such bad reviews, I thought it was surprisingly awesome, Dwayne Johnson's best performance yet, and overall a nice more realistic spin on the story of Hercules with great action and decent story telling. By no means as bad as most are saying, a solid summer action flick.",
      "total_reactions": 11,
      "user": "vcca15"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "An epic, fun, summer movie. My whole family loved it. Reminds of the old Arnold Schwarzenegger movies of the 80's. If you loved the old Conan movies this should entertain you.",
      "total_reactions": 13,
      "user": "archeanchaos"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "It's a really wonderful action movie and really get into the legend of the character. I don't get what others they want: an epic mythological movie must be really epic action, great beasts and powerful gods. And Hercules is probably the best of this",
      "total_reactions": 20,
      "user": "Rhae"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "This movie has so much confusing parts. I really walked into that movie thinking im gonna see some gods maybe Hades  maybe Cerberus NOPE!!!!! None of that at all its the  rock with 5 stupid characters fighting some town because the rocks kids and wife die and hes dreaming stupid ass **** this movie should be in the list of a anticipated 2014 movie that sucked right along with godzilla....YUP!",
      "total_reactions": 12,
      "user": "Just1nsane"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "The Rock plays a great action hero and does it again here.  This won't win an Oscar, but if your looking for Hercules to flex his muscles and clobber anyone who gets in his way, you will get what you want.  Two things would have made the movie better, more mythology and a strong villain, but I can't talk about that without spoiling the movie.  I would love to see the Rock do either a 2 movie run or a trilogy with the 12 labors broken up into the films.  Don't let the nay sayers dissuade you from going to this one.",
      "total_reactions": 6,
      "user": "Peabarter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Completely enjoyable film with dashes of humor, a lot of action and a story that doesn't get bogged down.  There are some \"Huh?\" moments, but they do not distract from the watching.",
      "total_reactions": 6,
      "user": "jstenman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "When the self proclaimed Dwayne \"The Rock\" Johnson graces the silver screen. in Brett Ratner's adaption of the Steve Moore comic, showcasing the titular character that is Hercules. I almost believed every second. Perhaps if not for the overly dramatic battle sequences, cornballish one liners, and some CGI heavy effects that could use some work. That being said, if not for Johnson and Ratner, we probably would be looking at a far worse version of the Kellan Lutz driven vehicle that opened back in January.",
      "total_reactions": 4,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "A fun movie that entertains. Ian McShane has a few good lines in it. The Rock does a good job in making Hercules heroic and fun.  Not a movie to be taken too seriously",
      "total_reactions": 4,
      "user": "Cobrawar"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "If you enjoyed shows like Hercules and Xena, this movie is for you. Excellent battle sequences, great script, fantastic actors (Ingrid Berdal as Atalanta was brilliant)-- the epitome of a great comic book and adventure film. The movie follows the Thrace comics and strips down the Herc myth to make all the characters enjoyable and accessible. Saw it twice, and enjoyed it even more the second time.",
      "total_reactions": 4,
      "user": "DrChocolate"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "A decent movie with a very misleading trailer. I thought this movie would be about Hercules growing up and fighting all these mythological beast but all the scenes with those creatures don't actually happen. They are just stories that people in the movie have heard about him so we don't actually get to see those fights. In this movie Hercules is just a mercenary not a demigod. The story isn't anything special but it does throw you a few twist that keep you interested. The action is pretty intense although it would have been nice to have seen more of Hercules himself fighting. The great movie based of Greek mythology has yet to be made but this is up there with the best of that genre.",
      "total_reactions": 2,
      "user": "Toshione"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I was pleasantly surprised by this films. I must say though that the advertising was very misleading, it shows in the ads that the movie is mythical and full of CGI monsters, but aside from a few very short moments this isn't the case at all. This film shows a more realistic look at legends and how they are and were probably spread. This to me was a pleasant surprise and featured a very fun supporting cast and a nice original look at the legend of Hercules. Regardless from the ending which contradicted the more original plot of the movie i enjoyed this movie and would suggest it to anyone looking for a fun action flick.",
      "total_reactions": 2,
      "user": "Filmwatcher123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Overall, even though it starred one of the best entertainers and stars in the business right now, Hercules is definitely one of 2014’s surprises. Yeah, it was a Hercules driven story, but it my eyes it was a completely different take that was so (using that word again) refreshing to see. I thought the characters were so fun to watch as they all made their journey’s as mercenaries. Along their journey included some fights and battles, which like I said, were so entertaining from start to finish. A story, characters, and badass action that in my opinion shouldn’t be missed. I mean, who wouldn’t want to see The Rock as Hercules throw over a freaking horse?!",
      "total_reactions": 2,
      "user": "thejakeberlin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "I just took my 13 year old nephew to see this film last night and as soon as I left the theater I was trying to figure out if I liked the movie or not. In this review and others to come, I will always say that the movie lives and dies with the villain. Sometimes the villain can carry a movie to greatness, and sometimes it can hinder the movies progress. This was one of the latter times. First off, when we left the theater, my nephew asked me if I liked it and I told him I was unsure because I loved the supporting cast and the Rock is always fun to see on screen, but I didn't like the villain all that much. His reply sealed it for me when he said...who was the villain.",
      "total_reactions": 2,
      "user": "NeekReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "I'm a fan of Dwayne \"The Rock\" Johnson so I loved the movie. Pure spectacle, good special effects. You'll have a good time. Worth paying for the movie.",
      "total_reactions": 2,
      "user": "JasonGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "One or 2 good battle scenes which I always like. Little else to say that's positive. Really didn't like this movie. Wasn't convinced by it at all. Story line is quite bad and doesn't make any historical or mythical sense. I really like the main actor Dwayne Johnson. Was hoping for much better! Wish I had read the reviews before hand. The film makes no cultural sense either. The characters and scenes are more like Xena Warrior Princess rather than approaching anything close to real. Very tacky and make believe!",
      "total_reactions": 2,
      "user": "joesfiddle"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Dwayne Johnson plays the mythical muscleman, but in this case he's just a mighty mortal with good PR. He heads a small band of mercenaries who are hired to quell a war in ancient Greece. This is basically a by-the-numbers action flick (Brett Ratner directed after all) with lots of passable combat…no magic and no Greek gods. There's nothing original or special about the script or the skirmishes, but it doesn't suck.",
      "total_reactions": 11,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "I will admit, I went into this movie expecting something different, the trailers are a little deceiving. While it's different from the trailers, it's still an awesome movie. I saw it in IMax non 3D, this movie has lots of great action, and even has a little humor. If there was ever someone that was made to play Hercules it's Dwayne johnson, It made me really want to see more movies like this with him in it. His impressive build gives life to the character and you really believe his strength. Go see the movie, don't listen to all the people hating on it.",
      "total_reactions": 7,
      "user": "trigun123478"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Look, going into a film directed by Ratner and starring The Rock as Hercules shouldn't put expectations too high, yet I was still expecting more than this. The story is lacking, the special effects aren't that special and the characters range from underdeveloped to just plain boring (with the performances either bring hammy or awkward, especially a shrieking princess and her cockney-accent son). There's just much more brawn than brain here, and despite one fun action sequence, it was just too big a Herculean task for Jonnson to pull off [pats self on back].",
      "total_reactions": 10,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is pure epicness. It show the true power of ancient mythology and brought into cinema. For anyone who dreams of a gof of war movie, here it is. And Dwayne is a great entertainer",
      "total_reactions": 10,
      "user": "IronManiac"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "Whilst Hercules does impress on a technical level - its bland storyline, poor acting, disjointed plot and overlong action sequences only helps strengthen the sour taste from previous cinematic entries of the title character.",
      "total_reactions": 5,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "It all starts so promisingly with remembered stories of some of the famed labours of our eponymous hero. However, after a quick introduction to the man god's background and a whiplash bout of special effects this settles into a training exercise for two rather un excitingly staged battles. Further damage is inflicted by a script that insists on having both Rufus Sewell (who is rather bad actually) and Ian McShane spew forth a lot of unnecessarily sardonic humour. Things do liven up somewhat when the villains are unmasked and Hercules gets to perform his last labour. Overall though, aside from having superior visuals, this is not really any better than the year's earlier sword and sandals opus 'The Legend of Hercules'.",
      "total_reactions": 12,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Now this is what a comic book movie is suppose to look like: totally like the comics, with epic scenes, best CGI, action scenes that gives goosepumps, solid actors and extraordinary heroes. Hercules could solo the entire Avengers franchise.",
      "total_reactions": 9,
      "user": "Loki43"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "Surprisingly good. Dialog could use some work, but great action scenes and comedy. It knows what it's going for, and hits the spot. Taken as it is, not what you thought it would be, it's a past halfway decent movie.",
      "total_reactions": 13,
      "user": "phildog"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Fun, enjoyable, to the point and also among the more believable plots of the summer (seriously, it makes sense once you watch the whole thing). The special fx suffer towards the very end but visually it's solid otherwise. Dialogue is kept simple and the plot twist is again (surprisingly) believable. The supporting cast add to the fun and the rock embodies the conflicted hero/legend/mercenary character pretty well.",
      "total_reactions": 6,
      "user": "Sammifx"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Lighthearted action popcorn movie made to appease the professional wrestling fans as they make a mockery of the legendary Greek God Hercules.  How The Rock manages to keep a straight face in this laughable lame script is beyond me.  A nice way for the teenage boys to spend a rainy afternoon.  The shame of it is The Rock is really not a bad actor and deserves a script better than what he is given to work with.  At least he got a paycheck.",
      "total_reactions": 2,
      "user": "fantasy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "A solid action flick that succeeds thanks to just how likable it's star is, as well as some nice supporting characters and solid violence. Yes Johnson is very likable as the legendary Hercules. He and the humor help save what otherwise would have been too cheesy of a movie to recommend.",
      "total_reactions": 3,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Definitely not a bad movie. But overall I really feel it was a big missed opportunity because of what people typically think of when we see \"Hercules\". I wished the plot would have been more focused on mythical creatures and superhuman strength and greek gods. That being said I do like Dwayne Johnson and thought he did a good job here with great action scenes... just a uninspired story. Overall was hoping the movie would be more epic.",
      "total_reactions": 1,
      "user": "theoffice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "You know what I really enjoyed this film, I went in expecting to see the rock punching stuff and being awesome, and that is exactly what I got. Does the plot have holes? yes. Is it at times predictable? yes. Is it the most fun a blockbuster has been in a while? yes.",
      "total_reactions": 1,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I went to watch this on big screen with a thought \"this will be just another same old typical hercules movies\". Myth and Zeus are coming together, but it wasn't. In fact, it's the other way around. No Zeus and no demi god, hercules is a mercenary. Nevertheless, i still find this movie pretty good and has a nice storyline. Battle scenes are great too. It still worth my $$.",
      "total_reactions": 1,
      "user": "ivan_terrible"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "i didnt understand the bad rating....really only 47....my god there a lot of films that have deserved a rate of 47 but they become a rate of 90!!!This film has´nt earned this rate. I find  this film great! Dwayne johnson played very well in this film! Good sound top animation.....I think the critics are not serious and you should not take them seriously...This movie has everything you could possibly imagine. Action voltage with a portion of humor .... just awesome!!!!",
      "total_reactions": 2,
      "user": "Kordun"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "I think the movie is ok for guys just looking for some action and funny moments. Even the story is ok and entertaining. The movie tells the hercules story in a new way. I went into this movie in a 3D theater and the 3D-Effects where really good, the whole movie was in 3D, not just some scenes, like seen in some other 3D movies. This is a solid action Movie. Probably you will forget it rather fast, its not a movie you watch multiple times, but you will get entertained for once.",
      "total_reactions": 1,
      "user": "hierax"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Any movie with Dwayne Johnson will be good, even if the script does suck (which in this case it doesn't). The only thing I kinda didn't like was the part of him growing up, it all happened in a flash and we were thrown right into it. Nevertheless it's a action movie and it sure brings you a lot of action. The ending was not as expected so one might assume there will be a sequel.",
      "total_reactions": 1,
      "user": "zeNap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Just when I think modern mainstream blockbusters have definitely run their course for me, along comes a movie to prove me wrong.  Blends old-school storytelling and new-school pizzazz with an assurance which Peter Jackson couldn't quite pull off, and provides yet yet another argument why all decent, film-loving folk should gather in a public square to watch Michael Bay drawn-and-quartered or burned to a crisp on a flaming cross.  Not sure I care that much for Brett Ratner's back catalogue, but he's certainly proved himself worthy with this one.  As does the ever-charismatic Dwayne Johnson (who has all the charm of the pre-public-boob-fondling Schwarzeneggar, plus some genuine acting talent), and as for John Hurt...well, he has nothing to prove to any of us, hasn't for decades, but it's always wonderful to see him in a major role in a major Hollywood blockbuster every once in a while (and nice to see he's not dead yet, for that matter).",
      "total_reactions": 1,
      "user": "rjmacready"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "The message from the movie story was really good.",
      "total_reactions": 4,
      "user": "RoraEst"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "I really liked this movie. Characters are O.K, storyline is old-fashioned and everything else is placed good.",
      "total_reactions": 1,
      "user": "AtheusGM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "One of the best mythic films ever. It's strong, funny, intelligent (yes really) and beautiful in sets and costume.",
      "total_reactions": 1,
      "user": "Morgain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "Painfully average in every way... The story, dialogues, acting, soundtrack, all of it is incredibly plain and boring. The cheesiness and stupidity of some scenes made me cringe several times during the projection. The movie has some of the most ridiculous and laughable battle scenes I´ve ever seen, 5 years old child could come up with better choreography and strategies. What I will say is that Dwayne is as Hercules believable but thats pretty much it. Dont waste your time and watch the trailer instead. All the good scenes are in it and it has better music and even story :D",
      "total_reactions": 0,
      "user": "kamgeforce"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I went to the movie with a little bit of hope that this movie would be good, but when the film ended, my first thought was: Why I payed to see this s***?. But i have to say that the director was very courageous to show a different Hercules and to make a huge movie set, but then when you watch the movie you see that the this like another adventure movie you already watched, because it is predictable and boring movie. And I almost forget do I have to mention the visual effects?",
      "total_reactions": 0,
      "user": "rafa14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Dwayne \"The Rock\" Johnson certainly has flair for on-screen presence, he embodies the character with amazing physique and intense commitment, but sadly the script material is drab and uninteresting, one that’s inferior to TV show, the likes of Spartacus or Rome. It attempts to humanize Hercules, presenting the man behind the legend, which is quite admirable compared to other grandiose renditions that share the same title or action movies in general that depict superhuman characters. Unfortunately, the plot is highly predictable and aside a few decent skirmishes, it doesn't offer anything notable.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Brett Ratner's Hercules film struggles with a bit of an identity crisis. On the one hand, I really like what Ratner tried to do in making the myth and lore of Hercules just that; myth and lore. He made the character simply a fantastic warrior and eventual mercenary who, along with the help of his comrades, played into the living legend in order to acquire jobs and terrify his enemies. I mean, who would want to go toe-to-toe with the mighty Hercules? The problem with the film is that Ratner doesn't leave the fantastical at the door as he should've. On the one hand, he portrays Hercules as a mortal and mocks the existence of hydra, centaurs, and cerberus. On the other hand he includes a psychic who can see visions of the future and he has Dwayne Johnson's Hercules perform superhuman feats that no mere mortal could do. Many of the action and battles sequences also fail here, with Hercules leveling many a foe with a single swing of his club. This identity crisis doesn't ruin the viewing experience completely but it does hinder the film's ability to create serious drama or intrigue. This film ultimately feels a bit shallow and the underutilization of Irina Shayk might be the biggest disappointment of the entire movie. She seemed to get half of the screen time in the trailers but gets maybe 30 seconds of screen time in the actual film. That's called poor representation. Overall, it's a decent watch and one of the better live action Hercules films I've seen but it fails to live up to its potential, largely due to poor direction.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2015
      },
      "score": 4,
      "text": "Very average movie, not the Hercules story you are probably familiar with.  Hercules is by all purposes a mercenary working with other mercenaries.  The Story is focused on one small war between two kingdoms.  Nothing epic.  The action is very predictable other than one plot twist near the end of the movie.",
      "total_reactions": 0,
      "user": "bigjon1958"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "I think this film is good at the beginning with great effect, but I were very disapointed at the the very end because it hasn't awesome or \"wow\" ending. I expected more than that. But from the story side, I think it good enough and well done for the director to make the Hercules story new and different than the other Hercules movie.",
      "total_reactions": 0,
      "user": "dMoviezzz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Has Brett Ratner lwarned from directing comic book films? Well,not really. While the film as a whole isn't really awesomerific. But the fight scenes were fantastic. The scenes leadomg up to them had me excited amd prepared. But other than that I had a hard time feeling bad for Hercule's family as I never got to really know them. And when they died I just said myself \"Okay?\". And some the characters I knew nothing about. Like the female with the bow and arrow. I could not describe. Some of the running gags were used a little to mich. And some scenes I knew what was going to happen so I wasn't really suprised about anything. But if you want to see just some action then definately watch this film",
      "total_reactions": 0,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "It's a fun movie.  It doesn't aim especially high.  It's not spectacular in any sense of the word, but it accomplishes what it sets out to do sufficiently well.  The fights and battles are fun, and involving, and The Rock was a solid choice to play Hercules.   It doesn't take itself especially seriously, which helps since it's not aiming for awards level filmmaking.  That's not to say that it's cheesy.  The effects and action are all solid.  It just isn't really a piece of grade A craftsmanship.  Still though, it's fun, and if you're in the mood for a solid action adventure, it's worth a look.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Ok now hold on to get something straight to begin with. This got a better score than 300: Rise of an Empire from viewers?",
      "total_reactions": 0,
      "user": "HazaRDReborN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 5,
      "text": "No, just no. Nobody wants to see this silly story of the \"real\" Hercules. The reason why Greek Mythology has been so famous and popular for hundreds of years is because of how interesting and exciting the stories are. This movie on the other hand is boring and predictable. I have seen many low and high budget Hercules movies and this one might just be the worst one of them all. Especially considering it's 100 million dollar budget.",
      "total_reactions": 0,
      "user": "max1c"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "El enfoque de hacer realistas los mitos y leyendas griegas nos entrega esta versión ordinaria del hijo de Zeus, cumple con entretener, como todas las películas de la Roca.",
      "total_reactions": 0,
      "user": "chepod8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "This is not a historical as i expected, its just an excuse for an action film, the writers did little research, just enough to rip off the legend. They made the whole story up and ignored all the legend that is Hercules. The dates are ALL wrong according to these jokers Hercules lived about 50 year before Alexander, Maybe the dunce writers should have paired them up for a few scenes. They even put a king in Athens at the time when Athens was a democracy. The is film set 1300 + year into the future from the the actual time of the legend of Hercules.",
      "total_reactions": 0,
      "user": "Yammit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Hercules it's just a normal movie, it's not a horrible movie or a amazing movie, there are some good humor scenes, and action scenes but nothing innovative, the plot is superficial, the actors are not so good...But if you just want to see the action, it's a good option.",
      "total_reactions": 0,
      "user": "victorhjkl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Hercules is clearly aimed at a younger audience and succeeds in that department. Decent action, predictable characters, good special effects. Grab your popcorn!",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Hercules is based on ups and downs, maybe more downs than ups, unfortunately. Dwayne Johnson played a medium acting, as usual from him, a huge and strong man, but always without the deep focus in the character that you always want from him.",
      "total_reactions": 0,
      "user": "PHJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Hercules (Dwayne Johnson) starts out with the titular character as a mercenary after being exiled and working with a band of outcast warriors(working to further his mythos/legend to treat effect)  , flashbacks reminds him of a very grisly end to his wife and children by seemingly some three headed wolf/creature , which is easily the poorest cgi in the whole film, we see Hercules nephew about to be executed in the first full scene , while he is telling stories of the famous 12 labors/trials Hercules had to complete (these flashbacks show some of the coolest cgi with him killing a massive Lion aka his headdress  and a Boar and a sea monster), also that it's alluded to that he is the son of Zeus the Greek God , which in turn makes him a Demi-God. After saving his battle challenged  nephew he moves on to the next big payday , reluctantly becoming a mercenaries for the King of Thrace (John Hurt) he fights for the King and builds an impressive army of mere farmers,  but later realizes he's fighting for the wrong side (there are many flashbacks of his guilt over his families deaths) this movie works on most levels , and tells a very good story on falling from grace, revenge , and redemption,  too bad we can't  say the same for all the other merry men, but this is easily better than the turd that was released under the name  Hercules earlier this year. This is a great summer popcorn flick that will be having you shouting \"I AM HERCULES\" ! Two huge thumbs up !",
      "total_reactions": 0,
      "user": "geeklypodcast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "This movie is okay, the action put the popcorn in my mouth instead of \"going\" to see this movie in theatres i wanted to see Guardians of the galaxy.  Dwayne the rock johnson is good at playing Hercules he's bad ass,   Director of X-Men: The Last Stand Ratner does anything that a director does in warrior film add a lot slow motion to make Hercules better or any other characters better. Ratner's version of Steve Moore's Hercules is much better then the \"other\" one. But Ratner does okay. Grade C",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "For the betterment of the individuals around me at the time, I tried to hide the trauma this one ended up causing me. I expected a brutal epic retelling of the ancient Hercules, who seemed perfectly cast by the way. And that ended up being the biggest problem. The Rock pretty much launched his Hollywood career as The Scorpion King. I liked that movie. I liked that character. He was angry, serious , and one heck of a BA. I did not get that from this portrayal of Hercules, one of the most BA ancient characters that exists. Had I known the cheesy and stylized edge this movie would have perhaps I would not be so harsh, but I know what Dwayne Johnson is capable of and how awesome he can perform as these mid evil characters. It really sucks to watch him squander his potential before everyone's eyes. Let's not rag too much, the guy got yoked for the role, like inhuman. He was huge. That is impressive. The fight scenes were brutal and sometimes just out there. Why would your leaders stress the importance of a phalanx then stand right outside of it during the battle? Wth? Watching The Rock thrash people is just fun but, I couldn't help but be disappointed. The plot proved interesting but wasn't really carried by anyone and just ended up being predictable because of the lack of good dialogue. We all know the BA The Rock can be. This is far from it. For shame.",
      "total_reactions": 0,
      "user": "BigZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "The trailer of this movie will definitely fool you. \"Hercules\" is just disappointing. Very predictable plot, the mythical aspect of things is not really there and no action at all. Overall, the movie is uninteresting to be honest , it will not entertain you for sure. So much hype for this failure.",
      "total_reactions": 0,
      "user": "KAOS661"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Hercules delivers what it promises; A smooth action ride throughout the whole movie. Yes there is,  unfortunately, the heavy CGI factor but there is also Mr.Dwayne Johnson. I'd say watch this movie just to have good time.",
      "total_reactions": 0,
      "user": "MuratBaykurt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Entertaining exploration of Greek mythology that's well cast, well directed and it looks very good. It written with a sense of humour and tends to steer away from melodrama. Over all it's not bad.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "I love The Rock, but this movie was pretty average.  Forgetful performance by the supporting cast of characters and some weak writing.  Could have been so much better.  Might be worth watching if you just like this genre of film and/or The Rock.  They just missed the boat on this one.",
      "total_reactions": 0,
      "user": "ToddDow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "This movie is like A Knight's Tale... but worse.  I did not think that was possible.  Seriously though, I actually quite like Dwayne Johnson as an action star.  This is a serious step back in his repertoire.  Two Hercules movies this year, two epic failures.",
      "total_reactions": 0,
      "user": "Sconesdeep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"Hercules\" 10 Scale Rating: 6.5 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "Hercules was way better than I thought it would have been (I had very low expectations). Brett Ratner is suddenly getting better as a director, for a change.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Hercules has a fairly good cast and so the acting doesn't disappoint. There are some problems with this movie though, such as the storyline isn't the best. This is the kind of movie which is just a bit of fun to watch, it'll never be put down as one of the best movies of all time but it's good. It doesn't Appeal to all audiences though, so don't expect to like it.",
      "total_reactions": 0,
      "user": "Shedegg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "2014 realmente não foi um ano com bons filmes épicos. Depois dos decepcionantes \"300: Rise of an Empire\" e \"Noah\", veio esta bomba. O filme em si é bem fraco, a história (que se soubessem contar direito, seria ótima) é fraca, os atores são fracos. A única coisa admirável nesse filme é o tamanho de Dwayne \"The Rock\" Johnson, que a cada vez que a aparece em algum filme, aparenta estar maior ainda!!! Ele, como Hércules, é bem convincente... mais pelo tamanho em si do que pela interpretação!! Enfim, o filme não empolga, não inova, não surpreende. Eu, não recomendo. É o típico filme que irá cair em esquecimento muito rápido. Isso se já não caiu!!!",
      "total_reactions": 0,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "Dwayne Johnson excels at the role of Hercules, but Brett Ratner fails to this new Hercules to live up to the expectations of fans. Ratner tried not to give Hercules the generic feel, but this movie was just plain boring. The myth of Hercules was completely lost in piles of boring nonsense",
      "total_reactions": 0,
      "user": "iluvsports"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "Dwayne 'The Rock' Johnson provides audiences with a ridiculously, inaccurately enjoyable rendition of the Hercules myth. It must be said, this film isn't meant to be taken seriously. The best way to enjoy a popcorn flick like this, is to eat lots of popcorn and enjoy the raw nonsense that ensues. The movie fails to deliver in terms of narrative story and character development, and is designed for the over the top action sequences it excels at. Whilst one cannot admit that this is a good film, it did provide for a fun movie experience that I don't regret engaging in.",
      "total_reactions": 0,
      "user": "PeterAlexander"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "The trailer made this film look exciting and great..and it was anything but that. It was so boring and poorly written I almost wanted to get up and walk out of the theater.",
      "total_reactions": 0,
      "user": "AaronDWasserman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "May be a more tongue in cheek approach to the legend and anti-hero, but it works well as a breezy action adventure with a slight comic bent.",
      "total_reactions": 0,
      "user": "katharris417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "The shot at a Hercules film would never work. Just keep that in your mind. This did pretty alright and it's not the best Hercules film we all have seen.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}