{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 26,
  "mc_movie_name": "Here Comes the Boom",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 30,
  "mc_pro_critic_reviews": [
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "When the comedy connects, it can deliver with funny force"
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 63,
      "summary": "Once it gets going and commits to its time-worn inspirational formula, it's not half-bad."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Knuckleheaded though this faculty-member-turned-MMA-fighter comedy is, there's no denying the plot's lefty credentials, snuck in like Raisinets among the popcorn."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 60,
      "summary": "Like James in the ring, it doesn't pack a lot of power, but it comes out swinging and sweats for applause."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "So even if Here Comes the Boom doesn't quite work as a comedy (it's not particularly funny), or a drama (it's not particularly poignant), it has an earnest charm that keeps us engaged."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Here Comes the Boom is stale and vanilla. We know we're in trouble early when the first joke fails."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "If you can choke down the implausible notion that the doughy Kevin James would last more than five seconds in a mixed martial arts ring, Here Comes the Boom is a moderately enjoyable, nontaxing sort of comedy."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "A farther-fetched fantasy: In addition to asking we believe our loosely packed academic can play Rocky, Here Comes the Boom imagines a world in which butterball Everyman Scott and the fabulously lush Bella (Salma Hayek) might argue and bill and coo and eventually fall in love."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "What's missing from this color-by-numbers screenplay is the bizarre touch of eccentric humor Sandler often lets creep into his comedies."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "The pure mechanics of Here Comes the Boom land it in an enjoyable, if forgettable, space."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "It's all harmless, if not entirely fun."
    },
    {
      "critic": "Janice Page",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 50,
      "summary": "Kevin James's latest comedy doesn't promise any bing or bang, only boom. Take it at its word."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 42,
      "summary": "A cloddish, harmlessly drecky comedy from the Sandler factory of crude mush."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2012
      },
      "score": 40,
      "summary": "Cue 105 painful minutes of a fat guy getting punched in the face and falling down."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Few people will be surprised by how it all unfolds or by how it all ends. This is a movie about lightweight entertainment and heavyweight fighters, not a movie about surprises."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The film works hard at its inoffensiveness. Throughout, jokes are left on the table, setups never pay off in any significant way."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Boom was produced under the auspices of pal Adam Sandler's Happy Madison Productions, which has a tendency toward broad-comic morality tales and multiplex populism that often shades into remedial-level pandering."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "All banality, though it delivers some goodwill even as it pulls a muscle trying to get its premise going."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "The first half hour of Here Comes the Boom is so good moviegoers might be fooled into expecting something better than an obvious wish fulfillment fantasy so patently implausible it's almost insulting."
    },
    {
      "critic": "John Anderson",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 40,
      "summary": "Hands of stone meet heads of air in Here Comes the Boom, a sports story so daffy it may as well star Kevin James."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Low on raunch but even lower on laughs. It also looks like half the lighting crew failed to show up."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 38,
      "summary": "Loud, incoherent and unfunny, Here Comes the Boom is the sound of American culture imploding."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 33,
      "summary": "Here Comes The Boom seems to have made it from the pitch stage - Kevin James does MMA to save his school or something! - to the big screen without an iota of inspiration, ambition, or personality seeping in at any juncture."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 20,
      "summary": "\"Here Comes the Bomb\" would've been a more fitting title, but props to Henry Winkler for rising to the occasion and turning in a sweet, idealistic performance in a film that otherwise feels like a tawdry commercial for the UFC and MMA."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 0,
      "summary": "As a comedy, the film aims low and manages to miss the mark entirely."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "Kevin James plays it safe with Here Comes the Boom, a movie that will remind you of Nacho Libre in many ways. Its a overall fun time at the movies, even if it is somewhat predictable.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Its a really good movie, i recommend it for people of 7 to everyone.",
      "total_reactions": 1,
      "user": "ColGamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2012
      },
      "score": 2,
      "text": "It's not very funny and the fact that the big turning point of the \"final battle\" between Kevin James' character and the actual MMA fighter was a move that you regularly see in MMA today really is very disappointing. I personally didn't have high hopes for this movie in the first place, fully expecting it to be just a feel good movie. However the movie came off as too corny and just poorly done. Bas Rutten's character was probably the best part of the movie as his bubbly, craziness was on full display. I love Bas and, as a huge MMA fan, his presence really added something to what was otherwise a dead, lifeless cash grab. Even MMA fans won't like this movie. Save your cash and go something else.",
      "total_reactions": 1,
      "user": "Kenmei"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "A good family movie that will bring the laughs. It's humor doesn't always deliver but it's got a sweet side that makes it easy to respect. In the end it's not perfect but it's worth watching.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "It's Kevin James...need i say more? Now don't get me wrong, i love Kevin James and this movie was fun but were making honest film reviews right? Here comes the boom is a fun family film and it gets a 10/10 if thats what were basing it on, but if were basing it on a quality film and all then it gets a 5/10. Its obviously really cheesy and goofy etc. and obviously you know how its going to end from the start, it has a great message to it also. It's definitely inspiring but as a whole though i give it a 5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "I just went and saw this movie tonight, and I have to say I was surprised. I'm a huge fan of Kevin James, but he hasn't been in anything too good since King of Queens. While this movie doesn't bring anything fantastically new to the table, I really liked Kevin James' character. I wasn't a huge fan of the forced relationship between him and Salma Hayek, but it all worked nonetheless. I'd probably give it 7/10 but I'm tossing in an extra number because I love Kevin James... All in all if you want a heartfelt family comedy, I'd go check it out.",
      "total_reactions": 0,
      "user": "EnixSquared"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "If it doesn't focus too much on James' antics, 'Here Comes the Boom' is at times a surprising poignant tale of a teacher, trying to save his school from being bankrupt. While the premise seems ridiculous at first, the film actually took traction in the second half, with MMA fight sequences that were realistic.  Sure the pacing drag at times, but it's an entertaining diversion.",
      "total_reactions": 0,
      "user": "dharma"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "This was a pretty good movie that had some good laughs and likable characters. Kevin James did a great job in this role and this was my favorite Salma Hayek role in years. The trouble is that the believability factor was very low... especially the ending. Honestly, the ending almost ruined the film. I'm sorry but a creative writer could've easily found a different way to have a happy ending while keeping the film a bit more realistic. Nonetheless, it was a decent movie with some good, clean laughs.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "I liked it all the way to the end. The final 20 mins were so incredibly corny and stupid, It completely ruined the movie imo. Aside from that, It was ok. A few chuckles and laughs through out. Bas Rutten was suprisingly rather good in this movie and definently stole the show imo. Did not care for Salma Hayek at all though and felt that she was incredibly out of place in this movie. The rest of the cast did ok. Overall, If you can deal with a corny ending, It's worth giving a shot. Not as bad as critics say imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "It's like every other sports comedy out there, but I must admit Kevin James definitely kicks this move up a couple of points.  I was surprisingly entertained throughout, but in the end it never really stuck with me like good movies should.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "I don't get the negative reviews. Even as a non-UFC fan, I thought this was a very entertaining film and that all of the actors did a good job. It had its funny moments, but unlike many comedies, it really had a good plot and the focus was not entirely on the comedy. Not the best movie I've ever seen, but definitely better than the critics are giving credit for.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "in the end the biggest problem with this movie is that its very predictable and stereotypical of a sports comedy with only difference being that's it about UFC fighting in instead of football,baseball or basketball and if that doesn't bother you this movie will make a fine family outing with a few good laughs",
      "total_reactions": 0,
      "user": "htimreimer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "'Here comes the boom' was a pleasant surprise, it was funnier that the average comedy, it has a good cast and it was actually quite inspirational. The film definitely had you 'rooting' for Kevin James (Scott Voss) by the end.",
      "total_reactions": 0,
      "user": "DanOSullivan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The most energized moments of the movie belong to Charice, except the part when her father wants her to give up her dreams and come back to the Philippines to work for him at his restaurant. Charice plays a student Malia, whose school is experiencing some major budget cuts, specifically in after-school programs. The \"Boom\" comes out of Charice when she sings Holy, holy before the UFC fight, accompanied by her school band... For a singer-turned-actor whose biggest notable credit is a guest-starring role on \"Glee,\" Charice is a star in the making...",
      "total_reactions": 0,
      "user": "Canlolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "The only comedy movie at  the local theatre, so went in with low expectations. So, to my surprise, this was a really funny family, action, comedy movie that kept me engage from start to finish. Although the plot at times seemed to lack substance, it held through as the funny moments outweigh the bad ones. If you have enjoyed other films by Kevin James, then this one is no different.",
      "total_reactions": 0,
      "user": "loki-sf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Started off a little sloppy but this is a decent comedy and the first 'not-bad' performance from Kevin James I've seen. It follows a High School teacher standing up for his students and fellow teachers when there are budget cuts in the school. It's a somewhat predictable storyline but with some good laughs and a feel-good vibe to it I quite enjoyed watching it. Most of what I've seen of Kevin James is normally miserable but he was quite funny in this, so overall it's nothing special but decent!",
      "total_reactions": 0,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "This movie was really good in many ways though it falls short in many others. The thing that I found the most gripping of the movie was of course Kevin James character, Scott Voss. The character and his goal to help the poor musical teacher who is passionate for his music. Kevin James acting was very good and solid, though I feel that some other characters didn't not have very interesting nor very good acting skills. This goes for the character Niko especially. His acting wasn't very good and could detach you at times, actually I felt a bit like that with other characters as well. From my point of view I didn't really find this movie too funny rather more inspiring.",
      "total_reactions": 0,
      "user": "Seyyoshi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2013
      },
      "score": 6,
      "text": "I was entertained while watching this movie, it was a good study break. If you expect too much from this movie you are going to be disappointed. The movie does the job it was created to do, entertain people and make them smile. Or course it could have been better but in the end it wasn't bad. It's just light and fun and something you don't have to think hard about. Sometimes you just need that.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "In all the ways it should have excelled, it failed. The only parts I found funny were some of Rutten's moments and seeing Mayhem Miller. As a UFC fan, i absolutely hated the unrealistic, ignorant, and over-acted fighting scenes and also didn't like the fact that none of the main characters knew anything about UFC. Maybe I disliked it more than I should have, but looking at it as a movie in general, it was stupid and very cliche. And where the hell did the lighting crew go? A feel good movie with the darkest lighting possible? Yeah I say that this is, without a doubt, a PASS for all ages.",
      "total_reactions": 0,
      "user": "gnomercyx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2013
      },
      "score": 7,
      "text": "I think this movie is very underrated, of course Kevin Smith hasn't shown much in the past, but this was a very lighthearted film and got me excited here and there with some great laughs and mainly corny laughs, but all in all it was very enjoyable and I plan on seeing it again.",
      "total_reactions": 0,
      "user": "Joshthomas2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "For me this movie has action and comedy. Though it's difficult to combine well this two kinds, this movie succeeds and the result is an entertaining film. Of course the end is the usual but it's entertaining all the time. I really liked Kevin James and Salma Hayek.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "Here Comes the Boom was an uplifting story. It expresses a powerful message to viewers. Kevin James was the right actor to play this role. He was good at showing off his passion for his school and his students. It wasn't the most amazing film, but I really enjoyed it. This is a great family film and I would recommend it.",
      "total_reactions": 0,
      "user": "Kitkatkatie360"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "With the same forces from the Adam Sandler films behind this, Here Comes the Boom is your typical filler comedy that contains a choppy plot and corny jokes. However, you feel a lot of the effort and soul that Kevin James put into his role, which makes it difficult to turn away from.",
      "total_reactions": 0,
      "user": "warrenworld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "its somewhat predictable and not at a particularly well made movie but it does have alot of heart and funny scenes. 7/10 for me 6/10 for story 6.8/10 for acting 8/10 for comedy",
      "total_reactions": 0,
      "user": "cumovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Here Comes the Boom is a great family movie. Everyone in the house will be laughing at this one. Its hard to believe that this film wasn't dine sooner considering the world is crazy over MMA right now. No better person for this role than Kevin James. This one is very worth your time if you have kids at home.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 6,
      "text": "\"Here Comes the Boom\" 10 Scale Rating: 6.0 (Decent) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    }
  ]
}