{
  "mc_avg_user_score": 6.8,
  "mc_metascore": 31,
  "mc_mixed_rating_frequency": 4,
  "mc_movie_name": "High School",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 7,
  "mc_pro_critic_reviews": [
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 70,
      "summary": "This madcap romp runs out of steam well before the finish, but its combo of sweetness and high spirits -- not unlike the chemical composition of the dope-infused brownies that serve as a key plot device -- proves sufficiently ingratiating to satisfy viewers."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 60,
      "summary": "It's exactly what it appears to be: a funny-enough stoner comedy with a likable cast."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2012
      },
      "score": 50,
      "summary": "High School is a pun. Get it? This is one of those stoner comedies that may be funny if you're high - but if not, not."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 40,
      "summary": "The nearly unrecognizable Chiklis almost single-handedly saves the day."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 40,
      "summary": "Once the plot has sprung into action, High School is a bumpy ride that takes a few amusing dives but never coheres into anything special."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 40,
      "summary": "High School rushes through the parts it should savor and then pads out its runtime with filler elsewhere - and, less forgivably, it doesn't make getting high look like fun."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 40,
      "summary": "This is mostly all reefer, no madness."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 38,
      "summary": "A lame stoner comedy."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 38,
      "summary": "Filmmakers must have been tripping pretty badly when they made High School, a flub that's about as lucid as a stoner at a spelling bee."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 30,
      "summary": "A triumph of bravado over self-regard, Brody's performance won't earn him a Oscar to place next to the one he earned for \"The Pianist\" nine years ago, but it's the only thing that makes High School marginally worth catching."
    },
    {
      "critic": "Andrew Schenker",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 30,
      "summary": "John Stalberg Jr.'s dismal stoner comedy does little to inject any sense of joy or laughter into its depiction of teenage pot antics."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "The screenplay is so cognitively impaired that the filmmakers might have been better off hacking up \"Fast Times at Ridgemont High,\" \"Dazed and Confused\" and \"Dude, Where's My Car?\" and then sticking together random bits with masking tape. At least that would have made some sense."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "Adrien Brody delivers a colorful turn as a braided-and-tatted drug kingpin who thinks his pet toad talks to him (funny animal, check!), but High School is otherwise a tedious sludge through the same gray corridors where the same old gags wait around every turn."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 25,
      "summary": "As sure as marijuana gets you high, you can count on weed-themed comedies cropping up every few years, each hoping to become a stoner-classic staple--a fate to which High School falls far short of achieving."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 20,
      "summary": "Lacking real kick, High School winds up as irksome as a bag of ditch weed and as lame as the pun of the film's title."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2012
      },
      "score": 20,
      "summary": "Instead of putting the high in high school, this film is the kind of drug movie that gives pot smokers a bad name."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "Alot funnier than I thought it would, definitely better than A Very Harold & Kumar 3D Christmas (2011) in terms of stoner humor. The first 30 minutes are very funny but after that the movie slows down alot, there are still laughs but they are further apart. Everyone is funny in the movie, but the stand out was Adrien Brody and his drug buddy  Mykelti Williamson (Paranoid) who got the funniest lines. And it has one of the funniest running gags I've seen in a long time. There was one thing that I couldn't get past, the black eye that the main character had is so incredibly fake that it made the movie seem amateurish, but that's only a minor thing. In all, it was a very funny movie. 7.5/10",
      "total_reactions": 1,
      "user": "pinattar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "The setup is nuts, and I love it.  It does go into a slightly different direction than you'd expect, showing a smidge more dopey behavior from the teachers than the kids, and the movie is funnier for it.    Every joke hits its mark, and lines are delivered rapid-fire style.  I  consider myself harsh when it comes to comedy, but High School had me in stitches.    Bush and Marquette play off one another, each showing comedic timing in back-and-forth dialog, and they make a good team.  I couldn't even recognize Michael Chiklis as the principal, and he has some funny moments himself.  The film has a smooth but lively music video feel that should appeal to a young audience, and scenes move along briskly.    If you liked Project X, you'll love High School.  Full review on my blog.",
      "total_reactions": 2,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 7,
      "text": "Wasn't really sure what to expect going into this one, but I enjoyed it. It's not perfect and starts off slow, but picks up quickly and brings the laughs. Sean Marquette and Matt Bush made a great duo. It reminded me a lot of Project X, so if you liked that movie you should like this one.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    }
  ]
}