{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "Hit and Run",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 88,
      "summary": "There's a lot of funny stuff, but the most unexpected comes from Arnold, who has been uneven, to say the least, in his movies."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "The dialogue veers into digressions about ADHD, the cruddiness of mainstream dog food, and much else. That these asides prove more fun than the central action is what gives Hit & Run its flavor: tasty at times, even if the film evaporates as you watch it."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "Spirited and saucy, Hit and Run is a small movie with big spirit, a Tarantino-ish sensibility, and a scattergun ethos that results in more hits than misses."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 75,
      "summary": "This fun-loving genre-bender, inspired by \"Smokey and the Bandit,\" opens languidly, then picks up the pace. Even in the midst of cars racing, it's funny and endearing."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Just slam the pedal to the floor, blast on past the weaknesses in the plot, and enjoy the ride."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Its high-octane but low-stakes action might be just the thing for moviegoers weary of summer's operatic superheroes."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2012
      },
      "score": 70,
      "summary": "Above all, real-life couple Shepard and Bell bring genuine chemistry to this high-energy excursion."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "It's a rom-com, it's a road movie, it's \"Cars\" without the animation, it's \"A History of Violence\" played for yuks. It's all that and less because, really, Hit & Run is awfully hit & miss."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "Everyone in Hit and Run is clearly having a good time. It's the audience that gets left out of the fun."
    },
    {
      "critic": "Mark Feeney",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "Put Christian Bale behind the wheel, and Hit & Run would make a billion bucks - except then there'd be no room for Shepard, and that movie would hardly be worth watching."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 63,
      "summary": "Hit and Run isn't a catastrophe, but it leaves loose ends and a more adventurous map by the side of the winding road."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "Hit and Run works less as a film and more as a likable, semi-documentary romp among friends. The illusion of the drama may be gone, but it's been replaced by something more authentic and adorable. And we might be okay with that."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "One of the summer's great escapes - no mean feat in a year that has attempted, but failed, to provide fun, mindless, movie fare."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "Hit and Run achieves its chief goal: to put the pedal to the metal for some good, goofy fun, squealing the tires as often as possible along the way."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 60,
      "summary": "A strange, but strangely entertaining combo of drag racing machismo, slapstick silliness, raunchy riffs, politically incorrect rants and sweet nothings."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 58,
      "summary": "There really ought to be a lot more movies like Hit & Run, but only if they're just a little bit better."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Burt Reynolds and Sally Field they're not, but you could do worse for mindless late-summer entertainment than Dax Shepard and Kristen Bell in Hit & Run."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "This slapstick road movie feels tossed off by people on a raunchy bender.  I mean that as a good thing. The trouble with Hit & Run is that it can't sustain its trippy effervescence."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "What dooms Hit and Run, which, charitably, is not as generic as it's name implies, is that the film itself comments on its own sincerity."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "Pretty much everything shot by Shepard and co-director David Palmer looks as if it was done in one take. Hit & Run is closest in tone to the Tarantino-penned \"True Romance,\" but it lacks that movie's menace."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 50,
      "summary": "The movie feels like a grown-up version of little boys making whooshing noises and staging collisions while playing with toys on a living room floor. It belongs to the same star-and-his-pals-cutting-up genre as the lesser comedies by Frank Sinatra and the Rat Pack."
    },
    {
      "critic": "Anika Chapin",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 45,
      "summary": "One senses that the movie doesn't quite have the chutzpah to be what it wants to be - a \"Fast and Furious\"-like sequence of balletic car chases - so it periodically halts to wedge in some romance."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "A bizarre mélange of earnest and romantic road movie, high-octane chase picture reminiscent of everything the mustachioed version of Burt Reynolds ever did, and a slapsticky comedy that gives Tom Arnold considerably more screen time than actually necessary."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 40,
      "summary": "Sadly, Hit & Run, for as much sporadic fun and genuine heart it has, runs out of gas. But it's not for lack of trying, and that counts for something."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "There's only so much an actor can do with lifeless dialogue. It's hard to blame the cast for looking less than committed; they all realized too late that Shepard created a monster."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "Hit & Run is a pleasant enough diversion - but more of the PPV persuasion."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "Hit & Run is pretty rancid as comedy. Worse, the chases are strictly amateur hour, all shortcut editing and no gut satisfaction."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 38,
      "summary": "A slow, meandering misfire of a movie."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 30,
      "summary": "That even the criminal class has gone sensitive and finicky eco-conscious has some potential for comedy-or drama, as in Oliver Stone's undervalued Savages-but there's no single detail that might convince a viewer that the characters played by Dax Shepard and Bradley Cooper might ever have been compelled to steal for a living, and this alienates the crime picture from any social context or sense of actual danger, making it essentially a celebrity goof-off."
    },
    {
      "critic": "Zachary Wigon",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2012
      },
      "score": 25,
      "summary": "Far more frustrating than the film's banally conventional plot structure is its characters' lack of depth."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 20,
      "summary": "Interminable scenes of macho posturing and mock-Tarantino dialogue (including a lengthy dissection of the word fags!) mark time between a number of ineptly staged car chases that would embarrass the makers of \"Cannonball Run II.\""
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "It's essential that you like Dax Shepard and Kristen Bell before you even consider seeing this film.  If you do, and if you keep your expectations at a modest level, it's actually pretty fun. There's just not much to it.  Tom Arnold really steals the show, as he does with most movies he's in (see: True Lies).",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I think this movie works. There is good chemistry between the two leads, the story is plausible, and the supporting cast is good. The car chases are very good. good mix of funny and action sequences, more like Beverly Hills Cop, or 48 Hours.  Don't listen to the reviews.",
      "total_reactions": 2,
      "user": "Burbis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Clever, funny action packed realistic romance and great chemistry between the leads. Really what more do you want? The dialogue is great especially in the first third of the movie then the action takes over. Highly recommended.",
      "total_reactions": 5,
      "user": "Proteus"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "This movie is just plain dumb. I know they are all friends and made it to have fun, but they could have made a decent product. Anything remotely funny is in the trailers, and the rest of the movie is filled with racist and homophobic slurs. I'm an 18 year old college male and even I was offended and just bored. Skip it. In fact, RUN away (see what I did there? Cuz of the title...)",
      "total_reactions": 5,
      "user": "tropicAces"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Krsiten Bell and Dax Shepard are a real-life couple, but none of their chemistry translates to the big screen. He's in the witness protection program, but leaves it to get her to LA for a job interview. Meanwhile, the crooks he betrayed (led by Bradley Cooper) get wind of his whereabouts and set out to get even. For an action comedy, this has neither. There's only one funny joke in the entire movie (thanks to a cameo from Jason Bateman) and the endless, manic driving is just fast & dull. Shepard wrote and co-directed, so he gets all the credit for this total dud.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "I don't care what anybody else says. I literally laughed my a$$ off in this movie. Maybe because i went into the theater with extremely low expectations but i definitely walked out extremely pleased. I laughed harder in this movie than i have in a very long time. Hit and Run has a perfect blend of action, comedy, car chases, and drama. I really do not understand all of the poor reviews. It certainly wasn't perfect all around, it had a couple plot holes, and it got kind of repetitive at certain points but overall though, there was laugh after laugh. Every actor/ actress was exceptional in this movie. I loved it and i think anybody who enjoys hilarious jokes with solid action will thoroughly Hit and Run. I certainly did, and i recommend this movie highly. 9/10",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 2,
      "text": "Huge disappointment.  The film was advertised as the comedy hit of the summer, but I chuckled only twice and the rest of the audience seemed to have a similar reaction.",
      "total_reactions": 2,
      "user": "jr1445"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "While the story is much better and more interesting than I thought it would be going in, the movie is still a comedy at it's heart, not a romantic comedy or action movie. Being a comedy movie, I woud've hoped for more humor. Honestly, take Tom Arnold out of the movie and it's not funny at all. The acting was solid, the car chase scenes were entertaining, and the romantic comedy element was well played. But bottom line, a comedy has to be funny and the laughs were too few and far between in this movie for me to rate it any higher.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Hit & Run is a wild ride that never should have worked, but surprisingly it does. The story doesn't appear to be deep or complicated, and just when you think they've come to the end, a whole other angle begins. The film is further helped by a large cast and a whole bunch of interesting cameos, that help take it to another level. Charlie Bronson (Dax Shepard) is happy living in a small town with his girlfriend, Annie (Kristen Bell), but things are about to change. When Annie gets offered a job in L.A., Bronson must decide whether or not to go with her, which also means leaving the safety of the witness protection program. When a jealous ex learns of the plan, he finds out who Charlie really is, and thanks to Facebook, connects with the men he's hiding from, making the trip to L.A. a dash for safety, across California. Dax Shepard is not an actor I find to be very funny, but this was the first time I've seen him play a character as deep as Charlie Bronson, and he was terrific. He is being perused by Bradley Cooper of all people, who I did not see as someone who could play the bad guy. His good looks and charming personality, don't exactly lead one to believe he'd be believable as a bad guy, and while he wasn't the toughest bad guy I've ever seen, he does more than an adequate job. Hit & Run isn't an award winning film, it may not even be all that memorable, but it is extremely entertaining and an edge of your seat thriller ride. The perfect film for those who want to just sit back, relax, and enjoy the show.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "Hit and Run is nothing more than a painful comedy, if you can call it that. The racist and homophobic jokes they try to use isn't just unfunny but completely desperate. The movie is absolute garbage from beginning to end.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Bell and Shepard are a real life couple and it's plenty obvious. They have great chemistry here in a very funny movie. Watch out for Tom Arnold as well. He's hilarious in this.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Really funny movie. I'd rank it with the Hangover. It's just one of those comedies that's gross funny, and really lovable at the same time.",
      "total_reactions": 0,
      "user": "trevortalks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Dax Shepard, who serves as co-director, one of the several producers, writer, and star of Hit and Run, appears to be heading in the right direction for actors-turned-directors with his off-kilter debut film. It would seem that all Shepard wanted to do was knock this little project off his bucket list, and round up several recognizable leads and just have a good time making what seemed to be a good film. It certainly isn't a bad film, interesting is more like it, and Shepard's sophistication behind the camera and on-camera is likable enough to warrant a small, controlled recommendation if anything.",
      "total_reactions": 0,
      "user": "StevePulaski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 0,
      "text": "I never thought I would give a movie a zero, but this stink bomb will be my first.  The dialogue in this movie consisted of a bunch of race and gay jokes that missed the mark horribly.  I don't mind controversial dialogue or comedy if done right, but these jokes come off as just mean.  From the scene about jail rape where Dax Shephard goes through all the races to find the rapists nationality to putting a dog collar on a black man and treating him like a dog because he buys the wrong dog food this film sucks.  I didn't care about any of the characters and to compare this to Tarantino like dialogue maybe the biggest joke in this movie.  This is the worst movie of 2012.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "An overrated nobody with too much hair on his chest. Does he think he's funny? Check. Is he funny? No, way! It's a mystery to me how this man can be employed and why he even considered being a part of this film. There are squirts of glimmer. The rest is trash and not worth the time.",
      "total_reactions": 0,
      "user": "vetiver"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "There are some really big laughs in this film, the best being the scene with the old swingers because it was so unexpected. Definitely a LMFAO moment. Laughs are aplenty in Hit & Run and the movie's strengths lie in the characters and dialogue as well as the chemistry between Kristin Bell and Dax Shephard.",
      "total_reactions": 0,
      "user": "madism"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "It's highly entertaining with cameos by several of the director's pals and pit stops for delivering sub-Tarantino dialogue.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}