{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 55,
  "mc_movie_name": "Home",
  "mc_negative_rating_frequency": 36,
  "mc_positive_rating_frequency": 169,
  "mc_pro_critic_reviews": [
    {
      "critic": "Dana Rose Falcone",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 91,
      "summary": "The combination of Home’s layered message, fun score, and clever comedy make it a colorful choice for moviegoers of any age."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 83,
      "summary": "Tim Johnson gets the character stuff right, and the animators do an amazing amount of subtextual work with color and with texture ripples on the various Boov characters.. It's lovely work overall, and it might be the most cheerfully benign conquering force we've ever faced on film."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Jim Parsons brings his own irrepressible energy to DreamWorks’ 3-D animated Home, segueing from almost-alien misfit Sheldon Cooper on “The Big Bang Theory” to alien misfit, period."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "Home is like when someone gets you a birthday present by just clicking on an item from your Amazon wish list. It's well-made, suitable, and appreciated, but there wasn't really any thought put into it."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 75,
      "summary": "The movie is pretty droll, and it agitates for cross-species friendship; its aggressively packaged heart-tugging elements come with an interplanetary friendly resolution. Followed by a dance party."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 70,
      "summary": "A surprisingly moving tale of friendship and family, dressed up as an adorably frivolous sci-fi comedy."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 70,
      "summary": "A charming concoction with positive messages for younger children about conquering fears, understanding outsiders and knowing yourself."
    },
    {
      "critic": "Sandie Angulo Chen",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Home is about the yearning for the comforts of family. But this kiddie sci-fi adaptation doesn’t quite live up to its evocative title."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Home delivers like a mailman on Valentine’s Day. But when we scratch beneath the sugary surface, there’s something tart inside that’s difficult to digest."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Home is a energetic, obvious animated comedy packed with the sort of low humor and silly laughs that drive very small children wild."
    },
    {
      "critic": "Kate Stables",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Dreamworks’ sweet and cosy sci-fi comedy could have used more Oh-riginality but top-hole character design should ensure a Big Bang of Boov merchandise."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Home feels oddly small-scale for a globe-spanning science-fiction adventure story featuring aliens and flying cars."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "If director Tim Johnson -- adapting Adam Rex's book The True Meaning of Smekday -- can't do much with the story's confused, if well-intentioned, agenda, at least he's got some charming, vivid characters to work with."
    },
    {
      "critic": "Jamie Neish",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Home is funny, colourful and fast-paced."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "There’s nothing in Home that you haven’t seen before, but there’s a lot in it your kids haven’t; as animated sci-fi for small fry, it’s a success whose modest but well-executed ambitions are no small part of its charm."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Unimaginative and downright predictable by grownup standards, but bursting with elements sure to appeal to younger auds."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 58,
      "summary": "Though it opens with the studio’s seemingly mandatory voice-over setup, the story itself, adapted from the children’s book \"The True Meaning Of Smekday,\"  shows immediate conceptual audacity."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Tension is one of Home's biggest issues. There just isn't nearly enough of it. Story is another."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "A drab dream with squirmy-cuddly aliens, floating space bubbles and too many Rihanna musical interludes."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Home could have fashioned a more original story, dug deeper into a theme of cultural understanding and jettisoned the toilet humor."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "I kept thinking about “Lilo & Stitch” while watching Home, a decidedly disappointing effort based on the popular kid-lit book “The True Meaning of Smekday” from the already embattled folks at DreamWorks Animation."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The problem is, the story lacks originality and zest."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "If overly familiar and uninspired, Home is nevertheless agreeable, especially for young viewers who haven’t been down this road countless times."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "It’s refreshing to see a nonwhite lead, and the husky-voiced pop singer is likable as a brave-hearted kid searching for her mother. But man, is there a lot of Rihanna in this movie: She also provides what seems like the entirety of the film’s soundtrack, making it feel like a vanity project (is “vanimation” a thing?)."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "Director Tim Johnson (DreamWorks’ Antz) and writing team of Tom J. Astle and Matt Ember (Epic), keep the momentum humming and the amusing bits reasonably entertaining, but they can’t vanquish the prevailing feeling of deja vu, and that the Boov are merely Minions of a different hue."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "For all its energy, razzle-dazzle and whiz-bang technology, it doesn't know how to tell a simple story or cobble together three-dimensional characters, and that's a problem not even the best of 3-D glasses can fix."
    },
    {
      "critic": "Tom Huddleston",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A smart concept is thoroughly wasted in this cute but grating DreamWorks animated comedy."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Jim Parsons is the sole bright spot in the cast as the alien hero, giving him the same halting confusion as he gives Sheldon on “The Big Bang Theory.”"
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "This underdeveloped offering barely lifts itself off the drawing board."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Home's exposition is a mess of forced zaniness, which leaves the rest of the film with a Swiss-cheese foundation."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "If DreamWorks Animation is hoping to get back on track with this movie, a lavish sci-fi comedy based on a recent children's book, they're pretty much doomed."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This colorful masterpiece is so cute and behind all the music there's a feeling putting into it, a beautiful message. It's funny, brilliant and ageless. Imaginative and 1 of the best animated movies of the 10's. Oh it's an amazing role and the story don't make sense at all but that's the best part it doesn't have to be realistic, it's an animated movie so no one cares. Good job for Rihanna though.",
      "total_reactions": 3,
      "user": "Lenis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "Children's animated films get old, they become predictable in no time at all, and it's for this reason that I tend to stay away from them, until I was convinced to see this new animated film called, Home. Let me cut to the chase, Home is terrific. Home's plot is extremely simple, simple for a kids film, that's how simple it is, but Home is full of thrilling moments that always deliver. The film is hilarious, and I feel that absolutely everyone who goes to see it will be chuckling at some point, it uses many different styles of humour, all of which will have you laughing. The all-star cast make the voice acting fantastic and believable. But the best part of Home, is the terrific emotional weight it carries, it not just about laughs, it's about friendship, it's about morals, it's how you see the world, and how the world sees you, it's powerful. It delivers several different kinds of emotions and feelings throughout the film, it will give you warm feelings, sad feelings, happy feelings, thrilling feelings, you'll be laughing, you'll be enjoying the thrill, there's never a dull moment. It's for this powerful display of emotion that Home is the best film I've seen this year, it managed to shock me and thrill me in ways that no other animated film has before. For every reason I've said above, it'll be getting a perfect score, for the emotion, for the laughs, and for the absolutely perfect, flawless climax, which is better than some big budget films I've seen. Home truly is special.",
      "total_reactions": 3,
      "user": "Robinson2511"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "o filme e otimo e emocionante ,n sei porque so tem 55 no metacritic ,quase chorei no final e as musicas deram um toque especial ao filme e fizeram com que o filme ficasse perfeito",
      "total_reactions": 3,
      "user": "henry45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Generic HollyWood fluff basically what this movie is.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Home has a very likable lead Oh and Tip and also a very good story line.It is funny,touching and has a good lesson about family and friendship and just being unique.It teaches us that our mistakes are what make us humans and Boov.I loved the soundtrack,the animation was amazing and I almost cried like 3 times.This movie is amazing,I don't understand all the criticism towards it,but in either case I loved it and I would suggest it to anyone who hasn't seen it.",
      "total_reactions": 2,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Dreamworks is probably my 3rd favorite animation company behind Disney and Pixar. So when I heard they were releasing only 1 movie this year I was kinda sad. The characters are Oh and Tip. Jim Parsons is a good actor and all but he's pretty much playing Sheldon but an alien. Tip is ok too but the movie focuses on the Boov so much that she doesn't get to develop a personality that much. I think Rihanna should just stick to music making. But the biggest problem with this movie is the story. It feels like 5 plots were mixed in a blender and the filmmaker s just went with that.The jokes basically consist of toilet humor,  my least favorite. The animation is ok I guess. Dreamworks, if u want to get back on you feet this film isn't helping u. 6/10",
      "total_reactions": 1,
      "user": "ThatCoolCritic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "I absolutely love this movie!!! I think it's the best Dream Works movie I've ever seen and the soundtrack is fantastic. Everybody must see it and listens to Rihanna's voice. \"Home\" deserves at least ten Oscars.",
      "total_reactions": 15,
      "user": "hhernanalegre"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "A race of squishy semi-adorable aliens overcomes Earth and relocates the humans. One endearing misfit (Jim Parsons) causes a calamity and teams up with a lost girl (Rihanna) to find her mom. This colorful animation starts with a fast-paced first hour: lots of eye candy and quick comedy. Once the inevitable emotion kicks in, the pace slows and the action is accompanied by tender songs. Still, there's enuff creativity in the characters and originality in the visuals to delight the eye and charm the imagination.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Either two things are going on... the critics are being paid to give Home a bad score or they're on crack. This movie is good! I'll admit that the beginning was a little bit chaotic story telling wise, but as the film progresses it gets better and better, and you end up leaving the theater in a good mood. Everyone I've talked to who's seen this movie have all agreed this movie was enjoyable. Not a single person has told me it was bad. If you got kids, they're sure to love this movie.",
      "total_reactions": 10,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Just one of DreamWorks' best movies with nice soundtrack, funny and cute characters. Hope Home will be a franchise because it deserves it. It has a famous cast like Rihanna, Steve Martin, Jim Parsons and Jennifer Lopez. It's not boring!! It's interesting. Go now and see it.",
      "total_reactions": 12,
      "user": "nasosli"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "this must be the most adorable movie I've ever seen.",
      "total_reactions": 8,
      "user": "RihannaTheGreat"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Home",
      "total_reactions": 4,
      "user": "michael1208"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This is really really cute, I'm a little tired of movies that show  / focus on super cool visuals and forget about  the story, the moral,  the cuteness of the story  instead of grown up  jokes here and there and long minutes from a laugh to the other, THIS IS simple,  but adorable, Oh / boov is so cute, his inability to conjugate verbs makes the movie super funny saying \"you has\" , \" i has \" ,   eating  things that he doesn't know what they are for, he's a little slow, he doesn't understand human emotions, the girl keeps saying they have to find \"my mom\" , so he keeps referring to the mom as \"my mom\" , it's like a tarzan and Jane adorable discussion except throughout the  whole movie yet you laugh every single time. it is about friendship , there's not fighting in the whole movie, how often do you see that now? there's no  evil guy with an evil plan , it's a cute movie with a few sad and many  funny moments. This is how all animated movies should be like, really loved it, hope it has a sequel.",
      "total_reactions": 2,
      "user": "waitin4forever"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "This movie did everything it needed to and added on more to it. The Boovs made a great race of aliens to appear. Funny, entertaining, thrilling and pure greatness. Without a doubt one of the best movies I've ever seen, and I got the exact ending I was hoping for. Dreamworks, you really do know how to make masterful movies.",
      "total_reactions": 2,
      "user": "Tbone413"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "This movie was very funny at times but I believe there should be more action. I liked the idea but it could be expanded on sometimes. Overall, it was very good. 8 out of 10!",
      "total_reactions": 2,
      "user": "Metacritic007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "The movie started with short history of the Boov's adventures to find a home, which basically is the short film released a few years ago, but the film itself is different from what the marketing made it out to be.",
      "total_reactions": 2,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 3,
      "text": "Terrible movie. I didn't enjoy it, my wife didn't and my 6-year-old daughter didn't either. Waste of time and money.",
      "total_reactions": 2,
      "user": "Drakan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Esta es una de las mejore películas de animación y ciencia fisión que e visto, es una película de comedia  familiar muy interesante felicidades al director",
      "total_reactions": 2,
      "user": "polara23aqqqaqa"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "HOME for me means friends, family and happy exactly what contains the HOME animation! IK really really love the movie and I really expect this to get released! Was amazing!!! I really love the characters, specially Oh and Tip!!! Good job!! And the Soundtrack is PERFECT!!!!!",
      "total_reactions": 7,
      "user": "andreinavy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "Home is probably entertaining for children, but as an adult, I thought that the film was a bit lacking. The movie had a rushed storyline where parts of the movie were not explained enough in full during the first half of the movie to understand how the concepts of the movie worked. Also, the fact that 80% of the film's soundtrack consisted of Rihanna songs both kills the belief that the sound crew had a taste for creativity during the film, and also makes me believe that the producers cut a deal with Rihanna to put several songs performed by her in the film to save money on production costs. (In other words, a \"2-for-1\" special.) And, to add more mention of \"Rihanna advertising\" to the film, the character she voices just happens to be from the same country as her; since no characters in the film have singing parts, this film, at a certain point, started to feel like an advertisement for a Rihanna album.",
      "total_reactions": 6,
      "user": "Steel1943"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "One of the best animated movies I have ever seen. This movie was absolute non-stop fun. I was entertained throughout though I honestly thought this movie was going to be bad. It had gorgeous animation and was very creative.",
      "total_reactions": 3,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Desde Mexico, excelente pelicula, de lo mejor que he visto en 3D y 2D, excelentes graficos, coloridos, historia interesante, y personajes simpaticos como lo fue Puerquin (PIG), la trama de la historia dirigida correctamente al publico infantil y juvenil aunque en mi caso soy adulto y aun asi me parecio muy interesante, espero una segunda parte.",
      "total_reactions": 5,
      "user": "SagaGeminis"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "HOME was an excellent movie.  Not only did it provide us with a powerful message, it featured THE first african american lead role in an animated film for dreamworks.  That is great to finally see on the big screen.  I don't want to spoil anything in particular but this is a film that everyone should give a chance.  I will say the humor might be a little dry for our older generation but I can guarantee you'll still enjoy it as a whole!  Moving on to the magnificent soundtrack executive produced by the beautiful Rihanna, the soundtrack is what makes this film so beautiful.  Even the a couple of the songs explain that you can never give up on what you want and to never \"let the shadows find you\".  Overall, give this movie a try.  My kids LOVED it and so did I..enough to come make an account and spread the word ;)",
      "total_reactions": 4,
      "user": "jaredjrobinson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "this movie has Sheldon from big bang theory. if you like his un-social attitude this is the movie for you. but there are flaws like ugly characters, a predictable plot, and most importantly encourages under-aged driving as the second main character (forgot her name) looks like a 10 year old.",
      "total_reactions": 2,
      "user": "thegingercritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "While Home doesn't have anything particularly unique, I found myself laughing out loud, brought to tears and connecting with the movie multiple times. The voice acting of Jim Parsons is spot on in this movie, right next to Steve Martin. Rihanna isn't perfect when it comes to delivering her lines, but the music she brought to the movie definitely made up for it. The level of detail in this animation blew me away many, many times. It's beautiful, the music is gorgeous, and the overall message is one I think parents, kids and teens will all enjoy. At the end of the movie, the first thing I wanted to do was go and find my mother to give her a hug. Kudos to DreamWorks for a lovely comeback movie. It's the perfect start to getting back up off the ground, again.",
      "total_reactions": 1,
      "user": "inezel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Ok so yea I like alot of people expected it to be a little funnier but all in all I don't regret my choice to see it I loved the humor that was in it I thought it was a wonderful adventure for the entire family yes entire family and also has a good message about secound chances and how far u will go to save someone u truly love",
      "total_reactions": 1,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "6/10 .................................................................................................................................................",
      "total_reactions": 2,
      "user": "Shady313"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2015
      },
      "score": 1,
      "text": "Terrible. A species of Jar-Jar Binkses attack the planet. The central Jar-Jar befriends a creepy, ugly, zero-dimensional black girl who sounds like an adult Rihanna, who apparently is pretty far from being a voice talent. Than practically sit in a car for an hour. Peabody and Sherman seems sophisticated compared to this...",
      "total_reactions": 11,
      "user": "avada"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "An alright film, with a half way decent plot, I just find it hard to believe a alien species could develop hyper space technology and not understand basic empathy. it's not a bad film, but it's not great. Cool ending thought, even if you could see it from a mile away.",
      "total_reactions": 1,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "So you think, what Furious is better than the Home?!It's a children's movie.Maybe jokes aren't laugh, but it probably ones of unusual movies. 9/10-it all.",
      "total_reactions": 0,
      "user": "Hitanonym111"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "If you have kids, there is nothing to think about. Children will love it. On the other hand the monsters' design is pretty plain and boring. There is nothing interesting about them if you don't count that they can change the color. Through the whole movie when the main character spoke, I saw in my head Sheldon Cooper (Jim Parsons / Big Bang Theory) because they act in some sort of way the same. Jokes and gags are nice and so even as an adult you can survive the movie with your offspring.",
      "total_reactions": 0,
      "user": "davidhorak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Its cute and adorable but the story feels incomplete with the majority of the film seeming to be random, unrelated, filler. Its not bad, but its far from good. I would say wait for Netflix as its just not worth the price of admission.",
      "total_reactions": 0,
      "user": "Ansatsu83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I can appreciate what they were trying to do with this film which was to create a silly sci-fi film for children. I don't believe it was aimed at adults. But if my children had the sense to write reviews then I would gladly hand the keyboard over but here's my take being the adult that I am",
      "total_reactions": 0,
      "user": "MiggyD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I like most all animated movies and this was no exception. I think that this is a good family film that could be enjoyed by the young and old. I would Go see this one if you like animated films......",
      "total_reactions": 0,
      "user": "ricksroses"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "If you're looking for a fun animation with unique story. This is the one to watch. Was fun at momments, but i guess too childish. They tried to make a original story, but eventually - with so many flaws.",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "The standards for animated films have been set so high in recent years, films like; 'Toy Story 3' (2010), 'How to Train Your Dragon' (2010), 'Tangled' (2010), 'Wreck-It Ralph' (2012), 'Frozen' (2013), 'The Lego Movie' (2014), 'How to Train Your Dragon 2' (2014) and 'Big Hero 6' (2014) all come to mind, 'Home' is pitiful in comparison.",
      "total_reactions": 0,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "This movie had pettential that was lost in the first ten seconds that was full of cliches, plot holes and genereal just  bad story. Spend your money elsewhere snywhere but this movie",
      "total_reactions": 0,
      "user": "Imoron"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "Critically underrated and a rather imaginative toon which can boast some very funny jokes and one liners. It is also more palatable than many of the recent crop of animated films in that it doesn't get too mushy and soft centred at its conclusion. The story is sound and the score, including some impressive songs, is also an asset. Overall, surprisingly good!",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "If anything, Home is a nice idea with some genuinely heartfelt moments here and there. Some fun and colourful visuals too. However, the movie on the whole is just hastily put together and bizarrely paced.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "2/5★ Blatantly manipulative from start to finish, with child friendly colors, shapes and bubble pop tunes (its usually more subtle). Add Rihanna for a cheap \"cool\" factor and what you have is a zippy but forgettable film that is basically a Rihanna introduction to the last of the youngest generation that haven't heard her music.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"Home\" may seem like a soulless \"E.T\" ripoff, but when you actually see the film, you will find 90 minutes of silly but heartwarming fun, go watch it! It will not dissapoint.",
      "total_reactions": 0,
      "user": "Parappafan1996"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Two unlikely friends in an unexpected adventure.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "The main alien \"O\" is pretty annoying. Even the kids seemed to find him more strange than funny. The little girl he befriends is creepy and weird, with a voice and demeanour of a 40 year old. The whole movie is just a series of random unconnected bits. And what kind of an idiot thought about a movie where a little kid drives a car? Don't show this movie to your kids. It'll sunt their learning ability I swear to god. Or it might encourage them to try driving your car. Who knows? All I know is don't waste you or your child's time on this.",
      "total_reactions": 0,
      "user": "GameHunter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Home is a familiar little adventure which leads to a sense of predictability. Yet, despite that it is a funny and enjoyable family movie. One that can suitably entertain everyone watching regardless of their age. It just won't blow them away.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Visuals were somewhat decent, but there was to much pop music that intrudes on the story, and to much unresolved between the humans and aliens to make the ending entirely believable, like they skipped a few necessary installments, that you are left underwhelmed.",
      "total_reactions": 0,
      "user": "ScreenSquinty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Absolutely loved this film.. why too many dislikers! This film contains funny and emotional stuff. I was close to cry, but I'm giving an 8 because the story isn't very deep, but it makes you feel good while you watch it.",
      "total_reactions": 0,
      "user": "diegonelli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "This movie made me waugh. HAHAHAH get rekt noobs!!! There may be a lot of violence in this movie but.... GET REKT NOOBS!!! MWAHAHA Bibliography Tennessee Washington Bibliography I son't even know XD",
      "total_reactions": 0,
      "user": "DeathSpace2002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Good movie but I can hardly say the script Boov very tangled , but in another opinion script almost good , but full of fun. DreamWorks currently shows new ideas and leaves regulated by the thought and critical view .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "This has got to be one of the most adorable movies I have ever seen.",
      "total_reactions": 0,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Home breaks new ground for Dreamworks with a strong female lead, a message about uniqueness and gorgeous animation. Unfortunately, that is lost amidst the gags, Rihanna songs cutting out any dramatic moments, and typical hip humor that Dreamworks is known for. Had the film focused more on the girl’s conflict being separated from her mother and the heartfelt message this could’ve been a great film. Instead it’s another passable but forgettable Dreamworks film. Children will enjoy it and parents might smile but nothing worth remembering.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "The idea behind this was great from DreamWorks Animation. The storytelling though and our respective characters didn't make the movie worth giving a good score in. It's still decent though.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "it's not that bad it deserved  a little better review on rotten tomatoes but fortunintly the user metacritc is more appreciated.At least it got what it deserved.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Home is one of the DreamWorks movies that isn't near that good like Shrek or How To Train Your Dragon, but still I enjoyed the movie. Rihanna has done songs that made the movie top any musical Disney film, it's also humorous and has a good moral.",
      "total_reactions": 0,
      "user": "Bmeyer8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "Boring. I love children's movies and work with kids so I see a lot of them but I couldn't even pay attention to this one. just not original and not that funny. just blah",
      "total_reactions": 0,
      "user": "Stargirl04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "Home is a truly wonderful and heart-filled movie that captures the spirit of what it means to feel at home. The film draws comparisons to our own individualistic techno-culture and that of the BOOV's, which is completely devoid of friends and family. Save for \"Oh\" one of  the film's two protagonists, who feels alone among his alien peers. The other lead \"Tip\" helps to teach Oh about the love of family. It's of no surprise that this film wasn't well received initially, as these concepts are not as commonplace in popular culture as they once were. Home is a much needed and well deserved film for our generation and the next.",
      "total_reactions": 0,
      "user": "JFleisch315"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "To be honest, I don't think this is a bad movie, but it's just disappointing. The story has it's ups and downs. The two main characters are well developed and their interactions are well acted. The animation is pretty good, and it has a good message. However there are problems. It can get really annoying at times and some scenes just don't cut out. Plus I feel as it just doesn't have that much emotion outside of the two main characters. Overall, not DreamWorks best work, but not its worse.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "Out of any \"Dream Works\" movie I've watched, \"Home\" has to be the weakest. It's not bad mind you, but it did have a lot of room for improvement. On what you ask? Everything. The characters, graphics, story, music, voice acting, and I'll even say the jokes could have been a bit wittier. It's enjoyable for the first time watching, but it's one of those kinds of movies where you're only satisfied watching it once.",
      "total_reactions": 0,
      "user": "wariothelegend"
    }
  ]
}