{
  "avg_user_score": 6.7,
  "metascore": 65,
  "mixed_rating_frequency": 15,
  "movie_name": "Honeymoon",
  "negative_rating_frequency": 5,
  "positive_rating_frequency": 26,
  "pro_critic_reviews": [
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "I wish the film withheld more information from its audience to raise the overall tension but it’s a solid genre pic, made so primarily by two entirely committed performances from its talented leads."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "Honeymoon is a microbudgeted horror movie that achieves some genuinely shivery moments."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "The gory final act can't help but be an explanatory letdown after so much enigmatic fizz, but that's little bother when the rest of \"Honeymoon\" delivers a steady dose of newlywed nightmare."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "A lean, low-budget debut that taps into newlywed anxiety with subtle wit and no small amount of style."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "Janiak handles both horror and drama ably enough to suggest that she’d excel at either genre. She hasn’t yet mastered the combination, but it’s only her first try. Give her time."
    },
    {
      "critic": "Zachary Wigon",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "While its ending descends into standard horror tropes that fail to completely satisfy its promise, the film nevertheless achieves emotional resonance due to how effectively it joins its source of horror with the stuff of everyday human anxieties."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2014
      },
      "score": 63,
      "summary": "It waffles between dramatizing youthful self-absorption and succumbing to it, and this tonal instability comes to effectively mirror the domestic discord that's revealed to be its real subject."
    },
    {
      "critic": "Simon Kinnear",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "The thematic weight drags down the tension, yet just when it seems Janiak has forgotten the scares she pulls off a creepy finale."
    },
    {
      "critic": "Nigel Floyd",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "Janiak has succeeded in making what she calls ‘an elevated genre story’, yet much of its frightening psychological ambiguity is erased by a disappointingly conventional ending."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "A tense, two-piece horror with serious kick."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Una pelicula interesante, solo creo que llega hacer muy lente en ocasiones como que le dan vueltas a una sola cosa mucho. pero si te puede tener entretenido. peor es interesante la trama",
      "total_reactions": 2,
      "user": "Roachramirez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "I truly wasn't expecting much from this movie but it actually surprised me. It had an interesting story, good performances and an ending that leaves you speechless. I recommend this movie.",
      "total_reactions": 5,
      "user": "igor789"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "The pathetic thing is that this movie reminds me of at least one relationship I've had.  That's sad!  It's a well-acted, fun little genre flick that doles out clues as to its meaning nicely throughout.  Rose Leslie is absolutely fantastic in the lead role, and Harry Treadaway does a nice job in supporting her.",
      "total_reactions": 3,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "super low budget, and it shows.  There is no pay off or explanation.  Just leading on the audience along then ends, probably lack of budget to show anything actually cool.",
      "total_reactions": 3,
      "user": "bob13bob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "This is the most messed up horror I've watched since anti-christ. It's really disturbing and leaves that deliciously bitter taste in your mouth along with a general feeling of unease. It's also one of those rare films that doesn't try to lay everything out for you but doesn't fall into obscurity either in an attempt to seem deep. Brilliant performances from both of the leads, who are relatively new faces. Just goes to show how you don't need a huge budget when you have a great script, an original horror concept and a couple of solid actors. This is a horror classic which will achieve cult status I think",
      "total_reactions": 2,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "A low budget horror movie from a newcomer director. In that perspective, it was a decent movie, because within the limits everything was done nicely. In fact, it was a minimal cast movie set in an isolated cabin in the woods. A simple story that is like the title, it is about a newly married couple's honeymoon. All sets off nicely to them until strange events begin to follow one after another. How the couple manages to come off of it, or do they is the rest.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "since there was so much kissing and banter and adorableness at the beginning of the movie, i just waited for the dark stuff. but, it wasn't dark enough. nice little psych horror scifi type flick, though. do not get why both leads were english. didn't like the guy--total lack of sex appeal.",
      "total_reactions": 1,
      "user": "ariel84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "Honeymoon veers away from what one would traditionally expect with a horror movie. There aren't actually any scare tactics going on. Instead the movie is more concerned about messing with your mind. As a result this isn't the type of the movie that's going to scare your pants off. It will, however, get you involved with it's compelling mystery.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "I actually really liked Honeymoon. The directorial debut of Leigh Janiak, Honeymoon is a tense, chilling little indie horror flick with adequate performances from Rose Leslie and Harry Treadaway. The film is deeply influenced by both science fiction and more demonic possession type horror films (think Invasion of the Body Snatchers, Rosemary's Baby, The Exorcist, etc.) and is not completely original, but does play around with both of these two leave you really questioning what actually happened at the end. This ambiguous ending will not work for everyone, but it really worked for me and really heightened my enjoyment of it because of the various clues left for any explanation. Overall, Janiak demonstrates a very good understanding of genre conventions and how to make a satisfyingly slow building horror film with great atmosphere and thoroughly entertaining chills.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "The story starts off a bit boring, but gets interesting as it progresses. The soundtrack only appears for the scary parts. There are no jump scares. The movie does one thing and it does it well - creeping the **** out of the audience.",
      "total_reactions": 0,
      "user": "FireOccator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Honeymoon features spectacular and dedicated performances from both leads. But it also possesses incredible scares with not-very-incredible but enigmatic ending.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "I walked into this movie completely blind. I haven't seen a trailer, read a synopsis, or really heard of this movie today until someone recommended it to me. It ended up being a really creepy and weird movie. Honeymoon is about two newlyweds on their honeymoon, Paul and Bea, but it takes a turn for the worst when Paul finds Bea dazed and confused in the middle of the woods one night. The film's structure reminds me of Paranormal Activity or The House of the Devil; not much really happens until the final act, but when it does happen, it's crazy scary. The tension builds up very nicely for the first hour and leads to an excellent payoff. What's nice about Honeymoon is that it allows us some time to get to know the two characters before we get into the meat of the story, which always helps a horror film. It might be a little slow for some people more attuned to a constant barrage of scary faces and gore, but if you like your movies heavy on atmosphere and tension, Honeymoon is the perfect movie.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Let me start by telling you that i have been a horror movie junky for literally most of the 34 years i've been alive. If you are a horror aficionado do yourselves a favor and completely ignore the bad reviews. These people obviously  prefer big budget holly wood action flicks to real horror movies, and or they just get off on critiquing things unjustly. Whatever their deal just ignore that. This movie is not an adrenaline fueled action fest. It makes you confused, uneasy and anxious and continuously ramps up notch by notch. It is creepy as all hell. Maybe as a movie its not scream out loud scary, its something worse and more disturbing. WATCH IT!",
      "total_reactions": 0,
      "user": "Gmork"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "The performance from both actors was good and the movie theme was fine but I really didn't get the story of it! :/",
      "total_reactions": 0,
      "user": "Mehdi_Zarei"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "First let me say, I DO NOT like scary movies. I usually turn the sound off at the scariest parts because I'm such a wuss. Haha. BUT, I really quite enjoyed Honeymoon.",
      "total_reactions": 0,
      "user": "tashelizy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Newlyweds Bea (Ygritte from GameOfThrones played by Rose Leslie) and Paul (Dr. Victor Frankenstein from PennyDreadful played by Harry Treadaway decide to spend their honeymoon in a secluded cottage in suburban Canada. At first, the beloved act sickeningly lovey-dovey, everything around them sings and blooms, the birds are tweeting, the bugs are doing their  bugsy things, etc. BUT. One dark night, Paul out of nowhere decides to go fishing, soon he founds out that Bea is missing, she turns out in the woods, naked. From this point things start to worsen by the minute...",
      "total_reactions": 0,
      "user": "CrimsonLullaby"
    }
  ]
}