{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 20,
  "mc_mixed_rating_frequency": 14,
  "mc_movie_name": "Hoodwinked Too! Hood VS. Evil",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "Panettiere's performance has the straightforwardness of a jumbo crayon."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Mostly \"Hoodwinked Too\" is playing to young video gamers, with overblown action sequences and slangy 'tude."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Hopped up like a kid on a sugar rush, Hoodwinked Too! tries to emulate the \"Shrek\" formula - mashing Hans Christian Anderson and the Brothers Grimm with pop-culture references and wisecracking anthropomorphic sidekicks."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The movie can't be saved from its own vices of manic pacing and tediously pro forma pop culture jokes."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The script is a mad, muddled blitz of one-liners and movie references.  Some of the animation is a hoot, and a few voice actors stand out."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 42,
      "summary": "It raises the question of who the movie is for in the first place: Kids have seen much better animation in other films, and it's hard to imagine too many grown-ups ready to smile and nod at yet more smirking takes on famous moments from \"Scarface\" and \"The Silence Of The Lambs.\""
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 30,
      "summary": "While it seems there's no getting away from this marketing aesthetic, the resemblance at times to a video game is far, far too acute."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 30,
      "summary": "Hansel and Gretel are this movie's breakout stars, but it's not enough to make Hoodwinked Too feel like anything but a storybook hurled straight at your head."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 25,
      "summary": "The need for a sequel was zero - proved by the fact that the characters end the movie pretty much exactly where they started it."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 25,
      "summary": "Red Riding Hood needs a better agent."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 25,
      "summary": "It's outstandingly obnoxious."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 25,
      "summary": "Memorable for being one of the most obnoxious animated movies of recent years."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 25,
      "summary": "By the time the giant, snarling spider shows up - the most boggling of the movie's various \"holy schnitzel\" touches - parents of the littlest \"Hoodwinked\" fans may be feeling hoodwinked themselves."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 25,
      "summary": "As if by deliberate and vaguely sadistic design, Hoodwinked Too! Hood Vs. Evil leeches the fun clean out of the first \"Hoodwinked\" (2005)."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "Less a movie than a ill-advised lab experiment in which classic children's stories are injected with Bond-movie stylings, inane wisecracks and martial-arts mayhem, this manic misfire takes storybook revisionism to ever more irritating ends."
    },
    {
      "critic": "Nick Schager",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "Further marred by second-rate 3-D and the sort of cornball one-liners that even a fairy godmother couldn't love, it's a tolerance-testing tale that puts the grim in Grimm."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 16,
      "summary": "For the love of movies, stay away."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2011
      },
      "score": 12,
      "summary": "Parents should take their children to Hoodwinked Too! Hood Vs. Evil, if only because kids are never too young to learn the important and liberating skill of walking out of a movie and demanding a refund."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "summary": "One of the most obnoxious and least necessary animated films of the century thus far."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "summary": "The only entities hoodwinked by this animated sequel are paying customers."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "summary": "One of the more depressing, desensitizing experiences I've had in a theater, Hoodwinked Too! Hood Vs. Evil feels as computer-generated as its creepy, talking-ceramic-toy style of animation."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 4,
      "text": "With me actually enjoying the movie I have to be honest it is a disaster it isn't much of a piece of a story more like one being smashed to bits but I liked it and it is entertaining. I give this movie 45%.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 2,
      "text": "The kindest thing I can say about this lifeless HOODWINKED sequel is that you should take your kids to see RIO.  If you've already taken your kids to see RIO...then take your kids to see RIO again.  My 6 and 4 year old boys enjoyed HOODWINKED TOO (although they both gave it an 'A' as supposed to their standard 'A+' for all things animated...this inspires hope as they're learning the balanced art of downgrading).  from a parents point of view, however, this below sub-par, Red Riding Hood, fairy tale mish-mash provides nothing more than 90 minutes of childcare while mom and/or dad catch an in-theater nap.  The animation is sloppy, the story uncreative and the lazy pop culture references thick.  Take your kids see the bird movie 'cause Mother Goose just laid an egg.",
      "total_reactions": 8,
      "user": "MovieGuyBrian"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "The big bad wolf is a reporter. It's the perfect disguise for a sexual deviant. Nobody would ever suspect an investigative journalist of molesting little children. A newsman doesn't commit crimes; he reports on them. In \"Hoodwinked\", Nicky Flippers, the British-accented frog who runs a secret agency called H.E.A., gathers all those under suspicion of being the \"Goodie Bandit\" into the parlor, which includes Red, her granny, the actor, and the furry scribe. \"The wolf did it. Talk about profiling,\" complains the journalist who systematically is accused, then exonerated by the frog during the amphibian's summation gathering, where through the process of elimination, it's determined that the bunny is the guilty party, who makes off with Granny's recipe book whilst Nicky imitates the pragmatism of a Scotland Yard detective. But the frog, so smug and self-assured in his powers of deduction, drops the ball on the bigger, more heinous crime, in which he overlooks not one, but two sexual predators, who want nothing more but to ravish the little delivery girl. Surprisingly, even though \"Hoodwinked\" is an animated film intended for small children, the adult theme of a young girl's sexual awakening, prevalent in the subtext of the classic Brothers Grimm faerie tale, where the wolf, who is made anthropomorphic by his attempt to seduce Little Red Riding Hood from her grandmother's bed in disguise as the silver-haired matriarch, is even more self-evident about his lecherous urges than the film warrants. After the classic exchange between the girl and wolf about the latter's oversized body parts, anomalous to that of an old lady's anatomy, he adds, \"Are we just gonna sit around here and talk about how big I'm getting?\" Red, however, is considerably younger than her counterpart in \"Red Riding Hood\", as substantiated by her reluctance to walk through the woods(which is metaphorically speaking, representative of a girl's emerging womanhood), but instead, uses the ski lift to ride over the forest, therefore robbing the red cloak of its traditional association with menstrual blood. Despite her tender age, Red, like all girls, can't help but be objectified, so inevitably, she ends up in the woods, and is suddenly fair game to the wolf, who doesn't care that Red's hymen is intact, and hasn't seen the sight of her own period blood. Regardless, he comes on to her, making coded inquires about her \"goodies basket\", and the good smell that it gives off. From Red's point-of-view, the wolf's growl is a menacing one, imbued with sex in its primal roar, precipitating a chase which lands the libidinous pursuer into the lake(akin to a cold shower), where he shouts indignantly, \"You can't hold on to those \"recipes\" forever,\" recipes, meaning, of course, her virtue. Modeled after \"Rashomon\", this moderately ambitious cartoon has a narrative splintered off into multiple points-of-view. As the wolf tells it, his bared teeth and threatening hand gestures was induced by a tail injury, but given the filmic context of the celebrated touchstone in Japanese cinema, can the journalist be trusted to give an accurate recounting of events? Probably not. He's about as reliable as the bandit Tajomaru and the other witnesses giving testimony to the prefecture magistrate. Notable for its fallible narration, the Kurosawa film employed flashbacks that obfuscated the truth. For all intents and purposes, The Woodsman is lying too. The aspiring actor, as a sideline, drives a schnitzel truck, selling the phallic-shaped snacks(\"schnitzel\", by the way, is slang for penis) to unsupervised children who excitedly follow the vehicle that seemingly lures them away from their parents. In the actor's version of events, Red rides her bike past the depressed thespian without his notice, too overcome with grief by what he perceived as a disastrous audition, and yet, the coincidence seems too great that the axe-wielding actor should end up at her grandmother's place in what looks very much like a home invasion. (Did the filmmaker adopt the moniker from \"The Woodsman\", the 2004 movie about a reformed child molester, with Kevin Bacon?) The moviegoer can either believe the official story(the actor claims that he was doing research for his role as a woodsman), or that he did see Red passing by his schnitzel truck and followed her back to grandmother's house. Even worse, in \"Hoodwinked Too: Red vs. Evil\", the wolf's lust for underaged children is made more explicit, remarking, \"Let me tell you something about Goldilocks. That is not her natural hair color.\" Meanwhile, Red gets her period, which is suggested by how her cloak refashions itself into a long vertical line(meaning that her menstrual blood is trickling down) at the outset, as a preventive measure against falling off the bridge which leads to the training academy. The ogre functions as a stand-in for the wolves of the world that a young girl like Red has to fend off.",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Complete utter crap is all I can say. What happened to the 6 rating? I would take 6 over 20 anyday. This is definately a runner for worst movie and worst sequel.",
      "total_reactions": 3,
      "user": "xXAnthonyXx"
    },
    {
      "neg_reactions": 12,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Good family film dont beleive critics they are crazy!",
      "total_reactions": 12,
      "user": "jordyboy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "much better than the originall i love it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 3,
      "user": "moviefan11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2011
      },
      "score": 5,
      "text": "Not as bad as all that, thanks to a few funny quips voiced by an impressive pack of pros including Glenn Close, Amy Poehler, Joan Cusack, Martin Short, Cheech & Chong (!!!) and the always amusing Patrick Warburton (Puddy from Seinfeld; Kronk from The Emperor's New Groove) as the Big Bad Wolf.  Hayden Panettiere tries hard as Red Riding Hood, but lacks the lovable spunk that Anne Hathaway brought to the 2005 original.  Unfortunately, the animation looks cheesy and the script lacks the subversive wit and clever story structure of the underrated earlier film.  And thanks to all of those Shrek movies, the whole 'hip fairy tale spoof' thing feels pretty played out.",
      "total_reactions": 0,
      "user": "Winstonoboogie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 3,
      "text": "The 1st Hoodwinked (In My Opinion) Was A Masterpiece! But This Movie... Ummmmm Ya Not Good... The Cast Didn't Even Seem Like They Were Trying... Boring Voices  Sadly Boring Plot As Well As The \"3D\" Effects Which Were Not That Great... This Movie Is Somehwat Cute For Little Kids... I Wouldn't Be Suprised If They Said This Movie Is The Worst Movie Of The Year...",
      "total_reactions": 0,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "One of the worst movies I have ever seen. Dont waste your time watching it. Its a very boring story with no creativity, very bad voice acting, and terrible animation",
      "total_reactions": 0,
      "user": "slsoccer7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "There are two things you should know about \"Hoodwinked!\" First, the original movie was outstanding and has a different take on Shrek meets Mary Poppins. The second, however, was a so-so with no Anne Hathaway and with a set of poor voice acting and not so shimmy on the jokes. But I'll pass \"Hoodwinked Too!\" a big disappointment in the list of family films of 2011.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Some movies just aren't meant for adults. If your kid is begging to see this again (and you have the necessary technology), here's my advice: buy the 'Red's Escape' game in the App Store. They'll get to experience the characters, etc., AND will improve their fine-motor skills! A win-win.",
      "total_reactions": 0,
      "user": "progamer55"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 5,
      "text": "Hoodwinked Too may lack some of the better ideas of the original, but there is still some fun in this sequel. It is a little more daring but it also has a better ending than I expected it to have.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "As adults, we loath kids movies. Sure, some people get into the Disney stuff, but for the most part, adults despise films that are made for kids and I am no exception. It takes a really good story and some clever writing for a PG film to appeal to adults as much as it does to kids, and it's virtually impossible to do this while still keeping the PG rating intact, but somehow the writers of Hoodwinked have accomplished this twice! The story really isn't important, it's geared toward kids and is very simple and predictable. What's not easy is keeping the adults awake, while the kids have the time of their lives. The writers accomplished this by throwing in parodies of classic adult films. Hoodwinked Too! has references to Goodfella, Die Hard, Silence of The Lambs, and a half a dozen other classic films, and it was those scenes that were the most fun. Also interesting to note, the voice of the wolf was done by Patrick Warburton, who does the voice of Joe Swanson on Family Guy, and it was really difficult for me to see the wolf as a totally different character. Hoodwinked and now it's sequel are nothing like Toy Story and aren't going to blow anyone away, but they are pretty good and while the kids are watching it, you'll find yourself getting in a few laughs as well. Hoodwinked Too! is a terrific family film with something for the whole family and is really the definition of what a family film should be.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Hoodwinked too is a terrible movie, its nothing compared to its predecessor. Its about as straightfoward as a melted crayon, A complete embarrassment in my opinion.",
      "total_reactions": 0,
      "user": "RainGuardian16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "allllll of you are saying this movie is bad when really it isnt :( ...................................................................................",
      "total_reactions": 0,
      "user": "madonnarules"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2013
      },
      "score": 5,
      "text": "It's a kids movie but it makes a Hansel and Gretel Dpiderman sequel to the most funniest movie- HoodWinked. It's cute but not as lavishing as the original. Hayden does good voice acting but bad from the others. I know- the haters, its a okay movie not a REALLY bad film. But a one time watch.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "otra de esas peliculas que creen que lo lograron todo con un excitoso comienzo, caperucita roja 2 sale a destrozar lo que venia siendo una buena idea y historia.",
      "total_reactions": 0,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Hoodwinked 2 is a terrible film. Shouldn't have been made, since it's one of the worst meant-for-kids movies I've ever seen. If you're a fan of the first, don't let this movie ruin your day.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2016
      },
      "score": 2,
      "text": "One of the worst movies I've ever seen, terrible dialogue, absolutely no character development, lazy animation, and a story so bad it would make cliche horror movie stories look good by comparison",
      "total_reactions": 0,
      "user": "Dualy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "I wish i could say the same as the original",
      "total_reactions": 0,
      "user": "MordoReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "Hopped up like a kid on a sugar rush, Hoodwinked Too! tries to emulate the \"Shrek\" formula - mashing Hans Christian Anderson and the Brothers Grimm with pop-culture references and wisecracking anthropomorphic sidekicks. I give it 65%.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 7,
      "text": "It's more than I can say for the Hoodwinked fans. But the film sounds a bit ugly, but very entertaining to me and some of the fans of the first film and the Shrek series. It is only a pursuit of answers that locks Boingo the Bunny up in a prison cell for years. :)",
      "total_reactions": 0,
      "user": "Tiber5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "It's more than I can say for the Hoodwinked fans. But the film sounds a bit ugly, but very entertaining to me and some of the fans of the first film and the Shrek series. It is only a pursuit of answers that locks Boingo the Bunny up in a prison cell for years. :)",
      "total_reactions": 0,
      "user": "PAMA"
    }
  ]
}