{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Hours",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 80,
      "summary": "An ingeniously simple setup is cunningly exploited for maximum suspense in Hours, a slow-building, consistently engrossing drama."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 80,
      "summary": "Mr. Walker is convincing as a man battling grief, exhaustion and, occasionally, an intruding outside world where lawlessness has taken hold."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2013
      },
      "score": 80,
      "summary": "The film stirs richer, truer feelings once it becomes a one-man show. This is due both to Heisserer's and Walker's skill — the tension is strong, the scenario elemental, and Walker's harried, urgent hero is compelling — but also the fact that the movies are really good at dudes doing things, especially when those things are scrappy, desperate, and heroic."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 75,
      "summary": "Heisserer is able to keep the thrills coming while maintaining an emotional tether to the character and the situation. While occasionally the movie veers into the realm of implausible melodrama, it's a well-modulated affair and knows exactly when to pull itself back from the brink."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 70,
      "summary": "The film’s brooding tension would probably work even without the recent tragedy of real-life events. But now, while uneven, the film is uniquely involving — right down to a final shot that will break your heart into a million pieces."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2013
      },
      "score": 67,
      "summary": "Though a screenwriter by profession, Heisserer proves to be more economical with style than storytelling. Like a few too many contemporary genre films, Hours suffers from flashbackitis, a chronic condition that leads filmmakers to believe that a tragic backstory will add gravitas."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2014
      },
      "score": 63,
      "summary": "Compared to the “Fast and Furious” films, Hours is a chamber piece, but Walker wrings real pathos out of his instrument."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 63,
      "summary": "Heisserer doesn't get everything right, but he sure knows how to milk a taut ending, including a miraculous final shot, one that would have drawn tears even if Walker were still around. For those who wish to see the actor at his best, Hours is worth the time."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 60,
      "summary": "Most of the movie elicits tense empathy, which builds to a genuinely nerve-wracking sense of dread."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "This drama, about an ordinary guy trying to keep his infant daughter alive in Hurricane Katrina's aftermath, is sincere but struggles as much as its hero."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "One only wishes Walker had stronger, better developed material instead of a promising drama that eventually unravels and seems overlong even with a running time of 96 minutes."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "From the evidence here, Walker’s forte may have been not action but stillness—a knack for embodying ordinary Joes without any fussiness. That we’ll never find out is truly a shame."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2013
      },
      "score": 40,
      "summary": "Though Walker, in his most demanding part, does his best to transcend his characteristically bro-ish demeanor, he’s ultimately failed by this film, whose script and questionable taste hardly add up to a eulogy-worthy goodbye."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 38,
      "summary": "Walker has few “big” scenes, no memorable dialogue and plays up the exhaustion, which tamps down the emotions of his performance. So even an action packed finale can’t rescue this dramatically thin exercise in one-man showmanship."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 25,
      "summary": "The movie is essentially a theater piece in which Nolan (Walker) is mostly alone on screen, making use of what he finds a la John McClane, but without the smart pacing or inventiveness of “Die Hard.”"
    },
    {
      "critic": "Tomas Hachard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 25,
      "summary": "The film's fealty to history is both unnecessary and a hindrance, pulling us out of a story that could have easily been set in an anonymous city hit by a nondescript hurricane."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Paul Walker shines in this small but powerful movie. While some scenes were out of place and the ending is too abrupt, Hours has an engaging story and is compelling for the most part.",
      "total_reactions": 6,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Size doesn't matter as Hours manages to be a powerful movie for the late Paul Walker by being substantially compelling and emotional despite its blemishing final scene.",
      "total_reactions": 3,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It's a massive undertaking of being a sole lead of a feature film like Tom Hanks did in Castaway or James Franco in 127 hours. While not as brilliant as above, Paul Walker displayed a heartwarming and sincere performance as a father who struggles to protect his child. He was more known for starring in Fast & Furious franchise, along with many other action movies, but I feel Paul Walker had only begun to mature as an actor, he will be sorely missed.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "It would be dishonest to say that some of the emotional power of this movie is derived by the untimely death of its lead, and it would also be dishonest to ignore the often slow pace. However the tension is strong enough, the cinematography fitting enough, and the acting powerful enough to bring home what is one of the most emotionally charged and feeling conclusions I have ever seen.",
      "total_reactions": 1,
      "user": "cryhardhumor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "It´s a great movie which captures from beginning to end through the constant obstacles Paul Walker has to face in this suspension-packed movie. You can actually feel with him as he tries to save his newborn daughter by keeping the machine working manually. I was literally praying for him to make it. It´s definitely worth a peak!",
      "total_reactions": 1,
      "user": "Mr_Rose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This movie will probably be missed by many, which is sad because it's a great film. Paul Walker does a great performance (R.I.P, Paul) and he manages to carry this movie on his shoulders (similar to Sandra Bullock and George Clooney in Gravity, and Robert Redford in All Is Lost, both of which I liked and reviewed). He manages to keep interest from dwindling. Hours is a compelling film.",
      "total_reactions": 1,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2014
      },
      "score": 9,
      "text": "rip paul walker . this is a epic cool movie but is it based on a true story ? . it is fun and epic and watching paul walker survive with his movie baby but some scenes paul walker can be a idiot .",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "\"Fast & Furious\" star Paul Walker (R.I.P) stars in this drama/thriller about a man trying to keep his infant daughter alive during the events of hurricane katrina. It takes a while for Walker's performance to acquire the required emotion needed to keep the movie afloat, but he does get it right after a while. My problem with this movie is that I never really cared about Walker's character at all. I cared about his infant daughter's fate, but I found him and his wife character to be really unenjoyable and almost unlikable. This made it hard for me to really get into the movie.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "Ya se que varios \"fanboys\" estarían esperando esta película por la trágica pérdida de Paul Walker. No hay nada para recordar. La película más aburrida que he visto en mucho tiempo (casi me duermo en el cine) y también recordemos que no son más de 100 minutos en el cine. ¿Por que razón es tediosa y aburrida? Por no tener movimiento; la película está atascada en su propia trama como Paul Walker está atrapado en ese hospital, lástima que los creadores de la película no supieron como avanzar y se quedaron presionando en una acción que el pobre actor debe realizar alrededor de la película, y, si se lo están preguntando, eso no es actuar, eso es obedecer. Muy aburrida y vacía.",
      "total_reactions": 3,
      "user": "Fedelca"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "One of the final movies of a fine actor of our time, Paul Walker. Small budget movie, only because of the story that did not require a grand setting and spectacular graphics. The whole film takes place inside a hospital and a very few external shots glued to the narration in pieces to make an exciting tale. Its his back to back after 'Vehicle 19' which also had a limited cast. At least he and his directors with writers proved these kind of small movies has an equal level of interesting materials to the grand ones. So it's about how you make one with all the finite resources and the rest is left to the people who decides its fate.",
      "total_reactions": 0,
      "user": "LeZee"
    }
  ]
}