{
  "mc_avg_user_score": 5.3,
  "mc_metascore": 31,
  "mc_mixed_rating_frequency": 50,
  "mc_movie_name": "House at the End of the Street",
  "mc_negative_rating_frequency": 36,
  "mc_positive_rating_frequency": 43,
  "mc_pro_critic_reviews": [
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 70,
      "summary": "Working from a story by all-around genre specialist Jonathan Mostow, director Mark Tonderai steers the story cleanly around its queasy hairpin turns, perversely toying with one of pop cinema's most cherished clichés: the audience's inculcated desire to side with the underdog."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 58,
      "summary": "Working from a solid template is only half the battle; the other half is filling in the details, and it's here that The House At The End Of The Street goes flat and generic, substituting jump-scares and visual twitchiness for the psychological complexity that might have sold the horror."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Yes, there are the requisite jump-in-your-seat scares, many of them false alarms, and it all plays out basically exactly like any other horror movie, but Lawrence does elevate the proceedings."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "Despite an intriguing setup, sharply drawn central characters and a lead performance from the luminous Jennifer Lawrence that elevates the material a few notches, House at the End of the Street is a by-the-book horror thriller that's low on scares and suspense."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "This PG-13 scare-fest is more psychological terror than blood and guts, and should satisfy-not repulse-young genre fans."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2012
      },
      "score": 50,
      "summary": "I doubt that Lawrence is conscious of this process. Nevertheless, stuck in a dull commercial feature, a very good actor happens upon a new solution to an age-old problem: She improves the script by transcending it, and steals the picture by abandoning it."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "A few old favourites – like the inconveniently wonky torch and the probably-not-quite-killed maniac – deliver the required jolts, but early promise dwindles to hokum."
    },
    {
      "critic": "Neil Smith",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "Sadly, any hopes Mark Tonderai's US follow-up to 2008's \"Hush\" could have some \"Cabin In The Woods\"-style surprises up its sleeve are swiftly dashed as its talented lead is reduced to being just another scantily clad babe getting stalked by a psycho."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 40,
      "summary": "We will simply be grateful she (Lawrence) is here, and thus able to turn generic junk into mildly interesting junk."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 38,
      "summary": "Most of the comedy, however, is unintentional. House At The End of the Street may not draw much of an audience during its initial run, but the movie's preposterousness certifies it for future midnight screenings, where the story will get the jeering it deserves."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 30,
      "summary": "Lawrence's natural, disarming screen presence is ill-suited to something as mannered and labored as House at the End of the Street, and at moments it's as if she freezes up, unable to simply throw on a scared-face for no good reason."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 30,
      "summary": "Exploiting Lawrence's newfound fame is the only hope this ill-conceived, poorly executed venture has of connecting with audiences before poisonous word of mouth sends potential buyers in search of a more attractive address."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "This is a terrible little movie even by the standards of the genre."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 25,
      "summary": "The film is essentially toothless, but it never stoops to humorless torture-porn theatrics."
    },
    {
      "critic": "A. A. Dowd",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2012
      },
      "score": 20,
      "summary": "Utterly incompetent psychological thriller."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2012
      },
      "score": 20,
      "summary": "At a certain point this would-be shocker suddenly jerks into high gear and becomes a blatant, incompetent rip-off of \"Psycho.\""
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 16,
      "summary": "We assure you, it's not worth taking a trip to down to the House at the End of the Street. Something horrible might have happened there, but it can't be worse than this movie."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 16,
      "summary": "This is the rare horror film so bad that you almost wish it had turned into a good old connect-the-gory-dots slasher movie. The only mystery at work is how Lawrence's agent ever let her sign on to this."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 11,
      "summary": "Shue, to her credit, looks like she's trying to crawl out of her skin, but hey, anything to get away from this hell house, right? Right."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "I very surprised at how good this movie was since it mainly got negative reviews from critics. I didn't find one thing wrong with this movie. It was suspenseful, unpredictable, entertaining, and wildly original.",
      "total_reactions": 1,
      "user": "mds03"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2012
      },
      "score": 4,
      "text": "Dumb plot, dumb scares and unsure of what it wants to be. I still love you Jennifer, good on you for not promoting this piece of crap. http://www.facebook.com/ElvisPresleySonElvisAaronPresleyJr",
      "total_reactions": 6,
      "user": "Dollis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "This is one of those cheapie horror flicks that was so **** it sat on the shelf for about two years before it was released.",
      "total_reactions": 3,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2013
      },
      "score": 4,
      "text": "There are really no scares in this movie.",
      "total_reactions": 2,
      "user": "Jacobparker"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2012
      },
      "score": 7,
      "text": "The House at the End of the Street, the new Jennifer Lawrence's movie, and I wanna say that I like it, the movie is very intereseting, but the development have some mistakes, the performances are good -the better is Lawrence- and the funny can be interesting for much people.",
      "total_reactions": 5,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "I'm sorry but this movie can be summed up in 2 words: predictable crap. This movie sucks, its not scary thats for sure but i was expecting all of this going into it. If a \"horror\" movie is rated pg-13 then that means 2 thing, you're going to have the worst crowd in your theater with a bunch of little annoying teenagers, and it means the movie will 99% of the time suck, and it did. There was literally nothing good with this movie. It was all predictable and annoying. I dont know what else to say other than don't waste your time with this crap. Its not worth your valuable brain cells. Ill give it a 2/10 out of sympathy..",
      "total_reactions": 3,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2012
      },
      "score": 2,
      "text": "House at the End of the Street was not what I thought it was going to be.  I really thought it was going to be a horror.  Thank God for the actress Jennifer Lawerence because she made the movie better than it was if someone else would have played her character.  I would not recommend any of my friends to waste their money to see this movie.",
      "total_reactions": 3,
      "user": "Diamondesta35"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "The house at the end of the street is the most emotional, powerful, moving cinematic piece. This film needs a nomination for Best Picture and may I go to say Best Film Of The Decade, my grandma even said that it deserves a Best Picture Ever sticker, I mean its that good. Go and see it NOW.....please",
      "total_reactions": 15,
      "user": "WhySoSerious008"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "It was an ok film, decent story which keeps you in a little bit of suspense till near the end.",
      "total_reactions": 1,
      "user": "maddocks2379"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Why on earth everyone is saying this movie sucks? The movie starts the Hunger Games' amazing Jennifer Lawrence, the movie really surprised me by being a very good movie, I really truly deeply enjoyed it, it is more Romance-Thriller than being Thriller-Horror, very good, well done! Although there is some problems about it, but still great!",
      "total_reactions": 2,
      "user": "HaithamBayazeed"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 0,
      "text": "I was expecting a bad movie but JESUS!!! This was AWFUL!! The enitre time I spent watching this dreck I prayed to God for him to KILLL ME!! AND I'M AN ATHEIST!! Hideous writing, hideous acting, hideous lighing, hideous, hideous, hideous!! Worst film of the CENTUARY!!",
      "total_reactions": 2,
      "user": "Drastre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 4,
      "text": "I'm not sure why this is considered a horror movie, I'm someone who's extremely easily scared and I wasn't at all. All the attempts at horror are just jump scares that you can see coming from miles away. It's boring and the acting is poor. It seems like it started out as a drama, as it has a lot of the elements of one, but then the developers saw how boring and bland it all was, and the poor acting performances, and just said \"Hey let's make it a horror\". House at the End of the Street falls flat, it isn't scary, entertaining, or worth your time.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "House at the End of the Street is an enjoyable film and can be entertaining at times, though it is often slow-paced at times. It also has hit-and-miss acting and the dialogue (to be honest) wasn't very good and was even cringe-worthy at times. The climax is thrilling, but it leads up to a predictable conclusion and an unoriginal twist ending that turns the film into a teen Psycho rip-off. In the end, HATES isn't a bad film though it could have been much better.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "What the critics don't tell you is that this movie makes you think. Its characters are all well developed and the performances are good. A pretty darn underrated movie.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "As far as thriller/horror films go, House at the End of the Street wasn't all that bad. Jennifer Lawrence is amazing as usual. Her stunning and unique look combined with her incredible range as an actress means she provides a solid lead, regardless of the plot. Speaking of which, this one actually had a halfway decent premise with some real potential. I think the movie ultimately fell apart for the lazy writing that led to a poor execution of the plot and the mediocre supporting cast. Elisabeth Shue leads a lot to be desired as the worrisome mother and Max Thieriot just doesn't deliver. A major part of the lazy writing I referenced earlier is the cliched \"person gets themselves into trouble by being stupid\" element that plagues so many of these movies. Lawrence's character might be among the nosiest I've ever seen in a movie. I leave it at that but I will say, it's tough for a movie to be suspenseful when you spend more time aggravated at the characters than you do worried for their safety.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "House at The End of The Street is another ambitious, low budget, Horror film, that tries to make a name for itself by using star power, but how much was I really expecting from a PG-13 Horror film? The story begins when Elissa and her mother move to a new house in the country, a house that is across the street from the scene of a grizzly double murder four years earlier. The house and story is surrounded by rumors and still occupied by the son of the victims, who Elissa quickly befriends. Once again we have a common theme that has been done to death, but the producers of this film were hoping that by spending big bucks on Jennifer Lawrence (Hunger Games) and Max Thieriot (Bates Motel) that they could get people to watch their film and it worked, but I suspect most people were sadly disappointing like I was. The acting was terrific and everything you would expect from these actors, but the story was so simple and predictable that it really wasn't worth watching. Being a PG-13 film didn't help either as there wasn't really anything too horrific or creepy to really catch your attention. If that wasn't bad enough, the first hour of the film was so slow, that I almost turned it off. The only thing that kind of gave me a laugh was that there was a lot of scenes with Jennifer Lawrence in the woods and I couldn't help but think that Katniss wished she had her bow. House at The End of The Street is a film that has the star power, but not much else, as it's a slow, tame, predictable film, that's been done and it leaves far too many unanswered questions. If you're a die hard Jennifer Lawrence fan, check it out, otherwise, I wouldn't waste my time on this one.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "The performances from Jennifer Lawrence and Elisabeth Shue are fine, but HATES has nothing to offer with its unlikable characters and uninteresting setup. It's not scary or interesting and it's not original. This is a movie for people who have never watched a horror movie in their entire life. I wonder how many people who gave this movie a good review are horror movie fans. Somehow I doubt it. That's not to say that you're an idiot for liking it, but there are other movies that have done this kind of story before and they've done it better.",
      "total_reactions": 0,
      "user": "Zal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Jennifer Lawrence puts up a decent performance but it can't save the film from what it is; boring, predictable, and terribly scripted.  Hopefully this film won't tarnish the career of one of hollywood's most promising actresses.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Jennifer Lawrence has this incredible pull that attracts us to the screen almost instantly, regardless of what mess is brewing. No, this film is not perfection--but we're thrilled nonetheless.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "This isn't a good horror film, matter of fact it isn't a good film period. The conversations were meaningless, characters seem irrelevant and everything seemed extremely awkward. The first 1 hour is mind numbing and then the last 30 minutes tries to jam everything together that in the end the movie is nearly a failure.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 5,
      "text": "For all its problems, the movie isn't half bad in the end. Although it had a bizarre twist, it was a twist nonetheless and that kept my attention. This certainly isn't  going to be the highlight of Jennifer's career, but the movie was interesting.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "Elissa becomes enamored with the neighbor next door despite his family's bloody history, but Ryan has several secrets of his own that he plans to keep hidden in the HOUSE AT THE END OF THE STREET. Mark Tonderai's new thriller loses itself in tired old cliches that have long since lost their appeal. The film is terribly miscast, forcing Elisabeth Shue and Jennifer Lawrence into an awkward mother/daughter relationship that feels very unnatural on screen. Max Thieriot's mousy performance is rather unconvincing as well, and lacks the impact needed in order to leave a lasting impression. The supposed twists offer few surprises, especially for audiences that have already seen the same story played out in a hundred different ways. This drains the film of any suspense, while the lapses in logic and poor decision making by the characters are sure to infuriate viewers. It would be better to just lock HOUSE AT THE END OF THE STREET away in the cellar with the countless other PSYCHO-spawns than to have anyone else suffer through another uninspired copy.",
      "total_reactions": 0,
      "user": "ILHM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "A half-decent thriller/teenage horror movie. The story is okay, the acting is okay, not many \"screamers\" - thanks for that. Won't watch it if not Jennifer Lawrence.",
      "total_reactions": 0,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 5,
      "text": "The film is hard to see ... Wing time is predictable but unpredictable. The film is to see it once and forget about it.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "Dont waste your money! Not a horror, and Jennifer Lawerence does not look good as a blonde. Overall, it was a very boring movie; had troubles tying to keep my eyes open through it.",
      "total_reactions": 0,
      "user": "hulkypulky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "House at the End of the Street is a classic thriller movie. It is indeed not in the correct genre of its placing in horror. The movie is about a young teenage girl that just moved to a new place with her mother next to a  teenage boy that survived his sister",
      "total_reactions": 0,
      "user": "Sarahfaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "Considering the movie stars the talented actress Jennifer Lawrence, I was definitely expecting better of this movie. It starts off generally promising, even if a bit generic, giving us time to get to know our main characters. Lawrence's character seemed to be level-headed and able to look out for herself. This character trait seems to diminish in the second half of the film, with her character instead being written as a typical horror chick, making pratfalls and idiotic decisions. The movie overall has a rushed feel to it, which can't be saved by it's adequate cast or relatively good set-pieces. It all just feels like it's trying to distract the audience from the awful writing. In places it feels like this movie is an experiment rather than a box office entry, which makes it even more obvious this film was made by a (relative) newcomer. In conclusion, I don't think the cast had the opportunity to put all of their effort into the roles due to the poorly written script, and although the visuals are good, the plot overall is extremely run-of-the-mill and unoriginal. It had the potential to be good, a piteous disappointment.",
      "total_reactions": 0,
      "user": "AD_Phoenix"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "It has it's moments, but all in all a very disappointing film. As soon as I left the Cinema I felt as though I had wasted my money. Jennifer Lawrence definitely made this film watchable, but she was probably the only entertaining thing about the film.",
      "total_reactions": 0,
      "user": "charlotteydwi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "i don't think that this film should have so many bad reviews. It is interesting and it has a great plot. Jennifer Lawrence and Max Theriot are not something spectacular but the result of the film is. It is an enjoyable horror film with a final scene that will chill you. It has action and suspense and it is a great entertainment for an evening. Maybe one of the best horror movies of this year (which didn't have any good). However, The house at the end of the street will entertain you.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "The only quality in this movie is the acting, but House at the End of the Street has nothing to do with horror, it is more of a Romantic Thriller, as a movie, it isn't bad it is mediocre, is HATES unwatchable? No, but you better spent your time on something else, good idea.",
      "total_reactions": 0,
      "user": "AReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "Obviously this film has been on the shelf looking for an audience for a couple of months, maybe years, from its release date, because Jennifer would never take work like this post-Silver Linings.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "It's a good movie with a nice background talking about production, and I consider Jennifer Lawrence's performance is great. However, it is \"supposed\" to be a horror movie and the film is principally focused on a teenager's relationship instead of scary and suspense aspects, fact that lowers movie's rating notably and creates a film unsure about its general genre.",
      "total_reactions": 0,
      "user": "jppl1999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "Esta es película sin dudas merece mejores valoraciones, si yo fuera un crítico le daría 100 puntos, la actuación de Jennifer Lawrence es excelente, y esto no es una película de terror, es una película de horror, así que no se confundan, esas dos palabras tienen un significado diferente.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "This movie is sooooooooo nice!!! i mean... its one of those deligfhtful movies for a bored night at home. Great plot and really nice surprises. I love it!!",
      "total_reactions": 0,
      "user": "bruninhohp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I know that the story isn't that good, but I liked it. It's good, and that's all. It doesn't will afraid you forever or something like that. It's just like a hobby and that's exactly why I liked it. I'm done with that bloody-massacre-horror movies.",
      "total_reactions": 0,
      "user": "ryandiamandis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "\"House at the End of the Street\" is highly underrated in my opinion, and is far better than people give it credit for. When I started watching it it was, admittedly, somewhat slow-going. Jennifer Lawrence, notorious for the \"Hunger Games\", seemed initially out of place in what was starting to look like a dull teen horror flick. But the movie had an amazing twist (and I'm someone who absolutely adores films that toy with your mind). Many people have noted this film as \"predictable\" and said that they \"saw it coming\". I disagree. The twist was definitely unexpected, and  I spent the entire final twenty minutes or so in astonishment.",
      "total_reactions": 0,
      "user": "dot_dot_space_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "\"House at the End of the Street\" 10 Scale Rating: 3.0 (Awful) ...",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2014
      },
      "score": 1,
      "text": "It sounded good, but I was lured into a very intelligent trap. The movie was horrid. You'd never think an Oscar winner (Jennifer Lawrence) could be so bad in a movie.",
      "total_reactions": 0,
      "user": "REDWOU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "\"tyler stop,, this scene sucks\".....what did he just inject not into her vein?....i hope it wasn't this movie or she wont feel it it for a while.......Lol!!  he brakes that guys leg feels wicked good to see but i hope that later he does more of that kinda stuff....men who fight men deserve the leg treatment....women are the overpopulaters",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Marcada por reviravoltas inesperadas dos personagens e elementos de suspense que são muito bem utilizados em cada cena proposta, o filme em nenhum momento deixa a desejar, as atuações de Jennifer Lawrence & Max Thieriot são extremamente convincentes (ao ponto de você, brevemente, esquecer que é tudo fictício)",
      "total_reactions": 0,
      "user": "LucasTReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "This is not a horror movie, but a sensational psychological thriller. I watched this movie not knowing anything about it, and holy cow am I glad that I did. I can't believe this movie is rated so poorly in comparison to a film like 'It Follows' which I watched a few nights ago and thought was terribly wretched (It Follows was rated somewhere around 95% on this very site).",
      "total_reactions": 0,
      "user": "Betelgeuse42"
    }
  ]
}