{
  "avg_user_score": 8.3,
  "metascore": 76,
  "mixed_rating_frequency": 50,
  "movie_name": "How to Train Your Dragon 2",
  "negative_rating_frequency": 28,
  "positive_rating_frequency": 506,
  "pro_critic_reviews": [
    {
      "critic": "John Semley",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 100,
      "summary": "It’s not about the world catching up to understand poor, lonesome Hiccup. It’s about Hiccup catching up to the expectations of the world on his own."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 100,
      "summary": "Gleeful and smart, funny and serious, this sequel surpasses the endearing original with gorgeous animation — a dragon Eden, a dragon scourge, an infinitude of dragons — and one stirring human encounter after another."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 100,
      "summary": "Not only does this second movie match the charm, wit, animation skill and intelligent storytelling of the original, I think it even exceeds it."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 100,
      "summary": "This is a sequel that has its own story to tell and that gets right down to it, and it expands on the ideas from the first film, but in a way that tells a thematically satisfying and complete story. In other words, this is how franchises are supposed to work."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 90,
      "summary": "If necessity is the mother of invention, then DreamWorks’ desire to extend the Dragon franchise has propelled the creative team in the most admirable of directions, resulting in what just may be the mother of all animated sequels."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "One of this year's true surprises, the superior animated sequel not only is infused with the same independent spirit and off-kilter aesthetic that enriched the original, it also deepens the first film's major themes."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "A riveting, moving and beautifully animated film."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "If anyone is concerned about the way women are presented on the big screen these days, just look at how an evolved male like Hiccup respectfully treats his girlfriend Astrid (America Ferrera) and the portrayal of Blanchett’s Valka."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "It's thrilling, a soaring blend of 3D animation and spectacular storytelling that swerves daringly to honor the healing chaos of family, human and dragon."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "The movie offers just the right amount of spectacle."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 88,
      "summary": "Looks, feels and flows like a real movie. It's better than the last few Pixar features, among other things, and from where I sit that includes \"Toy Story 3.\""
    },
    {
      "critic": "Bob Mondello",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 85,
      "summary": "Director Dean DeBlois has been saying this installment is the middle movie in a How to Train Your Dragon trilogy. It's clear that he took inspiration from the first Star Wars trilogy — not a bad model for breathing new life, and yes, a bit of fire, into one of Hollywood's more nuanced animated franchises."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 83,
      "summary": "How to Train Your Dragon 2 is how to make a sequel, when it gets its head out of the clouds."
    },
    {
      "critic": "Helen O'Hara",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 80,
      "summary": "At times terrifying and too tough for tinies, this is nevertheless a triumphant sequel that puts its faith in Hiccup and Toothless to find a way through dark times for man and dragon. Until we all get our own dragon to go flying with, the result is a story sufficiently thrilling to have us all airborne."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 80,
      "summary": "What DeBlois has deepened in No. 2, is the film's emotional core. Though there are moments when the tension goes slack, the cast steps up to keep things afloat."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 80,
      "summary": "The rote hero/villain face-offs are exciting, but the film is in no hurry to fast-forward to them. DeBlois seems to have a real passion for this world, and like Hiccup, he seems much more interested in soaring through the clouds than in fighting on the ground."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 80,
      "summary": "The look of the film is amazing. The animation, particularly when the dragons take flight, is seamless."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 78,
      "summary": "I laughed, I cried, I longed for a pet dragon to call my own."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Visually interesting but offers nothing groundbreaking. The animation is competent but not overwhelming. There's no moment of wonderment."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Like its 2010 predecessor, it's one of the most gorgeous computer-animated kids' films you'll come across, and one of the few that uses 3-D smartly and effectively."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "It is by far the sharpest-looking DreamWorks Animation film to date."
    },
    {
      "critic": "Jody Mitori",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Thankfully, all of the voice actors from the original return, including Kristen Wiig, Jonah Hill and Craig Ferguson, and keep lightening the mood."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "Offers some stunningly beautiful sequences and an engaging, if at times quite dark, story line."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 75,
      "summary": "While the original movie benefited from narrative simplicity and an admirable lack of villains, this one paints the screen with too many characters and frequent diversions from the main story, but nevertheless serves up a bountiful and sugary feast for the 3-D-bespectacled eyes."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 70,
      "summary": "Dragon 2 is at its best when it quiets down and dares to be intimate."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 70,
      "summary": "Dragon 2 is considerably darker and more self-aware than its forerunner. Both films are speedier than the average animated blockbuster. In places, Dragon 2 is almost too fast to keep up with, and, in other places, it’s a little too dark, at least in 3-D."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2014
      },
      "score": 70,
      "summary": "The plot is needlessly busy, and much of the action is more manic and indistinct. But How to Train Your Dragon 2 cuts deeper than the first picture — it will be particularly resonant for anyone who has ever worked with or adopted rescue animals — and there are a few sequences of cartoon grandeur."
    },
    {
      "critic": "Leslie Felperin",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "Clearly, these films are the work of people who love animals. More importantly though, going beyond the pat eco-conscious message that every kids’ film has to have, HTTYD2 touches on how complex the emotional bond between a person and an animal can be."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 67,
      "summary": "There aren’t just more dragons, but more characters, more plot, more everything. The trade-off is that the charm of the original gets a little lost, a casualty of rapid-franchise expansion."
    },
    {
      "critic": "Oliver Lyttelton",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 67,
      "summary": "After meandering for a while, the story kicks into gear in the third act, with a couple of legitimately shocking and well-executed developments that do pack a punch missing elsewhere in the film."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 63,
      "summary": "How to Train Your Dragon 2 recaptures those lyrical highs. But returning writer-director Dean DeBlois also aims to layer on more poignancy for Baruchel and his castmates to play. At points, we’re left feeling a little detached."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2014
      },
      "score": 63,
      "summary": "A cartoon with better animation and livelier action, if fewer jokes. If there’s one thing these sweet-message/great flying sequence movies don’t need is fewer jokes."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Hats off to Dreamworks for offering some bold surprises in a respectable sequel filled with moments of humour and emotion among its ample noise and movement."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "Younger kids looking for the cute connection between hesitant teen Hiccup and his loyal dragon, Toothless, may be stunned by the film’s violent tone. At the same time, it’s the unflinching edge that gives the film its unexpected depth."
    },
    {
      "critic": "David Calhoun",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "This is a more rugged affair than, say, \"Frozen,\" and any admirers of that film might find themselves yearning for a few more songs and a little less testosterone."
    },
    {
      "critic": "Inkoo Kang",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 60,
      "summary": "If there isn't enough to feel, at least there's a lot to look at. Thanks to the superb 3-D direction by DeBlois, we swoop through the air, whoosh down dragons’ tails, and juuust baaaarely squeeze into small crevices, but still, those experiences are only like being on a really great rollercoaster — they don't mean anything."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 60,
      "summary": "The action sequences here are armrest-gripping fun, and you only wish DeBlois and his animators had been even more confident; held their shots even longer; allowed us to enjoy the whistle of the wind and the curve of the dragons’ flight paths without hurriedly cutting away to another angle, and another, and another. When the film flies, it soars."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2014
      },
      "score": 50,
      "summary": "It has the core of a genuine crowd-pleaser, but unfortunately something bigger and more all-consuming keeps getting into its head."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2014
      },
      "score": 50,
      "summary": "What's unfortunate is that Toothless is starring in a toothless story."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "DreamWorks, thank you. THANK YOU! Thank you for making a sequel to one of my favorite animated films and not screwing it up! And, on that note, thank you for making a sequel to an amazing animated film and building on the previous film like a sequel should! \"How to Train Your Dragon 2\" is a fantastic animated adventure that's brilliantly animated, well-acted, excellently written, action-packed, and emotionally resonant. When all is said and done, this might go down as one of the greatest animated sequels ever made, and it is an absolute must-watch! If you haven't gotten the chance to see the film yet, do yourself a favor!",
      "total_reactions": 1,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "Hiccup, the main character of the movie, lives in a small viking town called Berk. Thanks to his studies and constant analysis of dragons, people of Berk now a lot more about dragons and understand them better. They are living peacefully with tamed dragons until a group of dragon hunters arrive from a neighboring place. From then the story gets twisted and we unpredicted events unfold.",
      "total_reactions": 1,
      "user": "alwayswatching"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "How To Train Your Dragon 2 is one of the rare cases in which an animation can entertain kids and adults equally.  Boasting beautiful animation, strong character development, and surprising emotional impact, How To Train Your Dragon 2 succeeds in becoming one of the best animated films ever made.",
      "total_reactions": 1,
      "user": "SkyrimGuy935"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Quite possibly the best animated sequel of all time, How To Train Your Dragon 2 expands its boundaries while retaining the heart-warming spirit of the original. The animation quality is superb; the plot is as mature as any Lord of the Rings movie; the soundtrack is mind-blowing; and the characters are relatable human characters, complete with flaws and realistic character development. It far surpassed my expectations, and was worth the 6 month long wait. Honestly deserves the wins for Best Animated Feature, Best Original Score, and Best Original Song at the 2015 Oscars.",
      "total_reactions": 1,
      "user": "BlueSky8642"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "It doesn't have the bit of charm from the first movie, but it's still worth it to say that it's still a decent sequel to the charming original that made the book look like a success.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "How to train your dragon 2, unexpectedly waited, is better than the original. With Hiccup's mother induction the plot is gorgeously and cleverly at its best. Dreamworks haven't made the best movie of the year since 2001's Shrek. Definitely it deserves to be named a children classic and the 2nd best movie of Dreamworks behind Shrek. Nowadays it's time to considerate that Dreamworks is making an excellent job.",
      "total_reactions": 1,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "This is a very good film, but for me it lost the charm of the original. Typically, sequels to an animated movie end up being trash, but this film doesn't follow that trend. As a sequel, it has more dragons that are very interesting and cool looking. The action, graphics and overall story in the film are great as well! I'm very happy with the progress of the main characters, and it really sets up the 3rd film well. Where I was turned off, was the constant need to force Toothless into doing cute actions. In the first film, Toothless had a genuine cuteness to him, but in the sequel it was overdone and quite frankly became distracting. For example, there would be some important dialogue between characters, and then Toothless would be doing something in the background... I guess they put this is for the kiddies who could care less about what's going on in the story, but as an adult, I care about the characters and the challenges they're trying to overcome... but I couldn't focus on what they were saying with how distracting Toothless became during those scenes. Also, I really liked the rag-tag bunch of Hiccups friends in the first film. They were a ton of fun, but in the sequel, they didn't have the same impact. Astrid as Hiccups girlfriend is boring, and Snotlout, Fishlegs, Tuffnut were not really funny. Ruffnut was definitely the best of the group, but her \"joke\" quickly ran its course, when they used it over and over again. Other than the many distractions from Toothless and the lack of fun from Hiccup's group of friends, this movie was a fantastic sequel. I will recommend it to all families and feel like it's a great challenger to Lego Movie for best animated film of the year.",
      "total_reactions": 12,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "For starters, “How to Train Your Dragon 2” has a very mature and rich story that is filled with emotional and dramatic depth. It grows our characters from the first film and really feels like a continuation of the series and not just some cash grab. We see how Berk has changed and how the lives of everyone on the island has become better, I really love how the film tackles darker subject matter like remorse, forgiveness, and redemption, while at the same time touching on themes of love and loss. The screenplay is filled with moments of pure heart and we really see the bond between Hiccup and Toothless expanded upon. Not only is this a great screenplay, but also Dreamworks’ best since the original “Shrek.”",
      "total_reactions": 16,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "The storytelling in this movie is really bad, the emotional elements like loss, sacrifice etc are just dealt with on a very superficial, bad tv style level, there are a lot of plotholes. The dragons are cute, though, but I feel this is one of the animated movies that drags the genre down instead of lifting it up.",
      "total_reactions": 3,
      "user": "Emme"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Just finished watching HTTYD2. Yes, Yes, Yes, Yes, Best animated i have seen so far",
      "total_reactions": 3,
      "user": "eXaLpHaXe"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "While it lacks the 'wow factor' as it's predecessor, How To Train Your Dragon 2 retains the emotion, fun and brains of it to spur another Dreamworks hit.",
      "total_reactions": 3,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "This sequel takes place 5 years later, when brave Hiccup and his dragon have united their species in harmony. Then comes a villain who wants to enslave them all. The plot and dialogue are pretty mundane, the characters lack any spark or originality, but the animation is lovely. There's too much dialogue for young audiences, but enough action sprinkled throughout to entertain. Overall, an uninspired and unspecial followup. (I don't understand why several of the Vikings in this village have Scottish accents.)",
      "total_reactions": 5,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Story:",
      "total_reactions": 5,
      "user": "DemonicSoul"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I was pleasantly surprised by how great this film was! In fact, this sequel performed the rare stunt of being equally as good, if not, better than its predecessor! While it does return to some of the familiar concepts from the first, it even offers a lot of new things as well. There's more action, excitement, emotion, you name it! I was definitely entertained from start to finish! Overall, this was a very worthy and groundbreaking sequel to an already great first movie! If you loved the first, then don't hesitate to see this one!",
      "total_reactions": 7,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I didn't think that a sequel to a movie could be better than the original. I'm glad to say that I was wrong. Everything about this film works to improve on the first. The graphic design seems much more colorful this time around. The level of detail is astounding. The voice actors are just as spectacular, especially Cate Blanchet as Valka. Most importantly, the mood and emotion has become much more adult, resulting in the movie appealing to more ages.  I have seen this movie twice already. I may even see it again, because it is just that good.",
      "total_reactions": 11,
      "user": "mgastryker"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "As soon as the movie started I could tell something was off. The only character that expressed any real emotion was Toothless, everyone else seemed so lifeless. During most of the dialogue the characters mouths moved and words came out, but they were so inexpressive it didn't feel like they were actually living characters with something to say. The entire film lacked in humor and had less charm than a single frame of a Disney or Pixar film. This was disappointing because I quite enjoyed the first one.",
      "total_reactions": 19,
      "user": "Soapert"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Much, much better then the original one. That's it. YOU SHOULD KNOW WHAT THIS MOVIE IS!!!! GO SEE IT NOWWWWWW!!!!!! DON'T WASTE MY TIME, GO WATCH IT!!",
      "total_reactions": 10,
      "user": "Yaysuz"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "The overall fell is darker and much more mature, which is a good thing, especially with the 5 years gap. The animation, is unsurprisingly gorgeous, so is the production design. The action, by cinematography standpoint, is majestic and epic. But one has to expect, with all of those nice additions, you will get something less, especially the story and character developments. Other thing to regret, how under-mixed the beautiful score by John Powell is in the movie, makes the scene anti-climax. Overall, a nice sequel, but just that, not more",
      "total_reactions": 8,
      "user": "Visuritium"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "How to train your dragon 2 is amazing, one of the best animation movies I have ever seen, It will surprise you in all the ways! The movie is funny and exciting at the same time. I think I never seen a sequence of a animation movie as good as that.",
      "total_reactions": 6,
      "user": "victorhjkl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "absolutely amazing! i can't believe how much i loved \"How To Train Your Dragon 2\"! cause i did went into this movie excited, but i was also worried if it was gonna screw up like usual sequels do. i was so wrong! \"How To Train Your Dragon 2\" is everything a good sequel should be. first of all, it's absolutely gorgeous! and the best part: it takes the incredible animation of the first movie, makes it even better and takes it to the next level. the flying scenes in this movie are incredibly stunning! like they're flying around and the camera's following them, it was so beautiful and it felt like i was up there with them. and i saw it in 3D, so my mind was literally blown away. and the CGI in this movie's definitely top notch! like there's this shot of a piece of land and a ship. it's a far away shot that looked so great, i was like \"It looks like live action. This looks like a live action movie\". but aside from the incredible animation, deep down this movie's something even more. it takes the characters we all loved in the first one to the next level, just like a good sequel should do. ya know in the first movie, Hiccup was the boy, the boy who found a dragon. in HTTYD 2, he has to become the man, the chief of Berk. this reminded of \"The Lion King\" or \"The Empire Strikes Back\". i walked outta the movie like \"This is probably \"The Lion King\" or \"The Empire Strikes Back\" of this generation\". the action's exciting, the comedy's hilarious and it has fantastic emotions. i actually cried like 3 times in \"How To Train Your Dragon 2\". this movie's not just for kids, it's also for adults. i mean, adults are gonna love this movie, cause there are themes that really hit them, and kids are gonna love the movie cause it's a fun and exciting action/fantasy movie with incredible animation and awesome dragons. and when they grow up, they'll start to understand the darker themes and emotional aspects the movie was going for, and they'll appreciate it even more. that's what i call a good sequel! another one of the great highlights in the movie, it's the relationship between Hiccup and Toothless. to Hiccup, Toothless's a lot more than just a pet dragon. he's Hiccup's best friend and they really show how complex the emotional bond between a person and an animal can really be. it was perfect in that sense. the only small gripe i got with the movie, it's that Drago could've been a little better as the villain. don't get me wrong, he's still a great new character and the movie does make him better as it goes. it's just that, when he first showed up, i was like \"This guy feels kinda weak\". that's just a small gripe, it's not enough to bring the movie down. honestly, i can't think of anything bad in \"How To Train Your Dragon 2\". it's the best animated sequel from DreamWorks we have, since \"Kung Fu Panda 2\". Dean DeBlois, i really hope you win the Oscar for this movie. you definitely deserve it! you gave us one of the best sequels in a really long time. i'm telling ya, Dean DeBlois knows what he's doing in every movie he makes. he gave us \"How To Train Your Dragon 1\" which was amazing. now, he gives us \"How To Train Your Dragon 2\" which is even better. i'm really excited for \"How To Train Your Dragon 3\", but i don't know how they're gonna top this one. this is the BEST animated movie of the year, and probably one of the best animated movies in a really long time. so, if you haven't seen it yet, go watch it. i swear to you, you're gonna love it.",
      "total_reactions": 4,
      "user": "NikoZguri1997"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Fantastic",
      "total_reactions": 4,
      "user": "Mibekrie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2016
      },
      "score": 7,
      "text": "How to Train Your Dragon 2 is a great sequel to the sublime original. It nails most aspects and easily displays whey the Dragon series is probably the best animated franchise out there. Roll on number 3!",
      "total_reactions": 2,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "A mature, richly developed story serves the beautiful animation well.  Any fan of family themed animated movies will find this to be one of the best in recent years.",
      "total_reactions": 2,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I loved part 2. Instead of a bland copy of the first story, this sequel continued and advanced the plot. It had complex character development and a true \"coming of age\" story for the main characters. It is one of the few cartoon sequels that actually AT LEAST lives up to the original!",
      "total_reactions": 2,
      "user": "Jraptor59"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "While it isn't as groundbreaking as it's predecessor, How To Train Your Dragon 2 retains the emotion, fun and brains of it to spur another Dreamworks hit.",
      "total_reactions": 2,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Very good film,  takes a different approach from the original but continues the story of Hiccup and Toothless.  I just want to say this movie is FULL of FEELS.  Tense and dramatic moments that will make you saddened of obstacles that come between relationships,  you may shed a tear or more,  I know I did.  Around the beginning the movie builds up,  but ends with dramatic and large-scaled events that affect everyone, not just the main characters.  I give this movie a 9/10 .  Flawless animation that are fluid and charming.",
      "total_reactions": 2,
      "user": "Ratoureux"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "For those parents growing more and more weary each day of yet another screening of FROZEN this movie is for you! This movie will be one you won't mind seeing over and over again in the theatre or at home. We are late in the game and just saw the 1st movie and loved it but 2 was thrilling, funny, pulled at your heart, the whole package. Defintely more mature story line but had just enough comic relief. I have a 3 yr old boy and 5 yr old girl and both were hanging off the edge of their seats and eyes were glued on the screen the entire time (which is a feat for them both). As a parent, one of the best kids movies I have seen in a long time. This is one you want too see on the big screen!!!!",
      "total_reactions": 2,
      "user": "whitraines80"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I love the movie",
      "total_reactions": 2,
      "user": "mynamiu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Quite simply one the better movies I have seen in a long time. Saw How to Train Your Dragon 1 and couldn't wait for the 2nd to come out, it delivered and more.",
      "total_reactions": 2,
      "user": "HershelGibbs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "How To Train Your Dragon 2 is a sequel that actually lives up to it's predecessor. It was what I was hoping for and more. The movies starts out with a Dragon competition with all the dragon riders. Astrid, Snotlout, Ruffnut, Tuffnut, and Fishlegs. At first you have no idea where Hiccup is. Once the competition is over we are now soaring through the sky with Toothless and Hiccup. Greeted with one of the best songs in the film. People talk about this movie not having heart, but it's just as big maybe even bigger than the first film. It will make you laugh and maybe even cry.  It had it's joyful moments and some sad moments too, but throughout it always was perfectly balanced. It was darker than than the first movie, but that's okay. I love that it tread on the dark side sometimes. Life has it's darker moments and that made this movie feel so real, even with dragons flying around. Toothless always brought a smile to your face, even during his vicious times. Without a cute dragon like Toothless the film might be too dark for younger kids, but since he is there he helps keep the film balanced perfectly. I say go see it as soon as you can if you even remotely like animated films. Bring your kids if you have any because they certainly won't be bored, and I don't think you will be either.",
      "total_reactions": 2,
      "user": "JDKukis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "How to train your dragon 2 is the best film ever made!! i could well can and have watched it like everyday! no where near boring i love the film, the first one was brilliant also!!! i hope for a third",
      "total_reactions": 2,
      "user": "lizziecherry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Deeper, darker and emotionally power, this does what a sequel should do which is improve upon the first and make way for future installments. The dragons are awesome and the characters are no exceptions, this is a great animation for the whole family.",
      "total_reactions": 2,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Com o sucesso do primeiro filme, que foi muito bom, era de se esperar uma sequência e que mante-se o nível. Incrível como conseguem divergir totalmente do livro, e mesmo assim criar uma excelente história. O segundo filme ficou melhor ainda que o primeiro, mais maduro, com uma trama menos \"infantil\", e com uma batalha épica que fez a batalha dos 5 exércitos do Hobbit passar vergonha!! Manteve um nível de excelência para a franquia, e com certeza veremos um \"How to Train Your Dragon 3\". Que a DreamWorks mantenha o nível dessa franquia!!",
      "total_reactions": 2,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 6,
      "text": "How to Train Your Dragon 2 is a mixed bag for me, on the one hand, its disjointed, annoying and preachy, but on the other its gorgeous, thought provoking and deep. It has many amazing shots and touching pieces of dialog, but it has just as many polar opposite moments. If I had to sum up my thoughts on this movie in one word, it would be disjointed. There are many amazing scenes in this movie, when Hiccups father is reunited with his wife it is truly touching and extremely emotional. But the surprisingly plentiful scenes of the girl twin swooning over arin son arit son of arene son of Arathorn, is strait up stupid, its totally disconnected from the tone of the rest of the movie and was clearly thrown in there because every family movie needs to have comic relief characters. Ugh, actually the friends in general, aside from Astrid, are painfully stupid to watch. They don’t add to the story and they do not need to exist, why are they even such main characters in this movie? You could have had just Hiccup, Astrid, Stoic, and hiccups mom be the main characters, it’s really baffling. And while you’re at it, add Gobber to the list. He is probably the worst offender aside from the twin girl. When he interrupts the scene where Stoic and Hiccups mom are singing to each other just pulls me out of the scene every time. He completely breaks up the scene and it feels completely separate from what we are experiencing. In the first movie he was the kids mentor and he taught them and the audience about dragons, but here… he’s just pointless! Except for creating laughs for the kiddies to giggle at, and that’s not a character. I don’t care about Gobber when him and Stoic are going after Hiccup, I care about STOIC! Gobber is one dimensional and not funny… to me anyways. *sighs* and all of these points can be put towards the twin girl and the rest of the friends as well. Its funny they actually have a resolution for the two guys trying to impress the twin girl, like what the heck? Why should I care about that? Short answer, I don’t. Its jarring compared to what’s actually happening and it just pulls me out of the movie and leaves me wishing they were just eradicated from the whole movie. And if they did that, then it woulda been like 20 minutes shorter!",
      "total_reactions": 2,
      "user": "CrackerJack77"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "It's One of those DreamWorks Animation movies yet again another green range since the first, First and second Shrek, megamind and puss in boots. These Dragons and people are even funnier. Even when some other girl falls in love with a villain. Another Masterpiece by Fox and DreamWorks.! Great Job who ever director! Be sure to look out for an Special Trailer for the new DreamWorks Movie: Penguins of Madagascar! Coming Soon in 3D!",
      "total_reactions": 13,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "The first installment should have won the Oscar for best animated picture.  This one should win for sure.  The 3D is excellent, the animation is excellent.  It's also well written and funny.  The detail is amazing.  An all around entertaining film.",
      "total_reactions": 7,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Easily the Best Animated Feature of the year and Best Summer Film. Dreamworks usually takes the backseat and strides behind Pixar but with How to Train Your Dragon 2 they might have a winning formula to overcome the hurdles. What is really great about HWTYD2 are the script and characters. The script is moving and digs deep about life, death and overcoming all odds. The cinematography, score and graphics are gorgeous and helps evoke the emotions of the film.",
      "total_reactions": 7,
      "user": "francisrgo"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Gorgeously done and exhilarating in parts. A worthy sequel. Not in my mind as magical as the first, and I thought the film was needlessly dark in a couple areas.",
      "total_reactions": 5,
      "user": "jonh"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I really enjoyed the movie. It was fun to see these characters again and I liked the direction the story went. Great visuals as well as good voice acting and score. The How To Train Your Dragon movies are easily Dreamworks' best work.",
      "total_reactions": 5,
      "user": "Rob7309"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "\"How to Train Your Dragon 2\" has just become one of my favorite movies of all time.  This film takes everything that was great from \"How to Train Your Dragon,\" and improves upon it immensely.  Seriously, this movie is amazing!  The visuals are amazing, the sound is amazing, the score is amazing, and the characters are amazing!",
      "total_reactions": 5,
      "user": "Dkay7777777"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "Pretty steep step down from the original which I thoroughly loved.  It's significantly darker than its predecessor and less funny.  The characters, story, dialogue, and writing have all gotten worse.  I took my daughter, who really liked Astrid in the original.  Though a girl, she was driven in a way no other character was and outperformed all the boys with her determination.  In the second book, she's abandoned all that ambition and spends most of the movie doting on Hiccup.  She identifies now seemingly as nothing more than his future wife and has hardly any lines.  That was disappointing.  They did introduce another major female character, but she was nowhere near the inspiration that Astrid had been.  Similarly, the lessons from the first movie, to see past our prejudices, are nowhere to be found.  The story is muddled, and the jokes don't work nearly as well.  I'm sure kids will like the action, but adults will be mostly bored.  I certainly was.",
      "total_reactions": 16,
      "user": "Genghis_Sean"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "How to Train Your Dragon 2 is an excellent sequel. It does what sequel should do. It takes its roots, expands them and doesn't rehash the previous film. Twists and surprises make this movie more of an adult experience than a kiddie one. Beautiful, emotional and dazzling, How to Train Your Dragon 2 is the best animated film in years and puts some animated sequels to shame.",
      "total_reactions": 8,
      "user": "Albert13"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 4,
      "text": "Beautifully animated and astoundingly designed, this is never- the- less let down by a so so story line that is unwieldy, over indulgent and finally quite boring. It's a shame because the first film was such a surprise. Alas, there in lies the key. The first film was quite fresh. This sequel may not necessarily be re-hashing events, but the spark of originality has gone. Aside from the afore mentioned pluses only the score adds any further distinction.",
      "total_reactions": 8,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "This movie is worthy of going up against a Pixar movie. yes i said it. It may even be better than a Pixar movie because while it kept to a more mature form and also still a childish sense of humor laughable at all ages.",
      "total_reactions": 8,
      "user": "TheBoomberKing"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "What an incredible movie! This surpassed all my expectations. The movie was extremely funny and had a great storyline. The storyline was so original you never expected what would happen next. Soundtrack and casting was perfect! Overall a must see !",
      "total_reactions": 6,
      "user": "SoniaLee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Decent animation! I'm not going to spoil anything! You may like it but trust me it's really not that good as everyone say. 5/10 is the only true rating for this movie",
      "total_reactions": 3,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I can't think a good reason to say this is a bad film, it's not. It has some flaws in the narrative and Hiccup kinda lost part of the magic he had on the first film, maybe to make him more mature, but nothing terrible, it gave the chance to other characters to shine.",
      "total_reactions": 3,
      "user": "ThePopCulturist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Dreamworks sure have a habit of making good sequels don't they? (Shrek 2, Panda 2, Madagascar 2) It impresses me that in the midst of the beautiful animation, the scope of this world they create and the epic storyline of this film: they still manage to give so much weight to the scenes when the characters are talking; something about the pacing, dialogue and soundtrack gives the characters not only more depth but more memorability too. To me it was a crucial reason why I loved every minute of this film, DreamWorks have upped their game once again!",
      "total_reactions": 3,
      "user": "JoeKnowReviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "I think that them killing of the father lowered my experience of this movie to horrible. It would have been much better movie if the king would have survived. The director needs to get fired and work at mcdonalds.",
      "total_reactions": 3,
      "user": "Anevay"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "This was a pretty bad movie. First of all, the audience targeted was poorly executed. They tried to make it for kids and adults, but kind of failed. The dark and violent atmosphere vs. the random cartoon guy you all love! The one part that really made me hate it was the stupid idea to kill off Hiccup's dad right after he got reunited with his wife he hadn't seen in years. It reminds me of the insane, unnecessary plot twists and drama in Downton Abbey, which was terrible.",
      "total_reactions": 3,
      "user": "DudeUnknown"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Five years have passed since the events of the first movie and we're already thrown into how much Berk has changed since then and how much more of a community it feels with the presence of dragons. Things such as Dragon Racing at Berk are fun to watch and it's nice to see all the different ways in which dragons have come to use and how everyone has become adapted to being around them. Hiccup's new inventions were very cool; kudos to the filmmakers for coming up with those very nifty ideas.",
      "total_reactions": 3,
      "user": "massey"
    },
    {
      "neg_reactions": 24,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "Bland, poorly executed, and without any of the charm of the original, How to Train Your Dragon 2 completely missed the mark. Is it darker? Sure. But does the moral ambiguity lead to interesting insight for you or your children? No, not really.",
      "total_reactions": 35,
      "user": "franklymydear"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "What a disappointing mess! This sequel has less than half the charm of the original. Apparently if it's loud with a lot of color and motion, some people will feel entertained; but if this is the best Dreamworks can do, I'll short their stock. In fact, now that I look at it, DWA peaked at $35.19 on 12/30/13 and yesterday closed at $21.75, down 38% in under a year. That's in the face of a stock market UP 36.6% over the same period. Clearly their market has grown up but they haven't. Too bad!",
      "total_reactions": 10,
      "user": "Ananisapta"
    },
    {
      "neg_reactions": 13,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Your ten year old will probably love every minute of it but you will just have to enjoy the popcorn. How to Train Your Dragon 2 sticks to the tradition of lackluster animation sequels.  6 points, for old time's sake.",
      "total_reactions": 18,
      "user": "Mercent"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "How to train your Dragon 2 displays excellent storytelling, dazzling animation and provides a dark undertone that made the movie that much better. The movie surpasses it's predecessor in almost everyway.",
      "total_reactions": 4,
      "user": "csw12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "This summer movie maintains most of the splendor of its predecessor while creating more depth and shape to an interesting world full of cute dragons.  It does not drag on (pun intentional) in any place and was paced extremely well.  The heartfelt moments seemed down to a science and the overwhelming cheese is what kept me from giving this 10/10.",
      "total_reactions": 4,
      "user": "Snoracks"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "The sequel  is different in tone from the original, but equally satisfying. The story is a little darker, as it deals with loss in a particularly personal way. But it is visually stunning, amusing, and moving throughout. The story relies very much on the first film, so one might be a little confused without seeing these films in order.",
      "total_reactions": 4,
      "user": "scb47"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Amazing movie! I thought maybe the previews revealed too much but after seeing the movie NOT AT ALL. Not many sequels are better than its predecessor but HTTYD2 definitely exceeded all my expectations! It was hilarious, heartfelt, and kept the audience on the edge of their seats. The storyline was original and the soundtrack was beautiful. I recommend the movie to anyone of any age. You won't regret it!",
      "total_reactions": 4,
      "user": "SabrinaLee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "After seeing some other sequels, I was ready to be disappointed for this movie. But after the credits, I couldn't leave my seat. This was the most amazing, powerful, and emotional movie I have seen in at least the past 5 years. It definitely surpasses the original, and it is a must-see for all ages.",
      "total_reactions": 4,
      "user": "TheGriffinSlaye"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "I loved the first movie, so I was excited to see what they could do with a sequel (especially when Dreamworks has been so well w/ sequels, with the 2nd Kung Fu Panda movie and the 3rd Madagascar being the best in their respective series). So I went to see this movie with a few friends, and none of us liked it. And personally, I normally like movies that everyone else hates, not the other way around- well, with the exception of maybe Frozen, but  many people, I see now, agree with me that it wasn't that good.",
      "total_reactions": 13,
      "user": "Joesatmoes"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "It's really not a cartoon for children. A lot of smiles a lot of tears. Just go and enjoy it. One of the most upscale, amazing, exiting film I've seen this, last, many years.",
      "total_reactions": 5,
      "user": "ShamrockVA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "This movie basically raises the bar not only animated movie, but for movies and art in general. Not only is this movie a home-run, but it smashes the ball far over the gate/ the stands and crashes into the parking lot.",
      "total_reactions": 1,
      "user": "AaronAction"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Hated the first movie but decided to give the second one a chance and it's such a massive improvement. The story is well done and it's interesting from start to finish. Manages to keep both kids and adults entertained as well. Only complaint is that it drags on a bit too long.",
      "total_reactions": 2,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Best animated film ive seen since Toy Story 3, absolutely fantastic in about every why, recommend everybody to sit down and watch HTTYD 2, only downside is the fact that i felt as if the movie was 2 short, also not enough death and blood, i know its a kids movie but hell, it gets pretty dark.",
      "total_reactions": 1,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the best achievements in animation in a long time better than The Lego Movie, Frozen, and Wreck it Ralph.  Every second of this film blew me away from its sweet more humorous moments, to some of the more darker elements you will ever see in a children's film.  Plus how can your heart not melt every time you see Toothless on screen.  A",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "This film is quite clearly a shoe-in for the best animated film of the year, if not this decade. It captures just as much charm, action, drama, and outright brilliant moments from the original, and then some. It captures the essence of what a fantasy film really is, and that's a film that makes you think; \"Yeah, I want to be that guy!\" or \"I wish I had that.\" It holds up not only as a film that will enthral children, but also one that will leave those of all ages, even critics who've had their emotions locked away in a cage made of The Godfathers and Citizen Kanes gasping for breath while watching a film with damn good action, far far better action than the original. It tells the story of how someone as nerdy and unpopular as Hiccup from the original can become something so, so much more. It made me realise that our world is not just a large green rock that we have to suffer on. Its a plethora of opportunity from which any situation could spring. And so, How to Train Your Dragon 2 is a masterpiece. See it if you haven't already.",
      "total_reactions": 1,
      "user": "Memburg"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Adequate sequel that matches up to the original. The only thing I can disapprove of is Cate Blanchett's voice. She's a combination of Irish and American, and she's an Aussie. Other than that, solid film.",
      "total_reactions": 4,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "The most entertaining movie I've seen in theaters so far this year.  It felt like a solid entry in the HTTYD storyline.  New lessons are learned, characters deal with loss, and heroes rise to the occasion.  The flying scenes are really well done and were worth seeing in 3D.  I usually avoid 3D if I can but it was justified in this movie.  I can' t wait to see how Dream Works concludes this exceptional story.",
      "total_reactions": 1,
      "user": "raypeterson2424"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Ignore all the negative chatter.  I loved the first one and this one topped it.  It is very rare that a fantastic movie can get better with the sequel.  How to Train Your Dragon 2 built upon the foundation the first one made and was executed flawlessly.  Best movie I have seen in theaters in  very long time.  Easily the winner of the best animated film of the year.",
      "total_reactions": 1,
      "user": "boysfan4life88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "The director and writer of this movie has respect and love for this series. The characters have not just grown up physically, but mentally, translating well with the audience. You see the characters develop in a non-intrusive way, a path very difficult to do in a 1hr. 45 min. timeframe. Speaking of timeframe, the pacing is well distributed and every scene has the right amount of time without feeling drawn out or rushed. The themes in this movie translates to both adults and kids. There are strong emotions for the adults to care about and fun action scenes for the kids. Finally, the artwork and designs of the movie are beautiful and can inspire others. The amount of character development, great pacing, strong emotions, and inspiring artwork are why I give this movie 10/10.",
      "total_reactions": 1,
      "user": "CybercoreCEO"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Esta película no es demasiado alejada de la anterior. Hay muchos cliches y aunque quiere tener una trama mas seria, los personajes no se toman con seriedad si por ejemplo: esta apunto de llegar una guerra entre cientos de dragones. Ademas el protagonista Hipo aquí tiene 20 años pero parece muy tonto, cuando tiene un dragón enfrente que esta por matarlo el se queda quieto sin hacer nada en ves de huir, defenderse o intentar calmar al dragón. otro problema es que cosas como un reencuentro o la muerte de alguien es algo de 5 minutos para superarlo. Las emociones no son tan reales como en la anterior película. La animación es muy buena igual que como la anterior pero eso es lo único que mejoro ligeramente de la anterior. Ademas hay cosas que no entiendo como el control mental del jefe dragón, todos los reyes dragón tienen eso? Si es así, pues, como el de la primera película no uso lo mismo para evitar que los dragones escaparan para que el si comiera? Ademas al final sale un Deus Ex Machina. No me gusto tanto como la anterior. Le doy un 06/10 no supera a la anterior, es casi decente.",
      "total_reactions": 1,
      "user": "Larry223"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2014
      },
      "score": 7,
      "text": "This movie is great continuation of original story, if only main character wasn't so annoying.. Hiccup voice is extremely annoying, cheesy comebacks and lame dialogues do not help one bit..",
      "total_reactions": 1,
      "user": "SpiRo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "This movie builds off the original in interesting ways, if you haven't seen the first one though it'll be hard to get into. The charm of this movie lays entirely with toothless. For not having any dialogue he's the most expressive and enjoyable character. He's adorable and cleverly funny in unique ways that stick with you. It's unfortunate you can't say the same for the rest of the characters.",
      "total_reactions": 1,
      "user": "DirtyDave"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I love this movie. Great visual, great soundtrack, nothing to complain about except that the pacing is way too fast. Would love to see how Dreamworks do with the 3rd!",
      "total_reactions": 1,
      "user": "Tramtuyet"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "This is a very good film, I 'm a real fan and really love this movie...fun happy excited and make me cry.",
      "total_reactions": 1,
      "user": "zatudioro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Warning: Like the 1st movie this movie doesn't actually show you how to train your dragon",
      "total_reactions": 1,
      "user": "WaterTiger5"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "How To Train Your Dragon 2, although sad, exceeded my expectations at becoming an amazing sequel.  It not only showed a great change in terms of story, but a great change in the characters.  The characters acted more mature, but still kept the same attitude that was very well left behind from the first How To Train Your Dragon.  My recommendation is to take the whole family to see this, and if not the family, then those who are still in touch with their child at heart.",
      "total_reactions": 2,
      "user": "ShadowMeister13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "How to Train your Dragon 2 was not a bad movie but it certainly wasn't the best. I believe it didn't improve on its predecessor but instead fell short of it. The dynamic of the group in the first one was much stronger and even then focused on many more characters. In the second movie it is more focused just on Hiccup and his family making other characters seem boring or unnecessary. Many people believe this was a deep and dramatic turn animation film that is a masterpiece to withhold but just because it tackles many mature aspects doesn't mean it succeeds with them. How to train your Dragon 2 is still a good movie but really isn't the stuff of animation legend.",
      "total_reactions": 1,
      "user": "Lelchelsea"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2016
      },
      "score": 2,
      "text": "They show hiccups mother never wanting to see her child again because of what again? And she would have never seen hiccup if he hand't accidentally stumbled next to her in the clouds?",
      "total_reactions": 2,
      "user": "Aesteril"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "How to Train Your Dragon 2 is a good sequel having good writing, gorgeous animation, and is all around engaging proving that Dreamworks can make a good film when they try. The story has some excellent themes and ideas, matures with its audience, and has a strong beating heart that isn’t present in a lot of children’s films. The film feels a bit rushed at times not taking its time with certain aspects like the first film did and the set up is far more engaging than the resolution but its still a good film. For those worried this will be a lame cashgrab, it isn’t they really tried to make this one special and while the lack of development in certain areas prevents this film from being excellent there are many moments in this film where it is great.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Well, we can't deny it to ourselves anymore. The gaping tundra of Winter is beyond us, and for that I say we are officially in the midst of the summer movie going season. Sequels, sequels, and more sequels are filling the gaps every weekend, 16 to be exact.",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "The sequel to one of DreamWorks' best animated movies provides yet another top-notch family experience. There's enough humor, action, and emotion to ensure everyone is entertained. It does loose some of the original's magic, but it expands upon the universe in interesting ways.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Simply put, HTTYD 2 was a very surprising movie that blew my expectations away: the first movie was already very well done, so I had high hopes for it to be good. And not only it did not disappoint...but I can almost say that this was the best sequel I've ever seen, since probably Kung Fu Panda 2.",
      "total_reactions": 0,
      "user": "vahn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Gorgeously animated, moving, and an improvement on the original in every way, How to Train Your Dragon 2 is an animated masterpiece not to be missed, with entertainment for children and adults alike.",
      "total_reactions": 0,
      "user": "Jman4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Good sequel. Unlike the rest of the world, I think the first was much better. The movie was good, but there's one part where the movie kinda lost me, Stoick's death. One of my favorite characters got killed off. And after reuniting with his long lost wife, it defanitely made me shed a tear. There's a lot of new dragons, all cool and unique in their own ways, but there's so many new ones I couldn't keep track of them all. Overall, the CGI is fantastic, the characters are fantastic, and the plot is pretty good for a kids movie. I'll give it a 7.5, but there's no halfway option, so it's awesomeness gets it an 8.",
      "total_reactions": 0,
      "user": "iloveFFC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "A smooth continuation to the first 'How to Train Your Dragon' movie.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This movie was absolutely perfect. Easily the bestanimated movie of the year, no doubt about it. This movie was better than the original, the characters were better, the story was original and unpredictable, and the villain was awesome.",
      "total_reactions": 0,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Does a surprisingly good job at going above even the high bar that the first movie set. Some time has passed and the characters are older now, more experienced, and both changed and yet the same. If you loved the first movie, you'll also love this one. Highly recommended.",
      "total_reactions": 0,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "It is clear from the start that they are trying really, really hard to be better than the first movie. Even doing a good job of not rehashing and introducing enough new content to keep you interested.",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Like I said a couple of year ago during 'Cloudy with a Chance of Meatballs 2' review, it's a terrible title for a sequel. The host, Neil Patrick also said the same thing during the 2015 Oscars. But in the digital world, slight change in the title makes random in order. I mean on the computer and web world, it won't show in order. Even sometime it might get lost in a vast number of other titles if they dare to chance the first word in the title for a sequel. Other than that they are not stupid as many people think. That's why they highlighted 'Dragon' boldly than the rest of the words.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "They succeeded in achieving a fantastic sequel which almost matches the original. Equally brilliant score and lovely characters. The story is good and the visuals and flights gorgeous. I´m giving it a slightly lower score because here we have a few cliches which were totally missing in the first installment, and obviously, it doesn´t have the surprise factor of being the first film in a franchise. But still, wonderful and enjoyable animated film which was the best of 2014.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "There is no doubt in saying that this is a very well made and directed animated feature with a good set of characters and creatures. That being said, this movie's plot seems a little rushed and it all seemed to move too quickly for my taste. That being said, still a very well made film.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "First things first: I never intended to watch this, it turned out to be the movie of choice on a family outing today & I had 0 interest in watching it since I never saw the original nor the series. With that in mind, I'll say I enjoyed every moment and was money well spent.",
      "total_reactions": 0,
      "user": "winterhombre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Smart, funny, visually splendid, and offering a surprising amount of emotional depth, How to Train Your Dragon 2 is a thoroughly entertaining ride for all ages.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "How To Train Your Dragon 2 es una película que logra superar a su predecesora con unos muy buenos efectos animados y un desarrollo revelador.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "How to train your Dragon 2 is richer, more complex and more mature than it's predecessor. It has a more emotional touch to it and visually it's just as thrilling if not more. Exploring the up's and down's in the relationship between a boy and a dragon, this is a film that holds nothing back and isn't afraid to explore the unexplored. It's a film that adults are likely to enjoy just as much as children. Although it felt a touch too long, it's undoubtedly one of this years great achievements. Is it overall better than it's predecessor? Probably, time will verify.",
      "total_reactions": 0,
      "user": "AkashVijay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "This movie taught me of being a peace keeper. It feels like when I was young and I watched The Lord of The Rings: Fellowship of The Ring. Which means, it's perfect. I couldn't more grateful with this movie. I ADORE DREAMWORKS so much!!! :') So many children should be more inspired with the movie. I love the whole animation, so high-definition! And the all background with sun lights, those were amazing. I almost felt it's like AVATAR. But, as I said before, the whole movie was perfect as LOTR. It's just I thought John Powell could gave us more. The plot and the action already gave me more but suddenly it feels almost empty with the soundtrack. And, the *spoiler* proposal-song...that's so bad song. #LOL Frozen did better. Well, still, it's amazing. I enchanted with everything. The jokes and the heart-breaking scenes, truly moved me.",
      "total_reactions": 0,
      "user": "RoraEst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "‘How to Train Your Dragon 2’ is the sequel to ‘How to Train Your Dragon’ which follows the Vikings of Berk, specifically Hiccup and the Nightfury. Within this sequel dangers comes in form of a human rather than a dragon.",
      "total_reactions": 0,
      "user": "casualad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I was very excited about HTTYD 2 and I couldn't wait about the movie. Before I saw the movie I as a fan of the franchise did watch the TV series episodes. I loved the movie. The 3D was awesome.  The characters are made very cool - Hiccup's mother was very interesting person. There was a lot of humor - specially with the twins. The movie had and one very sad moment - Stoick. Anyway I loved that movie, it was better then the first and I can't wait for How to Train Your Dragon 3 and season 3 of the TV series.",
      "total_reactions": 0,
      "user": "Gason"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "It’s been a while since I watched the first movie so I don’t remember much other than that there was a war between dragons and humans. I am glad this movie somehow summarized the first movie in some scenes in the movie without the flashback yada yada yada.",
      "total_reactions": 0,
      "user": "OpinionatedGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "I have to say, this movie was great. A few times I felt like crying, and I felt the emotion of the characters. This film was brilliant and I'd recommend it to everyone. But I went into this film knowing a big spoiler cause some idiots at school told me. But anyway, it is a great film. Go and see it!",
      "total_reactions": 0,
      "user": "Rixhack"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "My family and I loved this movie.  We were amazed to find that he found his mother and that she was so much like him.  We all cried when the father passed away.  There were surprises around each corner and the age of the main character was also on course.  All of the emotions it hit with us and we would recommend it to anyone of any age.  Great movie.",
      "total_reactions": 0,
      "user": "mfuegen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "This movie may not have charm you the same way the first one did, but it will make you fall in love with it from its own unique identity, this is not a mere boring sequel. It is entertaining and surprising and for those who think the previews spoiled the story, trust me they haven't spoiled a thing.",
      "total_reactions": 0,
      "user": "IonEddie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "A rich, exciting and beautifully animated film, which builds upon the successes of the original. If you thought the first was good then go to the cinema and watch this.",
      "total_reactions": 0,
      "user": "gazzaG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "This movie is extremely creative and imaginative, It is also one of the nicest looking Animated movies I've seen in the past years. The beauty in all the different dragons and the scenery is amazing. The story is a bit better this time around there is more tension/drama then the first and more then you'd expect from the series.They bring back all the big voice actors from the first for this one and add a few new ones for comedic effect. All together I really enjoyed this film, I thought it captures the creativity and beauty the creators where trying to create extremely well.",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "For a legendary creature lover like me, it's pretty easy to love How To Train Your Dragon 2 (2014) because there are all sorts of cuddly, playful dragons in this film. There are also plenty of distinctive characters, mostly adorable and hilarious in their own ways so the film is generally fun to watch!",
      "total_reactions": 0,
      "user": "hayashimegumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Love the movie more than I thought I would and I like the first one, more dragons, more story. Heaps of actions and domestic comedy. All I can say is Worth Watching.",
      "total_reactions": 0,
      "user": "GekkoSoldier1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Yes, everything I hoped for and more.. I absolutely loved the animation and splendour of the 'new world'. And the film takes no prisoners, and hated but loved it!",
      "total_reactions": 0,
      "user": "Owlie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "An unexpected second installment of How to Train Your Dragon came out with flying colors. I mean that both figuratively and literally. We often are caught up in epic fantasy so long as it resembles The Lord of the Rings or Game of Thrones, but hope is kindle when a movie like this comes out. It is difficult to have a sequel that was an improvement in pretty much every way from the first but they figured out how to do it. Each character was given attention and care to their development and delivery to the plot and dialogue. The world of dragons and their personalities was widely expanded as well as their relationship with humans. With such powerful creatures susceptible to human rule, it was only a matter of time before a big bad guy came along to pit dragons on each other along with the rest of the known world. Hiccup and his friends have to prove themselves against impossible odds and the fury of open war. But they find help in unexpected places. This movie kept it thrilling and adventurous but it did not slack on the emotion. You laugh, gasp, and even cry when you see this while not missing out on the fun of it all. It is hard enough to make a movie this well put together. I felt like there was a pretty quick pace, not really leaving any time for collection, but given that this movie is intended for younger viewers, it was the better move to maintain constant attention throughout with big moving scenes, one after the other. Well done. Animated movies often stay on their own plain but, I think this time they broke through and gave some of the good movies this year a run for their money, period. Worth a watch.",
      "total_reactions": 0,
      "user": "BigZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "How to Train Your Dragon 2 is a rare sequel that is the same as exciting, thrilling, funny, and deeply explored or more darker in plot concept than its predecessor. What makes HTTYD2 more aimed for the YA framework is that it possesses mature tone and dramatic depth about family relationships and dragons that we don't see in the first film. Hiccup in the second film is more conscious than ever as he finds his mother; in here we see that the film is actually growing from a childish film to a mature yet darkly dramatized film. The stunning visuals have also a big contribution in making this movie a big hit for DreamWorks' second movie for the year. HTTYD2 is an eye-catching movie experience for the young and old. Recommended!",
      "total_reactions": 0,
      "user": "DaMovieLover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "\"How To Train Your Dragon 2\" Is a very emotional movie, and captures the importance of trust and friendship very well. The plot was organized and easy to follow, and the story line was creatively created. It was a great continuation from the first film, and Toothless and Hiccup's friendship grew. It was a wonderful movie, and I am excited for the third one!",
      "total_reactions": 0,
      "user": "mslindachen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "5/5★ Rare is the sequel that is almost as good as its prequel but DreamWorks does it, expanding on the world and characters without falling prey to the dreaded terrible two. The movie, like its hero, has more mature themes, and successfully entertains a mass audience without pandering to them.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Really enjoyable, the character designs of the Dragons are spectacular, and much like the first film the flying sequences are great and work great in 3-D. The story has a nice touch to it and works fine. Overall good.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "It's rare that a sequel be more good that the original one, but How to Train Your Dragon 2 made it. Full of heart, funny, dramatic, beatifully animated and with a great story, this sequel makes the original just the begining.",
      "total_reactions": 0,
      "user": "papeadojhon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "\"At the first sight you may find the film boring, but if you continue watching, you'll see it worth it.",
      "total_reactions": 0,
      "user": "Ali_Marashian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The sequel is much better than it's predecessor.The Movie improves from it's plot to it's characters but sadly it still has some problems but it still an incredible film to watch cute,fun and entertaining that is good for young ages.",
      "total_reactions": 0,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "I don't know how they did it, but DreamWorks managed to top the original. How to Train Your Dragon 2 takes every aspect of the original and makes it better, from the character development to the action to the visuals to the humor to the drama to the subject matter. This is easily the best animated movie of 2014.",
      "total_reactions": 0,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Dreamworks How To Train Your Dragon 2 is a very nice animated movie. It has beautiful CGI, in all the technological aspects it looks really good, but besides that, this movie has as a surprise that is not only for kids, but for adults too because the film touches things mature enough for them. That's something really nice because it's not just a kid's movie, it's actually a movie that the whole family can enjoy.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "A sequel that surpasses the first? Animated? Almost unheard of. Well, HTTYD2 is a fun, fast-paced movie for the kids and although there maybe some plotholes and really cheesy elements, this is ALMOST as good as it gets for kids movies.",
      "total_reactions": 0,
      "user": "acaiberry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "how to train your dragon 2 is better then the first film this is my favorite DreamWorks film. I really went to see a how to train your dragon sequel..",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Quiet possibly one of the best animated movies of all time.How To Train Your Dragon 2 reminded us what is like to watch an animated movie that speaks to kids and adults alike.Everybody will love and get amazed by this movie.It's constantly fast paced full of action and the characters are as great as they ever was.The voice acting is also perfect and the Director really knows where to take inspiration,which in this case just happens to be The Empire Strikes Back.And this movie totally reminded us of the greatness of that movie.",
      "total_reactions": 0,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Szédületesen pörgős akció, aranyos szereplők, akik a nem különösebben épületes sztori során keresik helyüket az életben. Nyomokban az animációs filmektől szokatlan erős ábrázolást tartalmaz. Alapos mestermunka, de ettől még egyszernézős.",
      "total_reactions": 0,
      "user": "csiko13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "How to Train Your Dragon 2 is another sequel works and knows how to follow the story of the Vikings and dragons. Animation have not only evolved, but also the characters evolved. His designs are even better than the first film and animation is even better than the other films Dreamworks and again, the script is fantastic. The dialogues, jokes, drama, everything is great in the script for this sequel. But if, as the former has a problem. And in this case is not the villain (which has an excellent design and is terrible), is the death of the father of Hiccup. I found unnecessary wear and tear because I felt as if the writer and director the sack a part of The Lion King. But as I said before, this sequel has evolved. And it has excellent animation shots when it comes to dragons flying in the sky, or fight scenes or landscapes. In my opinion it is better than the first. And it would be strange that some see this child that felt more like a sequel to teenagers than children. Osea does not have too many adults jokes or insults, it's just that with the evolution of this film felt more for teens. And yes, I think that Oscar deserved. After all, How to Train Your Dragon 2 is another excellent sequel to Dreamworks and I'm looking forward to see his third film.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2017
      },
      "score": 8,
      "text": "Not quite as good as the the original but sequels are always tricky, Animation is top drawer, great humor and action, never a dull moment. Number 2 Dragon is more poignant and sad than necessary maybe but I think it's up to the viewers to decide their feelings on that one. It's hard to keep the small ones, the teenagers and the adults happy all at the same time but I think Dreamworks make a good shake at it..",
      "total_reactions": 0,
      "user": "Tony1984"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "This is probably my favorite DreamWorks movie and sequel. I couldn't just put this movie down and I am like a big fan of the franchise. The movie had good animation and amazing dragons, even Toothless. I like Toothless a lot.",
      "total_reactions": 0,
      "user": "Bmeyer8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "How to Train Your Dragon 2 is another sequel works and knows how to follow the story of the Vikings and dragons. Animation have not only evolved, but also the characters evolved. His designs are even better than the first film and animation is even better than the other films Dreamworks and again, the script is fantastic. The dialogues, jokes, drama, everything is great in the script for this sequel. But if, as the former has a problem. And in this case is not the villain (which has an excellent design and is terrible), is the death of the father of Hiccup. I found unnecessary wear and tear because I felt as if the writer and director the sack a part of The Lion King. But as I said before, this sequel has evolved. And it has excellent animation shots when it comes to dragons flying in the sky, or fight scenes or landscapes. In my opinion it is better than the first. And it would be strange that some see this child that felt more like a sequel to teenagers than children. Osea does not have too many adults jokes or insults, it's just that with the evolution of this film felt more for teens. And yes, I think that Oscar deserved. After all, How to Train Your Dragon 2 is another excellent sequel to Dreamworks and I'm looking forward to see his third film.",
      "total_reactions": 0,
      "user": "MordoReviewer"
    }
  ]
}