{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "I Can Do Bad All by Myself",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 17,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "The critics have done it AGAIN! They have underated another GREAT Perry film! This movie's too good to get such a low score. People who rated this movie low are just JEALOUS just like spike lee is because Tyler Perry makes GREAT films. REMEMBER.....jealousy is a sin!!!!.....",
      "total_reactions": 2,
      "user": "TheateraNerd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "Perry's rom -com has the same black humor in every one of his comedy series, i just  love the guy cause his humor was funny and he adds heart in his creativity now i just do not buy it. The humor got old and Perry's jokes aren't funny there basically the same and i am sick of it. the movie \"I can do bad all by myself\" (aka Mary J Blige's song.)  The way that Tyler Perry wrote Taraji P Henson's  character was literally the best part in this movie, Henson plays the ****  alcoholic  aunt April who has no choice to care of her sister's kids ( the grandmother was supposed to take care of them), Perry has  a mild good choice of good actors some shine some are just there just to be funny; but taraji shines! and nail's it, Perry writes and directs this movie well done. Blige acted superb and stunning as April's  friend Tanya, the charming Gladys Knight did fine and really outstanding. Grade C+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    }
  ]
}