{
  "mc_avg_user_score": 4.5,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "I Hope They Serve Beer in Hell",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 15,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "I kind of liked the book, never was very fond of it but it has it's moments. This film however is completely awful. Absolute crap. If all you want is to spend a shocking 105 minutes watching some pretend sophisticated nobody having sex with women so drunk they can barely see then this movie is for you! If you want plot, competance or any trace of originality run to the hills! It's laughably inept. And I don't hate it because it's offensive or anything because it's not, it's just crap",
      "total_reactions": 0,
      "user": "NF123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "The only thing stopping me from giving this a 0 is Jesse Bradford's Drew. His one liners and total douche attitude gave me an occasional laugh and the only reason I watched to the end. What shocks me the most is that it had an R rating, they could have gone completely crazy and made it foul and raunchy and kinda like American Pie, instead the dirtiest joke is a poop joke that drags on way too long.",
      "total_reactions": 0,
      "user": "Schmit93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "I have not read the book and just now saw the movie. There was some funny dialog but the movie really serves an important educational purpose.Except when he unrealistically  \"sees the light\" at the end  It almost perfectly displays someone with Narcissistic Personality Disorder. In real life the guy would just continue on and never believe he has a problem. Czuchry's charachter is charming, entitled, selfish, manipulative, deceptive, does not accept responsibility, is unnaccountable, blames others and is shameless. Toss in a bit of a sociopathic personality and that is him. I lived with a classic narcissist for 4 years and can tell you this film felt like a bad reunion. In a movie in can be entertaining as \"bad\" charachters are interesting and even quite funny. In real life it is hell even with beer. I highly recommend this movie if you are trying to get someone to understand what this personality disorder can look like in day to day life.",
      "total_reactions": 0,
      "user": "MNair"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2015
      },
      "score": 0,
      "text": "This film tries so hard to be funny that it completely forgets things that are needed to make a good film such as a plot, good writing, directing oh and especially important for a comedy film good jokes and set ups.",
      "total_reactions": 0,
      "user": "AnarchyAus"
    }
  ]
}