{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 70,
  "mc_mixed_rating_frequency": 28,
  "mc_movie_name": "I Love You, Man",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 182,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Jason Segel and Paul Rudd give very charming and funny performances. To help with that it is very cleverly written and just hilarious and the interesting premise pays off. I give this movie 79%.",
      "total_reactions": 3,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "I love this movie. The cast is great, the plot simple and the jokes are smart. Paul Rudd and Jason Segal have brilliant chemistry as do Rudd and Rashidia Jones. The Happy Hippy Soundtrack from Artists such as Vampire Weekend and Spoon. If your a fan of Judd Apatow Comedies then this movie is for you.",
      "total_reactions": 2,
      "user": "Tranquilbez22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "What I loved most about this movie, besides the laugh out loud comedy and brilliant acting by Jason Segel, was how true to real life it was. The writing and acting make this feel more like a true-life culture study than a blockbuster comedy. A well-done observation on the condition of the modern man, in my opinion.",
      "total_reactions": 1,
      "user": "BrettOwen9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "This movie sucks balls.",
      "total_reactions": 1,
      "user": "jsowers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Jason Segal and Paul Rudd make this movie period. Without them this would be your average run of the mill Hollywood stinker, instead they make it a memorable laugh fest.",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 7,
      "text": "In Jon Hamburg's \"I Love You, Man\", he successfully creates a hilarious and delightfully relatable bromantic comedy. \"I Love You, Man\" tells the story of Peter Klaven (Rudd), a man who has just proposed to his girlfriend and finds himself in a bit of a predicament. He feels that, throughout his life, he has never had an individual that he could call his best friend, so he takes it upon himself to find one. After many failed attempts at finding a guy to call his pal, he gives up and ends up meeting Sydney Fife (Segel). Hilarity ensues. Now, I'm gonna' start off by saying that when Paul Rudd and Jason Segel first start to hang out with one another, it is one of the most awkward friendships I've ever seen. It's still funny, but hard to watch at times. After this awkward phase though, the chemistry between Rudd and Segel really starts to shine, and then the laughs begin to roll in. At this point, the writing really starts to pick up as well. Also, the band \"Rush\" was used as a plot device for the film - I found this to be extremely unique and it was awesome to see Rudd and Segel's characters bond over their music. With a solid script, unforgettable chemistry between it's leads, and a memorable premise, \"I Love You, Man\" makes for an amazing comedy that I won't soon forget.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "This movie was very funny and light-hearted. Paul Rudd and Jason Segel work very well together and create an excellent bromance. The way they meet is very funny, and Paul Rudd's girlfriend pushing him to go out makes for a very funny scene. All of the scenes where the characters are just hanging out and having fun are very light-hearted and make you feel good. I also very much appreciated how the movie truly focused on the bromance, and not too much on Rudd's relationship. The movie seemed very real, and there were no boring parts. Excellent, I recommend viewing.",
      "total_reactions": 1,
      "user": "nickcorrigan25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "Rudd is endearing as a ladies man in search of a male friend. The laughs come more spaced out as the premise unfolds but it's nevertheless a fresh summer rom-com.",
      "total_reactions": 1,
      "user": "Benkoko11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "I Love You, Man has done the impossible- it has surpassed the last great comedy of this Apatow-controlled era, Forgetting Sarah Marshall (if by only a narrow margin), and has cemented itself in history as one of the funniest movies I have ever had the pleasure of seeing. What makes this film stand out so much amidst an array of other excellent funny movies? For one, there is a character relationship dynamic in this film that is unrivaled in any other comedy- a relationship that is, weirdly, best compared to the rapport between the leads in any rom com. You see, while this film is not technically a romantic comedy per se, it is most definitely the very definition of a bromance film. Not since Fight Club has there been a stranger friendship between two men than there is between Sydney Fefe (Jason Segel) and Peter Klaven (Paul Rudd). As the movie starts to build up speed and Sydney is brought into the mix, this film takes off and runs with the admittedly thin premise. Literally, the latter three-quarters of the film revolve around the trials and tribulations of being in a bromantic relationshipâ",
      "total_reactions": 0,
      "user": "MovieFail"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2010
      },
      "score": 7,
      "text": "Man gets engaged, doesn't have any friends, sets out to find \"Best Man\".",
      "total_reactions": 0,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "I thought it was ok but the long run time ruined it. While it featured more then a few hilarious moments, The run time made the film more then dull in quite a few parts and streched it out longer then it had to be. The cast was solid too. If you can sit through the film, I am sure you probably enjoyed it.",
      "total_reactions": 0,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "I was blown away with how fantastic this movie is, I remember seeing the trailers and thinking it looked awful, but I'm a huge Paul Rudd fan and when I heard he was in this I figured I would give it a shot, and I;m glad I did, it's hilarious, Paul Rudd, Jason Segel and everyone else in this movie gave phenomenal performances, go out and watch this as fast as you can.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "The films only real trick is disguising it'self as a laugh out loud Judd apatow film when all it is is a sporadically funny, uninmaginatively raunchy comedy that hits so many\" awkard moment\" targets you can't even count them. There are some chuckles, but that's pretty much all this bromantic comedy has to offer.",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "As close to perfect as I think a comedy can be, I Love You Man is very enjoyable watching. Many of the scenes are fantastically funny and this comedy does not require gross-out comedy to get its laughs (which is refreshing). Nevertheless, it had me and all of my friends in stitches when we saw it at the cinema. Both understated and brilliant, everyone should find something to enjoy in this movie.",
      "total_reactions": 0,
      "user": "Cotts1988"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "great movie I love how they bring back Rush I love they have socially awkward guy when he is around men I just thought it was great movie every one should watch it",
      "total_reactions": 0,
      "user": "bigfre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "here really isn't anything special about this movie but it works. The acting is very solid and it has some very funny moments that are just fantastic. There are some issues however, the movie has the opportunity to take on some major issues that occur early on in relationships but the movie just kind of backs away from it. The movie also doesn't really have a solid plot but it makes itself work with out it. Overall this movie is worth a watch and a lot of fun.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "Funniest movie I've ever seen. Paul Rudd gets an Oscar snub for me. He's incredibly awkward in a funny way. Same goes to Jason Segel and the relentlessly funny supporting cast",
      "total_reactions": 0,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Even though the chemistry between the two male leads (played by actors Paul Rudd & Jason Segal) was one of the better aspects of the film, I couldn't help but feel 'I Love You, Man' could have been much better explored - particularly the back story of Segal's character. This feature is good, not great, excellent or astonishing funny but it is fine for what it is. The supporting cast were decent but this picture is essentially a two-man show even though the \"bromance\" seemed to have been somewhat rushed along with the overall running time of the movie.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "With an hilarious cast, I Love You, Man hits all the right buttons for all the right reasons.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Funny and awkward it made me laugh and cringe so many times over, I think I'm an aqua pump. The actors are good, the dialogue is spritzy and funny.",
      "total_reactions": 0,
      "user": "c700"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I enjoy Jason Segal's work all the time and this film is no exception. He works very well with Paul Rudd to produce a great comedy about friendship more than romance. Rashida Jones is ok but I really felt as if she was overshadowed by pretty much every other character. Andy Samberg is hilarious even though normally I find him to be stupid. Unfortunately for this film, it will forever be overshadowed by The Hangover.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "I Love You, Man might be the best comedy of the decade. It's gross, it's sweet, and at times it's sneakily subtle. I delivers the goods. Plus a whole lot more.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "This movie seems to be along the line of the superficial factory produced quantity-over-quality trend of movies I've come across lately. Have you ever watched a movie thinking \"Ok, this is just the intro - we'll get to the good part soon\" and then you look at Time Played and it's been over an hour? This is that type of movie. 'Spoiler' part: There are some moments where you would expect the friend to bail, resetting the protagonist's plight to finding a friend for the wedding to prevent it being awkward (this premise alone is incredibly soppy and infantile, but we'll roll with it) but no, the trainwreck continues. Will he murder the protagonist? Nope! Will he bail after borrowing the money? Nope! Instead, he spent it on billboards. \"Well, that's somewhat realistic, now we're getting somewhere!\" the audience is thinking, \"because now he probably won't pay the guy back, gets mad because he doesn't feel appreciated\" but no, ofcourse not... The billboards do eventually pan out, the guy gets the girl, the other guy gets the guy/guy gets the other guy as a friend and we all live merrily ever after. Now don't get me wrong: I don't mind rom-com flicks when done right, but I would strongly suggest to avoid this unless you want to watch a BAD movie. It reminds me of 30 Minutes Or Less, or some other forgettable title where the protagonists are 1 dimensional, invincible and most of all frustratingly ignorant people who just waddle through the movie from start till finish. Again: this can also be done right, as these titles prove: Blue Mountain State, American Pie, Road Trip etc.",
      "total_reactions": 0,
      "user": "Stingerbee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "I will never get tired of I Love You Man. Jason Segel and Paul Rudd work so great together and their relationship remind me of myself and one of my friends. Laugh out loud funny. I would like to see Segel and Rudd working with each other again, although they did in This is 40 they didn't really quite have as much interaction as I would have liked. I love them going crazy over Rush and all their shenanigans, it comes to show how one person can completely change your personality as soon as you get to know them.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "Encontré en \"I love you, man\" una comedia romantica atípica, en donde la relación que se desarrolla no es en torno a un hombre y una mujer sino en una amistad.",
      "total_reactions": 0,
      "user": "MEFzelder"
    }
  ]
}