{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 26,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "I Melt with You",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 88,
      "summary": "I still can't believe I Melt With You went there. Over the top, off the hook and just plain bonkers, it makes its mark."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 75,
      "summary": "You know how I realized I actually liked I Melt With You? I kept talking about it, and at one point, in the middle of mocking it, I accidentally referred to it as \"a good picture.\" That's when I realized, yes, it really is good, albeit in ways that are different from other movies."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 70,
      "summary": "A compelling and disturbing drama about some elemental male issues."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 35,
      "summary": "In another light the group's - and the film's - portentous resolution looks a lot like quitting, in true slacker style."
    },
    {
      "critic": "Aaron Hillis",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 30,
      "summary": "Stylish cinematography and an awesome punk-and-new-wave soundtrack make the early, music-video-like montages of debauchery at least trashy entertainment, but the film's second half couldn't be more contemptible."
    },
    {
      "critic": "Robert Koehler",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 30,
      "summary": "A weekend romp for four middle-aged buddies devolves into a drug-fueled, suicidal hell in Mark Pellington's ill-conceived and executed I Melt With You, a work of extreme self-indulgence."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 20,
      "summary": "It almost seems unfair to mention that Carla Gugino shows up as a cop 80 minutes into these overlong proceedings; by then, viewers who walk out would never even have known that she was involved."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2011
      },
      "score": 20,
      "summary": "An excruciatingly awkward stab at generational sympathy, I Melt with You presents a quartet of thickening college buddies gathering at a Big Sur rental house to mourn their lost ambition."
    },
    {
      "critic": "Noel Murray",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 16,
      "summary": "A movie about self-absorbed douchebags that wallows in their douchebaggery."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2011
      },
      "score": 12,
      "summary": "The only thing more narcissistically indulgent than the film's repugnant protagonists is Mark Pellington's iPod-scored, visually flashy, thoroughly hollow directorial celebration of them."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "summary": "When a sheriff's deputy (Carla Gugino) visits the house, I Melt With You turns into a ludicrous, cheap horror thriller that sheds any claims to integrity. By the end, you feel nothing, not even contempt."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "summary": "I Melt With You assuredly marks itself as one of 2011's most ludicrous releases."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "summary": "A disastrous catalog of flaws, all accentuated by dilated, out-of-focus cinematography. The coke-snorting, booze-guzzling and vomiting add up to nearly two hours of frustration, anesthesia and pointless, self-indulgent excess. They should have called it \"I Vomit With You.\" There's plenty of that too."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This seems to be a very divisive movie.  You'll either love it it immensely or hate it with every fiber of your being.  I for one loved it!  It's been two weeks since i watched it on Netflix, and I still can not stop thinking about it.  I thought it was a beautiful, albeit intense movie.  The score is just as enchanting and the acting is phenomenal!  The subject matter is dark, and the director,  Mark Pellington, takes the audience places most filmmakers dare not go.  It doesn't help that it has 3 relatively mainstream actors, two of which are well known for doing comedy, which i feel is what shot this film in the foot.  Movie-goers expectations.  I feel the people who choose to watch based solely on the cast, and know nothing of the movie are setting themselves up for disappointment.  A wonderful film, that is unfortunately not for everyone.",
      "total_reactions": 7,
      "user": "BardgersinBlue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "This was an excellent film, with jarring visuals, strong performances, and an incredibly deep and impressive soundtrack.  The film will certainly miss the mark for many, who only see the 4 main characters as privileged jerks that cannot be empathized with.  However, this is what the movie is dealing with.",
      "total_reactions": 1,
      "user": "avery-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Indeed, it is a very good movie. Very unique and different from other usual movies.",
      "total_reactions": 1,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "I was hopeful for this movie because it has some of my favorite actors in it...and they all do OK. But for a movie dealing with some pretty deep dark things, there is surprisingly little introspection. I found myself wishing for a faster way to the inevitable. Plus, Carla Gugino plays the most ineffective, clueless sheriff ever.",
      "total_reactions": 5,
      "user": "astorey126"
    }
  ]
}