{
  "mc_avg_user_score": 7.9,
  "mc_metascore": 57,
  "mc_mixed_rating_frequency": 17,
  "mc_movie_name": "I Origins",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 63,
  "mc_pro_critic_reviews": [
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 90,
      "summary": "I Origins is a bracingly venturesome, exploratory work that achieves an exceptional balance between the emotional and intellectual aspects of its unusual story."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 88,
      "summary": "An exploration of where science ends and spirituality picks up, this second feature from writer-director Mike Cahill (Another Earth) is captivating, suspenseful and thought-provoking."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 88,
      "summary": "Cahill has not only made a thoughtful and compelling movie about science, but he’s also given us an intriguing story that delves into the age-old debate of faith vs. hard proof involving the possibility of a higher spiritual power."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 88,
      "summary": "A true indie film roller-coaster ride, from moon-eyed romance to aching heartbreak, cerebral puzzle to incredibly moving, emotional resolution to that puzzle. In a season of the year where sci-fi is dumbed down and then dumbed some more for mass consumption, here’s a piece of speculative fiction that will stick with you long after the last Transformer’s battery has died."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 83,
      "summary": "Brit Marling, who starred in and co-wrote Cahill’s debut feature, “Another Earth,” is very good as Ian’s lab assistant and eventual wife, and a young Indian girl named Kashish, a nonactress I would guess, is unforgettable."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 83,
      "summary": "I Origins is a fascinating examination of belief, spirituality and otherworldliness through the skeptical lens of science, however, it's not always perfect."
    },
    {
      "critic": "Damon Wise",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "Cahill's second feature film is another smart, inventive and engaging offering."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "Thought-provoking, making this a solid date movie science geeks and philosophy freaks alike."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "A film that aims for the stars and may have found one here on earth."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "It is a film that can sometimes frustrate in its supporting characters but Cahill and his talented cast are unapologetically willing to explore the kind of complex intangibles that filmmakers often ignore or merely turn into pretentious drivel."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "The attraction between the resolutely empirical scientist and his “spiritual,” hippy-dippy girlfriend gives the film an unpredictable quality."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 75,
      "summary": "It works its own sort of magic. After all, who doesn't want to believe that the soul does have a window, and that if it closes we might open it again?"
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 75,
      "summary": "While still invested in grandiose swipes at big ideas and the epistemological babbling of a late night college dorm room conversation, Cahill generates an authentic sense of mystery by keeping a tighter lid on the secrets of the universe."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 70,
      "summary": "The hypnotic, clicky soundtrack, Bergès-Frisbey’s playful yet sad performance, and a few significant script moments laying out the film’s philosophy all aim toward a sleepy trance that helps put the biggest flaws into soft focus."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "As a director, Cahill’s a capable and sometimes breathtaking stylist, and he accomplishes remarkable things on a modest budget, topping up the visuals with patterns, rhymes, and concordances."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 63,
      "summary": "The film ends with an ambiguous, yet powerful conclusion. It doesn’t answer the question it raises, yet the way it’s asked keeps it echoing in your head. Except that Cahill can’t seem to leave well enough alone."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "Cahill, who did the equally heady, intriguing drama “Another Earth” (2011), keeps the tone consistent. He makes certain his cast walks a savvy tightrope, keeping things taut."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 60,
      "summary": "The story proceeds with all the flighty unreality of a film unconcerned with real-world scientific rigor... but Cahill manufactures enough conspiracies, coincidences, and extraordinary turns of plot to keep his thinking audience too busy to care."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "Persuasive sci-fi tech talk, soulful romance and an earnest stab at metaphysics combine in director Mike Cahill's polished second feature."
    },
    {
      "critic": "James Rocchi",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 60,
      "summary": "I Origins is about on-par with “Another Earth,” but it’s still disappointing that a film so obsessed with the eye has such a fuzzy, blurred vision of what it wants to do."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Stories about scientists doubting what they know to be true — \"Contact,\" for example — can be provocative and engaging, on an intellectual and emotional level. But I Origins challenges too little and ties up things too neatly for it to register as anything more than well-made, well-intentioned hogwash."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Poorly paced with a tendency to veer into the pretentious and littered with contrivances and dramatic short-cuts, I Origins fails to provide a single three-dimensional character or compelling relationship."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Although the film and the actors keep on looking good, this solemn, soppy, fantasy has nothing to say about science or faith."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "The struggle between faith and reason somehow gets sidetracked, resulting in a sometimes silly, too-obvious journey."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "I Origins is at its best when it's a personal story about relationships, and it has a strong first hour."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "Even when plausibility fails, I Origins is elegantly cosseted by its dreamy camerawork (courtesy of Markus Förderer) and pretty people."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "On the face of it, tackling the warring sides of science and the spirit seemed a good fit for the writer-director, who continues to be drawn to existential themes. There are occasional flashes of the exceptional, but the film's dodgy story can't sustain them."
    },
    {
      "critic": "David Lee Dallas",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "It  treats its characters as placeholders for philosophical arguments and spends the majority of its running time trying to \"solve\" existential mysteries without adequately exploring them."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 42,
      "summary": "I Origins is an exercise in supreme obviousness, beginning (but not ending) with its double entendre of a title."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "The problem is, the second half of the film -- when it's time for it to get down to business -- isn't nearly as compelling as the first. As a result, the impact of Cahill's story is muted as the payoff just doesn't feel rewarding."
    },
    {
      "critic": "Diane Garrett",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "The final third of I Origins helps make up for much of the movie's earlier shortcomings, and while it does have a nice gothic look, it's not nearly as captivating as Cahill intends."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "I Origins really loses its oomph when Ian travels to India in search of a particular pair of eyeballs, and the movie closes on a note that would make even M. Night Shyamalan roll his own."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "“Another Earth” was a heartfelt entertainment that managed to infuse a tantalizing science fiction premise with thought and feeling. I Origins is too committed to explaining itself to repeat the trick and falls into the trap of taking its daffy intellectual conceits far too seriously."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "This new feature, though, sets up a dialectic between reason and faith and argues it insistently, with eye-rolling earnestness."
    },
    {
      "critic": "Amber Wilkinson",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "Despite his free and easy camerawork, which generates some lovely moments between Ian and Sofi, Cahill's narrative jolts along in fits and starts."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 40,
      "summary": "The film amounts to a lousy sort of magic show, schematically pulling strings to prove its own points."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "An intriguing look at science, spirit, interpersonal relationships and the ties that bind them, all wrapped up in a captivating story. It's unfortunate,however, that some pacing problems, lame attempts at humor and tech-speak dialogue bog down the flow of this otherwise-engaging release.",
      "total_reactions": 1,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "Michael Pitt plays a biologist who's researching the eye with lab assistant Brit Marling. His fascination with the subject and love for a woman ultimately lead him to questioning his strictly scientific beliefs. Although there are some philosophical discussions, the script is intelligent (as opposed to intellectual). It's mysteries slowly unfold with smart plotting and potent performances. Director Mike Cahill (\"Another Earth\") tells an enthralling story with intriguing visual style. More than science fiction, this film is intriguingly spiritual, while being completely compelling as a film experience.",
      "total_reactions": 3,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "“What would you do if something spiritual disproved your scientific beliefs?”",
      "total_reactions": 1,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "A must-see movie. Beautiful, deeply moving, spiritual film about the the soul. Brit Marling is excellent as the lab assistant adding grounding to this haunting love story about the unknown. Read the trivia section on IMDb to fully appreciate the significance of the 11's.",
      "total_reactions": 1,
      "user": "sarahcarter"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Incredible idea of a hypothetical link between that which is not seen through the sensory perception & that which is physically seen.",
      "total_reactions": 1,
      "user": "Anwar-Mkayed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "The plot is okay but this movie is way too predictable to be any good. Perhaps some better editing and a shorter length would have helped. What could have been a good film was executed very poorly. Even the ending was blatantly obvious. The movie might as well have had director commentary giving away plot points.",
      "total_reactions": 0,
      "user": "ozymandias79"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Great film that implores you to keep an open mind to possibilities and the un-explainable. It's a fun ride that'll grab your interest even if it doesn't change your perspective.",
      "total_reactions": 0,
      "user": "Coedy"
    }
  ]
}