{
  "mc_avg_user_score": 6.3,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "I Used to Be Darker",
  "mc_negative_rating_frequency": 0,
  "mc_positive_rating_frequency": 3,
  "mc_pro_critic_reviews": [
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 91,
      "summary": "Drenched in the evening glow of its urban and suburban backdrops, Darker comes alive in the dark, when its characters are drowning their sorrows in song, the sauce, or conversation."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 88,
      "summary": "This sounds like it could be austere and schematic, but the affecting, authentic performances from the first-time actors make these characters thoroughly authentic."
    },
    {
      "critic": "Sheri Linden",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "It's a story of contained chaos, quietly observed — one that catches fire more in retrospect than in the viewing."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Some occasionally awkward performance moments aside, though, the film is very compassionate towards its characters and finds just about enough original insight within the well-worn family drama genre to keep things from feeling too familiar—it’s a just a shame there couldn’t have been a little more vitality injected early on."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "The songs performed here function as the creative end point of emotional trauma, revealing pain gradually transfigured into art."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Mr. Porterfield might sometimes be too subtle for his own good, but by taking us on a low-key ramble through the ever-shifting feelings of a fractured family, he has woven a dreamy, detached chronicle of dissolution and renewal."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "The film exhibits a contemplative quiet and attentiveness to detail that enhances its issues of regret, bitterness, and confusion, many of which are rooted in thorny parent-child relations."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "There’s still enough of merit here (particularly a movingly low-key finale that strikes just the right note of reconciliation and regret) to suggest that Porterfield has the chops to eventually hone his talents to a fine point."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Watching Campbell over her shoulder or in a mirror is frustrating because it consistently limits our view of her character. Porterfield's people can't give anything away beyond their immediate aggression, frustration, and sadness. But it's hard to appreciate an intentionally blurry portrait of a family that's so impressionistic that all you can see of its already-withdrawn characters are their shadows."
    },
    {
      "critic": "Noel Murray",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Where before, Porterfield seemed to be recording life as it’s lived, here, he’s mostly recording plot. The difference is glaring."
    }
  ],
  "mc_user_reviews": []
}