{
  "mc_avg_user_score": 6.9,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 63,
  "mc_movie_name": "Ice Age: Dawn of the Dinosaurs",
  "mc_negative_rating_frequency": 18,
  "mc_positive_rating_frequency": 123,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2012
      },
      "score": 6,
      "text": "This film has its share of entertaining moments, but we've seen it all before. It's harmless entertainment but it shouldn't be compared to higher ranking movies. Then the movie would suck all the time because how can a recent animated movie be compared to Citizen Kane. You just can't because they're both entirely different. As long as nobody does that the movie will be fine, but just not great.",
      "total_reactions": 1,
      "user": "Pixarlover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 4,
      "text": "This film disappointed me. I'm a fan of animated films, but this provided few thrills and the storyline was very slow and pointless. Perhaps it was the little kids in the cinema who were constantly saying \"That wasn't funny\" and shutting down every single joke that made me realise that this film doesn't even work for young children and the humour was predictable and only rarely put a smile on my face. It had its moments, but overall I thought this was a bore.",
      "total_reactions": 0,
      "user": "Judddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2010
      },
      "score": 7,
      "text": "another sequel? wow. 20th Century must be very good at making sequels. so, our lovable heroes from the first two movies come face to face with Dinosaurs. thats quite impressive. whats my opinion of it? well, its... (gasp) HOLY CRAP!! it made so much money? dang. people must like this movie. where was I? oh, yes. well, the storyline was monotonous, but the animation was quite amusing and the characters were perfect. its a fast-paced sequel that kids will love.",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2011
      },
      "score": 7,
      "text": "After the second movie let me down I wasn't looking forward to this, but it's humor aand the fact that the characters are once again enjoyable made this an enjoyable movie for me, the story also isn't half bad, while you shouldn't expect it to be as good as the first it is still a good movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "The movie was ok. Humour wasn't good but at least it was watchable.",
      "total_reactions": 0,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "The graphics are great, especially in 3-D. The plot is okay but boring. The characters and the voice acting is terrible. Ice Age 3 was generally a descent film, but its predecessors are way better.........",
      "total_reactions": 0,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "although the jokes aren't really funny, the characters ultimately work and i especially liked the ending. in the end, ice age 3  was fun.",
      "total_reactions": 0,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "I didn't expect this. The story of Ice Age is more outrageous than ever. There is a bit more action in this one as it introduces dinosaur characters.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2012
      },
      "score": 5,
      "text": "I enjoyed it more than the first two, but as a piece of storytelling it is bad. But boy is the squirrel hilarious not enough to have a spin- off but to almost make this movie work. I give this movie 49%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Better then Ice Age 2 but still flawed. Buck, the newest character in the Ice Age series, is very likeable and funny. The plot is a little generic but easy to look past because it's mature like the first film's plot (The first film was taking care of a baby, The third is about growing up). It's funny, like all Ice Age films. The only problems I had with it was that it was a little anti-climactic and at times rather predictable. Besides that, It's definently a step up from the second film.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "The first 20 minutes or so are boring as hell, and will have you wanting to leave the theatre. However, once the gang goes underground into the dinosaur world it starts to get really interesting and funny. 3 new characters are added them being Buck (a weasel who lives in the underground dinosaur world trying to kill the biggest, baddest dinosaur Rudy) Peaches (Manny and Ellie's daughter) and the nameless squirel rat thing who plays the love of Scrat. In fact, the one thing I hated about this movie was that Scrat became incredibly boring. Oh well, it was a pretty awesome movie and I definetely recommend it to any fan of the series, kids, or even adults! Oh and by the way, you don't need to see it in 3D for it to be good. AND, I personally think it's the best of the trilogy.",
      "total_reactions": 0,
      "user": "paulgreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "The use of 3-D in this film is fantastic. The ultimate disappointment in this movie is that the jokes seem all recycled and too cliché. It's still intelligent in several places, mind you, and is recommended for kids who enjoyed the first two.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "Ridiculously predictable, corny and extremely childish, Ice Age 3 can only be enjoyed by children or the childish. This movie truly sucks in as many aspects I can think of.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "It's probably the worst Ice Age movie I've seen so far, but that doesn't mean I think it's BAD. But comparing the first one with this one, it has NOTHING on the first movie. But still, it's good, but the franchise is focusing on humor more and more and less and less on charm and emotion.",
      "total_reactions": 0,
      "user": "ImSpidey2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "The movie is good, but it is the worst of the series, but spend some time seeing it.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "A better Ice Age movie than the poorly made predesscors. Charcaters are funny and story will touch your heart. The best Ice Age movie. Also, more comedy than the early movie Ice Age 2. And finally it is set somewhere instead the Ice Age boring setting, the ice.",
      "total_reactions": 0,
      "user": "Annoymous1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I just can not believed that the crittics gave this movies such a bad rating. This film is funny, but at the ending is not so well",
      "total_reactions": 0,
      "user": "hacmiu36"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Great adventure, super story and great fun with Manny,Sid,Diego,Elly,Crash,Eddie and Buck! This movie is just awesome! The age doesn't matter, i recommend it to all  kids,teens,adults! The only thing is, how/why/ the dinosaurs live underground?Also i think this part should be called \"Dinosaur Age\" because there was no ice in the 80% of the movie. But that's not really a issues at all! I think it's a must watch for all people who love to be positive and who love fun! My final score is 9/10",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "Simon Pegg joins the cast when the group accidentally lands themselves into an underground world full of dinosaurs that were supposed to be long dead. Humorous and good for kids, this was the last Ice Age film to impress me.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "More mundane, incoherent, and jumbled-up than any of the first two, 'Dawn of Dinosaurs' is an unnecessary sequel that permanently destroys the franchise, and any sequels.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 4,
      "text": "Ice Age 3 is a cool refreshment.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "Having seen only this and the original with my son, I can say we both really enjoyed them each, and about equally. I caution them against further sequels, as they may soon be running out of fresh ideas.",
      "total_reactions": 0,
      "user": "talisencrw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "ice age trilogy is creative and great bu the sequel was kinda thrilling  . this is worth watching for",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This is second film series that I did a personal research on and there are many negative reviews. I don't understand why most film critics and movie reviewers don't like this film. It is understandable for the first two films as there are plenty of shortcomings but this film is certainly so much better than predecessors. Not to mention, this film series is also rightfully children films; you can't expect it not to be lovable and be more appealing to children. There are already thousands of films out there that are more appealing to adults more than children and while their opinions may not affect all the audience worldwide... Come on, don't be harsh! D;",
      "total_reactions": 0,
      "user": "hayashimegumi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "É legal e tem uma boa história, mas é o mais fraco de toda a franquia. Um bom filme para assistir sempre,mas eu não recomendo muito. Você pode tirar proveito da história da dinossaura e Sid e do nascimento da Amora.",
      "total_reactions": 0,
      "user": "f3l1p3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "The third Ice Age is unfortunately a little bit worse, and feels unrealistic and might confuse kids about actuality, I'll admit that the dinosaurs look cool, and some of the fight scenes are really well done, but other than that there's just nothing.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "esta pelicula es bastante buena para niños y ademas es muy graciosa aunque no sea mucho comparado con un proyeto pixar es muy buena como para recibirla con criticas mixtas",
      "total_reactions": 0,
      "user": "emiliomiceli31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "The plot is fairly predictable and some of the gags are tired but this is still a funny, good-hearted movie. Rather than relying solely on the film's main characters, the writers have given Crash and Eddie more room to create laughs and the new character, Buck, is too looney for words. As with most movie franchises, by #3, this one's gotten a little tired. But \"Dawn of the Dinosaurs\" gives Manny and Co one last (we hope especially for Scrat) and genuinely amusing, outing. A fun family film.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "Well here 's good movie boring the first minute and then a really interesting split decisions , no more until the dinosaurs came out as guests LOL ! That joke so frightening .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Colorful animation, heartwarming moments, voice acting that is top notch, and great comedic moments make this entry a fun adventure, but the story is very predictable and lackluster",
      "total_reactions": 0,
      "user": "Deondre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Its Good, its not great or fantastic, but its good. I like the Animation and The characthers like Buck. Scrat still is funny, but nothing can compare with The Frist one. Ice Age 3 is Decent, not great but its has goods jokes and animation.",
      "total_reactions": 0,
      "user": "CriticFer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "A Era do Gelo 3 é o mais mediano da franquia. Ele é divertido e instigante, mas não consegue ser muita coisa. Um grande destaque do filme é a saga do esquilo com a noz, em que ele está junto com uma esquila.",
      "total_reactions": 0,
      "user": "CharlieBetterIs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "Not a bad flick. I don't remember liking the first one, skipped the second one and the only reason I went to see this one was because it was a \"sneak preview\" that started right after the movie I had gone to see and it was in 3D. I recommend seeing this one in 3D as it was worth the extra couple dollars. I was very surprised at how much I enjoyed it. The story was really stupid and didn't make any sense (dinosaurs living under the ice???), but it kept me interested the entire movie, partly because of the hilarious side story with the acorn loving animal and an excellent job by Simon Pegg as Buck the weasel(I just got done watching his TV show \"Spaced\" so maybe I am a little partial), who I had no idea was going to be in the movie. This movie also did a wonderful job of keeping everyone in the audience interested. The theatre was packed and the only things you heard besides the movie was popcorn chomping and laughter, lots of laughter. Definitely worth seeing at the theatre if you were considering it.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Usually the strongest sequel installment for just this time period... or will it be? That answer will be confirmed by the time Collision Course gets released. Scrat > Everything else.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "When I saw the trailer for this movie I asked myself, was there a need for another sequal. The awenser was no, not really. While this movie isn't terrible, it just kind of feels like the same movie again. And while it has it's moments, most of it is just kind of boring to me.",
      "total_reactions": 0,
      "user": "gameguardian21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Ice Age Dawn of Dinosaurs is some kind of illogical and unremarkable characters. But it has interesting story-telling, inventive plot and a great sequel for a good saga as this. Sadly, is not enough for be good movie anyway.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2016
      },
      "score": 0,
      "text": "This was horrible. A complete disgrace to the Ice Age series, nothing new, and the characters are complete ridiculous. This isn't even a movie, it's just a bunch of crappy new characters that are featured in a 1 1/2 hour runtime.",
      "total_reactions": 0,
      "user": "superbat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2016
      },
      "score": 5,
      "text": "I used to like this film as a kid. But as a grown-up, it's just a bit dull. Most of the focus is put in the action and the comedy, which isn't really a bad thing. But unfortunately, the characters end up being bland.",
      "total_reactions": 0,
      "user": "RobBob6197"
    }
  ]
}