{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 48,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "I'm Still Here",
  "mc_negative_rating_frequency": 9,
  "mc_positive_rating_frequency": 21,
  "mc_pro_critic_reviews": [
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2010
      },
      "score": 38,
      "summary": "It's all tiresome, muddied and artlessly made."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "It would be just as entertaining to watch the Letterman appearance, the Miami nightclub show, and other public performances on YouTube than to watch this movie. Sadly, it gets boring . The final sequence is interminable. After years of Real World, The Hills, and other \"semi-reality\" shows, we don't really care how much is staged and how much is real. Just make it interesting. Compare this to the Joan Rivers doc from earlier this summer, and you can quickly understand which one was done well, and which one wasn't. I actually think that JP's got some talent - when he plays a couple of tracks for Puffy late in the film, I thought they were catchy. His voice is horrible, but it has its appeal. The guy is his own worst enemy, and a movie like this lifts the veil on his life in a way that just didn't need to happen. That is, if it's not all bs.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Okay, I got to say this is too good, I like it so much. In fact , I'm just going to buy a DVD for this, then I can watch it over and over again.  The scene is nice, the actor is great.",
      "total_reactions": 1,
      "user": "QA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "Iâ",
      "total_reactions": 1,
      "user": "Duke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "You will feel it in your bones. \"I'm Still Here\" is real, contrary to the official statement made by the filmmaker claiming that it's not. The documentary plays like a byproduct of an intervention, a documentary with cross-purposes, unbeknownst to the subject, whose family and friends were at a loss as to how they could reach the drug-addled star of \"Walk the Line\", and most recently, James Grey's \"Two Lovers\". Think about it: the Phoenix clan is like the Kennedys of Tinsletown; they didn't want to lose both brothers. Could Joaquin be that insensitive, to knowingly make a mockery out of the drug-related circumstances which surrounded his older brother's death? In \"I'm Still Here\", he smokes pot; he snorts coke, the very things that helped kill River Phoenix back in 1993, without the slightest bit of camera awareness. That's how far-gone Joaquin was at the time. Never mind the haphazard locks and unruly facial hair; just focus on his gut. A sane person puts on weight for a role with prestige, as did Robert DeNiro when he portrayed Jack LaMotta in Martin Scorsese's \"Raging Bull\", not some home movie shot by his brother-in-law. This is pure speculation, but here's my best guess as to what the actor was thinking, and what the filmmaker was thinking: Joaquin, the pampered celebrity, encircled with sycophants who exalt his every move, actually believes he can rap, so the actor in transition participates in the project under the pretense that \"I'm Still Here\" will predominantly be a music documentary, a behind-the-scenes look at his second career from the ground level up, whereas the brother-in-law, abetted by the people who have no stake in Phoenix's professional life, want to burst his bubble. Now that Joaquin's camp is proclaiming \"I'm Still Here\" to be a hoax, consider the bubble burst, as the actor perhaps finally sees for himself the evidence mounted against him, in regard to his \"talent\" as a hip-hop recording artist. Joaquin's camp would like us to believe that Phoenix was pulling an Andy on us, or goofing on Spike Jonze, whose \"Being John Malkovich\" features a lengthy segment where Malkovich retires from the acting world in order to be a puppeteer. But just remember, before you abide by the press release, truth can sometimes be stranger than fiction. After all, Michael Jordan tried his luck at baseball. \"I'm Still Here\" served as a reality check for Joaquin; he's no Eminem, he lost himself, but getting off drugs and getting a sympathy hug from P. Diddy helped the actor \"snap back to reality\".",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Okay, I've let this movie percolate around my brain for a week now, and by now, we know that this is performance art, and not any sort of \"real\" documentary. The people who hate this movie are most likely people that can't laugh at themselves or find that exploring their own prejudices is just too uncomfortable. This movie isn't about JP at all; it's about celebrity worship and our rathr sick culture. I'm just as guilty as everyone else. In short, this is the most daring movie I've seen in years, and the most rewarding one I've seen since \"There Will Be Blood.\" It out-Kaufmanns Andy Kaufmann. Affleck and Phoenix both deserve hardware.",
      "total_reactions": 0,
      "user": "Fanshawe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "The reviews are hilarious.   Undeniably balsy film.  How can you call it a hoax when he's blowing lines and having sex with prostitutes? How can his rants be a hoax.  It's pretty true to life, and it's a work of art, not a hoax.  It's self-indulgent and not everyone's cup of tea, but I appreciated it.",
      "total_reactions": 0,
      "user": "druss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "â",
      "total_reactions": 0,
      "user": "MedinaReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "I saw this after Phoenix announced that it was all a hoax, so I'm afraid I didn't get the full experience they were going for. However, if it is in the same vein as Borat or Bruno, then it is a respectable performance in an unremarkable film. Affleck does not show much directorial flair, but there are some good laughs and is generally entertaining. I have no idea what I would have thought had I seen this before the hoax announcement was made.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "Bottom Line: I haven't laughed so much since Borat. Yes, it's that good. If you loved Peter Sellers in 'The Party' then you'll love the heck out of 'I'm Still Here'. And for all you haters out there. Why you gotta hate the player? If you can still hate this movie while you're hating the game instead... well, I for one feel sorry for you. And no. I haven't the foggiest what that means. Quit looking for meaning where there is none.",
      "total_reactions": 0,
      "user": "ThomDowting"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Don't be fooled by the critic's reviews. This is the funniest movie of 2010, but only if you view it as the hoax it is. Phoenix is brilliant, chanelling the likes of documentary narcissitic anti-hero's such as Anton Newcombe from Dig! Despite some absurd behaviour, the comedy still remains subtle, similar to the awkward humour of Gervais and Merchant, if they were on coke.",
      "total_reactions": 0,
      "user": "Evolutionary"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "A work of art. Misunderstood by many...but its acting at its finest and a masterful social experiment.",
      "total_reactions": 0,
      "user": "wesker2012"
    }
  ]
}