{
  "avg_user_score": 5.2,
  "metascore": 44,
  "mixed_rating_frequency": 70,
  "movie_name": "Into the Storm",
  "negative_rating_frequency": 38,
  "positive_rating_frequency": 54,
  "pro_critic_reviews": [
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "Into the Storm is as straightforward a disaster film as you're likely to find."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "It's hard to imagine any movie ever topping this one's depiction of killer tornadoes laying waste to the Midwest."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 75,
      "summary": "The found-footage disaster flick Into the Storm is “Twister’’ for dummies, but by no means is that an insult. The new film is enormous fun if you’re in the right mood."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 67,
      "summary": "Into the Storm captures the magnificence of tornadoes, their awful beauty when they set down, the devastation they wreak, and the enormity of their consequences. The film features a rich array of well-developed characters – including the storm itself – which makes it ever more involving as it unfolds."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 63,
      "summary": "Bring on the bread and circuses. Into the Storm features laughable dialogue, far-fetched situations, and generic characters played by actors who almost look like more famous stars. I still had a blast; and if you lower your resistance, you may too."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 63,
      "summary": "Not all of it makes sense, but for disaster movie fans, Into the Storm has enough destruction to go around."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "Its story line and performances are no more than serviceable, but those terrible twisters are state of the art."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 60,
      "summary": "To give the film its full due, the people who made it — the writer, John Swetnam, and the director, Steven Quale — got wind of a genuine trend and ran with it. Everyone on screen is busy filming everyone else. It's a shakier-camera version of \"The Blair Witch Project\" in the era of YouTube."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 58,
      "summary": "The film barely services the main characters and their arcs, so there's really no room for the sort of delicate etching needed to make supporting characters live and breathe. The film is at its best when it embraces the goofy nature of disaster films in general, and when it gives the audience the red meat it craves so desperately."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 58,
      "summary": "Into The Storm is an uncanny valley disaster movie — not as consciously cheesy and cheap as something like \"Sharknado 2,\" but built around a similar equation of unreality and gratification."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "The structure and impressive effects of Into the Storm could keep viewers entertained on a rainy weekend evening but it’s the shallow, non-existent characterizations that keep it from working."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "This film is actually less menacing than marveling, though a disturbing opening scene in a storm-tossed van could fit right into Mr. Quale’s earlier work."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "One-dimensional characters play second fiddle to the main event. Given the large cast of faceless players, it's hard to care when a few get sucked into oblivion."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "If we don’t care a whit about the characters and their respective dilemmas, a multiple-vortex tornado ripping through a used car lot is just a multiple-vortex tornado ripping through a used car lot."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "Into the Storm plays like a special-effects demonstration in search of a movie, but you have to give it to the filmmakers: They take no half-measures."
    },
    {
      "critic": "Christopher Gray",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "There are many instances of questionable logic in Into the Storm, but the most persistent is the film's unexplained assumption that tornado-hunting is a growth industry."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "As impressive as the effects can be, as effective as the blend of TV news helicopter POV shots, security camera footage, cell-phone video and storm chaser images mimicked here turn out, the human stories are given short shrift in this “spend our budget on effects” action picture."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 50,
      "summary": "As clumsy as Quale is with the sequences of people shouting exposition back and forth, or delivering teary Blair Witch-style goodbyes into a camera that would have died long before its operators, he handles the CGI action with breathless intensity."
    },
    {
      "critic": "Ed Frankl",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 40,
      "summary": "When you're pining for Bill Paxton and the relative emotional realism of Twister, you know you're in trouble."
    },
    {
      "critic": "Mike McCahill",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 40,
      "summary": "Its destructive setpieces may loose the odd popcorn kernel on to the multiplex carpet, but it's really just an effects reel: the weather – cloudy wisps turning to massive, fiery hellblasts – is considerably better developed than its quarry. Stick with Twister."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "Too cartoonish to be cathartic, and too ghoulish to be honest fun, Into the Storm is mostly a somewhat uncomfortable sit enlivened by occasional hilariousness."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "Into the Storm is at once one of the dumbest films you'll see this year and one of the scariest."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "Once Quale and writer John Swetnam get their generic setup out of the way, they can loosen up and treat the tornadoes like the villains they are. The effectively simulated storms, with their massive wreckage, start to feel like monsters stalking the heroes."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 40,
      "summary": "The script by John Swetnam is rudimentary, with only the most minimal and pallid stabs at characterization... Nevertheless, once the funnel clouds begin swirling, Quale and his special effects team achieve some remarkably authentic and frightening moments."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "Hollywood's latest entry in that tried-and-true genre, the disaster movie, is . . . well, it's like . . . a totally gnarly roller-coaster ride!"
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 38,
      "summary": "Nobody watches a disaster movie starring digital tornadoes expecting Oscar Wilde. But Into the Storm, directed with bland efficiency by Steven Quayle of \"Final Destination 5,\" reminds us that unless a movie establishes certain base-line levels of human interest, it runs the not-unentertaining risk of coming out squarely in favor of its own bad weather."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 37,
      "summary": "For all the movie’s grandiose annihilation, there also is action so absurd and emotion so saccharine that the likelihood of involuntary laughter is high."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "At the climax of Into the Storm, colossal tornadoes make noise, blow things up, and go around in circles; that's pretty much all the film does, too."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 30,
      "summary": "Into the Storm can make it rain like nobody’s business, but when it tries to be smart, it comes out all wet."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "If the film had been trimmed to 45 minutes of crazed storm-chasing and storm-fleeing, it might've been worth a matinee ticket. But as is, it's the sort of lazy late-summer idiocy you'd be wise to huddle beneath an overpass to avoid."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "Many movies require us to turn off our brains, and many rely on clichés and/or coincidences. It takes a special kind of shamelessness to do both, and Into the Storm has that in spades."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2014
      },
      "score": 25,
      "summary": "Even within the spinning cylinder of mediocrity that is Into The Storm, there are some minor pleasures to be had. Those are mostly found in Walsh, who is probably best known for comedic supporting turns, but makes the most with what is nearly a leading man part here."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Into the Storm is exactly the movie I expected it to be- no more, no less. It is 90 minutes of a tornado ripping crap apart in the Midwest. It has flat characters that show no development, cliché after cliché, and a boring script. But who cares? That's not what this movie is about. It's about destruction, thrills, and good CGI, all of which it delivers on.",
      "total_reactions": 5,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "First off let me say don't let the reviews fool you this is a good movie. In no possible way is it bad though some of the actors act a little camera shy at times. The effects and damage looks amazing the tornados are frightening and the \"big one\" is unbelievably jaw dropping! Also the movie has a few funny moments with Nathan Kress (icarly) being a funny like able character as well as the redneck dynamic duo who offer a few laughs as well. Overall I liked the characters but the main reason to see this movie is the special effects and destruction this movie has. These tornados are killers and they destroy everything from planes, oil tankers, schools and of course houses and cities. This movie has the best looking tornados I've ever seen! They are terrifyingly real looking! Overall I loved this movie it's a great summer blockbuster and the best disaster film since \"day after tomorrow and twister!\" So If your a fan of disaster movies or wanna see tornados destroy everything in their path you should definitely check it out.  9/10",
      "total_reactions": 4,
      "user": "C3realkillah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "A whole slew of twisters ravages a small rural area, while some people run to avoid them and others chase them down. The story is about as trite as a disaster plot could be, but it's so poorly written that there's no sympathy for the family and the TV crew. I lost count of how many times somebody screamed \"Hold on!\" However, the tornado effects are FANTASTIC. Special effects have gotten to the point where it's a completely convincing spectacle. That's the only reason to go. If you can ignore the irrational moments (a large airport in a rural town is just one) you'll be in for several whirlwinds of massive destruction.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Predictability and ridiculousness runs rampant in \"Into The Storm,\" a turn-off-your-brain film with filled with lame dialogue and characters, but some promising thrills/effects.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "Flashes of electrifying set pieces can't compensate for the chronic narrative anomalies and the overabundance of thinly sketched characters present in the disaster that is Into the Storm.",
      "total_reactions": 1,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "Just seen it and from my point of view it's very well made disaster movie. I have no idea why it has bad reviews from some viewers as it has decent story line, good special effects and keeps the tension all the way through the film. Would definitely recommend for anyone who is looking for decent disaster movie.",
      "total_reactions": 5,
      "user": "diedmarozas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Into The Storm is the most intense storm film ever. Seriously. Gus Van Sant's Twister was a great achievement, a wonder for films. But Into The Storm is even better looking. But, it doesn't mean its good though. Steven Quale directs this film about people who get trapped inside a mind bending storm. The characters are something you don't care about in this movie. In fact you don't care about anything except the storm itself, destruction and the damn awesome special effects. This movie isn't excellent. Believe me. But it's good enough to keep you on the edge of your seat. Into The Storm is a gut wrenching ride. It's worth watching in IMAX 3D.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "About what I expected...",
      "total_reactions": 3,
      "user": "Shonsu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "This film was just ok.  I thought some of the language used in the film  \" bang her good\" , pissed, **** screw was not really appropriate for a 12 film.",
      "total_reactions": 3,
      "user": "Metaomarsam"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "A fun and suspenseful film that was much better than Twister! I wasn't sure if I wanted to see it because I dislike movies like these but I'm glad that I did. I wouldn't suggest taking the movie too seriously. I will buy it when it comes out on DVD/Blu-Ray.",
      "total_reactions": 5,
      "user": "anigmerose"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Deceptively looking as if it's a straight to DVD B-movie, Into the Storm is actually a fairly good disaster movie with decent acting and effect. The buildup takes quite a while as it switches back and forth between into mockumentary and usual catastrophic shot. It is a different kind of style that tries to establish more authenticity, which to its credit, work adequately in some scenes. Upon first glance it highly resembles Twister, though effort has been made to avoid such resemblance, and it still treads the line between absurdity and timely coincidence, but surprisingly the movie entertains well enough to breathe some fresh air to audience.",
      "total_reactions": 2,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Intense jaw-dropping feats in the visuals that dazzle, the twisters are captured as horrifying and realistically as they could. I'm glad we get a storm-related movie that actually pushes the limit in the effect sequences, you feel right in the storm. So I give the movie credit for accomplishing it's vision and holding me down in thrill, but the tremendously horrible script and most forgettable characters makes this a lower-tier movie. In 5 months you could probably watch clips on youtube of the four best scenes in the movie and then walk away, to watch the full thing would be less engaging.",
      "total_reactions": 2,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "Another Generic Disaster movie made for teens, Twister is a better watch. Reasons are is because this one is filled with abysmal acting and some of the scenes just make no sense and or drag on for too long.",
      "total_reactions": 2,
      "user": "glaspeylawson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2014
      },
      "score": 2,
      "text": "OK, so I went to see \"Into The Storm\". Wish I had been there with fellow storm chasers. I was nearly howling with laughter at certain points in the movie. They made all the same mistakes they made in Twister, but in some cases even more egregious. They totally ripped off Sean Casey and his TIV to the point where I'm shocked there wasn't legal action. Sure, the CGI in the tornadoes was miles better than Twister but the story and acting, if anything, was worse. And, once again, we have twisters appearing out of thin air at the bottom of stratus clouds and radar readings that show just nondescript cluster storms, moving in the WRONG DIRECTION. Their storms were heading SOUTHWEST in their screens. It wouldn't have taken much to get it right with the right consulting. The only storm that looked almost right was the first one and it looked as thought they ripped off the footage from a copter cam of a storm a few years ago. Honestly, Sharknado Two was better, at least that one knew it was low-rate and played on it. Still, glad I went to see it. The best part were the yahoos. I won't say more.",
      "total_reactions": 2,
      "user": "gadjitfreek"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Into the Storm is a disaster, no pun intended. The acting will have you cringing and the cliche ridden story bogs down the actually good visual effects. It seems like all the effort went into the effects and it shows, making this feel like an updated Twister with less likeable characters.",
      "total_reactions": 2,
      "user": "OstrichGoat"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "This has the best Effects anyone could ask for, it could make you be afraid of storms like it did to me :) !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 14,
      "user": "Humza5"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "This film is so terrible I don't even feel like going into detail with a long review on this one. Basically all you need to know is that the acting sucks and there's basically no storyline other than tornadoes destroying a whole town the day of a high school graduation. I give it a generous 1 just for some of the impressive effects. I thought I was saving myself by avoiding the new ninja turtles movie, but seeing this just convinced me that it's just a really bad week for new releases.",
      "total_reactions": 6,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 0,
      "text": "Easily one of the worst movies I've ever seen in my life. I kept sorta open minded when I went into the theater (not a big fan of found footage movies) but this movie was just horrible. To people wanting to go to the theater this year to see a movie, save your money. There isn't any blockbuster coming out this summer (except maybe Guardians of the Galaxy, though I'm not a big superhero fan).",
      "total_reactions": 6,
      "user": "PyongyangMayor"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Wow! Some awesome special effects there! Impressive visuals. Story started off slow, in a cheezy, low-budget first-person view manner. Slowly but surely, things gets exciting. The storm looks real and threatening. The destruction terrifying. A rather basic story, but was a good disaster film overall.",
      "total_reactions": 1,
      "user": "R6ex"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "Much like the Burt Reynolds character in boogie nights, i've always wondered why Pornos don't have legitimate acting sequences prior to the goods. In the same way, I can't figure out why these found footage movies have such terrible beginnings. I mean the disaster sequences in the second half of this film are pretty darned impressive. But the introduction is just so repugnant that I can't imagine anyone wanting to last past the first 30 minutes or so. And Walsh. I can't figure out why he took all of his stored up goodwill from the TV show Veep and tried to use it on this relative disaster.",
      "total_reactions": 2,
      "user": "FleshWorld"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Into the Storm is very similar to the popular movie Twister. Basically a group of tornado hunters chase twisters to record useful data to help prevent the destruction of which they do to buildings etc. Into the Storm has excellent action sequences that really satisfied the audience, however it's overshadowed by a mediocre script and acting. Its quiet an useless and really unneeded movie that will not completely entertain. I would recommend a rent a best.",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "This is a below average disaster movie. The characters are forgettable, and time between the appearances of the tornado are quite unwatchable. The films only strong point are the special effects, which are good rather than great.",
      "total_reactions": 1,
      "user": "ajaydalmeida"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "One word terms that come to mind when describing this movie are: generic, cliche, average, unoriginal, etc. It's like they had a checklist of every disaster movie cliche. If you've ever once seen a disaster movie in the past 30 years, you can tell who's going to die and who's not right from the start. The acting in this movie is painful. This is one of the softest disaster movies I've seen. Almost no one dies that we follow. A few background characters die who you didn't really care about. Only one main character dies, and you could tell throughout the whole movie that he had it coming to him. For how bad this movie was, I do have to give credit where credit is due. The special effect was cool to watch. The tornado at the end looked amazing. The effects are to only thing keeping me from giving this movie a 2/10. Should you see this move? Well, if you like special effects and destruction, you will be pleased. If you like developed characters, good acting, plot, etc. Stay away from this movie.",
      "total_reactions": 2,
      "user": "NotFirePumpkins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "This is just bad. What you just need to know is that the actors feel like they don't know how to act at all. Confusing storyline... tornado here, tornado there, maybe add some sharks to make it interesting?",
      "total_reactions": 1,
      "user": "alexahill716"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 1,
      "text": "Call me an insensitive person but the beginning of the movie  was terribly boring. There were so much unnecessary talking that I just wanted to walk out if the theatre — too frustrated to register all of the jibber jabber. However, as it goes into the middle of the movie, it was mediocre... I was not that excited as I've been expecting. As it rolls into the end, it was just hands down weird... seriously. Yuck, yuck, yuck. Probably the worst movie of 2014?",
      "total_reactions": 1,
      "user": "x295x"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "Take the director of Final Destination 5, add in the writer of Step Up 5 , some actors from television and a large list of unknowns and you have a disaster on your hands. Sounds like I’m taking the piss but I’m actually serious, Into The Storm made me cringe in the previews and I begged for its big scale disaster and it delivered on every level. The special effects are so catacalysmically astounding, I don’t understand how the movie bombed at the box office…I mean audiences bought horrific acting and story in Transformers 4…and 3….and 2….and to some extent 1…and teenage mutant ninja turtles…and battleship…but still you walk into this movie knowing 100% that the acting is going to be average, the story is going to suck and barely be there, we are here for big screen twisters with an alarmingly high level of destruction and boy did this deliver!",
      "total_reactions": 1,
      "user": "Novastream"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 4,
      "text": "This movie is like Sharknado but if you take out the sharks. Okay let me name of the few good things in this movie: The visual effect's was well done and the acting wasn't that bad as I thought it will be. But there is a lot of bad things in this movie like the characters are mostly idiots or just **** The story is... oh wait, there is no story; just some idiots chasing wind and getting themselves killed. This is not the worst movie of the year but it seriously not good. with bad directing and it's a summer movie that nobody is going to remember. Overall Into the Storm as I said it's not a good movie, but not a terrible movie.",
      "total_reactions": 1,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "If you can get past the fact that this is a found footage film Into the Storm is surprisingly enjoyable. Using somewhat cliché characters the film is able to show human drama and tragedy caused by the storm. Rather than use this film as an excuse to show off the power of special effects of a storm, which similar to Twister was probably the intent, this film isn’t goofy. This film we are given people to care about the film actually acknowledges how dangerous and tragic storms will be. If you hate found footage movies and somewhat cliché characters this film will be a turnoff but if you thought Twister was dumb this might wash that out a bit.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "It starts off slow with way too much of an emphasis on character drama and whatnot. You've got the high-school guy finally getting up the courage to talk to the girl he likes, the brothers with daddy issues, and a team of tornado chasers who haven't seen a tornado in a long time.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Into the Storm was a very surprising movie for many reasons. The first surprise is that Max Deacon, who plays one of the main characters named Donnie, carries the film from an acting perspective. Sarah Wayne Callies was marketed as the big get but Max Deacon steals the show. The second surprise was how well the special effects were, especially considering the relatively modest $50 million budget. Also, the shorter duration of 89 minutes didn't prevent Steven Quale from delivering plenty of character development. Actually, I'd say the shorter time helped the movie as it was able to dive into the action fairly quickly and make for almost a beginning to end, edge-of-your-seat tornado thriller. Lastly, and maybe the biggest surprise of all, the movie was very funny. Jon Reep and Kyle Davis, playing stereotypical rednecks named Reevis and Donk, respectively, added a great deal of comedic relief and the timing for their wacky humor was perfect and contrasted with the devastation of the town around them well. There were still some flaws. There was a void of anything scientific whatsoever, which is something that Twister, a film that all tornado movies are compared against, at least attempted. There also was a missed opportunity on some of the emotion. I thought this last bit could've made the movie leap from exciting and somewhat terrifying nature environmental thriller to deep and insightful catastrophe movie. A leap almost all of the movies in this genre seem to fail at achieving. Nonetheless, I felt that it was more than worth my time.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Many people say that Into The Storm was too much like Twister, but that is only partially correct. Twister was the story of storm chasers, trying to beat another team to the punch in getting data from inside a tornado. Into The Storm also has storm chasers, but they're only a part of the story, as it also features the town caught in a super storm, and a family caught in the middle. If you want to compare this film to twister, simply because of tornadoes and storm chasers you can, but Into The Storm still wins, as it features a better background story, better special effects, and is overall much more intense. Richard Armitage stars as the High School's assistant principle, that goes into the storm to find his missing son, and save other people in the path. While the British Actor isn't known for anything more than The Hobbit, he showed real intensity and fortitude, making the film so much more exciting. He's paired with storm chaser turned rescuer, Sarah Wayne Callies, best known for her roles in Prison Break and The Walking Dead. Callies usual plays the strong female character with great ideas, the leaders right hand if you will. In this film however she is little more than a follower, leading to a performance that wasn't nearly as good as I thought it would be. When you have a film with the popularity of Twister, anything else that features anything even remotely similar is going to be compared to that film and ultimately called a rip off, and parts of it could be considered that. When watching the film and now reflecting on it, I prefer to think of it as updating a great idea with a new cast, story, and effects. You are free to disagree and if you're one of those people who think of it as just another rip off, I'd still recommend seeing it for the special effects, if nothing else.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "When the tornados are on screen the moving is exciting with some impressive shots but any other time the film is dull, stupid, and corny all in one. Basically when you aren't seeing a tornado destroy something, the movie sucks.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 5,
      "text": "\"Tornado! Tornado!\"",
      "total_reactions": 0,
      "user": "mugen_is_here"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "It starts off slow introducing you to the characters. I was starting to dislike the movie at this point, but than it picks up and turns into an entertaining movie. I don`t get the low ratings. This movie had flaws, but was fun to watch.It doesn`t have the story that Twister did, but I didn`t expect it to be that good anyways. If your expectations are through the roof you will be disappointed, but this is a good movie.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Another version of the movie 'Twister'. Not because both the movies are about tornadoes, but takes place in a similar fashion where a group of twister/storm analyzers/chasers goes after their thing only to come out in a messed-up state. Forget the 'Twister', lets talk about this film. It had better effects, but that did not give the visuals like the natural occurrence, mostly they over-used it. I can call it a display for commercial purpose than reality, that's what Hollywood is famous for, isn't it?",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "A film with good effects that fails to make you can about any of the characters who are in grave danger.  The script is poor with second tier acting.  A film that tries to be the new Twister is closer to Sharknado.  D+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "They should have just called it Twister 2. I watched both for comparisons sake and there's a ton of recycled plot. One big difference is 18 years in progress of special effects. They're great. The tornados look and feel real (when I say feel, watch the movie with a high-end speaker system and you'll see). Of course there are the storm chasers, but there are also other story lines. There's a family story and then there's the two idiots running around trying to become famous on the internet. You'll either love them or hate them. Overall it was an ok movie. VERY INTENSE. This is the kind of movie that doesn't let up and keeps you on the edge of your seat. The story is very predictable. Like I said, its Twister 2. Its all about a storm system thats the biggest the state has ever seen (sound familiar). There's an eventual F-5 and bla bla bla. If you liked Twister, you'll like this movie.",
      "total_reactions": 0,
      "user": "SergeantSoz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Whilst Into the Storm lacks an engaging narrative, believable characters, and a decent storyline, it is only saved by its first-class special effects which truly do thrill when witnessed.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I just went to see this movie in theaters and I gotta say this is one of the most intensive movies I've ever saw. At first it was slow with the interviewing and other things but as it goes on it becomes interesting. The Tornados themselves look amazingly great and they had great effects. Well some of the effects were a little off but at the same time I still thought it was great. Action movies like this get me really intrigued. So I will give this movie a 8.5/10. Only gave it that score because some of the characters were boring and not too interesting.",
      "total_reactions": 0,
      "user": "francisjairam12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "finally we get a movie that has a \"hurricane\" in the movie. I was amazed by the effects of the hurricanes and the destruction. but it was short to be honest. It should be long show more surviving make the movie long like Avatar. Grade A-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "THE GOOD: AWESOME VISUALS!, THUNDEROUS SOUND, INTENSE ACTION SEQUENCES(maybe a little ridiculous but.....intense), at least a few funny scenes.....and the acting is not bad but is not greatest.",
      "total_reactions": 0,
      "user": "SB9902"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Into the Storm, si bien no logra impulsarse de una forma muy inteligente que se diga, logra ofrecer un gran entretenimiento.",
      "total_reactions": 0,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "This Movie feels like a second twister kind of movie. But the Special Effects and the sound mixing can better your experience. The Time pace is too fast, needs more time. Replay value:Between Moderate Low and Moderate",
      "total_reactions": 0,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 5,
      "text": "The first 30 minutes of this movie was very boring it is trying to set everything up and introduce you to characters that you never really care much about at all during the whole movie. Once the tornado scenes started the movie finally started to pick up. Even then when it was not a tornado scene the movie was still boring. But I can say that the scenes during the storm/ tornado scenes they were really good. The effects of the tornados were really well done and did look life like to me. I am a fan of natural disaster movies this is not one of the best but the effects are really cool at parts.",
      "total_reactions": 0,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Into the Storm would have been better in 3D, it would overshadowed the two dimensional characters and the so so story, thus I slightly enjoyed the movie, it was just fine.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "This movie reminds me a lot of the movie Twister from 1996. The special effects were done well and the acting was good in my opinion. The good thing I liked about this movie was that there was two climactic scenes. I usually just expect one but the fact that they had two was pretty awesome. Some parts of the movie killed it for me though because I come from a medical background and it just didn't look believable.",
      "total_reactions": 0,
      "user": "paulwasthere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Convincing effects just won't cut it if the film is missing an intriguing plot, with forced development of uninteresting characters and wooden acting. The audience would have been left confused deciding whether this film was found footage or not.",
      "total_reactions": 0,
      "user": "SushiStoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "At least the big disaster movies of the seventies were made by adults generally for adults.  This pitifully inept junk is made by shallow children, cast with shallow children, for shallow children.  And it fails at that.",
      "total_reactions": 0,
      "user": "AxeT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "Incredible film with a fantastic ending! The special effects will have you on the edge of your seat. Great story line too involving a documentary and some funny guys doing stunts. Dunno what the problem is with some people giving it a bad review!!!!!!!! It's one of those films you know you are going to enjoy watching again at a later date. I actually found it very original. Just because it's in the genre of disaster movie does not make it boring at all.",
      "total_reactions": 0,
      "user": "joesfiddle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "Not such a great movie I thought. I was expecting one of those big global storm things and all it was, was basically a rehash of the now classic disaster film from the 1990's called Twister. I don't like it when they make a movie thinking that many people probably didm't see the film it was based on because it had been made over ten years ago. The script was stiff and the acting was stiff also. Not to be overly critical of the cast on unknowns but I didm't feel a connection with any of them which is strange for me because there is usually someone in a film I can identify with. Kind of bleak fare. Two piehead hicks are in the film as if they gave the film credibility with 'people like me' or some such thing. A real ho hummer at best. Maybe don't bother-you might want to save up for a burger-since nothin's cheap no more.",
      "total_reactions": 0,
      "user": "emeraldcity"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 3,
      "text": "I had no clue as to what was going on. frankly the plot had more holes than Bonnie & Clyde. I do recommend it though it is crap, you might enjoy it. but then get pissed of at how there is no plot, no ending, and how all the characters are as stupid as, well Bonnie & Clyde.",
      "total_reactions": 0,
      "user": "MyOpinionC0unts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "I checked this movie together with a friend of mine and we both found it very spectacular. All the effects in the movie 'Into the storm' seem so real. Is there anyone who can propose other great movies? Thanks!",
      "total_reactions": 0,
      "user": "ElineB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "Summary: The tornado sequences are somewhat thrilling, but the writing is awful, and its found-footage format is confusing and unnecessary. 16/100 [D-]",
      "total_reactions": 0,
      "user": "GuillermoBM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Visually exciting, but unfortunately very melodramatic if not downright corny. It's a made for TV style movie with made for TV stars. The directing is pedestrian and best and the only time the film actually works is when it's focussing on the tornados. If you want to see a really great movie about storms, check out \"Twister\", which has sort of become a motion picture icon",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "\"Into the Storm\" 10 Scale Rating: 4.0 (Bad) ....",
      "total_reactions": 0,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "I watched this movie on release ate, and I thought it was awesome. I personally loved the Twista Huntas, and thought it added a great touch to the movie. although it did have some ridiculous moments (the manhole flying off twice), I still thought it was a great movie.",
      "total_reactions": 0,
      "user": "intothestormfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Ok, it doesn't have a great story, or a great plot, or anything similar to that. But if you are not looking for those this, this movie is very exciting, it has great special effects, is very realistic and you are going to really feel attached to the characters. This is the most intense storm film ever made, it has destruction everywhere and the first person camera is really perfect for it. Watch it if you don't want to see a great story or awesome characters, but a really suspenseful, intense and exciting film.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Don't watch this piece of crap. Lame movie with terrible plot and okay visual effects. Don't waste your time on this movie. Go watch Twister instead!!",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "A disaster of a disaster film that takes unbelievability to new highs. Cool-looking tornados aren't enough to mask the awful writing and cringeworthy performances. It makes Twister look like Pulp Fiction.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2015
      },
      "score": 0,
      "text": "Don't waste your time watching this movie. After 25 minutes I couldn't watch anymore. It literally put me right to sleep. This movie was not worth the $9.00 I paid.",
      "total_reactions": 0,
      "user": "XDMetalbabe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2015
      },
      "score": 4,
      "text": "Not advisable for kids unless you like cleaning poo. There are a stupid amount of cliches and the characters are bland and recycled. But I like movies where something in the midwest gets completely destroyed. Liked it but the characters ruin it.",
      "total_reactions": 0,
      "user": "OzzieViking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "Great tornadoes, as if they are really real. I enjoyed watching the movie.",
      "total_reactions": 0,
      "user": "katharris417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "This movie deserved to be better, but it tried way too hard on the visual effects. 89 minutes about very special tornadoes striking Silverton, Oklahoma is not interesting at all.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "The special effects in Into the Storm are top notch. However, the storyline is extremely flawed, this film has every cliche and cheesy line a film can have. If it weren't for the horrible plot, characters, and acting, this would be an easy 8-9, instead I'm giving it a sold 4/10",
      "total_reactions": 0,
      "user": "RickyReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2016
      },
      "score": 9,
      "text": "This movie is exactly what I wanted. A bunch of epic and huge tornadoes tearing about Tornado Alley. Characters are dry. But that is not what I was watching the movie for. I watched it for intensity, action, and a thriller, and this film did it perfectly.",
      "total_reactions": 0,
      "user": "bestreviewereve"
    }
  ]
}