{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 99,
  "mc_movie_name": "Into the Woods",
  "mc_negative_rating_frequency": 75,
  "mc_positive_rating_frequency": 191,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 90,
      "summary": "Into the Woods, the splendid Disney screen adaptation of the Stephen Sondheim-James Lapine musical, infuses new vitality into the tired marketing concept of entertainment for “children of all ages.” That usually translates to mean only children and their doting parents. But with Into the Woods, you grow up with the characters, young and old, in a lifelong process of self-discovery."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "The singing is often splendid. The bits of humor are deftly handled. The pace is relatively swift. And it never feels like a static rendition of a theatrical event dumbed down for a younger demographic."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "Stephen Sondheim’s stage classic Into the Woods, a dark and subversive musical take on fairy tales, not only survives but triumphs in the composer’s most unlikely collaboration with Disney."
    },
    {
      "critic": "Christine Dolen",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "Marshall, who established himself as a great movie musical director with 2002’s Oscar-winning Chicago, has done a masterful job of collaborating with Sondheim and Lapine to transform their 1987 Tony Award-winning, two-act musical into a film that flows seamlessly as it juggles its intertwining storylines."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "Marshall deserves credit for knowing how to shoot and cut (alongside editor Wyatt Smith, “Thor: The Dark World”) a musical number, and his work here ranks much closer to his success with “Chicago” than to his dismal “Nine.”"
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 83,
      "summary": "The big star with the most unexpected chops, though, is Chris Pine, who runs with his Prince Charming role and, along with Billy Magnussen as Rapunzel's Prince, contributes the movie's best musical moment with the duet \"Agony.\""
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 83,
      "summary": "Although its first hour is more stunning than its second, this is a movie musical that, for a change, never degenerates into a false wholesomeness. It’s one of the rare musicals that both children and adults can enjoy, though for somewhat different reasons."
    },
    {
      "critic": "Stephanie Hayes",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 83,
      "summary": "On film, Into the Woods feels tighter, the tone more cohesive."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "What makes Into the Woods so entertaining is the cleverness of the tale itself and the way specific characters match the talents of its storytellers."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "The cast is top-notch, the story is satisfyingly dark, the performances are fun and, of course, the songs are terrific."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "This twisty fairy-tale mash-up shows an appreciation for the virtues of old-fashioned storytelling, along with a welcome dash of subversive wit. It benefits from respect for the source material, enticing production values and a populous gallery of sharp character portraits from a delightful cast."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "The film is a whirl of pure pleasure that just keeps whirling: Sondheim doesn’t write show-stoppers but show-surgers, and from the moment the glorious opening number whips up, introducing the central players, the film cartwheels onwards until it lands at its unexpected but quite beautiful happy-ever-after."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Indeed, most of the famous faces are surprisingly adept at singing. Even when the actors are not lip-syncing (which seems to be about half the time), the dense, clever lyrics are intelligible."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Johnny Depp, in bushy eyebrows, sinister mustache, and a suit and hat of fur, may be too cartoonishly lascivious for his own good as the wolf who pursues the girl in the scarlet cape to Grandmother's house. But then he gets to croon the couplet, \"There's no way to describe what you feel / When you're talking to your meal.\" Delicious."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Into the Woods is forced in some places but exquisitely right in others, and it gains strength as it goes."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Faithful but not slavishly faithful to the source, the movie retains most of the songs but streamlines the story, particularly in the second half."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "What is celebrated is the art of storytelling and the bedazzling attraction of a killer cast, uninhibited acting, giddy escapism, attractive visuals and an extroverted score."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Even if this Into The Woods lacks the exhilaration of the best movie musicals, it does capture the show’s emotional intimacy—no small task in a field that favors razzle dazzle."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Into the Woods rumbles on for too long and has some dry patches here and there — but just when we’re growing fidgety, we get another rousing musical number or another dark plot twist, and we’re back in business."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "The movie works best whenever Corden and Blunt, performers of nearly limitless appeal and sweet-natured vulnerability, take the story back from their cohorts, though Kendrick is no less beguiling."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Another example of concept over coherence, but the entertainment value is considerable."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "I’m only half-kidding when I suggest that you see the movie but leave (especially if you have kids) at what’s obviously the end of the first act. You’ll still get the dissonances, ambiguities, and portents of doom, along with much that is pure enchantment. And you won’t leave thinking the movie had been made by the Big Bad Wolf."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "Marshall hasn’t made one of the great movie musicals here, but he hasn’t bungled it either — far from it."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 67,
      "summary": "As the ugly and bitter witch who yearns for stolen life, Streep’s performance, for the most part, is strangely joyless. Once upon a time, this actress knew how to keep it fresh when going over the top (\"Death Becomes Her,\" anyone?), but here she’s hardly bewitching."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 67,
      "summary": "The first two-thirds of the film, which are like the Brothers Grimm's Greatest Hits on laughing gas, have a fizzy, fairy-dust energy. But as soon as the baker couple's scavenger hunt is over and a rampaging giant appears, Woods loses its magic and momentum and sags like an airless balloon."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Yes, the sets and costumes elicit swoons, but it's the peerless Sondheim score, however truncated, that makes this Woods a prime destination."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The casting for the movie is outstanding. Streep is marvelous, as always, but in this case she outdoes even herself (and the script) by bringing a degree of poignancy to her conniving character."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Into the Woods left me out in the cold. The long-gestating cinematic adaptation of Stephen Sondheim's fairy tale-infused Broadway musical, Into the Woods can claim a clever screenplay and a few enjoyable performances but little else."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The notion that children are raised on fairy tales and the question of how those early stories affect us all — even into adulthood — remains fascinating and is delivered here with visual panache and musical flair."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Streep, Marshall & Co. still manage to do the “Woods” justice. And if it’s more impressive than embraceable, remember your Sondheim (“Sweeney Todd,” “A Little Night Music,” etc.). That’s kind of his thing."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "This PG-rated romp is, refreshingly, less notable for its happily-ever-afters than its oh-no-they-didn'ts."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Family entertainment with death, limb-lopping and other horrors. If you go Into The Woods today, you’ll be surprised how faithful this is to the dark stage musical."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Into the Woods starts better than it finishes but it’s a great-looking film, with a nicely old-school, easy-on-the-CG feel."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "There are brilliant, bewitching moments allied to hilarious and touching ones. Just not enough of them in what veers, at length, between the clever, the terrifying and the bit tiring."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "As a film, Into The Woods is trapped between the stage and the screen, at odds with both its source material and its adopted medium."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Loyal fans of the Sondheim original may feel a bit let down themselves. There’s much to love here. But working with original “Woods” writer and Sondheim collaborator James Lapine, Marshall tones down the crucial dark shading in some places and has trouble with pacing in others."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 58,
      "summary": "Whether it's past its pop-culture expiration date or not, Into The Woods deserved a more visually inventive director to help make it work, and instead, we get something that feels somehow reduced by its translation to the screen."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The tedium of Into the Woods’ second half has less to do with the downbeat subject matter than Marshall’s clumsy direction."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Has its moments, especially any time Streep is on screen, but as it strains on at an overlong two hours, the glitter of fairy tale movie magic diminishes, leaving only a pale shadow."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Rob Marshall simply cuts from one tale to the next, isolating his actors. There's little sense that the fairytale space is a shared one -- it's just a bunch of noisy incident transpiring in unrelated treestands."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "As strong as that cast and those visuals are, however, they don't quite add up enough to guarantee a happily-ever-after for moviegoers looking for a memorable in-theater experience."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 9,
      "pos_reactions": 15,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the most captivating and affecting film adaptations of a stage musical I've seen! As a word of caution, do NOT presume that because the plot is based upon \"interwoven fairy tales\" this is intended to be a feel-good kids' movie. Acquaint yourself with the (excellent) 3-hour Sondheim musical and you'll soon realize that the aim of this story is to explore what occurs *beyond* the happy endings. The events of the second half are dark, yes; but the overall message is hopeful (listen to the words of the movie's final two songs). Certain changes and omissions were necessary to get the film version down to a palatable running length, and huge fans of the stage musical may be put off by some of these. Personally, though, I feel that they were appropriate given the totally different demands of each medium. I was blown away by the performances and the amazing vocal talents of the cast as a whole. The actors pulled off those notoriously intricate Sondheim arrangements beautifully -- and there are many moments of humor to lighten the mood. In particular, Chris Pine as the \"charming-not-sincere\" prince gave an especially funny, tongue-in-cheek performance. This movie is a reflection of life itself with a magical fairy tale twist: colorful, touching, energetic, humorous, sad, ultimately uplifting and so very, very well done.",
      "total_reactions": 24,
      "user": "slayde11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "I walked up excited and came out disappointed. While the performances from the actors and singing was good. Everything else just seemed out of place from the pacing, to the story and to the running time. This movie kept going and going and going and going and going until it finally ended.",
      "total_reactions": 4,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Fairy tales crossover 'Into the Woods' works for around 2/3 of it's running time as a well acted,  funny, melodic musical before taking a jarring tonal twist in the final act which felt like a whole different movie.",
      "total_reactions": 3,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "This movie was almost amazing! The first 2/3 of the movie were almost perfect, then it drags on to tie up a couple of loose plot holes that were unnecessary. This movie could have been a funny, delightful, and refreshing take on fairy tales, but it loses it steam and everything that could have made it great. With so many new releases around the holiday, there are better movies to invest your time with.",
      "total_reactions": 2,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "The movie Into the Woods was not horrible, but not one of the best movies I've seen in my life. The story is both bland and dark. Giving the story book characters a bit of a twist from the original story. The movie was definitely not what I had expected. I am surprised by the director's and the writer's creative integrity in the original story, but I being a favorite of the original story I prefer the original story over this one. The characters acting wasn't bad. It shows not oly the good in the character but also a darker side to them. The prince being self-centered and the other characters having a darker and self-centered side was a huge twist in the story. I honestly liked the story being original but didn't like the ending or the way the characters were written. Storybook characters are written to inspire people to do the impossible and over come all odds but the whole prince cheating on Cinderella thing wasn't something that should be taught to younger kids. Overall I give the movie a 5. The story is original, bland, and changes the original story completely.",
      "total_reactions": 2,
      "user": "soccerjess21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "i loved the whole cast and their singing potential but that was about it. the first hour and a half was unnecessary and boring. the last twenty minutes was literally the whole movie. i would have appreciated the movie more if they had actors playing multiple roles to express the duality of characters but without that it lost the artistic value of the original performance. i was overwhelmingly underwhelmed.",
      "total_reactions": 2,
      "user": "HonestReviews9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "In December 1987, I saw Into the Woods on Broadway with Bernadette Peters. The musical had just opened the month before, and it was charming, original, and entertaining. Translating the musical and stage format to the screen expands the spatial representation to the world of reality, or pseudo-reality, given that the story is a fairy tale, and that expansion is problematic for it dilutes the concentrated power of the original format.",
      "total_reactions": 1,
      "user": "ClariseSamuels"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Into the Woods definitely has it's flaws, mostly due to pacing, but overall, the movie's performances (especially Streep, Corden, and Blunt) make this a solid movie from Disney.",
      "total_reactions": 1,
      "user": "NShep53"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Fairly entertaining, with some good performances apart from Anna Kendrick's Cinderella - I have no idea how this actress got this part as she cannot hold down a tune. As review Devax2 noted the film is much too long and loses its charm way before the end.",
      "total_reactions": 1,
      "user": "royphishooh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Into the Woods was great until the end. I get it that everyone wants their work to be different, but the end made no sense really. The character changes toward the end were along the lines of immaculate conception--it would not have happened naturally. Great movie for people with low IQs. If curious, rent it. Although the acting was great, it is not worth the cost of a movie ticket.",
      "total_reactions": 1,
      "user": "pruz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "Wobbly plot, confusing morals, and 30 minutes too long. Will leave you and your child with a headache.  Every song sounds the same. Would not recommend.",
      "total_reactions": 1,
      "user": "dougfarre"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Into the Woods mixes all the favorite stories to make a boring sophisticated musical film. Watching the movie, there are times when you WISH it to come to an end which finally becomes granted after a two-hour endurance.",
      "total_reactions": 1,
      "user": "Armin_Abbasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Simplesmente o pior filme da Disney!    Impossivel de ver, confuso e sem ligaçao entre as cenas.",
      "total_reactions": 1,
      "user": "descontente"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "This move is so impossibly terrible that I felt compelled to join this website in the hopes of saving others from wasting their money and two hours of their lives. It just refused to end! Entirely awful. Didn't Depp think his song sounded a bit pedophile-ish? Go see anything else. Go to the thesaurus and look up the word \"bad.\"  This movie is all of those words.",
      "total_reactions": 5,
      "user": "muddfoot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 0,
      "text": "Yet another badly written and poorly acted film ( yes even merryl Streep ) such film should have never occupied the award season. The film keeps going when you think \" thank God it's ended\" , for further 25 min with a speed of a snail. The last giant women storyline was totally unnecessary.No kids or adults in the audience were laughing. I guess it says it all.",
      "total_reactions": 4,
      "user": "Sebe2012"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "This movie was a massive disappointment. I went with three other people and none of us liked it. The songs were okay. None were particularly memorable except for the humorous song with the princes. It was way too long of a movie. The last half hour of the movie was terrible (after the wedding). It consisted of things happening with no reason or explanation, no emotion shown by any of the characters, a BS line of morality drawn by multiple characters about how decisions don't matter and there is no wrong or right. That is a dangerous message to send to kids in my humble opinion. I am fine with no happy ending but this movie creates an unhappy reason simply just to say it did and that happy endings don't exist. Meanwhile, the acting was stale and boring. James Marsden was the closest to a decent character. The rest simply lacked a soul. I have no clue how this movie has so many positive reviews. A brilliant musical is Les Mis, this on the other hand was forgettable drivel.",
      "total_reactions": 4,
      "user": "adammwilson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Worst. Movie. Ever.  To say that it crawled is an understatement.  My 11-year-old daughter mentioned that she thought it should have ended about 4 times. I wish it had never started. Absolutely TERRIBLE.",
      "total_reactions": 4,
      "user": "RegularGuyRevu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "I am not going to say this was the worst movie I have ever seen, because at no point was I compelled to walk out on it.  However, I am going to have to negate most of the posts praising the cast for good acting.  I do not think it is necessarily her fault (I blame the director), but Lilla Crawford as Little Red Riding Hood was unbearable to watch.  She appeared as a soulless singing robot - like a jukebox with legs.  Then again, so did many of the characters.  Meryl Streep's performance was missing something.  I have seen community theatre performances with a more lively and captivating witch.  That being said, the movie missed the opportunity to make Prince Charming and the Wolf the same person, which I have seen a number of times on stage, which adds a layer of complexity.  Instead they threw a dumptruck full of money at Johnny Depp for a three minute scene prominently featured in the preview to get unsuspecting movie goers into the chairs.  James Corden was by far the most interesting person to watch in this movie and Tracy Ullman as Jack's Mother was fun.  If you have seen Into the Woods on stage, you will be disappointed.  If you are not a die hard fan of musicals, you will be disappointed.  If you ARE a die hard fan of musicals, but somehow missed Into the Woods, you will still be disappointed.  Go watch a bunch of nobodies do this on stage, and I can almost guarantee it will be more captivating.",
      "total_reactions": 4,
      "user": "thetaboosun"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "I went into the movie with low expectations. I was pleasantly surprised.  This movie was really good.  Emily Blunt, Lilla Crawford, Meryl Streep, and Anna Kendrick were all fantastic.  The rest of the cast is excellent as well.  Please know going into the movie that it is a musical and that it does have a dark side to it during the second half.  But, if you love movie musicals you will love this!!!",
      "total_reactions": 11,
      "user": "spizzell"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "Very disappointing.  My 10 year old grandson wanted to leave about half way through the movie along with the two other family members.  I was actually ready to leave before then but I could only think of the $40 I so willingly handed over to treat my son and his family (failed miserably).    It was the first time I've ever gone to the movies and actually wanted to ask for a refund.  It was painful but we sat through it in hopes that it would get better because we didn't think it could possibly get any worse.  Watching Depp and Streep was clearly the highlight.  They are brilliant actors and the only saving grace for this waste of my time.",
      "total_reactions": 6,
      "user": "jeyden1956"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "I gave 3 to this movie only because the place and the costumes and effects are great! And the witch is the only enjoyable part, even if this was the most hated character in the movie. Meryl does an incredible job and she almost saved the movie from being a total disaster. First if you are going to destroy our childhood fairy tales, make it for an adult audience with good sarcasm, not super cheesy comedy that was so random it was confusing. It was like the directors/producers were mocking themselves! This movie sucks let's make fun of it! The songs were soooooooooo long I had to close my eyes at times. I don't know why they have to bring a British accent to make it more appealing, but yeah even that got annoying. The end was terrible, it dragged on forever. I saw a person looking at their cell to see when it was over as I was too. They really ruined a great opportunity to make a great movie because again the effects and the woods are incredible, but the plot super boring. Good singing but again not even the angelical voices can make me watch this one more time!",
      "total_reactions": 6,
      "user": "la_chica"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "This movie had great actors. If it had ended when they were all happy it would have been great. But it wouldn't end. Crappy ending. It just wouldn't end...and then it got worse and worse. What a disappointment.  Waste of time and money. I can't express how disappointed I was by the storyline, sexual content, and length of the movie.",
      "total_reactions": 6,
      "user": "moviefanatic123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "Although I really enjoyed the first two-thirds or so of this innovative fairy tale merger, I found it went on much too long, with the result that the novelty finally wore off. I also found the music sing-song and void of a single hummable melody. All of that said, Streep was her usual peerless presence.",
      "total_reactions": 3,
      "user": "nautico"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Much too long.   Lousy music.   Couldn't care less about the characters or what happens to them.   The visuals and scenery were the only good thing about it.   Also, Meryl Streep does a decent job as the witch.   Wait 'til this one comes to Netflix.",
      "total_reactions": 3,
      "user": "jbl123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "shoe rhymes with blue rhymes with who rhymes with knew (or new)---that about wraps up the songwriting abilities of the composers.  The story is haphazard, the character  development is non-existent.  I couldn't wait for it to end.  I loved Maleficent---I loathed this one.",
      "total_reactions": 3,
      "user": "wadewilliams"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Cue the negative reviews from people who don't take the time to actually find out what the movie they are going to see is about. Yes, it's a musical. Giving it a negative review solely on the basis of it being a musical is ridiculous.",
      "total_reactions": 13,
      "user": "acarmatt"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "So boring. A mash up of fairy tales and songs. This is terrible but johnny Depp is beyond bad. He is impersonating a wolf or a pedophile or maybe a wolf- pedophile?",
      "total_reactions": 7,
      "user": "kinoralph"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 2,
      "text": "Can you say way too long. Grandmother, wife, daughter and 4 year all were not impressed. Too many verses of \"into  the woods\", long drawn out story lines and nothing that inspiring to connect with any of the characters. The scenery and special effects were OK",
      "total_reactions": 16,
      "user": "crai3g"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "A musical turd.  How'd they manage to make the Grimm Brothers boring?  Plot contrivances galore and the obligatory interruption of story momentum for musical numbers that tell you how a character feels.  Mashing up several fairy tales is a conceit, not a story.",
      "total_reactions": 10,
      "user": "Insomniacker"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2015
      },
      "score": 1,
      "text": "Mindless, aimless, plot points and inane moralizing songs strewn together at random, for what seemed like 4 hours. One of the stupidest movies I've seen in years. Please don't waste your time.",
      "total_reactions": 6,
      "user": "sc0TTi"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "Into the Woods is better than other musicals I've seen, which isn't saying much. Rob Marshall failed to connect the characters to one another and they all seemed separated. The movie ended at the 75 minute mark and then became an awful drag for the last 30 minutes.",
      "total_reactions": 6,
      "user": "csw12"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "For the most part I really enjoyed the interweaving of these classic stories.  All the performances are good and the singing is fantastic.  Then the film ends so you think, but there turns out to be about 30 minutes more 30 minutes that doesn't really work for me.  Overall though I was entertained and would recommend at least for the performances.  B",
      "total_reactions": 6,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "As a preface to my analysis I would like to say: if you are a parent looking for a good family film that you'll all enjoy, take caution before going to see \"Into the Woods.\" It's not that there's anything particularly inappropriate, but rather that  \"Woods\" is a complex musical for adults. This is why the \"Junior\" version of the stage musical (intended for younger audiences) ends after the first act. I believe it is pretty deceptive how they've marketed this film. Unless you have some pretty smart kids, do them a favor and  save it for them for when they're older.",
      "total_reactions": 6,
      "user": "daschnake"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "This generally fun romp features a nicely stylized production, ample wit and laughs, and capable performances, both musically and verbally. The material admittedly drags a bit in the last 45 minutes, becoming somewhat tedious at times, but a strong first half makes this a surprisingly enjoyable time at the movies.",
      "total_reactions": 6,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "First of all, I would recommend this movie only if you enjoy musicals, charm, and sudden mood swings.  If you can accept that, I'd strongly suggest seeing this movie.  The film opens up with a catchy, bright performance of \"Into the Woods.\"",
      "total_reactions": 6,
      "user": "Justlegos"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The cast of Into The Woods is very enthusiastic, and that is what carries the film.  All the actors carry off the singing with no problems but make no mistake, the star is Meryl Streep.  The best part of the entire movie for me was Meryl's performance towards the beginning of the film when she sang to the couple indoors.  The word play was terrific.  I also have always liked the song \"Children Will Listen\", especially the version Barbra Streisand does on one of her CDs.  The rest of the songs, however, were not very catchy or memorable, and that is the one issue I had with the film.  Some of these songs might translate better live on a stage.  Chris Pine was also a standout for me, and he has an excellent singing voice.  I like Emily Blunt in everything she does.  The few children that were in the theater were antsy and fidgety, although there were moments when they were quiet and paid attention, particularly when Meryl Streep was on the screen.  The film's look (sets, costumes and makeup) is stellar.  If the songs were better I would rank it higher.",
      "total_reactions": 4,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This movical has a stellar first act, but loses its drive after the first hour. The music is absolutely extraordinary, and there is moment after sweet musical moment throughout the movie. The singers bring the voices, but the pacing is uneven and the film loses its muster after the first half is finished. The first act is filled with constant singing, but towards the end the movie seems to want to rely more on dialogue and therefore begins to bore the heck out of the audience. Good overall, though.",
      "total_reactions": 4,
      "user": "alecvl08"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "The first two thirds of Into the Woods are chocked full of great songs, memorable characters, and a beautiful world with a really captivating story. The final third of  the film, however, is executed in a sloppy way, making the entire movie feel disjointed, tainting an otherwise great film.",
      "total_reactions": 4,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "OH MY GOD, THIS FILM IS BASED ON A MUSICAL.",
      "total_reactions": 4,
      "user": "PistonHonda"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Into the Woods is just as you would see it on Broadway. The songs are catchy, the morales still stick, but the run-time is a little long. Incredible performances by Anna Kendrick, Emily Blunt, and Meryl Streep carry the film to be much better than it would be. The scenes with the Wolf and Little Red do come off a bit awkward, due to the casting of the latter, but overall the film is one I would recommend if you enjoy musicals of course.",
      "total_reactions": 4,
      "user": "ajarias96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "This film tried to tie four classic series together with a story that no one had heard. It tried to tie Little red riding hood, Cinderella, Rapunzel, and jack in the bean stalk, together... but... only 10 minutes of The Little Red Riding Hood and Rapunzel were really shown, the rest is trying to tie in both Cinderella and Jack in the Beanstalk, while the little red riding hood and Cinderella are kept in the background with minor roles. The film is a musical... these can be good to a certain point... however two hours in and you will be wishing and praying for spoken dialogue instead of singing. The film cast quite a few b-list actors and Johnny Depp as the big bad wolf (only a-list actor in the movie). The film obviously had an incredibly high animation budget but an incredibly low casting budget... with the exception of Depp. This having been said, Depp played the big bad wolf, his entire performance lasting less than 10 minutes. With a massive animation budget they could have easily created an animated wolf and cut the middle man, saving their budget, which leads me to believe they only had enough money for him to briefly appear. All in all I would recommend you watch it on netflix.... or not at all... and save your money.",
      "total_reactions": 2,
      "user": "Ansatsu83"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "This bungled mash-up of fairy-tales has some interesting insights - Prince Charming is not so charming at all, for instance, and Cinderella's step-sisters get what they deserve in the original way - but it's just so messy and accompanied by such poor acting performances that in the end it results to be almost unbearable. The songs (or THE song?) sounded all the same and their lyrics weren't clever: no rhymes, no nothing. Actually, Disney could use some good songwriters as of now (remember the 90s).",
      "total_reactions": 2,
      "user": "nicholasbert"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "\"Into the Woods\" is a very funny movie but a not so funny adaptation.",
      "total_reactions": 2,
      "user": "ECW"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "For anyone that has not seen or know anything about the musical, just know that this movie gets quite depressing!  Disney really did capture the musical as it was right from the stage, which is good but also leaves you wanting more out of a film adaptation.  The fact that there are very few spoken lines in this entire movie (since everything is literally sang from beginning to end) it does leave a bad taste in the mouth of anyone that isn't a hard-core musical fan.  The blending of the stories was great, the acting was amazing but the music does start to pain your ears after a while.  I would only recommend this movie to older Disney fans or (of course) fans of the on stage version, because that is exactly what you are getting.",
      "total_reactions": 2,
      "user": "Stevesitz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "I thought I was the musicals loving kind but turns out I'm not. I could barely sit through Les Misérables and the only reason I sat through Into The Woods was its comedic aspects. It was almost a parody at times, they didn't seem to be taking themselves too seriously, so it was funny. Not laughing out loud funny but it put a smile on my face.",
      "total_reactions": 2,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "The first half of the film is AMAZING! The probably then becomes the second half... You literally feel like the film is 5 hours its so boring. I recommend seeing this film just because Meryl Streep plays the Witch so well. But you may want a sleeping bag for the second half.",
      "total_reactions": 2,
      "user": "cascada"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Well you're not the only one who thought that this was going to be the next Les miserables just by judging on the trailers and early Oscar buzz.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "Although this is considered a musical and the singing is not bad, i think in the beginning there's just too much singing, I started getting desperate and praying for the actors to calm down and start talking for a bit. Couldn't understand the strange twist on the storyline in the last 30 min, everything collapse, I just wanted this to end and go to sleep.",
      "total_reactions": 2,
      "user": "dicedado"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Absolutely fantastic!! I believe that Into the Woods gave actors like Meryl Street the opportunity to shine, while not in an overwhelming way. What I mean by this is that her role, gave way for other actors to be noticed, such as little red riding hood, or jack. At the same time, it added to the repertoire of budding actors like Anna Kendrick, and the fabulous James Corden",
      "total_reactions": 2,
      "user": "vsheldon94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Into the Woods is definitely not as bad as people say it is and certainly not bad for a musical. It isn't fully entertaining, but rather watchable. I wasn't disappointed, but the movie is a bit too long. Overall, the movie is pretty fun for families. (B+)",
      "total_reactions": 2,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Into the woods is a fresh representation of classic fairy tales, with impeccable performances and a great soundtrack, into the woods is the best musical of the year.",
      "total_reactions": 11,
      "user": "Mockingjay18"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "This started out as a charming film interweaving several classic fairy tales together with an all-star cast.",
      "total_reactions": 18,
      "user": "Devax2"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This movie of Stephen Sondheim's musical mashes up the plots and characters from several fairy tales into a wonderfully amusing and dark entertainment (although a little more Disneyfied and less dark than the original). The cast is in great voice, but their performances (and the ability to clearly hear the brilliantly clever lyrics) make it a delight. Meryl Streep brings her authenticity to nuanced and touching brilliance as the Witch and Chris Pine's arrogant prince reveals his comic charms better than \"Horrible Bosses 2\" does. Director Rob Marshall successfully shortened it. He keeps it grounded in the humor and humanity, without resorting to dazzling cinematic tricks. Lovers of the stage show will be pleased with this spirited and smart adaptation. Note to parents: even though it's not lascivious or violent, this is not a typical fairy tale family film.",
      "total_reactions": 9,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打44实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的啊实打实大师的",
      "total_reactions": 9,
      "user": "qsfasf"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "Simply a stupid musical that made no sense at all. Please don't waste your time or money to watch!! I had rather watch two donkeys fight to the death than this crap!! They wasted talented actors for this???? Thanks Disney for screwing the storyline up and only previewing non singing scenes in the trailer!!!!!!",
      "total_reactions": 12,
      "user": "Wildrenegade90"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "This was THE worst movie I've ever had the displeasure of trying to sit through. I am usually a fan of musicals but this stunk so bad I'm afraid I'll have to take two Silkwood showers to get the smell off of me.. Don't waste your money or time on this!!!",
      "total_reactions": 17,
      "user": "thwack26"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Anyone worried that Into the Woods as a play might not translate to the screen very well: rest easy. Seeing it on a Friday night at the iconic Ziegfeld theater in New York definitely helped the experience, but this film is truly great. The casting, the sweeping visuals, the developed story, and of course the countless musical numbers. Experience on a big screen just like I did, and you will love it.",
      "total_reactions": 5,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Other than being about 15 minutes too long I enjoyed all aspects of this presentation of  Sondheim's  clever  and lyrical blending of the fairy tales we all know. The music is beautiful, the lyrics are entertaining, pointed and filled with sometimes dark humor. Having never  seen the Broadway show, the twists and turns taken in the story were most pleasantly surprising and amazing. Meryl Streep was even more outstanding than I expected and all of the actors were perfect in their roles. They pushed themselves to the heights  of their abilities.  The visual effects were amazing and on the mark. There are lessons to be learned by adults and children of all ages. Those below the age of preteen may not fully comprehend the depth and meaning but will certainly be entertained by this presentation.",
      "total_reactions": 5,
      "user": "Woody973"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "INTO THE WOODS - the movie adaptation of the hit Broadway show...",
      "total_reactions": 5,
      "user": "Cecilbca"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the best movie version of a Broadway Musical that I have ever seen.  Streep proves once again that she is the most talented actress of this generation.",
      "total_reactions": 8,
      "user": "ErockRock"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "This was not only a waste of time and money, but the singing was so bad my eight year old ask if we could leave half way through. I was really looking forward to the mash up of all the stories and believe that it is a good concept. What a disappointment!!",
      "total_reactions": 14,
      "user": "Jerad-Colorado"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "PG Rating Is A Scam! This Movie Is Not Suitable For Children/Pre-Teens Unless You Want To Destroy Your Children's Innocence! This A Very, Very Disturbing Film Not Suitable For Children",
      "total_reactions": 17,
      "user": "DannyG"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "This movie starts out as sickeningly sweet (a combination of well known fairy tales). If you know the plots, you may find this as intolerable as I did. Then it tries to get dark by killing off random characters and destroying moral values. I get it, they wanted to show us that people aren't perfect but there is probably a less confused way to do it. And When you think it's over it just drags ON AND ON.",
      "total_reactions": 15,
      "user": "Keetu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "\"Into the Woods\" is the musical adaptation of the Brothers' Grimm fairy tales interwoven by writers James Lapine and Stephen Sondheim in this film directed by Rob Marshall. The film stars Meryl Streep, Emily Blunt, Chris Pine and Anna Kendrick with music and lyrics by Mr. Sondheim. I saw the Broadway production of this property and felt then, as I do now, that Mr. Sondheim wears a crown a little too big for his 'music and lyrics\" title and talent. He is a wonderful lyricist but unlike Messrs. Cole Porter, Irving Berlin and Frank Loesser, he fails to succeed as a composer of memorable or even hummable tunes. Take away \"Send in the Clowns\" and \"You Are Not Alone\" (from the subject film) and you are left with a one dimensional writer. Just as Richard Rodgers needed Messrs. Hart and Hammerstein, so, on the other end of the spectrum, does Mr. Sondheim need  Leonard Bernstein, Jules Styne or some other fine musical composer. As far as the film is concerned, and as clever and witty as the lyrics are, the numbers are too long and, as a result, create a movie experience that causes the viewer to wish it would end at least 30 or 40 minutes before it actually does. One must also recognize the obvious intention of the producers to \"get their money's worth\" from Ms. Streep who is over utilized and, as in her role in Mamma Mia, is at her best in a non-musical setting. This is a film where the exceptionally gifted cast is placed in a vehicle not really worthy of their respective talents. I give the film a 6 rating and cannot, in good conscience recommend it.",
      "total_reactions": 3,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This is a good adaptation of the Sondheim musical. Most of the lyrics are intact and well-articulated so that you can understand them. The performances are generally strong in both acting and singing. The story line may get harsh, but no more so than the Grimm fairy tales on which it is based.",
      "total_reactions": 3,
      "user": "emkadv"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This big screen adaptation of Sondheim's classic musical softens the edges somewhat, and loses a few songs but is still great fun with a cast of big hitters (and James Cordon) on great form. Bringing together all your favourite fairy tale characters into a post modern retelling of their stories is clever and fun, but your enjoyment may depend on your fondness for the music",
      "total_reactions": 3,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "With the charm of Rob Marshall, this musical adaptation stays true to its source work and remains truly devoted to Sondheim. Over time, Into the Woods does lose its way but it is difficult to deny the triumph of Meryl Streep and Emily Blunt.",
      "total_reactions": 3,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "I... was not aware that this film was a musical until I had already agreed on going to see it. I will say, I'm not fond of musicals so this review may be a bit biased...  but man, I did not like this film at all. Meryl Streep was phenomenal, but everyone else was just... bland. Little Red and Jack were both obnoxious as hell, the princes were over the top and just lame, and Johnny Depp had less than 4 minutes of screen time...",
      "total_reactions": 3,
      "user": "slappycider"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This sweet and sour reprise of Stephen Sondheim's musical is watchable but really its more Disneyfied than recent movies coming from the studio. Emily Blunt does good as The Baker's Wife and Meyrl Streep as the Witch is very enjoyable! But tye songs are TOO long and some sequences travel on and on without notice. Not a theatre watch, but a Dvd rent.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Into The Woods es un muy buen musical pero sólo recomendable para los amantes de este género ya que se pasan casi toda la película cantando. Tampoco es una película para niños, sobretodo la última media hora que es menos de cuento, menos divertida y más oscura. La primera parte es magnífica, con un prólogo fantástico, la presencia de todos los personajes de los cuentos y un tono ameno y divertido. Lo malo es una moraleja final que se alarga mucho y tiene bastante menos gracia. Meryl Streep y Emily Blunt están estupendas. Recomendable para los amantes de los musicales y los cuentos que no son lo que parecen.",
      "total_reactions": 3,
      "user": "pjcritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I don't usually give straight \"A\" reviews to musicals, I enjoy them and I appreciate the hard work but never fall in love with them, indeed, I didn't fall into one since \"Chicago\", I enjoyed \"Into the Woods\" and I appreciated all the hard work, but most of all, I fell in love with it.",
      "total_reactions": 3,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "With a creative dark curse, Disney is brilliant to combine the fantasy of Cinderella, Jack the Giant Killer, Rapunzel and little red riding hood into one film with some surprising plot development and ended with an inspiring note - to make our wish to come true, it needs efforts. However, the first half of the story is well connected based on its rich materials but the second half shows some pacing issues and the existence of questionable moral etiquette stops it from becoming a classic of the genre as compared to Les Miserables. The great musical elements, the spirited performance of the superior cast, stunning visual effects and a number of heartfelt moments do help the film stands as an enjoyable musical flick, even if it doesn't work entirely as a whole.",
      "total_reactions": 3,
      "user": "michael1208"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This is definitely not a movie for people who don't like musicals; some of the trailers didn't make it clear that there would be a lot of singing, so if you didn't already know that Into the Woods is a musical it could be a bit of a surprise.  There were some plot elements that didn't quite make sense and left me with major questions, but overall I found the plot engaging and quick.  It was familiar enough from the storybook elements that it was comforting, but contained enough twists and unexpected collisions of storyline that it was fresh (for someone like me who walked in not knowing anything about the stage production).  There was enough character development that it felt like most characters ended their story arcs in reasonably satisfying ways.",
      "total_reactions": 3,
      "user": "heatherm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Great 2/3rds of movie then after witche's spell broken and grand parade, all went on a bit too long, got a bit morose, too deep and meaningful for my two 8 year olds.  In my opinion a good movie in my book will leave the audience sitting in their seats for 30-60 seconds to reflect on the movie however the whole cinema couldn't wait to up and leave.",
      "total_reactions": 3,
      "user": "haggiem"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "This movie shows what film was really made for. It takes us through the genres and the art of the world we live in. And just gotta say, most lessons teaches in this film.",
      "total_reactions": 3,
      "user": "Joelsanders13"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Despite Into the Woods having a plot of imperfections and an unnecessary extra hour, this movie is still everything you loved about fairy tales as a child. You didn't care about the extraordinary style and you didn't care about how bogus the stories were. Seeing all of these folklore legends in one film, singing catchy songs and almost never getting out of trouble, was definitely something enjoyable that did bring up an unexpected sense of nostalgia. Dion Beebe's cinematography, however, was my favorite aspect of the film. His eye for color and movement is superb, and should be appreciated more than he has been in the past. Yes, he has a deserved Oscar for Memoirs of a Geisha, but I think he deserves recognition for more than just that film and Chicago (another musical collaboration with director, Rob Marshall).",
      "total_reactions": 3,
      "user": "joshcthomas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "A most entertaining movie adaptation of a most artistically satisfying stage musical.  It blends darkness and humor seamlessly and succeeds on all levels.  Most of the performances are first-rate, even from those actors who are not necessarily known as singers.  I can't think why this is not getting a higher average score.",
      "total_reactions": 3,
      "user": "lamonddoree"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "This was an incredibly **** movie and it was unbearable to watch. None of the characters had any soul or depth, the music was terrible, loud, and jarring, and the storyline was stupid beyond belief. Definitely do not waste your money or time on this.",
      "total_reactions": 22,
      "user": "Unworthy"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "This movie would have been great in 1975. Not great in 2014. Compare this to say the good animated movies of the year and it doesn't come close. Lego,  Big Hero 6, and a handful of others have more spirit, more humor, more cleverness in 10 minutes than this full movie. People WANT to like this movie...it has a nice enough theme and ending. But it is a stale concept and has been done a thousand times before.",
      "total_reactions": 14,
      "user": "Proteus"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "All fine actors doing great work.  Marshall wisely cut some songs/material from the second act which whenever I've seen it on stage is \"overdone.\"  Great singing and wonderfully shot.  Perfect, no.  Fun and enjoyable and able to relax knowing it will never go off the rails, yes.",
      "total_reactions": 7,
      "user": "Harmiclir"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Incredibly well crafted transition from stage to film. Incredible casting, beautiful imagery, and paced properly. One of the best musicals of this generation and one of the more enjoyable films of 2014.",
      "total_reactions": 7,
      "user": "AmongstYou"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "When Bernadette Peters was not cast as the witch, that should have been my first clue. The actors fall flat. Two many pivotal scenes are left out - especially in Act 2. If you have not scene the stage version video you may be okay. Purists will have a problem with it. A big let down.",
      "total_reactions": 8,
      "user": "Jkingsmill"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Into the Woods is an interesting film. It does what many other fairy tales never even think off. It does not have a happy ending but that's because it is not suppose to have a happy ending. The theme of the film is hope even in the darkest time. Sure some of the characters are killed off awkwardly and the tone is uneven but the acting especially by Meryl Streep is incredible and the soundtrack is awesome. Overall this film soars.",
      "total_reactions": 4,
      "user": "MovieFan123"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Quite a few of the songs are fantastic independent of the movie.The movie is visually beautiful and entertaining but it doesn't mesh as well as I would have liked. Character motivations and development feel very condensed. The movie would have worked better solely as a drama or a comedy, but it is neither.",
      "total_reactions": 4,
      "user": "Trev29"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Being extensively marketed for kids, it is good to find that Sondheim’s musical has been neither dumbed down nor Disneyfied. Taking four well-loved fairy tales complete with linking device and setting them to music is actually quite a bold concept which, for the first ninety minutes at least, works very nicely. In fact, the visuals compliment the score no end which, if listened to cold, is actually fairly resistible without its context. Only one song can truly be considered a hit outside of its theatrical origins and that is ‘Children Will Listen’, but other songs are still impressive. It helps that most of the cast make a good stab at singing even if one recognises their limitations. Meryl Streep, however, is in a class of her own both musically and dramatically. Notching up her 19th Oscar nomination for her ‘witch’ she eclipses everyone with impressive ease. Chris Pine surprises as Prince Charming and he belts out one of the best staged songs, ‘Agony’. Anna Kendrick as Cinderella, Emily Blunt as The Baker’s wife and James Corden as the Baker all have their moments to shine as does Johnny Depp as the Wolf. His rendition of ‘Hello Little Girl’ (which shows that Disney have certainly moved with the times, since Snow White sang ‘Someday my Prince will come’) is certainly open to suspect interpretation!",
      "total_reactions": 4,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "I'm a big fan of this musical. I saw the original production on Broadway years ago and have never forgotten it. So I had my fingers crossed for the film. It didn't disappoint! The performances were strong throughout both dramatically and vocally. Yes, it takes a dark turn in the second act, but that's the point. Life is not a fairy tale and there is no happily ever after. For some, they seem to think the life goes out of the piece at that point. For me, that is what gives this play its substance. I thought the feature time worked. Some of the more dramatic moments may have felt a little rushed, but for today's attention challenged audiences, I can live with the compromise.",
      "total_reactions": 4,
      "user": "smaher"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "So far one of the best musical adaptations I've seen. Amazing performances, especially by Meryl Streep and Emily Blunt. Streep takes the role of the Witch and creates fireworks with it, performing Stay With Me and Last Midnight with her all. Emily Blunt is the heart and soul of the film. The rest of the cast did a great job, one of the best ensembles of the year. Most of the numbers are cleverly sung and written, with some being emotional, such as \"Agony\", \"Stay With Me\" and \"No One is Alone\". Sondheim is an acquired taste for people, as he doesn't compose tunes for strict enjoyment and not only for audiences' expectations but for meaningful messages as well. The film feels magical and the result is great. One of the best of the year. My only issue was the sudden shift of tone in the film to the second act didn't feel as subtle.",
      "total_reactions": 4,
      "user": "Nick052299"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "The music, acting, scenery, and pretty much everything else was great in this. It gets kinda dark halfway through, but the movie has quite a bit of good humor. It's the best musical film since Les Misérables.",
      "total_reactions": 4,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "A movie with a group of well-known characters played by well-known actors and actresses, they were not just picked because of their fame. Each actor had to have the ability to sing, for this was a Broadway musical.  Some, such as Daniel Huttlestone, Lilla Crawford, and Anna Kendrick, had already worked on a musical, and Kendrick had been in Broadway musicals before. Kendrick being cast as Cinderella with brunette hair was a huge surprise because Cinderella has always had blonde hair, at least that’s what the Disney version had. The original Grimm story never stated her hair color, which is what the film was basing the plot on. Also, in the fairytale, Cinderella did have a golden slipper, as does the Cinderella from the movie, and that shoe is used in the potion, a key ingredient to the plot.",
      "total_reactions": 4,
      "user": "anneke14"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "On December 25, 2002, I went to see the movie musical “Chicago” and during the two weeks after that I went back to see it 4 times. On December 25, 2006, I went to see the movie musical “Dreamgirls”, fell in love with Jennifer Hudson and the movie, went back to see it 6 times and bought the DVD. In 2009, on December 25, I went to see the movie musical “Nine” and have never seen it again. In 2012, December 25, I went to the opening of the movie musical “Les Miserables” and returned to see it 4-5 times and watched it on HBO a couple of times. Today I went to the opening of the movie musical “Into The Woods” and won’t be seeing it again.",
      "total_reactions": 13,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "Individuals cursed in this forest where everything lives in stories and tales.",
      "total_reactions": 5,
      "user": "WDS_Connections"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "It was... an interesting movie. I'm not sure how close the movie stayed to the play, so perhaps the play is more to blame than anything, but overall the movie just felt jumpy and a bit bi-polar. The characters go through very wild and rapid mood swings, which might work better in a play where there are very obvious breaks, but in a movie it just felt weird.",
      "total_reactions": 3,
      "user": "Rtheom"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "From Broadway to the Silver Screen: Why can't some musicals make the leap?",
      "total_reactions": 1,
      "user": "spizer511"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "INTO THE WOODS lacks a concrete conception to make it really jump off the screen. The cast is perfect, the costumes and set design quire wonderful, but director Rob Marshall shoots the entire film in medium shot as if directed for television. He has no real foundation to work from which is truly unfortunate since he as amassed such talent. You watch the film wondering, \"Why?\"",
      "total_reactions": 4,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "All I can think is now, I'm going to have to carefully review Disney movies for my child to watch. I'm very disappointed from a certain song that wants to devour a lil girl. In words you do not want your child to hear. Lets just say, if you was ever in another room and you heard that song. You will be screaming to turn off that perverted show or movie.  Everyone I watched this movie with, can see that song for years to come showing up in shows like \"Criminal Minds, Law and Order SVU\" to name just a couple. Worst part is you just know, that their are now sexual predators playing that song over and over. Sickening song.  But apparently the sexual predator vibe is ok, even in a Disney movie now. Also, a home-wrecking scene of literally a prince cheating. Literally cheating on his wife with a married woman. Then the whole ordeal of a song of  who was to blame for cheating? Child appropriate? Somewhere in there, you have a witch making a woman ten months pregnant and out pops a baby, in the same day From the first Min to the last, this was not a child appropriate movie..  How was any of that appropriate for what should have been a child appropriate Disney Movie?  I'm so disappointed in Disney. The brand is known for such great quality family entertainment, that is child appropriate. If your going to do a movie like that, create a new brand to go with it. For example, Nora Roberts doesn't put her name under her Eve series. Instead she goes by J.D. Robb. Still her but the brand, you could say changes.  Cause you just made a ton of people extremely wary of the Disney brand now. And rightfully soo. Very disappointed.",
      "total_reactions": 3,
      "user": "bartylak"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "It's theatrical and fun, but the movie really does drag on after a while... like almost any play I don't get the screaming and stupidity, but the production values are really good and the songs are almost tolerable.",
      "total_reactions": 2,
      "user": "vgmkyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "Several classic fairytales are tied together by the story of a baker and his wife hunting down items for a witch so that she will grant them a child. It's not out of the ordinary for a Disney fairytale movie to have musical bits. Their classic animated films like Sleeping Beauty and Snow White are known for them. This one is actually a full musical.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "As a much anticipated movie adaption of a famed broadway musical, INTO THE WOODS struts in its “dark treatment” of the classical fairytales, namely: Cinderella, Little Red Riding Hood, Rapunzel and Jack and the Beanstalk, and panders to a more adult-leaning demography. As a matter of fact, it turns out to be really dark, but only because the happenings occur inside the ill-lit woods most of the time, as to the story itself (or maybe pregnancy is a bit too un-fairytale-sy and killing off a main character is a bold move), the noted outlandish elements are conveniently compromised by its PG rating, a well-expectedly avaricious manoeuvre from the money-seeking corporate to cash in from as many viewers as possible at the expense of the project’s artistic essence. Altogether, Rob Marshall’s newest star-studded musical is a ragtag mess fails to connect with audience who are not the devotees of its theatrical archetype.",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I thought the boy actor was excellent, you can sense that from the first bit where he starts singing vs the baker's wife.  He gives the movie energy.  Too bad the story is super lame after 2/3rds in.  It has a twisted scene that shoots the whole story in the foot.  No wonder Disney quickly had a Cinderella followup in theaters just in case they would upset their fanbase.  Anna Kendrick was a strange choice and I'm not sure she fit in as a gorgeous Cinderella, not saying she's not pretty, but not the best choice for this role.  Emily Blunt was a bit boring when she sang and she's giving me the eye every other scene she's in.  She's supposed to be a baker's wife and she gives off too many looks and signals to the audience, not the best acting that I've seen her do.  The witch and the Repunzel had some strange lyrics to their songs.  She is not her daughter, and that dragged out more than it should have.  The misunderstood witch was frustrating rather than having her be good or evil, they kept her in the middle pretty much saying she's just really selfish.  It's a real shame, almost thought we finally got a good Newsies followup, but instead we got a misunderstood evil movie with some liberal agenda themes.  A lot of the actors and actresses were really good apart from most of the well known ones.  It almost gets annoying to see so many well known actors and actresses show up, would have preferred a brand new cast.  And the new actors and actresses killed it, but the well known ones didn't.",
      "total_reactions": 0,
      "user": "BloodyRandy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "I loved Into the Woods. Hilarious, touching, and fantastically musical, the film is a wonderfully entertaining take on the fairy tales of old and their worlds, while adding in a nice twist with the trademark moral of the story. First off, the music is fantastic. Both the musical sequences and score are beautiful and sung perfectly. The acting from Anna Kendrick, Emily Blunt, and Meryl Streep, is very good. Additionally, the direction from Rob Marshall is very good. Without it, this film would have been DOA due to the mashup of various stories. The pacing is good, though it can be a touch frenetic in the beginning, but it was far from detrimental. The script is good and really does a good job balancing everything. The cinematography and special effects are great and capture some seriously beautiful shots together. Into the Woods can also be truly hysterical as it gleefully makes fun of musicals and the fairy tales it incorporates. However, the piece I loved the most was the ruminations on life (and the dangers hidden within), love, loss, grieving, and parenthood. This is where the film is a home run success and truly becomes a major success. Into the Woods can be weird at times and it requires a willingness from the audience to go along with it, but on the whole, it is a funny and truly emotionally moving musical that has fantastic music to go along with it.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "This movie is awful. It was advertised as a kid's movie but it's clearly not. The plot makes no sense from a kid's movie perspective, it's disjointed and the second half is dark. It started off kind of fun and I thought maybe there will be some Robin Hood men in tights kind of parody going on here but that quickly fizzled out and turned into a mess of half baked philosophical musings about human desire, right and wrong and fairy tale wishes.",
      "total_reactions": 0,
      "user": "MightyThor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Los musicales siempre son dificil de evaluar, visualmente cumple, la música no se diga, la actuación histrionica como se espera, pero la duración creo que duro media hora más de la cuenta.",
      "total_reactions": 0,
      "user": "chepod8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Although this film is interesting and filled with an array of stars, after the first half its starts to fizzle and feel rushed, almost as if there was an inability to keep the actors themselves interested in the story they were portraying.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "This was probably the worst movie I have ever seen.  I was trying to stay with it.  Even when my wife starting sweeping the floor and asked if I would fast forward.  My two young adult children gave up.  I stayed with it because I really wanted to figure out where this story would leave. I finished it on my one. So this is Broadway?  Good luck.  Urban decay?  The musical score was not only irritating but it had no musical anything.  Reminiscent of Will Farrell talking about singing in the movie Elf.  Whatever sordid point the writer was trying to make, he lost it on me, and I am pretty abstract.  I can watch ANYTHING.  What perplexes me is the high reviews and acclaim given to this mess.  What is most unusual is that they had a big budget, great talent, and incredible scenery.",
      "total_reactions": 0,
      "user": "draperbart"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Take bunch of  fairy tails and put them in one movie, then from something great make something absolutely stupid. Brothers Grimm are turning in their graves. Characters are horrible, story is horrible and this is not musical because there is no songs in this move. Whole movie is recital, a bad recital..",
      "total_reactions": 0,
      "user": "SpiRo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "An interesting musical filled with interesting stories entwined together, an all star cast, catchy songs, and Disney magic. Despite all the musical numbers, the movie still had an interesting story that added some dark material added into the classical fairytale stories we love like: Cinderella, Little Red Riding Hood, Jack and the Beanstalk, and Rapunzel. Man, it even has some Brothers Grimm material added to the Cinderella story. It's funny in some parts and heart wrenching in others. One of the best musicals of the year, and a fun family musical for everyone to enjoy.",
      "total_reactions": 0,
      "user": "jacob4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "Into the Woods doesn’t stand out in any particular field. There has passed much time since I saw a nice musical-movie, and that’s something to give it credit for. I think it’s original the idea behind it of reuniting all of those famous children-story characters, and I also think that the music and lyrics are pretty well made and nice to listen; but besides that and the famous actors in it, I didn’t like the film that much. It started pretty well, with a nice all-characters-introduction song, but from there, it just went down. Though the acting is good, the scenarios, the special effects, the characters, it all really looked very unreal, and the originality needed to make that movie should have been a lot more. If the film would have ended in its first half, it would have been awesome. The nice, maybe clichéd, happily ever after ending, where everyone gets what they want; but sadly, it continued, stopped being a Grimm’s mashup and started being Disney’s, and all that was just awful, they ruined the story. I was bored almost during all the second half.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "The film deserves a lot of credit for the singing. It was great. At the first part of the movie I was having a good time. I didn't think it was a blockbuster hit, but I was enjoying it. Then when I thought the movie would end, it kept on going to this unnecessary plot twist that really ruined the movie. If the movie ended when it should have, I would have given this movie an 8 on metacritic because it was enjoyable at the beginning. Horrible pacing can really ruin the movie for you. So I would not recommend this movie because it's just too long and it's shame that this movie could not deliver with some very fine actors and singers. Even if you love musicals, you might not appreciate the end.",
      "total_reactions": 0,
      "user": "iluvsports"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "Thought it would be worthy of a good musical but the way they made it didn't make it impressive to me, and there wasn't enough entertainment in a portion of the latter",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "Walking into the theater, I was completely unaware that this was a musical. And after the underwhelming Les Miserables, I had my share of qualms as soon as I heard the first musical number commence. But after watching the movie in its entirety- as the credits began to roll, I just knew that this was one of the best movie musicals in years. Notably, Streep and Blunt shine- while Sondheim's humor, wit, and melodies captivate. One of the better movie experiences I had in 2014.",
      "total_reactions": 0,
      "user": "lomeli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "This film is really too bad ... it wrestles with several twists history ... the effects are good ... but the inexperience of young players leaves much to be desired, that hurts.",
      "total_reactions": 0,
      "user": "romaporelarte"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 1,
      "text": "I enjoy musicals.  I like a great deal of the actors in this film...just in other films.",
      "total_reactions": 0,
      "user": "Markham2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Stephen  Sondheim and James Lapine, had a good collaboration with the characters history into a new story. I actually like the lyrics, and sung some part of it while watching.",
      "total_reactions": 0,
      "user": "randomthoughts3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "As this did not expect it of \"Into the Woods \" , the characters in stories mixed in a film; it is an amazing idea , do a musical with that idea is a good idea , a good deal , it is good idea , but it seems very boring , do something good next time.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "I've never seen the original play, but I thought the movie was very good. Meryl Streep was fantastic (when is she not?)  and despite being in it for six minutes, Johnny Depp was very good. The songs were catchy and the movie is a tribute to older fairy tales which means it will probably be too dark for young children. But for an older audience ( I'd say 10 and up) it's very enjoyable.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "I find it very entertaining because it has lots of singing and dancing. I just enjoyed every scene of this movie.",
      "total_reactions": 0,
      "user": "james417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "Great sets and special effects, but shallow characters and shallow Macguffin (plot driving device).  Content is not appropriate for children, mid to early teenager maybe, but not kids.  It shouldn't have the Disney castle before it.  \"Songs\" are very simple, anyone can make simple rhymes with a sing-song-voice.  No memorable tunes/melodies exist.  Not sure why critics like this unless it is the angst filled ending.",
      "total_reactions": 0,
      "user": "bikerjohn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 7,
      "text": "If one can get rid of the entire musical thing, maybe Into the Woods will be better than it is right now.. but for now, we got to get used to it being a musical.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "This is a very good adaptation of Stephen Sondheim's original musical. I am very familiar with the stage play and this movie mostly stay's faithful to it's source material but some of the songs I would have liked to included were not. Meryl Streep does a great job as the witch and let me just tell you that this is NOT a children's musical. The moral of the musical is be careful of the things you wish for because not everything becomes happily ever after. The singing and acting is fantastic and this is definitely while not perfect this is for sure one of the better movie musical adaptations I have seen with a fantastic and very real message.",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2016
      },
      "score": 5,
      "text": "With a forced premise and an extremely theatrical module, Into the Woods leaves something to be desired. In addition, most of the film's songs are weak, saving the prologue \"Into the Woods\", \"Your Falt\" and Meryl Streep's unmistakable vocal performance, \"Last Midnight.\" Most of the cast is reasonable, but it's in the cast that has what saves the film. Meryl Streep is completely amazing in the skin of the Witch, Emily Blunt excels in her performance and Johnny Depp does well in both her scenes from the film. In total, the Into the Woods is a heavy, forced and silly film, but worth for its technical production and the cast.",
      "total_reactions": 0,
      "user": "lucbevibrasil"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 8,
      "text": "This movie is absolutely enjoyable. The characters in this film were colorful and entertaining which made the film a joy to watch. Yes, there a lot more singing than I'm normally accustomed to in movies. However, I also understand that this movie is based on a musical. Overall, the plot was pretty decent, the characters had great chemistry, and film went by at a pretty normal pace. I also like the somewhat dark tone this movie contains as we see the characters paths become intertwined. If you haven't seen this film, I recommend it. If you have kidsand they haven't seen it, they should as well. This film is fun for both kids and adults alike. :)",
      "total_reactions": 0,
      "user": "rei07"
    }
  ]
}