{
  "mc_avg_user_score": 7.2,
  "mc_metascore": 74,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "Invictus",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 139,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 7,
      "text": "An excellent movie, with excellent performances, both by Morgan Freeman and Matt Damon. I liked this movie, and I don't even like rugby. A good sports movie.",
      "total_reactions": 3,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "I think the acting in this movie from Morgan Freeman and Matt Damon really save this movie for me. It isn't a bad movie at all but it certainly could have been better. I don't have too much of a knowledge on the actual history (or rugby even) and I didn't feel like I finished the movie with much more than I started with, which is kind of disappointing.",
      "total_reactions": 1,
      "user": "Longo12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "Just reread William Ernest Henley's poem Invictus. Earnest indeed. It makes me think that the movie could just as well have been title Dickhead. I know that's unseemly but it does seem true.",
      "total_reactions": 2,
      "user": "ms33"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "This is a great movie! Anyone and I mean ANYONE who thinks that is not a powerful story about overcoming racial barriers are completely close minded. I am a white male in my middle age and this is the kind of thing we should be teaching our children! Learn from it, grow from it and for god sakes change your pov!",
      "total_reactions": 1,
      "user": "Kayden"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "Confusingly and utterly dry and boring through most of the movie. Morgan Freeman does an excellent job as Nelson Mandela but Invictus fails to capture any passion or emotion at all feeling dead and boring the entire way through.",
      "total_reactions": 1,
      "user": "YOLO"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "It's inspiring to see that having spent a life in prison, a noble, coloured person could rule with such dignity and respect for his captors.  This would be a great movie except for 1 major flaw; it's hard to believe that the escapee character played byTim Robbins in the prequel \"The Shawshank Redemption\" could become an international rugby player without attracting  the attention of the criminal authorities. And in the original movie, they fled to Mexico; not South Africa.",
      "total_reactions": 0,
      "user": "mark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Un bel film, senza dubbio. Morgan Freeman e Matt Damon sono fantastici, specialmente il primo, che impersona Nelson Mandela come nessuno avrebbe saputo fare meglio. Leggermente noioso in alcuni frangenti.",
      "total_reactions": 0,
      "user": "god-amaterasu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Good film overall but the rugby sequences are piss poor. They actually manage to make Jonah Lomu look small (compared to his actual size) and the story is very Hollywood, and a bit far removed from what actually happened behind the scenes. However - the message of David vs Goliath is aptly portrayed in a good enough fashion.",
      "total_reactions": 0,
      "user": "beelzie14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Ultimately surrenders the depth and conflict of South African race relations to a sports game, which is disappointing given the performances by Matt Damon and Morgan Freeman, and the direction by Clint Eastwood.",
      "total_reactions": 0,
      "user": "J-Shap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Clint Eastwood dramatizes the true story of Nelson Mandela's unique method of uniting his country- through a South African team's victory in Rugby's World Cup. Brilliant performances by Matt Damon and Morgan Freeman, masterfully directed by Clint Eastwood. Superb.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "A movie meant to inspire but has very little. While the performances were above par, the choppy editing and clumsy ending stop it from becoming emotionally gripping.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "First off, this is a 9.75 out of 10. Near perfection. Story is remarkable. A great true story. Acting is Really good. Morgan Freeman is always good, and Matt Damon gives one of his best performances. I think they both got screwed. Seriously, Morgan had some competition, but honestly Matt had no competition. Score is also pretty good. Overall, this is a remarkable true story, and one of the best sports movie. Everyone should go, and watch this movie.",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "\"Invictus\" is a very overrated film. There's nothing special about Freeman's performance, and many scenes drag on and are ultimately pointless in the context of the story. Matt Damon is the lone bright spot, but even his performance could have been more furbished.",
      "total_reactions": 0,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "I had heard a lot of negativity about this one coming into my viewing of it from those close to me, so my expectations were quite tempered. Yet, I came away quite pleased. The film is as powerful and stirring as it should be given the subject matter and I thought that material was handled gracefully by the sure handed Clint Eastwood. Morgan Freeman and Matt Damon were both impeccable as Mandela and Pienaar, respectively. A film that shows that genius behind Mandela's pushing of success in the 1995 Rugby World Cup for South Africa and how he used it to unite a long divided nation, this one serves as a very good history lesson for those who are unfamiliar with the story and serves as great entertainment as well. Overall, Invictus is a very good historical sports film with fantastic performances that really make the film. You can really feel the tension throughout and it all culminates beautifully at the end. The only thing that makes this one better is that it's true. All-around good film.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2012
      },
      "score": 5,
      "text": "Good, but could have been so much better. Morgan Freeman was shining as Nelson Mandela. Unfortunately, this performance was wasted on what turned into a typical, cliched sports movie. I understand that there was more to the story than the rugby team. But none of that emerged. It was simply mentioned while we watched Matt Damon and company go through the ups and downs of winning and losing games. The strong acting saves Invictus from being a huge and total disappointment.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Invictus is a movie about inspiration, leadership and overcoming adversity on so many levels. Matt Damon and Morgan Freeman played their parts excellently, even with the accents. The plot and script were both very well written. Even the 10 minute rugby scene had me on the edge of my seat.",
      "total_reactions": 0,
      "user": "cheeseberger11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "A very endearing movie, and very moving. With the recent death of Nelson Mandela, it's nice to see a very accurate portrayal (by Mr. Freeman), and a feel-good movie about teamwork and country pride.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Invictus is invigorating.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Morgan Freeman  has been starring in Clint Eastwood in many films like(  Unforgiven , Million Dollar Baby)  and yet stars again in another  film  by clint eastwood. But in this film  Freeman is at the top his game in playing nelson mandela a role that he was born to play an order to  honor Mandela. All though i never thought that Eastwood's soccer film is not not over ratted its a crowd pleaser. the fact that it is based on a true story its touching ,epic , powerful. the acting is good , the cast is good whats not to like. Grade A+ ( KEEP MAKING GOOD FILMS CLINT !!!!!!!!!!!!!",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "This movie just shows how an entire nation can rally just from a sports team. Morgan Freeman did a superb job along with Matt Damon.  In my opinion, the rugby sequences were a bit dull, but other than that the movie is well done.",
      "total_reactions": 0,
      "user": "emlugo123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "I personally enjoyed the movie, however at times this movie can be pretty slow-paced. You really only see like two matches in the movie but this movie isn't meant to be a sports drama, more like an inspiring drama.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2016
      },
      "score": 3,
      "text": "i was looking for a good sport movie. this is not a sport movie at all, they should remove that tag. this is a bad history film about racism. never seen Freeman this dull (okey maybe in Wanted).",
      "total_reactions": 0,
      "user": "The101PowerCell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Invictus is what every rugby fan should be watching today, tomorrow, and the next day afterwards. Because no one is able to understand the truth of Invictus, this movie can be a pain to walk through at some point.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "At its very essence a classically Hollywood, ultra-populist, inspirational underdog sports movie--and a well executed one at that.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2016
      },
      "score": 0,
      "text": "The most boring film i've ever seen. Was supposed to be inspirational but it was just dull and it made no sense. Felt like it was far longer than it actually was.",
      "total_reactions": 0,
      "user": "Thisperson"
    }
  ]
}