{
  "mc_avg_user_score": 6.7,
  "mc_metascore": 54,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "Jackass Presents: Bad Grandpa",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 136,
  "mc_pro_critic_reviews": [
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 83,
      "summary": "Sometimes it's a delicate comedy-drama with Oscar-worthy performances and touches of \"A Streetcar Named Desire.\" And sometimes it's a foul-mouthed \"Candid Camera\" full of poop jokes and starring Johnny Knoxville in old-man makeup."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "There’s a restless inventiveness to many of the gags that are matched only by the outrageousness of their surroundings."
    },
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "In the few moments where he's left to prank people on his own, Bad Grandpa doesn't treat him like the clichéd potty mouthed kid out for shock value. Instead, he uses his childlike innocence to make the adults more uncomfortable than his grandpa's raunchier shenanigans ever could."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "Rude, wrong and laugh-till-you-snort funny, Jackass Presents: Bad Grandpa not only stands as the best installment (by bounds) of Johnny Knoxville's hidden-camera franchise; it's one of the sharpest comedies of the year."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "It’s the kind of outrageous comedy that you might even take your folks to, though probably not your kids. Say what you will about Harmony Korine and his demented geriatrics, at least they take their trash seriously."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "For all the fecal matter flying around, and all the dick jokes, Bad Grandpa turns out to be an act of redemption: It’s the anti-Borat. And for all its flaws, it might just be the most heartwarming movie of the year."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "It’s hard to score big laughs with hidden-camera material these days because there has been so much of it since the “Jackass” TV show, but Mr. Knoxville and his young sidekick still land a few jaw-droppers."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "It's amazing what a little story and a little substance add to a movie. It might not be a giant leap for mankind, but it is a small step for one old man."
    },
    {
      "critic": "Matt Singer",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Though the plot is predictable, individual scenes (and individual targets) are anything but. In the film’s best moments, it’s more than funny; it’s exciting, and almost as daring as its indomitable lead actor."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 70,
      "summary": "Even at its low ebb, the movie effuses an infectious, mischief-making joy."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "At the end, when the grandson, in drag, enters a little-girl beauty contest, the movie far outdoes the crowning moment of \"Little Miss Sunshine.\" But most of Bad Grandpa lacks that delirious mad kick of surprise."
    },
    {
      "critic": "Kyle Ryan",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 67,
      "summary": "No one will ever mistake the Jackass franchise for good cinema, but it never aspired to that. It was always about allowing the gleeful anarchy of the TV series to escape the constraints of television — to be more outrageous, gross, and profane than the FCC would ever allow."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Is Knoxville going soft on us? Nah. Bad Grandpa is still the f***ed-up family movie of choice, especially if your family has done jail time."
    },
    {
      "critic": "Bill Zwecker",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Bad Grandpa obviously is not for everyone, but Johnny Knoxville and “Jackass” fans will eat it up."
    },
    {
      "critic": "Steve Rose",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Sacha Baron Cohen's \"Borat\" set the bar very high for this type of narrative-driven prankery, and in comparison, Bad Grandpa comes across as disjointed and aimless."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Some of these gags are hilarious."
    },
    {
      "critic": "Simon Crook",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "True to the Jackass formula, some gags come off better than others, but there's some doozies in its midst."
    },
    {
      "critic": "Dan Kois",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie itself is not unsatisfying, though it’s less fun than previous Jackass films, and has a worse title."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "In structure and concept, the film resembles the faux-documentary “Borat,” with the distinction that the cameras here are all hidden. And that is where the film falls down and can’t get up."
    },
    {
      "critic": "Peter Hartlaub",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "The uneven result is definitely not for prudish moviegoers, definitely funny for everyone else, and even approaches poignancy in one or two scenes."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "By Jackass standards, Bad Grandpa is benign—it’s neither as fun nor as thrilling as watching Knoxville play tetherball with a beehive."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "An almost sweet sensibility emerges by the end of Bad Grandpa. Young Jackson Nicholl is a real find: The kid can really hold his own against Knoxville’s master pranker."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "As Jackass japes go, though, Bad Grandpa was better in concept and in its short, punchy TV commercials than it is as a feature."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "There are a handful of brilliant set pieces, including a scorched-earth attack on child beauty pageants. But this exercise in wink-nudge bad taste simply leaves a bad taste in your mouth."
    },
    {
      "critic": "Ashley Clark",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "There are a couple of bawdy sight gags that hit the mark, although the outtakes in the end credits provide the film’s funniest moments. The cast and crew appear to have had a ball making it, at least."
    },
    {
      "critic": "James Mottram",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "Most of the gags fall flatter than a Knoxville belly-flop."
    },
    {
      "critic": "Dave McGinn",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "Johnny Knoxville is now 42, and he’s clearly torn. He still wants to be a Jackass, but in a movie with an actual story that offers something even slightly more substantive than cringing at other people’s self-inflicted pain and humiliation."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "This whole movie is pretty much a mental colon blow."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 12,
      "summary": "A choppy, feature-length progression of crude, predictable gags, the film plays like a variety show, and yet its main attraction is barely funny enough to warrant his own brief sketch."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "though the premise seemed interesting, and the trailer is hilarious, I have to say bad grandpa is one of the worst films I've watched in my whole life. As a Jackass film, it's less funny than it's predecesors and the \"story\" is completely pointless; as a regular comedy, it's to vulgar and crude. This means bad grandpa stands awkwardly in the middle, with the kind of gags that will make you roll your eyes in shame, and none of the daredevil carisma that the jackass cast usually have. Giving it a 2 since the premise is interesting, and some of the sketches are pretty funny.",
      "total_reactions": 2,
      "user": "melchaios"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "I really wanted to like this, but the trailer gives away the entire film. Literally. All the gags with none of the artificial storyline  taking his grandson to North Carolina to his deadbeat dad. The scenes are cut short and unlike Jackass, you don't really get that many reaction shots from unsuspecting accomplices. There are some, but not enough. It all leaves you with unfulfilled as the there are few new unseen surprises (Irving in the male strip club was pretty good, although repulsive).",
      "total_reactions": 1,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2014
      },
      "score": 3,
      "text": "Funny but i don't know why they needed to add a story. I feel like it was a waste and kind of ruined the funniness of the skits. I spent most of the movie cringing not from how funny or uncomfortably funny it was but because the story was so terrible.",
      "total_reactions": 1,
      "user": "cvasq008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Bad Grand Pa one of the most disgusting movie I seen as well as disturbing, It feels like a very long youtube prank video just made into a movie mixed with Hidden cameras. If you like seeing an old man act disgusting like suck a fake fish with a **** actuated to it then by all means this is the movie for you even though it is Johnny Knoxville dress old the pranks they do are so upsetting it was just stuff we did not need to see. Even though they say it is hidden cameras on the prank scenes some parts still look scripted. Overall you'll see balls dicks poop and more in this Disgusting film most critics called a good but if you know what Comedy truly  means then you will understand this review truly a 0 out of 10",
      "total_reactions": 1,
      "user": "VampireRawr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "The gags and the movie overall was very funny, but my only complaint is that the pace of the movie was too slow. They tried to squeeze a plot in there, but to me it just didn't really fit. They should just stick with the gags when it comes to Jackass movie.",
      "total_reactions": 3,
      "user": "arseniic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "Probably the most outrageous comedy of the year. Watching Johnny Knoxville as Irving Zisman pranking various strangers is side-splittingly hilarious at times. A few skits fall short and I'm not entirely sure that all of the people being pranked weren't in on the joke, but for the most part it is a very hilarious movie.",
      "total_reactions": 4,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "One of the funniest films I've seen for a while, definitely recommend for teenagers but adults would most likely find it stupid, the movie wasn't the same as any of the other Jackass movies, but this isn't a Jackass movie, although there weren't many dangerous pranks there were still a lot of hilarious moments from the team that is Knoxville and Nicoll.",
      "total_reactions": 2,
      "user": "epicluca"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "A movie does not necessarily always need to contain cinematic value to be considered good, and that is what critics seemingly fail to understand every time.  This one, though immature at times (for all the better), is uproariously funny.  Even though Bad Grandpa is far from Oscar material, it is fun to sit through and watch for a good laugh in the hustle of everyday life.",
      "total_reactions": 2,
      "user": "AKreviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Probably one of the best comedy of 2013, most of pranks in this movie are super funny and well acted! Also to my surprise Bad Grandpa has main plot, well written dialog and not one boring scene! This is a must see",
      "total_reactions": 2,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 2,
      "text": "A horrible attempt at a candid comedy. Its slapstick humor and taboo behavior was the cause of, every movie-goer's worst nightmare, forced chuckles. It is so awful, you cannot look away. Unfortunately, one of the only movies I could not sit through.",
      "total_reactions": 2,
      "user": "willkulka"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "Bad Grandpa is certainly one of the funniest and most outrageous comedies of the year. Whether it's Irv going to a strip club and almost getting punched out by a male stripper, passing his grandson off as a girl so they can crash a kiddie beauty contest, or trying to transport and dispose of his late wife's body, Bad Grandpa offers plenty of situations where the hidden cameras capture the varied and hilarious responses of onlookers. There are times when it seems several of these surprised viewers must be plants, and you do find yourself questioning the legitimacy of some of these \"candid\" moments. Still, it's funny as hell. The range of reactions (when you're not wondering who's a plant and what bit was probably scripted) range from the amused to the utterly horrified. It's amazing how much craziness people will put up with until they've finally had enough. The movie's biggest surprise is how sweet it can be at times. You come to legitimately care about Irv and Billy and are invested in how their journey together turns out and if they can work out their relationship. There's a set-piece in a biker bar near the end that's surprisingly touching (albeit in-between set-ups and pay-offs to different gags). Knoxville and Niccol have great chemistry together; the movie simply wouldn't work if they didn't. Niccol is a real find. He seems like a real kid rather than a \"movie kid.\" With his hangdog countenance and deadpan manner, Niccol comes across like a little Walter Matthau. The Jackass gang strike again with the giddily gonzo Bad Grandpa, featuring Johnny Knoxville's Irv Zisman at his most gloriously inappropriate.",
      "total_reactions": 9,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 1,
      "text": "A forced narrative does not do this movie any favors. As a narrative film, it is incredibly weak. As a series of sketches and stunts, it's even weaker. It's a series of setups and no punchlines. Every scene is cut short with no real endings or continuity. If you saw the trailer, you've seen everything remotely funny in this movie, and you can enjoy those stunts and sketches without having them ruined by a terrible film.",
      "total_reactions": 12,
      "user": "unzercharlie"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "Absolutely Hilarious, a must watch! Typical Jackass hilarity always gets to everyone at least once, Some gags aren't as good as the others, but some of them tear your sides apart, recommended to anyone who loves crude humour",
      "total_reactions": 8,
      "user": "EzzOmen"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "If you're a Jackass fan you'll have some idea what to expect. Johnny Knoxville disguises himself as 86-year-old Irving Zisman and takes a road trip with his 8-year-old grandson (Jackson Nicholl, who's already an amazingly confident and gifted comic presence). They play out the simple narrative in real places with real people getting involved and reacting to the outrageous things that Zisman does. The laffs are plentiful, as long as you're amused by gross bodily functions, genital humor and irreverent situations. Despite the craziness, Knoxville's talent as an actor adds realism and emotion to this expedition in crazy excess. Think Jackass meets Candid Camera.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 10,
      "text": "This movie was hilarious and so funny! I recommend going to see this movie. There is a catch though. Before you see the movie so you won't be lost, you should learn what jackass is and what they're about. You should also get to know who Johnny Knoxville is. By knowing what jackass is and what they are about it'll make the movie a lot more funny for you. This is the first thing jackass has had come out for a long time. Anyway the movie was great. They did an amazing job with the costumes! Ultimately the best part about this movie is that it's not scripted and there is real reactions from people. If I were you if go see this movie.",
      "total_reactions": 2,
      "user": "Lukiepookie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "I really really really enjoyed watching this movie. It's nice to see Johnny Knoxville not get punched, rammed, stabbed, or seriously injured for once. The story didn't feel out of place or unnecessary, and the actors were great to watch. Billy was hilarious, Johnny Knoxville was hilarious, and the gags were hilarious. Viewing in a group setting just added to the experience. It's Jackass with a Borat spin--great genuine comedy that's a must-see.",
      "total_reactions": 1,
      "user": "rebel6794"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "This movie made me laugh. I'd give the movie a fair 6/10 at least, even if all the people's reactions were staged. If they were real like I'm assuming they were, then I give it an 8",
      "total_reactions": 1,
      "user": "darogers89"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "I would have given this movie a better score, but many of Bad Grandpa's best moments are revealed in the trailers. Its a shame too because this movie really does have a lot to offer. The grandfather  grandson dynamic works well, but I knew what was coming before I even sat down.",
      "total_reactions": 1,
      "user": "LBC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Jackass with a storyline. 99% of this movie is pranks. The only problem with my viewing of it was that they spoiled all the best parts in the commercials- which is a horrible way to advertise a movie. Either way, it's Jackass, it's Knoxville, it's Dickhouse- it was a must see to me. As the opening credits zoomed by, the opening of the movie will leave you ready to laugh throughout. I loved this movie- the outrageous stuff that these guys do. I don't want to spoil anything more than the commercials already have, but if you like Jackass, go see it- you will not think of it as a waste of money.",
      "total_reactions": 1,
      "user": "AknepEloc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "the movie is good ill say that lol bad grandpa aims at being a grotesque blue humor style comedy and it pulls it off well; there will be tons of scenes in this movie that will have you laughing out loud! youre not forcing yourself to laugh like other comedy movies these days and youre actually laughing cause you find the movie scenes comical; bad grandpa succeeds in what it tries to do, which is to get the audience to laugh; the old man and the kid make a good duo also and their chemistry on screen makes the film all the better; both characters stand out in their own different ways, and they both pull off interesting scenes in their own ways! there is actually a little bit of a story in here too and its a nice little bonus to this movie!",
      "total_reactions": 2,
      "user": "Orangeknockout"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "Bad Grandpa has some undeniably funny moments. However after the plot is presented in the start of the movie, the movie begins forgetting about it. This makes the movie feel incomplete, as if it hasn't accomplished what it set out to do. The bond that the movie tries to develop between Bad Grandpa and his grandson (Billy) starts off slowly, very slowly. This is because numerous scenes during the first half of the movie are following the tales of the individual characters, not the duo. This makes the second half of the movie, where they begin to bond at a much greater level, appear rushed and unrealistic. Even with the leniency that people give comedy movie plots, Bad Grandpa's feels mediocre at best, appearing rushed and distracted from its purpose. The comedy in this movie is also a bit dodgy. This movie has moments, but it goes too far with individual comedy acts. It's like the writers went \"well we can't think of anything else funny, so we'll shove this one joke down the audience's throats for 15 minutes.\" It's a shame because a lot of these jokes are really funny at first, but after the first few times, it makes the movie seem desperate for one more laugh. Unfortunately, a lot of scenes in the movie aren't funny at all, and excessively immature. These moments make you frown as you shy away from the screen, as they're way more disturbing than they are funny. These scenes also go on for way too long. Bad Grandpa is a film that starts really slowly, with the jokes feeling very forced, but manages to recover quite well, picking up the pieces to form a film that contains several meaningful laughs, as well as being able to witness the bond that Grandpa and Billy share.",
      "total_reactions": 1,
      "user": "RhythmicReview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "As far as Jacka** movies go, it's funny, satirical and outrageous! I really loved how they blended in the real-life pranks with a story. That's something new and fresh that I really got hooked into. Now the ending is not that big of a surprise, but other than that, this is one documentary style good ole jacka** movie. I give it a B+!",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "I wanted to like this movie but I barely laughed. I got a few chuckles but the one thing that ruined the movie to me was the addition of story. I love the Jackass movies as they are just random and are funny thought the whole film. Bad grandpa focused more on sex jokes than gags and pranks which I just didn't laugh at that much. It was kind of hard to believe that those we're real reactions because of the story aspect they put in.",
      "total_reactions": 1,
      "user": "Kinaibhlan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Though there really isn't anything new from Jonny Knoxville in Bad Grandpa, it has some very funny moments that don't rely on people getting hurt. Knoxville provides his style of comedy while giving us a story that wasn't there in Jackass.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 0,
      "text": "Another proof that most of  critic writers are whores.Who ever like this movie should get medical help.Movie is good for mentally disabled people and utter garbage.",
      "total_reactions": 2,
      "user": "Smee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "I have watched all the previous 'Jack-ass' movies. I did not love them due to some of the disgusting stuff in it though enjoyed watching those because the movie purpose was very clear and they given everything they possibly could want to give.",
      "total_reactions": 1,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Truly one of the most laugh out loud comedies of the year. Although it is not as smart as This Is The End humor wise, I found myself laughing through out the film. I never expected it to be smarter than This Is The End which in my opinion is one of funniest comedies this year, but I found it funnier than end of the world buddy film. I would definitely want to see this as soon as possible but I can understand if you would think this not a theater experience.",
      "total_reactions": 0,
      "user": "RebelMax13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 5,
      "text": "I laughed hard at the very end...  then a little bit in the middle... but other than that not much and neither did the other people in the theatre.  I love the Jackass movies but this one fell short.",
      "total_reactions": 0,
      "user": "TSTINKERS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "I've been an avid fan of Jackass since I saw CKY2K at far to young of an age.  I've been hooked since, and was beyond sad after they finished the second movie.  At the time,  Iwas under the influence that would be the end of it.  Luckily, we got Jackass 3, which was more than I could ever hope for.  After three I pretty much knew it was over.",
      "total_reactions": 0,
      "user": "limecat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Knoxville's \"films\" are always the same. What saves this one is that there is somewhat of a loose story line to all of the hidden camera practical jokes. There were some very good and unexpected laughs which I can say allowed me to watch the entire flick. However once is enough.",
      "total_reactions": 0,
      "user": "geedup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "The funniest movie of 2013. Although it's not really a jackass movie, it satisfies my hunger for the series. Johnny Knoxville and the child that plays his grandson are great. Go see it!!",
      "total_reactions": 0,
      "user": "petero3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "Went to see it with some friends, the movie is fun on some moments but it feels like you're watching a long benidorm bastards marathon and it gets quite boring on some times.",
      "total_reactions": 0,
      "user": "Jaragon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 6,
      "text": "Good film but does not reach the Jackass movies. Although the are only middle class but the humor was biting and evil.",
      "total_reactions": 0,
      "user": "Nobilis1984"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 4,
      "text": "Jackass Presents this movie but it's not Jackass. I think they tried to sell the \"Grandpa is gonna take care of you\" angle way too hard. We all know that's not his real Grandpa so don't keep on trying to pretend it is. There's a couple laughs and a couple crude scenes that made me crack smile but overall this movie is a waste of time.",
      "total_reactions": 0,
      "user": "JC86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 8,
      "text": "What to say about a Jackass production, but in Bad Grandpa what you see isn't stupidity under stupidity, the movies tryes to have a history with the grandpa and the grandson, witch is nice, but I don't know, they aren't really the best in histories, just in stupidies, but there is a history, a diferencial comparing with the oder Jackass.",
      "total_reactions": 0,
      "user": "PHJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "While considerably toned down when compared to other “Jackass” properties, it doesn’t stop this film from being incredibly funny and, shockingly, tender at times, as well.  Sure, much of the movie is predictable and you know where they are going most of the time with their hidden camera pranks but it’s still all in good fun and adding those pranks to an actual story made for a nice “Borat”-style feel.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 3,
      "text": "Watching the movie, all of the gags seemed forced and not real. The ideas was great.. but badly executed.",
      "total_reactions": 0,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Bad Grandpa is a very funny comedy that is basically a bunch of skits rolled into one film and most of the skits really work.  There are a few that don't but overall this film had me laughing a lot.  A-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 6,
      "text": "Bad Grandpa is the fan-favorite skit from the show Jackass, where Johnny Knoxville pretends to be an old man to see how much shenanigans he can pull off, stretched into an hour and a half film. There were certainly some hilarious scenes but unfortunately they tried to turn it into a somewhat serious movie. I don't mean the content was serious, I simply mean that they actually tried to give the film a real plot and story arc and at times it seemed as though that interrupted the humor. About half of the skits are funny and a few are legitimately hilarious but the rest is mainly filler in order to connect the timeline. That was where the movie failed, in my opinion. If you're a Jackass fan, like myself, you won't mind and you'll still enjoy it to an extent. If you're not, then the humor probably isn't for you anyways.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "First off, Yes it actually does have a plot but that does not take away from the funniness of it one bit. Many times through out I laughed so hard that I couldn't breathe. I'd definitely recommend it, Especially if you love the Jackass show and films.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "to all the asswholes who said this is not related to jackass movies  guess what your wrong  . jhonny knoxville back again in mtv's jackass  i think it is the new jackass and it is funny expect the dirty pranks . but who cares its jackass . but i did find it funny",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "This film has its funny moments and others that are not funny at all, went into this with high hopes because I have enjoyed the jackass films but this fell short for me. I still think people should watch this at least once",
      "total_reactions": 0,
      "user": "masterjohnson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "It feels a little overlong, but the movie provides several very funny moments the keep it going. Some of it seemed fake while other parts genuinely seemed real.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Jackass Presents: Bad Grandpa is not like all the other installments in the Jackass franchise this time around it actually has a story with characters and not just people doing pranks/jokes on people. That being said it still does have the felling a jackass movie same old laughs with Johnny Knoxville doing crazy stunts. It may not be the movie that all fans of Jackass wanted but i thought it turned out better then when i first heard about it. Making a whole movie about one skit from the previous Jackass films who would have thought it would have turned out this good.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Without a doubt one of the funnest movies of 2013 and reassures us that Paramount Pictures can still produces quality films. Bad Grandpa, story wise is nothing to write home about, however it will leave you in fits on laughter. They have done a really good job with getting the reactions of so called \"randoms\", which makes the movie all the funnier! The pranks are golden! Very recommendable.",
      "total_reactions": 0,
      "user": "busbfran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "Moving in another direction for their fourth film, the producers of Jackass decided to focus on a single character from the franchise, Johnny Knoxville's Irving Zisman. The film has everything you've come to expect from the series, as Knoxville plays a Grandfather, on vacation with his Grandson. Knoxville does his usual schtick, crashing into to things, saying outrageous things to strangers, and of course showing off his giant rubber testicles. As with most of the Jackass stuff, it's outrageous and hilarious for the first half hour, but quickly gets old. Maybe I'm just too old to appreciate Jackass anymore, but when I start out watching one of their films, I love it, and by the end, I'm just waiting for it to be over with. Knoxville is impressive, and while he's done films on his own, I think he was giving a message to the rest of the group in this film. The message being, if you guys don't want to do this anymore, I can make it work with anyone, even a 10 year old kid. Hopefully the message gets through and we'll get some more Jackass films. I really do love the simplistic comedic genius of the films, but it's repetitive nature makes anything more than an episode of the show wear on me. Maybe it's just not made for someone in my age group anymore, but regardless of age, Jackass has always been good for a few laughs and Bad Grandpa is no exception.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "Bad Grandpa features an unusually thin and weak narrative of an already-seen-before story. There are funny moments but most revolving around raunchy themes.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Jackass gives us another black comedy that’s funny and incredibly embarrassing to watch, even though its intellectual reach somewhat exceeds its grasp.",
      "total_reactions": 0,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "this movie was just hilarious. i could not believe how well it turned out with the risky setup of a hidden camera movie with the general public of america but it works so well due to the fact that the people give great reactions that you could almost believe it was scripted and just had me in stitches. johnny knoxville and Jackson Nicoll are both excellent i haven't seen the extended cut but i imagine it is great as well and i would love to see Jackass do something like this again",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "Essentially it's Borat minus the wit and that leave you with mostly humorless hidden camera pranks. The reactions still are pretty funny despite the fact that the pranks aren't. Honestly you'll find better hidden camera pranks on youtube.",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Another hit and miss comedy for me. Bad grandpa genuinely has some truly funny moments, but some jokes are plain stupid and forced which make them fall flat on their face.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Dir: Mark Pellington",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2017
      },
      "score": 10,
      "text": "We enjoyed the Jackass films and stumbled upon this by accident.  We laughed out loud, belly laughs with tears coming out, many, many times during this slapstick style comedy with many surprises that catch you off guard and have you rolling.",
      "total_reactions": 0,
      "user": "mchlkirk77"
    }
  ]
}