{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Java Heat",
  "mc_negative_rating_frequency": 3,
  "mc_positive_rating_frequency": 2,
  "mc_pro_critic_reviews": [
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 60,
      "summary": "Speaking his (Rourke) lines in an unintelligible accent that occasionally requires subtitles and wearing a white suit that never seems to get bloody even when he’s stabbing people to death, the actor brings an undeniably fascinating strangeness to the otherwise familiar proceedings."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2013
      },
      "score": 58,
      "summary": "Unfortunately, Java Heat is also an action movie for people who don’t mind clichéd plotting, lame dialogue, and the low-wattage charisma of third-string Twilight heartthrob Kellan Lutz."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "The film's anthropological interest in Indonesia is the smartest thing in an otherwise familiar scramble of kidnapped babes, expensive jewelry and millions of bullets."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2013
      },
      "score": 50,
      "summary": "A middling genre movie, but it's oddly likable for its conflicted, unresolved tension."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2013
      },
      "score": 40,
      "summary": "Java Heat's title refers not to hot coffee but to the Indonesian island, though caffeine is certainly recommended to make it through this tepid buddy-cop action flick."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 30,
      "summary": "The film, directed by Conor Allyn, is rarely more than a few minutes away from a gun battle or a tedious chase, and soon you cease to care who is shooting at, or running from, whom or why."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2013
      },
      "score": 25,
      "summary": "The terrorism thriller Java Heat sure is violent. I don’t even want to tell you how viciously Mickey Rourke mangles the French accent he’s trying to do."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2013
      },
      "score": 20,
      "summary": "It would be nice to say that Rourke, at least, offers a reason to see this junky thriller, about an American agent who gets involved in an Indonesian terrorist plot. But as entertaining as it is to watch him adopt a strange accent and swan around in sarongs as an eccentric jewel thief, it’s also a little depressing. The paycheck cannot possibly be worth it."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "We've created the ability for contributors to directly add/update/edit/delete Parents Guides for titles. Since the beliefs that parents want to instill in their children can vary greatly, we ask that, instead of adding your personal opinions about what is right or wrong in a film, you use this feature to help parents make informed viewing decisions by describing the facts of relevant scenes in the title for each one of the different categories: \"Sex and Nudity\", \"Violence and Gore\" , \"Profanity\", \"Alcohol/Drugs/Smoking\" and \"Frightening/Intense Scenes\" viewing decisions by describing the facts of relevant scenes.",
      "total_reactions": 0,
      "user": "albe"
    }
  ]
}