{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 41,
  "mc_movie_name": "Jennifer's Body",
  "mc_negative_rating_frequency": 53,
  "mc_positive_rating_frequency": 78,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The film has an attractive cast, is filmed with striking imagery, basically lives up to its interesting premise, and brings enough wit and humor to please. Yet, through the whole movie you can't figure out if it is more of a comedy than a horror flick. I give this film 79%.",
      "total_reactions": 2,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Screenplay is not so good. Specific moments are quite enjoyable. But nothing especial in it. Genres are Comedy, Horror. However, I found nothing too horror and nothing too comedy either. Ending of a movie is precious. This film's ending is not so nice.",
      "total_reactions": 2,
      "user": "kinghridoy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 4,
      "text": "This movie sucks. The only good part is what gives name to it: Jennifer's body. Megan Fox can be the worse actress in the whole world, can be a **** but she's hot and that saves the movie. However, anyone who watches the movie knows what he's up to see, so it's not disappointing at all. It fulfills its function.",
      "total_reactions": 1,
      "user": "Xtreme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "If you are expecting a horror movie with lots of scary moments and unexpected twists, you will be disappointed. If you are expecting deep social commentary, you will also be disappointed. If, however, you want a really funny satire of horror movies with razor sharp dialog, this is great.",
      "total_reactions": 0,
      "user": "FreeJeff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "I got a 'guilty pleasure' vibe from this film. I felt like it was a film I shouldn't like but yet I did. Sure, it doesn't live up to the codes and conventions of a traditional horror film but it is a film that works. It's a story about maturity, friendship and loss. Cody Diablo has succeeded in writing a story which not only puts you on the edge of your seat but makes you laugh as well - a good combination. The addition of Megan Fox and Amanda Seyfried as the two leads makes this a great film. The chemistry between Jennifer and Needy was convincing, as was Needy's relationship with Chip.",
      "total_reactions": 0,
      "user": "JamesNWA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "This movie was pretty good. The acting in this movie was actually pretty decent. The story wasn't that great but i still like it. A good Horror comedy film for teenagers. This movie one of megan fox best movie. She did a nice job with her role,  Didn't expected Megan Fox to do a good job in this movie. THis is a good movie to watch. Great Teen Flick.",
      "total_reactions": 0,
      "user": "iamtrent424"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I feel like this movie gets a bad rap for no real reason. It's certainly not the excellent writing, the awesome directing, or the competent acting that did it in, so I'm going to have to blame the screwup on the guys who thought it would be a great idea to market this movie as a horror when it so clearly isn't. The movie is more of a teen popcorn flick/horror comedy, and it works well. The storyline, while simple, will initially keep you guessing and provides some great opportunities for the actors to show off their acting chops--yes, this even applies to Megan Fox. She gets a bad rap also (I don't know why, I haven't seen her in anything else) but she is great here. None of the characters here are one dimensional besides the side characters who are included to farther ground this story into the land of highschool stereotypes, but it never stays in this territory for too long and soon enough you'll actually feel genuinely bad for these characters. If you walk into this movie expecting a horror you're going to be sorely disappointed. However, if you go into it with an open mind, prepare yourself for some laughs, some tongue in cheek gore, and characters that have heart, you're really going to enjoy this underrated little flick.",
      "total_reactions": 0,
      "user": "Nillin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "Is it a hooror movie? Is it a horror comedy? I don't really know. What I do know is that it is pretty good. Admittedly, they could have found someone hotter than Megan Fox to play Jennifer considering the attention she drew both in and out of the movie, but I most certainly am not complaining about her looks at all. As for the movie itself, the plot is basically a hodgepodge of horror cliches, teenage stereotypes,  and  genuine WTF moments all spliced together surprisingly well. What I like most about the plot, however, is just how well the actors pull off what might be the most genuine worst case horror scenario ever played out. I won't spoil too much, but the heroine's reluctance (due to her relationship with the monster) to do what needs to be done plays out just long enough for you to empathize with her, but vanishes the very instant it starts to get annoying. The monster is also much more intelligent than most other horror predators. She carefully picks her victims (the insecure, shaken, or the egomaniacal), only attacks when she's absolutely sure she can make a clean getaway, and spaces out her killings to avoid unnecessary attention. This is what should be mainstream in horror movies; intelligence is the scariest thing you can face, and blind vengeance is the best weapon to fight it with. That being said, there are some issues I had with the movie. The first is the dialogue; some of the lines range from cheest at best to outright horrible at worst. Also, though I told you earlier that both heroine and monster are more intelligent than other horror stereotypes, there are some crazy WTF moments. The most obvious is when heroine and monster meet face to face for the first time. Again, I won't spoil much, but black vomit is involved, yet the heroine, either through denial or ignorance, pretends nothing is wrong for as long as she absolutely can, despite her best friend's life being at stake. Their next private encounter is supposed to be sexy (and you'll see why if you watch the movie), but I was on the edge of my seat just waiting for one of them to strike at the other. Nothing. When the encounter ended, I had to pause it for a second to wonder why that scene was shown at all. It just seemed like fluff since literally nothing said or done in it had any impact on the story. I know, it sounds like whining, but it's just an example; let's not even talk about the heroine and her boyfriend's relationship; I only have 2536 characters left. Long story short, this movie is definitely a step in the right direction for horror and horror comedy movies in general, and despite the actor's shortcomings, they definitely come off as human. The small town setting makes the perfect glue to hold it all together, and the simple fact that both monster and heroine actually think, feel, and react make the whole premise that much more real, and that much better.",
      "total_reactions": 0,
      "user": "TheangryOne"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "I'll admit it, Jennifer's Body is a bit of a guilty pleasure. There are plenty of reasons to hate it - Diablo Cody's usually cracking dialogue sounds a bit creaky and forced, and incorporates some cringe-inducingly crude teen slang creations. It's also got a pretty weak first act and an unnecessarily long run-time. Meagon Fox has found her ideal role as a possessed cheerleader, a role where she is actually required to act lifeless, and as per usual entire scenes are built around her sex appeal. It's lucky really that Jennifer Check (Fox) isn't the protagonist, and that job falls to the far more talented Amanda Seyfried, who's character \"Needy\" Lesnicki is much more interesting than Jennifer anyway. The film also owes an awful lot to older, better films (Carrie and almost everything made by Wes Craven spring to mind), in fact I really don't think there's much at all that hasn't been recycled from another source. What Jennifer's Body does have is one of the most entertaining and over-the-top finales in the history of teen movies, plenty of laughs (both intentional and unintentional), bucket-loads of gore, and a general feeling that it's not taking itself too seriously. The film's choice of antagonists is also pleasingly original, and equally scary and funny, and the scene where they cause Jennifer's possession is easily the best in the film. So it'll never be considered a classic of the comedy or horror genre, and considering its numerous flaws, it really doesn't deserve to be, but Jennifer's Body is still more often than not undeniably enjoyable in its trashiness.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "A really cheesy movie, but an entertaining one. I can see how people would hate on this movie. It's a guilty pleasure type of movie. You can't really praise anything too highly in this film, except for maybe some of the dialogue.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 3,
      "text": "I first watched Jennifer's Body at a birthday party thinking to myself that this film is going to be terrible. IMO, I was right. Jennifer's Body was a horrendous film with mediocre acting, many predictable moments, a questionable ending and a really dumb concept on how Jennifer became from an arrogant cheerleader to a gruesome monster. There were a couple of sequences that got my attention like the drastic incident at the cabin bar, but everything else was too shallow and made no damn sense. Perhaps the movie's film style and genre isn't my type of film, but either way Jennifer's Body is still a poor executed film.",
      "total_reactions": 0,
      "user": "TipsyMcBee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "JENNIFER'S BODY is an enjoyable and funny film that is entertaining and provides a decent amount of laughs. A fun flick.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "lol what the **** was this. Other than Megan Fox's hot body, there was nothing else good about this movie. I expected something scary - instead all I got was a lame movie that made no sense, didn't have much of a storyline and was all blood and gore. What is that nasty black stuff she pukes out anyway....",
      "total_reactions": 0,
      "user": "SShao"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "I'm pretty sure both of us have more important things to do right now than to talk about this bad movie, so let's make this quick.",
      "total_reactions": 0,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "Fox Is Possibly One Of The Worst Female Actors Of All Time! The Plot Was Dragging Though The Whole Movie! Amanda Saves This Movie From Getting A 1!",
      "total_reactions": 0,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Adam Brody had a pretty good role in this film but everyone else was poor. The film is entertaining in some places and hard to watch in others. The standard of acting is not very good but it wasn't the worst thing I have seen. I would rather have watched it than not have done so at all.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Jennifer's sexy body sadly cannot make up for the wooden acting and sometimes awful dialogue. While not horrible, it's a shame that a movie like this didn't become a guilty pleasure for me.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Worst movie ever! Bad actors, terrible script, director.... Simple they work so hard to make the worst movie of theirs life. This film, is a really bad joke.",
      "total_reactions": 0,
      "user": "voiders"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "Such a bad movie, I couldn't help but laugh at how cringy it was from start to finish. Only watched all the way through for the two lead characters, which you can't really blame me for doing",
      "total_reactions": 0,
      "user": "CJBailey14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "**** movie,amanda seyfried is the only one acting nice,however all other premises,concepts,ideas are just A COMPLETE  FAIL,and hell i'am not trolling or anything,but there are some movies there plain STUPID,and this is a good example,garbage",
      "total_reactions": 0,
      "user": "KingDevil999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "Somehow this \"mean girls\" devil horror movie feels like a  Micheal Bay horror movie with terrible acting from Megan Fox and somehow Amanda Seyfried is in this why? It has unnecessary flash backs and has high school cliches and bad storytelling. The writer of \"Juno,\" Diablo Cody  creates under developed characters and the film focuses on Megan Fox's sexy devil possessed image (who looks like a Victoria's secret  porn model). The film is too campy and the film is mean't for horny teen boys; the direction is too campy and terrible, Cody's characters are off and terribly written, Fox's acting is god-awful. Grade C-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "I dig this film. It's both a Comedy and a Horror, my two favorite film genres. For a bonus it includes some of my favorite Actors/Actresses and has a exceptionally good soundtrack. However, I think Jennifer should of faced the band rather than Needy in the deleted scenes... not that it matters, just an opinion. I rate this film 90%.",
      "total_reactions": 0,
      "user": "thaliales"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 2,
      "text": "This 'wannabe sexy horror' fails to join in the bandwagon filled with all the greatest horror movies of all time thanks to its painfully unfunny and 'scary' clichés.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "Glancing through another rating website, I was shocked to see that this was on my list of films I'd seen because I did not remember a single thing about it. Watched the trailer once more and it all came back to me... not good.",
      "total_reactions": 0,
      "user": "tobeery"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "By tapping in to the same vein of 'hormonal horror' as the excellent 'Ginger Snaps', this offers a witty, subversive look at the darker side of teen friendship.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}