{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 51,
  "mc_mixed_rating_frequency": 133,
  "mc_movie_name": "John Carter",
  "mc_negative_rating_frequency": 60,
  "mc_positive_rating_frequency": 350,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mark Holcomb",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 80,
      "summary": "The achievement of John Carter is that it takes the elements worn to nubs by everything from \"Star Wars\" to \"Avatar\" to TV's \"Fringe\" and makes them fresh again."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 78,
      "summary": "Old-school \"Gosh, wow!\" sense-of-wonder filmmaking is in short supply in these anxious days, and John Carter (of Mars!) left me with my disbelief in suspended animation and once or twice with goosebumps dotting my arms. And that's enough for me."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Did anybody expect it to be a metaphor for modern America?"
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "The result is an entertaining diversion but it lacks the magnificence one desires in the opening chapter of a would-be franchise."
    },
    {
      "critic": "M. E. Russell",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "John Carter is too wickedly strange not to recommend. Movies this expensive usually play it much safer."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Against the odds, John Carter is itself pretty amazing - an epic pulp saga that slowly rises to the level of its best imitations and wins you over by degrees."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Spirit counts for something too, and John Carter has plenty of that, in addition to the requisite dashes of wit."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "John Carter manages to be a ridiculous amount of fun, even if you are immune to the charms of Taylor Kitsch (Friday Night Lights) running around in what amounts to a stylish loincloth."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 75,
      "summary": "Rather than trying to overwhelm viewers by overloading the senses, John Carter's effects strive to create something new using as their foundation a book that's fired imaginations for the past century."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "This middle section, in which both Carter and the audience get a crash course in the politics, history, and theology of the Red Planet, is the movie at its most imaginative and most fun."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "If you're willing to suspend not just disbelief but also all considerations of logic and intelligence and narrative coherence, it's also a rip-roaring, fun adventure, fatefully balanced between high camp and boyish seriousness at almost every second."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 70,
      "summary": "Director Andrew Stanton's Disney extravaganza is a rather charming pastiche."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "That's kind of the aesthetic that Stanton is going for: over-the-top pulp. But there's something generic about the digitally rendered Martians, and there's a corniness to the dialogue that keeps the audience from any kind of emotional attachment to the Tharks and Zodangans and their ilk."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "John Carter bites off more than even Woola can chew, but it's built on something rare: wonder instead of Hollywood cynicism."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 63,
      "summary": "Does John Carter get the job done for the weekend action audience? Yes, I suppose it does. The massive city on legs that stomps across the landscape is well-done. The Tharks are ingenious, although I'm not sure why they need tusks. Lynn Collins makes a terrific heroine."
    },
    {
      "critic": "Jonathan Crocker",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Get your ass to Mars? A handsome new sci-fi adventure that feels rather familiar. Enjoyable enough while it lasts, John Carter is big on ambition and disappointingly short on action."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "There's no wonder or elation or even dopy sincerity here - just a high level of proficiency and, yes, a lot of expensive CGI."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "There are plenty of entertaining moments to latch onto beneath the sci-fi tropes -- and maybe even a few that will inspire a new generation of storytellers."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "It is a potpourri of arcane and familiar genres. \"Mash-up\" doesn't begin to capture this hectic hybrid; it's more like a paintball fight. Messy and chaotic, in other words, but also colorful and kind of fun."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "What director Andrew Stanton has brought forth from Burroughs' limited, hoary source material is actually kind of fun."
    },
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 60,
      "summary": "Stanton has built a fantastic world, but the action is unmemorable. Still, just about every sci-fi/fantasy/superhero adventure you ever loved is in here somewhere."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 58,
      "summary": "So why is everything so thuddingly fun-free?"
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 55,
      "summary": "When Stanton lets the film be pure popcorn entertainment, with swashbuckling set pieces and lovably corny romanticism, it's a great ride in the Indiana Jones tradition."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Epically fantastic would be a welcome change, although epically awful would at least keep the symmetry. Alas, epically bland will have to do."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Though the project, based on the Edgar Rice Burroughs novel \"A Princess of Mars,\" is ambitious, it's also bloated, dreary and humorless."
    },
    {
      "critic": "Ben Sachs",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "Unlike Stanton's memorable animation features, this is surprisingly devoid of humor or winning characterization, though the special effects are fantastic."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "The result is that John Carter plays like an alternate, inferior version of \"Avatar\"…Plus fleeting hints of John Ford's \"The Searchers\" - for this is also a Western."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "John Carter isn't much - or rather, it's too much and not enough in weird, clumpy combinations - but it is a curious sort of blur."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "It's all too much, and it's too hard to follow. Less is more, and this movie proves it."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 3,
        "year": 2012
      },
      "score": 50,
      "summary": "The film's biggest (and saddest) crime is malaise - it's not that John Carter doesn't care about what it's doing, it just can't make us care, even though the magnitude of every event, conflict and emotion is as melodramatic as its Victorian roots."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "This new Disney film, marked by myriad lapses and marketing follies, bears the woefully familiar earmarks of a big studio production that was pulled and hauled every which way until it lost all shape and flavor."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "That John Carter is so hit and miss, and miss, and miss is unfortunate on any number of levels."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Aside from a few inspired vistas and alien life-forms (the Road Runner–fast red planet dog Woola is sure to sell a bazillion action figures), John Carter is as deadly dull as its basso-voiced, beefcake slab of a star, Taylor Kitsch."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 40,
      "summary": "Stanton has been given the resources to create an expansive, expensive world, but lacks the instincts to direct live-action, a limitation that shows most in the performances. Bare of chest and fair of feature, Kitsch doesn't exhibit enough charisma to carry a project of this scale."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "Interminably long, dull and incomprehensible, John Carter evokes pretty much every sci-fi classic from the past 50 years without having any real personality of its own."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "Even Strong's best efforts can't save John Carter from collapsing in on itself like a dead star."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "The opening to John Carter is a dud, a battle between airships made of woven bamboo, bursting into computer-generated flame over a sandy terrain. There's nothing to see, nothing to think about, nothing to care about, and nothing to feel, just emptiness. The emptiness is never filled over the course of 132 long, barren minutes."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 25,
      "summary": "Nothing in John Carter really works, since everything in the movie has been done so many times before, and so much better."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 20,
      "summary": "Dejah, with her seen-it-all-before smirk, is not a very sympathetic heroine, and Kitsch is stolid and dull. And as for the red planet, the answer to David Bowie's famous question is no. What a sadd'ning bore it is."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2012
      },
      "score": 16,
      "summary": "Most annoying is John Carter's scarcity of action. This much buck should buy more bang."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 12,
      "summary": "As film theorist Siegfried Kracauer once wrote, to paraphrase, art often blooms in the most hostile soil. No such luck here."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 5,
      "pos_reactions": 18,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Who would have thought that the highest professional critic score for a movie like John Carter would come from the Village Voice??  I thought I'd check this one out after reading about the massive loss that Disney would be taking on this film, wondering just how bad it could possibly be.  I was shocked to find how much I enjoyed it.  Other than the Dark Knight films and the first Matrix, I can't remember another superhero-style movie that kept me so interest during it's full length. It's immensely satisfying.  The marketing campaign - from the billboards, to the trailers, to the TV spots - revealed nothing of the charm of this film - and it has it in excess. The John Carter character and the double-pronged story are interesting as hell. The \"green\" inhabitants of Mars feel completely real to me - unlike any of the beings in the Star Wars prequels.  (If only Jar Jar Binks had been one of these suckers - or even the massive space dog - which I loved - The Phantom Menace wouldn't have been such a joke.) The romance between Carter and the princess is somewhat reminiscent of Han Solo and Princess Leia - if Leia kicked a ton of ass, that is.  I'd MUCH rather see this movie again than The Green Lantern, Captain America, Thor, Hulk, or just about any of these Marvel/DC films which felt so hollow. An easy recommendation.",
      "total_reactions": 23,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "John Carter is an unjustly dismissed sci-fi masterpiece...grossly unjustified. What was wrong with it? Specifically, what was wrong? Pacing? It was intense!!! Coming from someone who uses this word sparingly, this movie was \"EPIC\". I am almost certain that time will enable objectivity, and objectivity will redeem it from the stinging taint slapped on it due to a predictably simplistic aversion to what is \"mainstream\" by film critics. If a studio other than Disney could have created the same film with half the budget it would have been heralded as a cinematic achievement within the sci-fi genre, but its budget was viewed as ostentatious and its production studio as childish, so it became \"cool\" to hate on it before anyone had even seen it. Who makes something and how much they pay to have it made has nothing to due with the quality of what is actually produced, it may be indicative of quality or lack thereof, but the final product speaks for itself. Reviews of John Carter tell us more about film critics than the critics told us about the film. It was practically perfect. \"Incomprehensible plotting\"??? They laid the groundwork for the presumed sequels by deliberately leaving a few questions unanswered, which I hope they still make and answer because I loved this first one! Mars was epic, and then in the end we are reminded that the story began on Earth and the film ends stronger than I could have hoped for! An excellent story masterfully told on screen.",
      "total_reactions": 3,
      "user": "Mr-Liberal-LDS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "It's the best BIG movie I've seen since Avatar. And when you keep in mind that the story was written about 100 years ago it makes the movie all the more impressive. And I thought since it was Disney that there wouldn't be much killing.....boy was I wrong. The story even had a twist or two that I wasn't expecting. Worth seeing. And worth seeing in IMAX.",
      "total_reactions": 2,
      "user": "M13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I have never watched a movie that made me feel sad after I watched it because it was getting a bum rap.  I almost didn't go see it because of all of the bad publicity now I am glad I went. John Carter is a good film, fun, entertaining, funny and visually stunning. Strong interesting characters, good storyline. I blame Disney and its small mindedness for its failure. It is a fantasy film, it should be marketed as one. They should have never changed the name from John Carter from Mars, they should have hit up the fanboy network, and yes there are lots of fangirls out there too who would rock this movie in cosplay..  Disney opened the door and practically begged the critics to pan the movie.  The trailers sucked, there is a fan trailer on youtube that is fantastic which is 1000 times better than the lame ones Disneys put out. Give this film a chance, it is a fun ride and worth seeing.",
      "total_reactions": 2,
      "user": "cleverwabbit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Fantastic looking movie with a wonderful story. The shame is that Disney sabatoged this movie before it was even released. For months leading up to the movie release a certain website advertised this movie as Ghosts of Mars. The travesty is that a bit of marketing could have saved it. It was a huge mistake not to push the love story or to include Mars anywhere in the title. There is a huge following of the books that probably overlooked it because they did not use \"Princess of Mars\" or \"John Carter of Mars\". It is a shame because now we will never see the others.",
      "total_reactions": 1,
      "user": "DenebKaitos"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "I wasn't expecting much but I was pleasantly surprised. I saw it in 3D and I think that did help. Totally crazy story and plot but to me that has to be a good thing when every other movie is a sequel or remake. At the same time it can't help but remind you off some sci-fi classics like Star Wars and Avatar, with a bit of Thor thrown in. Even some of the comedy moments work with a six legged dog! A few good action scenes but for such a big budget movie I don't think there are enough of them. Transformers is an example of too much action and this is an example of not enough. All in all worth a watch in 3D.",
      "total_reactions": 1,
      "user": "allystew"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2012
      },
      "score": 6,
      "text": "Disney's John Carter seemly doesn't have many original ideas, but what you've got to remember is that the source material the film is based on pre-dates all the movies this film appears to be referencing - it's a bit of a paradox really. You feel like you've seen it all before, but everything is executed extremely well. Visually, John Carter is superb, with some of the best sci-fi action since the Star Wars prequels. Taylor Kitsch's star is on the rise, but perhaps he isn't the best actor to lead a film, as excepting one notable scene that makes very effective use of juxtaposition, he is rarely able to demonstrate much emotional depth to the titular Carter, but he can certainly handle the physical demands of the role. Lynn Collins manages to emotionally ground the whole film and Mark Strong makes another effectively creepy villain. Unfortunately the usually brilliant Ciaran Hinds and James Purefoy play pretty much exactly the same characters they did in HBO's Rome, and Dominic West's performance is pedestrian at best. The film makes use of some hugely convenient plot devices to avoid slowing the story, the script is so-so, and many of the key characters' motivations remain annoyingly unclear throughout. I'm also yet to decide whether the framing device for the main story on Mars works or not - is it clever and unusual, or just tonally misjudged? You end John Carter with a feeling that you've only just scratched the surface of this rich world, and I sincerely hope that the film makes enough money to justify a second installment, as a great sequel has been set up, a sequel which wouldn't require anywhere near as much clunky exposition, and in which we might be allowed to finally learn what on Earth (or Mars) Mark Strong's villain is trying to achieve.",
      "total_reactions": 1,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "They really don't make them like this any more. Enjoyable from start to finish, those familiar with the books will undoubtedly get more from it - many plebs find names like Dejah Thoris and Tars Tarkas difficult to remember, credit to the film makers; John Carter doesn't appear to be motivated as a money-maker, isn't diminished for broad appeal and doesn't insult the intelligence. The story is modified slightly from the books (for those familiar with them) but is still, instantly recognizable. Reminds of cult classics like Star Wars, Flash, Dune, Willow, etc.  The work of ERB predates them all.",
      "total_reactions": 1,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "A little bit slow at the beginning it starts a good pace at the middle end of the film. As many people say, when you go to see some films, you enter with some expectations, and for me this was suposed to be a super-action adventure non-stop film, but despite the fact it was a pretty average film I wouldn't recommend watching it it beyond a BR/DVD release.",
      "total_reactions": 1,
      "user": "SirLouen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "John carter is an amazing sci-fi/action adventure movie with a bit of cheese. It's got incredible special effects and 3D, very good action scenes, really good music, an awesome story-line (it's a little confusing at times), and good acting (mostly). I really recommend watching it, do it for Disney (they're losing money), let them make a sequel!",
      "total_reactions": 1,
      "user": "skyminster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "For those who think this movie is a \"Prince of Persia/Avatar\" clone, they should realize this was adapted from a BOOK written in 1912. That alone is pretty awesome. The majority of critics don't seem to realize or appreciate this fact... Regardless, I thought the movie was great and not at all incomprehensible as some called it. It was simple, awesome fun.",
      "total_reactions": 1,
      "user": "mrchicken"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "First and foremost, this film is a ton of fun, with characters you like that have some depth and soul - even the strange and wonderful aliens and monsters. It has great action, effects and a sweet romance at its core. Ignore the bad press and ignorant reviewers who think this copied \"Avatar\" or \"Star Wars\" - I'd like to know how a 100 year old story managed that little trick? Edgar Rice Burroughs \"A Princess of Mars\" may be 100 years old, but the creative team behind this gem of a movie has updated the story nicely while retaining what makes Burroughs \"Barsoom\" stories so wildly entertaining. Yes, it was an expensive movie to make - but it shows it all on the screen, and then some. This film is a nice throwback to better movie making, where actual sets were built and actual locations were journeyed to, creating a level of realism you don't see in films shot on green-screen sets. Do yourself a favor and see this movie: relax, let go and enjoy one of the most entertaining films in the last several years.",
      "total_reactions": 1,
      "user": "BobJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Fantastic movie, I absolutely loved it. I have read the entire works of Edgar Rice Burroughs and I believe he",
      "total_reactions": 1,
      "user": "pomorick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "We saw the 3D version. It's a cross between Avatar, Star Wars...and Thor...I LOVED it!! IMDB rating 7.1 ....I think 7.5 is more like it.",
      "total_reactions": 1,
      "user": "Kats"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I don't remember a movie that I liked so much that was reviewed so poorly. It is not Casablanca but if you're in the mood for an adventure film with a solid story a really great special effects and aratsy visions of alien cultures,  this is it. It's a matinee adventure with classic hero/heroine/evil doers. The bad rap it has so universally received from paid movie reviewers is very  unfortunate and does not jib with the audience reaction, which has been predominately positive. . The movie deserves much better. I have seen a half dozen of this genre in the past year or so that were far less entertaining, Green Lantern, Percy Jackson. . and I'm a fan. . .to name only two.  Go see this movie. Drop your Andrew Sarris precious-ness, open the kid-part of your brain (if it still exists, and I hope it does) and you'll have fun. My 12 year old son and I both liked it a lot.",
      "total_reactions": 1,
      "user": "Muloblanco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "ItÂ´s a great movie, full of action, adventure, incredible landscapes, realistic creatures....and there is love. Anyone who loved Indy, Star Wars will love this movie. Dejah Thoris will rule forever.",
      "total_reactions": 1,
      "user": "doike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "The movie is fantastic, the story is very good and special effects are the best, actually when I saw it I thought it would be a success at the box office, not because it was not, I can only congratulate Disney.",
      "total_reactions": 1,
      "user": "DannyHerrera16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "John Carter had some nice battle scenes and a good plot, but throughout the movie, you just felt like something was missing. Don't get me wrong, I liked it, but  i just didn't think it was as good as i expected. But if you are at a Red-box machine on a boring Friday afternoon and you need something to watch, I would most definitely recommend John Carter. By the way, I heard that the sequels that were planned got cancelled. How unfortunate.",
      "total_reactions": 1,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "I had no idea what to expect going into this movie. Now, I've got to say that I thoroughly enjoyed it and thought it was allot of fun. A really novel idea with some great effects and interesting characters. But if I have to gripe, I would say that the story feels like it was condensed a bit. This almost feels like they took three movies and condensed it down into one. I felt like there could have been more. I feel this movie would have worked better if fleshed out a bit more and perhaps done as a TV series or even a mini-series.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Weird film. I do not even know how to rate it. Visually it is very good at some points, it has entertaining moments, and the lead actor has some charisma and looks hot. But overall it ends being like a mix of many other different films with very little consistency or continuity. It will not be a problem if you skip it. Maybe for your kids. The ending was a nice touch.",
      "total_reactions": 1,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Excellant movie. Alot of fun action packed moments. Followed the book very well but also added to the material. Wish it would have done better in the states. Not looking good for a sequel.",
      "total_reactions": 7,
      "user": "TitanHorde"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "people that  love John Carter have  said all there is  to say. Just to reiterate. Hollywood screwed this movie, but despite this the world knows its the best sci fi movie to hit since the 80's. Don't let this  turn into another Firefly. Go to a cinema, Imax theater, or eventually buy the dvd. So many can't believe the bum rap this movie received. Check it out. You'll be surprised. Don't let negative critic **** cloud or  form your judgements. If you allow that, then you're going to miss out on the grandfather of all modern sci fi. John Carter blew me away and it'll rock your world if you give it a chance with an open mind.",
      "total_reactions": 7,
      "user": "zelusfin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "wasn't sure what to expect when watching this movie. loved every bit of it, story was original nothing remake like everything else. effects and story was alot better then some blockbuster hits like Transfomers.",
      "total_reactions": 6,
      "user": "fearless47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I'll make my review short and sweet. Every once and a while my inner child stands up and pushes aside the cold cynical adult that I have become and takes a stand. John Carter was made for that inner child. This is not a film attempting to be more than what it is, cheesy pulp sci-fi and I loved every ridiculous minute of it. It's a shame this film won't win at the box office or win the hearts of critics. It deserves more then month after month of critical press and ominous projections. It isn't perfect, but its not supposed to be. The source material is corny, far fetched, sword and planet sort of adventure pulp, but the film has no delusions of what it is, or what it wants to be, and that's refreshing.",
      "total_reactions": 6,
      "user": "Monster_Robot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I went into Andrew Stanton's (Wall-E, Finding Nemo) \"John Carter\" not knowing what to expect. By the time the film had run its course, though, I was very happily surprised. Let me make this clear: if you walk into this movie expecting a crystal-clear, fool proof story and acting to rival those of the hollywood greats, its best you stay home. If you're just looking to have a great time, and experience a true blast of a film, go right now, and see \"John Carter\". The film is just that much fun. \"John Carter\" truly immerses you in the worlds it takes you to, from the dynamic relationships between the characters and the struggles each one must confront. Each character is dynamic and has their own story, and the acting is good all around. Taylor Kitsch does well enough as the film's title character, but it is the supporting cast that truly stands out: Lynn Collins as Princess Dejah, Samantha Morton as Sola, and Willem Defoe. The latter two who are simply spot on in their voice acting.  The cinematics are incredible and the animation truly brings the characters to life. The music does exactly as it should, it complements the story, doesn't overshadow it, or give too much away. Yes, there are small problems with the story, but they are not truly important, nor will they affect your movie going experience at all. And with that; I give \"John Carter\" a 9 out of 10.",
      "total_reactions": 5,
      "user": "JMarshall98"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Really enjoyed this movie. So much so that I left the theater wanting to see the movie again and we talked about John Carter the rest of the night. We never felt short-changed with this movie; it was all there including a dynamic, full story. Am very much hoping there is a sequel.",
      "total_reactions": 5,
      "user": "bouchatm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "This movie delivered exactly what it said on the tin, a true tribute to pulp science fiction in the form of John Carter. Highly entertaining to watch in case you are able to enjoy a movies without asking yourself 'How is that supposed to work?'. Just sit back and enjoy the ride.",
      "total_reactions": 5,
      "user": "EvilHimself"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Love Love Love! The main guy was a dream and the story line was pretty decent! For Walt Disney, this was one of there better 'teen' films. Enjoyed it lots!",
      "total_reactions": 5,
      "user": "orchid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Both my wife and I saw this movie in a packed theater,  both of us absolutely loved this film.  It wasn't just needless and endless action through out the film.  It had a strong romance at the heart of the story and characters that you could rout and care for.  Exiting the film I noticed all the comments that I over heard were overwhelmingly positive.  Good story telling through out the movie.  Great movie that I will probably add to my meager blue ray collection at home.",
      "total_reactions": 9,
      "user": "Kevrey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "John Carter is a beautifully painted picture of the original books. However it has many flaws, corny scenes of distress and random turns into cliche situations I have come to know from recent titles. Though I will say it was well worth the money I paid to see it and the time spent. It did exactly what I wanted (entertainment), and gave me the movie I would have asked for as a kid when I read the books. The graphics were amazing. I mean spectacular.",
      "total_reactions": 8,
      "user": "Ratkoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "As usual, ignore the critics and see this movie!  I won't repeat the story, in case you want to see it, I think you will find it imaginative, with unexpected twists and funnier than expected.  Yes it has a lot of CGI, but that's kinda expected when you have a sci-fy adventure movie set on another planet.  I liked the action and totally believed the story.  I recommend this movie highly.",
      "total_reactions": 4,
      "user": "Slick1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Fun and enjoyable movie! Forget that the dialogue is predictable and the acting uneven. Forget that it doesn't follow the book. Just watch the action, wonder about the landscapes, enjoy the rescues, and hope that they get together in the end.  The 3D is lame so stick with the 2D version. And remember, the critics don't like it because they are mostly sourpusses and have forgotten we go to the movies to have fun with family and friends!",
      "total_reactions": 4,
      "user": "JacksonB"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Exellent movie: what most people doesn't realize is that the story of the movie is a big classic by Edgar Rice Burroughs, the creator of Tarzan, and was written in 1912... Don't believe the critics or mindless public that doesn't known the roots behind this one, or the classic books. Do you think the movie has cliches? Well, I guarantee that the book was written years and years before the cliches existed... It's a great classic made in a great movie, and I'm sorry that that the sequence movie doesn't seem to be made.",
      "total_reactions": 4,
      "user": "Xborn74"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Very interesting film) funny characters) Good visualization) Cool story) Recommended to all who wants to spend the time with pleasure!!! Now the first thing you must do its to rush in the nearest cinema to buy the ticket and watch John Carter!!!",
      "total_reactions": 4,
      "user": "6pilkis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "John Carter review",
      "total_reactions": 4,
      "user": "Tweetjj"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "This movie was fun. The princess is gorgeous. People think to much, just watch a movie and have fun. You can find a way to make every movie suck if you look hard enough. Just have fun.",
      "total_reactions": 4,
      "user": "hotdiesel"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "This film has been receiving the most baffling bad reviews and after deciding not to see it because of them, I changed my mind and took a chance. Wow, am I glad that I did. I have no idea why some people have decided that big special effects automatically make a story bad. Whatever the reasons may be, I don't think I have disagreed more with critics on any movie so much, in recent memory, anyway. The story, the effects, even the acting save for a couple of scenes (and I didn't think Dominic West did a very good job either) were amazing. In my book, Andrew Stanton just hit it out of the park yet again. I'm definitely going to be paying to see this again, and that's including the ridiculous 3D IMAX price, too.",
      "total_reactions": 19,
      "user": "DarthNader"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Edgar Rice Burroughs is famous for literary creations that have inspired countless generations and given birth to numerous film and television projects. You would be hard-pressed to find anybody not familiar with Tarzan, one of Burroughâ",
      "total_reactions": 14,
      "user": "garethvk"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "On Saturday morning, I sat down in my seat, hoping to have a good experience while watching John Carter.  What I got was an AMAZING experience.  Some say the plot was cliched and boring, but I thought it was just simply breathtaking.  The visuals were also superb and I didn't have anything wrong with it.  to me, John Carter was better than Avatar.  Sure Avatar had nice visuals, but I thought its plot was just as boring and confusing as John Carters.  Actually, I thought that John Carters was a lot better and easier to understand.  The Pirates of the Caribbean movies are confusing and the last three plots have been a bore to me and those films still manage about a billion dollars a piece, while John Carter will end up with about 350 million world wide and will not see the break of day again when it comes to a series.  This is extremely disappointing as I think the world deserves to visit Barsoom a few more times.",
      "total_reactions": 14,
      "user": "horacep3000"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "\"John Carter\" is pretty much your average enjoy-action summer blockbuster where only striking visuals and big-scope fight scenes matter.",
      "total_reactions": 7,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Don't believe the critics on this one, John Carter is an absolute blast. Went with my 7 year old son to see it the other night and both of us loved it. It's exciting, spectacular and funny as well. Taylor Kitsch is a little reserved as John Carter, but that makes sense from a story perspective, but Lynn Collins is awesome as Dejah Thoris. Willem Dafoe's motion capture work made Tars Tarkas a big hit with my son, as well.",
      "total_reactions": 7,
      "user": "Blankedboy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I legitimately needed to make an account to offset some of the utterly ridiculous claims about this movie. I for one think professional critics have their heads so far up their film school tailored asses that they truly can't be influential to the real people who love to go to an entertaining movie.(I mean look at some of the \"geniuses\"  in the user section that try to use their botched literary prose to match the critics to absolutely pathetic results.",
      "total_reactions": 7,
      "user": "ozlacs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "When I ready negative reviews of this film, I wonder if they watched the same movie I did.  I found the movie very entertaining, and that is the only reason I go to the movies.  I normally do not like 3D but this is a must see in 3D since it is not overly done.  I would pay to see it again, somthing I never do.  I hope this does well so they do a second film where this one left off.",
      "total_reactions": 7,
      "user": "Maleficent1967"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "John Carter was awesome! Highly recommend.  Was what Star Wars Ep. 1 could/should have been. Great characters, action, romance, humor, effects. The ad campaign didn't do justice to what the movie is. It is what it's trying to be, a space spaghetti western, not an Academy Award winning drama. It doesn't take itself too seriously, but the stakes still feel high. It's more fun than Avatar and less pretentious. Go see it! It deserves/needs a sequel.",
      "total_reactions": 10,
      "user": "Steger"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I have waited almost 50 years to a film to do justice to Burroughs' Martian series which I avidly read as an adolescent boy, which I have long thought would be impossible.  Although this adaption might bring criticism from some ERB purists, there being certain plot and character's changes for the sake of plausibility and to satisfy current sensibilities, the film's production values, its quality acting and action sequences, its CGI, and even its pace, left me hoping it succeeds, confounding its \"critics\", and brings on a sequel!  To that selfish end I will recommend this escapist and satisfying action/adventure jaunt to all my friends.  .  Not since viewing the first  of the \"The Lord of the Rings\" trilogy have I \"bought into\" such a film, which gave me something to look forward to in its sequels.  Sadly, I do not see anything which is presently in development that can be its equal.   The film has also taken me back to how enthusiast I was when I originally read the whole series, from start to finish.  Do yourself a favor, and let yourself be an adolescent again for a couple hours, and make sure to have some popcorn and a soda while you are at it!",
      "total_reactions": 10,
      "user": "robpicksthem"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Great action, great story, great fun! It was entertaining from start to finish and it is definitely the best movie of 2012 so far...  who could ask for more? This is a must see!",
      "total_reactions": 16,
      "user": "ddonalds2"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Alright, to start off, lets get one thing straight for some people out there. This is not a ripoff of Avatar or Star Wars. They are ripoffs of John Carter. This is book one of a book series written over 100 years ago. James Cameron and George Lucas have even said they got their ideas from the John Carter of Mars book series, so don't judge it saying its a ripoff of those two films or any other scifi films without getting your facts straight. Now that thats out of the way. John Carter (the movie) was a fun, and exciting adventure, although it gets pretty boring through the middle. I wouldn't say as a fan of the book series that im anywheres near 100% pleased with how Andrew Stanton made \"A Princess of Mars\" a movie. Besides the absolute basics  like the characters looks and the looks of Barsoom, Andrew Stanton pretty much made this his own. Their were countless amount of differences from the book to the movie. VERY big differences at that, which as a person who read the book, it angered me alot, but i understand why he changed it around. I know he changed it around so the people who didn't read the book could follow the story, but I just wish he didn't change it completely, like the key elements to the story like how John Carter and Dejah Thoris met, how they fell in love, and how John Carter made it to Barsoom, and the ending, they were all completely different. Does this mean the movie was bad? No not at all. I enjoyed the movie, but i was really hoping Stanton wouldn't make it a cliche type of film. He made the love story reeaaalllyyy corny and too cliche, the whole love story between Dejah and John was changed alot, and it seemd to be overshadowing everything else involved in the story, and he put a little bit too much humor into a story thats supposed to be serious. It was still a fun movie, but they cut alot out of the book, especially in the middle because the middle of the film just dragged on, it got really boring whereas the book had action all throughout, which on another note, the action in John Carter was actually very good. It was pulse pounding and it was incredibly entertaining, but this film cost them over 250 millions dollars to make and i do really hope this installment makes enough money for them to make \"The Gods of Mars\" (the second book in the series) into a film adaptation, and hopefully if they do, it follows very closely to the book. Judging the movie from a fan of the books point of view, i give John Carter a 5/10, the looks of the locals of Barsoom and Barsoom as a whole was spot on, and Woola was perfect in the film, i've always loved Woola and i'm sure hes going to win America's heart and sell ALOT of action figures, but story wise, everything was changed around in some manner, but as just a movie i give it a 7/10. Overall the action that was in the film was amazing, very beautiful effects and i'd say Taylor Kitsch and Lynn Collins did a pretty good job with what they had in the script. Their is a little something for everyone in this film. Love story, action, great story (although different from the book) and comedic relief. Although this is a Disney film, parents might wanna stay away from this movie, somethings (like the white apes) might be too frightening for small children. Overall I give John Carter a 6.5/10",
      "total_reactions": 6,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This is the best film I have ever seen in my life. (Reached far above my expectations) I watched it in 3D, although the 3D kind of sucked, I recommend 2D. The movie is better in 2D. There are some funny moments, moments that will surprise you! There are also moments that will make you tear up a little bit. The story is great, the movie doesn't have as much action as you expect there to be, but I think that is a good thing. There are many characters and places, The animation is great 100% the best animation I have seen in any film that I have seen in the past. I am not saying this because I am a fan, I am saying this because it is true. A really fun movie, it needs what it deserves (good box office results). The only two downsides to this movie, is that I think the beginning of the movie on earth felt a little rushed/fast, I think they should have added a little more time on earth. The second downside, (SPOILER ALERT) is that I think John Carter and the Tharks should have learned each others language instead of taking a translation potion. The ENDING is GREAT. I rate this movie a 9.99998/10. :)",
      "total_reactions": 6,
      "user": "DanielQuesnelJr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Many of the negative criticisms show expectations that have been shaped by those various movies of the fantasy and science fiction genre, some of them having been influenced by the original \"Princess of Mars\" story, which movie themselves have also come to include various formulaic requirements of a \"good movie.\" The new movie \"John Carter\" is escapist fantasy plain and simple, without camp or issues or cutesy kid stuff or mystery meanings or allegory or cosmic questions or dire warnings or hopeful futures or technology predictions or apology or even a clear delineation of good and evil. It's just the pure goo of macho hero fantasy, where the only virtue of the title character is that he doesn't know when to give up. Otherwise, if we must interpose some faint philosophical depth to the writings of Edgar Rice Burroughs, we might suppose Tarzan to be an image of \"le bon sauvage\", and John Carter of the \"Ã",
      "total_reactions": 6,
      "user": "OftenWrong"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Warning: I have already posted a review and have given this movie a 10 rating.  It seems Iâ",
      "total_reactions": 3,
      "user": "FC1"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "John Carter is a blast. From the fast-paced action sequences to the brilliant special effects this truly is a very good film. However, some of the acting can seem a little stale at times, making what could have been a fantastic film merely a great one. It also seems to be aimed more at younger teenage boys, a more family-orientated film then. But it suprised me so much at how good it was, so everyone should go watch it, it's very fun.",
      "total_reactions": 3,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "The critics are right. It is disjointed and wildly incoherent. But it is based on the most influential work of science fiction E-V-E-R. Seriously, \"Avatar\" and \"Star Wars\" would NOT exist without the book \"The Princess of Mars\" by Edgar Rice Burroughs.That being said, perhaps you need to be of a certain age to fully appreciate this film. I am not of that age. However, I really did like the stylistic melding of Renaissance-fair-sword-and-sorcery, and laser-beams-science-fiction.",
      "total_reactions": 3,
      "user": "Aquophis"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Amazing.",
      "total_reactions": 3,
      "user": "B47"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I loved John Carter.  It is not without its flaws, which are more than one would like, but the sum of the parts is great.  The acting is fine, the effects awesome, and the story interesting and engrossing.  I feel that the movie tried to fit too much into one movie, and the pacing was inconsistent, with the end suffering the most from a rushed story.  However, it is a good and interesting movie that reminds me of the classic sci-fi like Star Wars where it was all about the adventure.",
      "total_reactions": 3,
      "user": "Zjarcher878"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "**** every critic & **** those who don't like Science fiction movies. Watch this Movie- Great Story, Amazing VFX, Mind-Blowing Sound. You will love it.",
      "total_reactions": 3,
      "user": "rajsahil"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I actually really enjoyed this flick. I don't understand all the negative press and why it just didn't seem to catch on. The story of a civil war guy traveling to mars and fighting aliens, saving a princess, and what not is pretty cool. The effects were nice. The pacing was great and the movie never felt like it was dragging on. Overall definitely a good movie. If it's still in theaters I suggest giving this one a chance. Otherwise pick up the dvd for sure.",
      "total_reactions": 3,
      "user": "theoffice"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "I wasn't expecting much from this movie based on the trailer but I was wrong.  I don't think they did a good job marketing the film.",
      "total_reactions": 3,
      "user": "SamAdkins"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Incredible film, the effects are awesome, the story is amazing, the 3D is innecesary, but all in John Carter is amazing, the cast is incredible, this is one of the most interesting films of the year.",
      "total_reactions": 17,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Well done film goes right along with the books. Great family fun! The only thing they could add would be more gunfighting or laser fights :) The special effects were amazing!",
      "total_reactions": 8,
      "user": "Rogosh"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "\"John Carter \" is a fantastic movie, the scale is enormous and the story is moving.  The secondary characters are alive and well developed.  A worthy adaptation of the now classic novels by Edgar R. Burroughs.",
      "total_reactions": 2,
      "user": "MrDadelus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "What the film makes up with interesting plotting, it fails in creating something new, exciting or different. Subpar alien people, mediocre visual effects, and some bad dialog characterize a film in which Disney put all its eggs ($250 million) in one basket. Too bad they were rotten eggs. Feels like a cross between National Treasure and Avatar, not a great combination.",
      "total_reactions": 2,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "Little more than a collection of puerile fantasy 'bits' cobbled together, with relentless, falsely dramatic muzak.  So pretty much, the usual recipe for almost every other sci-fi / superhero movie that's emerged from the bowels of Hollywood over the last decade or so.  Add in some truly uncharismatic lead acting talent (sic) and eradicate all traces of plausibility and humility.... et voilà!!",
      "total_reactions": 6,
      "user": "Proctophobic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "John Carter is a difficult review. I was entertained at times but frustrated throughout by the simply awful 3-D effects. If you have any 3-d sensitivity, you will be sick at this movie. As to the content, the movie is part action, part children movie, and part graphic violence movie. The movie overall looks like what it is- a product of a director who had never made a live action movie and was learning on the job- while spending $200 million of Disney's money and dooming the John Carter franchise. Perhaps it would be better in 2-d on the television from Redbox?",
      "total_reactions": 3,
      "user": "siempre"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "To say \"John Carter\" is an \"Avatar\" or a \"Star Wars\" ripoff is simply an ignorant, and a mindless statement. The 100 year old, hard-sell story's success was a questionable bet which the director of the fantastic \"Finding Nemo\" was hoping to produce.",
      "total_reactions": 3,
      "user": "200Millions"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2013
      },
      "score": 2,
      "text": "\"John Carter\" is just a mess. It's story is incompetently told, the characterization is ludicrous, the motivation of the different fractions diffuse, and the casting is all wrong. Taylor Kitsch and Lynn Collins are very pretty, but lack a whole lot of charisma. And using the original terminology of the novels just adds to the confusion. I'm all into challenging movies, but this is just bad, stupid writing, and there are more silly scenes than in some comedies. \"John Carter\" is just a huge bore.",
      "total_reactions": 3,
      "user": "Jailhouse_McGee"
    },
    {
      "neg_reactions": 37,
      "pos_reactions": 13,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "A bad action movie that's visual candy is rarely short, but it's stupidity in story line and plot pacing are it's major weaknesses.",
      "total_reactions": 50,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Seriously the movie get only five, i think the 3D is just a joke. This movie is really boring, i didn't read the book, but the movie have a lot of inconsistency.",
      "total_reactions": 8,
      "user": "skylee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "If I were capable of encapsulating how awful this film was, I'd have invented a new language based around the word \"bad\". The trailers looked terrible, but I suppose at that point the marketing budget had already been spent and two-thirds of the way through production there was no turning back, but surely the most prudent decision would have been to postpone the release and continue the test/edit process until a satisfactory cut was found like Into the Blue. John Carter was simply horrible.",
      "total_reactions": 4,
      "user": "zendoa"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Imagine a mash up of Prince of Persia and Avatar: except not as good as the latter by far. John Carter is a blend of amazing visuals and great CGI characters to then fall short on plot and character development. A guilty pleasure kind of movie that was similar to Avatar's plot, John Carter focuses on the main character who gets thrust in a different world only to end up helping fight for the princess who he falls in love with. Take the time and energy that James Cameron took to develop that relationship in Avatar and don't expect it here. Disney's fast paced sequence is much like Prince of Persia with little creativity added in the script to make an entertaining movie with nice action sequences, just not enough of a story in between. While it didn't happen to be the amazing blockbuster that if could have been, if you are to see this movie anyway, go ahead and watch it in theaters. The 3D and mars visual effects will make the movie worth the two hours.",
      "total_reactions": 23,
      "user": "racketracer"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "From the very beginning this looked like utter stupidity.  Nothing special about special effects.  So what if some computer designer drew some stupid creature on his computer.  Big Deal!  Other than that, lame plot, everything and anything is as out of touch with reality as it can get.  Like humanoids on Mars?  Martian airships?  Seriously?  Technologically advanced Martians/aliens that act as if they had the disinterment of a 5-year old?  And they wonder this load of nonsense was a commercial failure!",
      "total_reactions": 5,
      "user": "DrTony"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "A dull Prince of Persia/Avatar clone. The only thing that could have saved this movie was if David Lynch wrote the script and Takashi Miike directed it, now that would be a messed up movie I'd actually want to see.",
      "total_reactions": 11,
      "user": "JamesSteal"
    },
    {
      "neg_reactions": 19,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "This movie was an absolute train wreck. It was simply awful. This was so bad that it was the first movie in 12 years that i got up and walked out of the theater. The pacing of the movie is out of control, it moves so fast that that all the scenes feel rushed. Despite the frantic pace it feels like your stuck in a boat without a sail or paddle. The movie feels like your in stagnant water. The dialogue was terrible and very very boring. The acting left much to be desired. The movie made me cringe because you could tell how awkward the Actors felt during many scenes. The action sequences had a lot of flash with zero substance, no emotion or suspense, all in all the action was very . . . . . bland and uninspired. Towards the last 3rd of the movie i just couldn't handle this snoozefest anymore and i thought to myself, \"do i really want to put myself through any more of this torture. . . . Hell NO!\" So i got up and walked to the lobby and played Galaga in the arcade until my buddies gave up on the movie too and left early. Don't waist your money and this shameless cash grab.",
      "total_reactions": 23,
      "user": "moviejunky"
    },
    {
      "neg_reactions": 20,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "Even with its gorgeous special effects, numerous set-pieces, and massive budget of $250 million, John Carter leaves me with a booming thought in my mind: \"That's it?\"",
      "total_reactions": 24,
      "user": "KarthXLR"
    },
    {
      "neg_reactions": 15,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "A mess. It is pretty amazing that an established director, with Disney as the studio and 200 million dollars can actually make a movie that is this disorganized.",
      "total_reactions": 18,
      "user": "Proteus"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "A Virginia Civil War soldier is transported to Mars, where he helps the good guys fight the overlords. As imaginative as that sounds (actually from a series of Edgar Rice Burroughs books), there's nothing original about the story, the style, the action, the look or the direction of this tedious bomb. So much is derivative that it feels like a really awful, long-lost \"Star Wars\" spinoff.",
      "total_reactions": 12,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Great CG cannot save an excellent original story line which is drowned by needlessly long, unnecessary, boring, scenes. The trademark \"Disney\" is synonymous with excellence,..but in this case, no.",
      "total_reactions": 12,
      "user": "Maggotfist"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Disney has yet again failed to  deliver an original movie. It's as if they got the worst parts of Star Wars (Jar Jar Binks mostly) and all of Avatar, and fed it to the viewer after being processed by a geriatric Warthog. Epic Fail.",
      "total_reactions": 12,
      "user": "Critica1Critic"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "One word I keep reading in relation to John Carter is inconsistent. I felt that choice of word was excellent because the biggest crimes of John Carter is that it buries the fact it actually has emotional resonance underneath cheap thrill action sequences and comedy sequences designed for the Disney family (the Disney family that in the end, didn't go to see the film). The character of John Cater is a conflicted one having suffered severe loss prior to his transportation to Mars. However this issue is glossed over as he begins leaping around the planet and getting involved in a war that's justification is NEVER given. In fact the film explores different parts of John Carter's personality at different times in the film so you have to struggle through his problems with wars in general before you really get to why he is the way he is. There is a sequence halfway through that is so powerful and poignant that it almost saves the film because it finally gives the viewer someone to support, someone to root for, but then the film returns to its predictable action and linear storytelling and everything that was good is bad again. Taylor Kitsch does a decent job portraying Carter regardless of the bad script and storytelling but he is let down by most of his supporting cast. Lynn Collins puts little effort in and never seems comfortable in the role making her scenes irritating, Dominic West tries to get by on charm but he fails to realise he doesn't have any and Ciaran Hinds looks as bored as he must have felt. The films 250 million dollar budget is evident in some truly stunning visuals but at times they can be a bit jarring in that the humans and creatures never really mesh when they are on screen together. However the CGI and the world created by Andrew Stanton is beautiful in the way Avatar was despite the large amount of sand. The film at times borders on cute because its a Disney film but overall it doesn't provide enough character to even pull that off. It's a shame as they advertised the film as '100 years in the making' as Edgar Rice Burroughs published the first of his John Carter novels in 1912. I wonder if it was made sooner, would it have been any better than this uninvolved yet beautiful mess of a picture?",
      "total_reactions": 6,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "One of the worst movies I've ever seen at the cinema, with the possible exception of Indiana Jones IV. Its only saving grace were the special effects and only when it came to scenery, not the aliens, who all looked like Jar Jar Binks wannabes. The lead actor was just awful, his acting was beyond bad, it was so horrid many people in the theatre were laughing when he delivered the cheesy one-liners with the earnesty of 5-year-old at a school play. Sure, he was pretty, like a Bravo-girl poster pretty, but is that really what it takes to be a fantasy lead? Where are the Han Solos of this generation? The lead actress was better, but not astonishingly so. The story was needlessly complicated and the emotional background for the main character was pointless and forced. The jokes were childish and not very amusing and the dialogues... dear lord, I want those two hours of my life back. I'm actually a life-long sci/fantasy fan, and I admire Burroughs and his fantasy balls of brass, so I wouldn't be so hard on the film (some of the CGI was nice), if it weren't for the amount of money wasted on it - 250 mil, plus 100 mil marketing - do you have any idea how many good movies, even  only within the sci-fi/sci-fantasy genre, could've been made for that amount? But no, it was poured down this drain.",
      "total_reactions": 7,
      "user": "heofon"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "So strange. You have brillant director, yet this film is a formula. It is like the producers and writers all ganged up to make a known quantity; that is really much better as a novel (exposition that never stops, just tedious). I was disappointed to say the least. Way too many story lines that have you more confused than interested. Only die hard fans of this type of genre will like it.",
      "total_reactions": 16,
      "user": "nameless"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "\"Trust me\" said Andrew Stanton a self-proclaimed fan of the books.  I wouldn't trust him if he told me the sun would rise tomorrow after seeing the way he pulled the book apart.  Maybe he read the same book as Rogosh, but it definitely wasn't A Princess of Mars.  I was introduced to the books over 30 years ago, aged 10 and have read and re-read them many times since, most recently the last few weeks I re-read the 1st 3 books.",
      "total_reactions": 16,
      "user": "SecP"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "John Carter tries so hard.  Part Star Wars, Dark City, Avatar, Prince of Persia and Incredible Hulk (the jumping around) and others, it never feels original.  Every attempt at humor in the film fell flat and you could hear crickets in the theater when there was supposed to be laughter.  The acting was sub par, and the dialog was at times laughable.  They spent a fortune creating all the aliens, who all look alike.  They had to make the bad guy have a broken tusk or we would never know who was who.  I saw it in 3D IMAX.  The 3D was good, not great.  There were some good special effects interspersed throughout, but in the end I simply didn't care enough about the characters and didn't feel the chemistry between the two leads.  I was bored at times and looked at my watch, never a good sign.  This is not a terrible movie, but not quite good enough to recommend.",
      "total_reactions": 3,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "Beyond bad. Where the heck did they dig up Taylor Kitsch to star in this  I saw him in 'Battleship' which bombed as well, and he was one of the main reasons. He has absolutely NO charisma, and that in turn makes each and every one of his lines...laughable. This entire movie is a nauseating mess, where one scene is worse than the next. Anyone who sits through this deserves a medal of honor.",
      "total_reactions": 7,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2012
      },
      "score": 5,
      "text": "I went into this movie with an open mind, having never read the books I wasnt sure what to expect. I have to say I agree with the general consensus that this is just an average movie, kind of a nice starter before the summer movie season but not something I would see again. The action was ok but I never really bought into the whole romance and towards the middle i found myself glancing at my watch. If your bored on a Sun afternoon and its still showing go see it especially if its cheap....still much better than the Hunger Games which I thought was terrible",
      "total_reactions": 1,
      "user": "singingbatman"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2012
      },
      "score": 2,
      "text": "My roommate took this film home last night and I decided to watch it with him despite hearing that the film had flopped at the box office.  Well, I wish I hadn't.  Someone's cooking the books, too, on the average user score of 7.1 average. Total fantasy.  I found myself laughing at the serious parts, groaning at the \"funny\" parts and yawning most of the rest of the time.  How can a movie be so predictable and yet take so long to get where it's going?  A horrible combination.  The one surprise?  That Disney made an ultra-violet action film devoid of any moral or inspirational message.  I kept thinking to myself, \"Disney made this?\"  Biggest disappointment?  Taylor Kitsch.  I really like this guy in Friday Night Lights, but he's just not ready for a feature film.  Do yourself and favor and rent something else.",
      "total_reactions": 3,
      "user": "RobE_inSF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "To the reviewer who claimed this film \"evokes pretty much every sci-fi classic from the past 50 years\" and so on: John Carter was written in 1912. That's right: 1912. It predates \"every sci-fi classic from the past 50 years\", you complete tool.",
      "total_reactions": 1,
      "user": "evanrm"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "I knew that John Carter was a big failure. Disney done it last year with Mars Needs Mars and now John Carter. When I saw the commercial for the movie, it was supposed to be the \"first big blockbuster of the summer,\" but they blew it. 3 Disney movies that have the with or without the word \"Mars\" on it and I can't take it anymore. Once they making a sequel soon, I hope I will not see it in 3-D. It's even worse than Green Lantern. Disney, I'm very disappointed at you. John Carter is one of the worst movies of 2012 for me this far.",
      "total_reactions": 3,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "A ne pas descendre John Carter pour son manque d'originalitÃ©, le film Ã©tant l'adaptation d'un livre (datant de 1911) qui lui mÃªme inspira bon nombres d'auteurs et rÃ©alisateurs cÃ©lÃ¨bres, tel George Lucas. Par contre, on ne peut pas laisser passer le cÃ´tÃ© \"gnangnan\" du film. La faute au fait que ce long-mÃ©trage est une production Disney, obligeant ce spectacle d'Ãªtre accessible aux plus jeunes avec des dialogues insipides, un humour qui ne fera rire qu'eux, une musique qui en fait trop question Ã©motions... Bref, le film Disney par \"excellence\", le studio gÃ¢chant ainsi un spectacle qui aurait bien pu rivaliser sans problÃ¨me avec Star Wars. Car, en effet, on ne peut rester de marbre face Ã  cet incroyable univers visuel qui nous est proposÃ© (effets spÃ©ciaux, costumes, dÃ©cors, bestiaire...). En bref, John Carter se prÃ©sente comme Tron, l'HÃ©ritage : soit vous accrochez Ã  l'univers est le film vous emballe, soit vous n'accrochez pas et ce divertissement ne sera qu'un spectacle Ã  gros budget de plus.",
      "total_reactions": 1,
      "user": "avatar16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "John Carter was pretty terrible. Everything felt completely out of place. The characters were drab and uneventful. The plot was cliche and boring. Good attempt but horrible product.",
      "total_reactions": 1,
      "user": "AD421"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "John Carter part 2!!!! bring it on! what a fun movie to watch! Threre were 3 moments in the movie, where I thought to myself, this movie is great! Overall the movie is far from being a \"classic\", but alot of fun to watch! it was intresting till the end, the movie gave a closer to the story, with the end getting ready for a sequel! 8 out of 10 for sure!",
      "total_reactions": 2,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Visually, it feels like a mix between Avatar and Mars Needs Moms. The special effects are amazing and there is a great twist to the ending. It is a lot of fun.",
      "total_reactions": 1,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I thoroughly enjoyed this movie, very entertaining. I would say that it is very similar to the Star Wars prequels in terms of look and feel, even the music and sound effects are similar! The acting is better than that of the Star Wars prequels. Take this movie for what it is, an entertaining Disney Movie with great special effects!",
      "total_reactions": 1,
      "user": "OcraM-SA"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This was actually a really good movie. I didn't expect much in terms of story, but it delivered the goods in full. I really hope they make a sequel sooner rather than later.",
      "total_reactions": 1,
      "user": "410MaXiMuS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "Yeah..it flopped. The reason for it was bad marketing they say. But let's face it, while a lot of films were inspired by this story, including AVATAR, John Carter felt derivative. While Andrew Stanton is a good director, the whole film felt like any other Disney 'blockbuster wannabe' in recent years that includes TRON LEGACY.  Expensive but somehow missing that extra spark that makes a film a must see event.",
      "total_reactions": 1,
      "user": "dharma"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Andrew Stanton has directed two amazing movies; Finding Nemo, and Wall-E. These pictures are both masterpieces, and favorites of mine. Now, Andrew Stanton directs his first live-action movie, John Carter. John Carter is based off of an older-novel, that inspired Star Wars, Avatar, and others. We owe a lot to John Carter, but this movie adaption certainly doesn't pay any debt. John Carter is, simply put, a cheesy, melodramatic, overlong, cliched, unfunny, predictable, non-thrilling \"adventure.\" Some aspects of the film seemed promising, but crashed and burned. There was potential here, but in the end, it all burns out. The beginning does a decent job of making us wonder what's going to happen, what did happen, etc. In fact, the beginning was pretty entertaining, albeit predictable. But after John Carter gets to Mars, the whole story drags. However, there's a lot of incredible visuals on Mars, and though that doesn't make up for stale characters and confusing plot, it helps a little. The CGI is incredible. Amazing. Absolutely gorgeous. If John Carter has one strength, it's the visual effects. Also, the score by Michael Giacchino is another winner. Giacchino never disappoints. Unfortunately, the more important aspects of the movie, like the plot and characters, are less polished. The plot (in addition to John Carter) focuses on the princess of Mars, who wants to avoid marrying a villainous man, but feels she must do it to save her people. Sound familiar? Almost any Disney Princess movie has the same or similar plot. Also, the characters have no personality. Aside from John Carter and limited other characters, there is no one with a true personality. And even those who have one are usually generic types. The action scenes are bland and predictable. The CGI and musical score make up for the awfulness, but a movie can't run on looks and sound alone. Also, there was a lot of potentially good space ship scenes that never truly happen. HOWEVER, the last 10 minutes are amazing. There's an incredible twist, and that was easily my favorite part. Andrew Stanton is a force to be reckoned with, but John Carter makes me rethink that. You saw my list earlier, the film is long, cheesy, predictable, cliched, none of the jokes are funny, etc. Aside from some visual thrills, the score, and a wonderful ending, John Carter fails. I feel like if some of the violence and revealing garments were cut out, this movie could've been PG, as opposed to PG-13, which would allow it to become a family or kid's movie. This would've worked much better, because the movie is too silly to work as an adult/teen movie. There will be at least one sequel to John Carter, but don't expect me to tell you how it is: I'm avoiding John Carter for life, and it's probably best if you did too. Edit: Due to disappointing box office performance, there will not be a sequel after all.",
      "total_reactions": 2,
      "user": "LandF"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I'm in my 50's and I took my 12 yr old boy to see this movie.  We saw the regular 2D digital version.  We were both thoroughly entertained by the story and the visuals. We want to see it again!  Those who want to pick this movie apart for any reason they can think of (critics and users), and then compare it to all other sci-fi that has come before it, are totally missing the point of this Edgar Rice Burroughs classic, and their whinings should be dismissed.  Go see this movie and have a good time!",
      "total_reactions": 1,
      "user": "PowZee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "With a name worthy of being a USA president, John Carter goes for an adventure in Mars instead, although there's no oil there. It appears Mars, or Barsoom as they call it, is not as inhospitable as we thought. It's a planet populated by overly-tanned fitness models and a hybrid species between Goro from Mortal Kombat and Jar-Jar from Star Wars. Just as any fantasy adventure plot demands, there's bound to be a vagabond protagonist and a princess in distress whose fates are entwined together. But wait, John Carter doesn't only have one, but two princesses in distress, one being alien chieftain's daughter and not romance-able.",
      "total_reactions": 1,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 2,
      "text": "The movie starts off good. It's funny, interesting, and looks very different from most other sci-fi movies.  But after the first half hour it starts to regress into worn out cliches.  The effects are the only things that is consistently good throughout the movie.  The middle of the film is it's weakest point.  It spends a lot of time developing a very stereotypical romance between the hero and the heroine, it doesn't really advance the plot, but it goes on for so long that the climactic battle is kept far too short and feels like a let down considering the movie spent two and half hours building up to it.  Then there is the \"twist\" ending that seems like it was thrown together at the last minute.  Of course by then I was so ready for the movie to be over that I didn't end up caring much.  My advice to director Andrew Stanton: stick to Pixar movies, because you're great at making those.",
      "total_reactions": 3,
      "user": "MagnificentM"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "\"Aside from a few inspired vistas and alien life-forms, John Carter is as deadly dull as its basso-voiced, beefcake slab of a star, Taylor Kitsch.\" - Keith Uhlich nailed the review.",
      "total_reactions": 7,
      "user": "CmhBuck"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Seeing such a low Metacritic score and reading some of the reviews almost made me not see it, was it not for the fact that I enjoy IMAX 3D and a friend of mine said he wanted to see it, so I went with him.  I am a big sci fi fan, and I was worried that the action was going to be minimal and the story was going to be simplistic (Earth guy kicks butt on Mars).  I was right about the action, but the action that was there was in support of the story when it needed it, and it worked really well - I'm glad they didn't go all Michael Bay. It did get slow at times, but I was never bored - it felt more like a drama or a mystery during these stretches.  The plot was an interesting take on human/universal history, cerebral at times, which any good sci-fi movie is, and the introduction of a guy like Carter gave it a classic American-style hero flick.  There are many more emotional (and romantic) subplots and I think they are worked in very effectively and dramatically (though sometimes a bit over-the-top, but I think they did this on purpose).",
      "total_reactions": 1,
      "user": "wayneskylar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Angels:",
      "total_reactions": 1,
      "user": "sesostris"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "John Carter of Mars runs hot and cold. The martian CG was pretty decent but the leads weren't up to the task and the story dragged on at times, needed some more editing. The high-jumping thing that Carter does isn't very realistic either, especially his landings, so that detracts too. However the final 20-mins of the film recover nicely and provide for a decent overall experience, mildly recommended.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I really enjoyed this movie. Once again the so called professional critics miss the mark for the most part.A nice story line, and plenty of action! The special effects are good. I saw the 2-D version and that was fine for myself and teen aged son. It was easy to get into the story and escape from the outside world. Not nearly as anti-military as Avatar was, more like war sucks but sometimes you have to fight for what you believe in, and for what is right! While leaving the Theater everyone was in a good mood and pretty much in agreement that the movie was well worth the price of admission.",
      "total_reactions": 1,
      "user": "superdv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Saw the movie John Carter of Mars this weekend with my wife.",
      "total_reactions": 1,
      "user": "cndblank"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "A+  Cowritten by Michael Chabon John Carter is the best sci fi movie in ages. Part steampunk, part Raiders of the Lost Ark, the action moves fast and the acting is surprisingly top notch. The story pays a nice homage to John Carter creator E R Burroughs in the frame story. The effects are as good as Avatar. A must see for sci-fi fans.",
      "total_reactions": 1,
      "user": "Km1967"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "This is a very good movie! Fast paced plot, some damn good special effects, and there was some chemistry between the two stars. I absolutely liked it.",
      "total_reactions": 1,
      "user": "Arkandel"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "You can't go into this film expecting high art -- it's no Kurosawa or Bergman.  You have to understand it as a variety of space opera written before science understood many things about the universe.  In that light, the movie was engaging, with some pretty excellent side actors (notably Ciaran Hinds, Dominic West and James Purefoy) and decent stars.  It should appeal to people who liked Star Wars -- it has scenes no less ridiculous than that.  It was unfairly panned by most critics in my opinion.",
      "total_reactions": 1,
      "user": "trwier"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "A highly entertaining film that is definite worth for the money you pay. The story is pretty easy to follow though you have to be careful and be a little attentive. The names are tongue-twisting at times, so that's a bit of a problem. The CGI is fantastic, the aliens are superb and very expressive. The action is pretty well-done, though some of the action bits could have been extended. The story moves along well enough though there are certain places where it may be a little confusing/unexplained. All in all, a fun, epic and dazzling film that made me laugh and immerse and enjoy like few films have been able to do in quite some time.",
      "total_reactions": 1,
      "user": "AnkBhatt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Best movie of it's kind in years! This one is in the same class as STAR WARS and RAIDERS OF THE LOST ARK. It's a science fiction masterpiece. It's an absolutely perfect movie.",
      "total_reactions": 1,
      "user": "DWKeith47501"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "The plot was nice but i think Andrew Stanton tried too hard to make the movies click but it didn't all in all i didn't enjoyed that movies that much & i was hoping the movie should be great its the least that you expect from a movie Directed by Andrew Stanton. Also in my point of view Taylor Kitsch did fit the role",
      "total_reactions": 2,
      "user": "RipuDaman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Interesting sci-fi concept but I feel they stretched out parts that were boring and shortened the parts where you expected action. The love story part feels tacked on and not well placed throughout the story. I'm betting a part two will come up, and I hope they improve the story just a bit. Also for note I saw it in 2d.",
      "total_reactions": 1,
      "user": "GoonCommando"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "I went in on a 5$ Tuesday in my cites Century Theaters hoping wanting to see the biggest adventure blockbuster thus far this year. And Ieft quite satisfied I felt a Star Wars-ish vibe and enjoyed it. I saw some flaws that could've been simply fixed and saw things that probably used up the budget that could've been without and replaced with stronger storytelling. Overall I agree with some critics but am very disappointed of how terrible its currently doing in theaters because when the movie came to a close I was hoping for a sequel.",
      "total_reactions": 1,
      "user": "zacthecreator"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "A wild ride, lots of eye candy 4 all, & kept u guessing, although u know the good guys'd win.   Review at Google: john carter sleeplessinturtleisland",
      "total_reactions": 2,
      "user": "DimitriPravdin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2012
      },
      "score": 4,
      "text": "Once upon a time, the folks at Disney wanted to make a movie that combines the qualities of Westerns, War Epics, and Science Fiction. 250 million dollars later, and we are introduced to the vast and zealous vision of â",
      "total_reactions": 1,
      "user": "AutiTakahashi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "An extraordinary movie!!  I was overwhelmed by this visually beautiful epic!  I was immersed in the story from the very beginning 'til the end...then went to see it again a few days later.  Perfect casting with Taylor Kitsch as John Carter and Lynn Collins as Dejah....two more beautiful people would be hard to find!",
      "total_reactions": 1,
      "user": "moveahead"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2012
      },
      "score": 3,
      "text": "Not bad,",
      "total_reactions": 3,
      "user": "PaperThing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2012
      },
      "score": 4,
      "text": "Based on a book series considered to be the father of modern day space operas (from Star Trek, to Star Wars, to Avatar), John Carter had a lot to live up to. Unfortunately, and ironically, it was vastly inferior to the very films that it inspired. With a story this traditional and recycled, it was important that filmmakers made extra efforts to give the movie a voice of its own, they however failed to do so. Everything on the screen has been done before, and better. Coupled with cheesy visual effects (especially considering the size of its budget) and clumsy direction, the film had very little to offer. Some of the action sequences (particularly the white ape scene) and it's pulpy qualities were fun and the characters were very easy to root for, but in the end the film misses, bringing its epic premise down to mediocrity.",
      "total_reactions": 1,
      "user": "lahaine2012"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "Really wasnt good. Boring at times lengthy and kinda a terrible plot. And disney wonders why this movie didnt make much in theaters. It just wasnt good.",
      "total_reactions": 3,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2013
      },
      "score": 0,
      "text": "worth $250 million  No way.",
      "total_reactions": 1,
      "user": "freed2077"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "hammy plot tired predictable this is why mars died as a habitable planet. Sci fi takes another body shot bad acting performance yet again from Taylor kitsch.",
      "total_reactions": 1,
      "user": "dyshpo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 2,
      "text": "An extremely fine comedy... wait what? It wasn't? It was supposed to be a sci-fi adventure film? My bad!",
      "total_reactions": 1,
      "user": "ReviewGuyX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "I wasn't sure what to expect from this film but i enjoyed what i saw. it has a very throw back feel to it with modern efects . i kept thinking of the old flash gordon movie with all the queen music in it . it also reminded me of many other older films. it feels very simple and i would not say thats a bad thing in general since this is disney after all they are trying to make this family friendly . i know my 6 year old nephew really enjoyed it and over all i thought it was a pretty solid film . if i had to complain it would be the dry acting and weak dilouge in the film and also the pacing is abit slugish. over all though worth a see especially if you have kids who like SciFi films.",
      "total_reactions": 0,
      "user": "ArkonBlade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "John Carter story (book) predates Star Wars so I can see where Star Wars got some of its ideas from John Carter. The visuals were a master piece although I wasn't too impressed with the 3D, sorry but Avatar raised the bar pretty high. The story pretty much is the usual guy saves the girl then saves the world scenario, nothing new there. Remember this is a science fiction so turn off your common sense sensor and you should have fun watching all the action in this flick as I did. Not sure if there is a part 2 in the works but they certainly left the door open for it.",
      "total_reactions": 0,
      "user": "jctejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "Typical storyline. But quite interesting... It reminded me of Star Wars a lot. (John Carter was written decades before Star Wars)",
      "total_reactions": 0,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "I think much of the negative press this film got was because of the enormous amount of money it cost to make. And yes, I can see it has extremely high production values with many exciting battle/chase/fight scenes all using very high quality CGI. I admit I have never read the Edgar Rice Burroughs ‘John Carter of Mars’ books but I’m sure those that have will have got a lot more out of this film than me. It’s an exciting adventure that (I’m afraid) has a storyline that doesn’t quite hold up today. Yes, it’s visually quite stunning in places with some very exciting action sequences along the way but the plot is a tad too over-complicated, particularly for a younger audience, and the main premise that Carter can jump is, quite frankly, very weak. So, does it deserve the vitriolic reception it received? I have to say no; it is a better film than many have made out. Was it worth spending that amount of money on making it? Again, no; although it’s not as bad a film as many have said; I still find it hard to justify the amount of money spent on it. Would I watch it again? Probably not; but I’m glad I did see it the one time.",
      "total_reactions": 0,
      "user": "Andys_Reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "I was very skeptical of this movie, I had read the plot of the books online and it sounded just too hard to accept.  Then the commercials did not really shine--they focused so much on action.  My father told me that the movie was great, watch it, and basically shut up on the criticisms til I had seen it.  He was totally right.  The richest parts of the film are the internal conflicts of the main character.  The flashbacks do a beautiful job of explaining so much in mere seconds.  Combine that with the civil war and lost causes and bam...great stuff.  The suspension of disbelief was quite easy and about 15 minutes in it was easy to accept this view of the solar system and forget all about rovers on Mars and what we scientifically know.  The final 15 minutes are a brilliant, simply brilliant ending with some twists that I won't ruin for you.  A must see!",
      "total_reactions": 0,
      "user": "Deathmonger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "I just gave John Carter a 10 but after months of reflection. I grew up reading the Princess of Mars and in fact all of the books in the Barsoom series. They were transformative. I remember picking up the first one, probably out of order, as a child in the school library. I read about the Green Man from Mars and my life changed. So, I approached this film with huge skepticism and watched it with an eye jaundiced by what I perceived to be the Disney-fication of it. Meanwhile, I read about the marketing mess, the high budget, the overreach and the staleness (these were the critics and the Hollywood blogs). But no other film, short of perhaps one of the early Star Wars films, has touched me as when John Carter at the end whispers the incantation followed by \"Barsoom\". My God this was a romantic story. Not perfect, but on a scale of 1 to 10, it touched my heart and soul (or certainly the heart and soul of the little girl who first imagined the distant worlds and the fiery Princess and the brave John Carter and his friend, the Green Man Tars Tarkas) at the level of 10. Barsoom.",
      "total_reactions": 0,
      "user": "TheKiddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Is it a bit dated and corny, sure. But, that's what John Carter of mars was, and while the movie wasn't any Avatar, it was a fun show, with heart and nice effects. You won't need your copy of \"the scientists guide to alien technology\"; --- But, bring a large bag of popcorn, sit back, and prepare for a couple of hours of enjoyable vintage comic book style  science fiction / science fantasy. This movie is a romp, rather than an epic... and it was far better than we expected going in.",
      "total_reactions": 0,
      "user": "makrtik2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Far from perfect but still manages to entertain. \"John Carter\" starts off unbelievably slow and almost as dry, barren, and lifeless as Mars itself. But it does manage to quickly pick up the pace. Featuring fantastic special effects and an enjoyable, if sometimes stale, plot. The action is satisfying and the cast great. Other than the slow opening this movies flaws are with a predictable romance and the main characters lame backstory. But these flaws don't manage to ruin the movie when it's firing on all cylinders. With humorous moments and great action scenes the movie succeeds at being an enjoyable experience, even if it's not what I would call a great movie. The main character's powers are what gives the action scenes an edge. Watching \"John Carter\" leap through the air like Marvel's \"Incredible Hulk\" is constantly entertaining, and put the feats of enhanced strength put the new Superman movie to shame. So overall \"John Carter\" is an enjoyable experience, but it does have some issues holding back from greatness.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "I think I agree with Rotten Tomatoes' verdict, it's ridiculous fun. \"While John Carter looks terrific and delivers its share of pulpy thrills, it also suffers from uneven pacing and occasionally incomprehensible plotting and characterization.\"",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2012
      },
      "score": 5,
      "text": "John Carter is a very imaginative yet B rate movie that calls itself science fiction. Though the special effects are wonderful, the characters are all one-sided, the plot is very simple and predictable, and it blatantly ignores many scientific facts that even an elementary school student should know. However, the movie can be very creative at times, with dazzling scenery and intricate landscapes, as well as creatures. I get the impression that this would be what Mars would be like if it actually did have an atmosphere.",
      "total_reactions": 0,
      "user": "SinisterVortex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 7,
      "text": "John Carter was surprisingly a fun filled ride from start to finish. Not sure what the hate is all about and why Disney could lose so much money on this venture. It was a tough book to adapt to the big screen, but I think it was done fairly well.",
      "total_reactions": 0,
      "user": "hcookie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "the movie is worth seeing.  plain and simple.  Avatar did the same type of thing better a couple years ago and unfortunately a big part of being successful is getting there first  (no matter when the material originated)",
      "total_reactions": 0,
      "user": "ZenRobot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Having read such negative reviews from the critics, I was unsure if I would drop $20 on it. I had some cheap tickets and thought it was worth a risk. i am so glad I did. Thoroughly enjoyable spectacle, I enjoyed it immensely.",
      "total_reactions": 0,
      "user": "Baggins_oz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Going into the movie, I was questionable about the movie and my friend was all about the movie. Afterwards, I enjoyed it and he questioned it. Maybe it was my expectation thinking that it was going to feel like a Star Wars Episode 1-3 type of movie is why I ended up liking it. I don't know if I would go back for the IMAX 3D... but it looked great there. Only real complaint is the theater played 35 minutes of previews... too much.",
      "total_reactions": 0,
      "user": "grungebob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "As a person who plays many many computer games, I was not expecting to be entertained as much I I thought I would when I wen to see this movie. Now I have not real the Novels but I was taken aback by how well this movie had been put together, the visual effects are rather excellent, the characters meaningful and true to human nature.",
      "total_reactions": 0,
      "user": "NorBdelta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "Looking at the critic reviews,  the Positive and Average far outnumber the Negative ones so I really do not understand why was this received negatively. I think $175 mil box office sounds successful only until you consider what it cost to make.  However this film has just started to come out World Wide on Blu-Ray and Dvd and I think it will still be a great success. I saw this film with wife and children and everybody loved it. I thought it was very entertaining movie and Taylor Kitch was good but it was the gorgeous Lynn Collins, the Wolverine squeeze, who stole the show. James Purefoy, of the sadly US shunned Solomon Kane, was also great.  A great fantasy adventure movie, not for the Woody Allen fans, probably.",
      "total_reactions": 0,
      "user": "Morituri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "John Carter is an experience worth experiencing and it is most definitly not a bore. However the film does have it's faults. This film seems rushed by thedirector. The editing is sloppy and many things in the film that seem like large and key pieces to the plot are rushed when there are 2 minute long scenes of drama that ultimately does not affect the viewer. Too bad because the film had many scenes that are so well done but when i think of this film i will only be able to think of it's faults.",
      "total_reactions": 0,
      "user": "cabrita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "A good made movie that showcases some really good effects and action as well as not forgetting emotion in its plot, Jhon Carter is a good experiance that will suprise a lot of people looking for a blast of fresh air in story telling and action, though its length and pacing could be a bit better the movie entertains nonetheless",
      "total_reactions": 0,
      "user": "Rice303"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I went into this movie with my family not expecting too much for what I was gonna see. We just wanted to see a cool movie in the theater because we hadn't been to the movie theater for a long while, up until March. Let me tell you though, I thought this movie was very surprising. My family and I have never read the book of John Carter on Mars, so that might be why I was surprised by how the story turned out. All the sort of alien creatures that John Carter meets, are awesome. The acting involved with the aliens are quite believable. The plot is well told as well, and with a good supporting cast, it makes for some good dialogue. Okay maybe not outstanding dialogue, but it is well done. My point is, if you go into this movie not expecting much out of it, and maybe if you haven't read any info or read the book, except maybe seeing a trailer or TV spot, than you'll probably be quite surprised by John Carter. So the verdict on this movie I give John Carter, a 8.1 out of 10. Now it's not the most amazing movie I've seen, that's for sure, but it is quite good.",
      "total_reactions": 0,
      "user": "thatcritic47"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "John Carter is too boring to enjoy the whole movie . With a bad script , bad dialogues and lifeless acting made the movie too hard to enjoy even with those amazing effects and animations .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Great movie for the whole family. John Carter is a funny, action packed movie. Yo will enjoy the time spent on the script, and effects. I watched it with my parents and they laughed more thank I did.",
      "total_reactions": 0,
      "user": "josephbalentine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "I was thinking this movie would stink when I took notice of the critics reviews but It wasn't. In fact, it makes up for a nice and entertaining fantasy story with a twist in the ending that holds your breath to the very last minutes. Indeed a nice movie, I enjoyed watching it. This does not contain a juggled story like Avatar with an \"okay usa!\" feeling.",
      "total_reactions": 0,
      "user": "jamesensor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This movie deserved better attention than it got in theaters. It is on par with the top Star Wars and Avatar graphics in terms of special effects. Although the story is dumb overall it is fun and a romance at that. I loved the movie, had lots of fun watching it, and when I showed it on my 3D TV to people who were wanting to watch a movie they LOVED it. Actually they were completely blown away by the movie and wondering why they didn't ever hear of it before. It is block buster in all aspects and it deserves a sequel.",
      "total_reactions": 0,
      "user": "elfelixg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Having just recently just read the books in preparation for this release I was really excited to see this movie. The character work was well done. The special effects were amazing. The story line staggered at times. But with all of it's supposed short-comings, I felt that this was a very cool movie. I will agree that this movie could do with a directors cut when it comes to the DVD/Blu-ray release only to address some of the finer story points that I felt could do with some further exposition.",
      "total_reactions": 0,
      "user": "TheRedZombie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "This one's an adaptation of the Edgar Rice Burroughs' \"A Princess from Mars\" which was published almost a century ago. While the cast seem to fit their roles, their delivery falls between poor and fair. The costumes may be eye-catching, sometimes you'll get to think whether it was appropriate in a planet farther away from the sun compared to Earth. Anyway, we can not question that much since John Carter is sci-fi. The visual effects, sound, and cinematography are satisfactory. The movie brings a lot of memories from some of the famous movies with the same genre. However, it still deserves a \"good one\".",
      "total_reactions": 0,
      "user": "aozeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "It wasn't great but it WASN'T bad either.  I actually enjoyed seeing JC brought to the big screen.  It was an ambitious undertaking.  If you are a JC fan, go reward yourself.",
      "total_reactions": 0,
      "user": "sdcoates"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2012
      },
      "score": 5,
      "text": "I'll have to side with the critics on this one: This movie is a failure. It failed, because the people who made it didn't understand the source material. Not the director, not the screen writer, not the creature designer, not the camera man, not the casting director. The movie is based on a 1912 novel that is utter crap in a literary sense, but that WORKS, because it tickles our most primal nerves. The hero in the book kills all the bad guys and saves the Damsel in Distress. That's the full extent of his characterization. The original John Carter is the unstoppable force made flesh. He is the quintessential Alpha Man that faces horrific foes of fangs, claws and tusks with nothing but sinew, muscle and an iron will. And before he even gets to the real action on Mars, he kills a bunch of hapless Native Americans loitering in his way. There's nothing sentimental or apologetic about it, them being raging savages after all, wholly deserving of the white man's lead and steel! That's the sentiment of the original novel anyway. If you for some reason wish to make a movie of such a book, for Christ's sake make it GRITTY! Make it brutal and menacing! Put the camera close to the hero's sweaty and blood-stained muscles! Make it a masterful piece of shameless macho porn dammit! But the creators just didn't get the basic fact: if you sanitize a classic raw macho porn novel to modern sensitivities, and put a brooding metro-sexual underwear model in the lead, nothing of value remains. The novel may be crap, but it has ONE redeeming quality - it reconnects the reader with the powerful untamed animus lurking under his civilized surface. Yes, I said HIS, because such works are for the boys exclusively! Strip all that away, add a little feminist/multicultural/care-bear sensitivity to the mix, and you get \"John Carter\" the Disney Family Movie. This John Carter doesn't want to fight, he doesn't want to tell good guys from bad, because aren't we all the same, can't we all just get along? He meets Martian Tharks, immense beast-like humanoids, formidable foes with four muscular arms and tusks they use to rip open their victim's belly (in the book), here reduced to confused skinny wimps with weak degenerated limbs and sad/scared looks on their faces. He saves the beautiful and sexy Damsel in Distress (in the book), here reduced to a not all that sexy Xena-like strong-woman who doesn't require saving in the least. When she finally (!) shows some leg, she saps all erotic charge from the moment by lamenting how \"vulgar\" her dress is, and that it's not in her character to wear such things. Gosh, my repressed inner Alpha Male really wants to come out of hiding and be this woman's Hero. Not. She's the stuff teenage boy's dreams are made of. Not. The overall feeling this movie gives me, is that the creators absolutely fear and loathe the masculine. They despise male strength. It's as if they do everything in their might to emasculate the poor John Carter. It's not just that they sanitize him into respecting Native American Culture, they actively sabotage his machoness. They pick camera angles that make him seem small and insignificant. They turn his helpless  damsel into a formidable warrior. They even insert new super-villains to the story! This is perhaps the biggest crime of all. The Mars of the novel is a barbarian world, Mars is the Planet of WAR! The conflict is about the good guys fighting the bad guys, who are just like the good guys, only BAD. But in the movie, a mysterious race of super-villains are added, shape-shifting and teleporting immortal techno-mages with beam weapons that control everything from behind the scenes, both on Mars and on Earth! The book villain is a mere puppet to these scheming godlike beings in the movie. They are as superior to John Carter as a human to an ant. Any sense of satisfaction in the Hero's ultimate victory is hollowed out by the fact it amounts to absolutely NOTHING. The true villains are still in control, and there is NOTHING poor insignificant John Carter can do to even touch them. He can swing a sword at them, and they will only dematerialize and disappear like smoke. His muscles are useless against such a foe. He is not an Alpha Male rising to power on the Planet of War, he is a pathetic loser, a primitive subhuman, a ridiculous anachronistic fossil. Yes, we get the message. The male energy is dangerous, and must be suppressed. Alright. Perhaps it's even for the best. But then, WHY did you feel a need to make a movie about John Carter?",
      "total_reactions": 0,
      "user": "LordLardAss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Not a great movie by any means and a few really rough performances. But there is something to be said for the grand scope and the pretty cool effects of the aliens. Would not recommend paying a whole lot for DVD/Blu-ray, but if you can find a copy for $5 or so you wouldn't be completely wasting your time. So much potential...but sadly that's all that remains for most of the film.",
      "total_reactions": 0,
      "user": "Odin777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Well, I went this week to see â",
      "total_reactions": 0,
      "user": "BadMovieLover"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "I was sceptical about John Carter from the minute I saw the trailer. It looked like James Cameron and George Lucas had brainstormed a science-fiction film together. But then I saw Andrew Stanton's name in the credits and decided to give it a try. It wasn't great.- the acting was flawed, there was some choppy cinematography and the story didn't flow so well- but it was enjoyable. Not perfect, but fun all the same.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "John Carter has a good story and even though its a full 2 hours it never gets boring which is a real achievement these days.  The setting and its aliens and red humans are interesting and most of the CGI is very good. It totally overdoes the jumping thing in the 1st half of the movie but it looks good and there are good battle scenes.",
      "total_reactions": 0,
      "user": "SwarleyStinson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Probably one of the more underrated films I've seen in a while. Sure it doesn't have A-List actors, wildly intense nature scenes, or the greatest plot, but I found the movie quite enjoyable and very underrated. While the plot is somewhat cliche (you got the tough reluctant hero with the hot damsel in distress), you can't help but enjoy the subtle fun this movie brings. I found the portrayal of the characters to be very fitting; John, a rough southern confederate soldier going through a hard time after the loss of his family. The female lead was okay, script made her seem a little naggy. The CGI, while not as visually stunning as other movies, brought a believable Mars atmosphere (if it were inhabited by civilization). I think the critics looked at the price of the movie, and expected something on the level of Avatar. And because no one knew what John Carter was really about was probably why it didn't do as well in theaters. I'd even argue the Disney name might have hurt this movie. But I found this movie very enjoyable and encourage people to go out and see this movie if you are into the action/adventure genre.",
      "total_reactions": 0,
      "user": "abc617"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "Had a lot of fun with this one, which I've been waiting for ever since I read the books as a young teenage boy. Don't listen to the naysayers, John Carter is a good time to be had at the movies. Good old school Sci-Fi adventure!",
      "total_reactions": 0,
      "user": "Eryximachus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The \"official\" Critics are too low for this one! Much love and care went into the making of this movie, and it shows.",
      "total_reactions": 0,
      "user": "Hurzt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I am a fan of the original books and was looking forward to this film.  I don't understand the low critic reviews, I really liked the movie.  My only complaint would be that the character relationships didn't seem to develop enough for m tastes, so certain character motivations seem questionable at points.  Overall good though!  Effects, design etc all above par.",
      "total_reactions": 0,
      "user": "eightcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "To see a diffferent view of John Carter and a detailed discussion of the actors and acting visit http://bobneilson.org/2012/03/14/john-carter-stillborn-franchise/",
      "total_reactions": 0,
      "user": "bobn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The film is exactly what you expect going in. There is a decent plot supplemented by gorgeous backgrounds and the occasional action scene. Shakespeare this is not, but is a genuine good time with its mixture of humor, scifi, and western themes.",
      "total_reactions": 0,
      "user": "dc127"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "I watched this movie in 3D and really liked the special effect and the kind of imagination the created. I liked the characters and aliens that were statistical. Really good movie and worth the money..",
      "total_reactions": 0,
      "user": "Rudolfi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "My wife and I had a great night at the movies with this film. I read the books when I was around twelve, was anticipating a great movie, and was not disappointed. I am surprised that some of the reviews lead one to believe that this film was influenced by \"Star Wars\" and \"Avatar\" when in reality those films were influenced by the John Carter series of books.",
      "total_reactions": 0,
      "user": "Vonronken"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "A fun and fantastic adventure story. Wonderful, imaginative settings and characters, and it feels like a return to the fun romps of Star Wars and Indiana Jones- back when they were good!",
      "total_reactions": 0,
      "user": "Turambar29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Pretty good movie and the professional reviews seem to be unfair.  It had some good humor - the Martian dog was very funny - it wasn't excessively violent - just an enjoyable popcorn movie.  Certainly better than the Phantom Menace and similar to Flash Gordon.",
      "total_reactions": 0,
      "user": "AlphaMel1968"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I came into the movie without any expectations due to the fact that the marketing just didn't give me enough to have any.  The marketing was so bad that I had to look up information on where the stories came from in the first place.  I went to the IMAX 3D version and found it to be highly entertaining and well done.  The IMAX 3D was good and aided the film without looking gimmicky.",
      "total_reactions": 0,
      "user": "jmajr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "I read the entire series of books as a kid and again recently when I heard this movie was being made. Had I not read the books I would have been 95% thrilled with this movie. The special effects were superb the storyline was kind of shaky at times but easy to follow.",
      "total_reactions": 0,
      "user": "Bonzai69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "This is one of very few movies I actually enjoyed watching. It delivered for me even though I did not expect it to. I actually cared about the characters and enjoyed the story. Something that happens very rarely for me these days.",
      "total_reactions": 0,
      "user": "Metascoreman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Although John Carter was directed by Andrew Stanton (the genius behind two of Pixar's greatest masterpieces: WALL-E and Finding Nemo), my expectations for the movie were pretty neutral, but once again Mr. Stanton has directed a good movie and exceeded my expectations. I agree with a lot of critics on the movie's pacing issues, but apart from that, the special effects are outstanding, the action scenes are tons of fun, and the story is complex and interesting. I give this movie an 8/10. It's not as great as WALL-E and Finding Nemo (those are BIG shoes to fill!), but John Carter is a thrilling, fun-filled sci-fi adventure that is definitely worth seeing.",
      "total_reactions": 0,
      "user": "FlutterPie93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "This was the best film I've seen this year! I never read the books but, for a movie, it was well done. What especially drove the movie for me was Deja Thoris played by Lynn Collins. It's hard to find movies where actors make you feel like they're really there, in a fantasy setting, but Lynn Collins performance was fantastic. After all is said and done, if the actors don't make you care about what is happening in their given situation, but also do it in a way that is believable, the movie simply doesn't work. IMO this is Lynn Collins film to stardom. John Carter, played by Taylor Kitsch performance was mediocre. I figure they probably cast him for his looks more than anything. Dialogue wasn't the greatest but it was good. Visual effects; fantastic. Story was surprisingly decent. I like how the director, Andrew Stanton, did not make the story feel rushed by adding small details like John Carter repeatedly trying to escape, which also served to build character revelation. I also like how, even though this was a science fiction movie with wild aliens and bizarre settings, it's a love story at heart, which anyone can relate to.",
      "total_reactions": 0,
      "user": "DonnyT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Overall a good movie. It follows the cliche movie plot, good guy ,meets girl, defeats bad guy, wins girl, but does it a unique way that I found entertaining. I only remember this was in 3D because I paid an extra $3 for the glasses.",
      "total_reactions": 0,
      "user": "pepsens"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2013
      },
      "score": 5,
      "text": "Some time has passed since I watched John Carter and I certainly hold no grudges against it. It wasn't the complete write-off I was expecting, although it is certainly not without it's flaws. I think  I preferred it to Battleship, although I can't think of what I must have done to deserve being forced to choose between either.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I am going to give this movie love because it deserves it. It also should be getting the box office numbers that The Hunger Games is currently getting. John Carter is a better film. It was a fun, entertaining time. The story, the direction, the acting, the effects work were all great. If you love SciFi, you should go and see it right now. It is possible that because of the horrible title and the horrible trailers this movie didn't do nowhere close to as well as it should have done. Also, who are there 50-70 year old men that are movie critics these days? Don't listen to them.",
      "total_reactions": 0,
      "user": "Hwak"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Es decepcionante ver como la adaptacion de un libro que inspiro tantas grandes peliculas, se queda corta en todos los aspectos. John Carter podra tener unos buenos efectos especiales, pero eso es todo. Le falta muchisimo para poder ser lo que uno espera. Tiene un grave problema de secuencia y la banda sonora es obsoleta. Una de las peliculas mas decepcionantes que he visto.",
      "total_reactions": 0,
      "user": "ObbiePR18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "I remember when I first saw the trailer I was like who the F is John Carter? Unfortunately Disney didn't do much to inform me. So one day I decided to do some google research for myself. Since the movie looked good and I love sci-fi, I was slightly interested. I soon found out that this was actually a 100 year old book series that was written by the same dude that wrote Tarzan. Edgar Rice Burroughs. And most sci-fi films including Star Wars and Avatar are ripoffs of these original stories. The more I learned about it (on my own, no thanks to Disney marketing) the more I was interested to see it. I still hated the title though. I figured if I said it, others would also say; Who the F is John Carter? I finally went to see it, and I just loved it. My favorite stand out performance was Lynn Collins as Dejah Thoris. Sexy, smart and strong. I'm really happy I didn't heed negative reviews and went to see it. It inspired me to read the original books (100% FREE by the way on Kindle store).",
      "total_reactions": 0,
      "user": "metalam"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Iâ",
      "total_reactions": 0,
      "user": "Taranaich"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "In this opinion  John Carter turn out to be a hell of movie that I have seen. Despite the films disappointment by Disney, bad reviews from the critics, and the box office in North America,  John Carter was stronger in overseas box office . the screenplay was okay(details need more to the story.), Andrew Stanton did a good job for directing the film, Taylor Kitsch did better in this film(maybe his best  breakthrough role or his next upcoming film Battleship.). Lynn Collins did also better in this film too(a breakthrough role for her.) Willem Dafoe is a well know actor, this is his by far best work he ever did. I hope they go on doing the next book to Edgar Rice Burroughs masterpiece series: the Gods of Mars. John Carter is one of my best films I have seen so far.",
      "total_reactions": 0,
      "user": "kashmanthillet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "What the critics missed was that this was not the wall-to-wall action-fest that Disney promoted -- it was a romantic sci-fi saga that remained true to the Edgar Rice Burroughs novels AND had wonderfully stirring action in support of that.  What I will remember most is the absolutely flawless pacing of the entire movie from beginning to end.",
      "total_reactions": 0,
      "user": "Barsoomist"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "I loved this movie, it had great action, great CG and a lot more romance than any of the trailers showed. The  ending was well thought out and it really brought the film to a wonderful conclusion that left you wanting to see the next movie... which I hope they make!",
      "total_reactions": 0,
      "user": "LynnHardy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "I avoided JOHN CARTER for awhile for two reasons: 1.) I loved the books as a kid and I didn't want to ruin my memories of them, and; 2.) the trailers and the marketing made the movie look awful.  I finally plopped down my 12 bucks to see it in 3-D and ... SURPRISE! ... I did not feel gypped.  In fact, I actually liked it.  Sure, the movie has its problems and, yes, Taylor Kitsch doesn't have a whole lot of charisma, but it's rippin' good entertainment.",
      "total_reactions": 0,
      "user": "mark45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "this film to my expectation was a complete and great way to show the mixing of star wars with avatar. its cgi and the essence of religion and creativity with the transporting of humans to different planets was a smart move. this film really had me on the edge of my seat. making me think \"what next\"and for the first time in my rating history with films this is one im giving a 9.5. its a great film and recommend it to the lovers of Disney and others who are interested to see what others say...well this is one of them :D enjoy.",
      "total_reactions": 0,
      "user": "RedMoon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "John Carter was an interesting take on Burroughs' book. The film had the right amount of action, science fiction, and save the world talk. The only thing that could have been a little more consolidated was how many times John would finally realize he wanted to stop thinking about himself. I think there were four different \"I need to change\" speeches in the movie. Other than that, the film was entertaining. Sadly, Disney lost the bank on this movie as the chance of seeing John Carter again in future films is pretty slim.",
      "total_reactions": 0,
      "user": "Fullmetal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2012
      },
      "score": 7,
      "text": "An entertaining film, sound and visual effects very good, the story could have been better but was not the case, Andrew Stanton has made a film acceptable.",
      "total_reactions": 0,
      "user": "iKevin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "This movie grossed two hundred eighty million worldwide by June 2012.  This is old fashioned Saturday afternoon science fiction fantasy story telling at its best.  Maybe after we all buy the DVD, Disney will start making the sequels.  Have \"Critics\" forgotten how to have fun at the movies.",
      "total_reactions": 0,
      "user": "stevens343"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 4,
      "text": "Having heard the reviews about this movie, I went in with expectations below sea level. Now it was better than what I expected, in that it wasn't absolutely awful, having said that, it wasn't good either. Really this film falls down due to a charisma less leading performance, a silly plot which makes less than no sense, and really it's just terribly dull. Although Mark Strong, as always- is a fantastic screen presence, and those big white monsters fellows are quite impressive.",
      "total_reactions": 0,
      "user": "Satiricalewok"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I think this is one of the greatest movie by Disney's Studio, I don't know why it was so undervalued in box office... what a pity! Edgar Rice Burroughs created an amazing story with charismatic characters in an imaginative world; Disney takes these element and mixes them into a daydreaming movie with an excellent cast! Hope that a sequel will be released soon 4 fans!",
      "total_reactions": 0,
      "user": "Leviathan83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Disney's marketing department almost killed this 250m$ film by animation director Andrew Stanton with their incompetence. It's based on the book by Edgar Rice Burroughs, has tons of computer animation and doesn't look too bad, but I didn't find the story overly interesting or original and the 'long jumps' Carter can make, look fake (the physics don't compute) and the green aliens look too much like creatures from Attack of the Clones. Taylor Kitch (who also played in 209 m$ flop 'Battleship') does an ok acting job (they dug him up from a TV series apparently), but the supporting cast (mostly Britisch actors) is luckily somewhat better. From a quarter billion dollar scifi flick you would expect it to be at least epic, but this film is nothing more than a sunday afternoon snack, so don't feel bad if you missed in at the cinemas :)",
      "total_reactions": 0,
      "user": "Apemonkey666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "John Carter is silly. Those are the four defining words for this mega theatrical flop. The story was very corresponding to both big hit cinema films in Avatar, and the Star Wars sage. you been there, done that, but seen better. The movie starts off well, and keeps my mind on the movie with a couple humorous scenes, and a good action sequence. Then, the movie picks up even more when John Carter is first transported to Mars. You then learn that he has a special gift that allows him to jump extremely high. All of this was very intrigueing to me, and I was defiantly enjoying the movie, but them the movie catapults straight down. The plot becomes full of holes with uneven pacing. John Carter became lifeless with mediocre action scenes and added characters with maps depth. yes, the movie has amazing visual effects that are outstanding, and very good looking set pieces, and with the acting being bi-able, with Taylor Kitsch playing a decent role. the movie becomes very forgetting. John Carter had potential, but with a lot of flaws and not a lot of rights, John Carter became a below average syfi adventure.",
      "total_reactions": 0,
      "user": "Tbrown15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "John Carter:",
      "total_reactions": 0,
      "user": "Pepinobuena"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 8,
      "text": "John Carter is an old fashioned and extremely fun escape from earth. I went in expecting very little and was completely surprised that I enjoyed it as much as I did. The CGI work is great and fun alongside a charismatic cast that gives in fully to the big goofy romp. I heard the film bombed at the box office and a large sum of money was lost due to some advertising issues. That is such a shame, considering John Carter does reach some great moments. I think a lot of people will take a liking to Disney's latest visual feast and it deserves more than it was dealt.",
      "total_reactions": 0,
      "user": "joshcoble21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "While this movie is nothing special it is certainly entertaining. One should not go to the theater expecting some masterpiece but simply a fun and simple movie. If posed with the choice to see this movie again, I would likely not watch it due to the fact that while it is not confusing, it's also extremely simple.",
      "total_reactions": 0,
      "user": "Riflenator1234"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "It is obvious to say that John Carter's visuals are simply awesome and its action scenes are fun to watch, but I would still say it suffers enough from other factors to not completely recommend it. It has a very convoluted plot and some unmemorable - but not bad - performances. Andrew Stanton seemed like he could make the foray to directing live action, but he doesn't seem to notice that there is an enduring tone of seriousness throughout that takes the fun away from the picture. This is what can be said for most studio releases these days, so compared to the norm, John Carter isn't actually half bad, its just the other half isn't magnificent enough to sustain the gigantic budget supporting the film. But in the end the question remains - would I recommend John Carter? Eehhhhhh . . . I guess so.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Taylor Kitsch is a bad actor.  But besides that, John Carter is actually quite good.  The plot has some pacing issues, and the movie can come off as a cheesy cliché at times, but sci-fi buffs should really try this one out for themselves.",
      "total_reactions": 0,
      "user": "mgyukeri"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Wow, did this movie look beautiful. \"John Carter\" is a fun adventure movie that'll keep you entertained. Unfortunately, it's a little hard to follow and drags a little towards the middle.",
      "total_reactions": 0,
      "user": "snazzyjuice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Thia movie is brilliant! I absolutely LOVED it! The action was incredible, the effects were gorgeous and the story was absolutely amazing! Please, please, PLEASE, help support this fantastic movie and go see it RIGHT NOW!",
      "total_reactions": 0,
      "user": "CBeckman25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "If you liked the original Star Wars as a kid I can't see you not liking this.  I have watched it more than once already and will watch it again. I was bored by Avatar but loved this.",
      "total_reactions": 0,
      "user": "MFC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "It's great to look at. Disney does that well. You gotta give it up for them on this aspect. The original score is good as well. On the other hand, despite the reasonably good acting, the characters were simply not very likable to me. Story-wise, it feels familiar, which is generally never good in a sci-fi/fantasy movie, and it lacks a bigger differentiation between the people from Zodanga and the people from Helium, as well as a background on how the war started. I felt bored a couple of times watching it. Overall, this movie is just passable. It had a lot of potential, though",
      "total_reactions": 0,
      "user": "ImOnFire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "I loved this movie. I cant believe people say bad things about yet hpe up movies like The Hunger Games. If you like movies that take you to another world this is a must watch. I actualy watched it a couple months ago and have yet to watch a movie at it`s level. I don`t care what other people think but wish more people liked it so that could make another one.",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "John Carter has some amazing visual elements that are some of the best I have ever seen; the cgi is absolutely fantastic and certainly makes the film easy to watch. It's easy to see where the money was spent on this project. However, it suffers considerably due to major pacing problems, making the film feel uneven. Thus resulting in a film that, unfortunately, is disappointing and forgettable.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Having read the John Carter series of books as a boy and loving them, I was somewhat hesitant to see this movie.  My hesitation was unfounded because I thoroughly enjoyed it.  It was a great visual escape into a world I had known and loved as a boy.  The effects were wonderful and the acting was very good.  I highly recommend this movie.",
      "total_reactions": 0,
      "user": "Patrick1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "I'm really confused by all the negative reviews of this movie. I too avoided watching the film due to all the poor press. I should have remembered that most \"professional\" critics also panned \"Star Wars\" and \"Raiders of the Lost Ark\". Anyway, I finally watched it and I'm glad I did!",
      "total_reactions": 0,
      "user": "Ubai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "I read the book in the 50 's as a boy, in fact all of Ned's books.   I really like the movie simply because of the subject matter, however the cutting room floor and finances is probably why so much is missing.  I would have left the original opening scenes i think.  It requires reading the book to understand some of the transitions and several key chapters from the book are missing which would help with context and connectivity.   I hope Disney comes back and produces Warlord of Mars as a sequel.",
      "total_reactions": 0,
      "user": "Brinks1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 3,
      "text": "John Carter looks great one of the more visually pleasing movies of the year, but the story is pointless and by the end you just don't care what side wins or loses.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "The movie was given to me as a gift for Father's Day and I was a little nervous wondering if I would really like it. I thought I would like it after seeing all of the trailers for the movies and many people online who said they liked it have enjoyed the movie for the same reasons I thought I would. They said it was a fun adventure that had some great special effects. However, it received mixed reviews upon release and it did not do well at the box office. After viewing it I have to say I really liked it!",
      "total_reactions": 0,
      "user": "Gojira63"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "'John Carter' is brilliant, and I'd love to see a sequel. The cast is perfect, the plot, pace, cinematography, CGI, it's all very good. What it is, is a swashbuckling, Errol Flynn-like melodrama set in space, as the author intended. It is, dare I say 'traditional' story telling, in turns funny, exciting, dramatic, and easily as good as any Spielberg or Lucas production. What it isn't, is the kind of film deemed interesting to the critics, because they've unfairly panned it. I even shed a tear at the end, I was that caught-up in this fantastic, old school space adventure. Highly recommended.",
      "total_reactions": 0,
      "user": "m0ngy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "John Carter is actually not that bad of a film when you think about it sure it may have not lived up to the hype but that was because we had already seen pretty everything the movie had to offer also the fact that they placed the movie between \"The Lorax\" and \"The Hunger Games\" which was a completely stupid idea still though i had an enjoyable time watching the movie and wouldn't mind a sequel but that will never happen at least not for a really really long time. I thought the cast all did solid performances Taylor Kitsch wasn't so annoying in this movie as he has been in others, Lynn Collins was so freaking gorgeous with all her outfits and those damn blue eyes so gorgeous, i totally forgot that",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "This was an awesome movie. The writing is brilliant, the acting is exactly right, and the action is good to great. The reason critics did not like it is because they are too busy watching bad Pixar talking animal movies. If you want to know where Dune, Star Wars, and tons of other sci-fi classics come from, see this movie. And then read the comics from the 70s.",
      "total_reactions": 0,
      "user": "Seanandethan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "It's a Great movie. Do not understand why this film failed at a level so great. The performances were good, had a good script, was well directed and the end was only average.",
      "total_reactions": 0,
      "user": "lelouchMF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "This is the old time style of sci-fi, easy to tell this is based on a very very old book, before science fiction became cynical number crunching but instead was wild imaginations similar to the jule verne books like journey to the center of the earth and the like.",
      "total_reactions": 0,
      "user": "nilsy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2016
      },
      "score": 10,
      "text": "this movie is old by now and supposedly a box office flop but it has become one of my favorite movies in recent years. i do not trust the critics reviews and know that many movies that are now classics were panned by critics in their day. i love this movie and hope they will make a 2nd. i love the special effects and originality. it has a lot of heart and  great music and Lynn Collins was beautiful and Taylor Kitsch was perfect.  i really do not understand why people did not like this and really dont care.",
      "total_reactions": 0,
      "user": "harsubagh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Aventura desde o início! O filme possui leves traços de humor durante a trama, o que o torna muito interessante, pois enquanto o espectador está bem focado na telinha, acaba sendo surpreendido com as partes de humor. Além disso, a história é muito boa. Há muita ação, também. O casal principal desta aventura foi muito bem escolhido. Vocês perceberão que eles combinam muito, o que torna a experiência do filme mais envolvente.",
      "total_reactions": 0,
      "user": "Loroshow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "A mightily entertaining, oft-cheesy, oft-soaring spectacle packed with more pulp than Florida's finest fruit.",
      "total_reactions": 0,
      "user": "audreythomas25"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Taylor Kitsch looks like that he felt so seriously thinned after being in the set for his role as John Carter. The visual effects kept me up but this movie does not feel like a decent time waster because after a few minutes, the movie begins to make no sense at all thus making me stop watching it.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}