{
  "mc_avg_user_score": 3.9,
  "mc_metascore": 33,
  "mc_mixed_rating_frequency": 36,
  "mc_movie_name": "Jonah Hex",
  "mc_negative_rating_frequency": 74,
  "mc_positive_rating_frequency": 28,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "\"Jonah Hex\" is a terrible wild-western action flick that succeeds in mindless action but fails with a obvious plot.",
      "total_reactions": 7,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Jonah Hex was a huge disappointment, bad acting, unenjoyable characters, and a poor story hold this back, the only redeeming features are it's ok action scenes which still aren't that good or a reason to see this terrible movie, I would highly recommend on not watching this movie.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "Jonah Hex was a worst comic-book adaptation of all time and they spend entire money was showing 88 minutes with nothing interest,what's up with that?",
      "total_reactions": 4,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 5,
      "text": "\"Jonah Hex is another blandish Western Derango kinda of flick , that tries to hard to be the next Wild Wild West , it runs a mere 72mins , it moves quick , Brolin tries to Hard , but it was somewhat entertaining which i can muster a mild recommendation..\" .. C",
      "total_reactions": 4,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 2,
      "text": "At a running time of about 80 minutes â",
      "total_reactions": 4,
      "user": "Duke"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2010
      },
      "score": 3,
      "text": "I have not read the comic but it must me much better than this mess. 81 long minutes of inept direction, pointless flashbacks, visions of the future and explanations (instead of a coherent backstory told in sequence), insanely loud soundtrack and frenetic editing. Done properly, in order (origin-crisis-resolution) at a slower pace, it could have been a nice supernatural/steam-punk western with a deformed bounty hunter from hell who can talk to dead people, his horse Horse, his ugly dog, his incredible tight-waisted sidekick Whora Croft (Megan Fox) and the 19th century A-bomb. However, this jumbled mess makes even \"Wild Wild West\" look competently made. A waste of a talented cast destroyed by the horrible direction.",
      "total_reactions": 2,
      "user": "KundK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 6,
      "text": "While it's not as bad as some reviews might lead you to believe, it still fails because of a poor screenplay. All the more disappointing to me when I learned that Mark Neveldine and Brian Taylor (the guys behind the brilliantly bonkers Crank) wrote it. It's a shame they couldn't make more of what is very good source material. Despite the poor screenplay, I made it through the full 80 or so minutes simply because it's fairly well directed (at times the film looks beautiful) and the action set-pieces do entertain, especially a brilliant but brief train robbery in the opening minutes. It's the bits inbetween the action that hold Jonah Hex down. That, and some pretty godawful CGI, which to be fair, isn't terrible throughout the film, but very noticeable when it is. There is a good film in here somewhere, and at times we can catch a glimpse of it, but in the end this really feels like a missed opportunity.",
      "total_reactions": 2,
      "user": "SplashyAxis"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "Awesome movie! Can't understand all the low ratings, maybe critics were expecting a Disney animation about a western drama. I can't believe I didn't watch it in theaters thinking it would be a bad movie after reading this senseless reviews.",
      "total_reactions": 5,
      "user": "LucasP"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "From his 2008 novel \"Man in the Dark\", Paul Auster writes: \"In the men's room, he finally took the trouble to examine the money and was encouraged to see the face of Ulysees S. Grant engraved on the front of the bill.\" Owen Brick, the man in the dark, wakes up one day, inexplicably, staring up from a hole. In the other America, there was no 9/11, no war with Iraq. This America of August Brill's making has state after state breaking away from the union after George W. Bush was sworn into office. And while some things may remain the same(Grant on the fifty-dollar bill), there are differences that makes this \"weird world roll on.\" The weird world rolls on in \"Jonah Hex\", too. Set in the civil war, this alternative western, because of its graphic novel pedigree, doesn't play like a descendant of Ned Buntline's play about Buffalo Bill(\"The Scouts of the Prairie\"), and the \"shoot 'em up\" novels of Zane Grey and Max Brand, which lent the film genre its template. Because Jonah Hex(Josh Brolin) was originally a comic book character, not only is the cowboy an anti-hero; he's also an anti-superhero, as well. He has two daddies: John Wayne and Superman. When President Grant asks for the services of the confederate soldier-turned-bounty hunter, it's like Jimmy Carter forming a partnership with The Man of Steel, had Richard Lester's \"Superman\" employed the former peanut farmer instead of a generic commander-in-chief. In this other America, Eli Whitney left behind plans for fiery orange balls, and it's of considerable significance that Colonel Turnbull carries out Whitney's superweapon designs to fruition. The science is incongruous to its time period. American Atheist leader Maddalyn Murray O'Hair often liked to say that we'd have a man on the moon, as early as the nineteenth century, was it not for the church's influence. That's why the science in \"Jonah Hex\" fascinates. The scientifically advanced cannonball hints at the absence of god. This other America has the potential of putting a man on the moon; this other America with its alternative Eli Whitney, presumably has an alternative Leonardo DaVinci, as well.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Could have, and should have, been more fun.  It has some neat visual flourishes, great rock soundtrack,  and Michael Fassbender in scene-stealing form.  However it's shoddily edited, underwritten and lacking character.  Malkovich sleepwalks his way through his role, Fox looks great but is given very little to work with and Brolin is wasted with barely a memorable line.  At 80mins, it's obviously been cut down, with all the violence cut out - it so nearly could have been a guilty pleasure.",
      "total_reactions": 1,
      "user": "grindhouse83"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "All I can say is watch it for yourself.  If you are a fan of Jonah Hex then you won't be disappointed. If you are new to Hex you STILL won't be disappointed. It's a supernatural western (as it's supposed to be) and it's a lot of bad ass gun slingin' action. If you're looking for an Academy Award type western, then this ain't for you. If you're looking for a good western flick with a lot of cool scenes and dialogue then you need to see Jonah Hex.  Fans of The outlaw Josy Wales and The Good the Bad and the Ugly should enjoy this movie just fine. A great movie for folks who like action, Westerns, and some cool lines that you'll actually find yourself looking for a reason to use them.",
      "total_reactions": 3,
      "user": "BroncosOwnYou"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Although JONAH HEX is really short and has terrible acting, the film is quite entertaining and I enjoyed watching it.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "i love the occasional crazy action flick, and this is more than enough crazy to keep me satisfied.",
      "total_reactions": 1,
      "user": "mykhawke"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "Oh, the fun never ceases, john malkovich should play more villians in future, no matter how wooden anyone else is *cough*BROLIN*cough* he always saves almost anything he's in, like nicholas cage, now that i think about it...",
      "total_reactions": 2,
      "user": "flubertubertube"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2012
      },
      "score": 10,
      "text": "i am surprised at the low rating of jonah hex, who doesn't love the odd psycho-western-revenge film, seriously, who?",
      "total_reactions": 1,
      "user": "robertashfield"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "The movie has good scenes and a great performance of Brolin, Hex was really convincing in the movie... What s shame the pilot itself was very low for the character.",
      "total_reactions": 0,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 2,
      "text": "When the creators of Crank announced that they were bringing Jonah Hex to the big screen, no one could of guessed how poorly their execution was. What Schumacher did to Batman & Robin is what they did with Jonah Hex, which had potential to become a series. That idea is now out of the question.",
      "total_reactions": 0,
      "user": "Tdi7457"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 3,
      "text": "I watched this movie on HBO the other day, and after watching it, I thought, no wonder why this movie flopped so badly at the box office (it grossed only 11 million dollars on a 47 million budget). The movie started off okay, but then, it ended up falling flat. It was a total waste of a good cast, and, the dialogue seemed to swim around in cheese. In fact, this whole movie seemed to swim in cheese. So now, Jonah Hex is now in the lot of movies like \"The Adventures of Pluto Nash\", \"Heaven's Gate\" and \"Cutthroat Island\" as one of the biggest flops of all time.",
      "total_reactions": 0,
      "user": "TheAnti360Fox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Its movies like this that just go to prove how many sheep there are in today's societies. I mean, the only negative is really some poor scripting. But everything else about the movie demands a decent score both here and on IMDB. Josh definitely made this movie work, the music was good and everything else just craps all over so many indie movies that people rate up just because they're indie its just prejudice extreme for people to be pouring so much negative over what amounts to a very entertaining flick. I really don't see how the 2015 mad max is really so much better than this movie, they're really very similar and if one deserves raves reviews so should the other.",
      "total_reactions": 0,
      "user": "jetSetWilly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2013
      },
      "score": 4,
      "text": "This movie wasn't quite as bad as the \"experts\" made it out to be but it was still far from a good movie. The action sequences and fight scenes are decent, the acting is good enough, and the character's back story is interesting. The execution of it all is poor and this is one of the few movies where it's nice that it's so short. The movie was about 70 minutes... much longer and it would've stunk. One of the only bright spots is Megan Fox. She always gets a bad rap from the critics for some reason but she's a capable actress that is never the weakest one on screen. She is stunning though and that never hurts. Overall, I don't think this is a story that translates well to the big screen. Talking to dead people, being nearly invincible, and crows helping you along your way may work in the comic books but on film it just feels silly.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Despite the slightly hard-to-follow beginning, the story turned out stylish in its own way (especially the comic-style recap of past events).",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "Some interesting visuals and makeup effects aside, Jonah Hex seems more like an exercise in torture than entertainment.  Even after a sparse 88 minute running time, my soul felt as scarred as Jonah's ugly mug.  While ridiculous and pointless throughout, what really cranks up the dumb is a wooden and mostly-naked Megan Fox playing a tough-as-nails hooker.  Good frickin grief!",
      "total_reactions": 0,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 5,
      "text": "Jonah Hex is not a good movie, simply put. However, it wasn't quite as bad as most people made it out to be. I started out really disliking it, but in the end, I didn't really hate it. As for the issues, there are quite a bit of them, At 80 minutes, the film feels incredibly rushed with how it jumps from one scene to another. The story is so silly that I can't imagine why someone would want to adapt it from a comic book from which it should have stayed. There's not much here to talk about in terms of performances because everybody here is incredibly wooden. With all that being said, it's not awful. However, that doesn't mean it's worth checking out.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 2,
      "text": "You'll come out of the theater laughing and your not supposed to.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 1,
      "text": "The worst movie of 2010.  You would think that a film with Josh Brolin and John Malkovich would be great, but unfortunately this film is only worthy of Megan Fox level acting.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "A soulless supernatural western flick that is gracefully short, but lacks focus, or sophistication with a plot that focuses more on attention to style rather than substance.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "Jonah Hex is absolutely awful - not only is the acting surprisingly awful, but the film itself is absolute torture,  even though it only runs for 81 minutes.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "Wild Wild West meets the Crow... with screeching quasi metal music.  and sadly that about sums it up.",
      "total_reactions": 0,
      "user": "Goose0616"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Was better than expected, not a fan of Megan Fox so I put it off. I did enjoy it though, the story was good.",
      "total_reactions": 0,
      "user": "choomtabi31"
    }
  ]
}