{
  "avg_user_score": 6.5,
  "metascore": 56,
  "mixed_rating_frequency": 78,
  "movie_name": "Joy",
  "negative_rating_frequency": 28,
  "positive_rating_frequency": 123,
  "pro_critic_reviews": [
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 100,
      "summary": "Since Joy is a David O. Russell film, the presence of a) Lawrence and b) bizarre, fizz-popping explosions of catharsis are to be expected. But the ringmaster of The Fighter, Silver Linings Playbook and American Hustle seems to have mellowed a little, which means fewer outright belly laughs, but a more layered and involving emotional landscape."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 80,
      "summary": "It's a banana flambé with extra rum that brazenly throws together folksy storytelling, arch soap opera melodrama and a typically eccentric cast into a golden Hollywood crack at the American Dream."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 80,
      "summary": "Not without glitches but an energetic study of one woman’s refusal to settle for anything less than her share of the American Dream."
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 80,
      "summary": "Lawrence is gritty, real and totally genuine. And, after ‘Brooklyn’ and ‘Carol’, here’s another film that passes the Bechdel Test for proper female characters with flying colours."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 75,
      "summary": "The story is quirky and offbeat but the dialogue and acting set Joy up as an engaging late-year repast."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "Joy doesn’t work entirely, and the structure set up so clearly in the opening sequence is dropped early on for no apparent reason, but I’ll be damned if I didn’t get carried away at the story of a mop sweeping the nation. It’s a lunatic “Mildred Pierce,\" without the murder."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "Joy's entry into the world of entrepreneurship has the crazy trajectory of a rocket gone haywire, and Russell's movie is kind of haywire, too."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "Mostly it’s up to Lawrence to wring all the drama and pathos she can out of a battle over patent rights that pushes Joy to the brink of bankruptcy. No surprise that her mettle cleans up all the messiness in Joy."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s not in the same league as “Playbook” or “Hustle,” but thanks to some memorable set pieces and the best performance by Jennifer Lawrence since her breakout role in “Winter’s Bone,” the sometimes-bumpy journey is worth your investment."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 75,
      "summary": "Playing like a slightly more reflective B-side to the director's greatest hits, his style in this film isn’t for the more cerebral audiences. But for the viewer who relates to family dysfunction, its maddening contradictions and its mercurial tenor, Joy can be painfully funny, engaging and full of relatable heartache."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 70,
      "summary": "The movie, in all its mess and glory, belongs almost entirely to Ms. Lawrence. She is the kind of movie star who turns everyone else into a character actor. This is not a complaint but an acknowledgment of both her charisma and her generosity."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 70,
      "summary": "That the film itself is nearly as chaotic as the clan it examines can either be regarded as an admirable artistic correlative or a crippling defect, but the splendidly dextrous cast ensures that this goofy success story, which could just easily be titled American Hustle 2, keeps firing on all cylinders in the manner of the writer-director's previous few outings."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 67,
      "summary": "An inspirational, and mostly entertaining, saga, Joy is a Horatio Alger story for the 21st century — but who reads those anymore?"
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 67,
      "summary": "Lawrence is terrific at playing tough, as she also demonstrated in her previous outings with Russell, “Silver Linings Playbook” and, especially, “American Hustle.\" But maybe it’s time for her to take a rest from him for a while. There’s a lot more to this actress than bold and brassy."
    },
    {
      "critic": "Steve Davis",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 67,
      "summary": "At its best, Joy celebrates the passage of a demoralized woman who finds the steel in her spine. At its worst, it panders in the name of female empowerment, occasionally delivering moments of pseudo-inspiration that ring so falsely it’s difficult to hear anything else."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 67,
      "summary": "A sunny ode to capitalism, the movie is a coy advertisement of its own. In that context, it's a whole lot better than one might expect, and loaded with talent unabashedly hawking their wares."
    },
    {
      "critic": "Moira Macdonald",
      "publication": "The Seattle Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "While the perpetually charming Lawrence isn’t the worst habit a filmmaker can develop, she’s valiantly miscast here in a story that never quite hits its mark."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "The movie’s a shambles, alternatingly agreeable and aggravating, held together by our interest in its heroine and by Lawrence’s tremendously sympathetic performance."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "What the film truly reveals is something else entirely: how Jennifer Lawrence can elevate any material, any time, even middle-of-the-pack fare like this."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "The 25-year-old supernova (Lawrence) again proves she can do anything, moving from comic to tragic without missing a beat."
    },
    {
      "critic": "Jaime N. Christley",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 63,
      "summary": "David O. Russell proposes that there may be no real barrier between the caustic worldview he wears and the sense of childlike wonder he sells."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "The script feels not half-finished, but maybe three-quarters. Lawrence does what she can to make up the missing 25 percent, but even she can’t perform miracles."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "Joy the movie never cohered, for me, into a story with forward motion. The minute the film begins to find its footing in one tonal register, it switches to another."
    },
    {
      "critic": "Phil de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "Another dazzling Jennifer Lawrence performance anchors a blue-collar parable that boasts some inspired moments but never quite gels."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "I don’t think Russell has ever directed a scene as phony as the one in Joy’s office where she shows her abiding beneficence to a sweet young African-American couple. Equilibrium makes Russell a dull boy."
    },
    {
      "critic": "Peter Bradshaw",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "David O Russell’s Joy is an intriguing but weirdly subdued and stylised film."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "The improvisational flair, unpredictable tonal shifts and overt emotional lurches that highlighted American Hustle and Silver Linings Playbook are here less consistently inspired and affecting, resulting in a heartfelt fairy tale that only soars in spurts."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 58,
      "summary": "Endings have never been Russell's strong suit. This time the beginning also eluded him, and the middle fell into his lap. Joy leaves a feeling of panicked disappointment, as if phone lines are open and nobody's calling."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2015
      },
      "score": 58,
      "summary": "Rough even by Russell’s standards, this grab bag of dropped plot points, visual metaphors, and theatrical cues looks like the underdrawing of a comic drama, only half covered in bright impasto strokes."
    },
    {
      "critic": "Blake Goble",
      "publication": "Consequence of Sound",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 58,
      "summary": "Here’s a film with all the right ingredients and a few too many wrong moves, yet one that’s admirable for trying as hard as it does."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 58,
      "summary": "While [Lawrence] does robust, heartfelt work in the lead in his new film Joy, this is the most miscast she's been in a while, and it's such a strangely imagined film in the first place that it never really gets its bearings."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "From a narrative and cinematic point of view, the problem with Joy is simple. Russell is almost totally uninterested in the story of how Joy Mangano explored a bizarre and unknown new business model and became its first self-made tycoon, and as a result we aren’t interested either."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 50,
      "summary": "The 25-year-old Lawrence is too young – Mangano was 35 when the mop took off – but compelling to watch. Yet in “Silver Linings Playbook,” Cooper, De Niro and Russell all supported her with fine work; here they lie back and make the movie a one-ring circus where she has to be acrobat, bareback rider and clown. That’s too much to ask."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Despite some quite engaging sections, \"Joy\" is, unlike previous Russell films, dragged down more than it is inspired by its chaotic ambience, a film whose variations in tone can't be overcome."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Even Lawrence, in the end, is a letdown. As entertaining and committed as she is — and she’s easily the best thing about Joy — the actress ultimately can’t sell a souffle that’s half baked."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Joy never completely loses its way. But it almost does, and it never quite arrives."
    },
    {
      "critic": "Brian Truitt",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "There’s a Miracle Mop at the heart of Joy, though the movie is such a mess that even it would have a hard time cleaning up."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Russell enthusiasts — and I consider myself one — often applaud the director's abiding interest in the messiness of his characters' lives, most vividly on display in American Hustle, a movie animated by flamboyant dissemblers and depressives. But the disorder found in Joy is a reflection not of any quicksilver dynamics among the actors but of the odd tonal shifts in the film itself."
    },
    {
      "critic": "Matt Singer",
      "publication": "ScreenCrush",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Joy has none of the energy or precision of any of Russell’s recent efforts. Not even Joy Mangano could invent a mop good enough to clean up this mess."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Russell sets out to frustrate, and he does. And Joy never rises above that, an aggravating, un-fulfilling and empty night at the cinema with great actors trapped in an overdue flop from people we were just starting to figure were flop-proof."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Lawrence is very good in the role, as far as the role goes. But the script never jells; the comedy feels forced and mechanically boisterous, particularly in the crucial early passages."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 50,
      "summary": "Despite another solid performance from Jennifer Lawrence, anchoring Russell’s sincerely felt tribute to the power of a woman’s resolve in a man’s world, it’s hard not to wish Joy were better — that its various winsome parts added up to more than a flyweight product that still feels stuck in the development stage."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 45,
      "summary": "This is a rare misstep for Russell, who in the past has sold us on all kinds of stories, whether they’re as indescribable as “I Heart Huckabee’s” or as traditional as “The Fighter.” Unlike his indefatigable heroine, however, Russell just can’t seem to close the deal on Joy."
    },
    {
      "critic": "Leah Greenblatt",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2015
      },
      "score": 42,
      "summary": "If only Russell trusted Mangano’s true story. Instead, he’s turned her life into a over-staged mess of awkward exposition, contrived dialogue, and characters so willfully unreal they feel acrylic."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 40,
      "summary": "Joy is at its annoying worst when it’s clamoring to be antic, and at its brilliantly funny best when Joy and her adversaries — including one played by Bradley Cooper — are deadly serious about business as mortal combat."
    },
    {
      "critic": "Gersh Kuntzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 40,
      "summary": "Joy is joyless."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Verge",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2015
      },
      "score": 35,
      "summary": "Joy has neither comedy nor nuance going for it. Every character feels like a half-sketched first draft, awaiting development that never comes."
    },
    {
      "critic": "Kate Taylor",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 12,
      "summary": "If his direction is erratic, the script he wrote with Annie Mumolo (Bridesmaids) has gaps you could drive a truck through and dialogue filled with painfully obvious exposition of plot, motive and theme."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Joy has a lot going for it that ultimately makes me like it more than not, but it is undeniable that this is a deeply flawed film. For starters, Jennifer Lawrence and the entire cast is phenomenal. Many claim Lawrence did not deserve her Academy Award nomination, but my God did she ever. She was stupendous. Not my favorite performance of the year, but certainly up there. Bradley Cooper and Robert De Niro were also quite good. Additionally, the pacing was fine, the film was always captivating, and the story had some very good comedic moments that had the whole theater in stitches. However, that is about where it ends. Yes, Lawrence's acting is good enough to outweigh everything else, namely the story. The story and the way it was written is deeply flawed. Based on a real woman, I have to assume the real story could not have been that bad that they had to Hollywoodize everything. Not only does Joy's story follow the traditional character arc and story structure a little too well, it just feels so fake. Even more, much of it designed to remind you of how strong a woman Joy is. I get that she is strong and independent, but I do not need a reminder every five seconds. I have no issue with strong women, but a film about one does not need to keep reminding you of such. Instead, it should demonstrate it. However, this is a sin the film commits quite often, as it often tells rather than shows, namely in the form of its narration. Entirely useless, the narration here is a major cop-out and is used solely to have forced exposition and connect scenes together. The script finds ways to get worse, however, as all of the characters are one-dimensional. Real humans do not act this way, let alone ones allegedly based on real ones. In particular, Joy's half-sister seemed to cruel and mean, yet there has to be more to her tale than the film let on. Ultimately, Joy is compelling, funny, and incredibly well-acted by Jennifer Lawrence, but its story handicaps it throughout.",
      "total_reactions": 2,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "This was a really effective infomercial. I can tell the producers definitely tried to add a bit of story and personality to provide a deeper connection between the audience and the mop, which was nice, but they do a pretty good job of just focusing on the mop itself and its many nice features. I am really looking into buying this mop but it is proving difficult to find at the 20$ price the nice blonde lady mentioned in the infomercial. Anyone know where I can order this mop?",
      "total_reactions": 2,
      "user": "Cam75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Jennifer Lawrence made a name for herself by starring in The Hunger Games, and she's easily one of the most recognizable actresses in Hollywood. But what does she do now that The Hunger Games has ended? Her first post-HG project is reteaming with David O. Russell, director of Silver Linings Playbook and American Hussle, which netted her one Academy Award win and two nominations (including Joy). Although Joy wasn't as well-received as their other pairings, it still gives Jennifer Lawrence a movie to carry on her own without a franchise title to support her. Joy is a biographical film about the life of Joy Mangano, the inventor of the Miracle Mop, because evidently she needed a biopic. She grew up in a home where everyone around her had a dead-end job, and her grandmother was the only source of optimism for Joy. By the time she's 30, Joy is a divorced mother of two, working a dead-end job, her parents are divorced but still live with Joy, and her ex-husband lives in her basement. To add insult to injury, her sister constantly humiliates Joy in front of her children. The rest of the film is Joy overcoming these obstacles to become an overnight success with her first invention, the Miracle Mop, and selling the product on QVC. It is one of those inspirational bio-dramas we get a few times a year, but it never feels overly sappy or fake. The real issue is the film's first half which drug on about 20 minutes too long hammering in how much the characters' lives suck. Once Joy makes the prototype for the Miracle Mop and starts her business, the movie's quality picks up immensly. You actually start caring about the characters rather than just saying \"Wow, their lives suck.\" The ensemble cast, which includes Lawrence, Bradley Cooper and Robert De Niro, does typically great work and salvages the movie's slower parts. Joy is definitely one of those movies that you really go see for the cast, but it's often fun to watch Joy's race to the top even if it takes a long time for her to start.",
      "total_reactions": 2,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Walking into Joy, I had very low expectations. But once the film actually starts, all your doubts about the movie vanish. Once again, David O. Russell and Jennifer Lawrence deliver a film that could easily place as one of the best films of 2015.",
      "total_reactions": 1,
      "user": "TheKavehJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I loved \"Joy\" -- It's wonderful. Funny, moving, incredibly well acted. Jennifer Lawrence is terrific. The script is right on the money. Beautifully directed. See it.",
      "total_reactions": 1,
      "user": "mromalley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "This isn't writer-director David O. Russell's best film, but this is not terrible despite it's bland,  but Russell's style is vigorous and Jennifer Lawrence's performance is peppy, together their craftsmanship is splendiferous. Originally Annie Mumolo (\"Bridesmaids\") wrote the screenplay in 2013, so Russell signed on to direct also he selected to write the script, he didn't re-write the script, he wrote his own screenplay and Mumolo got the story credit and produced the film, for Russell got the soul screenwriting credit. Here's a fact for ya!: Kirsten Wiig almost starred in the film as \"Joy\" but Lawrence took her place. Jennifer Lawrence stars as Joy Mangano she is the only sensible person in the family, so she's been running around the household most of her life. Things are now complicated, her father Rudy (Robert De Niro) moves backs in to her house after his second marriage has failed, her mom Terry (Virginia Madsen) who is obsessed over soap-operas and watches TV non stop. Joy's ex husband Tony (Edgar Ramirez) lives in the basement pursuing his favorite dream about being a musician, Joy's sister (Dascha  Polanco) who undermines everything she does. Joy's grandma Mimi (Diane Ladd) who's the only one who has confidence in her. Joy has an inspiration for a mop getting it on the market, so she captures the attention of Neil (Bradley Cooper), who runs a brand shopping network called QVC. Tony and her childhood friend Peggy (Elizabeth Rohm) believe in her. Dad's new girlfriend (Isabella Rossellini) invents in her mop, no one thinks she'll achieve any success. Lawrence is wonderful not only she has the star-making is great but so do the chemistry that she, Cooper, De Niro and O.Russell have together, this is the \"Silver-Lining Playbook\" team's third collaboration together, they all love each other on set you could also tell by Lawrence saying about director David O.Russell  \"I want us to be buried next to each other, I really do.\" O.Russell's script is bland, but I am wowed by Russell's style also Linus Sandgren's cinematography not to mention Lawrence's star-making and charisma. I also thought that the film shouldn't win best picture, but it's really a good film. Grade A",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "This movie definitely is one out of the three best movies released in 2015. Good story different from other movies and wouldn't have been the same without Jennifer Lawrence. No one could pull of the role of Joy better than her!",
      "total_reactions": 1,
      "user": "ahmedimran"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "This movie was excellent. Jennifer Lawrence was excellent in it (she provided a great acting performance). Joy... is filled with pain and overcoming. It's a very inspiring movie to say the least. I highly recommend this sad but beautiful story of the American Dream. It's family, insanity, ruthless business dealings, corrupt people, shameless individuals and it's ...greatness. It's wonderment and Joy... it's educational, relational, hardship and celebration. It's a movie with heart ...it's loss and it's victory (it's the showcase of a woman's will).",
      "total_reactions": 1,
      "user": "CaliColorado"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "I think it's an underrated and under appreciated movie I personally LOVED, like all David O. Russell's previous movies. Russell's vision and the idea of taking something as simple as a mop and use it to tell a story about success, exploring all the aspects that come with it, it's brilliant. Jennifer Lawrence once again delivers an Oscar-worthy performance which was the highlight of the movie and Bradley Cooper is very good. It was nice to see them in this employer-employee working relationship, unlike their previous collaborations. One may critique O. Russell's extravagant and original execution but I feel like this movie will be appreciated more in time for the little gem it really is and the important, powerful messages at its core regarding life, business, success and women's strength, the strength of motherhood.",
      "total_reactions": 1,
      "user": "Thomas94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Though it may be too slow for many, Joy is beautifully shot and wonderfully cast with a very believable script that in no way turns over-used! It may not be for everyone, but it is an inspirational story of one person's struggles and successes in running their own business.",
      "total_reactions": 1,
      "user": "jblum1998"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "This is a terrific film about the human spirit and how against all odds you can sometimes succeed.  The cast are all great here especially Jennifer Lawrence who really gets you to root for this character and her never say die attitude.  David O'Russell does fine work again behind the camera as well.  A",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Jennifer Lawrence barely holds this movie together. Joy has a few memorable scenes but the film suffers from a weak story that isn't all that interesting.",
      "total_reactions": 4,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 1,
      "text": "One of the most boring, awful messes of the year.  Save for a few moments when Lawrence goes off on people when her entire world is threatened, it's not dramatic, it's not funny, and it'sunwatchable.  The entire story is narrated by her alleged grandmother, which makes for the most boring and tedious exposition imaginable.   Joy is this alleged genius inventor, but you never see any of it - it's just told to you.  It's just all over the place, and I couldn't care less about any of them.",
      "total_reactions": 6,
      "user": "5thStFreddie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "《翻轉幸福》主題是一位失業的單親媽媽發明\"魔術拖把\" 並以最基礎的方式成功成為一位企業家的故事",
      "total_reactions": 6,
      "user": "MC_K"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "This movie is joyless for the viewer.  Even the \"happy ending\" is not happy for the character or the audience.  The actors played their parts well but the movie was boring.",
      "total_reactions": 3,
      "user": "Sharonkk2"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "- No Drama + No Comedy - Stakes = Zero Story -",
      "total_reactions": 8,
      "user": "Tone01"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "For the first time this year a movie taps into real humanity, it's irritating and hits you across the face like a raw fish. Takes you on a journey written beautifully. The best script David O. Russell has ever written, I found this far superior to American Hustle. Silver Linings is my personal favourite of his work I hold dear to my heart, but Joy is right up there in spirit. My favourite filmmaker gave me a personal awakening and discovery to maybe something he went through developing his craft. Joy for me is the best movie I've seen this year, it embraces the opposite of what many films including many masterfully made films uphold in that being a perfect balance and mixture of something spectacular. Joy goes the other way. I loved the music, the cinematography and the genuine flow as it plays out. I've been bored this year by film, there's a few I have yet to see but Joy is atop the ranks of one of my favourite movie experiences I've had this decade. Everyone was great in it, I've never seen De Niro so relaxed in a role not typecast for him in a while, it's a O Russell's family at work and it's a world I love delving into. So relatable and I recommend Joy to anyone.",
      "total_reactions": 10,
      "user": "devo-nc"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "I really wanted to like this movie, but there is no other way of putting it. \"Joy\" is a joyless mess. To be fair, Jennifer Lawrence gives a great performance as Joy, but honestly, it's hard to acknowledge her great performance when this movies multiple styles and awkward pace overshadow the main character herself. At one point, it feels like a Scorsese movie, at another point, it feels like it's suppose to be lighthearted. And my God, the pacing towards the last half felt like the fantastic four. A very long first act, no second act, and a rushed 3rd act. There's no clear vision of what this movie wanted to be and the movie made me kind of angry. Overall, there's no point in getting into the story when the movie isn't even sure what it wants to be. I give it a C!",
      "total_reactions": 6,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "We absolutely loved the story and how the story was told. The kooky characters reminded us of certain people in our own family and how people turn to the strong one in the family. Critics don't know what they're talking about because we found the movie to be highly entertaining and inspirational.",
      "total_reactions": 2,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Joy is the true story of Joy Mangano, a self-made millionaire who created her own business empire selling patented products like revolutionary mops through telemarketing. Despite how cheesy and uninteresting that sounds this is an excellent movie.",
      "total_reactions": 2,
      "user": "moviescriticnet"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "With Joy, Russell and Lawrence (and Cooper) ascend to another level as creative collaborators.  Unlike their mixed previous efforts, this film transports the viewer to a destination that cannot be defined by tics, tunes, or tailors.  It’s a destination that can only be measured by the trial, error, success, defeat, and perseverance it takes to survive there – a survival celebrated by the defiant display of the scars earned along the way.",
      "total_reactions": 2,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "The joy of “Joy” is that Jennifer Lawrence is on screen for 95-98% of the time,  otherwise the movie is too busy and has too many unnecessary characters such as the Isabella Rossellini’s role which supplies one way to forward the story but adds a lot of nothing to an expanded role.",
      "total_reactions": 2,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "David o' Russell was sitting in his kitchen at his wit's end. Then he saw his mop...",
      "total_reactions": 2,
      "user": "iseenthefuture"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 1,
      "text": "Who wants to watch a movie about the creator of a mop? Nobody. Don't get me wrong, I'm a big fan of David Russell's previous work, but Jennifer Lawrence has definitely worn out her welcome. Huge snoozfest",
      "total_reactions": 2,
      "user": "coloradosnowman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Good casting but the dysfunctional , eccentric father role played twice a year by Di Nero is getting old. Lawrence and Cooper always good as was Virginia Madsen (didn't recognize her). Nice story about never taking no for an answer, believing in yourself , rags to riches, etc., etc., but it got me wondering how much dramatic license the film makers took. Was Joy Mangano really like that, nice,decent,ambitious woman or in real life, was she obsessed, self involved and irresponsible in her parental duties. Its worth seeing",
      "total_reactions": 2,
      "user": "yosemite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "Joy is the best movie about Entrepreneurship and Family business I have ever seen.  Being in one myself, it is incredibly accurate and plays along the fact that being in business is tough,and it takes a lot of smarts and endurance even to stay afloat.  Joy on one hand is a perfect companion piece to The Social Network, which is essentially the new 'way' of doing business: having an online business, a great concept that attracts a lot of investors.  It is generally the old fashion way: make a great product, know how to sell it and have the guts to manage your business to provide constant returns.  Great...highly recommended and too bad it didn't win any Oscars during its release.",
      "total_reactions": 2,
      "user": "dharma"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 0,
      "text": "I simply do not know what the purpose of this movie was, either in watching it or in making it. Joy tries to tell the story of a woman \"making it\" against odds due to her hard work and \"can-do\" attitude. It tells the story, but it doesn't make the story seem particularly plausible, nor did it make me care.",
      "total_reactions": 11,
      "user": "JoeB777"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "Joy-- it is not. In the kitchen, having the best ingredients available to you does not ensure the success-- if the recipe you are working with is bad to begin with.  That is true also with Joy.  It is blessed with a star studded cast of actors who probably should have run away from this turkey at first sniff, but wait, David O. Russell has had a string of successes, so what the hey!",
      "total_reactions": 5,
      "user": "Pablotee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "My first ever review is happening here and now because I really liked Joy and want people to see it. Because it's funny. The crazy assortment of characters in Joy's family are just a hoot. And since they stand in her way more often than they help her, they give Joy even more obstacles to overcome. But most of all because Joy is inspiring. You want to see her succeed and you don't know how she's going to pull it off, so the suspense carries you along. In addition to a terrific Jennifer Lawrence, De Niro, Rossellini, Virginia Madsen, Edgar Ramirez are all wonderful to watch. If you're looking for some laughs and some uplift to sweep you into the new year, this is definitely one film to catch.",
      "total_reactions": 3,
      "user": "what2c"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "While watching this film, I couldn't help but repeatedly remark to myself, \"What unusual subject matter for a movie.\" To make such a movie work, though, it has to fire on all cylinders, which it unfortunately does not. The movie works in a number of ways (acting, casting, inspirational themes) but drops the ball in others (writing, pacing, staying on point). Had the script and film editing gone through some additional tweaking, this might have been a truly terrific movie, but, as it stands now, it's merely above average. With that said, however, be sure to give sufficient props to Jennifer Lawrence, Isabella Rossellini and Virginia Madsen for great acting turns in their respective performances.",
      "total_reactions": 3,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "I'm always a sucker for any of David O. Russell's films, especially his past couple of collaborations with Jennifer Lawrence, Bradley Cooper, Robert De Niro, etc. So I was really looking forward to seeing this, and I must say that I found this film much more enjoyable than the critics would have you believe. Yes, it's a bit underwhelming compared to O. Russell's last two films, Silver Linings Playbook and American Hustle, but I still really enjoyed it and was entertained overall. Lawrence delivers another headstrong performance. Supporting men, De Niro and Cooper also give worthwhile performances. Overall, I'd say that it's definitely an entertaining and worthwhile film, especially if you're fan of O. Russell or any of his previous films, and also if you want to see him direct Jennifer Lawrence to another great performance.",
      "total_reactions": 3,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Joy the story of a woman that most of the world is completely unaware of and it is kind of random selection for a project. David O Russell and Jennifer Lawrence have already worked together twice so its easy to get our hopes up. I wasn't a huge fan of American Hustle but I could respect it. The real strong side of Joy is the great performance by Jennifer Lawrence. I totally understand the Golden Globe nomination. Joy is by far the most interesting and loveable character in the film and she's very easy to root for as the movie goes and she continues to struggle. Now the main issue with the rest of the cast is that they aren't very likeable. Robert Di Niro and Bradley Cooper are both in this film but sadly they are almost unlikeable. Joy comes from a life of dysfunction and because of that there are times where she is completely on her own. Then there are certainly some scenes that really stand out above the rest.",
      "total_reactions": 3,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "Joy: \"We got here from hard work, patience, and humility. Don't think the world owes you anything because the world owes you nothing\".",
      "total_reactions": 1,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Jennifer Lawrence teams up for the 3rd film with director David O. Russell (“Silver Linings Playbook,” “American Hustle”), this time based on the life and career of Joy Mangano, inventor of the Miracle Mop. There’s irony behind the movie’s title, because there’s almost no joy here. She has a deeply dysfunctional family, an intense struggle with her product and a pretty unhappy life. Russell loves to create characters that are less than likable and put them in situations that challenge them and the viewer. Also, the music choices are often dreadful. There’s no question that he’s an interesting filmmaker, but not always the most enjoyable. I wanted to like the person and the movie, and even though her bio is fascinating, this movie takes too long and is downright unpleasant.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "\"Joy\" stars Jennifer Lawrence, Diane Ladd, Robert De Niro, Virginia Madsen, Edgar Ramirez, Isabella Rossellini and Bradley Cooper. The film was directed by David O. Russell and co-written by Mr. Russell and Annie Mumolo. This is the loosely based story of Joy Mangano, the lady who went from rags to riches via the QVC Network after demonstrating and selling her new invention, a mop that never touches your hands and whose head can be washed in a washing machine. The story is really quite predictable with the other actors playing caricatures in a modern Cinderella tale with a heroine who mops the floor and a stepsister who is her arch rival.",
      "total_reactions": 2,
      "user": "BHBarry"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "Jennifer Lawrence is reunited with director David O. Russell in a semi-biographical comedy/drama based on Joy Mangano and her journey from struggling New York single mom to entrepreneur, inventor, millionaire business owner and powerful family matriarch.",
      "total_reactions": 2,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2016
      },
      "score": 0,
      "text": "Absolutely boring. horrible movie. I couldn't even stand the first 30 minutes of useless scenes that build into more boring useless scenes. I want the time back that I waisted watching as far as I did.",
      "total_reactions": 4,
      "user": "Programming"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "JLaw is very good and no doubt most of the weirdness of Joy the film is intentional but I was left w/ a feeling of Is That All There Is? (which, come to think of it, would have been a cool addition to the soundtrack). Part of the film's problem, overall, might be unintended consequences from oversimplifying the business issues faced by Joy the character, i.e., Do the oversimplifications actually cause greater confusion? All this is especially problematic w/ the patent issues. Patent law is about as complex and tax law. The film 'wants' us viewers to understand it but doesn't really give us much help (maybe it doesn't understand it either). Also, the woman's success story is admirable but at times it feels like it is straining to be political correct. I'm not sure I'm right about most of the above. I am merely setting forth my reservations about this film by a director whose work I'm often crazy about.",
      "total_reactions": 1,
      "user": "John935"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "Escrita y dirigida por David O. Russell “Joy” es un drama biográfico que intenta demasiado ser “la” película de la mujer luchadora. De la vida de Joy Mangano obtenemos la adaptación de sus inicios como inventora, y la lucha que fue llevar el Miracle Mop, su primera invención, al mercado.",
      "total_reactions": 1,
      "user": "MEFzelder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Joy is enjoyable and moves with ease under David O's direction. It isn't among his best work, but is still a nice story with yet another very strong performance by Jennifer Lawrence at the center of it.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "While not as good as David O. Russell's previous films, Joy is still worth watching for Jennifer Lawrence's great performance and some lovely, well-written scenes.",
      "total_reactions": 0,
      "user": "NickLikesMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "In another collaboration with his muse, David O. Russell offers a unique look at a unique story. Despite another formidable performance from Jennifer Lawrence, JOY misses some of that flair seen in Russell's other productions. Still, the film’s atmosphere is enough to make this life’s journey an enjoyable one.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "First of all the film should be divided into three factors: the script, the acting and the work of the director. We all know awesome director abilities of David O Russell so with the performance of Jennifer Lawrence, Robert de Niro and Bradley Cooper. But why there're so lots bat marks? Disastrous scenario. As it turned out, David is very bad writer of screenplays. We could see the same picture in the film Siren and patly American hustle (but there David worked on the script itself is not).",
      "total_reactions": 0,
      "user": "NikitaBrandt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Joy is inspiring, as it should be, to the audience and I believe that was the movie's ultimate goal. A self-ringing mop may not be the most important invention, yet Joy's success and failures resonate with our own lives and our own problems.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Joy is one of those movies that makes you scratch your head. On the one hand it is done by talented people and you can see the bones of a good story. But it is basically like a first draft that somebody decided to shoot anyway.",
      "total_reactions": 0,
      "user": "AliceofX"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Joy is a well made film if you look at it purely as a charter piece mainly because of Jennifer Laurence's performance which is the best part of the film. however it does kind of fall down when you look at it any other way and the last third of the movie has pacing issues however it's not enough for me to dislike the film because this was much better than i was expecting it to be",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "I love Jennifer Lawrence and Bradley Cooper in pretty much every movie I've seen them in.  Unfortunately they end up being the only likeable characters in the movie.  With the exception of Joy's ex husband who redeems himself by being her friend when she needs someone who isn't trying to stab her in the back.",
      "total_reactions": 0,
      "user": "MusicMovesMe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "I wasn’t too interested by the trailer of Joy but after watching a small featurette of it on TV I became interested in it due to the directors emphasis on “making interesting and strong characters”.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Jennifer Lawrence and Bradley Cooper deliver typically brilliant performances in an otherwise mess of a film that works in parts but not at the full sum.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "Pues es la típica historia de que todos los sueños se pueden cumplir en Estados Unidos, contada con el contraste de la dura realidad y el drama de telenovela, sin embargo aunque las actuaciones son buenas y creíbles pues no me conectó, no se si quedé con la impresión a que Jennifer Lawrence no me cuadró para un papel de una mujer mucho mayor a ella, o el hecho que de que le falto algo más de emosión o sentimiento.",
      "total_reactions": 0,
      "user": "raultrivino"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Joy's not a joyful ride, but it kinda works for being decent and all. There's like so many things you could like do to enjoy Joy without falling into any bait from fooling you. Take Joy as a happy movie.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "Joy as the new movie of David O. Russell stays far behind from his previous features. The major topic that treats is basically the same, it’s a lost protagonist defeated by life, with a family behinds trying to control him and, of course, living throw him too. All these set in the slums, because is from the director’s belief that those environments bring out the worse of all people in order to survive. And the parade starts with Joy Mangano, a single mother, with an inventor mind that carries with a parasite family, sucking her life that won’t stop until there’s nothing left. She is accompanied by a mother stuck watching an endless soap opera, all day long; a failed father with anger and trust issues; an immature ex-husband that lives in her basement; and a jealous sister with nothing to lose. The problems of the film begins when that family is moved aside in the story and we see nothing but the protagonist fighting for her dreams, although is impressive the real struggle of Mangano, seeming like a melodrama; the seal of this director is how he manage to have a big group of people floating around a person trying to move on. That’s when the viewer notices the power of the family and its deepest thoughts that scares you and makes you feel trapped. David O. Russell is marvelous directing actors, Jennifer Lawrence certainly captures the director idea for her performances and the family is, ones again, well achieved.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "\"Joy\" was a very good movie , but at what little was much drama and without feeling a touch of comedy , the only thing salvageable was Jennifer Lawrence again broken, with the feisty woman telesales and his performance was very good I get excited much.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "If you've known someone who's been in debt and unable to pay and provide for their family then you'll connect with Joy. I felt sorry for her in her lowest moments and Jennifer Lawrence was really good in the role.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "Joy is an overall decent movie that starts out sort of badly. The first portion of the film is lively and well shot but oddly uninteresting. Once the mop comes into the film though, the movie begins to take off. From that point on the movie is almost never less than solid and occasionally more. You really do root for Joy to succeed and become frustrated at the obstacles set in her way. Lawrence gives a decently engaging performance ,although it's not her career best in my opinion. It's not nearly as consistent as American Hustle or Silver Linings Playbook which were both invigorating their entire runtimes and some of the best movies of the past decade but it's still worth watching if you accept that it takes a while to cohere into an interesting story.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "What a rags to riches story!  Is it all true?  Mostly true?  Joy comes from the ultimate dysfunctional family.  To see where she came from to where she ended up is a miracle.  Unfortunately, the making of the movie did not thrill me, no matter how great the story of Joy.  The movie is over 2 hours long, maybe some editing would have made it better.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "Joy is better than I expected and I honestly wasn't expecting much. The plot itself was kind of boring, I must admit, but the powerful performance given by,Jennifer Lawrence made me care for Joy and feel sad for her. Bradley Cooper is like in almost every Jennifer Lawrence drama movie but in this film, he did a really good job and I actually understood his part in the film. It's based on a true story so it might be boring plot wise, but I was entertainined at some of the scenes. I felt the director did a very great job especially in the scenes in where there was silence and Joy was angry because I could feel some of the tension. Solid movie that has a powerful message. (73/100)",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "A small accident can lead to a great achievement, but difficult path is certain.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2016
      },
      "score": 9,
      "text": "Except for the one 100 professional review, I'm amazed at the other pro reviews.  Wha' hoppen??? This is the most beliveable story of feminine self-empowerment based on character within my memory.  This is the most emotionally layered movie since Silver Linings Playbook in my memory and this is better, as other reviewers suggest.  These are two or three of the best-written female roles in years.",
      "total_reactions": 0,
      "user": "HealingToolbox1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "The relationship dynamics in this movie are different, and it is obvious from the start.  Tony (Edgar Ramirez) is Joy's ex-husband who lives in the basement and has an undying loyalty to her; Mom is obsessed with relating to life through soap operas; Her Dad (Robert DeNiro) has a new girlfriend who returns him to his family (\"You can have him back, Terry, I don't want him anymore\").",
      "total_reactions": 0,
      "user": "gemmapartlow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "Oh merde, Jennifer Lawrence et Bradley Cooper, les abrutis réunis, lui le charisme d'un frigidaire à la casse, elle sa tronche bizarre un brin mongoloïde et sa nullité de jeu qui irradie de tous ses pores comme un cri à la face du monde \"faites quelque chose, je suis nulle à chier, aidez-moi\". Seulement, même en détresse la pouffe, on a juste envie d'une chose : lui enfoncer la tête dans un seau.",
      "total_reactions": 0,
      "user": "Broyax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "Though it takes a while to get to the heart, Joy delivers with swells of emotion. Lawrence plays the part of entrepreneur with steely resolve, going to low lows and high highs. After it gets off the ground, portraying the complicated life of a divorced mother with children, the picture strives to drive home the point of an indomitable spirit. The low-scoring critics seem to have more questions of the story as a whole as if they're upset that this semi-biopic isn't a novel they can study. But I found myself on board, delighted with the unique scenarios and the unlikely subject material that landed plausibly.",
      "total_reactions": 0,
      "user": "Scraper"
    }
  ]
}