{
  "mc_avg_user_score": 3.6,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 1,
  "mc_movie_name": "Judy Moody and the Not Bummer Summer",
  "mc_negative_rating_frequency": 15,
  "mc_positive_rating_frequency": 7,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2011
      },
      "score": 80,
      "summary": "A young Aussie actress who seems as all-American as a Magic 8 ball, successfully walks the tightrope from precocious to exuberant, never once falling into obnoxiousness. That could describe this crackerjack of a kids' movie as well."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 63,
      "summary": "Judy Moody has some enjoyable ingredients. The cast, for instance, rocks it, especially young Aussie actress Jordana Beatty as the title character, a bottle rocket with unruly red hair."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 60,
      "summary": "The whole film is a celebration of messy, colorful, vigorous creativity, echoed in Cynthia Charette's gloriously cluttered hodgepodge production design, with barely a product placement in sight."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 58,
      "summary": "A nice but unnecessary movie for small children who can find the same level of entertainment on kiddie cable networks."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Mosteller might be the movie's real discovery. He twists his lisp and slurry speech around the dialogue in a way that exudes far less attitude than the kids."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "A film that little kids might find perfectly acceptable. Little, little, little kids. My best guess is, above fourth-grade level, you'd be pushing it."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "Not that anything in Judy Moody is meant to be taken seriously - or could be, even if it was meant to - but even for sugary neon fluff, it's awfully lightweight."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "A mild-mannered kids' comedy that makes for a pleasant-enough time killer."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 50,
      "summary": "The film wants to put on screen the sense of random play and concentrated games that fill a child's world for a few summers. In this it succeeds, but the film does not welcome others who might still retain memories of those NOT bummer summers."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2011
      },
      "score": 42,
      "summary": "The lesson is that fun can't be planned, but the film is so airless (think iCarly as a videogame) that there isn't a truly playful moment in it."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The story is a grab bag of only-in-the-movies kid problems and ridiculous adult behavior."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "The books' ingenious wunderkind is MIA here, replaced instead by a generic eye-rolling, motormouthed preteen bopping around rote set pieces."
    },
    {
      "critic": "John P. McCarthy",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "This ho-hum offshoot of Megan McDonald's book series earns negative \"thrill points\" as it chronicles the mirthless backyard shenanigans of a suburban Pippi Longstocking."
    },
    {
      "critic": "Lael Loewenstein",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 40,
      "summary": "Picture comes off as an exaggerated slapstick romp rather than the breezy, affecting tale of an 8-year-old tomboy it might have been."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "Though the lead actress, newcomer Jordana Beatty, gives a spunky performance as third-grader Judy, her character's borderline bratty charm wears thin fast. Mostly it's undercut by the movie's irritatingly antic slapstick style."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 38,
      "summary": "With summer comes theaters filled with superheroes, sequels and forgettable family fare. In the last category, we find Judy Moody."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 30,
      "summary": "Although I'm generally a fan of movies that choose to star girls (of any age) as their lead subjects, Judy Moody and the Not Bummer Summer simply strikes the same whiny chord over and over."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2011
      },
      "score": 30,
      "summary": "Shrill and charmless. I didn't believe a word of it. I wanted to spank it and banish it to its room."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2011
      },
      "score": 30,
      "summary": "The incessant tumult drowns out any real message for the kids - or pleasure for their parents. It's a film so obnoxiously frantic that its most restrained element is a banjo-strumming elementary school teacher played by none other than '90s tween-mugging icon Jaleel \"Urkel\" White."
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "Brings on a wave of nostalgia accompanied, unfortunately, by a great big yawn that will surely be experienced by parents hoping for a spark of irreverence à la Pippi or the broad comic appeal found in most theatrical family fare these days."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "It looks like an exploding art project - but fails to capture the books' childlike voice and charm."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2011
      },
      "score": 25,
      "summary": "Kitsch sprung from the lame imagination of adults who probably wish their tweeners lived their lives like Judy Blume characters."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2011
      },
      "score": 12,
      "summary": "The mystery is why the filmmakers thought third-graders or anyone else would be willing to pay for this master class in tedium."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2011
      },
      "score": 6,
      "text": "Cute kids' comedy plays like a more girl-centric version of Diary Of A Wimpy Kid, as plucky young Judy Moody (Jordana Beatty) sees her big plans for summer break go down the drain when her two best friends wind up going out of town for the summer.  Things look up when, inspired and aided by her free-spirited Aunt Opal (Heather Graham), Judy comes up with a wacky list of dares and adventures to be undertaken by both her and her faraway friends.  Nothing hugely original here, but Beatty (an Australian actress doing a flawless American accent) is appealing, Graham is tremendously sexy and loveable, and in one of the more surprising bits of casting this summer, Jaleel White - yes, I'm talking iconic TV nerd Steve Urkel - is genuinely charming as Judy's teacher.  I know the reviews are crummy and the Megacritic scores reflect that, but I'd take this over Mr. Popper's Penguins or (God help me) Transformers: Dark Of The Moon any day.",
      "total_reactions": 2,
      "user": "Winstonoboogie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2011
      },
      "score": 1,
      "text": "I took my neice to see this, it was the worst movie i have ever seen in a long time. Why are the vast majority of films that are being released nowadays sucking so bad?  It was horrendous. Even my 8 year old neice hatted it.",
      "total_reactions": 2,
      "user": "PinkFloyd4ever"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "I enjoyed LeahAndNic's review. Right on. I saw it with a full house opening week - and, while I would have enjoyed a few more quieter, less frenetic moments in the film - it thoroughly entertained the kids - and adults - in the audience - including me.  The CG graphics were a fun nod to a world-gone-gamified - and, aside from some unnecessary fixation on poop jokes (of course, getting some of the best \"ewwws!\" and laughs from the kids), the film provided a playful romp with decent messages.  Loved that Aunt Opal is a walking creativity-maven.  And if this film gets kids reading the book series it was based on, that's not such a bummer summer either.",
      "total_reactions": 2,
      "user": "fablepaul"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I get confused by critics and their reviews of kids movies these days.  I'm not a huge fan of them myself.  So I stay away from discussing them in terms of rating other than good or bad.  But with such overwhelming negative reviews I thought I would jump in.",
      "total_reactions": 3,
      "user": "LeahAndNic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "Judy moody is a fun,exciting,and funny movie. It's great for kids. I love the movie and I am sure you will too! It so creative and wonderful. It's and exciting adventure through Judy Moody's summer. They are such good actors and actresses. Just watch it! It might even give you some ideas for the summer. The only thing that you might want to worry about but maybe not is that they say a word that you might or might not consider a curse word.",
      "total_reactions": 1,
      "user": "Angelle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2012
      },
      "score": 0,
      "text": "One of the most terrible movies ever!. The Judy Moody books are really cool, and funny, when Relativity Media do the announce of this movie, I think: wow, great idea. But what happen? This movie is a big disaster. The story is really stupid, and the development is slow, strange, stupid, is like a freak show. The performances are horrible, any have a great moment. Judy Moody and the Not Bummer Summer is one of the worst movies of the last year.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2016
      },
      "score": 1,
      "text": "one of the most worst adaptations of a beloved children's series ever do not watch it as you will regret it if you like the books stick to the books just dont watch this movie",
      "total_reactions": 0,
      "user": "UNARMED_JORD"
    }
  ]
}