{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 32,
  "mc_movie_name": "Julie & Julia",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 126,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Sorry for the translation, is mechanical. Thank you.",
      "total_reactions": 1,
      "user": "RONGIU"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh",
      "total_reactions": 1,
      "user": "2GUI2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "In this movie Meryl Streep drives us to the concept of cooking with the same charisma than Remy in Ratatouille, but this time with a lady who is not afraid of what people will think. Marvelous.",
      "total_reactions": 0,
      "user": "SteveMartin97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "I loved this film. Meryl Streep is utterly brilliant in it, and completely believable as a cook and cookery writer. I do have 3 slight reservations about cast and script tough.",
      "total_reactions": 0,
      "user": "olympians"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "Meryl Streep has been the unopposed Queen of the Screen for 3 decades - the interest in her movies is as much to see her sculpt a character as it is to see the movie itself.  Julie and Julia did not disappoint, with regard to Meryl - she was fantastic, as always.  Instead of a movie intertwining two separate plots, I viewed two completely different movies.  Ironically, I rooted for Julia Child, already knowing her life's outcome and really could not have cared less about the Julie Powell, the Amy Adams character, I knew nothing about - the whiny, somewhat unlikeable character.  The movie boils down to, simply, a tribute to a beloved \"character\" for generations....Julia Child.",
      "total_reactions": 0,
      "user": "moviemonger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "It's not just some of the food featured that's light and fluffy, but rather the context of this film. That's not to say Julie & Julia is a bad movie but if you were looking for a more serious and somber biopic then you may have to look elsewhere. The acting is marvelous with Meryl Streep the standout, however that is to be expected by now. I do have another bone to pick though and it relates to the feeling that there's two features in one. I perhaps would have rated this flick much higher if the Julie Powell storyline was wiped altogether.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "Streep brilliant portrayal of Julia Child aside, Julie & Julia is a foodie with a twist. Nora Ephron beautifully paints two different lives and perspectives to create one fascinating story.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Julie & Julia is a mostly average film, but the reason I rate it so high is because it is teeming with the joy of life. Bolstered by a brilliant lead performance from Meryl Streep, but also by Amy Adams who does a lot with very little, the film manages the capture the spirit of these women. Sweet, charming, well-done, and entertaining, J&J; is a film I'd recommend to anyone and everyone.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2016
      },
      "score": 7,
      "text": "Making a film based on a blog may not sound like the most interesting idea in the world, and it might be a turn-off for many filmgoers, but somehow, \"Julie & Julia,\" what is apparently the first major motion picture based on a blog, is pretty entertaining. It decently mixes two plots together, has some interesting charm to it, and it's well-acted (Meryl Streep steals the show as Julia Child). It's not the most brilliant film you'll ever watch, but it's sweet, light, and fun, and overall, worth watching.",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2016
      },
      "score": 6,
      "text": "This film could have been so much better as just a portrayal of the life and times of Julia Child. Amy Adams portrayal of Julie Powell (which is the centre of this film) is flat, boring and lifeless.",
      "total_reactions": 0,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "this is quite interesting film about two woman who are trying to be the perfect cook and there so passinate about cooking . i kinda made me hungry . Meryl Streep was  a passionate actress when he deciding to be in this film so did amy adams",
      "total_reactions": 0,
      "user": "lukechristiansc"
    }
  ]
}